{
  "metadata": {
    "last_updated": "2026-02-08 03:39:58",
    "time_filter": "week",
    "subreddit": "digital_marketing",
    "total_items": 20,
    "total_comments": 188,
    "file_size_bytes": 171032
  },
  "items": [
    {
      "id": "1qulkil",
      "title": "What AI marketing use case worked in production really well?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qulkil/what_ai_marketing_use_case_worked_in_production/",
      "author": "Mysterious-Age-4850",
      "created_utc": "2026-02-03 07:27:07",
      "score": 44,
      "num_comments": 23,
      "upvote_ratio": 0.95,
      "text": "Hi all- I am constantly seeing marketing AI tool talks everywhere from reddit to my linkedin feed! I obviously use ChatGPT but me and my team haven't been heavily using AI otherwise.\n\nȘo genuinely curious, have you tried other AI marketing use cases in production? If so, what AI marketing use case worked in production really well?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qulkil/what_ai_marketing_use_case_worked_in_production/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3azjke",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 07:27:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3b2mbk",
          "author": "StandardNecessary218",
          "text": "We were paying an agency for both SEO and writing blogs and content for our website to improve our Google ranking! Since then we have been able to using AI tools like Frizerlly to train AI on our business, product and search data to automatically create blogs on our website daily based on this! Results are comparable at this point! Similarly, we used to hire contractors to manually DMs on LinkedIN to our ideal customers and get them to schedule a demo with our team! Now AI tools are able to fully automate this process!",
          "score": 10,
          "created_utc": "2026-02-03 07:55:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3b4jnv",
          "author": "insidelightcone",
          "text": "Conversation intelligence tools have been the biggest win I've seen on the marketing side - specifically using call recordings to extract actual customer language for landing pages and emails. The difference between how your team describes value vs how customers describe their problems is huge, and AI can now surface those patterns across hundreds of calls pretty quickly.\n\n  \nThe other one that's worked well: AI-assisted content repurposing. Take one webinar or long-form piece and have it generate social snippets, email angles, etc. Still needs human editing but cuts production time significantly.",
          "score": 3,
          "created_utc": "2026-02-03 08:13:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bw7f3",
          "author": "Russ915",
          "text": "Honestly I’ve used it to save time on tasks I hate like reconciling billing and other administrative tasks. Ive used it for copy and landers too but they never quite get exactly what I want there so need more tweaking",
          "score": 2,
          "created_utc": "2026-02-03 12:22:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f2veh",
          "author": "KNVRT_AI",
          "text": "Most AI marketing tools are ChatGPT wrappers with interfaces. Real production wins come from integrating AI into existing workflows, not standalone tools.\n\nEmail subject line optimization using AI to generate variations then A/B testing them performs well. Tools like Seventh Sense or native ESP features help with this.\n\nAd copy generation at scale for testing. Generate 20 headline variations, test them, double down on winners. Saves time versus manually writing every variation.\n\nContent repurposing where you take one piece, use AI to create social posts, email snippets, different formats. Speeds up distribution without sacrificing quality if you edit outputs.\n\nCustomer support chatbots that actually work handle common questions, free up human agents for complex issues. Intercom and Zendesk AI features do this decently.\n\nPredictive analytics for lead scoring or churn prediction. AI models trained on your data identify patterns humans miss. Built into HubSpot, Salesforce, or custom with data science teams.\n\nPersonalization at scale in email or web content. Dynamic content blocks adjusted per user segment based on behavior. Tools like Dynamic Yield or Optimizely use AI for this.\n\nOur clients see best results using AI for high volume repetitive tasks that benefit from variation, copywriting, image generation, data analysis. Not for strategy or relationship building.\n\nThe production wins are incremental efficiency gains, not revolutionary changes. 20% faster content production, 15% better email performance, slightly better targeting.\n\nWhat doesn't work well is using AI for anything requiring deep business context, brand voice consistency, or strategic thinking. Outputs are generic without heavy human oversight.\n\nChatGPT for drafting is table stakes. Beyond that, focus on tools that integrate with platforms you already use versus adding new standalone AI products.\n\nTesting frameworks matter more than AI tools. Generate variations with AI, test systematically, scale winners. The AI part is easy, the discipline of testing is what drives results.\n\nMost teams overestimate AI capabilities and underutilize what they have. Master using ChatGPT effectively for your specific use cases before buying specialized tools.\n\nThe honest answer is AI helps with execution speed and variation generation but doesn't replace marketing fundamentals. Use it to do more of what already works, faster.",
          "score": 2,
          "created_utc": "2026-02-03 21:45:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3chwwd",
          "author": "PeopleLoveAI",
          "text": "yo, most people think of AI for copy or seo stuff, which is cool, but for me, the biggest win in production has been for ad creatives. especially static ads. the constant need for new creative variations to beat ad fatigue and keep cpms low is a huge bottleneck for most performance marketers. i used to spend so much time just making slight changes or new hooks in canva or photoshop. with AI, i can now generate dozens of high-quality static ad variants in minutes, ready for testing. this completely changed my testing velocity and overall ad performance.\n\n\n\nthats actually why i built trydooken(.)com, because i personally needed a tool that specifically solved this creative production issue for static ads. it's been a game changer for keeping our campaigns fresh and performing. if creative production is a bottleneck for you, i'd definitely look into AI for that.",
          "score": 1,
          "created_utc": "2026-02-03 14:30:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cpp5h",
          "author": "Pure_Data3489",
          "text": "After testing a bunch “AI for marketing” ideas,  most didn’t survive contact with real clients.\n\nThe ones that *actually* work  are:\n\n• **AI-assisted ad testing** \\--using AI to generate multiple ad angles/hooks *from real past winners*, not from scratch. Reduced testing time a lot.  \n  \n• **Content repurposing pipelines** \\--long-form → emails → LinkedIn posts → short scripts. N\n\nI’ve been documenting such AI  use cases for agencies . Happy to share more if anyone’s interested.",
          "score": 1,
          "created_utc": "2026-02-03 15:10:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3da6rj",
          "author": "nrseara",
          "text": "Concierge agent bot expert in our business to guide them through whatsapp over our main transactional flows",
          "score": 1,
          "created_utc": "2026-02-03 16:47:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gm8ii",
          "author": "Low_Dragonfly2677",
          "text": "AI-powered content optimization and SEO (using AI to analyze search intent, optimize pages, and continuously improve rankings) has worked extremely well in production because it delivers measurable traffic and conversion gains without disrupting existing workflows.",
          "score": 1,
          "created_utc": "2026-02-04 02:42:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3h3eda",
          "author": "KONPARE",
          "text": "For us the stuff that actually “stuck” in production wasn’t flashy.\n\nAI for support and sales enablement was the biggest win: turning call notes and tickets into clean FAQs, objection answers, and reply templates, then humans just tweak and send. Also ad and landing page iteration, generating variants fast and testing them, not publishing raw output.\n\nEverything else (full autonomous campaigns, “AI decides the budget,” etc) has been hit or miss and usually needs more babysitting than people admit.",
          "score": 1,
          "created_utc": "2026-02-04 04:26:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3o2r5e",
          "author": "nicinionly",
          "text": "Yes- TBH very effective and cost cutting for marketing.",
          "score": 1,
          "created_utc": "2026-02-05 05:23:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ooey1",
          "author": "Pitiful-Bowler3282",
          "text": "Ok see for marketing everyone thinks ChatGpt is best but no\n\nClaude is better than Chatgpt for content writing or script writing because of its Skill feature\n\nOne just needs to set a claude skills for content writing and it will give 10x better script than chatgpt",
          "score": 1,
          "created_utc": "2026-02-05 08:32:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pxu1w",
          "author": "morales_markets",
          "text": "we've got tons of marketing tools, if you're interested in marketing this just send me a DM :))",
          "score": 1,
          "created_utc": "2026-02-05 14:20:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q0xji",
          "author": "Background-Pay5729",
          "text": "Using it for creative variations in Meta ads has been the biggest win for us. It is not about letting the AI write the whole strategy, but taking one solid hook and spinning out 20 variations to test against different audiences.\n\nIt saves hours of manual work and usually performs just as well as human-written secondary copy. Just make sure someone actually vets the output because it still hallucinates weird brand claims sometimes.",
          "score": 1,
          "created_utc": "2026-02-05 14:36:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vlwgl",
          "author": "Jyoti90",
          "text": "We have seen AI work best when it supports existing workflows instead of replacing them. In production, the most useful use cases for us have been content ideation, ad copy variations for PPC, basic SEO analysis, and quick audience research. It helps speed things up and test more ideas, but human judgment still matters a lot.\n\nAt Bonoboz, we use AI as a support layer in marketing execution, not a shortcut. When combined with clear strategy and real data, it actually saves time and improves consistency rather than creating noise.",
          "score": 1,
          "created_utc": "2026-02-06 10:11:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vrs2d",
          "author": "lildaisysummers",
          "text": "I just switch between gpt and claude",
          "score": 1,
          "created_utc": "2026-02-06 11:04:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wjb7y",
          "author": "SlowPotential6082",
          "text": "Email marketing production is the one that's worked best for us in actual production, not just as a cool demo.\n\nSpecifically: we were spending 2-3 hours per email campaign between copywriting, designing in Figma, coding the HTML, testing across email clients. Now with Brew (which I'm building) we describe the campaign goal, it generates the complete email - copy, on-brand design, responsive HTML that actually renders in Outlook. Takes about 10 minutes including review and edits.\n\nThat's not a marginal improvement, that's a workflow that went from half a day to half an hour.\n\nOther use cases that actually worked in production for our team:\n\n- Subject line variant generation for A/B testing. Instead of me writing 3 variants, AI generates 15 and we test the top 5. Measurably better open rates because we're testing more options.\n\n- Send time optimization. Letting the ESP pick optimal delivery times per subscriber based on their past engagement. Small lift but completely free and zero effort.\n\n- Meeting transcription to action items. Not marketing-specific but we use it daily. Saves probably 20 min per meeting.\n\nUse cases that did NOT work in production:\n\n- AI writing blog posts. Output was mediocre and we spent more time editing than if we'd written from scratch.\n\n- AI ad creative generation. Everything looks generic and stockphoto-ish. We went back to human designers.\n\n- \"AI marketing strategy\" tools. Vague outputs that anyone with basic marketing knowledge already knows.\n\nThe pattern I've noticed: AI works when the output format is constrained and well-defined (emails, subject lines, data analysis). It fails when the output needs genuine creativity or strategic thinking.",
          "score": 1,
          "created_utc": "2026-02-06 14:06:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41kl4h",
          "author": "Sea_Case9426",
          "text": "I think most of the workflow tools are not worth it, chatgpt, claude and perplexity is fine.",
          "score": 1,
          "created_utc": "2026-02-07 07:05:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qsrb0w",
      "title": "reddit marketing agency - any saas focused ones?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qsrb0w/reddit_marketing_agency_any_saas_focused_ones/",
      "author": "0ctaviusRex",
      "created_utc": "2026-02-01 06:53:21",
      "score": 40,
      "num_comments": 110,
      "upvote_ratio": 0.94,
      "text": "I need to vent a little here but also ask for some help because I'm at my wit's end with marketing.\n\nI'm a solo dev running a SaaS that helps local service businesses (think cleaning businesses, plumbers, etc) streamline their hiring process. Before using my product, these businesses have 0 processes in place and after they are able to hire in about half the time.\n\nI have been able to grow to 1.3k MRR by providing helpful posts and comments in local service specific subreddits but have hit a wall with my account being shadow banned and comments removed (even when they were genuinely helpful). Reddit has my customers but I can't seem to reach them effectively.  \n\n\nI am looking for a reddit marketing agency that understands reddit much more than I do and helps SaaS businesses specifically. Unsure of how these services are priced so any clarity there would be great as well.",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qsrb0w/reddit_marketing_agency_any_saas_focused_ones/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2xj5lc",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 06:53:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xiwlg",
          "author": "Relative-Courage-377",
          "text": "I had exact same issue and by using Reppit AI I got lot of conversions! ",
          "score": 11,
          "created_utc": "2026-02-06 16:59:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ioblc",
          "author": "Electronic-Ad9854",
          "text": "I know about Red⁤accel. Chatgpt reccommended them when I was researching reddit marketing agencies for my tool. Didn´t try it yet, but looks promising.",
          "score": 6,
          "created_utc": "2026-02-04 12:23:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xofv3",
          "author": "pmagi69",
          "text": "I would like to know what you did to be shadowbanned. Did you copy-paste the same post or comment a lot of times?",
          "score": 3,
          "created_utc": "2026-02-01 07:40:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2y471y",
              "author": "rahulroy",
              "text": "Would like to understand this as well. Reddit has always been sensitive about marketing and spam, and lately it feels like a lot of subs are pushing back harder.\n\nRecently, I was heavily downvoted just for participating in the discussion. My comment wasn’t promotional at all. I only mentioned that I’m a builder in the relevant space to add context and share a builder’s perspective.\n\nHonestly, it was one of the most unwelcoming experiences I’ve had on Reddit, which was surprising given that the thread was meant to be a discussion.\n\nI think, reddit is onto builders and they might want to push people towards paid ads.",
              "score": 5,
              "created_utc": "2026-02-01 10:06:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2yf54h",
                  "author": "pmagi69",
                  "text": "Yeah, well, it's not really Reddit. It's mostly the users that are sensitive. And of course you can get banned, but that is usually from a subreddit. And then you can also be banned from the whole of Reddit. I don't really know how that works. That's probably heavy abuse. So yeah, I would love to have a link to see where you get all the downvotes. It's interesting to see that.",
                  "score": 1,
                  "created_utc": "2026-02-01 11:44:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3xj5z5",
              "author": "Relative-Courage-377",
              "text": "Warmup your account before posting too much, there are tools like Reppit AI to set up everything correctly.",
              "score": 1,
              "created_utc": "2026-02-06 17:01:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vrw16",
          "author": "lildaisysummers",
          "text": "fansleads.co. I like them, they are very friendly! ",
          "score": 3,
          "created_utc": "2026-02-06 11:05:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xrksi",
          "author": "Murky_Maximum1472",
          "text": "I had a similar issue when trying Reddit ads. For us, Google Ads worked better initially, then we tested Reddit once we understood the audience…",
          "score": 2,
          "created_utc": "2026-02-01 08:09:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xy0su",
          "author": "Appropriate-Age-5790",
          "text": "The good ones focus on trust-building, organic discussions, and long-term presence ",
          "score": 2,
          "created_utc": "2026-02-01 09:09:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o319k1j",
          "author": "Quiet_Blackberry7493",
          "text": "Okay understand that Saas audience is one of the biggest and oldest on reddit which also makes them vulnerable to spam and bot comments, so it's understanable why these communities are highly skeptical and smell promo stuff from miles away, I run organic campaigns for a lot of different industries here, and out of all the industries that I work with, SaaS was def a league of its own in terms of complexity and getting the tone right but you see once I understood the language they speak, and studied a lot of examples on how saas brands operate here, I figured it out. \n\nSo if you want to do that, go through company run subreddits and see how founders speak to their audience, for example one of fave subreddit is r//framework they have done a great job at building a community here, spend time understanding one subreddit at a time and get familiar with no intent of promotion till you are an established member of the sub, only then will it be easy to not be downvoted, also dont comment rapidly that's one of the reasons u get labeled as a bot and potentially shadowbanned. \n\nIf you are aiming for reddit organic then be prepared to spend a few months building visibility, it's long but it has compunding returns, u just gotta be patient. And if you are getting DMs from reddit agencies please evaluate them carefully cuz anyone promising quick results will get your domain or brand name banned from the whole platform, understand their approach well before deciding, most of my clients get burned when they get promised leads and visibility in a month and have their whole domain banned on here cuz of the agency's spam acitivtity.",
          "score": 2,
          "created_utc": "2026-02-01 20:36:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37r4nw",
              "author": "RedditforBusiness",
              "text": "Your first observation is actually a really important thing to note when it comes to understanding B2B SaaS on Reddit. We share insights on how Reddit operates from an organic community perspective (be genuine, form long-term community relationships on a human level, be helpful) but the history of the audience also very much matters.\n\nAnd with that, like you're saying, being a valuable and insightful member of the community is the most important aspect of this field, first and foremost. The regular interpretations of driving sales with common tactics you see on social media don't apply the same way on Reddit, and setting that expectation is key to measuring your success in a timeframe.",
              "score": 2,
              "created_utc": "2026-02-02 20:02:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o31bp4x",
          "author": "Impossible-Double-53",
          "text": "Totally get this — Reddit is a weird beast for advertising. What’s worked better for me (also SaaS) is treating Reddit less like an ad channel and more like a research + credibility channel. We focused on genuinely answering questions in niche subs, then paired that with Google Ads for high-intent traffic.\n\nIf you *do* want paid, Reddit Ads can work but only with very tight targeting and non-salesy creative. Facebook/LinkedIn were more predictable for us. I haven’t found many Reddit-marketing agencies that are truly SaaS-focused tbh — most seem better at ecom. Curious if anyone’s actually had a good experience with one.",
          "score": 2,
          "created_utc": "2026-02-01 20:47:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xn37o",
          "author": "No-Boat-5517",
          "text": "Would love to discuss more on this !\nHappy to help and collaborate",
          "score": 1,
          "created_utc": "2026-02-01 07:28:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xog68",
          "author": "[deleted]",
          "text": "Totally relatable. Reddit ads are confusing and users hate obvious promotion. I’ve had better luck either posting organically in relevant subs or just skipping Reddit and using Google Ads or Facebook/IG where targeting and intent are clearer.",
          "score": 1,
          "created_utc": "2026-02-01 07:40:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xx1m0",
          "author": "Jaxyndamere",
          "text": "We could explore google ads, cold calling as well. Check your DM",
          "score": 1,
          "created_utc": "2026-02-01 09:00:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2y6n2i",
          "author": "iGrowJazzCigarettes",
          "text": "Maybe use paid ads instead of spamming subreddits",
          "score": 1,
          "created_utc": "2026-02-01 10:28:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2y9lig",
          "author": "lnjsl5465",
          "text": "Reddit can be strict, even when you're genuinely trying to help. There are agencies and marketers who specialize in Reddit marketing and understand the platform's nature and how to grow SaaS products without getting banned. They often offer services like strategy development, posting, engagement, and ensuring compliance with Reddit's rules.",
          "score": 1,
          "created_utc": "2026-02-01 10:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yg9w5",
          "author": "HauntingAd8264",
          "text": "Shadowbans usually happen because you’re triggering spam filters by being the sole source of your own promotion. Even if you're helpful, mods see it as a conflict of interest.\n\nI run a small organic Reddit marketing agency, and the \"wall\" you hit is common for founders. The secret isn't posting more; it’s about being truly helpful and giving genuine solutions before mentioning your product. \n.",
          "score": 1,
          "created_utc": "2026-02-01 11:54:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zubhr",
          "author": "Mushy-Mushroom12",
          "text": "I’m in the same boat tbh. Reddit feels powerful but also really hard to crack as a business owner because most subs are super anti-promotion. What helped me a bit was shifting focus to platforms that are more ad-friendly — Google Ads for high-intent searches and Facebook/Instagram ads for testing creatives and audiences. Reddit Ads can work too, but only if you treat it like community targeting rather than direct selling. Sometimes it’s less about forcing Reddit to work and more about using it alongside other channels.",
          "score": 1,
          "created_utc": "2026-02-01 16:40:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34wv5u",
          "author": "Status-Opinion7989",
          "text": "I had the same issue with Reddit, worked at first then became super unpredictable. What helped me was testing Google search ads and Facebook targeting business owners instead of relying only on organic Reddit traffic. Much more stable long-term.",
          "score": 1,
          "created_utc": "2026-02-02 11:01:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36gdhp",
          "author": "REALMRBISHT",
          "text": "we tried reddit on our own first and honestly got burned a couple of times. posts got removed, comments were ignored, and it was hard to tell where we were going wrong. We eventually worked with Infrasity, and the biggest difference was that they spent time understanding the product before posting anything. Instead of pushing links, they helped us answer questions in threads our ICP already cared about. Over a few weeks, we started seeing inbound traffic and people mentioning us organically. It felt slower, but way more sustainable",
          "score": 1,
          "created_utc": "2026-02-02 16:28:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36yajj",
          "author": "sh4ddai",
          "text": "Hey I run OutreachBloom and we do Reddit marketing for SaaS. We run our own SaaS so we know the ins and outs. Happy to help if you want!",
          "score": 1,
          "created_utc": "2026-02-02 17:50:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bgxg1",
          "author": "Money_Run5907",
          "text": "Totally get your struggle—Reddit marketing isn’t intuitive at all. If organic posting feels confusing, you might try running small test campaigns on Google Ads or Meta (Facebook/Instagram). They’re easier to target and scale, and you can come back to Reddit once your offer and audience are clearer.",
          "score": 1,
          "created_utc": "2026-02-03 10:14:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3e0x6g",
          "author": "WeddingLivid8003",
          "text": "You must first understand the audience before testing reddit",
          "score": 1,
          "created_utc": "2026-02-03 18:48:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hcfem",
          "author": "Klutzy-Pin-5007",
          "text": "Yeah I feel this. I’m running a small SaaS too and did the whole “helpful comments” thing for a while. It worked at first, then suddenly posts got removed and reach dropped.\n\nReddit is weird. Once they think you’re promoting, even if you’re not, it’s kinda over. What helped me was not relying on it alone. I started using Google ads + FB/insta + some Reddit ads. Not perfect, but way more stable... also building an email list helped a lot.\n\nBtw 1.3k MRR solo is solid, respect.",
          "score": 1,
          "created_utc": "2026-02-04 05:29:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i5ksh",
          "author": "gawiz93",
          "text": "I run a productised Reddit agency for B2B companies but given your scale, hiring an agency might constrain your resources. I would suggest you start tracking conversations and keywords using tools such as F5bot (free), Vobbit (7 free keywords - my product). Find good relevant conversations, help the users and build goodwill. \n\nCan you share what comment got you shadow banned? Also how old was your account? Were you doing this manually or automated? Were you doing it excessively?",
          "score": 1,
          "created_utc": "2026-02-04 09:46:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3k92rg",
          "author": "heavybass1",
          "text": "Amigo, estoy en la misma situación que tu y he estado buscando en foros ayuda, espero tambien encontrar algo de ayuda por aqui.",
          "score": 1,
          "created_utc": "2026-02-04 17:15:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nvmx3",
          "author": "Aisha_Gupta12",
          "text": "You opened this by saying you need to \"vent a little,\" and ironically, that energy is probably why you grew early on, not the \"helpful\" posts. The algorithm and mods don't hate marketing, they hate the sanitized feel of it.  \nWhen you're just a dev screaming into the void about cleaning businesses having 0 processes, it feels real. As soon as you try to professionalize that into a strategy or hand it off to a firm, the momentum just dies because the chaos is gone.",
          "score": 1,
          "created_utc": "2026-02-05 04:33:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41qakb",
          "author": "pra__bhu",
          "text": "don’t hire a reddit marketing agency. most of them are just running aged accounts posting thinly veiled promo comments and it’s exactly the kind of thing that gets shadow banned - which is ironically the problem you’re trying to solve.\nthe shadow ban issue usually comes from one of two things: posting in subs where you have no comment history (reddit flags accounts that only show up to mention their product), or your comment-to-self-promotion ratio being off. reddit’s spam filter is pretty aggressive and it doesn’t care if your comment was genuinely helpful if your account pattern looks promotional.\nwhat’s actually working for me as a solo saas founder: i spend most of my reddit time just commenting on threads where i have real expertise, with zero mention of what i’m building. like 90% of my comments are just helping people. that builds karma, account trust, and reputation in the subs where my target users hang out. then the rare times i do mention my project it doesn’t get flagged because my account looks like a normal person who also happens to be building something.\nat 1.3k mrr you’ve clearly got product-market fit for your niche. i’d focus on building a fresh account (or rehabbing your current one) by genuinely participating in r/sweatystartup, r/smallbusiness, and whatever subs local service business owners hang out in. answer questions about hiring, operations, whatever you know. let people find your product through your profile, not through your comments.\nit’s slower than paying an agency but it’s the only thing that actually compounds on reddit.",
          "score": 1,
          "created_utc": "2026-02-07 07:59:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o468h13",
          "author": "Salt-Baseball5540",
          "text": "i'am founder who’s still trying to crack the code on Reddit advertising...",
          "score": 1,
          "created_utc": "2026-02-08 00:37:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvl7s2",
      "title": "Learning Digital Marketing in 2026 – What’s Working?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qvl7s2/learning_digital_marketing_in_2026_whats_working/",
      "author": "Unable-Connection-58",
      "created_utc": "2026-02-04 10:38:05",
      "score": 29,
      "num_comments": 44,
      "upvote_ratio": 0.89,
      "text": "Digital marketing is changing fast in 2026, and I’m still learning and experimenting.\n\nWhat tools or strategies are working for you right now?  \nLet’s share and grow together. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qvl7s2/learning_digital_marketing_in_2026_whats_working/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3ib4wl",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-04 10:38:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3igxf4",
          "author": "JyoP2708",
          "text": "Content marketing is still doing the heavy lifting for me in 2026, just way more data-driven than before. One thing that’s helped a lot is using Socialmon to find high-performing posts in a specific niche instead of guessing what might work. You can search a topic and it surfaces real viral posts from creators, which makes it much easier to reverse-engineer hooks, formats, and angles. Feels way more practical than generic “post consistently” advice, and it saves a ton of time when you’re still learning and testing.",
          "score": 7,
          "created_utc": "2026-02-04 11:28:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3owhze",
              "author": "Unable-Connection-58",
              "text": "**Super useful**  \n",
              "score": 1,
              "created_utc": "2026-02-05 09:51:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ivb6y",
          "author": "Beautiful_Ad_4970",
          "text": "In 2026, digital marketing that’s actually working focuses on **real people first, platforms second**. Short-form video is still huge (think TikTok and Reels on Instagram), but it’s about storytelling and value more than flashy edits. Personalization with email and AI content tools is helping brands stay relevant without sounding generic. Community building (niche groups, active DMs, live interactions) also beats just posting and hoping for likes.",
          "score": 5,
          "created_utc": "2026-02-04 13:09:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3owjlx",
              "author": "Unable-Connection-58",
              "text": "**Spot on**",
              "score": 1,
              "created_utc": "2026-02-05 09:51:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3iwa3u",
          "author": "Crescitaly",
          "text": "Great question! Digital marketing in 2026 is a mix of timeless fundamentals and adapting to new platform algorithms.\n\n* Stay audience‑first: Build content around your audience’s needs and questions rather than chasing every new trend. Google’s ranking factors now include user‑experience signals like page speed and performance ([10 Important SEO Metrics to Track in 2026](https://backlinko.com/hub/seo/metrics#:~:text=10%20Important%20SEO%20Metrics%20to,Core%20Web%20Vitals)), so make sure your site loads quickly and provides a great experience on mobile.\n* Prioritise retention and watch‑time on social: Algorithms reward content that keeps people watching. For example, Instagram’s retention charts show how long reels are watched and when viewers drop off ([Instagram Reel Analytics: Retention & Skip Rate Explained](https://metricool.com/instagram-reel-analytics/#:~:text=Instagram%20Reel%20Analytics%3A%20Retention%20%26,are%20Retention%20and%20Skip%20Rates)). Hooks that grab attention within the first few seconds and keep watch‑time high tend to perform best ([Instagram Creator Monetization Checklist 2026 - InfluenceFlow](https://influenceflow.io/resources/instagram-creator-monetization-checklist-your-complete-2026-guide/#:~:text=Instagram%20Creator%20Monetization%20Checklist%202026,Focus%20on%20Reels%20Performance)).\n* Use data to iterate: Instead of guessing, look at analytics (GA4, retention graphs, engagement dashboards) to see what resonates. Even small improvements in metrics like click‑through rate or watch‑time compound over time.\n* Diversify channels: Pair your social content with owned channels like email newsletters, podcasts or communities. This builds first‑party relationships and insulates you from algorithm changes.\n* Collaborate thoughtfully: Micro‑influencer partnerships and affiliate programs can work well when they’re aligned with your niche and focused on engagement rather than vanity metrics ([Instagram Monetization in 2026: What Actually Works (and …](https://www.reddit.com/r/InstagramMarketing/comments/1qjeekr/instagram_monetization_in_2026_what_actually/#:~:text=Instagram%20Monetization%20in%202026%3A%20What,and%20What%20Doesn%E2%80%99t)).\n\nHope that helps! What’s been working for you so far?",
          "score": 3,
          "created_utc": "2026-02-04 13:14:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3owllq",
              "author": "Unable-Connection-58",
              "text": "**Great breakdown**  \n",
              "score": 1,
              "created_utc": "2026-02-05 09:52:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3j4doh",
          "author": "LuckyRubberDuckie",
          "text": "One thing I've noticed working surprisingly well in 2026 is reactive marketing. Responding fast to trends, news, or conversations instead of relying only on pre-planned content is a much better approach to content marketing.",
          "score": 3,
          "created_utc": "2026-02-04 13:59:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ownt3",
              "author": "Unable-Connection-58",
              "text": "**Spot on.**",
              "score": 1,
              "created_utc": "2026-02-05 09:52:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o43el3g",
                  "author": "Remarkable_Hat3218",
                  "text": "i like your comments very short and effective lol ",
                  "score": 1,
                  "created_utc": "2026-02-07 15:36:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ntuwk",
          "author": "KONPARE",
          "text": "I’m still learning too, but the stuff that keeps working is pretty unsexy.\n\n* Pick one channel to get decent at first (search, short video, email, paid). Do not try to do all of them at once.\n* Track basics properly: UTMs, one conversion event, and a simple weekly check in GA4 and Search Console.\n* Make content from real questions people ask you. DMs, calls, support tickets. Way better than guessing.\n* Use AI for speed (research, outlines, variants), but always edit with real examples and clear opinions.\n\nAlso, boring consistency wins. Posting twice a week for 3 months beats a “big push” every few weeks.",
          "score": 3,
          "created_utc": "2026-02-05 04:22:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3owrsf",
              "author": "Unable-Connection-58",
              "text": "**Pure gold**",
              "score": 1,
              "created_utc": "2026-02-05 09:53:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jlsik",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-02-04 15:28:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3owpyy",
              "author": "Unable-Connection-58",
              "text": "**Well said**  \n",
              "score": 1,
              "created_utc": "2026-02-05 09:53:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3oep7p",
          "author": "United_Broccoli_4032",
          "text": "Since digital marketing keeps shifting, I’ve leaned on tools that take the guesswork out of testing. Right now, something like Didoo AI is a game changer-it studies your business and auto-spins up Meta ads that target buyers who actually convert. Instead of juggling audiences and ad creatives manually, it optimizes on the fly, so you can focus on what matters without wasting budget on dud ads. When you’re stuck wondering if an angle or audience will work, AI-driven testing like this seriously speeds up finding the winners. What kinds of tools or hacks have you found that keep your campaigns fresh?",
          "score": 2,
          "created_utc": "2026-02-05 07:02:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3owtqw",
              "author": "Unable-Connection-58",
              "text": "**Interesting tool.**",
              "score": 1,
              "created_utc": "2026-02-05 09:54:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q21d6",
          "author": "Gloomy_Ad_896",
          "text": "For me, it's definitely hyperpersonalization. Personas aren't static. No matter how carefully you segment, it can be outdated by the time content reaches customers. Adapt to behavior in real time and make sure field reps always have the right materials to engage effectively.",
          "score": 2,
          "created_utc": "2026-02-05 14:42:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vh7sy",
              "author": "Unable-Connection-58",
              "text": "Spot on.",
              "score": 1,
              "created_utc": "2026-02-06 09:27:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qt3s2",
          "author": "WordRevolutionary233",
          "text": "**​\"In 2026,** I believe the shift is heavily towards **AI-driven** personalization and First-party data strategy. From my experience, strictly following old **SEO** patterns isn't enough anymore; you need to focus on 'Search Intent' rather than just keywords.\n\n​Also, Short-form video content combined with automated email funnels is doing wonders for ROI right now. I've been experimenting with these and the engagement is significantly higher. What’s your take on AI-generated content vs. human-led storytelling?\"",
          "score": 2,
          "created_utc": "2026-02-05 16:51:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vh9aa",
              "author": "Unable-Connection-58",
              "text": "Great perspective.",
              "score": 1,
              "created_utc": "2026-02-06 09:27:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3smn2c",
          "author": "PatienceLanky2814",
          "text": "Im concerned that AI will screw up a lot of marketing agencies (unless you're marketing your own products/services)",
          "score": 2,
          "created_utc": "2026-02-05 21:59:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vhbbd",
              "author": "Unable-Connection-58",
              "text": "Valid concern.",
              "score": 1,
              "created_utc": "2026-02-06 09:28:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3v5art",
          "author": "Nirmala_devi572",
          "text": "From what I’m seeing, what’s working in 2026 is less about chasing every new tool and more about **doing the basics really well, with smarter execution**.\n\nAI tools are everywhere now, but the people getting results are using them to **speed up research, content planning, and testing**, not to blindly auto-generate everything. Search is shifting, but SEO still matters; topical authority, genuine experience, and clear answers beat keyword stuffing every time.\n\nShort-form video continues to perform, especially when it feels real and not overproduced. Email is quietly strong again when it’s segmented and actually useful. Paid ads are tougher, so creatives and landing pages matter more than budgets.\n\nOverall, what’s working is being human, data-aware, and consistent tools change, fundamentals don’t.",
          "score": 2,
          "created_utc": "2026-02-06 07:34:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vhcn4",
              "author": "Unable-Connection-58",
              "text": "Great summary.",
              "score": 1,
              "created_utc": "2026-02-06 09:28:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3w6db6",
          "author": "Which_Protection7047",
          "text": "What’s working from what I’m seeing so far in 2026 is a hybrid approach, not a single channel.\n\nThings that actually matter right now:\n\n**1. AI + Fundamentals:** AI Helps with Research, Content, and Testing, But SEO Fundamentals, CRO, and Analytics Still Rule the Results.\n\n**2. Search beyond Google:** Optimizing for AI answers (AEO/GEO), YouTube, Reddit, and marketplaces is just as important as the classics of SEO.\n\n**3. Topical Authority:** Less 'random' posts, more 'structured' posts around a single 'niche' with internal linking.\n\n**4. First-party data:** Email lists, communities, and CRM tracking are becoming increasingly important, as tracking is getting tighter.\n\n**5. Hands-on Testing:** Real ad campaigns, real money, and constant evolution always trumps theory.\n\n**6. Tools:** ChatGPT, GA4, Search Console, Ahrefs/SEMrush, Looker Studio, and ad platform dashboards — but the understanding of why to use them is more relevant than the ownership.\n\nBig shift I've noticed: folks working on actual projects are making progress way faster than those accumulation-of-certificates folks.",
          "score": 1,
          "created_utc": "2026-02-06 12:52:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xfynj",
          "author": "Local_Jackfruit9910",
          "text": "I'm a college student planning on starting my own digital marketing agency.  Is anyone else just getting started and is serious about it?  I'm looking for a couple of people I can bounce ideas off of.",
          "score": 1,
          "created_utc": "2026-02-06 16:46:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41kkk6",
          "author": "Key_Salamander_7733",
          "text": "What’s working for me is fundamentals + smart tools.\n\nStrong basics (SEO intent, clear messaging, conversion focus) paired with AI for research, drafts, and testing. Tools change, but strategy and usefulness still drive results.",
          "score": 1,
          "created_utc": "2026-02-07 07:05:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45pn43",
          "author": "Puzzleheaded_Low2965",
          "text": "Daniel fazio’s course Client Ascension is great",
          "score": 1,
          "created_utc": "2026-02-07 22:43:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy7e8o",
      "title": "Some of my favourite tools that make marketing a bit easier and a lot bearable",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qy7e8o/some_of_my_favourite_tools_that_make_marketing_a/",
      "author": "Far-Panic3458",
      "created_utc": "2026-02-07 07:20:16",
      "score": 29,
      "num_comments": 3,
      "upvote_ratio": 0.95,
      "text": "Notion AI: Best for all-in-one productivity. It acts as your CRM, content calendar, and writer. The free plan is generous, and the AI add-on is roughly $10/month, which is significantly cheaper than standalone AI writers.\n\nZapier: The free tier allows for 100 \"tasks\" per month. It’s perfect for simple \"If This, Then That\" automations (e.g., If I get a new lead on Facebook, send them a welcome email).\n\nBrevo (formerly Sendinblue): Unlike Mailchimp, Brevo allows unlimited contacts on their free plan and lets you send up to 300 emails per day. It includes AI subject line generators and basic automation workflows for $0.\n\nCanva Magic Studio: The gold standard for design automation. The free version now includes \"Magic Edit\" and \"Magic Write.\" For $12.99/month, you get a full suite of AI tools that can turn a single text prompt into an entire social media campaign. Their premium templates are absolutely amazing and are worth every penny\n\nFibr.ai: Offers a highly rated Free Google Ad Copy Optimizer. It analyzes your niche and generates headlines/descriptions optimized for higher Quality Scores.\n\nRyze AI: Basically monitors your ad campaigns. Also provides meaningful advice via a chatbot. Costs like $49 per month and has other plans\n\nAdCreative.ai: For about $20–$30/mo, it generates hundreds of \"conversion-focused\" banners and creatives. It even gives them a \"confidence score\" based on how well the AI thinks they will perform on Google’s Display Network",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qy7e8o/some_of_my_favourite_tools_that_make_marketing_a/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o41m6zr",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 07:20:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43gllo",
          "author": "BlissfulEating",
          "text": "Can you tell me more about Notion AI acting as your CRM?",
          "score": 1,
          "created_utc": "2026-02-07 15:46:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qurbhc",
      "title": "If you had to focus on ONE digital marketing channel this year, what would it be?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qurbhc/if_you_had_to_focus_on_one_digital_marketing/",
      "author": "Scary-Offer-4773",
      "created_utc": "2026-02-03 13:01:35",
      "score": 15,
      "num_comments": 20,
      "upvote_ratio": 0.95,
      "text": "With limited time and budget, it’s getting harder to spread effort across everything.\n\nSEO, paid ads, email, social, influencers, content marketing - they all have their pros, but not all of them deliver the same ROI anymore.\n\nSo if you had to double down on just **one channel** right now, which would you choose and why?\n\nI’m interested in hearing what’s actually working in real-world campaigns, not theory or hype",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qurbhc/if_you_had_to_focus_on_one_digital_marketing/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3c23eq",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 13:01:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dcttd",
          "author": "Decent_Jello_8001",
          "text": "Google ads easy, I made a Milly off 5k lol",
          "score": 3,
          "created_utc": "2026-02-03 16:59:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f2bmx",
          "author": "KNVRT_AI",
          "text": "The answer depends on your business model, audience, and current assets. No universal best channel.\n\nE-commerce with email list? Email. Highest ROI, you own audience, predictable revenue.\n\nB2B with long sales cycles? LinkedIn. Decision makers are there, content builds authority.\n\nLocal services? Google Local Services or Maps. High intent searches convert immediately.\n\nContent business or SaaS? SEO if you can wait 6 to 12 months. Organic traffic scales without ongoing ad spend.\n\nConsumer product with visual appeal? Paid Meta or TikTok. Best creative testing and conversion tracking for e-commerce.\n\nOur clients see best ROI doubling down on channels where they already have traction. Amplify what's proven, not trendy.\n\nThe mistake is picking based on what sounds exciting versus what your business needs. New business with no audience? Paid ads for fast feedback. Established with traffic but low conversions? Email and retention.\n\nIf forced to pick universally, email wins for most businesses with existing customers. Highest ROI, full control, works across industries. But only if you have a list.\n\nFor acquisition with zero assets, paid search or Meta ads get you learning fastest. Organic takes too long when you need validation.\n\nReal world success depends on execution quality more than channel choice. Great email beats mediocre SEO. Channel matters less than how well you execute.\n\nFocus on channel where your customers are and where you can create better content or targeting than competitors.\n\nHonest answer is test multiple channels at low budget, find what converts profitably, go all in on that. Picking blindly is guessing.\n\nThis year specifically, organic social harder, paid ads more expensive, SEO takes longer. Email and owned audiences are safest bets for ROI if you have them.",
          "score": 3,
          "created_utc": "2026-02-03 21:43:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3joxkc",
          "author": "Rich-Editor-8165",
          "text": "I’d pick SEO.  boring at first, but it compounds, brings high-intent traffic, and keeps working even when you stop pushing. Fits well if you like building systems over chasing spikes.",
          "score": 3,
          "created_utc": "2026-02-04 15:42:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wok2t",
              "author": "Kindly_Rate_2614",
              "text": "I would do the same too. I find it interesting though.",
              "score": 2,
              "created_utc": "2026-02-06 14:33:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hh1tj",
          "author": "supriya_l89",
          "text": "I would choose SEO together with content creation as my preferred option. The method generates results which accumulate over time while attracting customers who show active purchase intent and it presents more stable outcomes than paid advertising. The approach continuously provides results when executed correctly through the creation of valuable content and the establishment of strong technical foundations.",
          "score": 2,
          "created_utc": "2026-02-04 06:05:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hfqhl",
          "author": "vj_0704",
          "text": "Paid ads works the best for me.",
          "score": 1,
          "created_utc": "2026-02-04 05:55:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hx2e8",
          "author": "sarajesson",
          "text": "I think ut's email marketing. Algorithm doesn't steal your reach and you can write customers directly.",
          "score": 1,
          "created_utc": "2026-02-04 08:25:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3l5p0r",
          "author": "E4sy1dle12e",
          "text": "SEO. Still the best long-term ROI if you do it right",
          "score": 1,
          "created_utc": "2026-02-04 19:44:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qbvup",
          "author": "No_Challenge_2200",
          "text": "Meta ads for sure",
          "score": 1,
          "created_utc": "2026-02-05 15:31:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rn3p4",
          "author": "thatcooltechdude",
          "text": "Personally, I would say LinkedIn. This applies specifically to my company because a) we have built many relationships on LinkedIn and b) we know our target audience/demographic is there. One of the things that have built our exposure the most is when internal employees have been interviewed by other tech companies and join an interesting roundtable of discussion relating to tech, marketing, b2b, etc. This kind of organic conversation and relationship building goes a long way.",
          "score": 1,
          "created_utc": "2026-02-05 19:09:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ucd3o",
          "author": "christianhorniman",
          "text": "I would prefer Google ads. Because seo takes time to bring results but paid ads can give you instant results.",
          "score": 1,
          "created_utc": "2026-02-06 03:51:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wfpfc",
          "author": "Tight_Tree8390",
          "text": "SEO for sure",
          "score": 1,
          "created_utc": "2026-02-06 13:46:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cis2i",
          "author": "Sad-Butterfly-4299",
          "text": "If I had to focus on **one** channel this year with limited time and budget, I’d choose **email** — *but only after using one other channel to feed it.*\n\nEmail wins for one simple reason: **it compounds**.\n\nAlgorithms change. Reach fluctuates. Ad costs spike. But once someone is on your list, you’re not renting attention anymore — you own the relationship. That matters more now than ever.\n\nThat said, email doesn’t exist in a vacuum. I’d pair it with **one acquisition channel**, not five.\n\nIf I had to rank what I’ve seen work in real campaigns:\n\n* **Email** → highest ROI long-term\n* **One organic channel** (SEO *or* short-form, depending on the audience) → list growth\n* Everything else → optional layers later\n\nWhat I wouldn’t do anymore:\n\n* Spread effort across multiple platforms “just in case”\n* Chase virality without a clear next step\n* Rely entirely on paid ads without a proven message\n\nSEO still works, but it’s slower and more competitive. Paid ads work, but only if you already understand your offer and audience. Social works, but reach is unreliable unless you’re consistent for a long time.\n\nEmail is boring. It’s not flashy. But it’s where conversions actually happen when things get tight.\n\nIf I truly had to pick **one single channel with no backups**, I’d still pick **email** — because it’s the only one that keeps paying you back for work you did months ago.\n\nCurious what others are seeing though — especially across different niches.",
          "score": 0,
          "created_utc": "2026-02-03 14:35:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3osjar",
              "author": "Chance-Tower-7926",
              "text": "I was coming here to say that! Email marketing still has the highest ROI but you need other channels to feed it first.",
              "score": 1,
              "created_utc": "2026-02-05 09:12:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3chapr",
          "author": "PeopleLoveAI",
          "text": "ngl with limited time & budget, i'd double down on paid ads like meta or google. you get the fastest feedback loop and clearest roi. if your creatives are good, you can scale pretty quick.\n\n\n\nbut yeah, \"if your creatives are good\" is the tricky part. thats always been my biggest bottleneck as a performance marketer, which is why i built trydooken(.)com. shameless plug but it just makes pumping out new static ad variants super fast.",
          "score": -1,
          "created_utc": "2026-02-03 14:27:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dii2a",
          "author": "Fit_Heat_3308",
          "text": "Google Ads for anything that, for the customer, feels like an investment. Meta Ads for small purchases and things like clothes or... I don't know... Air fryers haha.\n\n\nEmail if you already have a large/good contact list.",
          "score": 0,
          "created_utc": "2026-02-03 17:25:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qto0b0",
      "title": "Is marketing more about problem-solving or persuasion?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qto0b0/is_marketing_more_about_problemsolving_or/",
      "author": "AdWrong9284",
      "created_utc": "2026-02-02 06:57:21",
      "score": 15,
      "num_comments": 27,
      "upvote_ratio": 0.86,
      "text": "I think marketing is more about problem-solving. Persuasion matters, but if you’re not solving a real customer or business problem, no amount of clever messaging really works in the long run.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qto0b0/is_marketing_more_about_problemsolving_or/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o346wdv",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 06:57:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35ea1g",
          "author": "LeadGenDotCom",
          "text": "I would argue that marketing is more about uncovering needs (i.e finding problems.)",
          "score": 3,
          "created_utc": "2026-02-02 13:12:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o376gpq",
              "author": "Confident-Smile-7161",
              "text": "Completely agree",
              "score": 2,
              "created_utc": "2026-02-02 18:27:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3rrnaq",
          "author": "PatchneckRed",
          "text": "This is a great question! There's a bit of a \"chicken/egg\" thing here, but, from my experience, I'd give the edge to \"problem solving.\" If I can or have solved the problem, then I can use that for persuasion. If I can't or haven't solved a problem, then no amount of persuasion is going to cover that. Not in the long run and probably not in the short run, either. ",
          "score": 2,
          "created_utc": "2026-02-05 19:30:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vfmyu",
          "author": "AgilePrsnip",
          "text": "i agree it starts with problem solving. persuasion comes later and works better when the problem is real, since the message gets clearer and costs drop and trust grows. write the job in one sentence, test demand with five customer calls or ten search queries, then ship a plain page and watch signups. we tried this once, cut copy to 120 words, ran it for 48 hours, and conversion moved from 1.8 to 3.1, which shows persuasion helps most when choices look similar and the basics are already right.",
          "score": 2,
          "created_utc": "2026-02-06 09:12:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34n92b",
          "author": "eolithic_frustum",
          "text": "You still have to persuade a prospect that you can solve their problem... Who cares about your ability to problem solve if you can't get the message out that you've done so, and done so effectively. ",
          "score": 1,
          "created_utc": "2026-02-02 09:31:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34oynk",
          "author": "kubrador",
          "text": "persuasion is literally how you convince someone they have a problem in the first place, so this is kinda like saying cooking is more about ingredients than heat.",
          "score": 1,
          "created_utc": "2026-02-02 09:48:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o373cs4",
              "author": "Confident-Smile-7161",
              "text": "To offer an alternative perspective to that. If you are really solving a problem that people have (problem based marketing) then anyone you have to persuade they have that problem isn't your target audience.  \n  \n100% respect on your opinion, obviously there is no one correct way to marketing. Can I get your opinion on my alternative perspective? What do you think of marketing based 100% around problem solving?",
              "score": 1,
              "created_utc": "2026-02-02 18:13:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o378659",
                  "author": "kingofmeta123",
                  "text": "You’re basically channeling demand that already exists. In that case persuasion isn’t required. It’s just addressing the concerns they already have. \n\nProblem solving literally means addressing those concerns in a way that makes it easy for them to visualize the outcome of a purchase. \n\nSo for example if I’m selling a chair. I’m showing different angles on how the chair will maximize their comfort. \n\nI’m showing the quality of the material, what it’s made of and why it makes your sitting experience worth while. \n\nSo in essence we are helping them visualize what sitting on the chair would look like before they can actually experience it post purchase. \n\nYou cannot experience it without buying it unless you go to an actual physical store. So giving them a physical store experience in a matter of minutes is what I’d call problem solving.",
                  "score": 1,
                  "created_utc": "2026-02-02 18:35:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o351d4f",
          "author": "That-Travel-5697",
          "text": "I think it is about both you need to solve a problem but also be able to persuade someone if they are on the fence about buying",
          "score": 1,
          "created_utc": "2026-02-02 11:40:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35ovk2",
          "author": "Sad-Butterfly-4299",
          "text": "I mostly agree with you.\n\nProblem-solving is the foundation. If there isn’t a real problem or unmet need, persuasion can create short-term attention but it doesn’t hold up long-term.\n\nThat said, I think persuasion still plays a role — not in convincing people to want something they don’t need, but in helping them recognize *why* a solution matters and how it fits their situation.\n\nIn practice, the best marketing I’ve seen feels like this:  \nproblem first, clarity second, persuasion last.\n\nWhen the problem is real and clearly understood, the persuasion part becomes much lighter and more about guidance than pressure.",
          "score": 1,
          "created_utc": "2026-02-02 14:13:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36dhnp",
          "author": "Salamandra_UK",
          "text": "Totally agree. Persuasion is the delivery but problem-solving is the foundation. If there’s no real pain being solved, the best copy in the world won’t save it long-term.",
          "score": 1,
          "created_utc": "2026-02-02 16:15:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o371bvo",
          "author": "Confident-Smile-7161",
          "text": "I vote problem solving all the way. Persuasion is for snake oil.   \nOf course people have questions and concerns, but I wouldn't think of that as persuasion, It should be a open and honest approach. marketing based around solving a real problem and aiming to help real people in a clear and open exchange, is the strongest way to get seen by your audience to start build authority and trust. After authority and trust have been built through providing value driven content. \n\n*Done right there will be no need for persuasion, instead it will be your recommendation the audience values.*\n\nAgain I want to stress that of course there is room for strategy and tactics (tricks of the trade if you will) but persuasion based marketing will either give you no yield  or bite you in the arse down the road. (in the form of complaints, refunds, bad reputation, etc)",
          "score": 1,
          "created_utc": "2026-02-02 18:04:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o382qf5",
          "author": "Luc_ElectroRaven",
          "text": "99% of marketing is persuasion - business itself is about problem solving but most marketers do not solve anything. it can in theory and I think the best businesses come from the best marketers because they get they should make products people want, then the persuasion takes care of itself but most marketing is 'change the copy and images to make this sound cool\"",
          "score": 1,
          "created_utc": "2026-02-02 20:57:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3acfod",
          "author": "Responsible-Pitch363",
          "text": "Persuasion. No one is taking the product back into development just to do a better job. That’s what designed obsolescence is for. You take the money to solve a problem, then move the goal post and sell them on an upgrade. Does it really matter if the problem is solved?",
          "score": 1,
          "created_utc": "2026-02-03 04:24:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3azcrc",
          "author": "pra__bhu",
          "text": "This resonates. I've spent 14 years in software and the pattern is always the same - the products that win are the ones where customers say \"finally, someone fixed this\" not \"that's a clever ad.\"\n\nCurrently validating a side project and the most valuable signal has been finding people who've already built janky workarounds - spreadsheets, manual processes, duct-taping 3 tools together. They've already validated the problem with their time. My job is just to make it less painful.\n\nThe best \"marketing\" at that point is just describing their problem back to them accurately. They sell themselves.",
          "score": 1,
          "created_utc": "2026-02-03 07:25:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cbxvw",
          "author": "ScholarNew1109",
          "text": "They both go hand in hand, marketing wouldn't work without persuasion.",
          "score": 1,
          "created_utc": "2026-02-03 13:58:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cjg1l",
          "author": "Tight_Tree8390",
          "text": "Both, but in a specific order.\n\nProblem-solving comes first. If you don’t understand the real problem, no amount of persuasion works long-term. You might get clicks, but not trust or repeat customers. Persuasion is what helps people act once the solution is clear. Good marketing makes someone think “this fits my situation” and then lowers the friction to choose it. The best marketing feels persuasive only because the problem was understood so well :) ",
          "score": 1,
          "created_utc": "2026-02-03 14:38:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3diwuu",
          "author": "Yapiee_App",
          "text": "I’ve found persuasion works best as a multiplier, not a substitute. If the underlying problem isn’t real or urgent, great messaging just creates short-term curiosity, not lasting traction.",
          "score": 1,
          "created_utc": "2026-02-03 17:27:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f1l89",
          "author": "NevenCucadotcom",
          "text": "marketing is persuading a customer he has a problem and offering a solution",
          "score": 1,
          "created_utc": "2026-02-03 21:39:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3h1ufl",
          "author": "Maximum_Marketing123",
          "text": "It has to be both. First, you need to tell the buyer that their problem can be solved in a particular way. And then persuade them that you are the best brand/person to solve that problem.",
          "score": 1,
          "created_utc": "2026-02-04 04:16:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i31qa",
          "author": "LaunchLabDigitalAi",
          "text": "Marketing starts with problem-solving, and persuasion only works once that foundation is real. If there is not a genuine customer problem being addressed, persuasion just becomes noise or short-term manipulation. The best marketing usually feels persuasive because it clearly understands the problem, names it better than the customer can, and shows a credible path to solving it. In that sense, persuasion is more like the delivery mechanism, while problem-solving is the substance. Long-term results tend to come from getting the problem right first, not from being clever with words.",
          "score": 1,
          "created_utc": "2026-02-04 09:22:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3il6p6",
          "author": "Bob-Roman",
          "text": "It’s about establishing trust.  A brand is a promise of trust.\n\nMost of the folks I work with will tell you their business reputation is their single most valuable asset.",
          "score": 1,
          "created_utc": "2026-02-04 12:01:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3n9ryq",
          "author": "Tudragon123456",
          "text": "I think your dead on—marketing's core is solving problems, persuasion is just wrapping papper around that solution. One thing that helpped me is actually interviewing customers befoe building campaigns to find what frustrates them most—you'd be suprised how much it shapes",
          "score": 1,
          "created_utc": "2026-02-05 02:20:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ofoyk",
          "author": "Vinaya_Ghimire",
          "text": "I think marketing is more about persuasion. If you can persuade people to believe that they have problems and your product/service is the answer, you can have conversions.",
          "score": 1,
          "created_utc": "2026-02-05 07:11:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43h3aj",
          "author": "Low_Confection_2433",
          "text": "problem-solving and actually also making people strongly believe they have a problem to solve, when it's not extremely clear",
          "score": 1,
          "created_utc": "2026-02-07 15:49:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtww5v",
      "title": "My boss thinks AI means we can do the same work with half the team",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qtww5v/my_boss_thinks_ai_means_we_can_do_the_same_work/",
      "author": "beckstarlow",
      "created_utc": "2026-02-02 14:43:37",
      "score": 14,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "Hi everyone!\n\nSince we started using AI tools, expectations have gotten weird. Turnaround times shorter. Less tolerance for “thinking time.” More output, same pay.\n\nAnyone else dealing with leadership assuming AI - instant productivity?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qtww5v/my_boss_thinks_ai_means_we_can_do_the_same_work/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o35umjv",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 14:43:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35yz2r",
          "author": "drteq",
          "text": "Don’t work for dumb people and if you have to dont be loyal, you deserve better",
          "score": 7,
          "created_utc": "2026-02-02 15:05:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3a773z",
          "author": "FreelanceWebDev_26",
          "text": "Happening everywhere. The issue is leadership sees AI as a replacement, not an amplifier. The truth is AI handles the boring parts faster (first drafts, data formatting, research summaries) but the strategy, judgment, and quality control still need humans. If anything, AI means you can take on MORE complex work, not that you need fewer people. Worth framing it that way to your boss - 'we can do better work' not 'we can do the same work faster.'",
          "score": 2,
          "created_utc": "2026-02-03 03:50:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3b0bkp",
              "author": "theArthurChen",
              "text": "100%. My opinion is that someone should never use AI to do something they don't already know how to do manually, because if someone **doesn't** know how to do it themselves, then they can't verify that the AI did it accurately.\n\nSame thing with AI-Powered or Agentic Automations. Don't automate something you don't know how to do manually. You'll just miss a bunch of edge cases and create even **more** work fixing the output in the end.",
              "score": 2,
              "created_utc": "2026-02-03 07:34:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o35y2sq",
          "author": "Doongbuggy",
          "text": "as someone who has been starting to builds agent to do stuff, absolutely not lol the tech is not there yet even simple tasks by an agent are taking longer than if i donit myself - using claude for chrome to automate and it is not that reliable yet",
          "score": 3,
          "created_utc": "2026-02-02 15:01:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36ow52",
          "author": "No_Hedgehog8091",
          "text": "Yeah this is everywhere right now.\n\n  \nThe irony is AI actually needs MORE thinking time to use well, not less.",
          "score": 2,
          "created_utc": "2026-02-02 17:07:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38x2vb",
          "author": "roblawsonassassin",
          "text": "This is an interesting dilemma for both.  I am a business owner, therefore, boss, I guess.  I look at how I can support my people to do what they do.  For now, all we have is investment in tools and time to understand what will work for us and what won't.  Our goal is AI-first. Don't try to come up with the answers yourself; let AI give you some ideas and perhaps a framework.  I am starting to see our teams share their success and build agents to do repetitive tasks.  They all realise that, as a business, we need to be ahead of this stuff to remain competitive and to stay in business.\n\nPerhaps you could collaborate with your colleagues and present some time-saving ideas for the business to adopt, so you have repeatable processes.  Just expecting more with less won't work, in my opinion.",
          "score": 1,
          "created_utc": "2026-02-02 23:28:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3am6wc",
              "author": "Chimera_Mechanic_69",
              "text": "How to ruin your teams grey matter and make them dumb.",
              "score": 2,
              "created_utc": "2026-02-03 05:34:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3al8cr",
          "author": "Spiritu342",
          "text": "You can get more done with AI and be more productive, but also it doesn't mean you suddenly have to the work of 10 other people",
          "score": 1,
          "created_utc": "2026-02-03 05:26:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3k6sm1",
          "author": "WebLinkr",
          "text": "Depends on what you're doing",
          "score": 1,
          "created_utc": "2026-02-04 17:04:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wrupn",
          "author": "sameer_somal",
          "text": "You’re not alone. This is a very common misconception right now.\n\nAI compresses execution time, not judgment or strategy. The thinking doesn’t disappear; it just shifts. When leadership equates faster output with instant productivity, expectations rise faster than reality.\n\nTeams that win with AI treat it as leverage, not replacement, reinvesting time saved into better strategy and quality, not just more volume.",
          "score": 1,
          "created_utc": "2026-02-06 14:50:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3x8a5a",
          "author": "Foundry25",
          "text": "Same story in a lot of teams right now. AI speeds up the rough draft, but you don’t magically skip feedback rounds and most of the time you just move the work to QA and approvals.",
          "score": 1,
          "created_utc": "2026-02-06 16:10:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36pbu4",
          "author": "YouMeADD",
          "text": "Everyone's boss",
          "score": 0,
          "created_utc": "2026-02-02 17:09:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtqkv8",
      "title": "Evaluating the best cold email agency for a client’s outbound.",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qtqkv8/evaluating_the_best_cold_email_agency_for_a/",
      "author": "Forenzoj",
      "created_utc": "2026-02-02 09:33:56",
      "score": 14,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I run a full-service digital agency, but we don't do cold email in-house. A client is asking for it, and I want to white-label or refer them to a specialist. I need someone who understands the nuances of B2B copy. I need real research and high-level strategy. Who is considered the gold standard for cold email execution these days?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qtqkv8/evaluating_the_best_cold_email_agency_for_a/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o34nhqq",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 09:33:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3arqxt",
          "author": "ExtremeAstronomer933",
          "text": "From experience, the biggest failure point with white-labeled cold email is shallow research. Whoever you pick should feel more like a partner than a vendor. Outreachbloom is one of the few names I’ve seen tied to strategy-heavy outbound.",
          "score": 1,
          "created_utc": "2026-02-03 06:18:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3brcbt",
          "author": "Zestyclose_Chair8407",
          "text": "you're smart to white-label this instead of building it yourself. The deliverability stuff alone is a nightmare if you don't specialize in it. I've been seeing sales dot co come up a lot in circles where people are looking for actual strategic cold email, not just volume blasting.\n\n\n\nFrom what I understand, they handle the full stack including research and personalization, which sounds like what you need if your client wants quality meetings. They seem to focus on growth-stage B2B specifically so the targeting should be pretty dialed in for that use case. Might be worth checking them out since they do the fully managed thing and you wouldn't need to bring any of teh infrastructure in-house.",
          "score": 1,
          "created_utc": "2026-02-03 11:45:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtrpd0",
      "title": "Hi guys. Anybody feeling like quitting social media after managing clients social media accounts for over 4 months? Now, I just want to hire someone… is it just me or do you feel that way too ?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qtrpd0/hi_guys_anybody_feeling_like_quitting_social/",
      "author": "sushiwit420",
      "created_utc": "2026-02-02 10:41:02",
      "score": 12,
      "num_comments": 31,
      "upvote_ratio": 0.93,
      "text": "I have a marketing agency. Started just by myself. Now have one employee for editing videos. Currently, I have no energy to pitch new clients, as I am constantly questioning do I even enjoy this ? I am not into social media doom scrolling anymore. I love nature more and I do love marketing. But I want to automate it if it’s possible. Any successful marketers that have automated their business without having to use social media ? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qtrpd0/hi_guys_anybody_feeling_like_quitting_social/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o34uk0f",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 10:41:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o356kmz",
          "author": "bitchelleee",
          "text": "I did it as an internship for 3 months and now I don’t have any social media other than reddit and snapchat 😭",
          "score": 2,
          "created_utc": "2026-02-02 12:20:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38t0oo",
              "author": "sushiwit420",
              "text": "What’s your reason behind it ?",
              "score": 1,
              "created_utc": "2026-02-02 23:06:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o39np89",
                  "author": "bitchelleee",
                  "text": "Scrolling through TikTok and Instagram constantly for trends, that was the part I wasn’t exactly a fan of. I loved social media, I still do, but I just stopped enjoying it. My brain felt like brain rot by the end of the internship. Scrolling through social media just felt like a job even when I was off of work. I was just burnt out being on it for so many hours during the day. That’s just my personal experience! I know friends that do like the job. I wore many hats during the internship, I just didn’t like the social media part. I did realize the part I liked about it was engaging with the online community, looking at analytics and that I really want to pivot to product marketing, specifically something that involves helping people! :)",
                  "score": 3,
                  "created_utc": "2026-02-03 01:56:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o35ddpg",
          "author": "krush_groove",
          "text": "When your fun stuff becomes work for other people, it's not much fun any more...",
          "score": 1,
          "created_utc": "2026-02-02 13:07:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3g5g32",
              "author": "sushiwit420",
              "text": "My fun is film making. I never love social media. It was always a tool",
              "score": 1,
              "created_utc": "2026-02-04 01:07:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35gkoe",
          "author": "Crazy_Disk_9222",
          "text": "Is it so hard to do social media marketing",
          "score": 1,
          "created_utc": "2026-02-02 13:26:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37v11u",
              "author": "Exciting_Reason_4904",
              "text": "Not hard just draining",
              "score": 2,
              "created_utc": "2026-02-02 20:21:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o364hyw",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 15:32:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38t6bu",
              "author": "sushiwit420",
              "text": "Thanks 🙏 it’s very true. I will find a way to automate this thing…",
              "score": 1,
              "created_utc": "2026-02-02 23:06:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37vgd5",
          "author": "Exciting_Reason_4904",
          "text": "I would recommend hiring a white label marketing agency to take care of the ads side of things all you would have to do it outreach and if you run your own ads as outreach then that’s a plus only thing you would have to do is communicate with clients",
          "score": 1,
          "created_utc": "2026-02-02 20:23:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38sl0i",
              "author": "sushiwit420",
              "text": "4 videos per week I offer like that. There will be a content script every week with new ideas taking in from weekly trends of social media contents",
              "score": 1,
              "created_utc": "2026-02-02 23:03:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o395zop",
                  "author": "Exciting_Reason_4904",
                  "text": "The white label agency will take care of that only thing they won’t is that 4 videos per week so I say hire someone to take video then send it to the white label agency and boom fully automated only thing left to automate would be your outreach",
                  "score": 1,
                  "created_utc": "2026-02-03 00:16:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o391dbr",
          "author": "AmanYoga",
          "text": "Claro! Aqui vai uma resposta em inglês, com tom humano, educado e colaborativo — bem “Reddit vibe”:\n\n⸻\n\nHey! I really relate to what you shared. I’m actually in the process of opening my own marketing agency here in Canada, and I’d genuinely love to help you with parts of the process if that could ease your workload a bit — while also learning from your experience.\n\nI come from a strong marketing/strategy background and I’m very aligned with the idea of building systems that are lighter, more automated, and less dependent on constant social media scrolling. If you’re open to exchanging ideas, collaborating, or even just talking through what could be delegated or automated, I’d be happy to contribute in a respectful and supportive way.\n\nTotally understand the burnout — and I think there’s a smarter way to do this without losing the love for marketing (or nature ).\n\nFeel free to reach out if that resonates",
          "score": 1,
          "created_utc": "2026-02-02 23:51:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3all16",
          "author": "Spiritu342",
          "text": "Managing this stuff for other people gets tiring quite quickly ...",
          "score": 1,
          "created_utc": "2026-02-03 05:29:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3arafh",
          "author": "supriya_l89",
          "text": "You experience social exhaustion because you spend your entire day managing social media accounts. Most agency owners experience this barrier because they must choose between content management delegation or shifting their focus to systems-based channels which include SEO email and advertising and partnership activities. Marketing success does not require social media affection because establishing a dedicated team and building operational procedures typically serves as a permanent solution.",
          "score": 1,
          "created_utc": "2026-02-03 06:15:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bosi4",
          "author": "levichambers_1",
          "text": "i would say this, find the stuff thats actually bothering you. is it the operations? like what? building strategy, creating content, scheduling what exactly.. if you can pin point, you can solve the porblem, hire people if strategy is a bottleneck, if content is draining you hire a content manager and build ai workflows, if scheduling and management, use tools like content studio or buffer.. that will handle day to day activity\n\nif it sales, hire someone for the sales, possibly build a workflow that will also help. its often the 80/20 rule. the 20% of the tsks taht drains all our energy, make sure you identify them and solve them rather stepping away for the business.",
          "score": 1,
          "created_utc": "2026-02-03 11:25:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bsoc3",
          "author": "RibinesExpress",
          "text": "Perhaps it's easier when you work directly for the client and have broader responsibilities. I've been a community manager for a long time (one of my many roles) and I always find a way to motivate myself…",
          "score": 1,
          "created_utc": "2026-02-03 11:56:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3g5vlo",
              "author": "sushiwit420",
              "text": "I create digital marketing strategies videos for 4 clients every week",
              "score": 1,
              "created_utc": "2026-02-04 01:10:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ckb06",
          "author": "Commercial_Mode_7770",
          "text": "Hi! \nI’m a founder myself of a creative agency. Now honestly, you cab automate the whole process but if your clients are sticking to you for what you bring ti the table, they’ll never be happy when you’re not in the picture at all. When it comes to marketing and if you’re great at it; then you’ll always have to step in. \n\nIf you’ve lost the interest then you can just take an exit but if you want to continue then you’ll have to give a lot of you into your business.",
          "score": 1,
          "created_utc": "2026-02-03 14:43:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3g6aax",
              "author": "sushiwit420",
              "text": "Yes. I cannot stop now. When I say I am going on 1 month vacation, my clients first question is how will our social media accounts be? I said don’t worry, before I go visit, there will be my new employee learning from me and will be handling shoots for a month.",
              "score": 1,
              "created_utc": "2026-02-04 01:12:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3gywuf",
          "author": "EarthPrimer",
          "text": "Sora",
          "score": 1,
          "created_utc": "2026-02-04 03:57:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jx4yl",
          "author": "vajanice90",
          "text": "Yes, social media is draining af. I enjoy coming up with content ideas but the actual posting is so exhausting",
          "score": 1,
          "created_utc": "2026-02-04 16:20:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwei3z",
      "title": "Does anyone actually know if reels/shorts are effective… or are we all just winging it?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qwei3z/does_anyone_actually_know_if_reelsshorts_are/",
      "author": "Worldly-Strain-8858",
      "created_utc": "2026-02-05 07:05:51",
      "score": 11,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "Everywhere you turn, the same advice is given: “You must post reels every day,” “Short-form content is the future,” “If you’re not posting shorts, you’re invisible.”\n\nBut when you actually speak with founders and small teams, the truth seems more complicated. Some people get ridiculous engagement. Others post for months and see... nothing.\n\nIt’s almost as if we’re all reading the same playbook without actually understanding why it’s effective when it is and why it’s not when it’s not.\n\nSo, I’m curious, have reels/shorts actually driven growth for your business (leads, sales, actual growth)? Or did they just give you views and feels?\n\nWhat’s been your actual experience?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qwei3z/does_anyone_actually_know_if_reelsshorts_are/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3of40r",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 07:05:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p8lfj",
          "author": "xRyozuo",
          "text": "That is because at the end of the day feeds are driven by various algorithms (google’s, meta’s). And in my limited experience, it seems many don’t do actual research and simply trust someone else’s reading of tea leafs when it comes to tactics",
          "score": 3,
          "created_utc": "2026-02-05 11:40:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pvw47",
              "author": "sUIsters",
              "text": "Was gonna say this, a reel's success is incredibly random. There are so many factors that determine virality and reach on these platforms.\n\nIt's basically marketing gambling.",
              "score": 1,
              "created_utc": "2026-02-05 14:09:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3p21j1",
          "author": "meenoSparq",
          "text": "Many of us are in the same boat. I noticed they bring reach, but the conversion rate is much lower compared to classic posts.",
          "score": 1,
          "created_utc": "2026-02-05 10:43:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q4vko",
          "author": "WovenShadow6",
          "text": "Yes, they are. Times are changing and doom scrolling is becoming the norm especially with the youth. But reels/shorts are a long term investment, you would not get results asap especially for newer brands with not that much exposure yet. Just keep at it, eventually you will reach a much wider audience.",
          "score": 1,
          "created_utc": "2026-02-05 14:56:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3s740k",
          "author": "OrganicClicks",
          "text": "A lot of times they do bring views but conversion rates are quite limited or unreliable. the bigger challenge The problem is algorithm rewards entertainment and quick dopamine hits. So you have to optimize for watch time but end up attracting doom scrollers, rather than a specific target audience.",
          "score": 1,
          "created_utc": "2026-02-05 20:44:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uhj7m",
          "author": "KONPARE",
          "text": "You’re not wrong. A lot of people are winging it, and views are the easiest thing to get that changes nothing.\n\nShorts *can* work, but in my experience they only drive growth when you treat them like a funnel, not a slot machine:\n\n* one clear audience + problem per video\n* repeatable series (same format, different examples)\n* a next step that’s dead simple (DM keyword, link in bio, book, download)\n* and you track something real (leads, calls, email signups), not just plays\n\nIf you post random “tips” every day, you can rack up views and still have zero buyers because nobody knows what you actually do.\n\nAlso, distribution matters. If you’re not repurposing to IG, TikTok, YT Shorts and replying to comments like it’s a sales floor, it’s slower.\n\nWhat kind of business are you talking about? Local service, ecommerce, SaaS, coaching? The payoff is wildly different.",
          "score": 1,
          "created_utc": "2026-02-06 04:25:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3whn03",
          "author": "That-Travel-5697",
          "text": "They bring in views but not converting that well. I think it’s a long term thing and eventually the conversions will come",
          "score": 1,
          "created_utc": "2026-02-06 13:57:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41skeo",
          "author": "pra__bhu",
          "text": "from the paid ads side i can tell you that short-form video creatives (reels/shorts style) are crushing it as ad formats right now - they consistently outperform static images on meta and tiktok for most verticals. so the format itself clearly works for capturing attention.\nbut organic short-form is a completely different game. the people seeing results are usually doing one of two things: either they’re genuinely entertaining/educational and the content stands on its own, or they’re using it as a top-of-funnel play and have an actual system to move viewers toward something (email list, community, product page).\nthe problem with most founders posting reels is they treat it like a checkbox. post daily, use trending audio, hope something hits. but there’s no measurement framework behind it. in paid ads we’d never run campaigns without tracking what actually converts - but people will post organic content for months with zero attribution and just vibes as their metric.\nmy honest take: if you’re a small team with limited time, you’re almost certainly better off spending that same energy on platforms where intent already exists (search, reddit, niche communities) rather than trying to manufacture attention on short-form video. unless you genuinely enjoy creating that content, in which case the consistency will eventually compound.\nshort-form works. but “post reels and pray” is not a strategy.",
          "score": 1,
          "created_utc": "2026-02-07 08:20:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy6tog",
      "title": "DIGITAL MARKETING CHECKLIST 2026",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qy6tog/digital_marketing_checklist_2026/",
      "author": "Equal-Direction-8116",
      "created_utc": "2026-02-07 06:47:48",
      "score": 11,
      "num_comments": 4,
      "upvote_ratio": 0.87,
      "text": "# 1. Strategy\n\n* Clear goal\n* Target audience\n* Unique offer\n* Competitor check\n* Funnel plan\n* KPIs\n\n# 2. Website\n\n* Mobile-first\n* Fast load\n* Clear CTA\n* Lead forms\n* Tracking\n* Trust proof\n\n# 3. SEO\n\n* Intent keywords\n* AI tools\n* Content clusters\n* On-page SEO\n* Local SEO\n* EEAT\n\n# 4. Social Media\n\n* Right platforms\n* Optimized profile\n* Consistent posts\n* Reels/Shorts\n* Strong hooks\n* Storytelling\n\n# 5. Content Marketing\n\n* Blog posts\n* Case studies\n* Infographics\n* Videos & shorts\n* FAQs & guides\n* Lead magnets (PDF, checklist, ebook)\n\n# 6. Paid Ads\n\n* Meta ads\n* Google ads\n* Landing pages\n* Creative tests\n* Retargeting\n* ROAS\n\n# 7. AI & Automation\n\n* AI content\n* AI ad copy\n* CRM tools\n* Chatbots\n* Auto reports\n* Human review\n\n# 8. Email & WhatsApp\n\n* Lead magnet\n* Auto sequence\n* Value emails\n* WA broadcast\n* Segmentation\n\n# 9. Analytics\n\n* GA4 setup\n* Weekly review\n* A/B tests\n* Funnel check\n* ROI focus\n\n# 10. Branding\n\n* Personal brand\n* Visual identity\n* Case studies\n* Linkedin growth\n* Community",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qy6tog/digital_marketing_checklist_2026/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o41imeq",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 06:47:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43yaw9",
          "author": "Perfect-Clothes-6752",
          "text": "Good one",
          "score": 1,
          "created_utc": "2026-02-07 17:13:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qx63rk",
      "title": "Feeling lost after MBA + DM course. What skills should I build to actually get a digital marketing job?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qx63rk/feeling_lost_after_mba_dm_course_what_skills/",
      "author": "ConversationUsed641",
      "created_utc": "2026-02-06 03:02:38",
      "score": 9,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "I completed my MBA in Marketing from a not-so-great college two years ago. Due to some family issues, I couldn’t work during this time. I did finish a 6-month digital marketing course, but honestly, it wasn’t very helpful. It didn’t give me the confidence to run a campaign or handle real tasks the way a proper digital marketer should during recruitment.\nNow I really want to start working in digital marketing but I’m clueless about where to begin.\nWhat skills should I focus on first?\nHow do I build a portfolio while learning?\nAnd how do I start reaching out to people (cold messages, emails, etc.) for opportunities?\nAnyone who has been in a similar situation or is already in the field your guidance would mean a lot. 🙏",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qx63rk/feeling_lost_after_mba_dm_course_what_skills/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3u4joo",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 03:02:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wmrqm",
          "author": "Rich-Editor-8165",
          "text": "the tip is to start with practical skills, not more theory. Pick one lane like SEO, paid ads, or analytics and actually run small real projects, even your own or for friends. Build proof you can execute, not just certificates. Portfolios and real results get interviews way faster than courses.",
          "score": 2,
          "created_utc": "2026-02-06 14:24:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uerg9",
          "author": "swiftpropel",
          "text": "Begin with practical Google Ads/FB Ads certs (free through Skillshop/Meta Blueprint), and make mini campaigns for a make-up store or friends to create a portfolio (screenshots and results in a Notion page). Cold DM recruiters on LinkedIn In who have Hey, built this campaign, feedback? Super assisted me in securing my first gig. You got this. What's your niche?",
          "score": 1,
          "created_utc": "2026-02-06 04:06:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3uk27z",
              "author": "ConversationUsed641",
              "text": "I want to learn social media marketing and content marketing",
              "score": 1,
              "created_utc": "2026-02-06 04:43:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ugtrk",
          "author": "Glocktopus69420Obama",
          "text": "I stumbled into a Director of Digital Marketing position and it all came from my knowledge of Salesforce and Hubspot.  If you don't have some hands on knowledge of HubSpot or Salesforce Marketing Cloud/Account Engagement, think about it.  I actually would love to have the background you do, because a lot of my new job is just flying by the seat of my pants and pulling from my knowledge doing Salesforce implementations.  But it sounds like you feel that your knowledge is all academic/theoretical and not hands on (I might be wrong, I don't mean to tell you how you feel).  But it would round things out nicely if you could add on some technical certifications.  \n\nAlso, nonprofits will often take pro bonk help that would be a great resume builder.  I recommend that for people trying to break into the Salesforce ecosystem.  You can offer some help with a contained project and then have that as hands-on experience you can say you have.  Recruiters are more likely to hire someone who's already working.  It seems really unfair, but it's true.\n\nAnyway, I'm not an expert, but just offering what I know!  Good luck.  I'm happy to answer any questions you have.",
          "score": 1,
          "created_utc": "2026-02-06 04:20:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vkcd8",
          "author": "BandResponsible896",
          "text": "honestly, real experience > any course. try running some low budget ads for a local biz to build a portfolio.",
          "score": 1,
          "created_utc": "2026-02-06 09:57:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy7nqa",
      "title": "How are you approaching monetization for content driven sites in 2025?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qy7nqa/how_are_you_approaching_monetization_for_content/",
      "author": "Udont_knowme00",
      "created_utc": "2026-02-07 07:35:42",
      "score": 9,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "With privacy changes and traffic becoming more fragmented, monetizing content sites feels a lot less straightforward than it used to. A lot of older playbooks still assume clean attribution and predictable CPMs, which does not always match reality anymore.\n\nI have been seeing more teams experiment instead of relying on a single setup, especially on content driven or mixed intent traffic. It feels like monetization today is more about stability and testing than squeezing out peak performance.\n\nCurious how others here are thinking about monetization strategy right now and what has actually been working in practice",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qy7nqa/how_are_you_approaching_monetization_for_content/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o41ntgv",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 07:35:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41qpr8",
          "author": "Cocoatech0",
          "text": "Diversification helped us a lot. We tested different ad networks alongside affiliates and focused on what behaved consistently month to month. Monetag was one of the options that surprised me in terms of predictability.",
          "score": 4,
          "created_utc": "2026-02-07 08:03:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41q60b",
          "author": "pra__bhu",
          "text": "the clean attribution era is basically over and i think a lot of content teams are still running playbooks from 2020 that assumed you could track everything neatly.\nwhat i’m seeing work from the ad side: teams that treat monetization as a portfolio problem rather than trying to find one perfect setup. meaning you run programmatic display for baseline revenue, layer in direct sponsor deals for premium pages, and experiment with affiliate or lead gen on high-intent content. none of them individually are amazing but together they create stability.\nthe biggest shift i’ve noticed is that cpms are way more volatile than they used to be, especially on content-driven traffic where user intent is ambiguous. google’s privacy sandbox changes and the ongoing third-party cookie deprecation are making programmatic less predictable. so the teams doing well are the ones that own their audience relationship - email lists, push notifications, community - because that first-party data is what lets you command better rates from advertisers.\nalso worth looking at the content itself differently. instead of optimizing for pageviews and hoping cpms hold up, some publishers are moving toward fewer but higher-intent pieces that convert better for affiliate or lead gen. less traffic but way better revenue per session.\nwhat kind of content are you working with? the strategy looks pretty different for news vs evergreen vs niche authority sites.",
          "score": 1,
          "created_utc": "2026-02-07 07:57:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o426tuo",
          "author": "Relevant_Morning_213",
          "text": "On some smaller publisher projects we stopped relying on one provider and tested alternatives in parallel. Monetag ended up being more stable than expected for mixed GEO traffic so we kept it in the stack.",
          "score": 1,
          "created_utc": "2026-02-07 10:41:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4294lx",
          "author": "Adventurous-Lake1857",
          "text": "A lot of people still chase perfect CPMs when consistency is probably more important. From a planning standpoint predictable revenue is easier to work with than spikes.",
          "score": 1,
          "created_utc": "2026-02-07 11:03:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43bsak",
          "author": "Comfortable-Ask6893",
          "text": "Diversification is key honestly. Weve seen better stability by mixing ad networks with native ads and sponsored content. Its about finding whats consistent rather than chasing the highest CPMs that might not stick around.",
          "score": 1,
          "created_utc": "2026-02-07 15:22:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwkz6i",
      "title": "Enterprise marketers: would you ever run media on a platform without SOC 2?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qwkz6i/enterprise_marketers_would_you_ever_run_media_on/",
      "author": "NiceStraightMan",
      "created_utc": "2026-02-05 13:15:39",
      "score": 8,
      "num_comments": 15,
      "upvote_ratio": 0.85,
      "text": "I'm evaluating some newer CTV platforms that have solid targeting and pricing but no SOC 2 compliance yet. My legal team is flagging it as a risk, but the performance potential looks promising. For those running enterprise budgets, is SOC 2 a hard requirement or more of a nice-to-have? How do you balance compliance requirements with testing new channels that could help diversify beyond the usual suspects?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qwkz6i/enterprise_marketers_would_you_ever_run_media_on/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3pmefq",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 13:15:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ppa9q",
          "author": "fave_slinger",
          "text": "The risk is super crazy when you're managing serious budgets. Don't know why you want to go that way when there's plenty of SOC compliant self-serve platforms in existence.",
          "score": 1,
          "created_utc": "2026-02-05 13:32:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pzrr0",
              "author": "NiceStraightMan",
              "text": "My pull is diversification & CPM efficiency, not recklessness.",
              "score": 1,
              "created_utc": "2026-02-05 14:30:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pq1x1",
          "author": "Former_Tea1131",
          "text": "Hard pass. Legal flagged it for a reason. Data breaches cost way more than any performance gains you're looking to see. But you do know this, right? ",
          "score": 1,
          "created_utc": "2026-02-05 13:36:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pzum5",
              "author": "NiceStraightMan",
              "text": "Totally hear you. I’m not chasing hero metrics at the cost of trust. I’m just pressure-testing whether legal risk always has to kill early discovery",
              "score": 1,
              "created_utc": "2026-02-05 14:30:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pz3vx",
          "author": "oreynolds29",
          "text": "From an enterprise lens, SOC 2 isn’t optional, However,  I still carve out a tiny innovation budget for compliant self-serve. We isolate data, block uploads, and treat it like a lab, not production.",
          "score": 1,
          "created_utc": "2026-02-05 14:26:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q08my",
              "author": "NiceStraightMan",
              "text": "That’s close to my thinking. Tiny budget, no uploads, no joins, just signal. The real hurdle is legal buying the sandbox.",
              "score": 1,
              "created_utc": "2026-02-05 14:32:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3r30pa",
          "author": "Important_Winner_477",
          "text": "For Enterprise, the dealbreaker isn't just \"security\" it’s the **Data Processing Agreement (DPA)**. If you're feeding them first-party customer data for targeting, Legal will likely block it; however, if you can run the media using only their platform data or a \"clean room\" approach, you might bypass the SOC 2 requirement. Push for a \"low-risk pilot\" with limited data exposure to prove performance before forcing the compliance hurdle",
          "score": 1,
          "created_utc": "2026-02-05 17:37:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3sefs5",
              "author": "NiceStraightMan",
              "text": "I was missing the dpa vs soc 2 nuance.  What concerns me is whether paltfor-only pilots will reflect real performance",
              "score": 1,
              "created_utc": "2026-02-05 21:19:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3sbdut",
          "author": "InevitableImpress850",
          "text": "If you are testing on first party data, enforce compliance. We only validate performance through compliant self-serve platforms like vibe. co. We only use sandbox when testing inventory, not performance.",
          "score": 1,
          "created_utc": "2026-02-05 21:04:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3sesh6",
              "author": "NiceStraightMan",
              "text": "ave you ever seen strong performance signals from inventory-only tests, or is it mostly directional?",
              "score": 1,
              "created_utc": "2026-02-05 21:21:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3td861",
          "author": "KNVRT_AI",
          "text": "Your legal team is right to flag it honestly. At the enterprise level SOC 2 isn't really a nice to have, it's table stakes for anything touching customer data or significant ad spend. The performance potential doesn't matter if a data incident tanks your brand reputation or triggers a compliance nightmare that costs 10x what you saved on CPMs.\n\nThat said there's a middle ground. We've had clients test newer platforms with limited budgets using anonymized or aggregated data only, no PII, no pixel data, nothing that creates real exposure. Run it as a proof of concept with strict guardrails so you can validate the performance claims before pushing legal to do a full vendor review. If the results are legit, that gives you actual data to justify the compliance investment on their end or yours.\n\nThe reality is most of these newer CTV platforms will get SOC 2 eventually if they want enterprise money. Some of them are actively in the audit process and just haven't completed it yet which is very different from a platform that has no plans to pursue it. Worth asking them directly where they are in that process because \"we're mid audit expected Q3\" is a completely different conversation than \"we haven't started.\"\n\nOne thing I'd push back on though is the framing of compliance vs performance as a tradeoff. The platforms that skip compliance to move fast are also usually the ones with inflated performance metrics, sketchy inventory sourcing, or attribution that falls apart under scrutiny. Not always but often enough that the correlation is worth paying attention to. Our clients who've chased shiny new platforms without proper vetting have gotten burned more often than not, sometimes with ad fraud issues they didn't catch for months because the reporting looked great on the surface.\n\nIf the targeting and pricing really are that good, give them 6 months to get compliant and revisit. Plenty of proven channels to optimize in the meantime.",
          "score": 1,
          "created_utc": "2026-02-06 00:21:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3x7nhx",
          "author": "Foundry25",
          "text": "Yeah, I wouldn’t run real budgets without SOC 2. If you *have* to explore it, frame it like R&D: limited spend, data-minimized setup, and vendor roadmap/DPA in writing so legal isn’t guessing.",
          "score": 1,
          "created_utc": "2026-02-06 16:07:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtl165",
      "title": "If you want success in digital marketing, start by finding a problem to solve. I see so many new people dive right into ads and spending money for no reason.",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qtl165/if_you_want_success_in_digital_marketing_start_by/",
      "author": "Confident-Smile-7161",
      "created_utc": "2026-02-02 04:20:31",
      "score": 8,
      "num_comments": 11,
      "upvote_ratio": 0.99,
      "text": "Beginners jump straight to products, ads, and platforms. But none of that matters if you are not helping anyone fix something that is broken first.\n\nPick a niche, listen to what people are struggling with, and build something that makes their life a little easier. understanding and supporting the people in your niche  builds trust and authority, they naturally pay attention, and that is where sales come from.\n\nDigital marketing is more about solving problems than it is selling things.\n\nIf you have any questions, or ideas for problems you want opinions on, leave them below.",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qtl165/if_you_want_success_in_digital_marketing_start_by/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o33mfuh",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 04:20:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33q1d6",
          "author": "GrowthandCoffee",
          "text": "Yes, very true! I agree to this. Solving a problem and clearly explaining it to different categories of target audience also matters. \n\nPeople sometimes use superficial language to represent their product. What really matters is, clearly explaining the problem, writing what the solution is, and how it solves the issue. And this has to be expressed in simple and easy-to-read language. Also, the content has to have a proper flow and be to the point. ",
          "score": 3,
          "created_utc": "2026-02-02 04:44:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33stbo",
              "author": "Confident-Smile-7161",
              "text": "Exactly, Clearly providing a solution to a problem and clearly guiding your target audience in a language that they understand.",
              "score": 2,
              "created_utc": "2026-02-02 05:04:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35gjp4",
          "author": "ChestChance6126",
          "text": "Agreed, and I’d add that the problem has to be specific enough to test, not just vaguely “painful.” A lot of beginners pick a niche, but never narrow down the exact moment when someone feels stuck or frustrated. That’s why ads feel random to them. When you start with a real problem, the messaging almost writes itself, and distribution choices get simpler. Selling is just the side effect of being clear about who you’re helping and how.",
          "score": 3,
          "created_utc": "2026-02-02 13:26:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33z8iz",
          "author": "Single-Use1800",
          "text": "Absolutely agree! Digital marketing should always start with understanding the needs of your audience and solving real problems. Building trust and providing value first naturally leads to sales. Great advice for anyone starting out!",
          "score": 2,
          "created_utc": "2026-02-02 05:52:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35qekp",
          "author": "Ok_Addition3639",
          "text": "Absolutely. There's a reason why the very first step in setting up any campaign is selecting an objective.\n\nIf you skip the \"problem solving\" part, you’re basically just throwing money at the platform without knowing how you want it back.\n\nWe always tell clients that every dollar spent is a bid for a specific outcome. If you haven't identified the  problem, you can't possibly define that outcome to the algorithm. For instance - you might get cheap clicks, but you won't get conversions because your product isn't actually landing as a solution to anything.\n\nYou have to know exactly what \"success\" looks like before you spend a single dollar, otherwise you're just donating money to the ad network.",
          "score": 2,
          "created_utc": "2026-02-02 14:21:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3u4lsc",
          "author": "sawaisingh",
          "text": "This is solid advice.\n\nMost beginners confuse *activity* with *value*.\n\nAds only work when there’s already a clear problem–solution fit.\n\nIf you don’t know exactly **whose problem you’re solving and why it hurts**, spending money just speeds up failure.\n\nMarketing doesn’t create demand - it reveals whether demand exists.",
          "score": 2,
          "created_utc": "2026-02-06 03:03:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3u6ktw",
              "author": "Confident-Smile-7161",
              "text": "Thank-you, I appreciate that.\nI couldn't agree with what you're saying more.",
              "score": 1,
              "created_utc": "2026-02-06 03:15:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3vughv",
                  "author": "sawaisingh",
                  "text": "Appreciate it.\n\nThreads like this help beginners avoid learning the hard (and expensive) way.\n\nIf people pause and ask *“what problem am I actually solving?”* before touching ads, half the frustration in marketing disappears.",
                  "score": 1,
                  "created_utc": "2026-02-06 11:27:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3oehed",
          "author": "Jumpy_Climate",
          "text": "Yep been doing this 20 years and helped 1000s. This is the way.",
          "score": 1,
          "created_utc": "2026-02-05 07:00:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxco4c",
      "title": "Need advice - how to market this idea?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qxco4c/need_advice_how_to_market_this_idea/",
      "author": "OkMap12",
      "created_utc": "2026-02-06 08:59:50",
      "score": 7,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I need some advice on how to market a free Web App that I am currently building.\n\nThe app is within the personal finance niche - its going to be free with people able to support (otherwise I cannot cover the running costs).\n\nSo yeah that being said I really have no fancy branding, budget or anything like that. Just created something that works for me and want some ideas on how to share it with the world...where better to start than asking reddit?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qxco4c/need_advice_how_to_market_this_idea/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3ved6a",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 08:59:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vgcsn",
          "author": "pra__bhu",
          "text": "honestly the best marketing with zero budget is just being active where your users already hang out. for personal finance stuff that’s places like r/personalfinance, r/ynab, r/frugal, maybe even tiktok/youtube if you’re up for it.\nbut don’t just drop links - nobody wants that. share the thinking behind why you built it. what problem were you solving for yourself? post about that journey and let the app be the natural answer. people connect way more with “i was frustrated with X so i built this thing” than “check out my app.”\na couple things that worked for me when i was figuring this out for my own side project:\n\t∙\tfind threads where people are complaining about the exact problem you solve, and genuinely help them. mention your tool only if it’s actually relevant\n\t∙\twrite a solid launch post for r/SideProject when you’re ready - be honest about what it does and doesn’t do\n\t∙\tif you can swing a simple landing page with an email signup, do that before launch so you’re not starting from zero on day one\nthe “free with support” model is tough though ngl. you might want to think about what a lightweight paid tier could look like eventually, even if it’s just $3/mo for extra features. gives you something sustainable without feeling like you’re nickel and diming people.\nwhat’s the app actually do? happy to give more specific ideas if you share a bit more",
          "score": 2,
          "created_utc": "2026-02-06 09:19:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vgr86",
              "author": "OkMap12",
              "text": "Thank you for this ideas, I was exactly hoping for something like this. The 3$ mo for extra features, worries me regarding the regulations (VAT), so currently I am thinking to simply sticking with buy me a coffee or something as that might be simpler in the beginning. Not so sure how to approach this - but this is one of those things I will need to cross in due time.\n\nStill a lengthy road ahead",
              "score": 1,
              "created_utc": "2026-02-06 09:23:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vh4c8",
          "author": "Responsible_Brief637",
          "text": "(YT) Content Marketing and Reddit Communities as well as seo/geo optimization of your website",
          "score": 1,
          "created_utc": "2026-02-06 09:26:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu31ap",
      "title": "Client devaluing my work - but can't afford to lose the client",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qu31ap/client_devaluing_my_work_but_cant_afford_to_lose/",
      "author": "Objective-Ad6521",
      "created_utc": "2026-02-02 18:22:17",
      "score": 6,
      "num_comments": 18,
      "upvote_ratio": 0.76,
      "text": "I can make social media posts fairly quickly - because I've been doing it for over 15 years. And the.... boss (I'm a freelancer, but the job was positioned as if their employee, but I still have all contractor rights, which is fine) has pushed back a number of times to a 'package' rate, because the scope has outgrown the role. \n\nThe boss's excuse is that \"I'm asking you to do the things I'd be doing anyways... that's your role description\". I say \"That's outside of the scope\" and then it's always \"I don't understand why you don't just want to keep it to an hourly, since you're doing what I would be doing anyways\" and I say, \"I shouldn't be penalized for doing things quickly\" to which there is NO response and then goes back to \"I don't understand..... why can't you just be like \\[former person who filled the role\\]\". To which it becomes a circular arguement and so I usually say, \"If you were to hire someone else, they would be doing this slower\" to which there's again no response to THAT...\n\nI know many of you will say, stop working for them - but you probably already see how devalued marketing in general is due to AI, and we are in a depression, whether it's official or not. The types of clients I usually work with - owner operated businesses - just don't have the budget or if they do they splurge it on ads by a bro agency. And because of some personal happenings for the past few years, it's been tough getting back on track financially - so I need any work I can get.\n\nBut I'm also at a point where I can't devalue my skills and knowledge so much that I end up doing SO much for them at a low rate, which eats into my time into rebuilding a proper portfolio and retarget a niche that actually will pay for my skills - AND doing sales and networking while trying to convince people to pay for \"something AI can do\" and \"if AI can't do it, then prove me your conversion rate and why I should choose you over others\".\n\nMy skills is in organic social media and high quality content that builds brands over time. But that comes with a certain presentation and aesthetic etc etc. So I know the game. \n\nI'm just trying to figure out..... how do I come with stats and a reasonable boundary when they say \"sure, but don't spend too much time on it\" because they don't want to pay even the amount it takes to make the post... because \"well, you're just using AI - it should take 15 minutes\" even though I'm creating the design from scratch, yes repurposing their prior content, but I have to search for the right image, design it, curate the caption, hashtags - and that's not including engagement to actually get the post seen by a wider audience... \n\nOr listen - if y'all need a white label unicorn, I can send over my portfolio(s) and work out a rate where I don't have to deal with clients ;)",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qu31ap/client_devaluing_my_work_but_cant_afford_to_lose/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o375box",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 18:22:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3a65v7",
          "author": "anajli01",
          "text": "You’re stuck in the speed-vs-value trap.\n\nQuick fixes:\n\n* Stop justifying time → price outputs (posts/week, revisions, engagement).\n* When scope grows, ask: *“What should I deprioritize to stay in scope?”*\n* One-liner for AI: *“AI speeds execution, not strategy.”* Don’t debate it.\n* Deliver exactly what their budget buys. No extras.\n\nYou’re not overcharging they’re anchoring to effort, not expertise. Use this client to fund your exit, not drain you.",
          "score": 3,
          "created_utc": "2026-02-03 03:43:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ai7bg",
          "author": "PugglePack83",
          "text": "Stop devaluing yourself.  It takes a person to run the ai effectively.  It takes experience to have a competent strategy.  It takes competence to execute.",
          "score": 2,
          "created_utc": "2026-02-03 05:04:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3doorg",
              "author": "Objective-Ad6521",
              "text": "Thank you - the word 'competency' has been circling my mind - rather than use any other parameter to showcase value, I believe competency is what this client values and can leverage that. I wasn't hired to be a strategist, and have said that I will charge more if I have to come up with the strategy, and it's been a learning experience to stop myself before suggesting solutions, and simply presenting A/B options and forcing them to choose - which is what they don't do, they waffle about until someone says enough and chooses, but complains if people don't 'step up' or leave because they \\[client\\] refuses to lead.",
              "score": 1,
              "created_utc": "2026-02-03 17:54:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3kahfr",
          "author": "Visual_Arrival_5815",
          "text": "The speed-value trap is brutal. Client gets deliverable fast, assumes it was \"easy\", then bases future expectations on that.\n\nThe \"why can't you just ...\" argument you described happens when there's no documented scope to point to. Without a brief, they define \"reasonable effort\" retroactively.\n\nCurious—do you have any intake workflow before you start a project? Something that captures what's in scope vs. out of scope, number of revisions, what \"done\" looks like?\n\nI've found that even a simple intake form changes the conversation from \"why did this take so long\" to \"that wasn't in the original scope—here's what a change order looks like.",
          "score": 2,
          "created_utc": "2026-02-04 17:21:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38ai5d",
          "author": "Ashley_said_what",
          "text": "Honestly, if I was you, I’d slowly transition into working slower (or pretending to) and chill out the rest of the hours. If they don’t see your value, don’t over explain. Work out what works best for you without losing the client",
          "score": 2,
          "created_utc": "2026-02-02 21:34:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3efj4h",
              "author": "Objective-Ad6521",
              "text": "Thanks for the advice - I'm def doing that, but they're also very micro-managing where 'why did this post take 2 hours when it's just ai'. I can absolutely just do as they ask, but can also sense resentment building and a feeling of 'why isn't this converting clients' to the point where they throw in the towel and say, I'll do it myself and still fire me. Trying to walk the line, I know I have to get out soon. This was a good wake up, as someone else said.",
              "score": 1,
              "created_utc": "2026-02-03 19:56:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3ht55v",
                  "author": "Ashley_said_what",
                  "text": "You have a lot a patience dealing with that, if they ask me that I’d sit back and ask them, “why do you think it’s ai?” And ask why they’re undermining my work (my talent, my experience). Honestly a way out would be the best for you. No amount of paid client work is worth this mental turmoil. You deserve to be recognized for your work",
                  "score": 1,
                  "created_utc": "2026-02-04 07:49:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3dl7p1",
          "author": "Camilla_for_business",
          "text": "I said this elsewhere, but oof. Sounds really rough to go through OP. \n\nIt seems you've already had some quarrel with this person. I don't think negotiating with them further will fix it, since they seem to already have an idea of who you are, what you are for, and so on. \n\nStart looking for other jobs or clients, OP. Keep your options open and develop your skillset to help more mature companies.\n\nI'd say this is a wake-up call to get back on track. Best of luck! Also, sent you a DM",
          "score": 1,
          "created_utc": "2026-02-03 17:38:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3dpc2e",
              "author": "Objective-Ad6521",
              "text": "We've had a few head butts but I'm a very flexible and forgiving person, and can focus on the task at hand without taking anything personally but also not letting them walk all over me, having worked with higher tier creatives that operate on a much faster level and who take a tad more self responsibility. I already advocated for even a $5 raise, I took a pay cut because of a cross-country move and recognize locally the economy is different than LA/NY. Def working on getting back on track  - the landscape has changed so much and with AI.... well, we're all in this together. I'll respond to you DM - thank you",
              "score": 1,
              "created_utc": "2026-02-03 17:56:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3frmhb",
          "author": "Objective-Ad6521",
          "text": "PS - stole this strategy from a peer at the same company... to use AI to analyze timesheets without including any bias in the prompt to determine fair rate based on speed, descriptions, decision making responsibility, quality output and communication style.",
          "score": 1,
          "created_utc": "2026-02-03 23:51:49",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o3i5po5",
          "author": "Chance-Tower-7926",
          "text": "Before I transitioned to project pricing and charged by the hour I had a set time in my head for how long each social post would take and I stuck to it. I think it was around 15-minute per post (text only no graphics), so I'd charge for an hours work for 4 posts.",
          "score": 1,
          "created_utc": "2026-02-04 09:48:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mtsrq",
          "author": "LeastMostMaybeNow",
          "text": "Don't devalue yourself.  You'll resent them and hate that you didn't stick up for yourself. \n\nYou're battling emotions with facts; I have never been able to convince clients like this with facts. \n\nClients are used to hourly and because it gives them flexibility which means they don't know what we want.  Fixed fee is great for companies and vendors.  The client just needs to know what they actually want to do so it can be priced appropriately. \n\nSo I have this conversation ALOT in consulting. Don't engage in their time/money/flexibility arguments because that's not the game you're playing.  You aren't selling them this. You deliver them valuable assets with presence that speaks to the companys quality, culture and authority.  Your price is based on your expertise, which was developed over years of work.   Sell the expertise. Who cares what tools you use to turnaround their things faster without impacting quality.  Sell how your efforts impact their deliverables, timelines and bottom line. contrast that with the client needing to find someone else and spend employee time during that whole process. Nevermind onboarding blah blah blah.  \n\nSounds to me like they need you and trying to squeeze blood from a stone. Don't buckle.  Keep the job but look for others.  This client sucks.",
          "score": 1,
          "created_utc": "2026-02-05 00:49:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3n6j2i",
              "author": "Objective-Ad6521",
              "text": "Thank you very very much for the reflection! It's important to hear it from others, when working in silo",
              "score": 1,
              "created_utc": "2026-02-05 02:02:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3narox",
                  "author": "LeastMostMaybeNow",
                  "text": "It's so easy to get inside your own head and mess yourself up and not have a firm grip on what's reasonable. Get some colleagues in the same line of work that you can gripe to. Those people are so valuable just to maintain your sanity.",
                  "score": 1,
                  "created_utc": "2026-02-05 02:26:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3aounh",
          "author": "Payote88",
          "text": "Fire them",
          "score": 1,
          "created_utc": "2026-02-03 05:55:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qv3q0q",
      "title": "Just starting my carrer...",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qv3q0q/just_starting_my_carrer/",
      "author": "Nibedita_B_S",
      "created_utc": "2026-02-03 20:46:38",
      "score": 6,
      "num_comments": 6,
      "upvote_ratio": 0.88,
      "text": "Agency life reality check: From student to trainee at Publicis, tips for surviving long hours?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qv3q0q/just_starting_my_carrer/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3eq2er",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 20:46:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hn9tu",
          "author": "stpauley45",
          "text": "You are a slave now. They sell your time to clients. Learn as much as you can and then go client side. There is no secret sauce or special knowledge at Publicis. Scarcity of knowledge is no longer a thing.",
          "score": 3,
          "created_utc": "2026-02-04 06:57:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ht6js",
              "author": "Nibedita_B_S",
              "text": "Noted..",
              "score": 1,
              "created_utc": "2026-02-04 07:50:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hlfxq",
          "author": "admatic-anz",
          "text": "Good luck on your career! and welcome to the industry! \n\nAlthough we've been able to maintain a culture that minimises long hours (if we have them at all now), here are some tips we teach our team within our agency:\n\n\\- build simple habits so they're easy to carry out consistently (consider using the below in the simplest ways that makes sense to you)\n\n\\- writing things down immediately\n\n\\- block times for focus work\n\n\\- ask 'why' early and not late (when you don't understand something, fire away)\n\n\\- Use feedback to sharpen your thinking, not question your worth\n\n\\- find a person ahead of you that you can learn from (think of someone whose pace, judgement, or calm you respect. Watch how they handle pressure, prioritise, and say no)\n\n\\- make de-stressing sacred to you, and protect your hobbies / interest outside of work immensely\n\n\n\nHope at least one of these help!",
          "score": 2,
          "created_utc": "2026-02-04 06:42:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ht3du",
              "author": "Nibedita_B_S",
              "text": "Thanks alot..:-)",
              "score": 1,
              "created_utc": "2026-02-04 07:49:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3v5q9d",
          "author": "Cold-Dark4148",
          "text": "Yuh everyone says go client side as fast as possible. What do you search for that in seek?",
          "score": 1,
          "created_utc": "2026-02-06 07:38:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtxgjj",
      "title": "Email engagement is holding steady, but incremental lift from campaigns is shrinking.",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qtxgjj/email_engagement_is_holding_steady_but/",
      "author": "addllyAI",
      "created_utc": "2026-02-02 15:05:13",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 0.86,
      "text": "For mature lists with high deliverability, what experiments have genuinely moved revenue, and what tactics looked promising but lost momentum fast?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qtxgjj/email_engagement_is_holding_steady_but/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o35yuhu",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 15:05:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o369jbp",
          "author": "No_Hedgehog8091",
          "text": "Refine segmentation using RFM metrics, then test dynamic content blocks to boost personalization and re-engage stagnant subsets, often yielding a 15-25% revenue lift from targeted campaigns.",
          "score": 1,
          "created_utc": "2026-02-02 15:56:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hoi9a",
          "author": "DBK85",
          "text": "For mature email lists with high deliverability, I'd be curious to hear what experiments have genuinely boosted revenue and what tactics showed promise initially but fizzled out. Sharing those insights could really help others in a similar situation optimize their campaigns.",
          "score": 1,
          "created_utc": "2026-02-04 07:08:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qukvw6",
      "title": "What metric do you track now that you ignored in the beginning?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qukvw6/what_metric_do_you_track_now_that_you_ignored_in/",
      "author": "chambialharsh",
      "created_utc": "2026-02-03 06:47:31",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Early on, I focused mostly on traffic and signups—it felt like progress.\n\nWhat’s the one metric you track now that you ignored in the beginning?\nWhat changed once you started paying attention to it?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qukvw6/what_metric_do_you_track_now_that_you_ignored_in/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3av2bz",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 06:47:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g9awx",
          "author": "Klutzy_Pizza_8935",
          "text": "100% retention",
          "score": 2,
          "created_utc": "2026-02-04 01:29:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qlzrc",
          "author": "Yapiee_App",
          "text": "For me it was returning users. Traffic looked great early on, but once I started watching who came back, it became obvious which work was actually creating value versus just attracting curiosity.",
          "score": 1,
          "created_utc": "2026-02-05 16:18:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}