{
  "metadata": {
    "last_updated": "2026-02-13 03:16:08",
    "time_filter": "week",
    "subreddit": "digital_marketing",
    "total_items": 20,
    "total_comments": 226,
    "file_size_bytes": 202172
  },
  "items": [
    {
      "id": "1r0u9r0",
      "title": "AI is NOT taking our jobs. Chill, people!",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r0u9r0/ai_is_not_taking_our_jobs_chill_people/",
      "author": "Far-Panic3458",
      "created_utc": "2026-02-10 07:20:45",
      "score": 68,
      "num_comments": 59,
      "upvote_ratio": 0.75,
      "text": "I have been running my own marketing agency for quite a few years now and have been interacting with various clients. From startups to corporations, I have done marketing for them all. And I can hardly recall using the same strategy for more than 2 clients. Each one has their own flair, their own style or a “human touch” as i like to say that makes their marketing unique. Sure there are now tools like Blobr AI, LocalQ or Ryze AI that can automate reports but to say that they can replace our work is downplaying our role, undermining our experiences. How does AI train itself? By regurgitating information that humans have already done in the past. Hypothetically, if humans were to be replaced, there would come a point where AI wouldn’t be able to offer any sort of new or beneficial suggestions. And who would come to its aid then? So, the next time anyone says that marketing is going to be majorly automated, do enlighten them :)",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r0u9r0/ai_is_not_taking_our_jobs_chill_people/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4ksnkq",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 07:20:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lkaav",
          "author": "Firm_Distribution999",
          "text": "So… tell that to the marketing team that got laid off because a junior role can just babysit the AI tools for all of the projects now",
          "score": 18,
          "created_utc": "2026-02-10 11:39:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ltyth",
              "author": "three_s-works",
              "text": "I don’t think that’s happening and I’ve been jobless for 6 months. “It’s the economy, stupid”",
              "score": -6,
              "created_utc": "2026-02-10 12:49:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4m2nas",
                  "author": "Firm_Distribution999",
                  "text": "it absolutely IS happening. nobody can get marketing jobs at the moment. HR jobs are next. major layoffs and no job openings. I currently live in a country, not the US, where our job market is absolutely in the gutter with record high unemployment. if you don't think AI tools have anything to do with it, then you're kidding yourself.",
                  "score": 12,
                  "created_utc": "2026-02-10 13:41:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4l1lt6",
          "author": "Other_Exercise",
          "text": "I do think, however, that clients are going to increasingly be looking for lower prices, now they know everyone can create more due to AI. Just how like the value of hand weaving declined when the power loom came along.",
          "score": 3,
          "created_utc": "2026-02-10 08:46:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kzyaf",
          "author": "chrismcelroyseo",
          "text": "I'm just waiting for all the butt butt people that are going to come in and disagree with you. \n\n\"But you just have to know how to prompt it properly.\" \n\n\"But once you dial in the prompts it’s basically flawless.\" \n\n\"But prompt engineering is a skill and most marketers just haven’t learned it yet.\"\n\n\"But I use a tool that does all my SEO automatically and my traffic went up.\"\n\n\"But my AI writes blogs, posts them, interlinks them, and I rank fine.\"\n\n\"But tools already replace most agencies.\"\n\n\"But why would I pay a marketer when software does it cheaper?\"\n\n\"But AI is here now so you just have to adapt or get left behind.\"\n\n\"But Google hasn’t penalized me yet.\"\n\nAs you see I've been collecting all of the butt butt posts that I could find.",
          "score": 3,
          "created_utc": "2026-02-10 08:30:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ksvlg",
          "author": "Crescitaly",
          "text": "100% agree with the core point here. The marketers I see struggling are the ones who were basically doing what AI does - cranking out generic blog posts, writing cookie-cutter ad copy, building templated strategies. Yeah, AI can do that now.\n\n\n\nBut the ones who actually understand their client's business, who can read between the lines of data and say \"here's why this campaign flopped even though the numbers look fine on paper\" - AI isn't touching that.\n\n\n\nWhat I've noticed is that AI is actually making good marketers even better. I use it to handle the grunt work (first drafts, data organization, brainstorming) which frees me up to spend more time on strategy and client relationships. That's where the real value is.\n\n\n\nThe human touch thing you mentioned is spot on. Every client has a different voice, different audience, different goals. AI can approximate that but it can't truly understand the nuances. I had a client in a very niche B2B space and every AI-generated piece sounded like it was written for a generic SaaS company. The industry-specific knowledge and tone just wasn't there.\n\n\n\nSo yeah, AI is a tool upgrade not a replacement. The people worried about it are probably the ones who need to level up their actual skills.",
          "score": 11,
          "created_utc": "2026-02-10 07:22:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ktqag",
              "author": "Far-Panic3458",
              "text": "So so agree! I understand being worried but i don't understand leaving the industry. Like it or not, AI is gonna be around. But we make ourselves useful, learning shouldn't stop! AI can be a great addition but it can never replace your practical experience",
              "score": 1,
              "created_utc": "2026-02-10 07:30:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4kwc7b",
                  "author": "Crescitaly",
                  "text": "Exactly right. The practical experience part is what separates average marketers from the ones clients actually want to keep. AI can draft a decent email or suggest keywords, but it can't sit in a meeting and read the room, or know that a particular client's audience responds better to humor than corporate speak. That intuition comes from years of doing the work. The people who embrace AI as a tool while continuing to sharpen their human skills are going to be in a really strong position.",
                  "score": 1,
                  "created_utc": "2026-02-10 07:55:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4kuihp",
          "author": "barely_qualified_fr",
          "text": "Ikr, this gets overstated all the time. AI changes “how” we work, not “why” the work exists. Marketing still depends on judgment, context, and understanding what makes a specific audience care, and that’s something that’ll never be fully automated.\n\nWhere AI helps is taking care of repeatable, low-value tasks so humans can spend more time on strategy and decision-making. The human layer doesn’t disappear; infact it’s more important than ever now.\n\nTeams that treat AI as an assistant/helper rather than a “replacement” seem to get the most value without losing the human touch.",
          "score": 5,
          "created_utc": "2026-02-10 07:38:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kztj3",
              "author": "Acceptable_Film556",
              "text": "This. I remember the first wave of panic when ChatGPT just appeared. Few years later I only have more and more work, balancing full time with side projects and our own pet one 😅",
              "score": 2,
              "created_utc": "2026-02-10 08:28:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4r3xvh",
              "author": "Jenikovista",
              "text": "But it does not take nearly as many people to do the same work today as it did 5 years ago.",
              "score": 1,
              "created_utc": "2026-02-11 05:43:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lk8zz",
          "author": "Aggravating-Key6628",
          "text": "The nuance most people miss in this debate is that AI is not replacing marketers - it is replacing the parts of marketing that were already commoditized. Writing generic ad copy, pulling reports, scheduling posts. That stuff was already heading toward $15/hr VA territory before AI showed up. What is actually happening is the floor is rising. The baseline competence a client expects from day one is higher now because they have seen what ChatGPT can do. So the differentiator is not that you can write copy - it is that you know which copy to write, for which audience, at which stage. Strategy and judgment are harder to automate than people think.",
          "score": 2,
          "created_utc": "2026-02-10 11:39:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4md6o2",
          "author": "theRetrograde",
          "text": "I run a company of 14 employees - it was 12 until yesterday when we hired 2 new employees.\n\nYour points are well taken.  However, AI IS going to lead to a reduction in the digital marketing and programming workforce - industry wide.  But I think it will impact major corporations more than small shops and I actually see AI a major advantage for small agencies like mine.  \n\nWith its current capabilities, AI does more to increase the capacity and output of a competent marketer or programmer.  This likely results in fewer people needed industry wide. \n\nI think it will also lead to new opportunities and perhaps spinoff industries.  \n\nThe role of my employees and their daily activities will probably change significantly over the next few years.  I am optimistic that it will be an improvement for everyone.  We will do better, more thorough work with the help of AI.  We can spend more time on marketing strategy, a little less time on implementation and a lot less time on observation and reporting.\n\nBut there are definitely new threats to my business.  The largest and most uncontrollable is how consumers use AI to search, find products, get their news etc.",
          "score": 2,
          "created_utc": "2026-02-10 14:38:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l16od",
          "author": "Existing-Cod5443",
          "text": "Absolutely, we use AI for more smart or instead of hard work",
          "score": 1,
          "created_utc": "2026-02-10 08:42:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l4mc5",
          "author": "Low_Confection_2433",
          "text": "I 100% agree with this. AI can help us and define how we work, sometimes for good and sometimes for worse, but it's hard to foresee a near future where it can replace human expertise and relationships. \n\nThe best way to handle this is to specialise using AI to improve your skills and become better at something, not just letting the AI handle your job. ",
          "score": 1,
          "created_utc": "2026-02-10 09:16:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4liq4j",
          "author": "NaturalEase2367",
          "text": "I fully agree",
          "score": 1,
          "created_utc": "2026-02-10 11:26:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lkq87",
          "author": "kra73ace",
          "text": "Marketing is about differentiation and claiming a niche, if not a category.\n\nAI is averaging down, so that regardless of where you start in terms of positioning, you always drift towards the center.\n\nThat's my usual criticism when \"chatting\": \"great, that works for Google Cloud but it's way to ambitious for us.'",
          "score": 1,
          "created_utc": "2026-02-10 11:43:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lsex4",
          "author": "Fit-Donkey-3181",
          "text": "YES! Preach this harder!! AI can automate reports and spit out generic content, but it can’t read a client’s room, understand their brand voice, or pivot strategy when market trends shift. Tools like Blobr and Ryze are great helpers, but they’ll never replace the human ability to build relationships and think creatively",
          "score": 1,
          "created_utc": "2026-02-10 12:39:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lttju",
          "author": "three_s-works",
          "text": "A shitty economy is taking the fall for a flood of productivity tools",
          "score": 1,
          "created_utc": "2026-02-10 12:48:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4sg71v",
              "author": "Bweasey17",
              "text": "I agree with this.   Lot of people getting let go for reasons other than performance.   Economy isn’t in the tank as some say, but it isn’t thriving like the administration claims.",
              "score": 1,
              "created_utc": "2026-02-11 12:43:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lw1mm",
          "author": "chayprabs",
          "text": "Running ads needs a human touch that AI wont be able to compete with. Atleast for now.",
          "score": 1,
          "created_utc": "2026-02-10 13:02:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lx2m1",
          "author": "Calm_Ambassador9932",
          "text": "I agree with this take. AI is great at scaling patterns, but marketing lives in the exceptions, the nuance, the context that only shows up when you actually work with people. If anything, the more automation we get, the more valuable human judgment and taste become.",
          "score": 1,
          "created_utc": "2026-02-10 13:09:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m5m9f",
          "author": "Careless-Parsnip-248",
          "text": "Yeah I’m with you on this. AI’s great at speeding things up, but it doesn’t replace judgment, context, or that human read on a business that actually makes marketing work. Every client’s different and that nuance is the job. Tools change, but the thinking part hasn’t gone anywhere.",
          "score": 1,
          "created_utc": "2026-02-10 13:57:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mb4b8",
          "author": "TheGCmind",
          "text": "This is heartening to hear.. If you need a strategic communications specialist do DMe",
          "score": 1,
          "created_utc": "2026-02-10 14:27:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ogjcw",
          "author": "UziMcUsername",
          "text": "AI can combine things in new ways. Perhaps no one has asked AI to come up with homepage copy for a company that does space tourism for cats, but AI could write the copy for that page is seconds, and it would be better than what most copywriters could produce in a day.\n\nThere will always be companies that don’t want to do it themselves, and a one man operator will always be able to find work, but the people who just write copy, or just do one or a few of the marketing jobs, are definitely losing their jobs to AI.",
          "score": 1,
          "created_utc": "2026-02-10 20:31:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pu7bo",
          "author": "jack_belmondo",
          "text": "Not yet...",
          "score": 1,
          "created_utc": "2026-02-11 00:45:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q57nr",
          "author": "stable_king",
          "text": "AI is the future, sooner or later you will accept it",
          "score": 1,
          "created_utc": "2026-02-11 01:51:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q63r5",
          "author": "InnovateNarrator",
          "text": "Not yet 🤞",
          "score": 1,
          "created_utc": "2026-02-11 01:57:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qcrx4",
          "author": "Slow-Bake-9603",
          "text": "I’m taking your jobs",
          "score": 1,
          "created_utc": "2026-02-11 02:37:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qgth4",
          "author": "TCpls",
          "text": "Hate to be the bringer of bad news, but it’s finally happening… Display and Video will be first. So learn multiple channels and practice your client facing skills.\n\nAssuming you’re working with smaller brands, it will be affordable to you soon.\n\nThey will learn how you work, what your flare is, and how to mimic you. They will optimize the buy in a way you can tell the client their money won’t be a blank check to any platform.\n\nDo I trust it in something like Google Ads? No. Can I see it replacing those who manage small buys in Google Ads? Yes, easily. When there are less levers to pull, it learns faster.",
          "score": 1,
          "created_utc": "2026-02-11 03:01:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qoe6f",
          "author": "gasolinemike",
          "text": "OP is like pushing a rock up a slope with his nose. \n\nThe fact remains that people just take too much time to get from a novice to a craftsman level. And too expensive to boot, considering the number of years it will take. And then, they repay you for the years & expense in training by leaving for another job for RM200 more. \n\nNo one has yet made a compelling reason for me to hire freshies out of uni, the cohort that’s most prone to jumping ship after the requisite 2 years experience. Pisses me off. \n\nSo, my senior team now use Claude Code to do the work it would taken 5-10 engineers in the past. \n\nSo, yes, AI will be eating your jobs. Just takes some time to work through the system. And soon.",
          "score": 1,
          "created_utc": "2026-02-11 03:50:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4r3slq",
          "author": "Jenikovista",
          "text": "You’re disconnected from the reality of what is actually happening on the streets today.",
          "score": 1,
          "created_utc": "2026-02-11 05:42:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rev0l",
          "author": "Cultural_Try4776",
          "text": "I agree",
          "score": 1,
          "created_utc": "2026-02-11 07:17:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rfyjn",
          "author": "Ashamed_Dentist_6442",
          "text": "Ehhh... you're half right lol\n\nAI won't replace the strategic stuff or reading clients in meetings. But those 5 people who used to do manual reports? Yeah, they're gone. \n\nMy buddy's agency went from 12 to 7 people while handling MORE clients.\n\nThe AI just copies thing is kinda outdated too. These tools spot patterns we'd never catch. It's less about replacement, more about needing way fewer people to do the same work.\n\nThe squeeze is real for average marketers. You either gotta be strategic enough to be irreplaceable, or really good with these tools. The comfortable middle is disappearing.\n\nNot trying to doom spiral, just saying \"chill people\" hits different when rent's due ",
          "score": 1,
          "created_utc": "2026-02-11 07:27:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rpeo7",
          "author": "JJRox189",
          "text": "Love this post. Not panicking but be conscious of the potential!",
          "score": 1,
          "created_utc": "2026-02-11 08:57:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sb990",
          "author": "asunder3000",
          "text": "I think unfortunately a lot of folks need to get burnt before they realise this.",
          "score": 1,
          "created_utc": "2026-02-11 12:08:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sbciw",
          "author": "dudewafflesc",
          "text": "I wish you were 100% right, my friend.  Right now, many customers are holding off on new deals with agencies or expanding their in-house marketing infrastructure waiting to see if AI can help them cut costs.  That is pure fact and accounts for the tight job market, at least in part.  I also think you don’t really understand the technology.  It’s capable of learning and improving anything. What’s to stop a company from taking all of your work and using AI to replicate and continue it?",
          "score": 1,
          "created_utc": "2026-02-11 12:09:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4slw0x",
          "author": "HariSeldon16",
          "text": "<meme = “simpsons”> AI is not taking our jobs “right now” </meme>\n\nLook, the thing is AI might not be at that stage just yet but you’ve gotta look at the improvement curve over even just the last year. \n\nI was experimenting with cursor AI to do some heavy reasoning jobs in data analysis yesterday. It wrote python code in minutes that would have taken me days to write. The code itself was perfect. The actual logical approach needed to accomplish the task not so much, and led to major hallucinations.\nEven a year ago it would not have been able to do that.  I’m pretty sure if I had prompted it better it could have achieved the task. I’m taking another crack at it today.\n\nI think within 2-3 years we will be seeing AI doing more complex reasoning and things that are unthinkable even today.\n\nThe biggest barrier to AI imo is the infrastructure cost. Electricity, RAM, processors. We just saw micron exit the consumer RAM market to provide all of its capacity to AI. But as quantum computing becomes more commercially available those barriers are going to become non existent.",
          "score": 1,
          "created_utc": "2026-02-11 13:19:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4upjzv",
          "author": "quantumjedi",
          "text": "AI is going to take some people's jobs. It's not going to erase marketers. AI can do lots of things well, consistently, and cheaply, that people have been getting paid to do at varying skill levels, that's not anything new. That's just technology advancing. I think what the rise of AI does more than anything is push us to different types of marketing, like you said, adding a human touch, using human intuition to know how to key a campaign into the cultural zeitgeist is one of the most important parts of being a marketer.",
          "score": 1,
          "created_utc": "2026-02-11 19:28:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ws1st",
          "author": "Andrej760",
          "text": "Give it 10 more years..",
          "score": 1,
          "created_utc": "2026-02-12 02:01:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zvut8",
          "author": "Business_Roof786",
          "text": "100% agree. Tools can automate tasks, but they can’t replace taste, intuition, and lived experience. Strategy is still deeply human. AI won’t replace marketers , but it will replace marketers who don’t use AI. 😎 The real shift is augmentation, not elimination.  \nOut of curiosity, how are you addressing responsible AI usage in your campaigns?🤨",
          "score": 1,
          "created_utc": "2026-02-12 15:38:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0vte6",
      "title": "What marketing tool mentioned on this subreddit actually ended up useful?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r0vte6/what_marketing_tool_mentioned_on_this_subreddit/",
      "author": "Mysterious-Age-4850",
      "created_utc": "2026-02-10 08:59:44",
      "score": 43,
      "num_comments": 23,
      "upvote_ratio": 0.98,
      "text": "Hi all- I constantly see people mentioning new and cool marketing tools on this sub, especially after the whole AI craze but until then I haven't had the time to check most of these out! But have a little bit of time on my hand right now!\n\nSo for ones who tried a bunch, what marketing tool mentioned on this subreddit actually ended up useful?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r0vte6/what_marketing_tool_mentioned_on_this_subreddit/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4l2yjc",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 08:59:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l3nci",
          "author": "Ok-Macaron2516",
          "text": "Google Nano Banana has been a game changer in helping us create marketing assets from scratch with simple product images. It can easily turn simple images to full blown product shoots!  \n\nAnother would be Frizerlly! Their AI agent can learn all about your business and competitors to automatically publish an SEO blog on our website every day! We usually let is publish as a draft and manually switch it to published after a quick review! \n\nFinally Youform! We have been massively overpaying for Typeform and ended up recently switching to Youform, which is a much cheaper option with almost all the same features! It's basically free for most use cases as well! Not sure how they are making money lol! ",
          "score": 13,
          "created_utc": "2026-02-10 09:06:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4raemi",
          "author": "Super-Catch-609",
          "text": "If I’m honest, the stuff that actually sticks is pretty simple, Notion for keeping organized, Canva for quick design tweaks, and Zapier for automations. On top of that, I’ve been using GetHookd AI to feed in an existing ad or style and get fresh variations in seconds, definitely speeds up testing without overthinking.",
          "score": 3,
          "created_utc": "2026-02-11 06:38:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mkmq5",
          "author": "Equal-Direction-8116",
          "text": "What usually ends up being useful are the boring ones that remove friction you already feel. Things that surface anomalies, summarize what changed, or reduce manual back-and-forth. Tools that promise to “do marketing for you” rarely stick, but ones that help you see faster or explain performance better tend to earn a permanent place.",
          "score": 2,
          "created_utc": "2026-02-10 15:16:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ny2ec",
          "author": "Hogwatch57",
          "text": "Syndr AI for audience research tracks what my ICP discusses across Reddit/communities before I build campaigns. Stopped guessing at messaging and channels, started validating with actual conversation data.",
          "score": 2,
          "created_utc": "2026-02-10 19:05:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p67cw",
          "author": "Dry_Procedure_2000",
          "text": "i do not know about tools but one of the comment in this subreddit actually helped my brand some one gave advice about using tiktok and especially tiktok effects AR and gamifcations for brand marketing researched alittle and found tiktok has this branded effects so the tool they had for effect creation was kind of too much for me to handle hired an agency and they did it for 250$ and more then 2500 people recorder videos with this effect and viewer reach was 24million in a month gain around 5k followers on tiktok  and it just started from such comment maybe someone will write about this comment same post one day lol     ",
          "score": 2,
          "created_utc": "2026-02-10 22:32:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4s1m2w",
          "author": "ialwayssaywhaat",
          "text": "we’re using gomarble AI for insights",
          "score": 2,
          "created_utc": "2026-02-11 10:50:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l4eyy",
          "author": "Low_Confection_2433",
          "text": "Following this thread for inspo :) ",
          "score": 2,
          "created_utc": "2026-02-10 09:14:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lsr6q",
              "author": "Fit-Donkey-3181",
              "text": "Same here!",
              "score": 1,
              "created_utc": "2026-02-10 12:41:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4m53cv",
          "author": "Lonely_Mark_8719",
          "text": "I’d break this into smaller experiments instead of trying to optimize everything at once. Pick one metric that actually matters (signups, demos, replies) and test small changes weekly. It’s way easier to see signal when you limit variables.",
          "score": 1,
          "created_utc": "2026-02-10 13:54:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qhirg",
          "author": "Electronic-Cat185",
          "text": "honestly the most useful ones were boring like analytics and heatmaps. tools that show how people actually behave tend to beat shiny ai tools that just promise speed.",
          "score": 1,
          "created_utc": "2026-02-11 03:06:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rmgyh",
          "author": "Different_Dinner9267",
          "text": "Honestly, the best \"tool\" that worked for me wasn't really tool, it's reaching out to nano/micro influenceurs directy. No fancy Platform, just finding creators in your product to an audience that already trust them. Way better ROI most marketing tools i've tried. The tools are great for tracking and optimizing but the real growth comes from people talking about your product authentically. \n\n",
          "score": 1,
          "created_utc": "2026-02-11 08:29:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rrifw",
          "author": "mildlylogical",
          "text": "Here for answers",
          "score": 1,
          "created_utc": "2026-02-11 09:17:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ruo8j",
          "author": "SimonBuildsStuff",
          "text": "Most of what gets mentioned here is either shilling or genuinely useful to one person and useless to everyone else. What we have found actually useful: For content production at scale the tools that worked had constraints built in, not generate anything but generate within these brand rules. The open-ended AI tools produced volume but created cleanup work. Scheduling tools are pretty interchangeable. Analytics tools only matter if you actually look at them. The honest answer is that most tools are not the bottleneck. Process is. A team with a clear workflow and a spreadsheet will outperform a team with expensive tools and no process. What problem are you actually trying to solve?",
          "score": 1,
          "created_utc": "2026-02-11 09:47:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sd0mh",
          "author": "AdhesivenessLevel574",
          "text": "I kept seeing people hype different tools, but the one that actually helped me was the one that saved time on research and made execution easier. Fancy features are great, yet simple workflows that remove manual work usually win in the long run.\n\nDo you like this personality?",
          "score": 1,
          "created_utc": "2026-02-11 12:21:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ytetu",
          "author": "SpiritedAwayInHell",
          "text": "nano banana, gpt, google flow, grok have been great help in marketing. ",
          "score": 1,
          "created_utc": "2026-02-12 11:57:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ytfs1",
              "author": "haikusbot",
              "text": "*Nano banana, gpt,*\n\n*Google flow, grok have been great*\n\n*Help in marketing.*\n\n\\- SpiritedAwayInHell\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
              "score": 1,
              "created_utc": "2026-02-12 11:57:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qy6tog",
      "title": "DIGITAL MARKETING CHECKLIST 2026",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qy6tog/digital_marketing_checklist_2026/",
      "author": "Equal-Direction-8116",
      "created_utc": "2026-02-07 06:47:48",
      "score": 35,
      "num_comments": 18,
      "upvote_ratio": 0.95,
      "text": "# 1. Strategy\n\n* Clear goal\n* Target audience\n* Unique offer\n* Competitor check\n* Funnel plan\n* KPIs\n\n# 2. Website\n\n* Mobile-first\n* Fast load\n* Clear CTA\n* Lead forms\n* Tracking\n* Trust proof\n\n# 3. SEO\n\n* Intent keywords\n* AI tools\n* Content clusters\n* On-page SEO\n* Local SEO\n* EEAT\n\n# 4. Social Media\n\n* Right platforms\n* Optimized profile\n* Consistent posts\n* Reels/Shorts\n* Strong hooks\n* Storytelling\n\n# 5. Content Marketing\n\n* Blog posts\n* Case studies\n* Infographics\n* Videos & shorts\n* FAQs & guides\n* Lead magnets (PDF, checklist, ebook)\n\n# 6. Paid Ads\n\n* Meta ads\n* Google ads\n* Landing pages\n* Creative tests\n* Retargeting\n* ROAS\n\n# 7. AI & Automation\n\n* AI content\n* AI ad copy\n* CRM tools\n* Chatbots\n* Auto reports\n* Human review\n\n# 8. Email & WhatsApp\n\n* Lead magnet\n* Auto sequence\n* Value emails\n* WA broadcast\n* Segmentation\n\n# 9. Analytics\n\n* GA4 setup\n* Weekly review\n* A/B tests\n* Funnel check\n* ROI focus\n\n# 10. Branding\n\n* Personal brand\n* Visual identity\n* Case studies\n* Linkedin growth\n* Community",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qy6tog/digital_marketing_checklist_2026/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o41imeq",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 06:47:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47hfmh",
          "author": "SimonBuildsStuff",
          "text": "Good list. I'd add one thing under AI & Automation: what happens when the AI produces something off-brand?\n\nWe found \"generate then review\" burns \\*a lot\\* more time than \"constrain then generate\". If your system can produce bad outputs, someone has to catch them. That's expensive.\n\nBetter to have constraints upfront. Harder to set up but saves your butt later.",
          "score": 2,
          "created_utc": "2026-02-08 05:37:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o48w37b",
              "author": "DifferentDance5515",
              "text": "Thats a smart approach. The constraint part is key because unchecked AI output can create brand damage fast. Weve been handling this with SEO45 AI which has built in quality controls and brand voice consistency checks before publishing. It automates the heavy lifting like internal linking and SEO optimization while keeping guardrails tight. Free for the year with unlimited sites, so you can test it without worrying about costs stacking up if outputs need review. Definitely worth having those constraints baked into the workflow from day one.",
              "score": 1,
              "created_utc": "2026-02-08 13:09:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o43yaw9",
          "author": "Perfect-Clothes-6752",
          "text": "Good one",
          "score": 1,
          "created_utc": "2026-02-07 17:13:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o473uzc",
          "author": "BeneficialReport4768",
          "text": "This checklist very helpful for me",
          "score": 1,
          "created_utc": "2026-02-08 03:56:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47z2u4",
          "author": "LatterReward9146",
          "text": "Good post, thanks. Saving it!",
          "score": 1,
          "created_utc": "2026-02-08 08:16:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a0y1q",
          "author": "Material_Ad_7507",
          "text": "Great list.   I’m resurfacing my AU rant because I keep seeing B2B marketers make the same mistake:\n\nLayering AI on top of broken systems.\n\nAI doesn’t fix broken processes. It only scales what already exists.\n\nIf your lead routing is slow, AI automates slow routing.\nIf your forms create friction, AI can’t remove it.\nIf competitors are stealing your brand traffic, AI won’t win it back for you.\n\nWe’ve seen this before.\n\nDuring cloud migrations, teams moved broken systems to the cloud and scaled complexity instead of fixing fundamentals.\n\nLast fall, I analyzed B2B SaaS teams doing the same thing with AI.\n\nThe ones that saw real impact didn’t start with AI.\n\nThey fixed the foundation first, then used AI to accelerate what was already working.\n\nAudit → Repair → Optimize → Scale (with AI)\n\nDon’t repeat the mistake.",
          "score": 1,
          "created_utc": "2026-02-08 16:53:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g05th",
          "author": "Content_Most2673",
          "text": "chef's kiss! this is a great round up",
          "score": 1,
          "created_utc": "2026-02-09 15:15:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xum55",
          "author": "Packiure_Founder",
          "text": "Great post ",
          "score": 1,
          "created_utc": "2026-02-12 06:32:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2luqh",
      "title": "What Digital Marketing tools should beginners focus on first?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r2luqh/what_digital_marketing_tools_should_beginners/",
      "author": "Entri_App_Official",
      "created_utc": "2026-02-12 06:11:19",
      "score": 33,
      "num_comments": 36,
      "upvote_ratio": 0.97,
      "text": "Share what helped you the most in the comments 👇",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r2luqh/what_digital_marketing_tools_should_beginners/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4xs8fo",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-12 06:11:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xtmwc",
          "author": "supriya_l89",
          "text": "Begin your learning process by studying fundamental concepts instead of attempting to learn multiple tools simultaneously. The beginner stack which works best for beginners includes Google Analytics and Search Console for data analysis, Canva for creating basic graphics, Meta and Google Ads Manager for handling paid advertising, and Ubersuggest or Ahrefs Webmaster Tools as basic SEO tools. Start your learning path by mastering strategic planning and analytical methods because tools will evolve but your ability to comprehend audience behavior and messaging effectiveness and performance metrics will provide lasting benefits.",
          "score": 10,
          "created_utc": "2026-02-12 06:23:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o52qsyh",
              "author": "fatjoe-SEO",
              "text": "This is solid. I’d just add that beginners shouldn’t get tool-obsessed. Most tools overlap a lot. A beginner should understand why he's using them.  \n and Search Console alone can teach you more about user behavior than 10 shiny SaaS dashboards",
              "score": 5,
              "created_utc": "2026-02-12 23:58:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4y842n",
          "author": "LaunchLabDigitalAi",
          "text": "If you are just starting, don't try to learn 25 tools at once. Focus on the essentials that cover research, execution, and measurement.\n\nFirst, Google Analytics and Google Search Console. These are non-negotiable. They teach you how traffic actually works, what keywords bring visitors, and what pages perform. Most beginners skip this and operate blindly.\n\nSecond, a basic keyword research tool like Ubersuggest, Ahrefs (if budget allows), or even Google Keyword Planner. Understanding search intent and keyword demand is foundational for SEO and content marketing.\n\nThird, a simple content and design tool like Canva. You don't need Photoshop in the beginning - Canva is more than enough for social posts, thumbnails, and basic creatives.\n\nFourth, an email marketing tool (Mailchimp, ConvertKit, etc.). Even if your list is small, learning how to build and nurture an audience early is powerful.\n\nAnd finally, a social scheduling tool (like Buffer or Meta Business Suite) to stay consistent without burning out.\n\nBeginners often think advanced tools equal better marketing. In reality, mastering a small stack deeply is far more valuable than juggling everything. What helped me most early on was understanding analytics and search intent - everything else builds on that.",
          "score": 9,
          "created_utc": "2026-02-12 08:40:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4z2tmj",
              "author": "lonerass88",
              "text": "Thankyou this was helpful",
              "score": 1,
              "created_utc": "2026-02-12 13:03:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4zca3i",
              "author": "hopkinspop",
              "text": "This is super helpful, ty! I’m currently working as a photographer/ videographer and am thinking of expanding to digital marketing. Would the list above be a good place to start? Would you recommend a course for formal training too?",
              "score": 1,
              "created_utc": "2026-02-12 13:58:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xx6rb",
          "author": "Dangerous_Bowler3286",
          "text": "If you’re just starting out, don’t try to learn every tool at once. Start with fundamentals first how marketing works, how people buy, how messaging influences action.\n\nThen choose one path based on what feels easier for you. For example, you can focus on Google Ads, Meta Ads, or email marketing but go deep into one before jumping around.\n\nIf you choose email marketing, even free tools are enough at the beginning. That’s where you really understand workflow, systems, targeting, and follow-ups.\n\nThe key isn’t the tool it’s how well you understand the process behind it. Pick what you can learn consistently and what helps you solve real problems.\n\nStart simple, master one area, then expand.",
          "score": 3,
          "created_utc": "2026-02-12 06:55:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xyvi2",
          "author": "Low_Confection_2433",
          "text": "I strongly recommend starting with Google Analytics and Search Console to understand the basics of data and then, from there, decide where you want to get specialised and start choosing the tool or processes you will need to learn",
          "score": 3,
          "created_utc": "2026-02-12 07:10:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y1bg4",
          "author": "Aunker",
          "text": "Most beginners obsess over tools instead of fundamentals. You really only need a small stack to start. Google Analytics and Search Console to understand traffic. One ads platform like Meta or Google to learn paid traffic. Canva for basic creatives. And one simple SEO tool like Ahrefs Webmaster Tools or Ubersuggest. More tools won’t make you better. Knowing how to read data and improve messaging will. Start simple and go deep instead of wide.",
          "score": 3,
          "created_utc": "2026-02-12 07:34:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y9652",
          "author": "Alternative_Yard_170",
          "text": "Tools that automate your digital marketing processes:\n\n1. Inbound - SEO, Content Creation, Scheduling Social Media Posts\n2. Outbound - Cold email, List Building, Ads, Directory Listing\n\nStart with one tool/platform and keep evaluating more as you move forward.",
          "score": 3,
          "created_utc": "2026-02-12 08:50:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yobn8",
          "author": "ki3e",
          "text": "Start with media math - eCPMs, CPCs, CTRs, etc. Define your metrics of success and understand what they mean.\n\nNext understand your channels - social, search, display / video.. what each is used for.\n\nAlign all these to business goals. Brand awareness, performance.\n\nYes it's good to use tools to learn these concepts.. but keep in mind.. media buying will be obsolete in a few years.\n\nIt's learning and understanding the \"why\" that's going to carry you forward and not make you redundant in the future.",
          "score": 3,
          "created_utc": "2026-02-12 11:15:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y3sbr",
          "author": "GTMSignals",
          "text": "First try to understand where you want the core focus if its content focus on AI writing tools understand how to give prompt and focus on research part and if its seo then focus on google analytics and GSC.",
          "score": 2,
          "created_utc": "2026-02-12 07:57:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y99h3",
          "author": "Terrible-Repair-9421",
          "text": "• Google Search Console – real SEO data  \n• Google Analytics – understand behavior  \n• Canva – quick visuals  \n• Keyword Planner / Ubersuggest – search intent  \n• ChatGPT – ideas + structure\n\nMaster 5 tools, not 20.\n\n",
          "score": 2,
          "created_utc": "2026-02-12 08:51:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yp5be",
          "author": "nelsontalk",
          "text": "Start with Google Analytics to track performance and Canva for creating visuals simple tools, yet super effective for beginners.",
          "score": 2,
          "created_utc": "2026-02-12 11:22:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yue4j",
          "author": "ArmOk3290",
          "text": "The real shift in 2026 is learning how to work with AI tools for content creation and research, not against them. Start with Google Analytics and Search Console for fundamentals, Canva for visuals, and experiment with one AI writing assistant for drafts. The tools will keep changing but understanding data and audience intent stays the same.\n\n  \n",
          "score": 2,
          "created_utc": "2026-02-12 12:04:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yy3hj",
          "author": "Larik_Kroft",
          "text": "If you’re just starting out, don’t try to learn everything at once. Focus on tools that build fundamentals:\n\n1. **Google Analytics (GA4)** – understand traffic, behavior, and conversions. If you can’t measure, you can’t improve.\n2. **Google Search Console** – learn how search works and what people actually find you for.\n3. **Meta Ads Manager or Google Ads** – pick one paid channel and understand targeting + creatives.\n4. **Canva** – fast way to produce decent visuals without a designer.\n5. **An email tool (Mailchimp, Brevo, etc.)** – learn basic lifecycle and retention.\n\nTools change. Principles don’t. Master analytics + one acquisition channel + basic content creation first. The rest builds on that.",
          "score": 2,
          "created_utc": "2026-02-12 12:31:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yzzn0",
          "author": "DigitalHarbor_Ease",
          "text": "If you’re a beginner, honestly don’t chase too many tools. Start simple.  \n**GA4** and **Search Console** helped me the most to understand what’s actually working. **Canva** is great for quick creatives, and one SEO tool (Ahrefs/SEMrush or even free ones) is enough to learn basics.\n\nOnce you get comfortable, then move to ads tools. Tools matter, but learning how to read data matters more.",
          "score": 2,
          "created_utc": "2026-02-12 12:44:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yebn0",
          "author": "jerRy_0009",
          "text": "Have you checked the definiteseo plugin",
          "score": 1,
          "created_utc": "2026-02-12 09:41:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yhh7r",
          "author": "Superb-Novel-3628",
          "text": "For beginners, I think it’s best to start simple. Google Analytics and Search Console are must haves to understand traffic and performance. A basic SEO tool for keyword research and audits helps a lot too. For content and social, even simple scheduling and tracking tools are enough at the start.\n\nThe main thing is learning how to use a few tools properly instead of trying everything at once. This is something we also see at Bonoboz when working with new brands. The tools matter, but strategy and consistency matter more.",
          "score": 1,
          "created_utc": "2026-02-12 10:12:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zbo5s",
          "author": "SeparateQuality8416",
          "text": "Complex tools like GA4( Amplitude ) or any other analytics tools is needed mostly for everyone, for now everyone wants data-driven marketing so analytics is a key, but all the other ones depends on what marketing functions you wanna do. If you wanna run ads - it would be Google or Meta ads and so on",
          "score": 1,
          "created_utc": "2026-02-12 13:55:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zreaa",
          "author": "Dizzy_Attorney9853",
          "text": "Gsc , GA4 and screaming frog , ahref or semrush\nYou need nothing else. Just try to master these and with time you’ll choose your own supportive extension for ease",
          "score": 1,
          "created_utc": "2026-02-12 15:17:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zyt93",
          "author": "Anita78202",
          "text": "New Ai tech like search intent technology.  It will help you get to leads faster and leads that have expressed interest in. your business by typing in your keywords.  Not PPC.",
          "score": 1,
          "created_utc": "2026-02-12 15:52:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50exon",
          "author": "RayzinBran18",
          "text": "Python and ClaudeCode. But more seriously the google ecosystem. GA4 and Search Console. Alongside Python and ClaudeCode / Cowork.",
          "score": 1,
          "created_utc": "2026-02-12 17:07:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50kh8w",
          "author": "Getrekt2333",
          "text": "Ahrefs,Semrush,GA,Tag Manager,Looker Studio",
          "score": 1,
          "created_utc": "2026-02-12 17:33:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50ofd8",
          "author": "Confident-Tank-899",
          "text": "Disagree with the \"master fundamentals first\" take. That's backwards. You learn fundamentals by using tools.\n\n\n\nHere's what actually matters for beginners:\n\n\n\n1. Start with Google Analytics. Seriously, sit with this for 2-3 months before adding anything. Most beginners don't understand what UTM parameters are or why conversion tracking matters. If you don't know this, nothing else makes sense.\n\n\n\n2. Pick ONE channel and go deep. Don't try SEO + Ads + Social simultaneously. You'll be mediocre at everything. I'd pick SEO because it compounds and actually teaches you how marketing works (keyword intent, conversion paths, content strategy).\n\n\n\n3. After 3 months with #1 and #2, then add a design tool (Canva) and an email tool. Not before.\n\n\n\nThe problem with the \"full stack\" approach is beginners get distracted. They spend 2 hours in Figma, 2 hours in Mailchimp, 2 hours trying to set up a CRM, and never actually execute the one thing that would move the needle.\n\n\n\nTools don't matter. Execution matters. 80% of beginners need less tools, not more.",
          "score": 1,
          "created_utc": "2026-02-12 17:52:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50pf65",
          "author": "Yapiee_App",
          "text": "Beginners usually don’t need more tools they need clarity. If I had to restart, I’d focus on:\n\n1. Google Analytics (to understand behavior)\n2. Search Console (to understand demand)\n3. A simple content scheduler\n\nTools matter less than knowing what problem you’re solving.",
          "score": 1,
          "created_utc": "2026-02-12 17:57:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy7e8o",
      "title": "Some of my favourite tools that make marketing a bit easier and a lot bearable",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qy7e8o/some_of_my_favourite_tools_that_make_marketing_a/",
      "author": "Far-Panic3458",
      "created_utc": "2026-02-07 07:20:16",
      "score": 31,
      "num_comments": 11,
      "upvote_ratio": 0.91,
      "text": "Notion AI: Best for all-in-one productivity. It acts as your CRM, content calendar, and writer. The free plan is generous, and the AI add-on is roughly $10/month, which is significantly cheaper than standalone AI writers.\n\nZapier: The free tier allows for 100 \"tasks\" per month. It’s perfect for simple \"If This, Then That\" automations (e.g., If I get a new lead on Facebook, send them a welcome email).\n\nBrevo (formerly Sendinblue): Unlike Mailchimp, Brevo allows unlimited contacts on their free plan and lets you send up to 300 emails per day. It includes AI subject line generators and basic automation workflows for $0.\n\nCanva Magic Studio: The gold standard for design automation. The free version now includes \"Magic Edit\" and \"Magic Write.\" For $12.99/month, you get a full suite of AI tools that can turn a single text prompt into an entire social media campaign. Their premium templates are absolutely amazing and are worth every penny\n\nFibr.ai: Offers a highly rated Free Google Ad Copy Optimizer. It analyzes your niche and generates headlines/descriptions optimized for higher Quality Scores.\n\nRyze AI: Basically monitors your ad campaigns. Also provides meaningful advice via a chatbot. Costs like $49 per month and has other plans\n\nAdCreative.ai: For about $20–$30/mo, it generates hundreds of \"conversion-focused\" banners and creatives. It even gives them a \"confidence score\" based on how well the AI thinks they will perform on Google’s Display Network",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qy7e8o/some_of_my_favourite_tools_that_make_marketing_a/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o41m6zr",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 07:20:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kleua",
          "author": "bluestarfish52",
          "text": "Canva and Notion cover most of my daily stuff, but when it comes to brainstorming Ad angles, it’s easy to get stuck. Lately I’ve been using GetHookd AI to toss in a style or existing Ad and get fresh variations in seconds, saves me from staring at a blank canvas.",
          "score": 3,
          "created_utc": "2026-02-10 06:16:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43gllo",
          "author": "BlissfulEating",
          "text": "Can you tell me more about Notion AI acting as your CRM?",
          "score": 1,
          "created_utc": "2026-02-07 15:46:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f9pt9",
          "author": "ButterscotchReal5381",
          "text": "Honestly, a few tools have straight-up saved my sanity with marketing, and Velorum Leads is at the top of that list. It takes the most annoying parts—lead gen, follow-ups, juggling inboxes—and just handles them. The automation actually works, and the AI chatbots are way better than I expected for qualifying leads without constant hand-holding.\n\n\nMarketing is already a grind, so anything that removes friction is a huge W. Velorum Leads made things smoother, faster, and way more manageable, Would not want to go back to doing this the hard way.",
          "score": 1,
          "created_utc": "2026-02-09 12:41:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4o66zw",
          "author": "thatsupercoolguykyle",
          "text": "Instead of Ryze I use onlyinsight, they only have a meta ads integration right now but I've found the insights and recommendations have been higher quality",
          "score": 1,
          "created_utc": "2026-02-10 19:43:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a7iq5",
          "author": "Awkward_Ad_9605",
          "text": "Those are some solid picks! I’ve definitely found Notion to be a game changer for organizing everything in one place.\n\nFor automating tasks, Zapier is a lifesaver. I love how it can connect different platforms seamlessly. If you're looking for something specifically for Reddit marketing, I’ve been working on a tool that really streamlines the process of building karma and finding leads without running into the usual pitfalls. It tackles the challenges of manual engagement and helps with targeted outreach, making it much easier to promote without risking shadow bans.",
          "score": 0,
          "created_utc": "2026-02-08 17:24:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0z9p2",
      "title": "GEO for local business? Is it possible? Are there any strategies I need to research?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r0z9p2/geo_for_local_business_is_it_possible_are_there/",
      "author": "Cupcakii",
      "created_utc": "2026-02-10 12:21:18",
      "score": 25,
      "num_comments": 31,
      "upvote_ratio": 0.95,
      "text": "I run an agency for local businesses and we're getting more questions from our clients about showing up in Al-generated answers for location specific questions. Like when someone asks Chatgpt \"best dentists in Austin\", can we influence our clients to show in those searches?\n\nBecause I know with regular SEO we'd do Google Business Profile, local citations, location pages, reviews, but I genuinely have no idea if any of that matters for Al or if LLMs pull from totally different signals.\n\nWhat are you guys doing for local GEO? Or are we just telling clients it's a blackbox since we'd have no way of knowing if its working?? I know basically nothing about this lol",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r0z9p2/geo_for_local_business_is_it_possible_are_there/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4lpuku",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 12:21:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lu0qb",
          "author": "imaginary_name",
          "text": "Sure you can. When a user asks his chatGPT a question \"recommend me the best dentists in Austin\", the LLM does a QFO (query fan out) and sends multiple sub-queries to Google and/or Bing.  \nYou need to rank for the long tailed search queries in QFO, in case of your dentist, it would probably be queries along the lines of \"top dentists in travis county\" \"top dentist austin area 2025\" and so on.",
          "score": 7,
          "created_utc": "2026-02-10 12:49:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lu6x4",
          "author": "mariyagel",
          "text": "Local GEO isn’t directly controllable yet, but strong local SEO helps indirectly through consistent reviews, PR submissions, and brand mentions.",
          "score": 4,
          "created_utc": "2026-02-10 12:50:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lvtja",
          "author": "Fit-Donkey-3181",
          "text": "Are you sure this even matters yet? personally wouldn't allocate\nbudget unless their GA shows some traffic from ChatGPT and others. Imo, monitor for free, only optimize if you see actual signal it's driving business. I'd assume most of the small local clients are operating with a smaller budget so you need to be choosy.",
          "score": 3,
          "created_utc": "2026-02-10 13:01:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lwb5c",
          "author": "ArmOk3290",
          "text": "Honestly GBP and reviews still matter most since LLMs scrape Google rankings heavy. Add schema markup to location pages, get featured in local pubs/blogs for authority signals. Track with GA4 chatgpt referrals if any. Its early but traditional local SEO translates 70% imo.",
          "score": 2,
          "created_utc": "2026-02-10 13:04:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lz2j3",
          "author": "Rikkitikkitaffi",
          "text": "Publishing to knowledge graphs that are on the LLMs' radars is a concrete way to increase the probability of surfacing in response to a user's LLM query.  Gemflush is one platform that does the publishing for local businesses, other platforms provide various metrics for measuring the impact as well and address enterprise brand monitoring.  Anecdotally, I know of one dentist that had specific mercury-free amalgams specified as a service in a kg and got a handful of inbound solicitations from new patients citing that same service, and prior to that he doesn't think he ever heard a patient use the term amalgam.  As everyone says everywhere, if you're not in the graph, they're gonna laugh.",
          "score": 1,
          "created_utc": "2026-02-10 13:21:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m2jz0",
          "author": "sriracha_saws",
          "text": "What metrics are you even reporting to clients for this? Like with SEO it's rankings and traffic. With GEO what's the KPI?",
          "score": 1,
          "created_utc": "2026-02-10 13:41:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m5c6b",
              "author": "Maybe_Synthren",
              "text": "Yeah this is part of my hesitation too. What do we even measure success by?",
              "score": 1,
              "created_utc": "2026-02-10 13:56:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4n4mrp",
              "author": "Putrid-Conference409",
              "text": "From what I have seen, most agencies are just monitoring AI answers right now, not really trying to optimize them yet.\n\nThere is still no clear KPI like rankings in SEO.\n\nLocal SEO basics still seem to help though. Reviews, citations, and mentions in local sites show up pretty often in AI answers.\n\nFeels very early still.",
              "score": 1,
              "created_utc": "2026-02-10 16:50:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4ojpk5",
              "author": "RayzinBran18",
              "text": "Ahref and SEMrush have early ai overview results that are correlated to search volume, but you have to pay for a new tier. Search Console does have data for people who found you through AI-Mode in Google though.",
              "score": 1,
              "created_utc": "2026-02-10 20:46:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4rbge0",
              "author": "td1176",
              "text": "The most common metrics I’m seeing (and what was heavily discussed at Brighton SEO last sparked) are: authority score, number of monthly LLM citations, and AI share of voice. There are others, but it’s all still rapidly evolving.",
              "score": 1,
              "created_utc": "2026-02-11 06:47:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4n6a16",
          "author": "RKulegi",
          "text": "Do PR oof your client business, diversify reviews to all the important platforms that top rankings businesses are doing, and then get high quality backlinks from niche relevant websites using guest posts, sponsered posts.",
          "score": 1,
          "created_utc": "2026-02-10 16:58:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nd1kk",
          "author": "Yapiee_App",
          "text": "From what I’ve seen, local GEO still borrows heavily from the same real-world signals as local SEO, but filtered through trust. Mentions in reviews, local media, forums, and comparison threads seem to matter more than classic citations. It’s less rankable and more about being consistently referenced where AI pulls context from.",
          "score": 1,
          "created_utc": "2026-02-10 17:29:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ndvjl",
          "author": "Larik_Kroft",
          "text": "Yes, local GEO is possible, but it’s indirect.\n\nLLMs don’t rank like Google. They learn from public web mentions over time. Brand + location mentions, third-party reviews, and solid location pages help. GBP matters only indirectly.\n\nGEO = probability of being mentioned, long-term, hard to measure. Anyone promising direct optimization is guessing.",
          "score": 1,
          "created_utc": "2026-02-10 17:33:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nril6",
          "author": "Confident-Tank-899",
          "text": "Local GEO is definitely possible and honestly still works really well. The stuff you mentioned like Google Business Profile, local citations, and location pages are still the foundation. Your problem with AI is valid though because those tools can't understand the nuances of your specific market. What I do is focus on things like local reviews management and making sure your NAP (name address phone) is consistent across every directory. The AI stuff can generate templates but you have to understand your actual local competitive landscape. Also getting local backlinks from chamber of commerce, local media, that kind of stuff matters way more than the AI tools will tell you.",
          "score": 1,
          "created_utc": "2026-02-10 18:35:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4r14z4",
          "author": "addllyAI",
          "text": "It’s not completely different from local SEO, but the visibility comes more indirectly. AI answers often pull from places that already summarize local businesses, like review sites, directories, and well-structured location pages. Businesses that have consistent info, strong reviews, and clear service pages tied to specific locations tend to show up more often in those sources. It’s less about optimizing for AI directly and more about making sure the business is clearly represented in the places AI systems already trust.",
          "score": 1,
          "created_utc": "2026-02-11 05:21:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4r6s1i",
          "author": "supriya_l89",
          "text": "The current situation prevents you from ranking AI responses because the system lacks the same ranking capabilities as Google. The basic principles of local SEO remain essential because LLMs use public web signals as their primary source of information. Strong GBP profiles, consistent citations, high-quality reviews, local press mentions, and clear location/service pages all help build entity trust. I would concentrate on structured data and authoritative directory listings and local site mentions because AI models use trustworthy sources as their primary reference material. The most important requirement at this moment demands that businesses handle GEO as an additional facet which connects effective SEO and brand authority while explaining to clients that tracking and attribution capabilities remain restricted.",
          "score": 1,
          "created_utc": "2026-02-11 06:06:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rhnwc",
          "author": "AgilePrsnip",
          "text": "you’re not crazy, local geo is fuzzy right now, but it is not a total black box. most llms pull from a mix of bing, structured web data, high authority directories, and review platforms, so your local seo basics still matter. tighten nap consistency, add solid localbusiness schema, build out real location pages with unique details, and push for detailed reviews that mention services plus city names. get listed on trusted local directories that actually rank, not junk ones. track branded search lift and ask new leads how they found you to spot ai influence. it is messy, but it is not random.",
          "score": 1,
          "created_utc": "2026-02-11 07:43:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rzjiw",
          "author": "sangeetseth",
          "text": "total valid question.\n\nchatgpt doesn't really \"browse\" the google map pack the same way a user does. it relies heavily on **text** and **directories**.\n\ntraditional seo (gbp, citations) is still the baseline. you need those to exist.\n\nbut for geo (generative engine optimization), the game is **context**. if someone asks \"cheapest emergency dentist in austin\", the llm is looking for pricing and \"emergency\" keywords on the actual page, not just a category tag on google maps.\n\nmy strategy for local clients:\n\n1. **detailed service pages:** stop just listing \"teeth cleaning\". write the full pricing, process, and faq for every single service.\n2. **structure the reviews:** don't just use a widget. put the top reviews in actual text on the page so the llm can read \"best for kids\" and associate it with your brand.\n\nhonestly, i automate the service page creation now because writing unique descriptions for 50 local keywords is a nightmare. once we structured the data, we started showing up in those \"best of\" ai answers.\n\nit’s not a black box. it’s just a text box. feed it better text.",
          "score": 1,
          "created_utc": "2026-02-11 10:31:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sdtwk",
          "author": "svlease0h1",
          "text": "you are not wrong about local geo feeling unclear right now. llms tend to repeat businesses that show strong location proof across reviews, local pages, citations. publish city faq content, grow reviews each month, keep business listings consistent across platforms. one dentist client started appearing in ai answers after review count crossed about 70 within two months.",
          "score": 1,
          "created_utc": "2026-02-11 12:27:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4shopb",
          "author": "webgility_hq",
          "text": "LLMs don’t rank businesses the way Google does, so there isn’t really a direct GEO playbook yet.\n\nThat said, they still rely on strong underlying signals. Consistent NAP data, solid Google Business Profiles, structured schema markup, clear location-specific service pages, and strong third-party reviews all help reinforce your business as a credible local entity.\n\nIt’s less about AI-specific hacks and more about strengthening your overall digital footprint across trusted sources.",
          "score": 1,
          "created_utc": "2026-02-11 12:53:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4t7wkx",
          "author": "phb71",
          "text": "Yea they do matter. Just having a google business profile is a simple difference between being visible and invisible. \n\nYou need to create content onsite - check programmatic SEO for this. \n\nYou also need to be present offsite - local forums, public social media threads, etc.\n\nWe help a few local biz with this - check airefs (not ahrefs)",
          "score": 1,
          "created_utc": "2026-02-11 15:17:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ngucs",
          "author": "GPTinker",
          "text": "Great question. We faced the exact same inquiries from our local clients about 6 months ago. Telling them \"it's a black box\" is leaving money on the table. While AI algorithms are opaque, the inputs they rely on are actually very clear.\n\nHere is how we explain (and sell) \"Local GEO\" vs. \"Local SEO\":\n\n1. The Shift from \"Proximity\" to \"Sentiment\"\n\nLocal SEO (Google Maps): Cares about where the user is standing (Proximity).\n\nLocal GEO (ChatGPT/Perplexity): Cares about what people are saying.\n\nActionable Step: We optimize reviews not just for stars, but for keywords. If a client wants to rank for \"Best Emergency Dentist,\" we encourage reviews that specifically mention \"saved me in an emergency.\" LLMs read this semantic context and serve it as an answer.\n\n2. Data Consensus (The Trust Signal)\n\nLLMs hallucinate, so they crave verification. If your client's NAP (Name, Address, Phone) varies across Yelp, Apple Maps, and Bing, the AI lowers its \"Confidence Score\" and won't recommend them.\n\nOur pitch: \"We sanitize your data so the AI trusts you enough to recommend you.\"\n\n3. The \"Best Of\" Ecosystem\n\nWhen you ask ChatGPT for a recommendation, it often synthesizes answers from top-ranking blog posts like \"Top 10 Dentists in Austin.\"\n\nStrategy: Getting your client mentioned in these local \"listicles\" is essentially the new backlink strategy for AI.\n\nSo no, don't tell them it's unknown. Tell them you are optimizing their \"Digital Trust Footprint\" so AI models feel safe recommending them.\n\nHope this helps frame it for your agency!",
          "score": 0,
          "created_utc": "2026-02-10 17:47:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r03ssc",
      "title": "If AI keeps citing us, do we still need website traffic?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r03ssc/if_ai_keeps_citing_us_do_we_still_need_website/",
      "author": "SE_Ranking",
      "created_utc": "2026-02-09 13:09:48",
      "score": 22,
      "num_comments": 29,
      "upvote_ratio": 0.96,
      "text": "For years, the rule was simple: rank higher, get more traffic, win. But AI Overviews are changing what winning looks like. Users can get a product recommendation, a short comparison, even pros and cons without clicking anything.\n\n*So, if your brand is present inside AI answers, is traffic still the main KPI, or is it becoming a vanity metric?*\n\nWe ran a study to understand how much influence review platforms still have in AI Overviews, especially for commercial queries where people are choosing software or services. The results look like a paradox:\n\nReview platforms show up in roughly every third AI Overview. Specifically, 34.5% of AI Overviews cited at least one review platform. \n\nThat means most AI answers still come from somewhere else. And yet, when review platforms do appear, Google often includes more than one in the same answer. In AI Overviews that include review sites, we saw an average of 2.28 review-platform links per response. It’s like the system prefers to present a comparison view instead of one single source.\n\n*Even more interesting:* the words people use in the query change everything. If the query clearly asks for reviews or ratings, review platforms appear far more often. If the query is more like best or top, review platforms show up much less. \n\nThat’s counterintuitive for anyone who assumed best tools queries would naturally lean on G2/Capterra-style sources.\n\nEven the platforms that dominate AI citations still lost most of their organic traffic between early 2024 and the end of 2025. The declines in our dataset ranged from 76.5% to 92.2%. In plain terms, being heavily cited by AI did not protect them from losing clicks:\n\n* Review platforms appear in 34.5% of AI Overviews\n* Query wording impact: review/rating queries 49%, software/tools queries 39.4%, best/top queries 17.1%\n* The top five platforms account for 88% of all review-platform links in AI Overviews (Gartner Peer Insights, G2, Capterra, Software Advice, TrustRadius)\n* Organic traffic declines for the most cited platforms ranged from 76.5% to 92.2% from early 2024 to end of 2025\n* When review platforms appear, AI Overviews often include multiple: 2.28 review links per response on average\n\nSo what are we supposed to optimize for now?\n\nIf AI can borrow your credibility and your structure to answer the query directly, traffic may drop even while influence stays high. That shifts the game from visits to visibility inside the answer layer.\n\nWe’d love your take: Is traffic still the goal, or is the new goal to be included and trusted inside AI answers, even if the click never happens? And if you agree, what metrics are you using to prove value to stakeholders?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r03ssc/if_ai_keeps_citing_us_do_we_still_need_website/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4fe06m",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 13:09:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ff24j",
          "author": "Almost_There_Rocco",
          "text": "I'd not write off traffic as vanity, but it's definitely no longer the only currency. For commercial queries, we're already seeing a gap, there's an impact on decisions, but clicks are optional. That's why KPIs are becoming two-tiered: performance + presence.",
          "score": 4,
          "created_utc": "2026-02-09 13:16:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4flfs6",
          "author": "Choco_latte_cake_",
          "text": "I think the next painful battle will be over renewability. If AI responds with lag and pulls up old statements, companies will have to maintain a factual contour as an operational discipline.",
          "score": 2,
          "created_utc": "2026-02-09 13:54:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fvm2q",
          "author": "Bartooooooooooooooo0",
          "text": "Traffic is also declining because part of the information warm-up now takes place without a website. But that doesn't mean a website is unnecessary. It's just changing its role. \n\nAnd that's why you need to invest in content that can be quoted, verified, and doesn't look like marketing fluff!",
          "score": 2,
          "created_utc": "2026-02-09 14:51:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fiftw",
          "author": "YouFar6617",
          "text": "Theoretically, can we use 'we are quoted' as a KPI? Because I think we need to show how it drives business. I'd start with the fact that the answer layer is the top of the funnel, and it shifts the first contact with the brand.",
          "score": 1,
          "created_utc": "2026-02-09 13:37:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fkbdn",
              "author": "MainIndividual4664",
              "text": "We can't. Metrics must be close to reality: share of voice in AI across key clusters, presence in the shortlist, and correlation with downstream: brand queries, demo requests, conversion to SQL.",
              "score": 4,
              "created_utc": "2026-02-09 13:48:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4fwiji",
                  "author": "YouFar6617",
                  "text": "But how can we distinguish between what we simply hear and what we actually influence in terms of choice?",
                  "score": 1,
                  "created_utc": "2026-02-09 14:56:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4fzfr4",
          "author": "Virtual_Question_118",
          "text": "Asıl oyun, fikir birliği oluşturmaya benziyor. Modeller, kaynaklar arasında tekrarlanan ve doğrulanan şeylere güvenir; bu nedenle göreviniz, kusursuz bir sayfa yayınlamaktan, temel iddialarınızı belgeler, ortaklar, incelemeler, topluluklar ve basın genelinde tutarlı hale getirmeye dönüşür.",
          "score": 1,
          "created_utc": "2026-02-09 15:11:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g6iaj",
          "author": "Equal-Direction-8116",
          "text": "SEO used to optimize for clicks. Now it’s optimizing to be trusted by the model.",
          "score": 1,
          "created_utc": "2026-02-09 15:47:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gftt9",
          "author": "kubrador",
          "text": "so you're saying we spent 15 years optimizing for clicks and now the winning move is to just... let google steal our content and call it a win? the review platforms lost 80% of traffic but sure, they're \"visible\" now, which is great for feeling important i guess.",
          "score": 1,
          "created_utc": "2026-02-09 16:31:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ka3ys",
          "author": "Greenupseo",
          "text": "I think traffic is still a good metric, it just isn't the only one any more. If users get answers without clicking, influence matters more than visits. Leads and conversions feel like the real KPI now, even if they happen without a direct click. ",
          "score": 1,
          "created_utc": "2026-02-10 04:49:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ke282",
          "author": "KONPARE",
          "text": "I get the question. Being cited feels like “we won”, then you look at sessions and it’s… yikes.\n\nI don’t think traffic becomes useless, but it stops being the only scoreboard. AI mentions are more like **top of funnel influence**. Traffic is still where you actually collect leads, emails, trials, retargeting audiences, and where people go when they want details or trust checks.\n\nWhat I’ve started reporting is a simple split:\n\n* **Presence:** share of voice in AI answers for a fixed prompt set (weekly), plus which pages get cited\n* **Downstream:** brand search lift, demo requests, trials, assisted conversions (people who first touch AI then come back later)\n* **Quality:** what happens when they do click (time on page, scroll depth, conversion rate), not raw sessions\n\nIf stakeholders only care about pipeline, tie “AI visibility” to branded demand and assisted revenue. If you can’t connect it yet, call it what it is: awareness with a lag. That’s still valuable, just harder to measure.",
          "score": 1,
          "created_utc": "2026-02-10 05:18:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kf01g",
          "author": "RevolutionFluffy6316",
          "text": "Traffic is still valuable, but its role is definitely shifting. Being cited in AI answers gives influence even without clicks, so visibility and trust inside those responses are becoming just as important as traditional visits. For many businesses, the new focus is on brand presence, AI citations, and user influence rather than raw traffic numbers. Metrics like share of voice in AI answers, number of citations, and engagement from users who actually click through are starting to matter more than total visits.",
          "score": 1,
          "created_utc": "2026-02-10 05:25:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kjhg6",
          "author": "Street-Sprinkles-907",
          "text": "AI overviews are reshaping SEO. Do you think focusing on AI-friendly content will replace traditional traffic strategies? Share your thoughts!",
          "score": 1,
          "created_utc": "2026-02-10 06:00:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kmchl",
          "author": "supriya_l89",
          "text": "The primary measurement of value has evolved beyond traffic because it still retains its importance as a metric. AI answers which mention a brand enhance brand credibility and they lead customers to make purchasing decisions before they engage with content. The new measurement system requires organizations to evaluate their performance through two metrics which include AI citations and branded search lift and assisted conversions and pipeline impact assessment. Organizations must display their presence in AI systems because this new technology represents the next evolution of search engine results which requires organizations to track their performance after user sessions.",
          "score": 1,
          "created_utc": "2026-02-10 06:24:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kx3am",
          "author": "svlease0h1",
          "text": "traffic still matters but ai citations are becoming another signal of trust. we tracked brand search growth and demo requests after citation increases for a saas client and conversions stayed steady even when traffic dropped. focus on measuring branded search assisted conversions and mentions inside ai answers. traffic shows reach but trust shows intent.",
          "score": 1,
          "created_utc": "2026-02-10 08:02:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lkb8y",
          "author": "Aggravating-Key6628",
          "text": "Traffic as a KPI was already shaky before AI overviews - most B2B sites had terrible visit-to-lead conversion anyway. What is actually changing is where the decision happens. If someone reads an AI-generated comparison that mentions your product favorably, they might go straight to your pricing page or sign up without ever hitting your blog. So you still need the site, but the entry point shifts from top-of-funnel content to high-intent pages. The companies I have seen adapt fastest are the ones that stopped measuring blog traffic and started measuring how often their brand shows up in AI-generated answers for buying-intent queries. Different metric, same goal.",
          "score": 1,
          "created_utc": "2026-02-10 11:39:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ls33i",
          "author": "Charming-Commander",
          "text": "This shift is wild traffic is dropping hard even for platforms that get cited a lot in artificial intelligence answers but being in those responses still shapes what people choose. So is traffic still the goal or do we need new metrics to prove how much influence we have when users do not even click through.",
          "score": 1,
          "created_utc": "2026-02-10 12:36:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzy42j",
      "title": "Outreach for B2B these days. What are the best channels?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qzy42j/outreach_for_b2b_these_days_what_are_the_best/",
      "author": "Part_Time_Awesome",
      "created_utc": "2026-02-09 07:41:39",
      "score": 20,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "LinkedIn is the obvious place, yeah, but my ICP isn’t hanging out only there. Some are on Twitter, some are here on Reddit, and a lot of them don’t really post anywhere but still read everything quietly.\n\nThat’s where I’m kinda stuck. Is Twitter outreach even still a thing now, or is it just shouting into the void unless you already have an account with years of history? Reddit feels even more delicate. You can’t just slide into DMs or drop links without risking a ban, but at the same time a ton of potential customers are clearly here.\n\nSo the question is where do you start. How do you decide which channel makes sense for outreach vs which ones just end up annoying people?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qzy42j/outreach_for_b2b_these_days_what_are_the_best/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4ecwvh",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 07:41:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ees7i",
          "author": "bregat7will",
          "text": "Figure out where your ICP actually spends time and whether there’s real volume there in the first place. After that, you test channels and look for actual replies and conversations, not impressions or reach.\n\nBased on what I’ve faced with, LinkedIn, Twitter, and Reddit work best when the outreach is contextual and sounds human. You could try Marketowl, since it's built around tone and intent instead of pure message blasting. Facebook and Instagram is different game entirely. Most of acquaintances just outsource it to agencies in India and accept that it’s more about scale.",
          "score": 4,
          "created_utc": "2026-02-09 07:59:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4efhfw",
              "author": "Human_Hunter3435",
              "text": "the last one could be done with all channels and still bring some leads",
              "score": 2,
              "created_utc": "2026-02-09 08:06:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4rzqgt",
              "author": "Part_Time_Awesome",
              "text": "Sounds reasonable. Thanks",
              "score": 1,
              "created_utc": "2026-02-11 10:33:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4eev59",
          "author": "HarjjotSinghh",
          "text": "youtube dm's work better than linktree",
          "score": 1,
          "created_utc": "2026-02-09 08:00:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4eslbj",
          "author": "bubble-gum-doll",
          "text": "Twitter can still work, but only if you’re willing to put in the time. Cold DMs without presence don’t convert. Smart replies, consistent engagement, and only then one-to-one outreach.",
          "score": 1,
          "created_utc": "2026-02-09 10:16:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g99fj",
          "author": "Dangerous_Bowler3286",
          "text": "From what I’ve seen, there isn’t a single “best” channel anymore — it’s about how you use them together.\n\nCold email is still the most reliable starting point because it’s quiet, permission-based, and scalable when targeting and timing are right. It lets you open conversations without interrupting people. LinkedIn works best as a support channel, not the core warming things up, adding familiarity, and validating context after email.\n\nTwitter and Reddit are more about listening and learning than direct outreach. They’re great for spotting pain points and language, but pushing messages there too early usually backfires. Cold calls still have a place, but mostly after some prior signal or engagement.\n\nThe key shift is treating outreach as a system: identify intent → reach out with relevance → follow up consistently → move channels only when there’s interest. Channels don’t fail  fragmented execution does.",
          "score": 1,
          "created_utc": "2026-02-09 16:00:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kmj7a",
          "author": "supriya_l89",
          "text": "Start with where your ICP already engages, not just where they exist. LinkedIn serves as the most effective platform for direct outreach while Twitter/X provides better results for visibility and conversations than cold DMs. Users on Reddit should establish their credibility through commenting valuable content before they develop their online presence which will attract potential clients to them. The combination of email and niche communities, which include Slack and Discord and newsletters, should not be disregarded. I would create a channel map based on user intent which shows direct connections through LinkedIn and email and awareness connections through Twitter and trust-building connections through Reddit and communities.",
          "score": 1,
          "created_utc": "2026-02-10 06:26:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kqeu8",
          "author": "twiezn",
          "text": "So many websites and set your algorithm according to it then you will show so many ad relevant to it",
          "score": 1,
          "created_utc": "2026-02-10 07:00:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4le7u5",
          "author": "kkgohel",
          "text": "This thread pretty much nails it. There isn’t a single “best” channel anymore, it’s more about not forcing the wrong behavior in the wrong place.  \n  \nFor LinkedIn specifically, I’ve seen it work when people stop treating it like pure cold outreach and more like controlled volume + relevance. Some teams still use tools like Waalaxy or Expandi, but they get messy fast if you’re juggling multiple client accounts or trying to keep tone consistent. That’s where something like HeyReach feels a bit more practical since it’s built around running several LinkedIn accounts without turning everything into obvious spam. Still only works if the message actually makes sense for who you’re reaching.  \n  \nTwitter and Reddit feel more like research and reputation layers than outreach layers. You pick up language, pain points, timing. Then LinkedIn or email becomes the place where you actually start the conversation. When people jump straight to DMs on Reddit or X, it almost always backfires.  \n  \nThe big filter for me is always intent. If someone is clearly in discovery mode, LinkedIn or email is fine. If they’re just observing, you earn attention first and outreach comes later, if at all. Channels don’t really annoy people, lazy execution does.",
          "score": 1,
          "created_utc": "2026-02-10 10:47:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lmw73",
          "author": "Electronic-Test4975",
          "text": "No. B2BSMSMail isn’t built for B2C marketing, mass consumer campaigns, or promotional blasts. It’s strictly designed for compliant, one-to-one and small-scale B2B communication between businesses.",
          "score": 1,
          "created_utc": "2026-02-10 11:59:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n8q9t",
          "author": "Aromatic-Homework394",
          "text": "I genuinely feel you should focus more on linkedin and try n become a \"micro influencer\" there. That is going to help you the most in generating organic leads. I dont think twitter outreach is a thing now, but linkedin is a super channel esp once you get the hang of it, you can easily generate a bunch of leads. Reddit, yes, it has a lot of friction due to bans and mods. But there's a qay to approach this too. \n\nI honestly bet on two channels -- linkedin but it is only going to work if you do NOT treat it as a cold outreach channel but as a platform to connect engage and basically like i said try n become an influencer\n and then cold outbound (emails). Cold emails is prolly one of the quickest to get results. Reddit is tough waters so maybe do it later.\n\nOther than that, join communities on slack and other places where your icp might hang.",
          "score": 1,
          "created_utc": "2026-02-10 17:09:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4edc4p",
          "author": "PearlsSwine",
          "text": "Conventions and networking events are always the best for B2B.\n\n\"How do you decide which channel makes sense for outreach vs which ones just end up annoying people?\"\n\nNo channel makes sense for cold outreach. Because cold outreach is spam. No one likes being spammed. You'll burn so many bridges, it's just not worth it.",
          "score": 1,
          "created_utc": "2026-02-09 07:45:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4edhwo",
              "author": "Part_Time_Awesome",
              "text": "hm. I've never thought of live channels...",
              "score": 2,
              "created_utc": "2026-02-09 07:47:11",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4egsm9",
              "author": "Logical_Rooster_9049",
              "text": "I don’t think it works for digital products, in my humble opinion.",
              "score": 1,
              "created_utc": "2026-02-09 08:18:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4eivuq",
                  "author": "PearlsSwine",
                  "text": "You're very wrong. But, you do you!",
                  "score": 1,
                  "created_utc": "2026-02-09 08:39:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ghh79",
          "author": "Brooklyn_100",
          "text": "This is a really real question, and honestly the frustration is valid.\n\nWhat I’ve seen work lately isn’t picking “the best channel,” it’s matching the channel to *intent*.\n\nLinkedIn still works best when you’re clear about who you’re reaching and why. Not blasting connection requests, but targeted outreach where the message is obviously relevant to their role or current situation. Quiet readers are still there, they just don’t engage publicly.\n\nTwitter is tougher unless you already have history, but it can work if you treat it less like outreach and more like reputation building. People notice patterns over time, not single DMs. Cold Twitter DMs without context usually go nowhere.\n\nReddit is different. It’s not an outreach channel in the traditional sense. It’s more like a long game of being useful in the right rooms. When you consistently add value to conversations your ICP already cares about, DMs tend to come to you. The moment it feels transactional, it backfires.\n\nThe mistake I see most is trying to force the same behavior everywhere. Each platform has its own social contract. If you respect that, outreach feels like relevance instead of noise.\n\nThere’s a bit more nuance in how to decide where to invest first depending on your ICP and offer, but that’s the general framework I use. Happy to go deeper if you want to talk through a specific case, feel free to DM me.",
          "score": 0,
          "created_utc": "2026-02-09 16:39:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qymsz8",
      "title": "Managing multiple social accounts is draining me, how are you all keeping workflows organized?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qymsz8/managing_multiple_social_accounts_is_draining_me/",
      "author": "Zerexdontlie",
      "created_utc": "2026-02-07 19:22:42",
      "score": 15,
      "num_comments": 22,
      "upvote_ratio": 0.75,
      "text": "I’m running social for a couple of small businesses and keeping everything straight across platforms has started to feel like a second job.\nBetween approvals living in Slack, comments handled natively, videos edited somewhere else and posting reminders stuck in 3 different calendars… it’s getting chaotic.\n\nI don’t necessarily want a massive enterprise suite, but I also don’t want five different tools for one workflow. Ideally:\n- scheduling without quirks\n- clean approval flow\n- shared inbox that isn’t a mess\n- something that doesn’t freak out platforms’ APIs\n\nFor those managing several accounts or clients what actually helped simplify things without going overkill? Curious what’s been working for people day to day.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qymsz8/managing_multiple_social_accounts_is_draining_me/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o44odgz",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 19:22:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48kh8n",
          "author": "Aggravating-Key6628",
          "text": "The real issue isn't the tools — it's having your workflow split across too many places. When approvals are in Slack, content in Google Drive, and posting schedules in three calendars, you're spending more time context-switching than actually working.\n\nHere's what's worked for me: pick one scheduling tool and force everything through it, even if it feels clunky at first. The consistency matters more than features. For approvals, a simple shared Google Doc with status labels (Draft/Review/Approved/Posted) beats fancy approval systems that nobody checks. And honestly? Skip the unified inbox dream — most of those tools are janky. Just block 20 minutes twice a day to check each platform natively. Way faster than wrestling with half-broken integrations.",
          "score": 2,
          "created_utc": "2026-02-08 11:37:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44q5ou",
          "author": "AdvantageNorth1032",
          "text": "Whatever you choose, make sure it plays nice with official APIs. That’s where some tools get messy. I’ve had zero issues using Vista Social. it feels like the safer middle option between lightweight schedulers and the big platforms.",
          "score": 1,
          "created_utc": "2026-02-07 19:31:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44za87",
              "author": "Old-Push-7296",
              "text": "Agreed. A lot of “risk” really just comes from tools pushing aggressive features. The legit platforms that stick to API rules tend to run smoothly.",
              "score": 1,
              "created_utc": "2026-02-07 20:20:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o44qdch",
          "author": "Halimaa09",
          "text": "One thing I liked about Vista Social is that it doesn’t add unnecessary complexity. Scheduling + approvals + inbox + analytics in one dashboard is basically all I needed and it keeps things clean.",
          "score": 1,
          "created_utc": "2026-02-07 19:33:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o46fvul",
              "author": "PhaseDramatic6137",
              "text": "Yeah, the simplicity is underrated. Not every team needs a giant enterprise tool sometimes the “middle ground” tools work best.",
              "score": 1,
              "created_utc": "2026-02-08 01:23:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o44r04e",
          "author": "R6fi",
          "text": "If you’re juggling multiple brands, check whether the tool supports easy multi account management. Vista Social saved me from constant login swapping that alone made it worth it.",
          "score": 1,
          "created_utc": "2026-02-07 19:36:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44xcmw",
              "author": "No-Volume2455",
              "text": "The account switching was a nightmare before I used it too. Now everything’s in one dashboard and way less stressful.",
              "score": 1,
              "created_utc": "2026-02-07 20:09:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o47oawj",
          "author": "pra__bhu",
          "text": "this pain is real and honestly most tools solve one piece but create friction somewhere else\nfrom what ive seen working in the agency space: the approval flow is usually what breaks first. scheduling tools handle posting fine but the back-and-forth with clients lives in email/slack and nothing connects\na few things that helped people i know:\n\t∙\tpick one tool for scheduling/posting and just accept its limitations rather than patching with 3 others\n\t∙\tfor approvals, some teams just use a shared notion board or even a simple google sheet with status columns - ugly but everyone can see it\n\t∙\tshared inbox is tough, most “unified inbox” features are half-baked. some folks just dedicate time blocks to check each platform natively rather than fight a broken aggregator\nwhat platforms are you mainly on? the answer changes a lot depending on whether its meta-heavy vs linkedin vs tiktok​​​​​​​​​​​​​​​​",
          "score": 1,
          "created_utc": "2026-02-08 06:36:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49clt5",
          "author": "SentimentalEmy1005",
          "text": "I felt the same until I tried an all in one tool that handles scheduling, approvals and inboxes in one dashboard. It made managing multiple accounts way less stressful and kept everything organized without juggling five different apps.",
          "score": 1,
          "created_utc": "2026-02-08 14:50:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49p4qm",
          "author": "ChestChance6126",
          "text": "Been there, the drain usually comes from fragmentation more than volume. What helped me was getting ruthless about defining one “source of truth” for content and approvals, then letting everything else be downstream. I stopped trying to manage comments in five native inboxes and accepted that “good enough” coverage beats perfect responses everywhere. also worth separating creation cadence from posting cadence, batching content twice a week reduced a ton of mental load. Most tools fail when you expect them to do strategy and ops at the same time, pick one that’s boring but stable for ops and keep thinking elsewhere.",
          "score": 1,
          "created_utc": "2026-02-08 15:55:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f7b68",
              "author": "EerieIsACoolWord",
              "text": "What do you mean by batching?",
              "score": 1,
              "created_utc": "2026-02-09 12:23:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ccqcm",
          "author": "HarjjotSinghh",
          "text": "oh hell yeah i use a single spreadsheet",
          "score": 1,
          "created_utc": "2026-02-08 23:55:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ngapi",
          "author": "Yapiee_App",
          "text": "What helped me most wasn’t a new tool, it was collapsing decisions. One place for approvals, one place for scheduling, and everything else treated as input only. Once fewer things needed daily attention, the chaos dropped fast even if the stack wasn’t perfect.",
          "score": 1,
          "created_utc": "2026-02-10 17:44:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qmqvh",
          "author": "LaurenVAhorizon",
          "text": "Managing multiple accounts slowly turned into context switching all day for me. Everything lived in a different place and nothing really talked to each other. I tried simplifying pieces of the workflow and even tested tools like ForaPost at one point, but it still felt like an ongoing experiment rather than a clean fix.",
          "score": 1,
          "created_utc": "2026-02-11 03:39:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ruq1e",
          "author": "levichambers_1",
          "text": "Im from the Content Studio team (a social media management + scheduling tool) and im 100% positive we can help yu solve this. \n\n\\- scheduling: you upload your media and text and the 'publisher' takes care of the rest, if anything fails due to any reason you get clear warning notifications. nothing falls through the cracks. \n\n\\- approval workflow: this is one of our main usp, as we started this tool for smm agencies and multi location businesses, we knew how messy the approval workflow can be, just give it a trial and you'll see how smooth it is irl\n\n\\- unified inbox: check. \n\n\\- platform api friendly: you'll be in good hands. we're doing it for years and built one of the most, if not the most reliable platform that works with the platfomrs. do give it a try and you'll see for yourself. ",
          "score": 1,
          "created_utc": "2026-02-11 09:47:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vk2zt",
          "author": "hibuofficial",
          "text": "This is usually the moment when someone realizes they’re not managing social anymore… they’re managing chaos.\n\nWhat you described is pretty much the breaking point most small business teams hit. Slack approvals that get buried. Someone replies to a comment natively and nobody else knows. A video gets edited twice because the “final” version wasn’t actually final.\n\nIt’s rarely about needing some giant enterprise suite. It’s usually about too many half-solutions stacked together.\n\nThe teams that seem to calm things down pick one scheduler that actually publishes consistently and move approvals inside that tool instead of running them through chat. That alone cuts a surprising amount of friction. Same with a shared inbox that forces ownership so comments don’t just sit there waiting for whoever notices first.\n\nAlso, separating drafting from publishing, even if it’s informal, helps more than people expect. When one person is creating and another is responsible for pushing live + monitoring, things stop slipping through cracks.\n\nHalf the battle is really just removing duplication.",
          "score": 1,
          "created_utc": "2026-02-11 21:55:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2yfoi",
      "title": "Took me 5 years to learn this satisfying thing - some clients are NOT worth saving",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r2yfoi/took_me_5_years_to_learn_this_satisfying_thing/",
      "author": "darmaan-seowizard",
      "created_utc": "2026-02-12 16:45:19",
      "score": 12,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Early in my career, I had this mindset that if a client was unhappy or leaving, it was MY failure. So I'd bend over backwards, extra revisions, discounted rates, working weekends just to \"save\" them.\n\nOne client in particular wrecked me for months. E-commerce brand, decent budget, but impossible expectations. They wanted page 1 rankings in 4 weeks for keywords that had 50K+ monthly searches. When I explained that's not how SEO works, they'd go quiet... then come back a week later asking why they're not ranking yet.\n\nI kept trying to educate them. Kept sending reports. Kept justifying every move.\n\nEventually, they left anyway. Called my work \"too slow.\"\n\nHere's what hit me later: I spent SO much energy on someone who was never going to be happy, that I half-assed my communication with 3 other clients who actually trusted me. One of them even churned because I was \"hard to reach.\"\n\nLost a good client trying to save a bad one.\n\nNow I qualify harder upfront. If someone's first question is \"how fast can you rank me #1\", I know we're probably not a fit. And I'm genuinely okay with that.\n\nHas anyone else been through something similar? Curious how others handle the \"this client is draining me, but I don't want to quit\" situation.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r2yfoi/took_me_5_years_to_learn_this_satisfying_thing/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o50a5uk",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-12 16:45:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50nghh",
          "author": "Confident-Tank-899",
          "text": "This took me way too long to learn. I used to think every client problem was my fault, like I just needed to explain better or work harder. Spoiler: some people just don't want results, they want problems to complain about.\n\n\n\nThe clients worth keeping have these in common:\n\n\\- They actually read and implement feedback\n\n\\- They're honest about their budget from the start\n\n\\- They have realistic timelines\n\n\\- If something isn't working, they want to fix it instead of blame you\n\n\n\nThe nightmare clients:\n\n\\- They ask for \"quick and cheap\" like that's how marketing works\n\n\\- They compare your work to a competitor's multi-million dollar campaign\n\n\\- They want results without actually giving you the information you need\n\n\\- They disappear for months then ask why nothing changed\n\n\n\nOnce I started saying no to bad fits, my revenue actually went up because I had time to actually deliver for people who weren't draining me.",
          "score": 1,
          "created_utc": "2026-02-12 17:48:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50ojjz",
          "author": "ladipn",
          "text": "Yh, i think most learn this way. The relationship needs to be reciprocal. Unless you’re at risk of homelessness, the juice is rarely worth it for clients who want miracles.\n\nSometimes that attempt at education is actually counter productive as you’re teaching them that being difficult will produce more attention. \n\nBe firm and clear upfront.\n\nI wouldn’t ever ignore a client but very happy to reiterate a simple point without wasting everybody’s time.",
          "score": 1,
          "created_utc": "2026-02-12 17:53:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o524iqy",
          "author": "Adcero_app",
          "text": "same thing on the paid ads side. had a client who'd approve a campaign strategy, then panic two days in and want to change everything because \"it's not converting yet.\" two days. on a cold audience.\n\nended up spending more time managing their anxiety than actually optimizing the campaigns. meanwhile my other accounts were on autopilot when they shouldn't have been.\n\nthe moment I started qualifying on patience and realistic expectations, the quality of my work across the board went up. some people just want someone to blame when things don't go perfectly, and no amount of reporting or education changes that.",
          "score": 1,
          "created_utc": "2026-02-12 21:59:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52pa9u",
          "author": "fatjoe-SEO",
          "text": "The real cost isn’t the difficult client, it’s the opportunity cost.  \n draining account can quietly lower the quality of delivery for 3 good ones. Most agencies only realize that after losing a solid client trying to save a bad fit",
          "score": 1,
          "created_utc": "2026-02-12 23:50:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52qvax",
          "author": "RobertLigthart",
          "text": "the \"lost a good client trying to save a bad one\" part is the real lesson here. opportunity cost is invisible until its too late\n\n  \nmy red flag list now: asking for guarantees on rankings, comparing you to their last agency in the first call, wanting weekly reports but never reading them. if you hit 2 out of 3 just save everyone the trouble",
          "score": 1,
          "created_utc": "2026-02-12 23:59:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r00ckw",
      "title": "Is Post Purchase Revenue Optimization (PRO) actually worth it in 2026?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r00ckw/is_post_purchase_revenue_optimization_pro/",
      "author": "Training-Entry-743",
      "created_utc": "2026-02-09 10:03:26",
      "score": 10,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Ok now this might be a dumb question, but I keep seeing people talk about post purchase revenue optimization and I am not totally sure how much it actually moves the needle.\n\nAnd don't get me wrong, I get the idea. Stuff like adding post checkout offers, or running retention flows after someone already bought, so you're not reallyt paying for more ads. I mean in theory that sounds good, but I haven't personally run many clean tests on it yet.\n\nI have been poking around tools in this space, like Cleverific and other alternatives mostly because a client asked about it, but I am not confident enough to recommend PRO as a real growth lever without hearing from people who have actually used it tbh",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r00ckw/is_post_purchase_revenue_optimization_pro/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4eracz",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 10:03:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4eshxi",
          "author": "HarjjotSinghh",
          "text": "2026? sure let's optimize my 9% churn with a maybe.",
          "score": 1,
          "created_utc": "2026-02-09 10:15:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ewd55",
          "author": "RevolutionFluffy6316",
          "text": "Yes, it *can* be worth it in 2026, but how much it moves the needle depends on the business. For stores with decent order volume and repeat purchase potential, post-purchase offers and retention flows often outperform cold acquisition because you’re monetizing **already acquired customers** rather than paying to acquire new ones again. In practice, adding a smart offer after checkout or setting up automated email/SMS flows for cross-sells and repeat purchases usually lifts overall revenue without much extra ad spend, but it’s not a silver bullet.",
          "score": 1,
          "created_utc": "2026-02-09 10:52:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gucsd",
          "author": "emma-collins1",
          "text": "In 2026 - PRO is a powerhouse! It boosts revenue by 10%-30% without additional advertising costs. It’s absolutely a real growth lever.",
          "score": 1,
          "created_utc": "2026-02-09 17:40:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4il3ax",
          "author": "KNVRT_AI",
          "text": "Not a dumb question at all, most ecom brands completely ignore post purchase and leave stupid amounts of money on the table. It's one of the highest leverage things you can do because the hardest and most expensive part, getting someone to trust you enough to buy, is already done.\n\nThe math is pretty simple. Acquiring a new customer costs whatever your CAC is. Getting an existing buyer to purchase again costs almost nothing by comparison. Even small improvements in post purchase conversion rates have an outsized impact on overall profitability because there's virtually no additional acquisition cost eating into the margin.\n\nWhat actually works in practice from what we've seen with our clients. Post purchase upsell offers immediately after checkout convert anywhere from 5 to 15% depending on the offer relevance and discount. That's essentially free revenue on transactions that already happened. Retention email flows triggered by purchase behavior, not just generic \"thanks for buying\" sequences but actually intelligent flows based on what they bought, when they're likely to need a refill or complementary product, and their browsing behavior after purchase. Those consistently outperform broadcast campaigns by a wide margin.\n\nThe tools in this space have gotten way better. Cleverific is fine for Shopify focused post purchase offers but honestly the real gains come from building out the full retention system, not just slapping an upsell widget on the thank you page. The widget alone is a nice bump but it's like 20% of the actual opportunity.\n\nWhere most people screw this up is treating PRO as a one time setup and forgetting about it. The brands crushing it are testing different post purchase offers constantly, segmenting by first time vs repeat buyers, adjusting timing on follow up flows based on actual repurchase data, and tracking contribution margin on repeat purchases separately from new customer acquisition.\n\nThe biggest thing nobody talks about is that strong post purchase optimization actually makes your paid acquisition more aggressive because your LTV goes up. If you know a customer is worth $150 over 6 months instead of just their first $50 order, you can afford a higher CAC and outbid competitors who are only optimizing for first purchase ROAS. That's the real compounding effect.",
          "score": 1,
          "created_utc": "2026-02-09 22:48:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ir4ut",
          "author": "Forgotpwd72",
          "text": "Holy crap post. I can't tell if the rest of the commenters are in on your game...",
          "score": 1,
          "created_utc": "2026-02-09 23:20:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qjkcl",
          "author": "Free_Explorer6853",
          "text": "Yes, very much so. +1 for Cleverific (they have free booking demos)",
          "score": 1,
          "created_utc": "2026-02-11 03:19:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qznxqf",
      "title": "Digital marketing services for law firms, what moves the needle?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qznxqf/digital_marketing_services_for_law_firms_what/",
      "author": "SmythOSInfo",
      "created_utc": "2026-02-08 23:10:31",
      "score": 10,
      "num_comments": 24,
      "upvote_ratio": 0.92,
      "text": "I’m part of a small law firm that’s starting to look more seriously at digital marketing services, and honestly, the landscape feels overwhelming.\n\nEvery provider seems to offer the same bundle: SEO, PPC, social media, content, reputation management. On paper it all sounds great, but it’s hard to tell what actually drives signed cases versus what just looks good in a monthly report.\n\nWe’ve spoken with a mix of vendors, from large legal marketing companies to agencies like Clectiq and a few boutique firms that focus more on strategy and execution than volume. The pitches are very different, which makes it harder to compare apples to apples.\n\nFor those of you who’ve actually hired digital marketing services for a law firm:\n\n* What services ended up being worth the money?\n* What felt like a waste once you looked back?\n* Did you go all-in with one agency or piece things together with specialists?\n\nNot looking for hype or sales pitches, just real-world experiences from firms that have tried to grow online in a competitive market.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qznxqf/digital_marketing_services_for_law_firms_what/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4c54hi",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-08 23:10:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4cgx04",
          "author": "dbinkowski",
          "text": "The problem with most agencies is that they're going to sell you on either their cookie cutter playbook they use for other law firms or clients. I took on a national law firm last summer and just by shifting the strategy increase revenue by 300% month over a month and just 30 days.\n\nFocus on your ideal customer and how they consume media and the customer journey. The blanks will fill themselves in.",
          "score": 1,
          "created_utc": "2026-02-09 00:19:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4cq2ca",
          "author": "PileofMail",
          "text": "We’ve been building reviews across Avvo, Justia, lawyer.com, Google and Facebook for one of our attorney clients and, when we do spot tests, it has improved the clients visibility in AI and in search. Reviews are big for every industry right now.",
          "score": 1,
          "created_utc": "2026-02-09 01:10:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d7sdk",
          "author": "SimonBuildsStuff",
          "text": "Worked with professional services firms (not law specifically, but similar dynamics).\n\nHonesty? SEO and content moved the needle, but only after 6-9 months. PPC drove immediate cases but got expensive fast in competitive practice areas.\n\nWhat felt like a waste: social media management. Professional services clients don't pick a lawyer because of your Instagram. Save that budget.\n\nOne thing that worked for us: insisting on reference clients before signing. Any agency worth their fee should have 2-3 firms you can actually call. If they dodge that, walk away.",
          "score": 1,
          "created_utc": "2026-02-09 02:45:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dhu5l",
          "author": "Terrible-Repair-9421",
          "text": "For law firms, local SEO + high-intent PPC + call/intake tracking drive cases.  \nSocial posting and generic blogs usually don’t.\n\nMost firms win by using specialists, not all-in-one agencies if it doesn’t tie to calls and signed cases, it’s noise.",
          "score": 1,
          "created_utc": "2026-02-09 03:40:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dis3i",
          "author": "dot-kaio",
          "text": "Interesting",
          "score": 1,
          "created_utc": "2026-02-09 03:46:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4e1ugd",
          "author": "supriya_l89",
          "text": "What really counts isn’t the full package, it’s what links straight to closed deals. Most offices I’ve come across found that sharp SEO targeting practice areas and towns pulled strongest results. Paid ads worked best when aimed at late-stage searches. A solid system for handling leads made a real difference too. Articles and posts built trust over time though they seldom brought in clients alone, except in narrow specialties. Managing reviews had an effect mostly by lifting visibility nearby and helping turn lookers into callers, not by bringing more visitors.\n\nMost of the time, effort slips away into broad social updates, shallow numbers like likes, or lengthy SEO deals missing solid lead data. Pick one team or several experts, it does not matter - what matters is demanding tracked phone calls, documented form sources, plus a clear view of how much each closed case costs. Without those, measuring returns stays out of reach.",
          "score": 1,
          "created_utc": "2026-02-09 06:02:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4e3nuf",
          "author": "ProfessionalPair8800",
          "text": "From our experience, what actually makes a difference is what turns into signed cases, not nicer reports.\n\nWhat made a real impact for us:\n\n* Local SEO (Google Business Profile, location-based practice pages)\n* A small number of clear, helpful pages that answer real client questions\n* Measuring signed cases, not just traffic or form fills\n\nWhat didn’t add much value:\n\n* Social media posting without a clear goal\n* Generic content created just to “check a box\n* All-in-one packages where everything is included but nothing is done deeply\n\nWe worked with a legal marketing agency, and the experience showed us that agencies can be very effective when chosen carefully. Results improved once we partnered with the right team and had clear communication, expectations, and ownership across each part of the strategy.",
          "score": 1,
          "created_utc": "2026-02-09 06:18:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4e545g",
          "author": "XilianRath",
          "text": "Target local SEO as your priority. People will always search state level and city level for a lawyer. It signals trust. Reviews are the next focus. \n\nSince the recent February 5th Google update, geography and SEO answering key questions are more relevant than ever. This means dominate your local town/city first with SEO and ads. Then move up as you scale.\n\nGoogle ads are for high intent, though more costly. Other platforms like IG or FB is more impulse buy. \n\nSEO means less costly conversions to sales long term.",
          "score": 1,
          "created_utc": "2026-02-09 06:30:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ejvub",
          "author": "AgilePrsnip",
          "text": "this question is real and most law firms learn it the hard way. what actually drove signed cases was intent heavy ppc for specific practice areas and tight local seo backed by real reviews, not broad social or generic content. seo only worked when pages were one service one city with proof like case types or outcomes, otherwise it looked good in reports but not on the phone. the firms that won tracked calls weekly, cut the fluff fast, and kept only the channels that brought real conversations.",
          "score": 1,
          "created_utc": "2026-02-09 08:49:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4esiti",
          "author": "bubble-gum-doll",
          "text": "For us, all the agency decks looked the same, only the logo changed. SEO, PPC, social, the standard bundle. In the end we stayed with the one that brought clients, not pretty slides. We worked with ABOGADOS NOW for Hispanic clients and honestly, the only KPI we cared about was how many new cases came in. They did a good job, spoke to people in Spanish and we could focus on case work instead of ads. Not very fancy, but it worked.",
          "score": 1,
          "created_utc": "2026-02-09 10:15:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fhtzv",
          "author": "LeadGenDotCom",
          "text": "Effective digital marketing in the legal space is incredibly expensive. You'd be better off buying leads if you're small. There are issues depending on what state you operate in. But there are some good sources. If you still want to break through the clutter yourself, be prepared to spend a lot of money because the platforms make you bid against your competition.",
          "score": 1,
          "created_utc": "2026-02-09 13:33:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fqrsb",
          "author": "UnderstandingReal526",
          "text": "I run a small law firm in the UK and the best decision we made was to hire our own in house person. They were self taught but we could not survive without them.",
          "score": 1,
          "created_utc": "2026-02-09 14:25:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gc83h",
          "author": "JMWebDesign",
          "text": "Not a law firm, but we have law clients that we work with. Local SEO and a mix of Meta and Google Ads has been our best performing strategy. Takes time and someone with expertise to break through the competition; but it is well worth it. Currently averaging approx. 4.9x ROAS and seeing \\~$22 cost per lead. Hope this helps!",
          "score": 1,
          "created_utc": "2026-02-09 16:14:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kjovo",
          "author": "RevolutionFluffy6316",
          "text": "From what I’ve seen with small law firms, the things that actually move the needle are very practical. SEO for high-intent local keywords, Google Business Profile optimization, and reputation management tend to directly drive inquiries and signed cases. Paid ads can work if tightly targeted, but general social media content rarely converts unless it’s part of a very specific strategy. Many firms find it better to work with one agency that really understands legal marketing rather than piecing together multiple specialists, because consistency and messaging matter a lot for trust. The key is measuring leads and cases, not likes or page views.",
          "score": 1,
          "created_utc": "2026-02-10 06:02:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4o90t7",
          "author": "Anita78202",
          "text": "This is new as tech changes how we generate leads.  Scout out new technology that will give you an edge.  Search intent technology is out there to now identify leads when they type in your keywords.  For example, someone types in \"persona injury lawyer\", you get their name, contact info, address, and other demographic data.  No PPC, but you can compliment your PPC campaigns with this as well. How?  You pay for Google traffic to your site and it gets expensive.  This tech can help capture the 90% of traffic that rarely converts on your page.  This data will allow you to do custom audience FB campaigns, direct mail, and streaming ads.  Much more of an ecosystem that will allow you to be sniper targeted, reduce costs, and move up your ROI as you are targeting people that have raised their hands.  Happy to answer any questions!",
          "score": 1,
          "created_utc": "2026-02-10 19:56:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ryxe0",
          "author": "Prize-Enthusiasm3828",
          "text": "woah seems like a nice idea ",
          "score": 1,
          "created_utc": "2026-02-11 10:25:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4skete",
          "author": "sgtkebab",
          "text": "I work with law firms on digital marketing, not a lawyer, but the trend I’ve seen is:  \n  \nContent + SEO moves the needle more than flashy reports. Helpful blog posts answering client questions bring actual inquiries.\n\nPPC works if your intake process is solid, but it’s easy to overspend without strong follow-up.\n\nSocial media looks nice but rarely converts directly, use it to build trust and reputation, not cases.\n\nMost firms do better focusing on one strong agency for strategy and execution rather than patching together five vendors.",
          "score": 1,
          "created_utc": "2026-02-11 13:10:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51z1e6",
          "author": "hibuofficial",
          "text": "A lot of firms hit this point after a few vendor calls. Everything sounds right, but it’s hard to see what actually turns into retained clients.\n\nFor law firms, what usually moves the needle isn’t “more marketing,” it’s alignment with intent. High-intent local SEO pages tend to outperform general content. Traffic from educational blog posts can look impressive, but the cases typically come from people searching very specific, high-pressure terms tied to their situation.\n\nPPC can absolutely work, especially in competitive metros. The difference tends to be in keyword discipline and intake quality. Broad match campaigns and loose intake processes quietly eat budgets.\n\nReviews and reputation matter more than most firms expect. In local search, they influence conversion behavior in a very real way. Not flashy, but it adds up.\n\nWhere firms sometimes overspend is generic social posting that isn’t tied to authority, remarketing, or positioning. It keeps a feed active, but rarely drives signed cases on its own.\n\nOn structure, having one accountable strategist coordinating everything usually reduces waste. Piecing together vendors can work, but it requires strong internal oversight or things drift.\n\nA useful internal question tends to be: are you tracking signed cases by channel, or just leads? That answer usually clarifies what’s actually working!",
          "score": 1,
          "created_utc": "2026-02-12 21:32:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4c78y1",
          "author": "shaon343",
          "text": "For law firms, SEO is the top priority. Your clients search online first when they have a legal issue. \n\nPPC doesn't work as well for law firms. You need a solid website and strong keyword-focused SEO. \n\nSo yes, going all-in with one agency like W3 Solved is much easier than juggling multiple providers.",
          "score": 0,
          "created_utc": "2026-02-08 23:22:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4cbxa1",
          "author": "Puzzleheaded_Low2965",
          "text": "I am in contact with an agency that specializes in removing bad google reviews for law firms if you’re interested",
          "score": 0,
          "created_utc": "2026-02-08 23:50:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzi2e9",
      "title": "How do you stop marketing from becoming a random collection of tactics?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qzi2e9/how_do_you_stop_marketing_from_becoming_a_random/",
      "author": "Naive_Bed03",
      "created_utc": "2026-02-08 19:21:27",
      "score": 9,
      "num_comments": 11,
      "upvote_ratio": 0.92,
      "text": "Right now our marketing is basically a pile of tactics. Some SEO, some ads, some email, some social. Each piece has an owner, but none of it feels connected. If someone asked me “what’s the strategy,” I’d struggle to explain it in one clear sentence. I think that’s why results feel inconsistent. For teams that turned scattered marketing into something coherent, what was the turning point?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qzi2e9/how_do_you_stop_marketing_from_becoming_a_random/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4awbqg",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-08 19:21:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4bav64",
          "author": "OMAnxiety",
          "text": "Off the top of my head, it sounds like you have a staff, but you need a ‘creative director’ or ‘online marketing manager’ above the staff to be the coordinator of all the pieces?",
          "score": 2,
          "created_utc": "2026-02-08 20:33:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kxbls",
              "author": "Naive_Bed03",
              "text": "Yes that's absolutely true",
              "score": 1,
              "created_utc": "2026-02-10 08:04:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4b1rpg",
          "author": "ItsReaz",
          "text": "remindme! 5 days",
          "score": 1,
          "created_utc": "2026-02-08 19:48:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4b1zbv",
              "author": "RemindMeBot",
              "text": "I will be messaging you in 5 days on [**2026-02-13 19:48:09 UTC**](http://www.wolframalpha.com/input/?i=2026-02-13%2019:48:09%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/digital_marketing/comments/1qzi2e9/how_do_you_stop_marketing_from_becoming_a_random/o4b1rpg/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fdigital_marketing%2Fcomments%2F1qzi2e9%2Fhow_do_you_stop_marketing_from_becoming_a_random%2Fo4b1rpg%2F%5D%0A%0ARemindMe%21%202026-02-13%2019%3A48%3A09%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201qzi2e9)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "score": 1,
              "created_utc": "2026-02-08 19:49:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4cjqch",
          "author": "littlebigwing",
          "text": "This was my team before our new director joined. We were doing a bit of everything. She asked us to explain how our tactics roll up to our annual marketing strategy. We realized we didn’t have one. Now we are going back to basics and building a marketing strategy first. Then we will look at all our tactics and see what can stay and what needs to go or change. They all need to be working towards a common goal.",
          "score": 1,
          "created_utc": "2026-02-09 00:34:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kxhd1",
              "author": "Naive_Bed03",
              "text": "Having a clear goal is actually the way to go instead of everyone doing their own thing without a common goal",
              "score": 1,
              "created_utc": "2026-02-10 08:06:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e2dpl",
          "author": "supriya_l89",
          "text": "That moment changed everything - when we stopped fixating on channels and started following the customer’s path. A single target took center stage: building a solid pipeline. With the ideal customer pinned down, along with what we’d say to them, every move found its place in the process. Each tool had to earn its spot by fueling a step or showing results. Tactics without purpose? They disappeared quietly.\n\nA shift in daily habits made a difference. Then came another change - small but steady - that added up over time\n\nA clear plan begins by naming who it's for. Moving on, how you stand out matters just as much. Then comes the path people follow, step by step. What success looks like gets spelled out with numbers that track progress.\n\nStart with a single guiding number that everyone follows. Reporting lines up to this target, not scattered across separate channels. One measure shapes decisions. Teams look at the same result, not different ones. Focus stays sharp because effort points one way. What matters shows up clearly when all reports link back here.\n\nWhen all pieces point one way, moves that seemed scattered begin to connect. What looked like noise turns into rhythm.",
          "score": 1,
          "created_utc": "2026-02-09 06:07:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f7iy9",
          "author": "BrentMaxey",
          "text": "Sounds familiar. But strategy came when we picked one real goal, then every channel serve it. And killing random ideas helped a lot... coherence beats busy marketing chaos fades fast",
          "score": 1,
          "created_utc": "2026-02-09 12:25:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4knw49",
          "author": "Theknightinme",
          "text": "The turning point for us was stepping back and designing the whole thing as one system. thewayhow helped us connect channels to the same goal instead of treating them like separate projects.",
          "score": 1,
          "created_utc": "2026-02-10 06:38:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzyg8m",
      "title": "How are AI changes affecting digital marketing?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qzyg8m/how_are_ai_changes_affecting_digital_marketing/",
      "author": "Unable-Connection-58",
      "created_utc": "2026-02-09 08:02:37",
      "score": 8,
      "num_comments": 23,
      "upvote_ratio": 1.0,
      "text": "Hi everyone,  \n  \nI wanted to start a simple discussion about recent AI changes in digital marketing.\n\nHow are these AI updates affecting marketing strategies, tools, or daily work?  \nAre there any major changes marketers should be aware of?\n\nLooking forward to hearing your thoughts and experiences.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qzyg8m/how_are_ai_changes_affecting_digital_marketing/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4ef4lo",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-09 08:02:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4etpis",
          "author": "SERanking_news",
          "text": "AI updates are pushing marketing in two directions at once: faster execution and tougher differentiation. Teams are shipping more content variants with less effort, but average output is getting commoditized, so the bar for originality keeps rising.\n\nDay-to-day, the biggest shifts we're seeing: more zero-click/AI summary behavior, heavier reliance on automation in ads, more importance on brand signals and third-party mentions. \n\nTools are adapting too - you’re not just tracking rankings or CTR, you’re tracking where you show up inside AI answers and what sources influence them.\n\nAI makes production cheaper, but strategy and differentiation matter more than ever.",
          "score": 3,
          "created_utc": "2026-02-09 10:26:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ks9k5",
              "author": "Unable-Connection-58",
              "text": "**Exactly.**",
              "score": 1,
              "created_utc": "2026-02-10 07:17:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4elk4r",
          "author": "PsychologicalBar6669",
          "text": "It's definitely a huge shift! I've noticed a big push towards ensuring content is discoverable not just by traditional search engines, but also by AI models. Keeping content optimized for both has become key. For me, focusing on clear, structured information that AI can easily parse has made a difference. It’s about being prepared for how AI is changing the way users find information.",
          "score": 2,
          "created_utc": "2026-02-09 09:06:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ksbfm",
              "author": "Unable-Connection-58",
              "text": "Spot on.",
              "score": 1,
              "created_utc": "2026-02-10 07:17:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4erayu",
          "author": "bubble-gum-doll",
          "text": "For me, AI has sped things up but hasn’t replaced strategic thinking. Research, campaign structure, and strong messaging still come from humans, AI just helps with execution.",
          "score": 2,
          "created_utc": "2026-02-09 10:03:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ksczi",
              "author": "Unable-Connection-58",
              "text": "Agreed.",
              "score": 1,
              "created_utc": "2026-02-10 07:18:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4etyfs",
          "author": "Mike_Scalpers",
          "text": "The main change I think is that we get answers from AI overviews. The main challange now it to be cited.",
          "score": 2,
          "created_utc": "2026-02-09 10:29:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kselb",
              "author": "Unable-Connection-58",
              "text": "True.",
              "score": 1,
              "created_utc": "2026-02-10 07:18:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4f9s0y",
          "author": "Zealousideal-Lie-609",
          "text": "New set of tools create a new standard in every stage of the process, the bar it's just rasing higher and higher for what a brand needs to deliver in order to stand out.",
          "score": 2,
          "created_utc": "2026-02-09 12:41:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ksgek",
              "author": "Unable-Connection-58",
              "text": "Exactly.",
              "score": 1,
              "created_utc": "2026-02-10 07:18:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4fzawe",
          "author": "Content_Most2673",
          "text": "Discoverability for sure. The impact AI has had on my website's search traffic over the past year is crazy. ",
          "score": 2,
          "created_utc": "2026-02-09 15:11:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ksi3k",
              "author": "Unable-Connection-58",
              "text": "Wild.",
              "score": 1,
              "created_utc": "2026-02-10 07:19:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4kn5yn",
          "author": "Key_Salamander_7733",
          "text": "AI is speeding everything up and raising the bar.\n\nMore content gets made, so quality, intent, and real expertise matter more than ever. Marketers are using AI for research, drafts, and testing but success still comes from strategy and human insight, not just tools.",
          "score": 2,
          "created_utc": "2026-02-10 06:31:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ksk2h",
              "author": "Unable-Connection-58",
              "text": "Facts.",
              "score": 1,
              "created_utc": "2026-02-10 07:19:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4naq0g",
          "author": "Delicious_Peanut_645",
          "text": "Honestly it is killing digital marketing",
          "score": 2,
          "created_utc": "2026-02-10 17:18:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4rgk0p",
              "author": "Unable-Connection-58",
              "text": "**Debatable.**",
              "score": 1,
              "created_utc": "2026-02-11 07:33:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4qmjqk",
          "author": "admatic-anz",
          "text": "Along with everything else, AI is also affecting the media side of the equation significantly. In our experience, we believe that it is supplementing, evolving and complimenting digital marketing rather than diminishing it.\n\n\n\nFrom a planning perspective, human value now shifts towards the strategic value generation where human expertise is expected to apply the guard rails and guidance to the learning that AI platforms are expected to make. This means that we get to move away from execution heavy tasks to more deliberate strategic thinking.\n\n  \nFrom a tools standpoint, AI has long since been used to power up marketing used to optimize based on past behavior (retargeting, lookalikes, demographics) towards intent prediction. And as a practice, this is only expected to grow with more and more optimisations leaning on predictive capabilities and therefore happening in real time with less data required than historically possible.\n\n  \nLastly, from a day to day perspective, we know the efficiency impact of AI on workflows, as tools get more robust, this can only improve further.\n\n  \n",
          "score": 2,
          "created_utc": "2026-02-11 03:38:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4rgmfo",
              "author": "Unable-Connection-58",
              "text": "**Well articulated.**",
              "score": 1,
              "created_utc": "2026-02-11 07:34:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qz8kan",
      "title": "I knew of a website that would show you the best times to post on each subreddit, does anyone remember it? Thanks!",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qz8kan/i_knew_of_a_website_that_would_show_you_the_best/",
      "author": "Goddess_Rose_5",
      "created_utc": "2026-02-08 13:12:09",
      "score": 8,
      "num_comments": 6,
      "upvote_ratio": 0.9,
      "text": "thank you!",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qz8kan/i_knew_of_a_website_that_would_show_you_the_best/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o48wfqp",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-08 13:12:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48xspy",
          "author": "delta_echo_007",
          "text": "i also saw it somewhere, i just can't remember its name",
          "score": 1,
          "created_utc": "2026-02-08 13:21:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4b5zkd",
          "author": "usamaejazch",
          "text": "I actually built a mini tool for me that gives me subreddit \"insights\"",
          "score": 1,
          "created_utc": "2026-02-08 20:08:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4bddlp",
          "author": "aiWorkFlowHub",
          "text": "Whats it called",
          "score": 1,
          "created_utc": "2026-02-08 20:46:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4df6w5",
          "author": "HarjjotSinghh",
          "text": "that thing was called posttime? hope your ads perform better now.",
          "score": 1,
          "created_utc": "2026-02-09 03:25:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4dpav8",
              "author": "Goddess_Rose_5",
              "text": "no",
              "score": 1,
              "created_utc": "2026-02-09 04:29:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qysugb",
      "title": "AI companions are quietly becoming their own set of niches",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qysugb/ai_companions_are_quietly_becoming_their_own_set/",
      "author": "BowlerEast9552",
      "created_utc": "2026-02-07 23:27:08",
      "score": 8,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,\n\nI track software demand keywords as a side project. One that's caught my eye recently is \"ai companions\" - 40,500 searches a month. Sounds like a massive keyword to target, but it's actually people looking for loads of different types of companion:\n\nAI gaming companion - 480 searches last month, 23 months of consecutive year-over-year growth.\n\nAI companion for seniors - 320/mo, 25 months of growth.\n\nAI study companion - 390/mo.\n\nAI mental health companion - 90/mo, 16 months of growth.\n\nAI interview companion, ai fitness companion, ai writing companion - all being searched for separately.\n\n\"AI companion platform\" averages 6,600/mo but just spiked to 40,500 in its latest month.\n\nSomeone searching \"ai gaming companion\" and someone searching \"ai companion for seniors\" are completely different people with completely different intent. The parent keyword looks huge but the audience behind it is fragmented.\n\n\"AI desktop companion\" is another interesting one from a search perspective. 0 monthly searches through all of 2022. Around 110/mo by mid-2024. Then 1,900 in November 2025, sitting at 720/mo now. Every month has beaten the same month the year before for 34 months straight. That kind of consistent year-over-year growth usually means the demand is real rather than a trend spike.\n\nAnthropic and OpenAI have both launched desktop companion features in the last few months. Replika is the biggest name in the companion space but they're dealing with regulatory problems. OpenClaw went viral last month as an open-source alternative. The space is moving fast but nobody really dominates any single niche yet.\n\nFrom a marketing perspective I think the opportunity is in the long-tail keywords rather than the parent term. The competition index on \"ai desktop companion\" is 73 but the CPC is only $0.87. Most of these niche companion terms have low CPCs relative to the growth they're showing. If you're doing content or SEO in the AI space these are worth watching.\n\nCheers - Alec",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qysugb/ai_companions_are_quietly_becoming_their_own_set/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o45x4cz",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 23:27:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47l5pv",
          "author": "barbiegirlreturns",
          "text": "What keywords are searched related to ai agent, automation for small businesses. I checked but I can’t find anything relevant to small business to grow, save time and money. I am looking for real problem solving that people need now",
          "score": 1,
          "created_utc": "2026-02-08 06:09:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o48aqmy",
              "author": "BowlerEast9552",
              "text": "I think there's a fair few around small business etc. Shoot me a message and I'll set up a saved search with them so you can have a look at them further (no catch - promise haha). ",
              "score": 1,
              "created_utc": "2026-02-08 10:06:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qy7nqa",
      "title": "How are you approaching monetization for content driven sites in 2025?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qy7nqa/how_are_you_approaching_monetization_for_content/",
      "author": "Udont_knowme00",
      "created_utc": "2026-02-07 07:35:42",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 0.9,
      "text": "With privacy changes and traffic becoming more fragmented, monetizing content sites feels a lot less straightforward than it used to. A lot of older playbooks still assume clean attribution and predictable CPMs, which does not always match reality anymore.\n\nI have been seeing more teams experiment instead of relying on a single setup, especially on content driven or mixed intent traffic. It feels like monetization today is more about stability and testing than squeezing out peak performance.\n\nCurious how others here are thinking about monetization strategy right now and what has actually been working in practice",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qy7nqa/how_are_you_approaching_monetization_for_content/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o41ntgv",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 07:35:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41qpr8",
          "author": "Cocoatech0",
          "text": "Diversification helped us a lot. We tested different ad networks alongside affiliates and focused on what behaved consistently month to month. Monetag was one of the options that surprised me in terms of predictability.",
          "score": 5,
          "created_utc": "2026-02-07 08:03:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41q60b",
          "author": "pra__bhu",
          "text": "the clean attribution era is basically over and i think a lot of content teams are still running playbooks from 2020 that assumed you could track everything neatly.\nwhat i’m seeing work from the ad side: teams that treat monetization as a portfolio problem rather than trying to find one perfect setup. meaning you run programmatic display for baseline revenue, layer in direct sponsor deals for premium pages, and experiment with affiliate or lead gen on high-intent content. none of them individually are amazing but together they create stability.\nthe biggest shift i’ve noticed is that cpms are way more volatile than they used to be, especially on content-driven traffic where user intent is ambiguous. google’s privacy sandbox changes and the ongoing third-party cookie deprecation are making programmatic less predictable. so the teams doing well are the ones that own their audience relationship - email lists, push notifications, community - because that first-party data is what lets you command better rates from advertisers.\nalso worth looking at the content itself differently. instead of optimizing for pageviews and hoping cpms hold up, some publishers are moving toward fewer but higher-intent pieces that convert better for affiliate or lead gen. less traffic but way better revenue per session.\nwhat kind of content are you working with? the strategy looks pretty different for news vs evergreen vs niche authority sites.",
          "score": 1,
          "created_utc": "2026-02-07 07:57:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o426tuo",
          "author": "Relevant_Morning_213",
          "text": "On some smaller publisher projects we stopped relying on one provider and tested alternatives in parallel. Monetag ended up being more stable than expected for mixed GEO traffic so we kept it in the stack.",
          "score": 1,
          "created_utc": "2026-02-07 10:41:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4294lx",
          "author": "Adventurous-Lake1857",
          "text": "A lot of people still chase perfect CPMs when consistency is probably more important. From a planning standpoint predictable revenue is easier to work with than spikes.",
          "score": 1,
          "created_utc": "2026-02-07 11:03:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43bsak",
          "author": "Comfortable-Ask6893",
          "text": "Diversification is key honestly. Weve seen better stability by mixing ad networks with native ads and sponsored content. Its about finding whats consistent rather than chasing the highest CPMs that might not stick around.",
          "score": 1,
          "created_utc": "2026-02-07 15:22:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxco4c",
      "title": "Need advice - how to market this idea?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qxco4c/need_advice_how_to_market_this_idea/",
      "author": "OkMap12",
      "created_utc": "2026-02-06 08:59:50",
      "score": 7,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I need some advice on how to market a free Web App that I am currently building.\n\nThe app is within the personal finance niche - its going to be free with people able to support (otherwise I cannot cover the running costs).\n\nSo yeah that being said I really have no fancy branding, budget or anything like that. Just created something that works for me and want some ideas on how to share it with the world...where better to start than asking reddit?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qxco4c/need_advice_how_to_market_this_idea/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3ved6a",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 08:59:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vgcsn",
          "author": "pra__bhu",
          "text": "honestly the best marketing with zero budget is just being active where your users already hang out. for personal finance stuff that’s places like r/personalfinance, r/ynab, r/frugal, maybe even tiktok/youtube if you’re up for it.\nbut don’t just drop links - nobody wants that. share the thinking behind why you built it. what problem were you solving for yourself? post about that journey and let the app be the natural answer. people connect way more with “i was frustrated with X so i built this thing” than “check out my app.”\na couple things that worked for me when i was figuring this out for my own side project:\n\t∙\tfind threads where people are complaining about the exact problem you solve, and genuinely help them. mention your tool only if it’s actually relevant\n\t∙\twrite a solid launch post for r/SideProject when you’re ready - be honest about what it does and doesn’t do\n\t∙\tif you can swing a simple landing page with an email signup, do that before launch so you’re not starting from zero on day one\nthe “free with support” model is tough though ngl. you might want to think about what a lightweight paid tier could look like eventually, even if it’s just $3/mo for extra features. gives you something sustainable without feeling like you’re nickel and diming people.\nwhat’s the app actually do? happy to give more specific ideas if you share a bit more",
          "score": 2,
          "created_utc": "2026-02-06 09:19:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vgr86",
              "author": "OkMap12",
              "text": "Thank you for this ideas, I was exactly hoping for something like this. The 3$ mo for extra features, worries me regarding the regulations (VAT), so currently I am thinking to simply sticking with buy me a coffee or something as that might be simpler in the beginning. Not so sure how to approach this - but this is one of those things I will need to cross in due time.\n\nStill a lengthy road ahead",
              "score": 1,
              "created_utc": "2026-02-06 09:23:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vh4c8",
          "author": "Responsible_Brief637",
          "text": "(YT) Content Marketing and Reddit Communities as well as seo/geo optimization of your website",
          "score": 1,
          "created_utc": "2026-02-06 09:26:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxmm3x",
      "title": "I cleaned up a 40,000-contact CRM and found out why their sales team hated it",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qxmm3x/i_cleaned_up_a_40000contact_crm_and_found_out_why/",
      "author": "BathDapper4923",
      "created_utc": "2026-02-06 16:40:01",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 0.82,
      "text": "A few weeks ago I helped a small B2B company clean their CRM.\n\nWhat I found was… brutal.\n\n• 38% duplicate contacts\n\n• Leads with no owner\n\n• Deals stuck in “follow-up” from 2021\n\n• Automations firing twice (and sometimes not at all)\n\n• Sales reps logging notes in 3 different places\n\nThe founder thought the problem was “sales discipline.”\n\nIt wasn’t.\n\nIt was the CRM.\n\nAfter cleanup:\n\n– Removed \\~15k useless contacts\n\n– Merged duplicates\n\n– Rebuilt pipelines\n\n– Fixed broken automations\n\n– Created simple rules so the mess doesn’t come back\n\nResult:\n\nSales team actually started using the CRM again.\n\nFollow-ups stopped falling through the cracks.\n\nFounder finally trusted the numbers.\n\nI’m noticing this is insanely common—especially for companies that:\n\n• Switched CRMs\n\n• Ran ads without proper setup\n\n• Let multiple people “customize” things\n\n• Haven’t touched the system in years\n\nIf your CRM feels heavy instead of helpful, that’s usually the reason.\n\nI’m not selling anything here, just curious:\n\nWhat’s the most frustrating thing about your CRM right now?\n\n(If you want a second pair of eyes on it, happy to give quick feedback in DMs.)",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qxmm3x/i_cleaned_up_a_40000contact_crm_and_found_out_why/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3xen9q",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 16:40:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xsvb7",
          "author": "Bluestripedshirt",
          "text": "From what CRM to what CRM?",
          "score": 1,
          "created_utc": "2026-02-06 17:47:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o40xb6n",
              "author": "BathDapper4923",
              "text": "I clean the cvs file removing duplicates etc",
              "score": 0,
              "created_utc": "2026-02-07 04:00:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o420v46",
          "author": "Aggravating-Key6628",
          "text": "The duplicate problem you hit is usually a data governance issue, not a discipline issue. When you don't have strict rules for how contacts enter the system (form submissions, manual entry, API imports), you end up with three versions of the same person. We fixed this at a past client by creating a single intake point with deduplication logic that checked email + domain before creating new records. Cut our duplicate rate from 40% to under 5% in six months. The other thing that helped was setting field-level permissions so reps couldn't customize the schema on their own. Data debt compounds fast when everyone treats the CRM like their personal notepad.",
          "score": 1,
          "created_utc": "2026-02-07 09:42:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o420yst",
              "author": "BathDapper4923",
              "text": "How did you do it can you explain",
              "score": 1,
              "created_utc": "2026-02-07 09:43:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o424tya",
          "author": "HowdyGrowthHack",
          "text": "Usually it’s not anything fancy. Duplicates pile up because leads come in from everywhere with no rules. What’s worked for teams I’ve seen is just one entry point for new contacts, basic email/domain checks, and locking down who can add fields. Cleanup is mostly boring stuff too — merge dupes, assign owners, close ancient deals, simplify stages. Doesn’t really matter if it’s HubSpot, Zoho, Salesforce, RealTech CRM, High Level CRM, Attio, etc they all get messy if nobody sets guardrails. Once that’s done, people stop fighting the CRM and actually use it.",
          "score": 1,
          "created_utc": "2026-02-07 10:21:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42mhof",
              "author": "BathDapper4923",
              "text": "I solve this problem but tell me how do I get clients of of Reddit?",
              "score": 1,
              "created_utc": "2026-02-07 12:55:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r2mvay",
      "title": "Anyone else drowning in content tools? (Jasper, HubSpot, etc.)",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r2mvay/anyone_else_drowning_in_content_tools_jasper/",
      "author": "Otherwise_Economy576",
      "created_utc": "2026-02-12 07:11:44",
      "score": 7,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "I’ve been using \\[Jasper / HubSpot / Copy.ai\\] for a year and I barely touch half the features. I really just need: plan topics → research → write → post → see what worked.\n\nHas anyone found something that does that without the “marketing cloud” bloat and $100+/month? Or are you all just stacking 5 different tools and making peace with it?\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r2mvay/anyone_else_drowning_in_content_tools_jasper/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4xyyky",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-12 07:11:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ye0ga",
          "author": "anajli01",
          "text": "You’re not alone — most people barely use half of Jasper/HubSpot.\n\nIf you just need plan → research → write → post → track, a lean stack works better:\n\n* Planning: Google Trends\n* Research/Writing: ChatGPT or Perplexity\n* Publish: WordPress/Ghost\n* Track: GA + Search Console\n\nBig suites are for teams. Most solo creators just stack a few simple tools and skip the $100+ bloat.",
          "score": 3,
          "created_utc": "2026-02-12 09:38:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ysdco",
              "author": "Otherwise_Economy576",
              "text": "That's what I have been hearing from others also.",
              "score": 1,
              "created_utc": "2026-02-12 11:49:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ypnb6",
          "author": "MarcoMusings",
          "text": "We use Monday for most of our workload planning as that does most of what you describe. Just need a list of whose doing what, when, and where. The actual writing aspect is done by people in our company.",
          "score": 2,
          "created_utc": "2026-02-12 11:26:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ysbx4",
              "author": "Otherwise_Economy576",
              "text": "That's a nice way of doing things with human in loop. Would it help if the frist drafts were already ready for people to build upon?",
              "score": 1,
              "created_utc": "2026-02-12 11:48:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4z9dhn",
                  "author": "MarcoMusings",
                  "text": "I have extremely talented writers who specialise in technical subjects - it’s faster and more effective with them writing from scratch. Has far more emotion baked in too.",
                  "score": 1,
                  "created_utc": "2026-02-12 13:42:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4yr5vp",
          "author": "Aggravating-Key6628",
          "text": "Had the exact same realization. Was paying for a full marketing suite and using maybe 15 percent of it. The plan-research-write-post-measure loop you described is really all most small teams need.\n\nWhat I ended up doing: research and writing goes through one AI subscription (Claude, ChatGPT, whatever you prefer). Scheduling goes through a simple scheduler or even native platform scheduling. Analytics lives in a basic dashboard or spreadsheet tracking what performed.\n\nTotal cost went from $100+ per month down to about $20-30, and the workflow is actually faster because there is less UI to navigate between steps.\n\nThe real insight is that the all-in-one tools are optimized for teams of 10+ where handoffs between people matter. For a solo operator or a small team, the overhead of learning and maintaining a complex platform outweighs the convenience of having everything in one place. Stack two or three simple tools and move on.",
          "score": 2,
          "created_utc": "2026-02-12 11:39:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4yrf94",
              "author": "Otherwise_Economy576",
              "text": "Makes sense. All in one tools being optimised for larger teams is the takeaway for me here",
              "score": 1,
              "created_utc": "2026-02-12 11:41:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4yu4j0",
          "author": "ArmOk3290",
          "text": "The marketing cloud tools are built for teams with dedicated specialists, not solo operators who just need to publish consistently. What works for most people is a stripped-down stack with AI for drafting, native scheduling tools, and basic performance tracking. The savings add up quickly when you avoid platforms that charge for features you will never touch.\n\n  \n",
          "score": 2,
          "created_utc": "2026-02-12 12:02:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ywz7r",
              "author": "Otherwise_Economy576",
              "text": "Yup. This! That's why I am building on in house. For exactly this",
              "score": 1,
              "created_utc": "2026-02-12 12:23:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o50wpo2",
          "author": "Yapiee_App",
          "text": "You’re not alone. Most of us use 20% of the tools we pay for. Simpler workflow > bigger stack",
          "score": 2,
          "created_utc": "2026-02-12 18:30:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50o6fr",
          "author": "Confident-Tank-899",
          "text": "The problem with the big marketing clouds is they're built for huge orgs with departments. A solo person or small team doesn't need 80 features, you need 3-4 that are great.\n\n\n\nThe better approach: Start with what you actually use then add one tool at a time when it saves more time than it costs.\n\n\n\nMy current stack:\n\n\\- Google Sheets + Zapier for workflow automation (costs almost nothing, does 80% of what people pay $300/mo for)\n\n\\- ChatGPT API for drafts\n\n\\- WordPress + Elementor for publishing\n\n\\- Google Analytics + Search Console\n\n\n\nThat's genuinely it. The tools don't matter as much as having a system. If you spend 20 minutes deciding which AI writing tool to use instead of actually writing, you've lost.\n\n\n\nHubSpot makes sense if you're managing a sales team. Jasper makes sense if you're doing volumes of content. But if you're one person? You're paying for complexity you'll never use. Don't let FOMO drive tool decisions.",
          "score": 1,
          "created_utc": "2026-02-12 17:51:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o518yoq",
          "author": "AndyIsNotKuhl",
          "text": "The stack you described plan - research - write - post - review is conceptually simple, but most of the big tools bundle a ton of stuff that feels useful in marketing decks and useless in day t day work.\n\nWhat helped me was:\n\n* Separating decision flow from feature list most tools can do something in each stage, but the real time suck is moving context between them. If you spend more time exporting/importing than thinking, it’s not simplifying anything.\n* Defining “done” for each stage this was the game changer. When a topic hits ready for draft, what inputs are really required? When something goes live, what one metric actually matters? Once you define those, half the features in most clouds become noise.\n\nFor us, that looked like:\n\n* lighter planning in something simple calendar + shared doc\n* research either manual or scoped to what matters for that topic\n* writing in the simplest editor that gets version history\n* posting via scheduler\n* a quick post-mortem list what worked, what didn’t\n\nIn one project we also tested visibility layers like SyndrAI not because it replaced tools, but because it made clear what wasn’t being tracked. That clarity alone cut down how much we felt like we needed the next thing.\n\n",
          "score": 1,
          "created_utc": "2026-02-12 19:28:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}