{
  "metadata": {
    "last_updated": "2026-01-27 02:39:57",
    "time_filter": "week",
    "subreddit": "digital_marketing",
    "total_items": 20,
    "total_comments": 167,
    "file_size_bytes": 168151
  },
  "items": [
    {
      "id": "1qhuzlh",
      "title": "What marketing automation actually blew your mind away?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qhuzlh/what_marketing_automation_actually_blew_your_mind/",
      "author": "Vivid-Aide158",
      "created_utc": "2026-01-20 07:50:20",
      "score": 355,
      "num_comments": 56,
      "upvote_ratio": 0.99,
      "text": "Hi all- with all the changes with AI and LLMs, I have been seeing a lot of really cool marketing automation use cases recently but haven't had time to actually look into it.\n\nSo for the ones who have actually tried a bunch, curious, what marketing automation actually blew your mind away?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qhuzlh/what_marketing_automation_actually_blew_your_mind/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0mqgbg",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 07:50:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0svkzt",
          "author": "KONPARE",
          "text": "To be honest, the ones that impressed me were little automations that eliminated bothersome gaps rather than ostentatious \"AI does everything\" setups.  \n  \nOne that truly stuck was lead → CRM → personalized follow-up, where the message wasn't just \"Hi {{first\\_name}},\" but actually mentioned what the person did (page visited, form field, question asked). Conversions increased, I felt human, and I saved hours.  \n  \nAnother was post-call automation, which involves summarizing the meeting's notes, creating next steps, drafting a follow-up, and automatically updating the CRM. \"I'll log this later\" is no longer an option (which never happens).  \n  \nThe most important lesson I learned is that the amazing stuff isn't magic; rather, it's when automation subtly eliminates friction that you weren't aware was wearing you out on a daily basis.",
          "score": 3,
          "created_utc": "2026-01-21 04:46:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tf3ob",
              "author": "iGrowJazzCigarettes",
              "text": "That makes sense. Can klaviyo do that? Or is that another SaaS?",
              "score": 1,
              "created_utc": "2026-01-21 07:21:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o10swoa",
              "author": "snehavg5",
              "text": "Could you share more about this? Interested for my company.",
              "score": 1,
              "created_utc": "2026-01-22 10:09:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1v7ze2",
              "author": "Glad_Morning_6256",
              "text": "You might like to check out Robotic Marketer automation features if these things are of value.",
              "score": 1,
              "created_utc": "2026-01-26 18:37:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0mu8vm",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 14,
          "created_utc": "2026-01-20 08:25:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n9cqc",
              "author": "gdpowers1",
              "text": "What tools did you use to do this?",
              "score": 3,
              "created_utc": "2026-01-20 10:46:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0noctw",
              "author": "Ok_Reindeer_7955",
              "text": "which tool?",
              "score": 1,
              "created_utc": "2026-01-20 12:43:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ob955",
          "author": "No-Marionberry8257",
          "text": "Well automation of social media posts for us has been huge! We have used AI tools like F-rizerly to automate the process of coming up of a content strategy using our Google search data. This is then used to automatically publish a blog on our website every day using our internal data like customer testimonials, case studies etc. The content is then repurposed into social media posts and posted automatically as well! On Mondays, the agent is also able to come up with a complete instagram post that includes an images featuring our products and post it automatically! Most of these are educational posts around our products, so its quiet useful and doesn't feel spammy!",
          "score": 19,
          "created_utc": "2026-01-20 14:51:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0rhnx5",
              "author": "champagne-hypnosis",
              "text": "Hmmm",
              "score": -3,
              "created_utc": "2026-01-20 23:54:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0w60ic",
                  "author": "Saidhain",
                  "text": "Hmm indeed. It was both accounts specifically mentioning Monday that ‘hmm’d’ me.",
                  "score": 4,
                  "created_utc": "2026-01-21 17:48:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0u0wna",
              "author": "Empty_Chart4083",
              "text": "that whole “content strategy from Google data + automatic daily blog + social repurposing” thing is wild, like it basically runs itself. The fact it can also generate and post full Instagram posts with product images on Mondays is straight-up next level.",
              "score": -1,
              "created_utc": "2026-01-21 10:46:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0vtb4p",
          "author": "mediaBOOM",
          "text": "Well honestly, the chatbot automation does really well, especially saving time on customer queries. Sometimes it even closes a deal on its own, which still blows my mind.",
          "score": 2,
          "created_utc": "2026-01-21 16:51:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nhera",
          "author": "kubrador",
          "text": "honestly the most mind-blowing thing was realizing how much time people waste setting up automations that could've just been a scheduled email. watched a guy spend 3 weeks building a \"dynamic workflow\" that sent the same message to everyone anyway.",
          "score": 4,
          "created_utc": "2026-01-20 11:53:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n7imj",
          "author": "Mike_Scalpers",
          "text": "For me it's AI mention tracking. Instead of just checking Google rankings,you can ask AI if it knows your brand. If the AI doesn't mention you, the tool shows you exactly what to publish so the AI starts recommending you.",
          "score": 2,
          "created_utc": "2026-01-20 10:29:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n8upw",
          "author": "GrouchyGovernment784",
          "text": "Keyword clustering, internal link suggestions, and competitor alerts simple automations that save hours and surface wins you would otherwise miss.",
          "score": -5,
          "created_utc": "2026-01-20 10:41:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0t7u9i",
              "author": "ArtGullible1312",
              "text": "For real, keyword clustering alone is great because manually grouping that stuff used to take forever and you'd still miss obvious connections. The internal linking suggestions are clutch too, especially when you've got hundreds of pages and no clue what's orphaned or underleveraged.",
              "score": 1,
              "created_utc": "2026-01-21 06:18:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0nhfhh",
          "author": "Upbeat-Gazelle2007",
          "text": "which AI are you all using?",
          "score": 1,
          "created_utc": "2026-01-20 11:53:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p6uo7",
          "author": "ArcIntermedia",
          "text": "It sounds so simple and of course it's been around for years, but keyword match types in search advertising have come SUCH a long way from the days of thousands of keywords in every tense, spelling, spacing, etc. Also manually setting a bid for every - single - one. Distant but painful memories...",
          "score": 1,
          "created_utc": "2026-01-20 17:21:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0w9wlq",
          "author": "AmphibianNo9959",
          "text": "Honestly, what surprised me most was **Leadmatically.** It's an AI tool that scans Reddit leads for your businesses and also provide AI generated replies that you could modify with AI prompting",
          "score": 1,
          "created_utc": "2026-01-21 18:05:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zogad",
          "author": "addllyAI",
          "text": "It really hits when an automation just slides into the team’s normal workflow and quietly does its job without anyone having to constantly check or fix it.",
          "score": 1,
          "created_utc": "2026-01-22 04:29:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o107u56",
          "author": "New_Appearance2669",
          "text": "still need human mostly",
          "score": 1,
          "created_utc": "2026-01-22 06:55:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11305s",
          "author": "United_Broccoli_4032",
          "text": "What really blew me away was seeing a system that doesn’t just set and forget but actually studies your business and runs Meta ads that test and scale themselves. No more guessing which creative or audience works best-this kind of automation pulls fresh creatives daily and shifts budget toward top performers on its own. It’s like having a smart assistant that’s constantly optimizing to pump up ROAS without you needing to babysit campaigns. The way it cuts down the busywork and drives sales while staying super hands-off is next-level compared to the usual clunky automation tools out there.",
          "score": 1,
          "created_utc": "2026-01-22 11:36:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1i7x9c",
              "author": "LawfulnessEarly1502",
              "text": "what’s this system / app called? Sounds really nice!",
              "score": 1,
              "created_utc": "2026-01-24 22:00:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1n036p",
                  "author": "United_Broccoli_4032",
                  "text": "It's called Didoo AI, worth a shot.",
                  "score": 1,
                  "created_utc": "2026-01-25 16:09:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11cvi4",
          "author": "Single-Use1800",
          "text": "The thing that really blew me away was seeing a marketing automation setup that tracks user behavior in real time, segments audiences, and sends personalized follow-ups automatically. It’s like having a whole team working 24/7, but smarter and faster. Watching it in action really makes you realize how much time it saves and how personal it can feel to each customer. Truly a game-changer.",
          "score": 1,
          "created_utc": "2026-01-22 12:46:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o122cuk",
          "author": "Mobile-Ambition-3714",
          "text": "I tried out this AI-powered ad creative generator that not only writes copy but also suggests images and headlines based on previous top-performing campaigns. I just plug in my product info and it spits out stuff that’s 80% ready to go. Kind of creepy in a useful way.",
          "score": 1,
          "created_utc": "2026-01-22 15:03:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12jp9n",
          "author": "LVSMarketing",
          "text": "The thing that still surprises me is how powerful, simple abandoned cart + browse abandonment flows can be when they're done with intention instead of blasting everyone. We had one client where adding real personalization (like referencing the exact product they looked at) turned okay results into something way better. Felt less like automation and more like thoughtful conversation. It's not flashy but the consistency pays off big time. What's been your biggest win lately?",
          "score": 1,
          "created_utc": "2026-01-22 16:24:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12k09v",
          "author": "murtuza78",
          "text": "We used to spend hours writing up newsletter copy and segmenting our customers. Now we’ve got an AI tool that analyzes open and click rates, then automatically creates custom newsletters for each segment based on their prior behavior. It takes like 10 minutes to review and approve. Not mind blowing on paper, but seeing how much engagement jumped was a big eye opener.",
          "score": 1,
          "created_utc": "2026-01-22 16:25:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o15uzg2",
              "author": "mchanel",
              "text": "Which ai tool is that??",
              "score": 1,
              "created_utc": "2026-01-23 02:05:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o16cmre",
          "author": "Confident-Belt-198",
          "text": "I did one pseo automation, which daily automatically post trending content, and it's blowing my mind as I'm getting traffic from ai search too, bing was first, most of AI search scape bing first, so ranking on bing, ranking on ai search",
          "score": 1,
          "created_utc": "2026-01-23 03:44:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1agy6y",
          "author": "Tight_Tree8390",
          "text": "Social media posts, blog content, even spotting collab opportunities in my niche and pulling leads, all automated. It might sound basic, but it removed a ton of manual work and actually freed up time to focus on strategy instead of manual tasks",
          "score": 1,
          "created_utc": "2026-01-23 19:10:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0po6dq",
          "author": "Ok_Passion_5054",
          "text": "Could someone list out the AI tools they’ve been using for marketing automation? Trying to conduct a competitive analysis for ai automation tools across the board. Thanks",
          "score": 1,
          "created_utc": "2026-01-20 18:40:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tknlh",
              "author": "Background_Item_9942",
              "text": "Perplexity works really good with search engine and combines really good AI tools for other uses. I use it for research mainly when i need to fact check because it pulls from multiple sources you can access through link",
              "score": 0,
              "created_utc": "2026-01-21 08:12:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0mt25c",
          "author": "ChestChance6126",
          "text": "For me, it was less about flashy AI tricks and more about shrinking the feedback loop. Stuff like ad spend, landing page behavior, and email responses all flow into one place, so I could see within a day or two if an idea was worth keeping alive. AI helped most as a drafting layer, first pass copy, basic flows, subject line variants, not as some autopilot. The “wow” moment was realizing how much busywork disappeared when the system handled the boring glue automatically. When setup drops from days to hours, you end up testing way more ideas. That shift alone changed how I think about experimentation.",
          "score": 0,
          "created_utc": "2026-01-20 08:14:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0muhlc",
          "author": "Fun_Fly_1310",
          "text": "We had this feature at Alibaba to create what we called a MLP (marketing landing page). \n\nYou can choose to either route customer to a certain product, category or landing page or send customer to MLP. This MLP was an AI generated landing page that was made up of customer's previous purchases, interactions, page views to come up with assortment of similar items. \n\nThe MLP would outperform regular landing pages by more than 300 to 500% at every level of testing imaginable.",
          "score": 0,
          "created_utc": "2026-01-20 08:27:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n428o",
          "author": "Tsundere5",
          "text": "When automation actually felt personal instead of spammy. Things like leads getting different journeys based on what they actually clicked/read (not just downloaded a PDF) or sales getting a clean, human ready summary instead of raw CRM noise. The mind blowing part wasn’t the AI hype, it was seeing it quietly save hours and make interactions feel more relevant instead of more automated",
          "score": 0,
          "created_utc": "2026-01-20 09:58:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nb5gx",
          "author": "Aunker",
          "text": "The stuff that actually feels wow isn’t writing posts, it’s automation that removes real bottlenecks. Things like auto-tagging leads based on behavior, sending the right follow-up sequence based on what someone clicked, and creating a weekly report that explains why numbers moved, not just what moved. Also using AI to turn call transcripts into objections you can fix in ads and landing pages is underrated. What part of your marketing takes the most manual time right now, reporting or lead follow-up?",
          "score": 0,
          "created_utc": "2026-01-20 11:02:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n1oyi",
          "author": "anajli01",
          "text": "One that really stood out for me was **intent-based automation tied to content + CRM** where user behavior (pages viewed, questions asked in chat, tools used) automatically shifts messaging, offers, and even sales follow-ups in real time.\n\nIt stopped feeling like “automation” and started feeling like **adaptive marketing**. Once you see that in action, basic drip sequences feel outdated fast.",
          "score": -1,
          "created_utc": "2026-01-20 09:35:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nnyhr",
          "author": "Reasonable-Sense-475",
          "text": "I have the same question wrt (1) rapid a/b testing with ads/landing pages (2) intent signal based demand gen (easiest way to find leads in the market in ICP). Wonder what others are seeing success with.",
          "score": 0,
          "created_utc": "2026-01-20 12:40:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n836t",
          "author": "TurnoverEmergency352",
          "text": "The biggest win for me was when lead scoring and nurturing started talking to each other properly. Instead of manually updating lists and segments, everything flows automatically based on actual behavior: what they clicked, how long they stayed, which emails they opened. Monday crm make this seamless for us with the automation recipes. The AI layer just handles the busy work while we focus on strategy. No more spreadsheet hell.",
          "score": -1,
          "created_utc": "2026-01-20 10:35:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj1qpn",
      "title": "Where’s the best site to buy Instagram followers?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qj1qpn/wheres_the_best_site_to_buy_instagram_followers/",
      "author": "PhontomDX",
      "created_utc": "2026-01-21 15:59:21",
      "score": 119,
      "num_comments": 52,
      "upvote_ratio": 0.92,
      "text": "It feels really hard to get a new page going when nobody wants to be the first one to follow. I have been thinking about if I should buy Instagram followers just so I look established enough that real people actually look at my content. I have checked a few sites that say they can help, but a lot of them look risky or like they just sell bots.\n\nDoes anyone know a safe way to do this without getting flagged? I’m looking for instant fame, just a small push so my page isn't sitting at zero. I want to find a service that helps with buying Instagram followers that act like real growth rather than random fake accounts.\n\nBefore I go ahead, I have a few specific worries I am hoping you guys can answer:\n\n* If I choose to buy followers on Instagram, is it going to look obvious to new visitors? I do not want to ruin my image before I even start.\n* Has anyone found a seller where the numbers are stable? I need to know how to get followers that actually stay and do not drop off after a few days.\n* Does having a higher count actually help convince real people to hit follow, or does it not make a difference?\n\nI am trying to figure out if this is the practical approach or if it is the wrong thing to do.\n\nI would love to hear from anyone who has tried something that actually worked to help a page grow safely and fast.\n\nAny suggestions are welcome and appreciated.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qj1qpn/wheres_the_best_site_to_buy_instagram_followers/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0vhrfj",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 15:59:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10i6ed",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 21,
          "created_utc": "2026-01-22 08:28:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10mxxk",
              "author": "PhontomDX",
              "text": "Damn that sounds like a nightmare scenario and exactly what I want to avoid, did you use a cheap site or one of the ones that claims to be high quality?",
              "score": 1,
              "created_utc": "2026-01-22 09:13:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0zo76m",
          "author": "Suspicious_Candy9048",
          "text": "Building a community from scratch is definitely tough when you look at that zero counter every day, it is tempting to take the shortcut but you have to consider that fake numbers usually kill your engagement rate which signals to the algorithm that your content is not worth pushing out to real people.\n\nIf you are just looking for social proof it might work for a second but most users can sniff out bot accounts pretty fast because they usually have weird usernames and no posts, I think you are better off grinding for those first 100 real people who actually care about what you are posting since they will stick around.",
          "score": 16,
          "created_utc": "2026-01-22 04:28:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zrjkh",
              "author": "chaipglu28",
              "text": "Yeah but let us be real bro nobody follows a page with 12 followers no matter how good the content is, you need that initial bump just to look alive.",
              "score": 1,
              "created_utc": "2026-01-22 04:50:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0zx6rb",
                  "author": "PhontomDX",
                  "text": "That is exactly what I am worried about since I feel like people click on my profile and leave immediately when they see the low number, I just want to look established enough to get a chance.",
                  "score": 2,
                  "created_utc": "2026-01-22 05:30:32",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1ego2y",
              "author": "Aggressive-Lab-3826",
              "text": "fair, and adding to what you said about socialplug.io, I noticed their delivery timing felt natural enough that it didn’t create those sudden spikes that usually tip off Instagram’s systems. it helped keep the follower count stable, which actually made it easier to build some genuine interactions afterward instead of having to constantly worry about fluctuations.",
              "score": -6,
              "created_utc": "2026-01-24 09:49:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1eon2s",
                  "author": "BornYak6073",
                  "text": "Ive used them as well actually lol, pretty OK stuff TBH",
                  "score": 1,
                  "created_utc": "2026-01-24 11:02:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o106wi8",
          "author": "Pretty-Material1424",
          "text": "i have seen people buy Instagram followers just to get the swipe up feature back in the day but now i think you just get shadowbanned so be careful.",
          "score": 11,
          "created_utc": "2026-01-22 06:47:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10dqnw",
              "author": "WhoAmI6589",
              "text": "Yup and once you get flagged it is nearly impossible to get your reach back to normal without starting a whole new account.",
              "score": 2,
              "created_utc": "2026-01-22 07:47:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o117wwy",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 12,
          "created_utc": "2026-01-22 12:12:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11cxxd",
              "author": "Ame_Kozui",
              "text": "Sure but OP specifically mentioned wanting real growth and not wanting to look obvious to new visitors.",
              "score": 1,
              "created_utc": "2026-01-22 12:46:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o11k1ms",
                  "author": "PhontomDX",
                  "text": "Yeah I definitely need the engagement to stay decent or at least not look dead, I guess I was hoping there was a middle ground where the accounts look real enough to fool people.",
                  "score": 1,
                  "created_utc": "2026-01-22 13:29:04",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0ztzcv",
          "author": "iabhishekpathak7",
          "text": "Do you actually have a plan for converting that fake traffic into real sales or engagement once the number goes up?",
          "score": 8,
          "created_utc": "2026-01-22 05:07:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zzgoc",
              "author": "PhontomDX",
              "text": "I am not selling anything yet I just want the page to look legitimate so real people feel comfortable following, I figure once I have the look down the real growth comes easier.",
              "score": 1,
              "created_utc": "2026-01-22 05:47:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10pudd",
          "author": "zer104104",
          "text": "There is a massive difference between bot farms and services that actually run engagement campaigns to attract users but the latter is very expensive and slow, most of the cheap sites use scripts to create thousands of accounts that eventually get purged by the platform during cleanup waves.\n\nIf you decide to buy followers on instagram you have to accept that your engagement rate will tank because those 1k or 5k accounts will never like or comment on your stuff, this tells the algorithm your content is boring and it stops showing your posts to the few real people you do have.\n\nThe only time I see this work is for pure vanity metrics where the user does not care about reach and just wants a high number to impress offline clients who do not check engagement ratios.",
          "score": 1,
          "created_utc": "2026-01-22 09:41:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10ug61",
              "author": "Wagyu_BeefA5",
              "text": "Not everyone cares about the algorithm though some people just need the social proof for a landing page or a business card basically.",
              "score": 1,
              "created_utc": "2026-01-22 10:23:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o119a7l",
          "author": "Ok-Concentrate8650",
          "text": "Everyone does it eventually if they want to compete in 2026 because the organic reach is dead anyway, you can go ahead and buy instagram followers if you want just do not go overboard and get 10k in one night or you will trigger the spam filters.",
          "score": 1,
          "created_utc": "2026-01-22 12:22:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1238ch",
          "author": "Born-Window5592",
          "text": "Authenticity is not dead it is just harder to fake now which is a good thing for people who actually put in the work.",
          "score": 1,
          "created_utc": "2026-01-22 15:07:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14wblx",
              "author": "Alinov--099",
              "text": "You can preach about hard work all you want but the system is rigged against new accounts man.",
              "score": 1,
              "created_utc": "2026-01-22 22:59:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o174qg3",
          "author": "ladyofmischief_riti",
          "text": "Don't do it man I lost my main account doing this and support will not even reply to my appeals.",
          "score": 1,
          "created_utc": "2026-01-23 07:03:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o180fi4",
              "author": "hey_moin_04",
              "text": "You probably used a sketchy site that asked for your login info which is the number one rule you do not break",
              "score": 1,
              "created_utc": "2026-01-23 11:45:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o178jnq",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-23 07:36:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1796p9",
              "author": "PhontomDX",
              "text": "Ads feel so expensive for what you get and I do not have a big budget to burn on testing right now, I just wanted a cheaper nudge.",
              "score": 1,
              "created_utc": "2026-01-23 07:42:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o18p0pt",
          "author": "Worried-Cook7169",
          "text": "I used a service last year to buy followers for a local event page and it worked fine because we just needed the number to look good for sponsors, as long as you are not expecting them to be your best friends and comment on everything it serves a specific purpose.",
          "score": 1,
          "created_utc": "2026-01-23 14:14:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18s98w",
              "author": "PhontomDX",
              "text": "That is good to hear actually, did the numbers stay stable or did you lose a bunch after a week?",
              "score": 1,
              "created_utc": "2026-01-23 14:31:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o199swo",
                  "author": "Far_Meet_9629",
                  "text": "They dropped a bit like maybe 10% but the service had a warranty to top them back up so it stayed pretty level.",
                  "score": 1,
                  "created_utc": "2026-01-23 15:55:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18vvnm",
          "author": "Ok-Concentrate8650",
          "text": "It is all vanity anyway just get the numbers so you look cool and worry about the rest later.",
          "score": 1,
          "created_utc": "2026-01-23 14:49:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19edny",
          "author": "ischanitee",
          "text": "Does anyone know if this affects your ability to get verified later on?",
          "score": 1,
          "created_utc": "2026-01-23 16:15:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1alfuj",
          "author": "PNW_Uncle_Iroh",
          "text": "There is no benefit to buying followers. Go get them organically. Your first 100 followers are the most important.",
          "score": 1,
          "created_utc": "2026-01-23 19:31:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1f5z6d",
          "author": "bluecollardad20",
          "text": "Just keep advertising. Do you need someone to do your marketing for you? I know a company",
          "score": 1,
          "created_utc": "2026-01-24 13:18:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gtapw",
          "author": "Redhedgehog1833",
          "text": "Dude just post a trial reel asking for people to follow you for this exact reason. You’ll get follows I promise.",
          "score": 1,
          "created_utc": "2026-01-24 18:10:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1i5w8d",
          "author": "demiphobia",
          "text": "Don’t.",
          "score": 1,
          "created_utc": "2026-01-24 21:50:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ve0aw",
          "author": "gt_roy_",
          "text": "I hit the same wall when my page sat at zero and nothing moved. Stillviral was what I used. Followers arrived over a few days instead of dumping all at once. They looked like real accounts and most stayed. And actually, really didn’t expect it to help me with my engagement to grow a bit, I’ve been hitting consistent numbers analytics wise, and I feel it. So just for you to take a look.",
          "score": 1,
          "created_utc": "2026-01-26 19:03:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vi606",
          "author": "Ok-Information1819",
          "text": "If you buy followers they will not engage and algorithm will feel that your content is not good enough as your followers are not engaging with it. So my advice dont do it. If you still want to then join some fb groups and tell them to follow. Some will do which can increase your followers",
          "score": 0,
          "created_utc": "2026-01-21 16:01:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0xe2xf",
              "author": "Positive_Goal_4538",
              "text": "following on from this, send the account to your family/ friends (if they know that’s your job), they’re more likely to actually engage with what you post, which should help get the ball rolling",
              "score": 1,
              "created_utc": "2026-01-21 21:04:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o146td1",
          "author": "Intelligent_Being870",
          "text": "If you’re gonna do it, avoid the instant 5k type drops, that’s what looks fake and gets people in trouble. Keep it small and gradual so it matches your posting and reach. I’ve had the best results with SocialDawn for that kind of slow social proof boost, the delivery looks more natural and the numbers were a lot more stable than the random sites I tried.",
          "score": 4,
          "created_utc": "2026-01-22 20:50:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0z04fb",
          "author": "CautiousRuin392",
          "text": "New visitors will notice new followers, especially since they're all going to be bot accounts. That's why buying followers is so cheap. You'd be better off running an ad. \n\nYes, having a 'higher' follower count can convince people to follow, but there's no general golden number. It's different between industry/content type. If you are posting consistently, engaging with other creators in your space/actual followers, and making reels - then you're on the right track. \n\nJust be patient and keep at it. Growing an account takes time.",
          "score": 0,
          "created_utc": "2026-01-22 02:05:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o115why",
          "author": "alvaroyal",
          "text": "So I would follow you for 5 euros.",
          "score": 0,
          "created_utc": "2026-01-22 11:58:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10lyb5",
          "author": "Legitimate-Hat-4333",
          "text": "Focus on posting stuff people actually want to see and engage with, and the real followers will come faster than any paid for ones.",
          "score": -1,
          "created_utc": "2026-01-22 09:03:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o180qfe",
          "author": "Longjumping_Leg3517",
          "text": "I was in the same spot when I started my first IG project and getting over that empty page phase is way harder than people admit. No one wants to be the first follower and when you don’t have numbers, even solid posts get ignored. I tried a couple of different sites but most of them just dumped random bots or weird-looking profiles that dropped off after a few days and made my account feel less trustworthy, not more. The only one that actually worked the way I wanted was Getiglikes. \n\nI used it for a small, gradual follower bump just enough so my profile didn’t look like a ghost town. The key for me was keeping the numbers realistic.  As for whether it makes a difference, honestly, yeah it helps. People are just more likely to follow a page that already looks alive. \n\nSo if you do go this route, stick with a slow, believable increase that fits your actual likes and views so nothing looks off to anyone checking your page.",
          "score": -4,
          "created_utc": "2026-01-23 11:47:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o103iys",
          "author": "the_bwas",
          "text": "One of the best websites I’ve tried was SocialFuelofficial cuz they actually had good quality services. But at the end of the day the quality of your content matters the most. The main reason to do it is for social proof.",
          "score": -12,
          "created_utc": "2026-01-22 06:19:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjbwly",
      "title": "10 Claude Skills that actually changed how I do marketing",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qjbwly/10_claude_skills_that_actually_changed_how_i_do/",
      "author": "Healthy_Video_956",
      "created_utc": "2026-01-21 22:07:04",
      "score": 79,
      "num_comments": 16,
      "upvote_ratio": 0.91,
      "text": "Skills dropped last month. Not enough marketers know about these.\n\n**1. Google ads audit** \\- Paste campaign data. Get wasted spend, search term leaks, negative keyword gaps, bid strategy issues. Full diagnostic in 3 minutes.\n\n**2. Meta ads audit** \\- Paste account data or export. Get campaign structure issues, audience overlap, creative fatigue signals, scaling opportunities. Where to focus first.\n\n**3. Ad spend allocator** \\- Paste multi-channel spend + results. Get reallocation recommendations, diminishing returns flags, budget shift priorities.\n\n**4. A/B test analyzer** \\- Feed it test results. Get stat sig check, segment breakdowns, \"why it worked\" hypotheses, next test ideas.\n\n**5. Competitor teardown** \\- Paste a landing page URL. Get positioning analysis, messaging hierarchy, objection handling, CTA strategy. 2 hours of work in 3 minutes.\n\n**6. Landing page audit** \\- Upload screenshot or URL. Get headline clarity, CTA placement issues, trust signal gaps, mobile friction. Prioritized by impact.\n\n**7. UTM & tracking generator** \\- Describe campaign structure. Get consistent UTM taxonomy, GA4 event naming, conversion tracking specs. No more naming chaos.\n\n**8. Email sequence writer** \\- Give it ICP + offer + objections. Get full nurture sequence with subject lines, preview text, body copy. Maintains voice throughout.\n\n**9. Content repurposer** \\- Give it one long-form piece. Get LinkedIn posts, tweet threads, email snippets, ad hooks. Keeps your voice.\n\n**10. Programmatic SEO builder** \\- Give it niche + data source. Get page templates, title patterns, internal linking logic, schema markup. Scale without looking scaled.\n\n**Quick thoughts:**\n\n* Skills are markdown files. Upload in Claude settings → Features → Skills.\n* Build your own: document a workflow you repeat, add examples, save as .md\n* Community ones on GitHub, quality varies\n\nI use Ad spend allocator and A/B test analyzer weekly for client reporting. Competitor teardown whenever we're pitching or repositioning.\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qjbwly/10_claude_skills_that_actually_changed_how_i_do/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0xrlpt",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 22:07:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xviei",
          "author": "thelwb",
          "text": "I swear to god I’ve seen this in LinkedIn and reported on already. Why you stealing peoples already slop crap?",
          "score": 21,
          "created_utc": "2026-01-21 22:25:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zonn8",
              "author": "khshtriyawarrior",
              "text": "It's either copy-paste or AI generated content, and genuine knowledge is missing. That's another layer an employer/client needs to filter out.",
              "score": 2,
              "created_utc": "2026-01-22 04:31:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1qxwn8",
                  "author": "Much_Bet9732",
                  "text": "Copy paste",
                  "score": 1,
                  "created_utc": "2026-01-26 02:49:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0zvmel",
          "author": "tomatotketchup",
          "text": "Thank u!",
          "score": 2,
          "created_utc": "2026-01-22 05:19:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o106sft",
          "author": "AnywhereOk1153",
          "text": "lol if anyone has actually spent 5 minutes doing any of these, they would stop posting these lists",
          "score": 2,
          "created_utc": "2026-01-22 06:46:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o109dhz",
              "author": "KoOBaALT",
              "text": "You mean they don’t work in practice?",
              "score": 1,
              "created_utc": "2026-01-22 07:09:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o12mv7f",
              "author": "KhiMao",
              "text": "I don't agree and I'm not OP. If you put them together the right way, you can tie together skills to do repeatable analyses and work past having to chat with a LLM everytime. \n\nHave you tried creating and refining specific skills to your work? What didn't work for you?",
              "score": 1,
              "created_utc": "2026-01-22 16:38:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o107put",
          "author": "New_Appearance2669",
          "text": "no links? :(",
          "score": 1,
          "created_utc": "2026-01-22 06:54:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11970d",
          "author": "Ok_Quality_5439",
          "text": "In short, paste anything and you get beginner-like results. Is Claude replacing us too early 😅",
          "score": 1,
          "created_utc": "2026-01-22 12:21:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13qjtd",
          "author": "Excellent-Painting64",
          "text": "I still  don’t rely entirely on AI for ad writing. And proper account auditing with screenshots or Excel files is still far outside their scope.",
          "score": 1,
          "created_utc": "2026-01-22 19:35:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o172o0e",
          "author": "Analytics-Maken",
          "text": "I add that skills work better when they pull live data instead of manual pastes. Automated pipelines solve this. ETL tools like Windsor.ai pull fresh data from Google Ads, Meta Ads, and other sources into Claude via MCP, feeding it with up to date data.",
          "score": 0,
          "created_utc": "2026-01-23 06:46:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zutr3",
          "author": "KONPARE",
          "text": "This is a great breakdown. The real win with Claude skills isn’t the flashiness, it’s how they compress hours of analysis into clear next actions, especially for audits and testing where consistency matters more than creativity.",
          "score": -3,
          "created_utc": "2026-01-22 05:13:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o109co3",
          "author": "anajli01",
          "text": "Strong list. The key takeaway for me is that these aren’t “AI writes stuff” use cases they’re **decision accelerators**. Anything that turns messy data or repeatable workflows into clear next actions (audits, allocation, test analysis) is where these skills actually save real marketing time.",
          "score": -2,
          "created_utc": "2026-01-22 07:08:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi0s4q",
      "title": "Does paid PR actually help you show up in ChatGPT answers?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qi0s4q/does_paid_pr_actually_help_you_show_up_in_chatgpt/",
      "author": "feliceyy",
      "created_utc": "2026-01-20 13:14:22",
      "score": 21,
      "num_comments": 9,
      "upvote_ratio": 0.93,
      "text": "Working with a PR agency that does paid placements in big publications. Getting coverage is easy but I have no idea if it actually matters for LLM visibility.  \nLike does ChatGPT even care if you're mentioned in Forbes vs some random blog? Or is it just looking at Google rankings? Feels like I'm spending money blind here.  \nAlso can't find a reliable way to track if any of this is working. The tools I've tried are full of fake mentions and I can't tell what's real. Very frustrating  \n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qi0s4q/does_paid_pr_actually_help_you_show_up_in_chatgpt/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0nt9qn",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 13:14:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1e7bv8",
          "author": "Significant_Pen_3642",
          "text": "From what I’ve seen, PR coverage can help with LLM visibility, but not simply because the name “Forbes” is on the page it helps when the coverage drives real search authority and well-structured content that AI models can digest. A random placement with no context or links often doesn’t move the needle.\n\nI ran into this too we were getting paid mentions but couldn’t tell if it was showing up in ChatGPT or other LLM outputs. After using meridian to track how often our pages were actually being cited or surfaced in AI answers, it became clearer which kinds of placements actually landed in generative results versus which just sat on a page.",
          "score": 6,
          "created_utc": "2026-01-24 08:23:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ty280",
          "author": "TurnoverEmergency352",
          "text": "ive been in a similar spot with pr stuff and wondering if it boosts llm mentions. from what i read limy ai focuses on optimizing brands for ai answers like chatgpt so maybe thats a better route than just paid placements. it seems to track real visibility without all the fake noise. have you tried anything like that yet?",
          "score": 7,
          "created_utc": "2026-01-21 10:20:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nwesi",
          "author": "admiralsound",
          "text": "Paid PR has undoubtedly helped position my clients for good LLM results. Most of them still don’t want to do it. To track success I use Otterly. Full disclosure I’m on their agency partner list but this is not a paid endorsement.",
          "score": 2,
          "created_utc": "2026-01-20 13:32:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tog2h",
              "author": "NoPlace4935",
              "text": "paid PR *can* help, but it’s not a magic button for ChatGPT visibility. I’ve seen it move the needle for clients, but tracking is still a mess unless you’re using something legit like Otterly.",
              "score": 1,
              "created_utc": "2026-01-21 08:48:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0y6hy9",
              "author": "JenerallySo",
              "text": "I'm now curious. What data points does it track to attribute LLM results to PR?",
              "score": 1,
              "created_utc": "2026-01-21 23:22:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o117ua1",
                  "author": "admiralsound",
                  "text": "The results for any query include citations. For my client depending on the query the PR they wrote for themselves and shared on a newswire service could show in the citations. It depended on the search and the LLM and could be inconsistent from day to day.",
                  "score": 2,
                  "created_utc": "2026-01-22 12:12:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0ssi1r",
          "author": "SavannahCallaway",
          "text": "tracking AI visibility is tough with fake mentions... i use directories and niche forums for backlinks, they often get picked up. for monitoring, i check Riff Analytics to see actual citations in ChatGPT and others.",
          "score": 1,
          "created_utc": "2026-01-21 04:25:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhx1p6",
      "title": "What I'd do differently if I started creating content again today",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qhx1p6/what_id_do_differently_if_i_started_creating/",
      "author": "Otherwise-Win6131",
      "created_utc": "2026-01-20 09:56:20",
      "score": 20,
      "num_comments": 1,
      "upvote_ratio": 0.92,
      "text": "If I could talk to myself six months ago right before I started posting, I'd probably tell myself to hold off. I've been making videos for six months and I finally get around 21,000 views regularly. But I wasted the first four months doing everything completely backwards. I posted every single day, watched tutorials on going viral, tried strategies people recommended. My views never broke 550.\n\nI thought maybe I wasn't creative enough or my personality was too boring. That people who succeed just have natural talent I don't have. I was about to quit around month four.\n\nThen I stopped randomly trying things and found what was actually broken. If I could restart today knowing what I know, I'd be at 21,000 views in a month instead of six months. Not because I'd make better content. Just because I wouldn't waste four months on stuff that never helped.\n\nHere's what I'd tell myself to stop doing.\n\n**Stop changing your opening constantly.** I rewrote my first line over and over thinking that's where everyone left. My opening worked fine. People stayed through the first five or six seconds. They dropped around second seven to twelve when I was still setting things up instead of getting to the point. I could have saved eight weeks if I'd checked where they actually left instead of obsessing over the hook.\n\n**Stop upgrading your recording setup.** I bought better lighting and a microphone because everyone says production quality matters. Spent 195 dollars total. My retention tanked. The videos that performed were messy phone recordings with zero planning. My video with 40,000 views was filmed on my phone in a parking lot waiting for an appointment. The upgraded gear made my content worse.\n\n**Stop following posting schedules.** I read that you need to post at the same time daily for consistency. I uploaded at 7pm every night for nine weeks. Views didn't improve at all. My most viewed video went up at 9am on a Saturday because I woke up early and just posted it. Nine weeks wasted on timing that did absolutely nothing.\n\n**Stop copying what works for others.** I watched creators with huge audiences and tried to replicate their editing and energy. It bombed constantly because what keeps existing fans watching doesn't attract new people. Their tactics assume viewers already care about them. I spent three weeks trying this before realizing it was pointless.\n\n**Stop testing different topics.** I thought experimenting with content would show me what my audience wants. Made productivity videos one week, then lifestyle, then advice, then personal stories. Views were identical across everything. The topic wasn't my issue. I was doing something wrong in every single video and changing topics just covered up the real problem.\n\nWhat I'd actually tell myself is find where they leave and only fix that moment. Not the opening, not the camera, not when you post. Just locate the second they're gone and change what's happening there.\n\nIt helped me a lot to use an app that shows what's wrong with your videos and exactly how to fix them to get more views. I use one called Tik.Alyzer and it tells you what's killing your performance and what specific changes to make. Like it'll say cut your pause at second nine because it's too long, or add a visual change at second seven because nothing moved. Normal analytics don't give you that level of detail on what to actually fix. I would have saved four months if I'd used this from the beginning.\n\nOnce I stopped messing with openings and equipment and started fixing what was actually broken, my views jumped. Went from 550 to 21,000 in about a month. Same content style, same filming approach. I just stopped working on things that didn't matter.\n\nIf you're just starting you're probably stuck where I was. None of it works until you know what's actually wrong with your videos and exactly how to fix it. Fix that before anything else. Everything else is noise.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qhx1p6/what_id_do_differently_if_i_started_creating/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0n3vsx",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 09:56:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qknyd4",
      "title": "How to have a consistent brand voice when you are working with clients in different regions?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qknyd4/how_to_have_a_consistent_brand_voice_when_you_are/",
      "author": "absolutely_gorjas",
      "created_utc": "2026-01-23 11:05:20",
      "score": 19,
      "num_comments": 12,
      "upvote_ratio": 0.96,
      "text": "Our team has grown a ton over the past year, and we now have multiple teams across the US, along with contractors and clients in different countries.\n\nWhile we have some pretty clear brand guidelines, it's been tricky when we get to working across cultures and languages. Even just sticking within the US, it seems clients in the south have wildly different expectations from clients in the northeast or the PNW. It gets even more complicated when we add in having to get approvals from managers and clients. So, I'm wondering how everyone else is handling this as you scale. Do you have a dedicated brand team, do you employ Al checks, are you manually reviewing everything?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qknyd4/how_to_have_a_consistent_brand_voice_when_you_are/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o17vhzh",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 11:05:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o183slh",
          "author": "screechymeechydoodle",
          "text": "We used to just trust everyone was trained on our branding and following the rules, but that got messy after a while. Now we have a dedicated branding team, locked assets and templates, and we’ve recently started using AI as an extra measure to look for things we might miss manually. We have a brand voice checklist, and that’s helped a lot of our writers and designers. That way nothing is up for interpretation, it’s all laid out.",
          "score": 9,
          "created_utc": "2026-01-23 12:09:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o189jpn",
              "author": "Notorious_Insanity",
              "text": "i feel this, we have too many people creating content now to just trust they'll adhere to brand guidelines. Once we revamped our approval workflow it made things a lot easier. We're now using a digital asset management system\nthat keeps everything in one place and prevents people from pulling outdated assets or the wrong variations of things (we have slight differences in our internal and external branding communications and some teams would mix them up).",
              "score": 1,
              "created_utc": "2026-01-23 12:48:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o18fq0y",
                  "author": "absolutely_gorjas",
                  "text": "Seems like I've found my people, bc this is exactly what my team has been dealing with. We were talking about making the switch to a DAM, as we currently use google drive for everything, which isn't always the best for organization purposes. But I'm so nervous of making the switch. Can I ask which DAM you use, and do you like it?",
                  "score": 1,
                  "created_utc": "2026-01-23 13:25:33",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1ap6ye",
          "author": "elzubeir",
          "text": "I've experienced this as well and we decided that our company culture supersedes locale. I did not think this would work when we did it, but it created a stronger brand. Everyone outside of the company knew that this business operated with a standard (whatever the standard you choose).",
          "score": 1,
          "created_utc": "2026-01-23 19:49:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1b52z6",
          "author": "KNVRT_AI",
          "text": "Brand voice consistency at scale requires both guidelines and governance, not just documentation.\n\nClear guidelines need to include not just tone and style but how to adapt for regional or cultural differences without losing core identity.\n\nRegional adaptation is necessary. Define what's non negotiable, core values, personality, key messages, versus what's flexible, word choice, cultural references, tone adjustments.\n\nDedicated brand team or steward reviews high visibility content, trains regional teams, provides feedback. Without ownership, consistency erodes.\n\nTemplates and approved messaging banks give teams starting points. Pre approved phrases reduce drift.\n\nTraining matters more than tools. Regular workshops with regional teams on brand voice, examples of good and bad, Q and A on edge cases.\n\nAI checks flag obvious deviations but aren't sophisticated enough for nuanced brand voice. Use for basic consistency, not final approval.\n\nManual review for important or client facing content is unavoidable. High stakes work gets human eyes from someone who understands the brand.\n\nApproval workflows slow things but ensure quality. Balance speed with risk, templates get less review, custom work gets more.\n\nOur clients scaling successfully centralize strategy and guidelines while decentralizing execution. Regional teams have autonomy within guardrails, escalate when unsure.\n\nUS regional differences are real but often overstated. Your brand voice should work everywhere with minor tweaks. If it requires total rewrites by region, core voice might be too narrow.\n\nFor international work, hire local copywriters who understand cultural context. Direct translation fails. Transcreation, adapting message while maintaining intent, works.\n\nFeedback loops where regional teams share what's working helps everyone learn. Monthly syncs reviewing examples and common mistakes.\n\nBigger you scale, more important onboarding and training become. New team members absorb brand voice through immersion, examples, practice, feedback, not just reading a guide.\n\nAccept some inconsistency is inevitable. Perfection doesn't scale. Keep core consistent, forgive minor variations at edges.\n\nInvest in brand stewardship as you grow. It's protecting one of your most valuable assets.",
          "score": 1,
          "created_utc": "2026-01-23 21:04:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1d9r5x",
          "author": "anajli01",
          "text": "We solved this by separating **core voice** from **regional expression**.\n\nThe voice (values, POV, words we always/never use) stays global. The tone and style flex by region and client. Guidelines alone aren’t enough examples matter.\n\nWe use a short voice playbook + regional samples, with a light final review and AI only for consistency checks, not decisions.",
          "score": 1,
          "created_utc": "2026-01-24 04:00:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ebowy",
          "author": "Legitimate-Hat-4333",
          "text": "Have a clear core voice (values,tone,personality) that never changes - then flex the expression, not the identity. Adapt language, references and cultural nuisances for each region, but keep the same beliefs and intent.",
          "score": 1,
          "created_utc": "2026-01-24 09:03:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ruqk4",
          "author": "supriya_l89",
          "text": "The establishment of consistent voice patterns requires organizations to follow their core principles instead of relying on fixed regulations. The establishment of non-negotiable traits requires organizations to select specific tone and values and words to avoid while allowing them to adapt their style according to different locations. A lightweight brand council operates in most teams together with their final reviewer who uses shared market content examples to identify \"good\" material. The implementation of AI checks enables organizations to detect inconsistencies yet human examination remains essential particularly for cross-cultural situations.",
          "score": 1,
          "created_utc": "2026-01-26 06:18:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ulqi2",
          "author": "bob_builds_stuff",
          "text": "One thing that's helped us scale brand voice checks is focusing heavily on \"negative rules\" - what NOT to say.\n\nMost brand guidelines are aspirational (\"be friendly,\" \"sound confident\"), which is hard to validate programmatically. But listing out specific things to avoid - banned phrases, competitor mentions, jargon to skip, words that don't fit your tone - is much easier to check automatically.\n\nSome concrete examples that work well for AI checks:\n- Banned phrases (\"I'd be happy to help,\" \"please don't hesitate\")\n- Forbidden terminology (competitor names, outdated product names)\n- Tone violations (\"actually,\" passive voice overuse)\n- Formatting rules (excessive exclamation points, ALL CAPS)\n\nThe positive stuff (\"warm but professional\") still needs human judgment, but catching 80% of the obvious violations automatically frees up your reviewers to focus on the nuanced regional/cultural questions you mentioned.\n\nAlso worth having a running doc of \"things that got flagged in reviews\" - turns institutional knowledge into enforceable rules over time.",
          "score": 1,
          "created_utc": "2026-01-26 17:02:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjry3k",
      "title": "How can I improve my email open rates?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qjry3k/how_can_i_improve_my_email_open_rates/",
      "author": "mediaBOOM",
      "created_utc": "2026-01-22 11:19:18",
      "score": 13,
      "num_comments": 19,
      "upvote_ratio": 0.94,
      "text": "I have around 8,000 real subscribers who opted in on my website, but my email open rate is only about 2.26%. I’ve tried changing subject lines and sending times, but it hasn’t improved. At this point, it feels like I’m just wasting money. What strategies are other digital marketers using right now to boost open rates without coming across as spammy?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qjry3k/how_can_i_improve_my_email_open_rates/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o110vrp",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-22 11:19:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o116rcy",
          "author": "Aunker",
          "text": "2.26% usually means deliverability or a dead list, not bad subject lines. First check if you’re landing in spam or promotions. Warm up by emailing only engaged subscribers from the last 30-60 days for a couple weeks, then clean hard and stop emailing people who never open. Send a simple 2-email re-engagement to the rest asking if they still want the emails, and suppress anyone who ignores it. Keep emails short with one topic and one link, avoid heavy images and spammy wording, and use a consistent sender name and address. Sometimes add a simple question that encourages replies, since replies can help deliverability. What platform are you using and are you seeing spam placement in your reports?",
          "score": 6,
          "created_utc": "2026-01-22 12:04:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11xmdj",
          "author": "Rich-Editor-8165",
          "text": "At that level, it is usually not a subject line problem. A 2 percent open rate often means list quality or relevance drift. I would pause sending, clean inactive subscribers, and tighten who gets what based on why they opted in. Fewer, more targeted emails almost always outperform blasting the full list.",
          "score": 2,
          "created_utc": "2026-01-22 14:40:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1415c5",
              "author": "within-co",
              "text": "Agree. Cleaning the list and narrowing down who gets what emails will make your open rate and engagement rate much better. Big numbers don't always equal better.",
              "score": 1,
              "created_utc": "2026-01-22 20:24:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o11zry3",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-01-22 14:51:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12ilbi",
          "author": "PearlsSwine",
          "text": "That's not a subject line problem. It's a deliverability/list problem. \n\nWhat domain are you sending from? Or you can check yourself on mxtoolbox to see if it's been blacklisted. \n\nWhat does google postmaster tools say?",
          "score": 1,
          "created_utc": "2026-01-22 16:19:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13bwfy",
          "author": "OrganicClicks",
          "text": "Some comments have already addressed deliverability, cleaning the list and re-engagement email. I'd add to keep emails short, mostly text, one clear point, one link max, and use a consistent from-name and domain. And once deliverability improves, try segmenting the new list based on how and why people signed up.",
          "score": 1,
          "created_utc": "2026-01-22 18:30:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o14fxjz",
          "author": "coachscholze",
          "text": "Totally fair question, because most beginners quit right here.\n\nThe mistake is trying to learn everything at once. SEO, ads, funnels, analytics, content… that’s not a beginner stack, that’s an agency org chart.\n\nIf I had to simplify it, start with one channel and one outcome, and more importantly, learn what actually moves people before you touch tools.\n\nHere’s what that looks like in real terms.\n\nPain-driven copy\n“Your website gets traffic, but no one calls. You’re paying for clicks that don’t turn into customers, and you don’t know why.”\n\nThis works because it names an existing frustration they already feel.\n\nFear-driven copy\n“Every month you delay fixing this, your competitors get more visible, more trusted, and harder to catch.”\n\nThis works because it taps into loss and risk, not features.\n\nMystery-driven copy\n“Most businesses fail online for one reason no one talks about, and it has nothing to do with ads or SEO.”\n\nThis pulls people forward because it creates a knowledge gap.\n\nGain-driven copy\n“Imagine knowing exactly where your next 10 customers are coming from, and being able to repeat it on demand.”\n\nThis works because it paints a clear, desirable outcome.\n\nAll four approaches sell the same thing. The tools don’t change. The psychology does.\n\nThat’s why beginners feel overwhelmed. They’re learning platforms instead of learning how decisions get made.\n\nOnce you understand pain, fear, mystery, and gain, SEO, ads, funnels, and analytics stop feeling random. They become different ways to deliver the same message.\n\nStart with one channel. One outcome. One real problem. Then layer the tools on top.\n\nThat’s how you avoid drowning in “everything marketing” and actually build skill.",
          "score": 1,
          "created_utc": "2026-01-22 21:34:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o157364",
          "author": "Overall-Buffalo-3660",
          "text": "A 2% open rate usually means deliverability and list quality issues clean inactive subscribers, segment hard, and re-earn inbox trust before tweaking subject lines.",
          "score": 1,
          "created_utc": "2026-01-22 23:55:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16yc09",
          "author": "supriya_l89",
          "text": "The deliverability of emails experiences issues when their subject lines show a threshold value of 2.26 percent. First, the list requires thorough cleaning which involves eliminating all inactive users and users who have not opened their emails during the past two months. The next step requires testing email delivery to determine if messages reach the spam or promotions folders after establishing domain authentication and verifying SPF and DKIM and DMARC settings. The research should evaluate plain-text emails which display an actual sender name together with content that provides value instead of presenting marketing material. Smaller, engaged lists almost always outperform big cold ones.",
          "score": 1,
          "created_utc": "2026-01-23 06:11:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17itww",
          "author": "Legitimate-Hat-4333",
          "text": "The biggest lifts in my open rates came from writing subject lines like i talk - clear, personal and a little curious. if it sounds like a real person would say it , people usually open it.",
          "score": 1,
          "created_utc": "2026-01-23 09:10:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19dj3t",
          "author": "ContextFirm981",
          "text": "With an 8,000 list and 2.26% opens, I’d start by cleaning hard/soft bounces and long‑term inactives, tightening segmentation, and sending fewer but more targeted emails with clear, benefit‑driven subject lines. Then slowly rebuild engagement so inbox providers start trusting your domain again.",
          "score": 1,
          "created_utc": "2026-01-23 16:11:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1e5it1",
          "author": "Crescitaly",
          "text": "2.26% is definitely below average - here's what's worked for me to boost open rates:\n\n\n\n\\*\\*Quick wins that usually help immediately:\\*\\*\n\n\n\n1. \\*\\*Subject line formula:\\*\\* Keep it under 40 characters. Use curiosity gaps like \"The \\[X\\] mistake killing your \\[Y\\]\" or personalization \"\\[Name\\], quick question about...\"\n\n\n\n2. \\*\\*Send time optimization:\\*\\* Test Tuesday-Thursday, either 10 AM or 2 PM in your audience's timezone. Avoid Mondays (inbox overload) and Fridays (weekend mode).\n\n\n\n3. \\*\\*Preview text matters:\\*\\* Don't waste it on \"View in browser\" - use it as a second headline.\n\n\n\n\\*\\*Deeper fixes:\\*\\*\n\n\n\n\\- \\*\\*Segment ruthlessly:\\*\\* Send different content to engaged vs. cold subscribers. One-size-fits-all kills engagement.\n\n\n\n\\- \\*\\*Re-permission campaign:\\*\\* Send a \"Do you still want to hear from us?\" email. Remove anyone who doesn't click. Smaller engaged list > big dead list.\n\n\n\n\\- \\*\\*Check your From name:\\*\\* Company name or founder's name? Test both. Personal names often win.\n\n\n\n\\*\\*Technical stuff:\\*\\*\n\n\\- Verify your SPF, DKIM, and DMARC records\n\n\\- Use a dedicated sending domain\n\n\\- Check if you're on any blacklists (use MXToolbox)\n\n\n\nWhat ESP are you using? And what's your niche? That context helps narrow down the issue.",
          "score": 1,
          "created_utc": "2026-01-24 08:07:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jn0a8",
          "author": "New_Appearance2669",
          "text": "Human writing on subject",
          "score": 1,
          "created_utc": "2026-01-25 02:27:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mw1f6",
          "author": "parkerauk",
          "text": "Adopt CTC as a mantra. Cut the Crap, or Correctly Targeting Communication. Outcomes that resonate are all you should be selling ever.",
          "score": 1,
          "created_utc": "2026-01-25 15:51:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sa4ov",
          "author": "Gloomy_Ad_896",
          "text": "When open rates are low, most people assume it's a subject line problem. Yet, it can ALSO be irrelevant previous emails, sender fatigue, or a secondary inbox. The first step is to figure out your specific root cause.",
          "score": 1,
          "created_utc": "2026-01-26 08:26:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tlva6",
          "author": "PRIV0306",
          "text": "2.26% on an opted-in list = deliverability issue, not a content issue. your emails are probably landing in spam.\n\nthe culprit is almost always list hygiene. anyone who hasn't opened in 6+ months is tanking your sender reputation. ESPs see low engagement and flag you as junk. you might need to cut that list down to actually see improvement.\n\nalso worth running a spam test before you send. campaign monitor platform has a tool that checks how your email renders AND whether it triggers spam filters. caught a few issues for me that i wouldn't have found otherwise.\n\nstart with the list though. 8k subscribers might really be 3k active people.",
          "score": 1,
          "created_utc": "2026-01-26 14:21:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi01jf",
      "title": "SEO News: “Personal Intelligence” rolls into Gemini and is coming to AI Mode in Search, OpenAI starts testing ads in ChatGPT in the U.S., AI Overviews begin replacing local packs, driving visibility drops for some businesses",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qi01jf/seo_news_personal_intelligence_rolls_into_gemini/",
      "author": "BogdanK_seranking",
      "created_utc": "2026-01-20 12:40:12",
      "score": 12,
      "num_comments": 14,
      "upvote_ratio": 0.85,
      "text": "Hey guys! We keep an eye on what’s happening in SEO and AI, so we put together the most useful updates from this week. Let’s read: \n\n**AI**\n\n* **“Personal Intelligence” rolls into Gemini and is coming to AI Mode in Search (U.S.)**\n\nGoogle began rolling out Personal Intelligence in the Gemini app, a beta that can connect Gmail, Photos, YouTube, and Search to deliver more tailored answers by reasoning across your personal content. \n\nIt’s off by default, lets users choose which apps to connect, and initially rolled out in the U.S. to Google AI Pro and AI Ultra subscribers, with plans to expand to the free tier and bring it into AI Mode in Search.\n\n* **AI Overviews begin replacing local packs, driving visibility drops for some businesses**\n\nGoogle has been showing AI Overview-style local packs for some “near me” queries, and SEOs report this can displace the traditional 3-pack and reduce visibility for Google Business Profiles. \n\n* **Google Trends Explore got a Gemini-powered upgrade**\n\nGoogle rolled out a redesigned Trends Explore page that uses Gemini to automatically surface and compare relevant search terms in a side panel, with suggested prompts to dig deeper. \n\nThe update also refreshed the UI, increased how many terms you can compare, and doubled the number of rising queries shown—rolling out gradually on desktop.\n\n**Source:**\n\nGoogle | X\n\nJoy Hawkins | SterlingSky\n\nNir Kalush | Google The Keyword \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Search / SEO**\n\n* **Mueller says linking sister brand sites is fine “at reasonable scale”**\n\nJohn Mueller said it’s common for companies to link between sister brands and that he doesn’t see a problem with it when done at a reasonable scale. He added that a single unified site presence may perform better overall, but splitting brands across separate domains shouldn’t cause issues on its own.\n\n* **Mueller warns against free subdomain hosting due to spam “neighbors”**\n\nJohn Mueller cautioned that free subdomain hosting platforms tend to attract spam and low-effort sites, which can make it harder for search engines to understand and trust your site’s overall value. \n\nHe framed it as a “bad neighborhood” problem: even if your site is solid, being surrounded by low-quality content can create extra hurdles, so owning your own domain helps you stand on your own merits.\n\n**Source:**\n\nJohn Mueller | bsky**,** Reddit \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**SERP features / Interface**\n\n* **Google to demote “prediction” news content in Top Stories and News**\n\nRajan Patel said Search is prioritizing ranking changes to reduce “prediction” articles (click-bait headlines that imply an event already happened) from appearing in Top Stories and Google News surfaces. \n\nHe added it won’t be an overnight fix, since changes require experimentation and analysis before launching.\n\n**Source:**\n\nBarry Schwartz | Search Engine Roundtable\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**E-commerce**\n\n* **Google prohibits merchants from showing higher prices in Search or AI Mode than on their websites**\n\nGoogle said it strictly prohibits merchants from displaying prices on Google (including AI Mode shopping) that are higher than what’s shown on the merchant’s own site. \n\nThe company also pushed back on claims that “upselling” means overcharging, and clarified that its Direct Offers pilot can only be used to offer lower prices or add perks like free shipping—not to raise prices.\n\n**Source:**\n\nNews from Google | X\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Tidbits**\n\n* **Apple Intelligence and Siri to be powered by Google Gemini**\n\nApple and Google confirmed a multi-year collaboration under which the next generation of Apple Foundation Models will be based on Google’s Gemini models and cloud technology, helping power future Apple Intelligence features, including a more personalized Siri.\n\n* **OpenAI outlines ad plans for ChatGPT (U.S.)**\n\nOpenAI said it will start testing ads in the U.S. for logged-in adults on the Free and ChatGPT Go tiers, while Pro, Business, and Enterprise will remain ad-free.\n\nThe company also set “ads principles,” including that ads won’t influence answers, conversations won’t be shared or sold to advertisers, and users can turn off personalization and clear ad-related data.\n\n**Source:**\n\nGoogle The Keyword > Company Announcements \n\nOpenAI > Product ",
      "is_original_content": false,
      "link_flair_text": "News",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qi01jf/seo_news_personal_intelligence_rolls_into_gemini/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0nnwpp",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 12:40:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nr6eo",
          "author": "VerballyWhistle89",
          "text": "So now OpenAI is trying to push ads, claiming that they won’t influence responses. But in practice, user trust will depend on transparency and verifiability, not principles, yes? Okay, so what advertising would look like in a chat interface without results management.",
          "score": 3,
          "created_utc": "2026-01-20 13:01:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nytkh",
              "author": "Capable_Honeydew9778",
              "text": "Yeah this feels like the same old promise we’ve heard before, just wrapped in nicer words. Once ads show up, people will watch behavior not policy pages, and trust will live or die on what actually shows in the chat.",
              "score": 4,
              "created_utc": "2026-01-20 13:46:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0oifsv",
                  "author": "BogdanK_seranking",
                  "text": "I remember OpenAI assuring everyone that advertising was not their top priority.",
                  "score": 1,
                  "created_utc": "2026-01-20 15:27:38",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o0tpead",
                  "author": "Mountain-Cupcake4740",
                  "text": "it’s the same song and dance every time. Once ads hit, the real test is whether the convo stays clean or gets hijacked by whatever pays the most.",
                  "score": 1,
                  "created_utc": "2026-01-21 08:57:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0nyhfb",
              "author": "BogdanK_seranking",
              "text": "I think we’re about to see one of the biggest A/B tests in history :)\n\nHopefully it won’t go as far as *\"native ad integration directly inside answers\"*, and ads will stay clearly labeled as “Sponsored” somewhere at the top or bottom of the screen.",
              "score": 1,
              "created_utc": "2026-01-20 13:44:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0o8keh",
          "author": "SolutionForsaken723",
          "text": "honestly feels like another week of “google changes the rules again”😅 the local pack stuff is kinda scary though especially for small/local businesses that rely on GBP visibility. feels like the play now is less about chasing specific SERP features and more about building brand + demand outside of search because these layouts keep shifting fast.",
          "score": 2,
          "created_utc": "2026-01-20 14:38:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p3m6b",
              "author": "BogdanK_seranking",
              "text": "Yeah. Feels like optimizing for \"today’s\" search results doesn’t really make sense. What matters is building a solid, long-term growth strategy that isn’t thrown off by random changes in search engines. This feels like a strong long-term plan.",
              "score": 1,
              "created_utc": "2026-01-20 17:06:12",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o0tl3hu",
              "author": "Legitimate-Meat-8917",
              "text": "it’s good how every week feels like a new rulebook. The local pack changes are rough for small businesses, so honestly the move now is just building brand and demand outside search before Google flips the layout again.",
              "score": 1,
              "created_utc": "2026-01-21 08:16:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ntppj",
          "author": "carlos_jimenez_may",
          "text": "What does visibility mean when answers are stitched from personal data and web sources? We’ll end up optimizing for being eligible as a citation rather than ranking #1.",
          "score": 1,
          "created_utc": "2026-01-20 13:17:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nvbmz",
              "author": "MaciasAnya95",
              "text": "You've got AIO local packs replacing the 3-pack. That’s not even personalization, that’s straight-up UI displacement.",
              "score": 1,
              "created_utc": "2026-01-20 13:26:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o173g5n",
          "author": "WoodpeckerNo9461",
          "text": "stuff like this always throws me off when tracking site drops, i just check similarweb for a quick sanity check on traffic and competition and it helps keep things in perspective with all these ai serp changes. found it way more detailed than just poking at search console especially when trends shift fast. not perfect but definitely worth a peek if you’re chasing visibility shifts, just makes things less of a guessing game.",
          "score": 1,
          "created_utc": "2026-01-23 06:52:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qk777o",
      "title": "Pricing is awkward conversation",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qk777o/pricing_is_awkward_conversation/",
      "author": "Affectionate-Sky-74",
      "created_utc": "2026-01-22 21:21:45",
      "score": 11,
      "num_comments": 13,
      "upvote_ratio": 0.93,
      "text": "As a marketing consultant, do you find it awkward talking about price once you had a conversation with a potential client? How many actually say il send you a price through email later or do you give one on the spot.   \n  \nWhat does your workflow look like. would be really helpful to understand ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qk777o/pricing_is_awkward_conversation/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o14dbx3",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-22 21:21:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16hey4",
          "author": "thesinnedknight",
          "text": "I am very upfront with my pricing.  People weed themselves out, that way.",
          "score": 3,
          "created_utc": "2026-01-23 04:13:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17v15q",
              "author": "Affectionate-Sky-74",
              "text": "Brilliant. You know your worth and pricing doesn't need to be negotiable when value is apparent",
              "score": 1,
              "created_utc": "2026-01-23 11:01:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o14hw40",
          "author": "JazzFestFreak",
          "text": "Only when it to potential clients that can’t afford it",
          "score": 3,
          "created_utc": "2026-01-22 21:43:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15vz1d",
          "author": "MissionCaramel755",
          "text": "In my experience it all depends on the situation and also what kind of client it is. \nIf we are having a good understanding of the process and client has patience of getting a proposal with road map after couple of meetings then I try to keep it in mail.\nBut on the other hand I have had clients or prospects who starts from the pricing, I try and take the conversation  forward as much as I can and in some cases I have to tell the price in meeting itself.  . . But I try to keep the price higher because I feel that they will negotiate and I'll have to bring down to actual cost.",
          "score": 1,
          "created_utc": "2026-01-23 02:11:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o162tkh",
          "author": "christopherelang",
          "text": "Just show value, and give them the price right there on the call. That allows you to provide clarity on anything they may be unsure of right away without all the back and forth. They’ll either move forward or they won’t. The only reason to feel awkward about pricing conversations is if you yourself are unsure of the value you bring.",
          "score": 1,
          "created_utc": "2026-01-23 02:48:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o188ehj",
              "author": "christopherelang",
              "text": "I craft a few different offers. One of them is my core offer, one is a step above that and one below. That’s it. I make sure there is inherent value in each of my offers and based on how the call goes, I qualify them to one of my specific offers.  No cookie cutter nonsense or custom packages. \n\nMost importantly, my price is non negotiable and never discounted. I’ll work with a client on the best way for them to pay, be it all up front which is my default, or split it into 2 or 3 payments, but that’s about it. \n\nYour job is to identify the pain/problem you’re solving, make them understand that your offer solves that problem, and make them understand the cost of NOT solving that problem. If they understand that, they’ll find a way to get you your money.",
              "score": 2,
              "created_utc": "2026-01-23 12:41:19",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o17v8k5",
              "author": "Affectionate-Sky-74",
              "text": "Agree. How do you currently create pricing for new clients? Do you use templates, build custom each time or use specific software?",
              "score": 1,
              "created_utc": "2026-01-23 11:03:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o16z8f3",
          "author": "tsukihi3",
          "text": "> do you find it awkward talking about price once you had a conversation with a potential client?\n\nYes, because I'm not a salesman. I'm not really good with the selling process, but I do it because I got to put food on the plate. \n\nI don't have many clients so I don't get to practice a sales pitch, but that's been working for me so far thankfully.\n\nI have established a tiered pricing that works for me, and I have enough experience to know about how long something is going to take me, so I can just provide a range on the spot with a more formal confirmation later by email once I have all the detail.",
          "score": 1,
          "created_utc": "2026-01-23 06:18:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17uw5h",
              "author": "Affectionate-Sky-74",
              "text": "I get what you mean, I realised many dont get the most out their service because of this fear. Sometimes it's probably better to say this is my price take it or leave it. But I get you end of the day you still need to put food on the table",
              "score": 1,
              "created_utc": "2026-01-23 11:00:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1cstps",
                  "author": "tsukihi3",
                  "text": "imho, those who fear paying aren't worth working with. \n\nMy pricing is very reasonable considering my experience and skills, and if someone's pricing themselves out, I'm fine with that. I'm not chasing the sale since I'm a one-man operation.\n\nNegociating price today will probably mean being a pain later down the line.",
                  "score": 1,
                  "created_utc": "2026-01-24 02:18:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1g0hpl",
          "author": "bones605",
          "text": "No price on the call...it's too complex to figure out on the spot unless it's a cookie cutter/package service. But give a range on the call to set expectations...if they flinch then you've saved yourself any more wasted time. If not then follow up with a well thought out proposal (short and sweet but addressing exactly what they are looking for). Always at least 2 options...the one you'd be happy for them to choose and a better (more expensive) one. Never just a single option, otherwise you're putting a gun to their head...choose this or go away.  When maybe they would have moved forward had you offered another option that made your original one look like a steal.",
          "score": 1,
          "created_utc": "2026-01-24 16:02:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1hmymx",
              "author": "Affectionate-Sky-74",
              "text": "Great insight thanks. How do you currently create pricing for new clients? Do you use templates, build custom each time or use specific software?",
              "score": 1,
              "created_utc": "2026-01-24 20:20:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qnle1z",
      "title": "I analyzed 2,500+ subject lines across 12 industries. Here's what actually gets clicks in 2026",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qnle1z/i_analyzed_2500_subject_lines_across_12/",
      "author": "PuzzleheadedTalk5159",
      "created_utc": "2026-01-26 16:48:32",
      "score": 11,
      "num_comments": 6,
      "upvote_ratio": 0.92,
      "text": "I'm pretty obsessed with email marketing recently, so I decided to spend the last month digging through email data from newsletter tools, ESPs, and my own experiments, and analyzed what gets people to actually open their emails.\n\nSome of this will piss off the \"best practices\" crowd. But the data doesn't lie.\n\nHere's what I found, ranked by worst to best:\n\n(I put a lot of effort into this post, so hope you find it valuable)\n\n**10. \"Newsletter\" in the subject line** \\- Instant death. People are drowning in newsletters. Calling yours a newsletter is like wearing a sign that says \"delete me.\" The worst? \"Monthly Newsletter - \\[Month\\].\" Please, just stop.\n\n**9. All caps + excessive punctuation** \\- \"LAST CHANCE!!!\" Screams desperation. Your audience isn't deaf, they're just ignoring you. Also spam filters absolutely hate this.\n\n**8. Generic promotional language** \\- \"Special offer inside\" or \"Exclusive deal for you.\" Everyone says it's exclusive. Nobody believes you anymore. These worked in 2019. It's 2026. Move on.\n\n**7. Overly clever/cryptic lines** \\- \"You won't believe what happened...\" Clickbait works on Facebook. Email audiences are smarter and more annoyed. They want value, not mystery.\n\n**6. Emoji-heavy subject lines** \\- Controversial take: emojis work, but MAX one per subject line. More than that and you look like a 14-year-old's text message. One well-placed emoji? Chef's kiss. Three fire emojis? Trash.\n\n**5. Question-based subject lines** \\- \"Are you making this mistake?\" Better than clickbait but still pretty meh. Works better in B2B than B2C. Needs to be hyper-specific to actually work.\n\n**4. Personalization (first name)** \\- \"Hey \\[Name\\], check this out.\" Works, but it's baseline now. Everyone does it. You're not special for using merge tags. Better than nothing though.\n\n**3. Time-sensitive + specific** \\- \"48 hours left: \\[specific thing\\].\" Creates urgency without being scammy. Key word: SPECIFIC. \"48 hours left\" alone doesn't work. Tell them what they're actually missing.\n\n**2. Ultra-specific value proposition** \\- \"How \\[Company\\] grew to $10M with email\". Pure value. Tell them exactly what's inside and why they should care. Funny thing - long subject lines (10-15 words) actually performed better here. All that \"keep it short\" advice? Not always true.\n\n**1. Plain, conversational, from a person** \\- \"Question for \\[name\\]\" or \"great business advice\" Why? It doesn't look like marketing. It looks like an email from a human. The best performing emails in my analysis looked like they came from a coworker, not a brand. Wild, right?\n\n**The stuff that actually matters:**\n\n* Shorter is NOT always better - 6-10 word subject lines performed best overall, but context matters way more than length\n* Mobile preview text is criminally underused - 70% of emails are opened on mobile. USE THAT SPACE.\n* Industry matters more than you think - What works in SaaS dies in e-commerce. Test your own audience.\n\nThe biggest lesson? Stop trying to \"hack\" opens. Write subject lines like you're emailing a friend. \n\nWhat's working for you? Genuinely curious what I'm missing here.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qnle1z/i_analyzed_2500_subject_lines_across_12/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1uigbt",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 16:48:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wcia9",
          "author": "debarn",
          "text": "Thanks for sharing this very insightful! \n\n\nI also became somewhat obsessed with email marketing recently, especially that I do B2B biz dev, so gotta try a tons of different things, and I must say that the simpler ones increased my open rate, and some event reply rate.\n\n\nStill WIP but this post may help me refine it even further.\n\n\nSo - cheers, great work! :)",
          "score": 2,
          "created_utc": "2026-01-26 21:34:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1wlmld",
              "author": "PuzzleheadedTalk5159",
              "text": "I appreciate the feedback!",
              "score": 2,
              "created_utc": "2026-01-26 22:15:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1wm2ii",
          "author": "abcdsjcbdisicbd",
          "text": "Great work! I feel like the short and human once are always the best performing (just from my experience). Really dependes on the niche ofc",
          "score": 1,
          "created_utc": "2026-01-26 22:17:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1wmnrg",
              "author": "PuzzleheadedTalk5159",
              "text": "Thanks! Yeah I agree 100%",
              "score": 1,
              "created_utc": "2026-01-26 22:20:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qmb0t0",
      "title": "Has DIY marketing replaced agencies?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qmb0t0/has_diy_marketing_replaced_agencies/",
      "author": "JohnWob",
      "created_utc": "2026-01-25 06:02:09",
      "score": 10,
      "num_comments": 18,
      "upvote_ratio": 0.82,
      "text": "I've lost quite a few clients over the past couple years with the rise of AI. Finding a lot of clients or potential clients doing diy methods of marketing wether it's through saas plarforms or using AI for content on their site.\n\nHave you guys noticed this when trying to convert leads? That they'd prefer doing it themselves?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qmb0t0/has_diy_marketing_replaced_agencies/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1kly32",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-25 06:02:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1kqv1s",
          "author": "hirschy75",
          "text": "No.",
          "score": 9,
          "created_utc": "2026-01-25 06:40:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1kr8xa",
          "author": "New_Criticism4996",
          "text": "They think it has but there's a reasons agencies exist.\n\nI just took over a meta account. The were sending people who clicked on the add to meta... meta users would see a meta ad and get redirected to meta. All paid for buy the advertiser.\n\n$600/mo down the drain. \n\nDIY only works if you know enough of what you are to get good enough results and have the time. In reality thats 5% of businesses.",
          "score": 6,
          "created_utc": "2026-01-25 06:43:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1lzo2f",
          "author": "bialettibrewmaster",
          "text": "We’re using an “agency” based in SE ASIA.  They are clearly some sort of weird farm AI’ing shit, literal shit. It’s more than a language barrier or cultural barrier. Should be pay8ng me more because the crap they produce is unusable. Keywords are truly fucked up. Copy is kindly written in English and makes no sense along with lack of grammar. Imagery is off-concept. Turn around times is 2-3wks.\nI would never recommend going cheap and hiring any agency in SE ASIA unless you are in SE ASIA and your business is there. My org doubled-down on cheap- outsource to SE ASIA and heavy AI usage.\n\nI realize this is off topic. I needed to vent on this weird convergence of cheap human labor combined with AIing digital marketing.",
          "score": 2,
          "created_utc": "2026-01-25 12:58:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1nbjzc",
          "author": "hddjdjjdjd",
          "text": "Not at all. Many will try, and then fail and go back to agencies.",
          "score": 2,
          "created_utc": "2026-01-25 16:58:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rwv3l",
          "author": "Just_Use8502",
          "text": "yeah it's definitely happening but the lower end is going DIY hard\n\ntools like creatify, canva, chatgpt make it easy for small businesses to handle basics themselves. they were never gonna pay agency rates long term anyway\n\nbut clients who need actual strategy, positioning, or complex campaigns still need agencies. AI can pump out content but it can't fix a broken funnel or figure out messaging\n\nthe middle is getting squeezed though. if you're just doing execution without strategic value you're probably cooked\n\nwhat kind of clients did you lose? small businesses or bigger brands?",
          "score": 2,
          "created_utc": "2026-01-26 06:35:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ktytl",
          "author": "abralytics",
          "text": "DIY is like cutting their own hair instead of a barber.",
          "score": 2,
          "created_utc": "2026-01-25 07:05:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1lvpt2",
              "author": "emmasexytime",
              "text": "Yes but budget is budget :)  hehe",
              "score": 1,
              "created_utc": "2026-01-25 12:30:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1lskhx",
          "author": "drteq",
          "text": "Mainly the economy forced many small businesses to cut their budget and try to survive",
          "score": 1,
          "created_utc": "2026-01-25 12:05:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1lvnpw",
          "author": "emmasexytime",
          "text": "Yes AI especially has helped those DIY. <3",
          "score": 1,
          "created_utc": "2026-01-25 12:29:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1q4etu",
          "author": "BlueGridMedia",
          "text": "AI can help but most owners dont have the time to optimize the ad accounts themselves",
          "score": 1,
          "created_utc": "2026-01-26 00:21:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1twv19",
          "author": "CranberryOk945",
          "text": "I am on the other side as a copywriter but in recent year some clients are coming in with this absurd,but very long critique ,like \"rewrite it all to be more x and add H1( I asked : H1 what? There is clearly a h1 header here, it's first time in 15 years someone wants me to write \"H1\" on top of the article?\"  and we waste like an hour to talk it through, and in the end they see it is not improving seo, its wasting everyone's time, but the hour of my life us gone. And I am sure they don't use chatGPT only for useless copywriting critique but generally they tinker they SEO knowing nothing!😬",
          "score": 1,
          "created_utc": "2026-01-26 15:14:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v0r8x",
          "author": "Kml777",
          "text": "Yes, it's true. AI has developed so vastly and is still developing in fast pace, that you can use them by your own. AI applications are solving the toughest part that is called execution. Now, with the help of AI, execution becomes very easy for everyone. Like - I am from AI ugc. Creators can cost you $500+, and content delivery will be more than 3 weeks. Now?? What should I do when I have no patience? Here, AI solved this problem. Quick + Cost-effective, content can be scaled. No need for core AI knowledge; anyone can generate. Just a DIY.\n\nIn the upcoming 2 to 3 years, the scenario will be very different in the AI space.",
          "score": 1,
          "created_utc": "2026-01-26 18:07:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1kynxv",
          "author": "Aunker",
          "text": "Yeah, I’m seeing that a lot. AI didn’t kill demand, it changed what people think they’re buying. They don’t want marketing help anymore, they want outcomes and someone to own the messy parts they still can’t DIY: strategy, tracking, creative testing, conversion, and consistency. Most DIY people aren’t saying no forever. They’re saying not yet. They try it, get mediocre results, then come back when they realize tools don’t equal growth. What works now is leading with one clear fix, not a full service pitch. Audit one thing, show the gap, give a tight plan, and let results sell the next step. What’s the main service you sell right now, ads, SEO, or full stack marketing?",
          "score": 1,
          "created_utc": "2026-01-25 07:44:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qlqpet",
      "title": "curious how people think about risk vs convenience with social media tools",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qlqpet/curious_how_people_think_about_risk_vs/",
      "author": "shash_99",
      "created_utc": "2026-01-24 16:01:15",
      "score": 8,
      "num_comments": 13,
      "upvote_ratio": 0.91,
      "text": "we manage multiple brands and clients, so native posting across platforms just isn’t realistic, but every time i research tools i run into warnings about api issues, shadowbans, and accounts getting restricted. i’m not trying to automate engagement or do anything aggressive. mostly just want sane scheduling, a shared inbox, and approvals that don’t live in five places. when i compare tools like sprout social, metricool, and vista social, they all say they’re legit, but it’s hard to separate real risk from internet horror stories\n\nin practice, is the risk more about how people use these tools, or have you actually seen downsides from using reputable all in one platforms day to day",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qlqpet/curious_how_people_think_about_risk_vs/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1g08vo",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-24 16:01:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gayr3",
          "author": "GrowthLaunch",
          "text": "Totally get it! Once you manage multiple brands, native posting turns into a full-time job.\n\nIn my experience, the “horror stories” are usually less about the scheduler itself and more about **permission + identity weirdness**. The moment you have 6 people logging in, 3 devices, VPNs, switching locations, and reconnecting accounts… platforms start treating it like suspicious behavior.\n\nA low-stress way to run it: keep **one admin login per platform**, connect via official partner API, and avoid any tool that asks for your password directly",
          "score": 3,
          "created_utc": "2026-01-24 16:49:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1j8x8h",
          "author": "Electronic-Cat185",
          "text": "in practice the riisk is way more about behavior than the tools themselves. reputable platforms that use official apis are generally fine for scheduliing approvals and inbox management. most of the horror stories come from people pushing volume repeatiing content or trying to game engagement. if your use case is boring and compliant these tools usually reduce risk instead of increasing it because everything is logged and consistent. conveniience tools get dangerous when they are treated like growth hacks instead of workflow infrastructure",
          "score": 2,
          "created_utc": "2026-01-25 01:09:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jt0hp",
          "author": "Rich-Editor-8165",
          "text": "The risk seems to be more about how people use tools rather than the tools themselves. If you're sticking to the basics like scheduling and managing communication, the risk is lower, but always be cautious of terms of service and limits on each platform.",
          "score": 2,
          "created_utc": "2026-01-25 03:00:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1g8maa",
          "author": "Necessary-Place-8321",
          "text": "we’ve been using vista social for a bit and honestly the risk conversation felt bigger online than in real life. as long as we’re not auto spamming or doing anything weird, it’s basically just a cleaner way to schedule and manage inbox without jumping between native apps",
          "score": 1,
          "created_utc": "2026-01-24 16:39:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1neevn",
              "author": "mick1706",
              "text": "I totally agree! I look at it like its working alongside with us",
              "score": 1,
              "created_utc": "2026-01-25 17:10:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1nru37",
              "author": "Old-Push-7296",
              "text": "that lines up with what i keep hearing. with vista social specifically, it seems like people are using it for basic scheduling and inbox cleanup. feels like “third party tool” and “automation” get mixed up when they’re really different things",
              "score": 1,
              "created_utc": "2026-01-25 18:07:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1lraok",
          "author": "No_Winner_6631",
          "text": "every actual issue i’ve seen came from someone pushing volume way too hard or using some sketchy plugin. i’ve never seen a legit platform randomly get an account banned.",
          "score": 1,
          "created_utc": "2026-01-25 11:55:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ndic1",
          "author": "Dramatic-Flamingo584",
          "text": "From my experience, the risk is way more about how people use these tools than the tools themselves. Most of the horror stories I’ve seen come from aggressive automation or sketchy engagement tactics, not basic scheduling, inbox management, or approvals. I’ve used third-party platforms for multiple brands because native posting just isn’t realistic, and as long as you’re staying within normal posting and engagement behavior, issues are rare.\n\nI treat these tools as operational support, not growth hacks. For things like scheduling, shared inboxes, and approvals, reputable platforms that work with official APIs have been solid for me day to day. I’ve found that something like Vista Social quietly does the job without pushing risky features, which makes the convenience worth it. Overall, the time saved and reduced chaos far outweigh the risk when you’re using the tools responsibly.",
          "score": 1,
          "created_utc": "2026-01-25 17:06:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1of36u",
          "author": "Fenrir_Max",
          "text": "every actual issue i’ve seen came from someone pushing volume way too hard or using some sketchy plugin. i’ve never seen a legit platform randomly get an account banned",
          "score": 1,
          "created_utc": "2026-01-25 19:45:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qn8leb",
      "title": "Hired an influencer agency and it was the most expensive lesson of my career",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qn8leb/hired_an_influencer_agency_and_it_was_the_most/",
      "author": "True-Sherbet-1443",
      "created_utc": "2026-01-26 06:38:58",
      "score": 8,
      "num_comments": 18,
      "upvote_ratio": 0.75,
      "text": "\n\n$8k/month for six months. $48k total. Results barely better than what I couldve done myself for maybe $5k.\n\nWhat we got: monthly \"strategy calls\" that were status updates. Creator recommendations that were obviously whoever was easiest to book. Reports that were templates with our numbers filled in. Campaign management that was basically forwarding emails.\n\nWhat we didnt get: actual strategic thinking. Creators matched to our audience. Any optimization. Transparency on margins.\n\nNot saying all agencies are bad but the structure is broken. They get paid regardless of results. Theyre spread across a dozen clients.\n\nWe dropped them. Brought it in house. Results improved. Costs dropped 60%.\n\nAnyone else have horror stories or am I just unlucky?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qn8leb/hired_an_influencer_agency_and_it_was_the_most/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1rxcm5",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 06:38:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1s3xq7",
          "author": "callmegg71",
          "text": "Kudos to you: you learned a new skill. Next time you will study first and delegate later eventually",
          "score": 8,
          "created_utc": "2026-01-26 07:32:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1srz9r",
          "author": "Ok-Function5949",
          "text": "If they were so dreadful why did you keep them for so long? I’m asking genuinely and not trying to be a clever clogs…. Could you not exit the contract before 6 months? What KPIs did you set ? Anything you can claw back?",
          "score": 7,
          "created_utc": "2026-01-26 11:07:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1tzcc7",
              "author": "portrayaloflife",
              "text": "Assuming it was contractual",
              "score": 1,
              "created_utc": "2026-01-26 15:26:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1sddw2",
          "author": "hui_hui_95",
          "text": "the reporting thing is so real. these beautiful PDFs that said nothing useful. vanity metrics everywhere. no actual insight into what worked",
          "score": 6,
          "created_utc": "2026-01-26 08:56:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sqlq8",
          "author": "SmallIntroduction345",
          "text": "Having worked with many startups as a Product Marketer and in my own startup, I can 💯 relate. Same old story. Free upfront gifting, overly scripted inauthentic content, next week same influencer is spruiking a competitor, and business end up with no assets they own to repurpose. Unfortunately it’s a common story 😢",
          "score": 5,
          "created_utc": "2026-01-26 10:55:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1u32nm",
          "author": "Careful-Election9957",
          "text": "exact same. went in house using upfluence and one person. costs dropped by more than half and ROAS went up. turns out knowing your own brand matters more than whatever \"expertise\" agencies claim",
          "score": 3,
          "created_utc": "2026-01-26 15:42:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1u8i5t",
          "author": "Sensitive-Mixture663",
          "text": "This looks similar to another LLM spam post - someone’s gonna comment soon recommending a specific company as the solution…",
          "score": 3,
          "created_utc": "2026-01-26 16:06:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1wnqom",
              "author": "Agile-Duck8979",
              "text": "This forum has become all spam it’s such a shame",
              "score": 1,
              "created_utc": "2026-01-26 22:25:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1sdo6w",
          "author": "yummytoesmmmm",
          "text": "not just you. almost identical experience. agency promised \"full service\" but sent a list of creators they already knew regardless of fit. zero customization",
          "score": 2,
          "created_utc": "2026-01-26 08:58:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tmh8i",
          "author": "Sarthak999gupta",
          "text": "What was your in-house and agency CPM?",
          "score": 2,
          "created_utc": "2026-01-26 14:24:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v6b65",
          "author": "iamgoaty",
          "text": "Which agency?",
          "score": 2,
          "created_utc": "2026-01-26 18:30:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vadxu",
          "author": "Bear-back9044",
          "text": "Name and shame!",
          "score": 1,
          "created_utc": "2026-01-26 18:47:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1vbpza",
              "author": "fatman2442",
              "text": "Had a similarly worse situation using grapevine but that was 6-7 years ago. 20k down the drain zero value",
              "score": 1,
              "created_utc": "2026-01-26 18:53:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1vgxz3",
                  "author": "Bear-back9044",
                  "text": "Shame :( sorry hunny. Too many scamfluencers neh.",
                  "score": 1,
                  "created_utc": "2026-01-26 19:15:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1s28p3",
          "author": "The-Big-Chungis",
          "text": "No one else can care for your results as much as you can. In-house can well manage influencer partnerships,",
          "score": 1,
          "created_utc": "2026-01-26 07:18:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj0glv",
      "title": "How do you do newsletter competitive analysis?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qj0glv/how_do_you_do_newsletter_competitive_analysis/",
      "author": "schnicel",
      "created_utc": "2026-01-21 15:12:41",
      "score": 6,
      "num_comments": 6,
      "upvote_ratio": 0.81,
      "text": "Curious how other marketers handle tracking competitor newsletters. Do you manually subscribe, take screenshots, Excel tracking? Or do you have some process/tool? I built my own AI analyzer (Newsletrix.com) because it was eating hours every week. What are your best practices?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qj0glv/how_do_you_do_newsletter_competitive_analysis/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0v7l3t",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 15:12:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10nq6g",
          "author": "Head-Opportunity-885",
          "text": "i used to go the manual route too subscribing and logging every campaign until it just ate too much time check similarweb it does a good job pulling in competitor site traffic engagement and sometimes you can connect spikes to newsletter launches it’s not perfect but quicker than copy pasting all day pairing that with your own tool could give a fuller picture might be fun to compare what each catches.",
          "score": 1,
          "created_utc": "2026-01-22 09:20:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1279qb",
          "author": "inboxticDOTio",
          "text": "I went through the same pain and honestly tried all of the above at different stages.\n\nEarly on it was:\n\t•\tManual subscriptions from burner emails\n\t•\tGmail labels + folders\n\t•\tScreenshots + Notion/Sheets for tracking themes and offers\n\nIt works… until it doesn’t. Once you’re tracking more than ~10–15 competitors, it becomes noisy, inconsistent, and time-consuming. The biggest issue for me wasn’t collecting emails — it was making sense of patterns over time (timing, frequency, offers, positioning).\n\nThat’s actually why I started building Inboxtic.io.\nIt’s still in MVP, but the core idea is to centralize competitor newsletters and analyze them longitudinally, not campaign by campaign.\n\nRight now we’re:\n\t•\tBuying & aggregating newsletters at scale (so no inbox clutter)\n\t•\tStructuring metadata (brand, industry, timing, promo type)\n\t•\tUsing AI to surface patterns/anomalies instead of manual tagging\n\nI still think DIY setups make sense at very small scale or for niche research.\nBut once you want repeatable competitive insight, automation is the only way it doesn’t become a weekly time sink.\n\nAlso interesting to see you built Newsletrix — clearly a lot of us hit the same wall. Feels like this space is just getting started.\n\nWould love to compare notes on what signals you’ve found most useful (timing vs offer vs copy vs frequency).",
          "score": 1,
          "created_utc": "2026-01-22 15:27:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16wnad",
          "author": "KONPARE",
          "text": "I’ve mostly seen people keep it simple: subscribe to a small, curated list, skim weekly, and jot patterns down in Notion or Sheets. Fancy tools help, but honestly the biggest win is just consistency and knowing *what* you’re looking for (hooks, cadence, CTAs), not tracking everything.",
          "score": 1,
          "created_utc": "2026-01-23 05:58:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj8q6h",
      "title": "At what point does ‘learning phase’ turn into avoiding responsibility?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qj8q6h/at_what_point_does_learning_phase_turn_into/",
      "author": "AdWrong9284",
      "created_utc": "2026-01-21 20:09:24",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 0.88,
      "text": "I think the learning phase is useful when you’re actively applying what you learn. It starts feeling like avoidance when you keep preparing but hesitate to take responsibility or make decisions. At some point, doing and making mistakes teaches more than staying in learning mode.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qj8q6h/at_what_point_does_learning_phase_turn_into/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0x1tow",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 20:09:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1005gn",
          "author": "ChestChance6126",
          "text": "That line usually shows up when there’s no feedback loop. If you’re learning and shipping something small, even if it’s rough, that’s progress. If you’re learning without a decision, a test, or a consequence tied to it, it’s probably avoidance. Responsibility starts the moment your choices can fail publicly or cost you time or money, and that’s when learning actually sticks.",
          "score": 3,
          "created_utc": "2026-01-22 05:53:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x3ynm",
          "author": "EarthPrimer",
          "text": "We need phrases like “learning phase” to help the client understand that results are not immediate. Otherwise we run the risk of, and I know this is rare, clients expecting unreasonable results. \n\nIs there an agreed upon timeline for the “learning period”? If not there should be.",
          "score": 2,
          "created_utc": "2026-01-21 20:19:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhs4xm",
      "title": "Anyone else hit the \"15 Client Wall\" where profit just... stops growing?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qhs4xm/anyone_else_hit_the_15_client_wall_where_profit/",
      "author": "_jitendraM",
      "created_utc": "2026-01-20 05:11:32",
      "score": 6,
      "num_comments": 7,
      "upvote_ratio": 0.8,
      "text": "I have been analysing why social media agencies specifically hit a **Scaling Ceiling** faster than almost any other service business.\n\nEarly growth is energising, but once you hit 15–20 brands, the \"Success Tax\" kicks in. Your revenue grows, but your operational leverage disappears.\n\n**I’ve mapped out the three main signs of the ceiling:**\n\n* **Hero Dependency:** You aren't scaling systems; you're scaling stressed-out people holding a mess together.\n* **Permission Bottleneck:** Your team spends more time on \"access troubleshooting\" than on actual creative strategy.\n* **The Margin Erosion:** Every new hire or client expansion triggers a software bill increase that eats your incremental profit.\n\nHas anyone successfully broken through this stage without just hiring more \"human buffers\" to manage the chaos? How are you handling the coordination tax?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qhs4xm/anyone_else_hit_the_15_client_wall_where_profit/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0m6utu",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 05:11:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m9ach",
          "author": "CaptainComplex6439",
          "text": "The 15-client wall is real, but it’s not about client count — it’s about **service design**.\n\nMost agencies scale *custom work*, not systems. The fix isn’t more people, it’s:\n\n* Productized offers\n* Fewer inputs/revisions\n* Default workflows instead of heroics\n\nMargins usually improve faster by **reducing variability and pruning low-leverage clients** than by adding headcount.",
          "score": 0,
          "created_utc": "2026-01-20 05:28:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mih1c",
              "author": "Federal-Bat-6893",
              "text": "most agencies would rather hire another account manager than admit their whole service model is fundamentally broken. The second you start treating clients like bespoke snowflakes instead of running repeatable plays, you're fucked at scale.",
              "score": 3,
              "created_utc": "2026-01-20 06:41:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0nz9rc",
                  "author": "_jitendraM",
                  "text": "You are not wrong. Bespoke chaos is what kills most agencies. Once every client has their own rules, timelines, platforms, and approval logic, headcount just becomes a patch for structural debt.",
                  "score": 1,
                  "created_utc": "2026-01-20 13:48:46",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0oyrc0",
              "author": "FirstPlaceSEO",
              "text": "thanks chatgpt for understanding the 15 client wall",
              "score": 3,
              "created_utc": "2026-01-20 16:43:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0nz0vb",
              "author": "_jitendraM",
              "text": "This is a really good point. I agree that service design and variability are a huge part of why agencies hit the wall.  \n  \nProductized offers, fewer revisions, and repeatable plays absolutely reduce chaos. \n\nWhat I’ve been noticing is that even agencies with standardised services still hit friction once publishing volume increases, especially in social.",
              "score": 1,
              "created_utc": "2026-01-20 13:47:25",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o0ty5cn",
              "author": "Sad_Reveal9288",
              "text": "the wall is real, but it’s 100% about how your service is built. If you want growth without chaos, you gotta stop selling custom chaos and start selling a clean, repeatable product.",
              "score": 1,
              "created_utc": "2026-01-21 10:21:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qjbg84",
      "title": "Internship by day, content freelancing by night",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qjbg84/internship_by_day_content_freelancing_by_night/",
      "author": "Interesting_Pie_6226",
      "created_utc": "2026-01-21 21:50:08",
      "score": 6,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "**Hey people,**\n\n**I’m starting an internship soon and I’m into content marketing. Learning is cool, but I also want to freelance on the side to earn some money and build real experience.**\n\n**I’m starting small — writing content, captions, content ideas, simple creatives. For those who’ve been there: how did you land your first paid content gig?**\n\n**Any platforms, hacks, or realistic advice?**",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qjbg84/internship_by_day_content_freelancing_by_night/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0xnzmk",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 21:50:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15i36h",
          "author": "AcanthisittaNo6174",
          "text": "Where are you best",
          "score": 1,
          "created_utc": "2026-01-23 00:53:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o15i3oh",
              "author": "AcanthisittaNo6174",
              "text": "Based",
              "score": 1,
              "created_utc": "2026-01-23 00:53:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o17mpm3",
          "author": "Minute-Recover-9702",
          "text": "Get in touch with a few small businesses to ask if you can do some work for them: write them a blog, create them some graphics. When you’ve got a few under your belt, you can use these as portfolio and reviews to get better paid gigs",
          "score": 1,
          "created_utc": "2026-01-23 09:47:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkrdaf",
      "title": "What are your chosen Multi-Channel Social Media Posting apps/sevices these days?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qkrdaf/what_are_your_chosen_multichannel_social_media/",
      "author": "focusedphil",
      "created_utc": "2026-01-23 13:52:53",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "As things have changed over the years, I was wondering what all you folks are using for your outgoing multi-channel SM tasks these days. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qkrdaf/what_are_your_chosen_multichannel_social_media/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o18ksoe",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 13:52:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19a7oa",
          "author": "daviswbaer",
          "text": "Hey Phil, I am the co-founder of a social media tool called OneUpApp.io\n\nwe support Instagram (including Stories, Reels, Trial Reels, collabs, and mixed media posts), TikTok, YouTube (including Shorts), Facebook, LinkedIn, Reddit, Threads, Bluesky, Pinterest, Snapchat, and Google Business Profiles.\n\nIn addition to scheduling, we also have client access, approvals, reporting, team collaboration, social inbox for replying to both comments and DMs, and social listening\n\nand our pricing is actually reasonable",
          "score": 8,
          "created_utc": "2026-01-23 15:57:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1abb0r",
              "author": "focusedphil",
              "text": "Thanks! I'll check it out!",
              "score": 1,
              "created_utc": "2026-01-23 18:44:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o18tq1j",
          "author": "ddskitt0629",
          "text": "Buffer and Metricool.",
          "score": 2,
          "created_utc": "2026-01-23 14:38:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o193yns",
          "author": "kubrador",
          "text": "buffer and later are the obvious picks if you want something that doesn't make you want to unalive yourself, though hootsuite still exists if you hate money and free time.",
          "score": 2,
          "created_utc": "2026-01-23 15:28:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o196621",
              "author": "focusedphil",
              "text": "I see Hoostuite has not changed much, then.",
              "score": 1,
              "created_utc": "2026-01-23 15:38:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o19cpy0",
          "author": "imnotafanofit",
          "text": "Facebook Creator Studio (Meta Business Suite). Free and handles FB and IG natively if you don’t want to pay for a fancy tool. But pick a tool that matches your stack. If IG + TikTok are your focus, make sure it schedules both well. ",
          "score": 1,
          "created_utc": "2026-01-23 16:08:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qn4cni",
      "title": "How do I gain more interactions and views for a government charity organisation?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qn4cni/how_do_i_gain_more_interactions_and_views_for_a/",
      "author": "shinebright9x",
      "created_utc": "2026-01-26 03:10:07",
      "score": 6,
      "num_comments": 18,
      "upvote_ratio": 0.88,
      "text": "I volunteer for a gov organisation doing their social media posts  but I dont know how to get more view and interactions. I want more young people to know about them but don’t know how to market them on TikTo. I’m currently using X but it’s not doing wel. \n\nThanks in advance ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qn4cni/how_do_i_gain_more_interactions_and_views_for_a/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1r1se1",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 03:10:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1r421v",
          "author": "Actual-Carrot-7183",
          "text": "X isnt great for young audiences. TikTok and IG Reels work much better.\n\nKeep it human: short videos, real stories, behind-the-scenes, and clear impact. Less perss-release, more authentic.",
          "score": 2,
          "created_utc": "2026-01-26 03:22:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1r8sbu",
              "author": "shinebright9x",
              "text": "Ik X isn’t great but that’s what the main office and the previous volunteer use but how do I create content for my organisation ?  I want to do it without showing myself. Like cartoon Ai videos or something that entertains but informs about the organisation? I actually want to use TikTok as well as X ",
              "score": 2,
              "created_utc": "2026-01-26 03:50:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1t71ao",
                  "author": "CautiousRuin392",
                  "text": "Wouldn't recommend using all AI it may seem inauthentic. And you can post the same videos on reels and tiktok to start - as for exactly what to post op it would help knowing what gov org space you're in",
                  "score": 1,
                  "created_utc": "2026-01-26 12:59:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1r8cy4",
          "author": "kubrador",
          "text": "x is basically a retirement home at this point so that tracks. tiktok's where the young people are, but you gotta actually be entertaining. government content is about as magnetic as a tax form. try posting behind-the-scenes stuff, user testimonials, or whatever your org actually does in a way that doesn't sound like it was written by a committee of lawyers.",
          "score": 1,
          "created_utc": "2026-01-26 03:47:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rcqsk",
          "author": "anajli01",
          "text": "Totally normal X is weak for discovery, especially for charities.\n\nFor TikTok:\n\n* Tell stories, not announcements (real people helped, volunteer POVs)\n* Use faces, not logos\n* Strong 2-second hooks (“Most people don’t know this service is free…”)\n* Educate first, mention the org at the end\n* Post 3–5 simple videos a week\n\nTikTok rewards usefulness + authenticity, not polished gov messaging.",
          "score": 1,
          "created_utc": "2026-01-26 04:14:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1vas06",
              "author": "shinebright9x",
              "text": "I don’t think those post suggestions are possible bc the org is very limited but I’ll ask about stories. ",
              "score": 1,
              "created_utc": "2026-01-26 18:49:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1sv8xw",
          "author": "levichambers_1",
          "text": "social media is tough for government charity orgs, but youth engagement is possible if the content feels real and human.. tiktok works best, short emotional videos, real impact stories, behind the scenes, or simple tips usually get views. avoid a corporate tone and use user style content, challenges, or duets with youth creators. x is mainly for awareness, so daily posts, hashtags, and quick replies to comments matter. even a small tiktok boost can increase reach a lot. authentic and youth focused content can usually increase engagement by 5 to 10x..",
          "score": 1,
          "created_utc": "2026-01-26 11:34:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tnspr",
          "author": "OldDepartment9591",
          "text": "Skip the word \"government\".",
          "score": 1,
          "created_utc": "2026-01-26 14:30:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1v9pzi",
              "author": "shinebright9x",
              "text": "Wdym",
              "score": 1,
              "created_utc": "2026-01-26 18:45:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1v9yrz",
                  "author": "OldDepartment9591",
                  "text": "No one would donate for a government institution. At least most people, so when promting your cause avoid using the word gov.",
                  "score": 1,
                  "created_utc": "2026-01-26 18:46:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qj0j8t",
      "title": "Traffic looked normal. Brand discovery through AI quietly dropped.",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qj0j8t/traffic_looked_normal_brand_discovery_through_ai/",
      "author": "SonicLinkerOfficial",
      "created_utc": "2026-01-21 15:15:24",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 0.86,
      "text": "**Our team still measures success by clicks.**  \nFair enough, that’s what our tools show us.\n\n*Enter AI and LLMs.*\n\nThe main issue is leadership frothing at the mouth to get cited on ChatGPT but at the same time thinking that just means **\"write more blogs\"**.\n\nNow, if a model doesn't pull the product, pricing, or eligibility into the short list or answer summary, there's nothing.  \nThe part that sucks is there's no indication anything's off; no impressions, CTR, and nothing in GA to warn you.\n\nMy concern is that by the time our organic traffic starts sliding or GA4 shows traffic from AI, it'll already be too late for us to earn that visibilty.\n\n*I’m not trying to optimize prompts here. I’m trying to understand why some sites get picked at all.*\n\nFew things I started trying in order to clear this up internally.\n\n**1. Separate selection from clicks**\n\nClicks are how humans behave.\n\nAI visibility is about getting cited.\n\nWhat are the main features/solutions of your business? Ask google and AI questions about that.\n\nPick queries where you show up in Google, but AI answers keep naming competitors and not you.\n\nIf that's happening, the model is choosing others during the retrieval phase. Ranking isn't where the focus should be, it's now about how your content is being extracted.\n\n**2. Compare rankings against AI citations**\n\nBuild a small set of queries where you are consistently top 5 on Google.\n\nEach week:\n\n* Ask the same questions in a few AI tools\n* Note which brands or products get mentioned\n* Ignore phrasing, just track presence\n\nIf your rankings stay the same but AI mentions start to drift, the issue is structural, not copy quality.\n\n**3. Watch for early signals**\n\nLook at the AI answers over time. These tend to show up first:\n\n* Pricing stops being named and turns into “varies” or disappears entirely\n* Different plans or variants merged into one generic option\n* Eligibility rules you clearly state never show up\n* A competitor framed as the default option\n\nAny of the above being present, means there are extraction problems.  \nThe system could not reliably pull the details from your website.\n\n**4. Fix the systems that are struggling, not the messaging**\n\n* Pages that render cleanly and fast\n* Clear resolution paths without JS-only disclosure or interaction gates\n* Explicit facts that survive truncation\n* Simple, machine readable structure\n\nTBH I didn't want to waste time creating more content, or reworking the messaging.\n\nThe move in traffic will happen down the road.  \nOnly looking at clicks is reacting after the damage is done.  \nRight now it just feels like citation comes before traffic, and we’re only set up to see the second part.\n\n\n\n**Please share how you guys have been reconciling traffic with visibility.**",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qj0j8t/traffic_looked_normal_brand_discovery_through_ai/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o0v85qe",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 15:15:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o166bau",
          "author": "Used_Rhubarb_9265",
          "text": "How we’ve been reconciling traffic with visibility is basically by assuming traffic is lagging data. By the time GA shows anything, the model’s already made its decision.\n\n\nWe now treat citations as the leading indicator and clicks as confirmation. That really mattered more than any tool. Meridian just made it easier to operationalize because it let us see citation patterns across prompts without living inside ChatGPT all day.",
          "score": 8,
          "created_utc": "2026-01-23 03:08:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}