{
  "metadata": {
    "last_updated": "2026-02-05 09:15:02",
    "time_filter": "week",
    "subreddit": "digital_marketing",
    "total_items": 20,
    "total_comments": 191,
    "file_size_bytes": 170867
  },
  "items": [
    {
      "id": "1qulkil",
      "title": "What AI marketing use case worked in production really well?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qulkil/what_ai_marketing_use_case_worked_in_production/",
      "author": "Mysterious-Age-4850",
      "created_utc": "2026-02-03 07:27:07",
      "score": 38,
      "num_comments": 15,
      "upvote_ratio": 0.94,
      "text": "Hi all- I am constantly seeing marketing AI tool talks everywhere from reddit to my linkedin feed! I obviously use ChatGPT but me and my team haven't been heavily using AI otherwise.\n\nȘo genuinely curious, have you tried other AI marketing use cases in production? If so, what AI marketing use case worked in production really well?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qulkil/what_ai_marketing_use_case_worked_in_production/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3azjke",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 07:27:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3b2mbk",
          "author": "StandardNecessary218",
          "text": "We were paying an agency for both SEO and writing blogs and content for our website to improve our Google ranking! Since then we have been able to using AI tools like Frizerlly to train AI on our business, product and search data to automatically create blogs on our website daily based on this! Results are comparable at this point! Similarly, we used to hire contractors to manually DMs on LinkedIN to our ideal customers and get them to schedule a demo with our team! Now AI tools are able to fully automate this process!",
          "score": 9,
          "created_utc": "2026-02-03 07:55:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3b4jnv",
          "author": "insidelightcone",
          "text": "Conversation intelligence tools have been the biggest win I've seen on the marketing side - specifically using call recordings to extract actual customer language for landing pages and emails. The difference between how your team describes value vs how customers describe their problems is huge, and AI can now surface those patterns across hundreds of calls pretty quickly.\n\n  \nThe other one that's worked well: AI-assisted content repurposing. Take one webinar or long-form piece and have it generate social snippets, email angles, etc. Still needs human editing but cuts production time significantly.",
          "score": 3,
          "created_utc": "2026-02-03 08:13:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bw7f3",
          "author": "Russ915",
          "text": "Honestly I’ve used it to save time on tasks I hate like reconciling billing and other administrative tasks. Ive used it for copy and landers too but they never quite get exactly what I want there so need more tweaking",
          "score": 2,
          "created_utc": "2026-02-03 12:22:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f2veh",
          "author": "KNVRT_AI",
          "text": "Most AI marketing tools are ChatGPT wrappers with interfaces. Real production wins come from integrating AI into existing workflows, not standalone tools.\n\nEmail subject line optimization using AI to generate variations then A/B testing them performs well. Tools like Seventh Sense or native ESP features help with this.\n\nAd copy generation at scale for testing. Generate 20 headline variations, test them, double down on winners. Saves time versus manually writing every variation.\n\nContent repurposing where you take one piece, use AI to create social posts, email snippets, different formats. Speeds up distribution without sacrificing quality if you edit outputs.\n\nCustomer support chatbots that actually work handle common questions, free up human agents for complex issues. Intercom and Zendesk AI features do this decently.\n\nPredictive analytics for lead scoring or churn prediction. AI models trained on your data identify patterns humans miss. Built into HubSpot, Salesforce, or custom with data science teams.\n\nPersonalization at scale in email or web content. Dynamic content blocks adjusted per user segment based on behavior. Tools like Dynamic Yield or Optimizely use AI for this.\n\nOur clients see best results using AI for high volume repetitive tasks that benefit from variation, copywriting, image generation, data analysis. Not for strategy or relationship building.\n\nThe production wins are incremental efficiency gains, not revolutionary changes. 20% faster content production, 15% better email performance, slightly better targeting.\n\nWhat doesn't work well is using AI for anything requiring deep business context, brand voice consistency, or strategic thinking. Outputs are generic without heavy human oversight.\n\nChatGPT for drafting is table stakes. Beyond that, focus on tools that integrate with platforms you already use versus adding new standalone AI products.\n\nTesting frameworks matter more than AI tools. Generate variations with AI, test systematically, scale winners. The AI part is easy, the discipline of testing is what drives results.\n\nMost teams overestimate AI capabilities and underutilize what they have. Master using ChatGPT effectively for your specific use cases before buying specialized tools.\n\nThe honest answer is AI helps with execution speed and variation generation but doesn't replace marketing fundamentals. Use it to do more of what already works, faster.",
          "score": 2,
          "created_utc": "2026-02-03 21:45:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3chwwd",
          "author": "PeopleLoveAI",
          "text": "yo, most people think of AI for copy or seo stuff, which is cool, but for me, the biggest win in production has been for ad creatives. especially static ads. the constant need for new creative variations to beat ad fatigue and keep cpms low is a huge bottleneck for most performance marketers. i used to spend so much time just making slight changes or new hooks in canva or photoshop. with AI, i can now generate dozens of high-quality static ad variants in minutes, ready for testing. this completely changed my testing velocity and overall ad performance.\n\n\n\nthats actually why i built trydooken(.)com, because i personally needed a tool that specifically solved this creative production issue for static ads. it's been a game changer for keeping our campaigns fresh and performing. if creative production is a bottleneck for you, i'd definitely look into AI for that.",
          "score": 1,
          "created_utc": "2026-02-03 14:30:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cpp5h",
          "author": "Pure_Data3489",
          "text": "After testing a bunch “AI for marketing” ideas,  most didn’t survive contact with real clients.\n\nThe ones that *actually* work  are:\n\n• **AI-assisted ad testing** \\--using AI to generate multiple ad angles/hooks *from real past winners*, not from scratch. Reduced testing time a lot.  \n  \n• **Content repurposing pipelines** \\--long-form → emails → LinkedIn posts → short scripts. N\n\nI’ve been documenting such AI  use cases for agencies . Happy to share more if anyone’s interested.",
          "score": 1,
          "created_utc": "2026-02-03 15:10:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3da6rj",
          "author": "nrseara",
          "text": "Concierge agent bot expert in our business to guide them through whatsapp over our main transactional flows",
          "score": 1,
          "created_utc": "2026-02-03 16:47:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gm8ii",
          "author": "Low_Dragonfly2677",
          "text": "AI-powered content optimization and SEO (using AI to analyze search intent, optimize pages, and continuously improve rankings) has worked extremely well in production because it delivers measurable traffic and conversion gains without disrupting existing workflows.",
          "score": 1,
          "created_utc": "2026-02-04 02:42:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3h3eda",
          "author": "KONPARE",
          "text": "For us the stuff that actually “stuck” in production wasn’t flashy.\n\nAI for support and sales enablement was the biggest win: turning call notes and tickets into clean FAQs, objection answers, and reply templates, then humans just tweak and send. Also ad and landing page iteration, generating variants fast and testing them, not publishing raw output.\n\nEverything else (full autonomous campaigns, “AI decides the budget,” etc) has been hit or miss and usually needs more babysitting than people admit.",
          "score": 1,
          "created_utc": "2026-02-04 04:26:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3o2r5e",
          "author": "nicinionly",
          "text": "Yes- TBH very effective and cost cutting for marketing.",
          "score": 1,
          "created_utc": "2026-02-05 05:23:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ooey1",
          "author": "Pitiful-Bowler3282",
          "text": "Ok see for marketing everyone thinks ChatGpt is best but no\n\nClaude is better than Chatgpt for content writing or script writing because of its Skill feature\n\nOne just needs to set a claude skills for content writing and it will give 10x better script than chatgpt",
          "score": 1,
          "created_utc": "2026-02-05 08:32:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qsrb0w",
      "title": "reddit marketing agency - any saas focused ones?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qsrb0w/reddit_marketing_agency_any_saas_focused_ones/",
      "author": "0ctaviusRex",
      "created_utc": "2026-02-01 06:53:21",
      "score": 22,
      "num_comments": 96,
      "upvote_ratio": 0.87,
      "text": "I need to vent a little here but also ask for some help because I'm at my wit's end with marketing.\n\nI'm a solo dev running a SaaS that helps local service businesses (think cleaning businesses, plumbers, etc) streamline their hiring process. Before using my product, these businesses have 0 processes in place and after they are able to hire in about half the time.\n\nI have been able to grow to 1.3k MRR by providing helpful posts and comments in local service specific subreddits but have hit a wall with my account being shadow banned and comments removed (even when they were genuinely helpful). Reddit has my customers but I can't seem to reach them effectively.  \n\n\nI am looking for a reddit marketing agency that understands reddit much more than I do and helps SaaS businesses specifically. Unsure of how these services are priced so any clarity there would be great as well.",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qsrb0w/reddit_marketing_agency_any_saas_focused_ones/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2xj5lc",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 06:53:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ioblc",
          "author": "Electronic-Ad9854",
          "text": "I know about Red⁤accel. Chatgpt reccommended them when I was researching reddit marketing agencies for my tool. Didn´t try it yet, but looks promising.",
          "score": 6,
          "created_utc": "2026-02-04 12:23:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xofv3",
          "author": "pmagi69",
          "text": "I would like to know what you did to be shadowbanned. Did you copy-paste the same post or comment a lot of times?",
          "score": 3,
          "created_utc": "2026-02-01 07:40:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2y471y",
              "author": "rahulroy",
              "text": "Would like to understand this as well. Reddit has always been sensitive about marketing and spam, and lately it feels like a lot of subs are pushing back harder.\n\nRecently, I was heavily downvoted just for participating in the discussion. My comment wasn’t promotional at all. I only mentioned that I’m a builder in the relevant space to add context and share a builder’s perspective.\n\nHonestly, it was one of the most unwelcoming experiences I’ve had on Reddit, which was surprising given that the thread was meant to be a discussion.\n\nI think, reddit is onto builders and they might want to push people towards paid ads.",
              "score": 4,
              "created_utc": "2026-02-01 10:06:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2yf54h",
                  "author": "pmagi69",
                  "text": "Yeah, well, it's not really Reddit. It's mostly the users that are sensitive. And of course you can get banned, but that is usually from a subreddit. And then you can also be banned from the whole of Reddit. I don't really know how that works. That's probably heavy abuse. So yeah, I would love to have a link to see where you get all the downvotes. It's interesting to see that.",
                  "score": 1,
                  "created_utc": "2026-02-01 11:44:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2xrksi",
          "author": "Murky_Maximum1472",
          "text": "I had a similar issue when trying Reddit ads. For us, Google Ads worked better initially, then we tested Reddit once we understood the audience…",
          "score": 2,
          "created_utc": "2026-02-01 08:09:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xy0su",
          "author": "Appropriate-Age-5790",
          "text": "The good ones focus on trust-building, organic discussions, and long-term presence ",
          "score": 2,
          "created_utc": "2026-02-01 09:09:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o319k1j",
          "author": "Quiet_Blackberry7493",
          "text": "Okay understand that Saas audience is one of the biggest and oldest on reddit which also makes them vulnerable to spam and bot comments, so it's understanable why these communities are highly skeptical and smell promo stuff from miles away, I run organic campaigns for a lot of different industries here, and out of all the industries that I work with, SaaS was def a league of its own in terms of complexity and getting the tone right but you see once I understood the language they speak, and studied a lot of examples on how saas brands operate here, I figured it out. \n\nSo if you want to do that, go through company run subreddits and see how founders speak to their audience, for example one of fave subreddit is r//framework they have done a great job at building a community here, spend time understanding one subreddit at a time and get familiar with no intent of promotion till you are an established member of the sub, only then will it be easy to not be downvoted, also dont comment rapidly that's one of the reasons u get labeled as a bot and potentially shadowbanned. \n\nIf you are aiming for reddit organic then be prepared to spend a few months building visibility, it's long but it has compunding returns, u just gotta be patient. And if you are getting DMs from reddit agencies please evaluate them carefully cuz anyone promising quick results will get your domain or brand name banned from the whole platform, understand their approach well before deciding, most of my clients get burned when they get promised leads and visibility in a month and have their whole domain banned on here cuz of the agency's spam acitivtity.",
          "score": 2,
          "created_utc": "2026-02-01 20:36:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37r4nw",
              "author": "RedditforBusiness",
              "text": "Your first observation is actually a really important thing to note when it comes to understanding B2B SaaS on Reddit. We share insights on how Reddit operates from an organic community perspective (be genuine, form long-term community relationships on a human level, be helpful) but the history of the audience also very much matters.\n\nAnd with that, like you're saying, being a valuable and insightful member of the community is the most important aspect of this field, first and foremost. The regular interpretations of driving sales with common tactics you see on social media don't apply the same way on Reddit, and setting that expectation is key to measuring your success in a timeframe.",
              "score": 2,
              "created_utc": "2026-02-02 20:02:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o31bp4x",
          "author": "Impossible-Double-53",
          "text": "Totally get this — Reddit is a weird beast for advertising. What’s worked better for me (also SaaS) is treating Reddit less like an ad channel and more like a research + credibility channel. We focused on genuinely answering questions in niche subs, then paired that with Google Ads for high-intent traffic.\n\nIf you *do* want paid, Reddit Ads can work but only with very tight targeting and non-salesy creative. Facebook/LinkedIn were more predictable for us. I haven’t found many Reddit-marketing agencies that are truly SaaS-focused tbh — most seem better at ecom. Curious if anyone’s actually had a good experience with one.",
          "score": 2,
          "created_utc": "2026-02-01 20:47:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xn37o",
          "author": "No-Boat-5517",
          "text": "Would love to discuss more on this !\nHappy to help and collaborate",
          "score": 1,
          "created_utc": "2026-02-01 07:28:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xog68",
          "author": "[deleted]",
          "text": "Totally relatable. Reddit ads are confusing and users hate obvious promotion. I’ve had better luck either posting organically in relevant subs or just skipping Reddit and using Google Ads or Facebook/IG where targeting and intent are clearer.",
          "score": 1,
          "created_utc": "2026-02-01 07:40:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xx1m0",
          "author": "Jaxyndamere",
          "text": "We could explore google ads, cold calling as well. Check your DM",
          "score": 1,
          "created_utc": "2026-02-01 09:00:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2y6n2i",
          "author": "iGrowJazzCigarettes",
          "text": "Maybe use paid ads instead of spamming subreddits",
          "score": 1,
          "created_utc": "2026-02-01 10:28:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2y9lig",
          "author": "lnjsl5465",
          "text": "Reddit can be strict, even when you're genuinely trying to help. There are agencies and marketers who specialize in Reddit marketing and understand the platform's nature and how to grow SaaS products without getting banned. They often offer services like strategy development, posting, engagement, and ensuring compliance with Reddit's rules.",
          "score": 1,
          "created_utc": "2026-02-01 10:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yg9w5",
          "author": "HauntingAd8264",
          "text": "Shadowbans usually happen because you’re triggering spam filters by being the sole source of your own promotion. Even if you're helpful, mods see it as a conflict of interest.\n\nI run a small organic Reddit marketing agency, and the \"wall\" you hit is common for founders. The secret isn't posting more; it’s about being truly helpful and giving genuine solutions before mentioning your product. \n.",
          "score": 1,
          "created_utc": "2026-02-01 11:54:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zubhr",
          "author": "Mushy-Mushroom12",
          "text": "I’m in the same boat tbh. Reddit feels powerful but also really hard to crack as a business owner because most subs are super anti-promotion. What helped me a bit was shifting focus to platforms that are more ad-friendly — Google Ads for high-intent searches and Facebook/Instagram ads for testing creatives and audiences. Reddit Ads can work too, but only if you treat it like community targeting rather than direct selling. Sometimes it’s less about forcing Reddit to work and more about using it alongside other channels.",
          "score": 1,
          "created_utc": "2026-02-01 16:40:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34wv5u",
          "author": "Status-Opinion7989",
          "text": "I had the same issue with Reddit, worked at first then became super unpredictable. What helped me was testing Google search ads and Facebook targeting business owners instead of relying only on organic Reddit traffic. Much more stable long-term.",
          "score": 1,
          "created_utc": "2026-02-02 11:01:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36gdhp",
          "author": "REALMRBISHT",
          "text": "we tried reddit on our own first and honestly got burned a couple of times. posts got removed, comments were ignored, and it was hard to tell where we were going wrong. We eventually worked with Infrasity, and the biggest difference was that they spent time understanding the product before posting anything. Instead of pushing links, they helped us answer questions in threads our ICP already cared about. Over a few weeks, we started seeing inbound traffic and people mentioning us organically. It felt slower, but way more sustainable",
          "score": 1,
          "created_utc": "2026-02-02 16:28:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36yajj",
          "author": "sh4ddai",
          "text": "Hey I run OutreachBloom and we do Reddit marketing for SaaS. We run our own SaaS so we know the ins and outs. Happy to help if you want!",
          "score": 1,
          "created_utc": "2026-02-02 17:50:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bgxg1",
          "author": "Money_Run5907",
          "text": "Totally get your struggle—Reddit marketing isn’t intuitive at all. If organic posting feels confusing, you might try running small test campaigns on Google Ads or Meta (Facebook/Instagram). They’re easier to target and scale, and you can come back to Reddit once your offer and audience are clearer.",
          "score": 1,
          "created_utc": "2026-02-03 10:14:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3e0x6g",
          "author": "WeddingLivid8003",
          "text": "You must first understand the audience before testing reddit",
          "score": 1,
          "created_utc": "2026-02-03 18:48:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hcfem",
          "author": "Klutzy-Pin-5007",
          "text": "Yeah I feel this. I’m running a small SaaS too and did the whole “helpful comments” thing for a while. It worked at first, then suddenly posts got removed and reach dropped.\n\nReddit is weird. Once they think you’re promoting, even if you’re not, it’s kinda over. What helped me was not relying on it alone. I started using Google ads + FB/insta + some Reddit ads. Not perfect, but way more stable... also building an email list helped a lot.\n\nBtw 1.3k MRR solo is solid, respect.",
          "score": 1,
          "created_utc": "2026-02-04 05:29:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i5ksh",
          "author": "gawiz93",
          "text": "I run a productised Reddit agency for B2B companies but given your scale, hiring an agency might constrain your resources. I would suggest you start tracking conversations and keywords using tools such as F5bot (free), Vobbit (7 free keywords - my product). Find good relevant conversations, help the users and build goodwill. \n\nCan you share what comment got you shadow banned? Also how old was your account? Were you doing this manually or automated? Were you doing it excessively?",
          "score": 1,
          "created_utc": "2026-02-04 09:46:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3k92rg",
          "author": "heavybass1",
          "text": "Amigo, estoy en la misma situación que tu y he estado buscando en foros ayuda, espero tambien encontrar algo de ayuda por aqui.",
          "score": 1,
          "created_utc": "2026-02-04 17:15:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nvmx3",
          "author": "Aisha_Gupta12",
          "text": "You opened this by saying you need to \"vent a little,\" and ironically, that energy is probably why you grew early on, not the \"helpful\" posts. The algorithm and mods don't hate marketing, they hate the sanitized feel of it.  \nWhen you're just a dev screaming into the void about cleaning businesses having 0 processes, it feels real. As soon as you try to professionalize that into a strategy or hand it off to a firm, the momentum just dies because the chaos is gone.",
          "score": 1,
          "created_utc": "2026-02-05 04:33:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq8dib",
      "title": "Posting daily destroyed my confidence and fixing one thing brought it back",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qq8dib/posting_daily_destroyed_my_confidence_and_fixing/",
      "author": "Due_Employment_829",
      "created_utc": "2026-01-29 13:21:08",
      "score": 17,
      "num_comments": 12,
      "upvote_ratio": 0.91,
      "text": "Used to love making videos. Now I dread posting because I know it's probably going to fail. Posted daily for 6 months. Most videos died under 500 views. Few random ones hit 2k to 3k. No pattern I could see.\n\nStarted second guessing everything. Is my personality boring? Is my voice annoying? Am I just not entertaining enough? Stopped enjoying the process. Just felt anxious and defeated.\n\nHit my breaking point 2 weeks ago. Either figure out what's wrong or quit. Looked at my retention graphs for real this time. Not just glanced. Actually studied them.\n\nEvery video that died lost people at second 7 to 9. Every video that worked held people past second 10. Watched what I was doing between second 7 and 9 in my failed videos.\n\nPausing. Visual not changing. Still explaining instead of showing. Watched what I was doing in my successful videos. Moving fast. Visual changing. Delivering value immediately.\n\nFixed my failed videos' problems. Made everything like my successful ones. Next 5 videos all hit over 15k views. My confidence came back immediately.\n\nHere's what fixed it for me.\n\n**Lack of confidence comes from not knowing why you're failing.** When you don't know what's wrong you start thinking everything's wrong. You're not. Something specific is wrong and you just can't see it.\n\n**Success builds confidence faster than anything.** One video that works because you actually knew how to fix it matters more than ten motivational posts. Fix what's broken. Post something that works. Confidence returns.\n\n**You need to see your blind spots.** I couldn't see my pauses were too long. I couldn't see my visuals were too static. They felt normal to me. I needed external feedback that was specific not just \"make better content.\"\n\n**Get something that shows you the actual problem.** Started using TikAlyzser that tells you exactly what's wrong with your videos and what to change to get more views. Second 8 pause 1.5 seconds visual static 6 seconds. Then I knew exactly what to fix. Not guessing. Knowing.\n\n**Post with confidence because you already fixed what would have killed it.** Now I post knowing it's going to work because I caught the problems before they went live. That confidence shows in my content. People can tell.\n\nLast 12 videos all over 10k views. Confidence is completely back. Enjoying creating again.\n\nIf posting fills you with dread instead of excitement something's broken and you don't know what it is. Fix that first. Confidence comes back fast after that.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qq8dib/posting_daily_destroyed_my_confidence_and_fixing/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2emgb0",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 13:21:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2io9oe",
          "author": "bodhisattvass",
          "text": "**The Poop That Took a Pee**\n\nBy: Leopold \"Butters\" Stotch\n\n**Chapter 1**\n\nDouglas had to poop. His butt was all stinky because he had to poop so badly. There was a gross woman named Rebecca who was sunbathing all naked, and she was fat. Douglas walked up to her and said, \"I need to poop.\" \"Okay,\" Rebecca replied, \"I like poop.\" Douglas squatted down over the fat sunbathing lady and went poop. The poop sat there on Rebecca's boobs looking like a wiener.\n\n**Chapter 2**\n\n\"Why are we here?\" Douglas cried as poop came out his wiener in a long, thin strip. It was wiener poop, which is the grossest poop of all. The pee-pee got on the woman's leg and she screamed, pooping out her boobs. And so when the pee got mixed with the poop it smelled like a butt. And the poop and the pee lived happily ever after. \n\n**THE END**",
          "score": 4,
          "created_utc": "2026-01-30 01:06:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hbvfg",
          "author": "AnUglyGuy89",
          "text": "I'm going to apply some of youre advice, sounds interesting",
          "score": 2,
          "created_utc": "2026-01-29 20:58:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2it1oc",
          "author": "Rich-Editor-8165",
          "text": "If you're feeling stuck with your content, figure out exactly what's going wrong instead of guessing. This person used a tool to identify pacing and visual issues, then made fixes. Once they did, their views shot up. The key is fixing what's broken, posting confidently, and letting success boost your confidence.",
          "score": 1,
          "created_utc": "2026-01-30 01:32:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2j00y1",
          "author": "Sad-Butterfly-4299",
          "text": "This really resonated with me. What you described is exactly how confidence erosion actually happens — not from “lack of discipline,” but from **lack of clarity**.\n\nWhen you don’t know *why* something fails, your brain fills in the gaps with self-blame. Personality, voice, intelligence, talent — everything becomes suspect. That’s brutal mentally, especially when you’re doing the “right” thing by showing up daily.\n\nWhat stood out most is the **specificity** of the fix. Second 7–9 drop-off, static visuals, pausing too long. That’s actionable. “Make better content” never helps anyone — knowing *what moment loses people* does.\n\nI also think your point about confidence being a **byproduct of competence** is underrated. Motivation doesn’t fix confidence. Seeing something work because you understood and corrected a real issue does.\n\nCurious question for you:  \nDo you think posting daily helped you gather enough data to spot the issue, or do you think daily posting actually masked the problem for too long?\n\nReally solid breakdown. Thanks for sharing this.",
          "score": 1,
          "created_utc": "2026-01-30 02:11:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2j8i57",
          "author": "Competitive-Bee-8604",
          "text": "I’ve been in a very similar spot to what you described.  For about two years, I tried to post consistently on Instagram—mostly infographics, across multiple different pages and I eventually completely burned out and walked away from it.\n\nReading your breakdown of how you used retention data and specific seconds in the video to pinpoint what was actually going wrong really resonated with me.  It’s so encouraging to see you fix the problem and rebuild your confidence!\n\nA part of me wishes I had the same level of clarity and confidence back then, but this post is a genuine inspiration and makes me want to come back to content with a more analytical, less self‑blaming mindset.",
          "score": 1,
          "created_utc": "2026-01-30 02:58:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l5ixq",
          "author": "ChestChance6126",
          "text": "This is a really good example of separating identity from mechanics. You weren’t “bad at content,” you had a very specific retention leak early on. When creators don’t know the cause, they personalize the failure, and their confidence tanks. Once you tied outcomes to a concrete behavior, pauses, and visuals in the first 10 seconds, it became a fixable system problem, not a self worth problem. That’s usually where confidence actually comes from, knowing what lever to pull.",
          "score": 1,
          "created_utc": "2026-01-30 11:49:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pqe5m",
          "author": "Imaginary-Fall1983",
          "text": "Great",
          "score": 1,
          "created_utc": "2026-01-31 01:32:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f97or",
          "author": "PutridWin2070",
          "text": "Looking at the data is so important! It tells you what you need to do to fix or improve things",
          "score": 0,
          "created_utc": "2026-01-29 15:17:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gorm6",
          "author": "Mrqzz",
          "text": "Interesting post",
          "score": 0,
          "created_utc": "2026-01-29 19:08:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qto0b0",
      "title": "Is marketing more about problem-solving or persuasion?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qto0b0/is_marketing_more_about_problemsolving_or/",
      "author": "AdWrong9284",
      "created_utc": "2026-02-02 06:57:21",
      "score": 15,
      "num_comments": 24,
      "upvote_ratio": 0.89,
      "text": "I think marketing is more about problem-solving. Persuasion matters, but if you’re not solving a real customer or business problem, no amount of clever messaging really works in the long run.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qto0b0/is_marketing_more_about_problemsolving_or/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o346wdv",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 06:57:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35ea1g",
          "author": "LeadGenDotCom",
          "text": "I would argue that marketing is more about uncovering needs (i.e finding problems.)",
          "score": 2,
          "created_utc": "2026-02-02 13:12:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o376gpq",
              "author": "Confident-Smile-7161",
              "text": "Completely agree",
              "score": 1,
              "created_utc": "2026-02-02 18:27:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o34n92b",
          "author": "eolithic_frustum",
          "text": "You still have to persuade a prospect that you can solve their problem... Who cares about your ability to problem solve if you can't get the message out that you've done so, and done so effectively. ",
          "score": 1,
          "created_utc": "2026-02-02 09:31:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34oynk",
          "author": "kubrador",
          "text": "persuasion is literally how you convince someone they have a problem in the first place, so this is kinda like saying cooking is more about ingredients than heat.",
          "score": 1,
          "created_utc": "2026-02-02 09:48:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o373cs4",
              "author": "Confident-Smile-7161",
              "text": "To offer an alternative perspective to that. If you are really solving a problem that people have (problem based marketing) then anyone you have to persuade they have that problem isn't your target audience.  \n  \n100% respect on your opinion, obviously there is no one correct way to marketing. Can I get your opinion on my alternative perspective? What do you think of marketing based 100% around problem solving?",
              "score": 1,
              "created_utc": "2026-02-02 18:13:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o378659",
                  "author": "kingofmeta123",
                  "text": "You’re basically channeling demand that already exists. In that case persuasion isn’t required. It’s just addressing the concerns they already have. \n\nProblem solving literally means addressing those concerns in a way that makes it easy for them to visualize the outcome of a purchase. \n\nSo for example if I’m selling a chair. I’m showing different angles on how the chair will maximize their comfort. \n\nI’m showing the quality of the material, what it’s made of and why it makes your sitting experience worth while. \n\nSo in essence we are helping them visualize what sitting on the chair would look like before they can actually experience it post purchase. \n\nYou cannot experience it without buying it unless you go to an actual physical store. So giving them a physical store experience in a matter of minutes is what I’d call problem solving.",
                  "score": 1,
                  "created_utc": "2026-02-02 18:35:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o351d4f",
          "author": "That-Travel-5697",
          "text": "I think it is about both you need to solve a problem but also be able to persuade someone if they are on the fence about buying",
          "score": 1,
          "created_utc": "2026-02-02 11:40:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35ovk2",
          "author": "Sad-Butterfly-4299",
          "text": "I mostly agree with you.\n\nProblem-solving is the foundation. If there isn’t a real problem or unmet need, persuasion can create short-term attention but it doesn’t hold up long-term.\n\nThat said, I think persuasion still plays a role — not in convincing people to want something they don’t need, but in helping them recognize *why* a solution matters and how it fits their situation.\n\nIn practice, the best marketing I’ve seen feels like this:  \nproblem first, clarity second, persuasion last.\n\nWhen the problem is real and clearly understood, the persuasion part becomes much lighter and more about guidance than pressure.",
          "score": 1,
          "created_utc": "2026-02-02 14:13:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36dhnp",
          "author": "Salamandra_UK",
          "text": "Totally agree. Persuasion is the delivery but problem-solving is the foundation. If there’s no real pain being solved, the best copy in the world won’t save it long-term.",
          "score": 1,
          "created_utc": "2026-02-02 16:15:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o371bvo",
          "author": "Confident-Smile-7161",
          "text": "I vote problem solving all the way. Persuasion is for snake oil.   \nOf course people have questions and concerns, but I wouldn't think of that as persuasion, It should be a open and honest approach. marketing based around solving a real problem and aiming to help real people in a clear and open exchange, is the strongest way to get seen by your audience to start build authority and trust. After authority and trust have been built through providing value driven content. \n\n*Done right there will be no need for persuasion, instead it will be your recommendation the audience values.*\n\nAgain I want to stress that of course there is room for strategy and tactics (tricks of the trade if you will) but persuasion based marketing will either give you no yield  or bite you in the arse down the road. (in the form of complaints, refunds, bad reputation, etc)",
          "score": 1,
          "created_utc": "2026-02-02 18:04:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o382qf5",
          "author": "Luc_ElectroRaven",
          "text": "99% of marketing is persuasion - business itself is about problem solving but most marketers do not solve anything. it can in theory and I think the best businesses come from the best marketers because they get they should make products people want, then the persuasion takes care of itself but most marketing is 'change the copy and images to make this sound cool\"",
          "score": 1,
          "created_utc": "2026-02-02 20:57:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3acfod",
          "author": "Responsible-Pitch363",
          "text": "Persuasion. No one is taking the product back into development just to do a better job. That’s what designed obsolescence is for. You take the money to solve a problem, then move the goal post and sell them on an upgrade. Does it really matter if the problem is solved?",
          "score": 1,
          "created_utc": "2026-02-03 04:24:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3azcrc",
          "author": "pra__bhu",
          "text": "This resonates. I've spent 14 years in software and the pattern is always the same - the products that win are the ones where customers say \"finally, someone fixed this\" not \"that's a clever ad.\"\n\nCurrently validating a side project and the most valuable signal has been finding people who've already built janky workarounds - spreadsheets, manual processes, duct-taping 3 tools together. They've already validated the problem with their time. My job is just to make it less painful.\n\nThe best \"marketing\" at that point is just describing their problem back to them accurately. They sell themselves.",
          "score": 1,
          "created_utc": "2026-02-03 07:25:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cbxvw",
          "author": "ScholarNew1109",
          "text": "They both go hand in hand, marketing wouldn't work without persuasion.",
          "score": 1,
          "created_utc": "2026-02-03 13:58:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cjg1l",
          "author": "Tight_Tree8390",
          "text": "Both, but in a specific order.\n\nProblem-solving comes first. If you don’t understand the real problem, no amount of persuasion works long-term. You might get clicks, but not trust or repeat customers. Persuasion is what helps people act once the solution is clear. Good marketing makes someone think “this fits my situation” and then lowers the friction to choose it. The best marketing feels persuasive only because the problem was understood so well :) ",
          "score": 1,
          "created_utc": "2026-02-03 14:38:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3diwuu",
          "author": "Yapiee_App",
          "text": "I’ve found persuasion works best as a multiplier, not a substitute. If the underlying problem isn’t real or urgent, great messaging just creates short-term curiosity, not lasting traction.",
          "score": 1,
          "created_utc": "2026-02-03 17:27:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f1l89",
          "author": "NevenCucadotcom",
          "text": "marketing is persuading a customer he has a problem and offering a solution",
          "score": 1,
          "created_utc": "2026-02-03 21:39:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3h1ufl",
          "author": "Maximum_Marketing123",
          "text": "It has to be both. First, you need to tell the buyer that their problem can be solved in a particular way. And then persuade them that you are the best brand/person to solve that problem.",
          "score": 1,
          "created_utc": "2026-02-04 04:16:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i31qa",
          "author": "LaunchLabDigitalAi",
          "text": "Marketing starts with problem-solving, and persuasion only works once that foundation is real. If there is not a genuine customer problem being addressed, persuasion just becomes noise or short-term manipulation. The best marketing usually feels persuasive because it clearly understands the problem, names it better than the customer can, and shows a credible path to solving it. In that sense, persuasion is more like the delivery mechanism, while problem-solving is the substance. Long-term results tend to come from getting the problem right first, not from being clever with words.",
          "score": 1,
          "created_utc": "2026-02-04 09:22:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3il6p6",
          "author": "Bob-Roman",
          "text": "It’s about establishing trust.  A brand is a promise of trust.\n\nMost of the folks I work with will tell you their business reputation is their single most valuable asset.",
          "score": 1,
          "created_utc": "2026-02-04 12:01:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3n9ryq",
          "author": "Tudragon123456",
          "text": "I think your dead on—marketing's core is solving problems, persuasion is just wrapping papper around that solution. One thing that helpped me is actually interviewing customers befoe building campaigns to find what frustrates them most—you'd be suprised how much it shapes",
          "score": 1,
          "created_utc": "2026-02-05 02:20:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ofoyk",
          "author": "Vinaya_Ghimire",
          "text": "I think marketing is more about persuasion. If you can persuade people to believe that they have problems and your product/service is the answer, you can have conversions.",
          "score": 1,
          "created_utc": "2026-02-05 07:11:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqyqyn",
      "title": "Anyone else trying to figure out GPT ads and how they will affect brand perception?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qqyqyn/anyone_else_trying_to_figure_out_gpt_ads_and_how/",
      "author": "feliceyy",
      "created_utc": "2026-01-30 07:20:27",
      "score": 13,
      "num_comments": 23,
      "upvote_ratio": 0.93,
      "text": "Still trying to understand this shift. When Google rolled out AI Overviews and started pushing sponsored results deeper into the flow, it completely changed how I expected people to find my brand. And also not in a way I felt ready for. \n\nNow that GPT ads will appear directly in conversations, I feel both curious and cautious. I want to stay ahead of competitors, but I’m unsure how intrusive these placements might feel to users. I’m trying to figure out whether leaning into these conversational ads could boost visibility or risk coming across as forced. How about you?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qqyqyn/anyone_else_trying_to_figure_out_gpt_ads_and_how/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2karaa",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 07:20:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l6em8",
          "author": "EnvironmentalFact945",
          "text": "It’s less about “ads” and more about how AI frames your brand in answers. That framing sticks. We’ve been auditing how we’re described across sources and testing tools that monitor AI mentions. Stuff like limy ai have been helping us shape how often and strategic our brand appears in AI searches. Also, we're in its GPT ads waiting list to test if such advertisement will make our business more selectable and visible. Early days, but brand narrative inside AI feels important.",
          "score": 2,
          "created_utc": "2026-01-30 11:56:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2lafe6",
              "author": "feliceyy",
              "text": "Sure, brand mentions in ai searches is key and businesses need to know where such traffic is coming from. I'm surprised there are tools have already implementing such ads in their system.",
              "score": 1,
              "created_utc": "2026-01-30 12:24:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kf0a0",
          "author": "Sea_Mirror1453",
          "text": "following",
          "score": 1,
          "created_utc": "2026-01-30 07:57:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2khsn1",
              "author": "feliceyy",
              "text": "stay tuned!",
              "score": 1,
              "created_utc": "2026-01-30 08:22:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ki7qg",
          "author": "bambidp",
          "text": "I feel like this is overhyped. Most people still don’t trust AI answers blindly.",
          "score": 1,
          "created_utc": "2026-01-30 08:26:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kjt3z",
              "author": "feliceyy",
              "text": "I know. Some people are still skeptical about AI recommendations.",
              "score": 1,
              "created_utc": "2026-01-30 08:40:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kno20",
          "author": "filename_tbd",
          "text": "I'm also interested. I could see it going both ways, either incredibly annoying and ignored or accepted as a convenient answer... which way are you leaning now?",
          "score": 1,
          "created_utc": "2026-01-30 09:16:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kqp3v",
              "author": "feliceyy",
              "text": "I'm thinking of giving it a benefit of doubt- becoming a convenient answer.",
              "score": 0,
              "created_utc": "2026-01-30 09:43:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ksys9",
          "author": "Snaddyxd",
          "text": "Low key I think this will matter more for unknown brands than big ones. If AI summaries define you before someone visits your site, perception gets shaped faster and you don’t fully control it.",
          "score": 1,
          "created_utc": "2026-01-30 10:04:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kzgaa",
              "author": "feliceyy",
              "text": "I love your school of thoughts, unknown brands might take advantage of these ads and position themselves better in the market.",
              "score": 1,
              "created_utc": "2026-01-30 11:01:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kt9ei",
          "author": "kubrador",
          "text": "gpt ads in a chatbot conversation are basically the marketing equivalent of someone interrupting you mid-sentence to sell you stuff. people tolerate search ads because they're already shopping. they're gonna tolerate chat ads about as well as they tolerate spam calls.",
          "score": 1,
          "created_utc": "2026-01-30 10:07:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2labl7",
          "author": "OrganicClicks",
          "text": "Brand perception will probably come down to relevance. If the ad actually fits the question and feels like a natural suggestion, it could work really well. If it’s shoehorned in, it’ll backfire fast. My guess is early winners will be brands that treat it more like content and less like classic ads.",
          "score": 1,
          "created_utc": "2026-01-30 12:24:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2lfpu6",
              "author": "feliceyy",
              "text": "You have explained it so well- GPT ads will favor brands that align themselves with what customers are looking for.",
              "score": 1,
              "created_utc": "2026-01-30 12:58:47",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2lki3x",
              "author": "ThomasFromChannable",
              "text": "Completely agreed! Big questions is, where does the relevance come from? I reckon it's from a product feed filled with as much data as you can possible gather to feed the AI with.",
              "score": 1,
              "created_utc": "2026-01-30 13:26:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2lf9zb",
          "author": "Single-Use1800",
          "text": "Yeah, same here. It feels like we’re moving from search intent to conversation intent, which is a big mental shift. I’m cautiously optimistic, but only if these ads feel genuinely helpful and context-aware. If they’re too pushy, I think users will tune them out fast. Feels like brands that focus on value-first messaging will win, while hard sells might actually hurt perception.",
          "score": 1,
          "created_utc": "2026-01-30 12:56:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2m0836",
              "author": "feliceyy",
              "text": "This is for sure. the ads should be relevant and solve real customer's issues.",
              "score": 1,
              "created_utc": "2026-01-30 14:47:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2lk6gz",
          "author": "ThomasFromChannable",
          "text": "To be honest, I think it will all come down to your product feed... The more data you feed AI with which accurately represents your brand, the smaller the chance that GPT will mess it up for you. Take the time to invest in your feed management before starting GPT ads, you'll see the benefits long-term in control of your brand consistency",
          "score": 1,
          "created_utc": "2026-01-30 13:24:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2m0pjw",
              "author": "feliceyy",
              "text": "I agree. we should focus on feeding AI with the correct info about our brands first for long-term benefits.",
              "score": 1,
              "created_utc": "2026-01-30 14:49:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2m7grh",
          "author": "localkinegrind",
          "text": "We treat it like early social media days, that is, influence more than direct attribution. You won’t always see the path, but you’ll feel the impact in branded search and assisted conversions. Platforms like OpenAI don’t exactly hand over referral data, so we’re piecing things together using surveys, landing page questions, and trend correlations. Not precise, but ignoring it feels riskier than experimenting.",
          "score": 1,
          "created_utc": "2026-01-30 15:21:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qlg8r",
          "author": "Electronic-Cat185",
          "text": "i feel the same mix of curiosity and unease. conversational ads feel much closer to the user intent so the margiin for being annoying is smalller. if they add context or genuinely help they might work but anything that feels shoved in could hurt trust fast. it feels less like classic ads and more like product placement inside reasoniing which makes brand perception way more fragile.",
          "score": 1,
          "created_utc": "2026-01-31 04:46:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2t7kz9",
          "author": "BigDaddy9102",
          "text": "You're right to be thinking about this now because the shift is already happening and most brands have zero visibility into what AI tools are actually saying about them. Brandlight might be what you're looking for since it's built specifically to monitor and improve how your brand shows up in AI-generated answers, which seems to be exactly the blind spot you're trying to solve. Worth checking out if you want to get ahead of this instead of just reacting when competitors start showing up favorably in thos conversations.",
          "score": 1,
          "created_utc": "2026-01-31 16:23:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ezlw6",
          "author": "hibuofficial",
          "text": "Yeah, this has a lot of teams pausing right now, and honestly, that hesitation makes sense. Everyone is still kinda sorting through it in real time.\n\nFrom the local side of things, the bigger worry isn’t even the ad label. It’s whether the placement actually makes sense in the middle of a conversation. When it does, people barely notice. When it doesn’t, it stands out fast.\n\nOne thing that’s already showing up is that conversational placements don’t tolerate generic messaging very well. Anything that sounds like a traditional promo tends to feel off, especially for smaller or regional brands. The stuff that lands better usually answers something concrete or removes friction instead of trying to push awareness.\n\nIt still feels early, though. A lot of marketers are watching how users react before committing real budget, because trust is harder to win back than impressions are to replace.\n\nCurious whether these platforms will give advertisers enough guardrails to keep things useful, because that balance feels easy to miss!",
          "score": 1,
          "created_utc": "2026-02-03 21:30:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvl7s2",
      "title": "Learning Digital Marketing in 2026 – What’s Working?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qvl7s2/learning_digital_marketing_in_2026_whats_working/",
      "author": "Unable-Connection-58",
      "created_utc": "2026-02-04 10:38:05",
      "score": 12,
      "num_comments": 14,
      "upvote_ratio": 0.81,
      "text": "Digital marketing is changing fast in 2026, and I’m still learning and experimenting.\n\nWhat tools or strategies are working for you right now?  \nLet’s share and grow together. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qvl7s2/learning_digital_marketing_in_2026_whats_working/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3ib4wl",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-04 10:38:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3igxf4",
          "author": "JyoP2708",
          "text": "Content marketing is still doing the heavy lifting for me in 2026, just way more data-driven than before. One thing that’s helped a lot is using Socialmon to find high-performing posts in a specific niche instead of guessing what might work. You can search a topic and it surfaces real viral posts from creators, which makes it much easier to reverse-engineer hooks, formats, and angles. Feels way more practical than generic “post consistently” advice, and it saves a ton of time when you’re still learning and testing.",
          "score": 4,
          "created_utc": "2026-02-04 11:28:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ivb6y",
          "author": "Beautiful_Ad_4970",
          "text": "In 2026, digital marketing that’s actually working focuses on **real people first, platforms second**. Short-form video is still huge (think TikTok and Reels on Instagram), but it’s about storytelling and value more than flashy edits. Personalization with email and AI content tools is helping brands stay relevant without sounding generic. Community building (niche groups, active DMs, live interactions) also beats just posting and hoping for likes.",
          "score": 4,
          "created_utc": "2026-02-04 13:09:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3iwa3u",
          "author": "Crescitaly",
          "text": "Great question! Digital marketing in 2026 is a mix of timeless fundamentals and adapting to new platform algorithms.\n\n* Stay audience‑first: Build content around your audience’s needs and questions rather than chasing every new trend. Google’s ranking factors now include user‑experience signals like page speed and performance ([10 Important SEO Metrics to Track in 2026](https://backlinko.com/hub/seo/metrics#:~:text=10%20Important%20SEO%20Metrics%20to,Core%20Web%20Vitals)), so make sure your site loads quickly and provides a great experience on mobile.\n* Prioritise retention and watch‑time on social: Algorithms reward content that keeps people watching. For example, Instagram’s retention charts show how long reels are watched and when viewers drop off ([Instagram Reel Analytics: Retention & Skip Rate Explained](https://metricool.com/instagram-reel-analytics/#:~:text=Instagram%20Reel%20Analytics%3A%20Retention%20%26,are%20Retention%20and%20Skip%20Rates)). Hooks that grab attention within the first few seconds and keep watch‑time high tend to perform best ([Instagram Creator Monetization Checklist 2026 - InfluenceFlow](https://influenceflow.io/resources/instagram-creator-monetization-checklist-your-complete-2026-guide/#:~:text=Instagram%20Creator%20Monetization%20Checklist%202026,Focus%20on%20Reels%20Performance)).\n* Use data to iterate: Instead of guessing, look at analytics (GA4, retention graphs, engagement dashboards) to see what resonates. Even small improvements in metrics like click‑through rate or watch‑time compound over time.\n* Diversify channels: Pair your social content with owned channels like email newsletters, podcasts or communities. This builds first‑party relationships and insulates you from algorithm changes.\n* Collaborate thoughtfully: Micro‑influencer partnerships and affiliate programs can work well when they’re aligned with your niche and focused on engagement rather than vanity metrics ([Instagram Monetization in 2026: What Actually Works (and …](https://www.reddit.com/r/InstagramMarketing/comments/1qjeekr/instagram_monetization_in_2026_what_actually/#:~:text=Instagram%20Monetization%20in%202026%3A%20What,and%20What%20Doesn%E2%80%99t)).\n\nHope that helps! What’s been working for you so far?",
          "score": 2,
          "created_utc": "2026-02-04 13:14:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j4doh",
          "author": "LuckyRubberDuckie",
          "text": "One thing I've noticed working surprisingly well in 2026 is reactive marketing. Responding fast to trends, news, or conversations instead of relying only on pre-planned content is a much better approach to content marketing.",
          "score": 1,
          "created_utc": "2026-02-04 13:59:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jlsik",
          "author": "StillLoadingit",
          "text": "The stuff that actually moves the needle is still understanding your audience first and practicing on real projects instead of just reading courses. Tools like ChatGPT for drafting ideas and analytics platforms for learning what works have been way more useful than chasing every new shiny trend.",
          "score": 1,
          "created_utc": "2026-02-04 15:28:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ntuwk",
          "author": "KONPARE",
          "text": "I’m still learning too, but the stuff that keeps working is pretty unsexy.\n\n* Pick one channel to get decent at first (search, short video, email, paid). Do not try to do all of them at once.\n* Track basics properly: UTMs, one conversion event, and a simple weekly check in GA4 and Search Console.\n* Make content from real questions people ask you. DMs, calls, support tickets. Way better than guessing.\n* Use AI for speed (research, outlines, variants), but always edit with real examples and clear opinions.\n\nAlso, boring consistency wins. Posting twice a week for 3 months beats a “big push” every few weeks.",
          "score": 1,
          "created_utc": "2026-02-05 04:22:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oep7p",
          "author": "United_Broccoli_4032",
          "text": "Since digital marketing keeps shifting, I’ve leaned on tools that take the guesswork out of testing. Right now, something like Didoo AI is a game changer-it studies your business and auto-spins up Meta ads that target buyers who actually convert. Instead of juggling audiences and ad creatives manually, it optimizes on the fly, so you can focus on what matters without wasting budget on dud ads. When you’re stuck wondering if an angle or audience will work, AI-driven testing like this seriously speeds up finding the winners. What kinds of tools or hacks have you found that keep your campaigns fresh?",
          "score": 1,
          "created_utc": "2026-02-05 07:02:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qurbhc",
      "title": "If you had to focus on ONE digital marketing channel this year, what would it be?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qurbhc/if_you_had_to_focus_on_one_digital_marketing/",
      "author": "Scary-Offer-4773",
      "created_utc": "2026-02-03 13:01:35",
      "score": 11,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "With limited time and budget, it’s getting harder to spread effort across everything.\n\nSEO, paid ads, email, social, influencers, content marketing - they all have their pros, but not all of them deliver the same ROI anymore.\n\nSo if you had to double down on just **one channel** right now, which would you choose and why?\n\nI’m interested in hearing what’s actually working in real-world campaigns, not theory or hype",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qurbhc/if_you_had_to_focus_on_one_digital_marketing/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3c23eq",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 13:01:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dcttd",
          "author": "Decent_Jello_8001",
          "text": "Google ads easy, I made a Milly off 5k lol",
          "score": 3,
          "created_utc": "2026-02-03 16:59:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f2bmx",
          "author": "KNVRT_AI",
          "text": "The answer depends on your business model, audience, and current assets. No universal best channel.\n\nE-commerce with email list? Email. Highest ROI, you own audience, predictable revenue.\n\nB2B with long sales cycles? LinkedIn. Decision makers are there, content builds authority.\n\nLocal services? Google Local Services or Maps. High intent searches convert immediately.\n\nContent business or SaaS? SEO if you can wait 6 to 12 months. Organic traffic scales without ongoing ad spend.\n\nConsumer product with visual appeal? Paid Meta or TikTok. Best creative testing and conversion tracking for e-commerce.\n\nOur clients see best ROI doubling down on channels where they already have traction. Amplify what's proven, not trendy.\n\nThe mistake is picking based on what sounds exciting versus what your business needs. New business with no audience? Paid ads for fast feedback. Established with traffic but low conversions? Email and retention.\n\nIf forced to pick universally, email wins for most businesses with existing customers. Highest ROI, full control, works across industries. But only if you have a list.\n\nFor acquisition with zero assets, paid search or Meta ads get you learning fastest. Organic takes too long when you need validation.\n\nReal world success depends on execution quality more than channel choice. Great email beats mediocre SEO. Channel matters less than how well you execute.\n\nFocus on channel where your customers are and where you can create better content or targeting than competitors.\n\nHonest answer is test multiple channels at low budget, find what converts profitably, go all in on that. Picking blindly is guessing.\n\nThis year specifically, organic social harder, paid ads more expensive, SEO takes longer. Email and owned audiences are safest bets for ROI if you have them.",
          "score": 2,
          "created_utc": "2026-02-03 21:43:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hh1tj",
          "author": "supriya_l89",
          "text": "I would choose SEO together with content creation as my preferred option. The method generates results which accumulate over time while attracting customers who show active purchase intent and it presents more stable outcomes than paid advertising. The approach continuously provides results when executed correctly through the creation of valuable content and the establishment of strong technical foundations.",
          "score": 2,
          "created_utc": "2026-02-04 06:05:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3joxkc",
          "author": "Rich-Editor-8165",
          "text": "I’d pick SEO.  boring at first, but it compounds, brings high-intent traffic, and keeps working even when you stop pushing. Fits well if you like building systems over chasing spikes.",
          "score": 2,
          "created_utc": "2026-02-04 15:42:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hfqhl",
          "author": "vj_0704",
          "text": "Paid ads works the best for me.",
          "score": 1,
          "created_utc": "2026-02-04 05:55:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hx2e8",
          "author": "sarajesson",
          "text": "I think ut's email marketing. Algorithm doesn't steal your reach and you can write customers directly.",
          "score": 1,
          "created_utc": "2026-02-04 08:25:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3l5p0r",
          "author": "E4sy1dle12e",
          "text": "SEO. Still the best long-term ROI if you do it right",
          "score": 1,
          "created_utc": "2026-02-04 19:44:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cis2i",
          "author": "Sad-Butterfly-4299",
          "text": "If I had to focus on **one** channel this year with limited time and budget, I’d choose **email** — *but only after using one other channel to feed it.*\n\nEmail wins for one simple reason: **it compounds**.\n\nAlgorithms change. Reach fluctuates. Ad costs spike. But once someone is on your list, you’re not renting attention anymore — you own the relationship. That matters more now than ever.\n\nThat said, email doesn’t exist in a vacuum. I’d pair it with **one acquisition channel**, not five.\n\nIf I had to rank what I’ve seen work in real campaigns:\n\n* **Email** → highest ROI long-term\n* **One organic channel** (SEO *or* short-form, depending on the audience) → list growth\n* Everything else → optional layers later\n\nWhat I wouldn’t do anymore:\n\n* Spread effort across multiple platforms “just in case”\n* Chase virality without a clear next step\n* Rely entirely on paid ads without a proven message\n\nSEO still works, but it’s slower and more competitive. Paid ads work, but only if you already understand your offer and audience. Social works, but reach is unreliable unless you’re consistent for a long time.\n\nEmail is boring. It’s not flashy. But it’s where conversions actually happen when things get tight.\n\nIf I truly had to pick **one single channel with no backups**, I’d still pick **email** — because it’s the only one that keeps paying you back for work you did months ago.\n\nCurious what others are seeing though — especially across different niches.",
          "score": 0,
          "created_utc": "2026-02-03 14:35:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3chapr",
          "author": "PeopleLoveAI",
          "text": "ngl with limited time & budget, i'd double down on paid ads like meta or google. you get the fastest feedback loop and clearest roi. if your creatives are good, you can scale pretty quick.\n\n\n\nbut yeah, \"if your creatives are good\" is the tricky part. thats always been my biggest bottleneck as a performance marketer, which is why i built trydooken(.)com. shameless plug but it just makes pumping out new static ad variants super fast.",
          "score": -1,
          "created_utc": "2026-02-03 14:27:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dii2a",
          "author": "Fit_Heat_3308",
          "text": "Google Ads for anything that, for the customer, feels like an investment. Meta Ads for small purchases and things like clothes or... I don't know... Air fryers haha.\n\n\nEmail if you already have a large/good contact list.",
          "score": 0,
          "created_utc": "2026-02-03 17:25:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtrpd0",
      "title": "Hi guys. Anybody feeling like quitting social media after managing clients social media accounts for over 4 months? Now, I just want to hire someone… is it just me or do you feel that way too ?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qtrpd0/hi_guys_anybody_feeling_like_quitting_social/",
      "author": "sushiwit420",
      "created_utc": "2026-02-02 10:41:02",
      "score": 9,
      "num_comments": 31,
      "upvote_ratio": 0.85,
      "text": "I have a marketing agency. Started just by myself. Now have one employee for editing videos. Currently, I have no energy to pitch new clients, as I am constantly questioning do I even enjoy this ? I am not into social media doom scrolling anymore. I love nature more and I do love marketing. But I want to automate it if it’s possible. Any successful marketers that have automated their business without having to use social media ? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qtrpd0/hi_guys_anybody_feeling_like_quitting_social/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o34uk0f",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 10:41:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o356kmz",
          "author": "bitchelleee",
          "text": "I did it as an internship for 3 months and now I don’t have any social media other than reddit and snapchat 😭",
          "score": 2,
          "created_utc": "2026-02-02 12:20:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38t0oo",
              "author": "sushiwit420",
              "text": "What’s your reason behind it ?",
              "score": 1,
              "created_utc": "2026-02-02 23:06:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o39np89",
                  "author": "bitchelleee",
                  "text": "Scrolling through TikTok and Instagram constantly for trends, that was the part I wasn’t exactly a fan of. I loved social media, I still do, but I just stopped enjoying it. My brain felt like brain rot by the end of the internship. Scrolling through social media just felt like a job even when I was off of work. I was just burnt out being on it for so many hours during the day. That’s just my personal experience! I know friends that do like the job. I wore many hats during the internship, I just didn’t like the social media part. I did realize the part I liked about it was engaging with the online community, looking at analytics and that I really want to pivot to product marketing, specifically something that involves helping people! :)",
                  "score": 3,
                  "created_utc": "2026-02-03 01:56:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o35ddpg",
          "author": "krush_groove",
          "text": "When your fun stuff becomes work for other people, it's not much fun any more...",
          "score": 1,
          "created_utc": "2026-02-02 13:07:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3g5g32",
              "author": "sushiwit420",
              "text": "My fun is film making. I never love social media. It was always a tool",
              "score": 1,
              "created_utc": "2026-02-04 01:07:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35gkoe",
          "author": "Crazy_Disk_9222",
          "text": "Is it so hard to do social media marketing",
          "score": 1,
          "created_utc": "2026-02-02 13:26:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37v11u",
              "author": "Exciting_Reason_4904",
              "text": "Not hard just draining",
              "score": 2,
              "created_utc": "2026-02-02 20:21:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o364hyw",
          "author": "StillLoadingit",
          "text": "Totally get that feeling, it’s really common to hit burnout with social when the trends never stop. Taking a real break, narrowing your focus, or just stepping back to reconnect with why you started usually helps more than grinding through it.",
          "score": 1,
          "created_utc": "2026-02-02 15:32:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38t6bu",
              "author": "sushiwit420",
              "text": "Thanks 🙏 it’s very true. I will find a way to automate this thing…",
              "score": 1,
              "created_utc": "2026-02-02 23:06:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37vgd5",
          "author": "Exciting_Reason_4904",
          "text": "I would recommend hiring a white label marketing agency to take care of the ads side of things all you would have to do it outreach and if you run your own ads as outreach then that’s a plus only thing you would have to do is communicate with clients",
          "score": 1,
          "created_utc": "2026-02-02 20:23:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38sl0i",
              "author": "sushiwit420",
              "text": "4 videos per week I offer like that. There will be a content script every week with new ideas taking in from weekly trends of social media contents",
              "score": 1,
              "created_utc": "2026-02-02 23:03:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o395zop",
                  "author": "Exciting_Reason_4904",
                  "text": "The white label agency will take care of that only thing they won’t is that 4 videos per week so I say hire someone to take video then send it to the white label agency and boom fully automated only thing left to automate would be your outreach",
                  "score": 1,
                  "created_utc": "2026-02-03 00:16:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o391dbr",
          "author": "AmanYoga",
          "text": "Claro! Aqui vai uma resposta em inglês, com tom humano, educado e colaborativo — bem “Reddit vibe”:\n\n⸻\n\nHey! I really relate to what you shared. I’m actually in the process of opening my own marketing agency here in Canada, and I’d genuinely love to help you with parts of the process if that could ease your workload a bit — while also learning from your experience.\n\nI come from a strong marketing/strategy background and I’m very aligned with the idea of building systems that are lighter, more automated, and less dependent on constant social media scrolling. If you’re open to exchanging ideas, collaborating, or even just talking through what could be delegated or automated, I’d be happy to contribute in a respectful and supportive way.\n\nTotally understand the burnout — and I think there’s a smarter way to do this without losing the love for marketing (or nature ).\n\nFeel free to reach out if that resonates",
          "score": 1,
          "created_utc": "2026-02-02 23:51:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3all16",
          "author": "Spiritu342",
          "text": "Managing this stuff for other people gets tiring quite quickly ...",
          "score": 1,
          "created_utc": "2026-02-03 05:29:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3arafh",
          "author": "supriya_l89",
          "text": "You experience social exhaustion because you spend your entire day managing social media accounts. Most agency owners experience this barrier because they must choose between content management delegation or shifting their focus to systems-based channels which include SEO email and advertising and partnership activities. Marketing success does not require social media affection because establishing a dedicated team and building operational procedures typically serves as a permanent solution.",
          "score": 1,
          "created_utc": "2026-02-03 06:15:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bosi4",
          "author": "levichambers_1",
          "text": "i would say this, find the stuff thats actually bothering you. is it the operations? like what? building strategy, creating content, scheduling what exactly.. if you can pin point, you can solve the porblem, hire people if strategy is a bottleneck, if content is draining you hire a content manager and build ai workflows, if scheduling and management, use tools like content studio or buffer.. that will handle day to day activity\n\nif it sales, hire someone for the sales, possibly build a workflow that will also help. its often the 80/20 rule. the 20% of the tsks taht drains all our energy, make sure you identify them and solve them rather stepping away for the business.",
          "score": 1,
          "created_utc": "2026-02-03 11:25:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bsoc3",
          "author": "RibinesExpress",
          "text": "Perhaps it's easier when you work directly for the client and have broader responsibilities. I've been a community manager for a long time (one of my many roles) and I always find a way to motivate myself…",
          "score": 1,
          "created_utc": "2026-02-03 11:56:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3g5vlo",
              "author": "sushiwit420",
              "text": "I create digital marketing strategies videos for 4 clients every week",
              "score": 1,
              "created_utc": "2026-02-04 01:10:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ckb06",
          "author": "Commercial_Mode_7770",
          "text": "Hi! \nI’m a founder myself of a creative agency. Now honestly, you cab automate the whole process but if your clients are sticking to you for what you bring ti the table, they’ll never be happy when you’re not in the picture at all. When it comes to marketing and if you’re great at it; then you’ll always have to step in. \n\nIf you’ve lost the interest then you can just take an exit but if you want to continue then you’ll have to give a lot of you into your business.",
          "score": 1,
          "created_utc": "2026-02-03 14:43:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3g6aax",
              "author": "sushiwit420",
              "text": "Yes. I cannot stop now. When I say I am going on 1 month vacation, my clients first question is how will our social media accounts be? I said don’t worry, before I go visit, there will be my new employee learning from me and will be handling shoots for a month.",
              "score": 1,
              "created_utc": "2026-02-04 01:12:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3gywuf",
          "author": "EarthPrimer",
          "text": "Sora",
          "score": 1,
          "created_utc": "2026-02-04 03:57:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jx4yl",
          "author": "vajanice90",
          "text": "Yes, social media is draining af. I enjoy coming up with content ideas but the actual posting is so exhausting",
          "score": 1,
          "created_utc": "2026-02-04 16:20:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtl165",
      "title": "If you want success in digital marketing, start by finding a problem to solve. I see so many new people dive right into ads and spending money for no reason.",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qtl165/if_you_want_success_in_digital_marketing_start_by/",
      "author": "Confident-Smile-7161",
      "created_utc": "2026-02-02 04:20:31",
      "score": 9,
      "num_comments": 8,
      "upvote_ratio": 0.99,
      "text": "Beginners jump straight to products, ads, and platforms. But none of that matters if you are not helping anyone fix something that is broken first.\n\nPick a niche, listen to what people are struggling with, and build something that makes their life a little easier. understanding and supporting the people in your niche  builds trust and authority, they naturally pay attention, and that is where sales come from.\n\nDigital marketing is more about solving problems than it is selling things.\n\nIf you have any questions, or ideas for problems you want opinions on, leave them below.",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qtl165/if_you_want_success_in_digital_marketing_start_by/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o33mfuh",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 04:20:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33q1d6",
          "author": "GrowthandCoffee",
          "text": "Yes, very true! I agree to this. Solving a problem and clearly explaining it to different categories of target audience also matters. \n\nPeople sometimes use superficial language to represent their product. What really matters is, clearly explaining the problem, writing what the solution is, and how it solves the issue. And this has to be expressed in simple and easy-to-read language. Also, the content has to have a proper flow and be to the point. ",
          "score": 3,
          "created_utc": "2026-02-02 04:44:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33stbo",
              "author": "Confident-Smile-7161",
              "text": "Exactly, Clearly providing a solution to a problem and clearly guiding your target audience in a language that they understand.",
              "score": 2,
              "created_utc": "2026-02-02 05:04:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35gjp4",
          "author": "ChestChance6126",
          "text": "Agreed, and I’d add that the problem has to be specific enough to test, not just vaguely “painful.” A lot of beginners pick a niche, but never narrow down the exact moment when someone feels stuck or frustrated. That’s why ads feel random to them. When you start with a real problem, the messaging almost writes itself, and distribution choices get simpler. Selling is just the side effect of being clear about who you’re helping and how.",
          "score": 3,
          "created_utc": "2026-02-02 13:26:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33z8iz",
          "author": "Single-Use1800",
          "text": "Absolutely agree! Digital marketing should always start with understanding the needs of your audience and solving real problems. Building trust and providing value first naturally leads to sales. Great advice for anyone starting out!",
          "score": 2,
          "created_utc": "2026-02-02 05:52:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35qekp",
          "author": "Ok_Addition3639",
          "text": "Absolutely. There's a reason why the very first step in setting up any campaign is selecting an objective.\n\nIf you skip the \"problem solving\" part, you’re basically just throwing money at the platform without knowing how you want it back.\n\nWe always tell clients that every dollar spent is a bid for a specific outcome. If you haven't identified the  problem, you can't possibly define that outcome to the algorithm. For instance - you might get cheap clicks, but you won't get conversions because your product isn't actually landing as a solution to anything.\n\nYou have to know exactly what \"success\" looks like before you spend a single dollar, otherwise you're just donating money to the ad network.",
          "score": 2,
          "created_utc": "2026-02-02 14:21:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oehed",
          "author": "Jumpy_Climate",
          "text": "Yep been doing this 20 years and helped 1000s. This is the way.",
          "score": 1,
          "created_utc": "2026-02-05 07:00:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtww5v",
      "title": "My boss thinks AI means we can do the same work with half the team",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qtww5v/my_boss_thinks_ai_means_we_can_do_the_same_work/",
      "author": "beckstarlow",
      "created_utc": "2026-02-02 14:43:37",
      "score": 8,
      "num_comments": 12,
      "upvote_ratio": 0.91,
      "text": "Hi everyone!\n\nSince we started using AI tools, expectations have gotten weird. Turnaround times shorter. Less tolerance for “thinking time.” More output, same pay.\n\nAnyone else dealing with leadership assuming AI - instant productivity?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qtww5v/my_boss_thinks_ai_means_we_can_do_the_same_work/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o35umjv",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 14:43:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35yz2r",
          "author": "drteq",
          "text": "Don’t work for dumb people and if you have to dont be loyal, you deserve better",
          "score": 5,
          "created_utc": "2026-02-02 15:05:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3a773z",
          "author": "FreelanceWebDev_26",
          "text": "Happening everywhere. The issue is leadership sees AI as a replacement, not an amplifier. The truth is AI handles the boring parts faster (first drafts, data formatting, research summaries) but the strategy, judgment, and quality control still need humans. If anything, AI means you can take on MORE complex work, not that you need fewer people. Worth framing it that way to your boss - 'we can do better work' not 'we can do the same work faster.'",
          "score": 2,
          "created_utc": "2026-02-03 03:50:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3b0bkp",
              "author": "theArthurChen",
              "text": "100%. My opinion is that someone should never use AI to do something they don't already know how to do manually, because if someone **doesn't** know how to do it themselves, then they can't verify that the AI did it accurately.\n\nSame thing with AI-Powered or Agentic Automations. Don't automate something you don't know how to do manually. You'll just miss a bunch of edge cases and create even **more** work fixing the output in the end.",
              "score": 2,
              "created_utc": "2026-02-03 07:34:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o35y2sq",
          "author": "Doongbuggy",
          "text": "as someone who has been starting to builds agent to do stuff, absolutely not lol the tech is not there yet even simple tasks by an agent are taking longer than if i donit myself - using claude for chrome to automate and it is not that reliable yet",
          "score": 2,
          "created_utc": "2026-02-02 15:01:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36ow52",
          "author": "No_Hedgehog8091",
          "text": "Yeah this is everywhere right now.\n\n  \nThe irony is AI actually needs MORE thinking time to use well, not less.",
          "score": 2,
          "created_utc": "2026-02-02 17:07:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38x2vb",
          "author": "roblawsonassassin",
          "text": "This is an interesting dilemma for both.  I am a business owner, therefore, boss, I guess.  I look at how I can support my people to do what they do.  For now, all we have is investment in tools and time to understand what will work for us and what won't.  Our goal is AI-first. Don't try to come up with the answers yourself; let AI give you some ideas and perhaps a framework.  I am starting to see our teams share their success and build agents to do repetitive tasks.  They all realise that, as a business, we need to be ahead of this stuff to remain competitive and to stay in business.\n\nPerhaps you could collaborate with your colleagues and present some time-saving ideas for the business to adopt, so you have repeatable processes.  Just expecting more with less won't work, in my opinion.",
          "score": 1,
          "created_utc": "2026-02-02 23:28:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3am6wc",
              "author": "Chimera_Mechanic_69",
              "text": "How to ruin your teams grey matter and make them dumb.",
              "score": 2,
              "created_utc": "2026-02-03 05:34:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3al8cr",
          "author": "Spiritu342",
          "text": "You can get more done with AI and be more productive, but also it doesn't mean you suddenly have to the work of 10 other people",
          "score": 1,
          "created_utc": "2026-02-03 05:26:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3k6sm1",
          "author": "WebLinkr",
          "text": "Depends on what you're doing",
          "score": 1,
          "created_utc": "2026-02-04 17:04:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36pbu4",
          "author": "YouMeADD",
          "text": "Everyone's boss",
          "score": 0,
          "created_utc": "2026-02-02 17:09:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu31ap",
      "title": "Client devaluing my work - but can't afford to lose the client",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qu31ap/client_devaluing_my_work_but_cant_afford_to_lose/",
      "author": "Objective-Ad6521",
      "created_utc": "2026-02-02 18:22:17",
      "score": 7,
      "num_comments": 18,
      "upvote_ratio": 0.83,
      "text": "I can make social media posts fairly quickly - because I've been doing it for over 15 years. And the.... boss (I'm a freelancer, but the job was positioned as if their employee, but I still have all contractor rights, which is fine) has pushed back a number of times to a 'package' rate, because the scope has outgrown the role. \n\nThe boss's excuse is that \"I'm asking you to do the things I'd be doing anyways... that's your role description\". I say \"That's outside of the scope\" and then it's always \"I don't understand why you don't just want to keep it to an hourly, since you're doing what I would be doing anyways\" and I say, \"I shouldn't be penalized for doing things quickly\" to which there is NO response and then goes back to \"I don't understand..... why can't you just be like \\[former person who filled the role\\]\". To which it becomes a circular arguement and so I usually say, \"If you were to hire someone else, they would be doing this slower\" to which there's again no response to THAT...\n\nI know many of you will say, stop working for them - but you probably already see how devalued marketing in general is due to AI, and we are in a depression, whether it's official or not. The types of clients I usually work with - owner operated businesses - just don't have the budget or if they do they splurge it on ads by a bro agency. And because of some personal happenings for the past few years, it's been tough getting back on track financially - so I need any work I can get.\n\nBut I'm also at a point where I can't devalue my skills and knowledge so much that I end up doing SO much for them at a low rate, which eats into my time into rebuilding a proper portfolio and retarget a niche that actually will pay for my skills - AND doing sales and networking while trying to convince people to pay for \"something AI can do\" and \"if AI can't do it, then prove me your conversion rate and why I should choose you over others\".\n\nMy skills is in organic social media and high quality content that builds brands over time. But that comes with a certain presentation and aesthetic etc etc. So I know the game. \n\nI'm just trying to figure out..... how do I come with stats and a reasonable boundary when they say \"sure, but don't spend too much time on it\" because they don't want to pay even the amount it takes to make the post... because \"well, you're just using AI - it should take 15 minutes\" even though I'm creating the design from scratch, yes repurposing their prior content, but I have to search for the right image, design it, curate the caption, hashtags - and that's not including engagement to actually get the post seen by a wider audience... \n\nOr listen - if y'all need a white label unicorn, I can send over my portfolio(s) and work out a rate where I don't have to deal with clients ;)",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qu31ap/client_devaluing_my_work_but_cant_afford_to_lose/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o375box",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 18:22:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3a65v7",
          "author": "anajli01",
          "text": "You’re stuck in the speed-vs-value trap.\n\nQuick fixes:\n\n* Stop justifying time → price outputs (posts/week, revisions, engagement).\n* When scope grows, ask: *“What should I deprioritize to stay in scope?”*\n* One-liner for AI: *“AI speeds execution, not strategy.”* Don’t debate it.\n* Deliver exactly what their budget buys. No extras.\n\nYou’re not overcharging they’re anchoring to effort, not expertise. Use this client to fund your exit, not drain you.",
          "score": 3,
          "created_utc": "2026-02-03 03:43:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ai7bg",
          "author": "PugglePack83",
          "text": "Stop devaluing yourself.  It takes a person to run the ai effectively.  It takes experience to have a competent strategy.  It takes competence to execute.",
          "score": 2,
          "created_utc": "2026-02-03 05:04:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3doorg",
              "author": "Objective-Ad6521",
              "text": "Thank you - the word 'competency' has been circling my mind - rather than use any other parameter to showcase value, I believe competency is what this client values and can leverage that. I wasn't hired to be a strategist, and have said that I will charge more if I have to come up with the strategy, and it's been a learning experience to stop myself before suggesting solutions, and simply presenting A/B options and forcing them to choose - which is what they don't do, they waffle about until someone says enough and chooses, but complains if people don't 'step up' or leave because they \\[client\\] refuses to lead.",
              "score": 1,
              "created_utc": "2026-02-03 17:54:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3kahfr",
          "author": "Visual_Arrival_5815",
          "text": "The speed-value trap is brutal. Client gets deliverable fast, assumes it was \"easy\", then bases future expectations on that.\n\nThe \"why can't you just ...\" argument you described happens when there's no documented scope to point to. Without a brief, they define \"reasonable effort\" retroactively.\n\nCurious—do you have any intake workflow before you start a project? Something that captures what's in scope vs. out of scope, number of revisions, what \"done\" looks like?\n\nI've found that even a simple intake form changes the conversation from \"why did this take so long\" to \"that wasn't in the original scope—here's what a change order looks like.",
          "score": 2,
          "created_utc": "2026-02-04 17:21:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38ai5d",
          "author": "Ashley_said_what",
          "text": "Honestly, if I was you, I’d slowly transition into working slower (or pretending to) and chill out the rest of the hours. If they don’t see your value, don’t over explain. Work out what works best for you without losing the client",
          "score": 2,
          "created_utc": "2026-02-02 21:34:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3efj4h",
              "author": "Objective-Ad6521",
              "text": "Thanks for the advice - I'm def doing that, but they're also very micro-managing where 'why did this post take 2 hours when it's just ai'. I can absolutely just do as they ask, but can also sense resentment building and a feeling of 'why isn't this converting clients' to the point where they throw in the towel and say, I'll do it myself and still fire me. Trying to walk the line, I know I have to get out soon. This was a good wake up, as someone else said.",
              "score": 1,
              "created_utc": "2026-02-03 19:56:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3ht55v",
                  "author": "Ashley_said_what",
                  "text": "You have a lot a patience dealing with that, if they ask me that I’d sit back and ask them, “why do you think it’s ai?” And ask why they’re undermining my work (my talent, my experience). Honestly a way out would be the best for you. No amount of paid client work is worth this mental turmoil. You deserve to be recognized for your work",
                  "score": 1,
                  "created_utc": "2026-02-04 07:49:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3dl7p1",
          "author": "Camilla_for_business",
          "text": "I said this elsewhere, but oof. Sounds really rough to go through OP. \n\nIt seems you've already had some quarrel with this person. I don't think negotiating with them further will fix it, since they seem to already have an idea of who you are, what you are for, and so on. \n\nStart looking for other jobs or clients, OP. Keep your options open and develop your skillset to help more mature companies.\n\nI'd say this is a wake-up call to get back on track. Best of luck! Also, sent you a DM",
          "score": 1,
          "created_utc": "2026-02-03 17:38:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3dpc2e",
              "author": "Objective-Ad6521",
              "text": "We've had a few head butts but I'm a very flexible and forgiving person, and can focus on the task at hand without taking anything personally but also not letting them walk all over me, having worked with higher tier creatives that operate on a much faster level and who take a tad more self responsibility. I already advocated for even a $5 raise, I took a pay cut because of a cross-country move and recognize locally the economy is different than LA/NY. Def working on getting back on track  - the landscape has changed so much and with AI.... well, we're all in this together. I'll respond to you DM - thank you",
              "score": 1,
              "created_utc": "2026-02-03 17:56:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3frmhb",
          "author": "Objective-Ad6521",
          "text": "PS - stole this strategy from a peer at the same company... to use AI to analyze timesheets without including any bias in the prompt to determine fair rate based on speed, descriptions, decision making responsibility, quality output and communication style.",
          "score": 1,
          "created_utc": "2026-02-03 23:51:49",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o3i5po5",
          "author": "Chance-Tower-7926",
          "text": "Before I transitioned to project pricing and charged by the hour I had a set time in my head for how long each social post would take and I stuck to it. I think it was around 15-minute per post (text only no graphics), so I'd charge for an hours work for 4 posts.",
          "score": 1,
          "created_utc": "2026-02-04 09:48:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mtsrq",
          "author": "LeastMostMaybeNow",
          "text": "Don't devalue yourself.  You'll resent them and hate that you didn't stick up for yourself. \n\nYou're battling emotions with facts; I have never been able to convince clients like this with facts. \n\nClients are used to hourly and because it gives them flexibility which means they don't know what we want.  Fixed fee is great for companies and vendors.  The client just needs to know what they actually want to do so it can be priced appropriately. \n\nSo I have this conversation ALOT in consulting. Don't engage in their time/money/flexibility arguments because that's not the game you're playing.  You aren't selling them this. You deliver them valuable assets with presence that speaks to the companys quality, culture and authority.  Your price is based on your expertise, which was developed over years of work.   Sell the expertise. Who cares what tools you use to turnaround their things faster without impacting quality.  Sell how your efforts impact their deliverables, timelines and bottom line. contrast that with the client needing to find someone else and spend employee time during that whole process. Nevermind onboarding blah blah blah.  \n\nSounds to me like they need you and trying to squeeze blood from a stone. Don't buckle.  Keep the job but look for others.  This client sucks.",
          "score": 1,
          "created_utc": "2026-02-05 00:49:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3n6j2i",
              "author": "Objective-Ad6521",
              "text": "Thank you very very much for the reflection! It's important to hear it from others, when working in silo",
              "score": 1,
              "created_utc": "2026-02-05 02:02:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3narox",
                  "author": "LeastMostMaybeNow",
                  "text": "It's so easy to get inside your own head and mess yourself up and not have a firm grip on what's reasonable. Get some colleagues in the same line of work that you can gripe to. Those people are so valuable just to maintain your sanity.",
                  "score": 1,
                  "created_utc": "2026-02-05 02:26:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3aounh",
          "author": "Payote88",
          "text": "Fire them",
          "score": 1,
          "created_utc": "2026-02-03 05:55:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qseae9",
      "title": "How i made 500$ in 24 days from Content Creation as a Newbie",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qseae9/how_i_made_500_in_24_days_from_content_creation/",
      "author": "roatopsgrid",
      "created_utc": "2026-01-31 21:06:52",
      "score": 7,
      "num_comments": 10,
      "upvote_ratio": 0.67,
      "text": "So everyone knows social media like Instagram, TikTok doesn't pay new creators much.  \nBut their are some brands which are willing to pay you if you get engagement for them on your completely new page, they don't care.  \n  \nI found a company which was a bridge between creators and brands. They were training creators like me and paying at the same time. Not only on basis of views. but some pays on how much you post because they know if you post according to them the views are guaranteed.\n\nThe hooks, style, text format. everything matters and they have a bible of it.\n\nAnd if you perform too well the method can be changed to performance basis, 2$ for every 1000 views.\n\nNo Matter where you are from. you can be paid.\n\nTo be honest i was skeptical. but you just have to start and i started enjoying and everything worked in a flow.\n\nHappy to help if anyone wanna do this too! giving back to the community. Upvotes are appreciated!",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qseae9/how_i_made_500_in_24_days_from_content_creation/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2uugo8",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-31 21:06:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2v5tu9",
          "author": "Outrageous-Brain3539",
          "text": "Technically \"guaranteed views\" is a statistical impossibility in a probabilistic algorithm, which implies you are likely serving impressions to bots or an engagement pod. while the revenue is tangible, your account's long-term attribution model is now corrupted because the engagement quality is effectively zero.",
          "score": 2,
          "created_utc": "2026-01-31 22:02:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2vb5qh",
              "author": "roatopsgrid",
              "text": "are you a bot",
              "score": 0,
              "created_utc": "2026-01-31 22:29:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2wysnc",
          "author": "Character_Economy168",
          "text": "i would just recommend finding a solid platform to get gigs from. ive had the most luck on a website called Home From College, ive gotten well-paying gigs consistently on there and its very flexible with my university schedule!",
          "score": 2,
          "created_utc": "2026-02-01 04:19:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2uyz8f",
          "author": "MiaSilk05",
          "text": "What company is?",
          "score": 1,
          "created_utc": "2026-01-31 21:29:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xoclm",
              "author": "roatopsgrid",
              "text": "yo, the link is on my profile",
              "score": 0,
              "created_utc": "2026-02-01 07:39:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ybppc",
          "author": "MichaelNjogu",
          "text": "Take me through it",
          "score": 1,
          "created_utc": "2026-02-01 11:14:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ycd00",
              "author": "roatopsgrid",
              "text": "you can check my profile, you will see process",
              "score": 1,
              "created_utc": "2026-02-01 11:20:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qq65h0",
      "title": "What is the best platform to manage and schedule Instagram and Tiktok postst in 2026?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qq65h0/what_is_the_best_platform_to_manage_and_schedule/",
      "author": "Lurking_Long_Hours",
      "created_utc": "2026-01-29 11:32:09",
      "score": 6,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "The title basically. And please, no low-effort vibe-coded shills. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qq65h0/what_is_the_best_platform_to_manage_and_schedule/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2e65m0",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 11:32:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gwf63",
          "author": "OrganicClicks",
          "text": "Later and Buffer are still the best for across both platforms. They have clean interfaces, reliable posting, decent free tiers. Hootsuite works well too but only if you're managing multiple accounts. It could feel overpriced if you are managing one or a few accounts.",
          "score": 1,
          "created_utc": "2026-01-29 19:44:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gywhc",
          "author": "Sonexomo",
          "text": "Biased answer since I built it, but if you're looking for just scheduling and posting - Schedulala.com. Handles Instagram, TikTok (we're API verified), Twitter, Facebook, Pinterest, YouTube, Threads, Bluesky from one dashboard.\n\n$9/month flat, unlimited posts. $18 if you want a shared dashboard so you and a partner can see all scheduled posts in one place.\n\nFair warning: we don't have analytics, comment management, or inbox features. If you need those, the big names (Later, Buffer, Hootsuite) are probably better fits.\n\nBut if you just want to batch content, schedule it out, and have it post reliably without paying per channel - that's what we do.",
          "score": 1,
          "created_utc": "2026-01-29 19:56:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hctrd",
          "author": "AnUglyGuy89",
          "text": "Following, I'm interested to Know more about other tools, since I Just use platforms itself",
          "score": 1,
          "created_utc": "2026-01-29 21:03:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ixbk2",
          "author": "hostsofinfluence",
          "text": "Vistasocial is cool!",
          "score": 1,
          "created_utc": "2026-01-30 01:56:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jg1kz",
          "author": "mannyned2",
          "text": "Check out ReGenr.app — we’re currently in beta and would love to have you as a tester to share feedback and help shape the product.\n\nReGenr is a creator-first platform for posting and scheduling across multiple channels, with advanced analytics, actionable insights, and automated blog sharing across major platforms like Facebook, Instagram, X (Twitter), TikTok, LinkedIn, YouTube, Discord, and Pinterest.",
          "score": 1,
          "created_utc": "2026-01-30 03:41:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jud2d",
          "author": "w23lfe",
          "text": "Just one tip, look for official api schedulers",
          "score": 1,
          "created_utc": "2026-01-30 05:13:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37t907",
              "author": "Lurking_Long_Hours",
              "text": "Meta has their own, right? Covering Insta and Fb.\n\nDoes Tiktok has something similar?",
              "score": 1,
              "created_utc": "2026-02-02 20:12:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2k3o43",
          "author": "supriya_l89",
          "text": "The solid picks of 2026 show tools which perform both platforms effectively through their main functions. The combination of Later and Hootsuite provides dependable solutions for scheduling and analytics and team workflow management. Metricool provides a strong value proposition because it delivers Instagram and TikTok analytics at a lower price than enterprise solutions. The Sprout platform provides excellent short-form content and trend analysis tools but comes at a high cost. The term best describes a specific product because your analytical needs determine how much you require beyond basic scheduling functions which should be handled by tools that make unrealistic claims about their AI capabilities.",
          "score": 1,
          "created_utc": "2026-01-30 06:22:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k6ja8",
          "author": "Andreiaiosoftware",
          "text": "I am using schedpilot for scheduling my social media stuff, i dont really do tiktok that much but the tool has tik-tok as well and you can schedule posts, and more important for me i can manage all in one place.",
          "score": 1,
          "created_utc": "2026-01-30 06:45:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k8v54",
          "author": "Viral_Graphs",
          "text": "For scheduling and managing content, most people go with tools like Buffer, Hootsuite, or Loomly because they support multiple platforms and have analytics built in. If you use Instagram and TikTok a lot, Later is solid too. Choose based on which social networks you need and how deep your reporting has to be.",
          "score": 1,
          "created_utc": "2026-01-30 07:04:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33vbqg",
          "author": "Confident-Smile-7161",
          "text": "I like metricool, i can uplaod by a csv file which makes it alot easier if i want to schedule a months worth of content at one time, the free tier is pretty good to if you are 4 - 5 posts a week. they have a 30 free trial for their paid account with a promo code ( its easy to find the code online its  like ALBERTOJO or something. just type metricool promo code into google i think its the top site and maybe the 5th or 6th promo code down the list on the site)",
          "score": 1,
          "created_utc": "2026-02-02 05:22:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ei450",
          "author": "TypicalAd3489",
          "text": "I have two: \n\n1) metricool.com - For its analytics pretty amazing data\n2) followr.ai - I got a LTD and it’s pretty decent it does the job and the AI it’s helpful.",
          "score": 0,
          "created_utc": "2026-01-29 12:55:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2en0b1",
          "author": "Single-Use1800",
          "text": "Later is still the best all-around choice in 2026 if you care about planning, looks, and consistency on Instagram and TikTok. The calendar view, grid preview, and analytics actually assist with thinking, not just auto-posting.\n\nIf you want lean + no-nonsense, Buffer is awesome less “creator sparkle,” more dependability.\n\nIf you have a team or brand overwhelmed with approvals, Hootsuite is fine, but it’s clunky and pricey.\n\nA true note that won’t be shouted from the rooftops: For TikTok, in particular, manual posting may still beat out schedulers in certain situations. The best combination, therefore, is often Later for planning and native posting for high-pressure content.\n\nNo magic tools just trade-offs.",
          "score": 0,
          "created_utc": "2026-01-29 13:24:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqu9gn",
      "title": "Do you still check business websites, or mostly use Google Maps now?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qqu9gn/do_you_still_check_business_websites_or_mostly/",
      "author": "Hot-Astronaut-1916",
      "created_utc": "2026-01-30 03:28:23",
      "score": 6,
      "num_comments": 21,
      "upvote_ratio": 0.88,
      "text": "I noticed something about how I search for local services.\n\nMost of the time I don’t click through to a business’s website anymore. I scroll Google Maps, read a few reviews, look at photos, and decide from there.\n\nWhen do you think that shift happened for you?\n\nIt seems that now you have three things that define a click\n\n\\-photo\n\n\\-rating\n\n\\-amount of reviews\n\nDo you think it changes what businesses should focus on showing online?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qqu9gn/do_you_still_check_business_websites_or_mostly/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2jdp8g",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 03:28:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jf6jr",
          "author": "bayoubunny88",
          "text": "I go to google maps to look for their website.",
          "score": 5,
          "created_utc": "2026-01-30 03:36:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ngqsw",
              "author": "PatchneckRed",
              "text": "I was about to say this exact thing. Google Maps makes the first impression, sometimes (quite literally) getting me to the door. But, far more often than not, I have to see the website too before I reach out.",
              "score": 3,
              "created_utc": "2026-01-30 18:42:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2noibb",
                  "author": "bayoubunny88",
                  "text": "It’s also a good way to get to the right website.",
                  "score": 2,
                  "created_utc": "2026-01-30 19:17:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2jqx94",
          "author": "KONPARE",
          "text": "Yeah, same here. For anything local I’m basically living in Maps now. Website is usually only if I’m about to spend real money or I need specifics like pricing, hours, menu, booking, whatever.\n\nThe shift for me was when Maps got good enough that it stopped feeling like a gamble. Reviews, photos, “busy times,” quick call button. Done. Also honestly, a lot of small business sites are slow or annoying on mobile, so I just… don’t.\n\nAnd yep, those three things matter a lot. Photo, rating, review count. Plus a couple extras people forget:\n\n* recent reviews (last 30 to 90 days)\n* owner responses (even short ones)\n* accurate categories and hours\n\nBusinesses still need a site, but I’d treat it like the closer. Maps gets the first decision. The site just seals it.",
          "score": 2,
          "created_utc": "2026-01-30 04:49:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2q3tql",
              "author": "Hot-Astronaut-1916",
              "text": "The first site definitely gets at least a click. Another reason why ranking on Google matters.",
              "score": 1,
              "created_utc": "2026-01-31 02:51:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2k8hne",
          "author": "bambidp",
          "text": "I agree. Businesses need to optimize their Google Map content.",
          "score": 2,
          "created_utc": "2026-01-30 07:01:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kaolb",
          "author": "jluisseo",
          "text": "Depende del tipo de negocio. Para restaurantes, cafeterías, servicios locales -> Google Maps es suficiente.\n\n\n\nPero para ecommerce o servicios B2B, la web sigue siendo crítica. Ahí es donde se cierra la venta.\n\n\n\nLo que mata conversiones:\n\n\\- Web sin WhatsApp directo\n\n\\- Formularios largos que nadie llena\n\n\\- Falta de reseñas/casos de uso\n\n\n\nLo mejor: Google Maps optimizado + web limpia y rápida. No hace falta diseño super fancy, mejor funcional.",
          "score": 2,
          "created_utc": "2026-01-30 07:19:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2klsnc",
          "author": "kubrador",
          "text": "yeah the website became like a backup tab nobody opens. google maps is basically the new homepage for local businesses.\n\n\n\nhonestly though if you're in digital marketing and \\*not\\* obsessed with your google business profile at this point you're basically running a pizza place with no sign. the rating/photo/review trifecta is doing more heavy lifting than your whole site probably.",
          "score": 2,
          "created_utc": "2026-01-30 08:59:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2q53ju",
              "author": "Hot-Astronaut-1916",
              "text": "Agreed. Google Ranking and clarity are becoming a dynamic that is integral and increasingly important in business success.",
              "score": 1,
              "created_utc": "2026-01-31 02:59:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2le87l",
          "author": "HostAdviceOfficial",
          "text": "Yeah, nowadays visiting websites is usually the last step. Usually just for credibility, prices, payment details, and such. What changes for businesses is that now they need to show information that adds clarity and credibility like quality photos, clear and up to date pricing, and functioning contact information.",
          "score": 2,
          "created_utc": "2026-01-30 12:49:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2q46wd",
              "author": "Hot-Astronaut-1916",
              "text": "Agreed. I'm seeing the funnel starts with Google Maps. Getting to the page finally puts you at least into the final phase of landing the customer.",
              "score": 1,
              "created_utc": "2026-01-31 02:54:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ll8ma",
          "author": "ThomasFromChannable",
          "text": "Google Maps is a way for me to find smaller companies websites, and honestly if the company isn't on Maps then I'll be very hesitant to give them my business... Visibility is a key factor to trust for me",
          "score": 2,
          "created_utc": "2026-01-30 13:30:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2q4ay9",
              "author": "Hot-Astronaut-1916",
              "text": "Agreed. Google ranking and showing up is increasingly important.",
              "score": 1,
              "created_utc": "2026-01-31 02:54:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3lqnze",
          "author": "hibuhelps",
          "text": "This comes up a lot working with local businesses.\n\nFor most people, Google Maps became the starting point once mobile search took over. Photos, review volume, and ratings answer the basic trust questions fast, so a decision often happens before a website ever loads.\n\nWebsites still matter, just in a different role. They tend to get used when someone wants confirmation: pricing clarity, service details, proof of work, or reassurance that the business is active and legitimate.\n\nWhat we’ve found is that Maps drives the initial choice, then the website usually seals the deal. Businesses that focus on only one of those tend to feel the gap pretty quickly!",
          "score": 2,
          "created_utc": "2026-02-04 21:24:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3nv4kz",
              "author": "Hot-Astronaut-1916",
              "text": "I have been noticing the same trends.",
              "score": 1,
              "created_utc": "2026-02-05 04:30:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kiree",
          "author": "semantic_ops",
          "text": "Je confirme cette utilisation pour certains secteurs. Je fais par exemple de la location de salle de réunion, et 8 personnes sur 10 qui appellent me demandent le prix alors que tout est expliqué sur le site web... j'en conclue qu'ils restent sur la fiche Google (d'ailleurs il y a quelques mois j'ai changé mon numéro de téléphone fixe en oubliant de faire la modification sur la fiche Google... et je n'avais quasiment plus d'appel de prospects). En revanche pour mon agence web Pixeldorado j'ai plus de mal à déterminer le rôle des fiches Google. Les gens semblent prendre plus de temps pour lire les contenus du site web.",
          "score": 1,
          "created_utc": "2026-01-30 08:31:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m8wb2",
          "author": "noval5",
          "text": "I check Yelp for reviews + photos, Google Maps for photos, directions, busy hours, + hours, and the website to order takeout/make a reservation",
          "score": 1,
          "created_utc": "2026-01-30 15:28:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2q4ikt",
              "author": "Hot-Astronaut-1916",
              "text": "Interesting you mention Yelp. Besides Google Maps and Yelps is there anything else you use to vet being a customer to a potential business.",
              "score": 1,
              "created_utc": "2026-01-31 02:56:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qr8um7",
      "title": "For those who moved from linear to self-serve DSPs, did performance or inventory actually hold up?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qr8um7/for_those_who_moved_from_linear_to_selfserve_dsps/",
      "author": "Former_Tea1131",
      "created_utc": "2026-01-30 15:39:46",
      "score": 5,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "We’ve been running linear for a while now, and with self-serve DSPs becoming more accessible, I’m starting to feel the pain of the “old” CTV model. On paper, self-serve DSPs seem like the obvious fix.  But I’m still not fully convinced the CTV inventory quality and actual performance really hold up compared to linear buys. For anyone who’s made the switch from linear to self-serve DSPs, did you see any real drop (or improvement) in scale, inventory quality, or outcomes? Curious over how it's gone for others who've made the switch.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qr8um7/for_those_who_moved_from_linear_to_selfserve_dsps/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2mbg5t",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 15:39:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mjmrx",
          "author": "InevitableImpress850",
          "text": "We are testing a couple of programmatic TV ad platforms side by side. Scaling is holding technically, but its fragmented across apps and deals. Inventory quality is fine, not magical. The real win is speed: flighting, creative swaps, geo tests in days, not weeks. The real loss? Fewer premium placements and way more QA pain. You trade certainty for control, basically.",
          "score": 2,
          "created_utc": "2026-01-30 16:16:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mq2ge",
              "author": "Former_Tea1131",
              "text": "When you say QA pain, is that mostly app-level transparency and placement validation? We’re feeling that risk, but the speed upside you mention is my biggest temptation.",
              "score": 1,
              "created_utc": "2026-01-30 16:45:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2mn1kq",
          "author": "oreynolds29",
          "text": "Scale dropped initially but CPMs were way better. Took about 3 months to dial in targeting properly. ",
          "score": 1,
          "created_utc": "2026-01-30 16:31:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mq8o5",
              "author": "Former_Tea1131",
              "text": "Did you mainly fix audiences, or was it more frequency + creative tuning?",
              "score": 1,
              "created_utc": "2026-01-30 16:45:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2mnd6f",
          "author": "fave_slinger",
          "text": "Most selfserve inventory is bottomtier remnant stuff. You get what you pay for.",
          "score": 1,
          "created_utc": "2026-01-30 16:33:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mqc5k",
              "author": "Former_Tea1131",
              "text": "Fair pushback. But is it really *most* inventory, or just what surfaces without PMPs/deals?",
              "score": 1,
              "created_utc": "2026-01-30 16:46:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2x9r12",
          "author": "The-Big-Chungis",
          "text": "Been testing a few selfserve platforms lately and honestly surprised by the quality we're getting through Vibe. It's solid for our D2C campaigns so far. I know we're still early in our testing phase but we have more control than linear buys and attribution is  trackable. Looks promising.",
          "score": 1,
          "created_utc": "2026-02-01 05:36:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qujigm",
      "title": "How do business evaluate digital marketing service providers in Pune?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qujigm/how_do_business_evaluate_digital_marketing/",
      "author": "Imaginary-Quit-5337",
      "created_utc": "2026-02-03 05:31:56",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I’m curious how companies typically assess digital marketing service providers, especially in growing tech hubs like Pune.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qujigm/how_do_business_evaluate_digital_marketing/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3alx27",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 05:31:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3aonok",
          "author": "revvmedia",
          "text": "From my experience working with clients in Pune, I’ve seen that businesses usually choose a digital marketing partner who really understands their niche. It’s not just about numbers or fancy campaigns. It’s about someone who gets their audience, their market, and the way they want to grow. They also value honesty, clear communication, and seeing real results. Basically, Pune businesses want someone who feels like a part of their team, not just an outside service",
          "score": 1,
          "created_utc": "2026-02-03 05:53:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3b3aip",
          "author": "PearlsSwine",
          "text": "Ask who their clients are, then contact the clients and ask if they are happy.",
          "score": 1,
          "created_utc": "2026-02-03 08:02:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bog63",
          "author": "TheKeterNauts",
          "text": "Most businesses I've worked with care less about flashy portfolios and more about three things:   \ncan you show me actual metrics from similar campaigns  \nhow transparent is your reporting  \nand what's your client retention rate.   \nThe Pune market specifically has a lot of agencies competing on price, so smart clients are starting to ask for 90-day pilot projects before signing annual retainers.....................  \nIf you're evaluating providers, ask them to walk you through a campaign that *didn't* work and what they learned that tells you more than any case study ever will.",
          "score": 1,
          "created_utc": "2026-02-03 11:22:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qv3q0q",
      "title": "Just starting my carrer...",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qv3q0q/just_starting_my_carrer/",
      "author": "Nibedita_B_S",
      "created_utc": "2026-02-03 20:46:38",
      "score": 4,
      "num_comments": 5,
      "upvote_ratio": 0.84,
      "text": "Agency life reality check: From student to trainee at Publicis, tips for surviving long hours?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qv3q0q/just_starting_my_carrer/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3eq2er",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 20:46:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hn9tu",
          "author": "stpauley45",
          "text": "You are a slave now. They sell your time to clients. Learn as much as you can and then go client side. There is no secret sauce or special knowledge at Publicis. Scarcity of knowledge is no longer a thing.",
          "score": 3,
          "created_utc": "2026-02-04 06:57:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ht6js",
              "author": "Nibedita_B_S",
              "text": "Noted..",
              "score": 1,
              "created_utc": "2026-02-04 07:50:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hlfxq",
          "author": "admatic-anz",
          "text": "Good luck on your career! and welcome to the industry! \n\nAlthough we've been able to maintain a culture that minimises long hours (if we have them at all now), here are some tips we teach our team within our agency:\n\n\\- build simple habits so they're easy to carry out consistently (consider using the below in the simplest ways that makes sense to you)\n\n\\- writing things down immediately\n\n\\- block times for focus work\n\n\\- ask 'why' early and not late (when you don't understand something, fire away)\n\n\\- Use feedback to sharpen your thinking, not question your worth\n\n\\- find a person ahead of you that you can learn from (think of someone whose pace, judgement, or calm you respect. Watch how they handle pressure, prioritise, and say no)\n\n\\- make de-stressing sacred to you, and protect your hobbies / interest outside of work immensely\n\n\n\nHope at least one of these help!",
          "score": 2,
          "created_utc": "2026-02-04 06:42:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ht3du",
              "author": "Nibedita_B_S",
              "text": "Thanks alot..:-)",
              "score": 1,
              "created_utc": "2026-02-04 07:49:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qtsszw",
      "title": "Is running facebook ads for small businesses a good side hustle?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qtsszw/is_running_facebook_ads_for_small_businesses_a/",
      "author": "Wjkoba",
      "created_utc": "2026-02-02 11:42:30",
      "score": 4,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "Got a full time job but looking for something i can do nights and weekends. Came across Brez Scales talking about running ads for local businesses and taking a cut of what you make them. Sounds too good to be true? Anyone actually doing this on the side?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qtsszw/is_running_facebook_ads_for_small_businesses_a/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o351luw",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 11:42:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35fzur",
          "author": "PearlsSwine",
          "text": "He's a scammer, and no, just get a job. Of course it is too good to be true.",
          "score": 1,
          "created_utc": "2026-02-02 13:23:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3buav2",
              "author": "Electronic-Ad9854",
              "text": "real bro thats kinda sus to make a post about it",
              "score": 1,
              "created_utc": "2026-02-03 12:08:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3bvw09",
                  "author": "PearlsSwine",
                  "text": "Sorry, I don't speak teenager.",
                  "score": 1,
                  "created_utc": "2026-02-03 12:20:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3aqan5",
          "author": "Chrisn1979",
          "text": "Its legit but getting clients is harder than the actual ad work. Thats the part most people struggle with",
          "score": 1,
          "created_utc": "2026-02-03 06:06:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3aql44",
          "author": "cvithlani",
          "text": "Good side hustle but remember taxes eat like 30% and you need software subscriptions too",
          "score": 1,
          "created_utc": "2026-02-03 06:09:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ch5k8",
          "author": "XiderXd",
          "text": "Yeah this can work, but the hardest part is finding the clients in the first place, not running the ads. I've heard SMB Sales Boost is really good for building your prospect list since it gives you newly registered businesses before everyone else is hitting them up. Makes the outreach part way easier when you're reaching fresh leads.",
          "score": 1,
          "created_utc": "2026-02-03 14:26:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hc41q",
              "author": "Accurate_Might3142",
              "text": "Yeah, discovery is the real unlock. Freshly registered SMBs convert way better. Once you’ve narrowed the list, using something like Peak AI just for enrichment keeps costs down and avoids spraying emails at stale contacts.",
              "score": 1,
              "created_utc": "2026-02-04 05:27:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3holqx",
          "author": "DBK85",
          "text": "Started exactly like this 2 years ago. Now its my full time thing. Definitely possible",
          "score": 1,
          "created_utc": "2026-02-04 07:09:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hp32m",
          "author": "DBK85",
          "text": "The learning curve is real tho. Dont expect money for the first few months while you figure it out",
          "score": 1,
          "created_utc": "2026-02-04 07:13:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hwmew",
          "author": "Emagnuson89",
          "text": "Started learning last month. Its a lot but feels like a real skill not just another hustle scam",
          "score": 1,
          "created_utc": "2026-02-04 08:21:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtqkv8",
      "title": "Evaluating the best cold email agency for a client’s outbound.",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qtqkv8/evaluating_the_best_cold_email_agency_for_a/",
      "author": "Forenzoj",
      "created_utc": "2026-02-02 09:33:56",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 0.84,
      "text": "I run a full-service digital agency, but we don't do cold email in-house. A client is asking for it, and I want to white-label or refer them to a specialist. I need someone who understands the nuances of B2B copy. I need real research and high-level strategy. Who is considered the gold standard for cold email execution these days?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qtqkv8/evaluating_the_best_cold_email_agency_for_a/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o34nhqq",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 09:33:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3arqxt",
          "author": "ExtremeAstronomer933",
          "text": "From experience, the biggest failure point with white-labeled cold email is shallow research. Whoever you pick should feel more like a partner than a vendor. Outreachbloom is one of the few names I’ve seen tied to strategy-heavy outbound.",
          "score": 1,
          "created_utc": "2026-02-03 06:18:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3brcbt",
          "author": "Zestyclose_Chair8407",
          "text": "you're smart to white-label this instead of building it yourself. The deliverability stuff alone is a nightmare if you don't specialize in it. I've been seeing sales dot co come up a lot in circles where people are looking for actual strategic cold email, not just volume blasting.\n\n\n\nFrom what I understand, they handle the full stack including research and personalization, which sounds like what you need if your client wants quality meetings. They seem to focus on growth-stage B2B specifically so the targeting should be pretty dialed in for that use case. Might be worth checking them out since they do the fully managed thing and you wouldn't need to bring any of teh infrastructure in-house.",
          "score": 1,
          "created_utc": "2026-02-03 11:45:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1quvka9",
      "title": "The loneliest month of my career: holding the line when everyone thinks you are failing",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1quvka9/the_loneliest_month_of_my_career_holding_the_line/",
      "author": "Mindless_Cow_6034",
      "created_utc": "2026-02-03 15:52:02",
      "score": 2,
      "num_comments": 4,
      "upvote_ratio": 0.63,
      "text": "hey everyone.\n\nI wanted to share something that happened recently because I think a lot of founders here might relate to that specific type of pressure that does not show up on a spreadsheet.\n\nWe were hired to handle the acquisition for a major tech event. The stakes were high, the budget was significant, and we only had an 8 week sprint to make it happen.\n\nThe first month was a total nightmare.\n\nBecause I was focused on filtering for high quality enterprise leads, the raw registration numbers looked tiny compared to their past events. To the client, it looked like I was failing.\n\nI had mid level managers practically calling me a fraud in meetings. My own team was asking if we should just \"open the floodgates\" and buy some cheap traffic just to make the dashboard look better and stop the yelling.\n\nIt is a really heavy feeling when you are the only person in the room defending a strategy that looks like a disaster on the surface. I spent quite a few nights staring at the ceiling wondering if I was actually the one who was wrong.\n\nWe stayed the course. We ended up with 1,200 registrations that brought in 30 million dollars in ROI.\n\nThe strategy worked, but the emotional toll of being \"the failure\" for four weeks was brutal. It reminded me that as founders, we often have to choose between looking successful and actually being successful.\n\nHave you ever had to sit in that fire? That moment where you knew you were right, but every person around you was begging you to pivot to something easy but wrong? How do you keep your mental health intact when the pressure to chase vanity metrics starts coming from inside the house?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1quvka9/the_loneliest_month_of_my_career_holding_the_line/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3cyd3g",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 15:52:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3e07ev",
          "author": "Visual-Sun-6018",
          "text": "This really is the classic quality vs vanity metrics battle. Holding the line when everything looks bad is what separates real strategy from dashboard padding. With AI making junk volume so easy now, the pressure to open the floodgates is even worse. Respect for sticking it out, that ROI proves conversion quality is what actually matters.",
          "score": 2,
          "created_utc": "2026-02-03 18:45:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ee3kv",
              "author": "Mindless_Cow_6034",
              "text": "that's on point, have you had any similar experiences ?",
              "score": 1,
              "created_utc": "2026-02-03 19:50:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}