{
  "metadata": {
    "last_updated": "2026-02-17 02:59:57",
    "time_filter": "week",
    "subreddit": "digital_marketing",
    "total_items": 20,
    "total_comments": 289,
    "file_size_bytes": 268417
  },
  "items": [
    {
      "id": "1r0u9r0",
      "title": "AI is NOT taking our jobs. Chill, people!",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r0u9r0/ai_is_not_taking_our_jobs_chill_people/",
      "author": "Far-Panic3458",
      "created_utc": "2026-02-10 07:20:45",
      "score": 85,
      "num_comments": 79,
      "upvote_ratio": 0.79,
      "text": "I have been running my own marketing agency for quite a few years now and have been interacting with various clients. From startups to corporations, I have done marketing for them all. And I can hardly recall using the same strategy for more than 2 clients. Each one has their own flair, their own style or a “human touch” as i like to say that makes their marketing unique. Sure there are now tools like Blobr AI, LocalQ or Ryze AI that can automate reports but to say that they can replace our work is downplaying our role, undermining our experiences. How does AI train itself? By regurgitating information that humans have already done in the past. Hypothetically, if humans were to be replaced, there would come a point where AI wouldn’t be able to offer any sort of new or beneficial suggestions. And who would come to its aid then? So, the next time anyone says that marketing is going to be majorly automated, do enlighten them :)",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r0u9r0/ai_is_not_taking_our_jobs_chill_people/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4ksnkq",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 07:20:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lkaav",
          "author": "Firm_Distribution999",
          "text": "So… tell that to the marketing team that got laid off because a junior role can just babysit the AI tools for all of the projects now",
          "score": 18,
          "created_utc": "2026-02-10 11:39:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ltyth",
              "author": "three_s-works",
              "text": "I don’t think that’s happening and I’ve been jobless for 6 months. “It’s the economy, stupid”",
              "score": -7,
              "created_utc": "2026-02-10 12:49:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4m2nas",
                  "author": "Firm_Distribution999",
                  "text": "it absolutely IS happening. nobody can get marketing jobs at the moment. HR jobs are next. major layoffs and no job openings. I currently live in a country, not the US, where our job market is absolutely in the gutter with record high unemployment. if you don't think AI tools have anything to do with it, then you're kidding yourself.",
                  "score": 12,
                  "created_utc": "2026-02-10 13:41:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4l1lt6",
          "author": "[deleted]",
          "text": "I do think, however, that clients are going to increasingly be looking for lower prices, now they know everyone can create more due to AI. Just how like the value of hand weaving declined when the power loom came along.",
          "score": 4,
          "created_utc": "2026-02-10 08:46:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4md6o2",
          "author": "theRetrograde",
          "text": "I run a company of 14 employees - it was 12 until yesterday when we hired 2 new employees.\n\nYour points are well taken.  However, AI IS going to lead to a reduction in the digital marketing and programming workforce - industry wide.  But I think it will impact major corporations more than small shops and I actually see AI a major advantage for small agencies like mine.  \n\nWith its current capabilities, AI does more to increase the capacity and output of a competent marketer or programmer.  This likely results in fewer people needed industry wide. \n\nI think it will also lead to new opportunities and perhaps spinoff industries.  \n\nThe role of my employees and their daily activities will probably change significantly over the next few years.  I am optimistic that it will be an improvement for everyone.  We will do better, more thorough work with the help of AI.  We can spend more time on marketing strategy, a little less time on implementation and a lot less time on observation and reporting.\n\nBut there are definitely new threats to my business.  The largest and most uncontrollable is how consumers use AI to search, find products, get their news etc.",
          "score": 5,
          "created_utc": "2026-02-10 14:38:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kzyaf",
          "author": "chrismcelroyseo",
          "text": "I'm just waiting for all the butt butt people that are going to come in and disagree with you. \n\n\"But you just have to know how to prompt it properly.\" \n\n\"But once you dial in the prompts it’s basically flawless.\" \n\n\"But prompt engineering is a skill and most marketers just haven’t learned it yet.\"\n\n\"But I use a tool that does all my SEO automatically and my traffic went up.\"\n\n\"But my AI writes blogs, posts them, interlinks them, and I rank fine.\"\n\n\"But tools already replace most agencies.\"\n\n\"But why would I pay a marketer when software does it cheaper?\"\n\n\"But AI is here now so you just have to adapt or get left behind.\"\n\n\"But Google hasn’t penalized me yet.\"\n\nAs you see I've been collecting all of the butt butt posts that I could find.",
          "score": 3,
          "created_utc": "2026-02-10 08:30:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ksvlg",
          "author": "Crescitaly",
          "text": "100% agree with the core point here. The marketers I see struggling are the ones who were basically doing what AI does - cranking out generic blog posts, writing cookie-cutter ad copy, building templated strategies. Yeah, AI can do that now.\n\n\n\nBut the ones who actually understand their client's business, who can read between the lines of data and say \"here's why this campaign flopped even though the numbers look fine on paper\" - AI isn't touching that.\n\n\n\nWhat I've noticed is that AI is actually making good marketers even better. I use it to handle the grunt work (first drafts, data organization, brainstorming) which frees me up to spend more time on strategy and client relationships. That's where the real value is.\n\n\n\nThe human touch thing you mentioned is spot on. Every client has a different voice, different audience, different goals. AI can approximate that but it can't truly understand the nuances. I had a client in a very niche B2B space and every AI-generated piece sounded like it was written for a generic SaaS company. The industry-specific knowledge and tone just wasn't there.\n\n\n\nSo yeah, AI is a tool upgrade not a replacement. The people worried about it are probably the ones who need to level up their actual skills.",
          "score": 12,
          "created_utc": "2026-02-10 07:22:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ktqag",
              "author": "Far-Panic3458",
              "text": "So so agree! I understand being worried but i don't understand leaving the industry. Like it or not, AI is gonna be around. But we make ourselves useful, learning shouldn't stop! AI can be a great addition but it can never replace your practical experience",
              "score": 1,
              "created_utc": "2026-02-10 07:30:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4kwc7b",
                  "author": "Crescitaly",
                  "text": "Exactly right. The practical experience part is what separates average marketers from the ones clients actually want to keep. AI can draft a decent email or suggest keywords, but it can't sit in a meeting and read the room, or know that a particular client's audience responds better to humor than corporate speak. That intuition comes from years of doing the work. The people who embrace AI as a tool while continuing to sharpen their human skills are going to be in a really strong position.",
                  "score": 1,
                  "created_utc": "2026-02-10 07:55:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4kuihp",
          "author": "barely_qualified_fr",
          "text": "Ikr, this gets overstated all the time. AI changes “how” we work, not “why” the work exists. Marketing still depends on judgment, context, and understanding what makes a specific audience care, and that’s something that’ll never be fully automated.\n\nWhere AI helps is taking care of repeatable, low-value tasks so humans can spend more time on strategy and decision-making. The human layer doesn’t disappear; infact it’s more important than ever now.\n\nTeams that treat AI as an assistant/helper rather than a “replacement” seem to get the most value without losing the human touch.",
          "score": 6,
          "created_utc": "2026-02-10 07:38:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kztj3",
              "author": "Acceptable_Film556",
              "text": "This. I remember the first wave of panic when ChatGPT just appeared. Few years later I only have more and more work, balancing full time with side projects and our own pet one 😅",
              "score": 2,
              "created_utc": "2026-02-10 08:28:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4r3xvh",
              "author": "Jenikovista",
              "text": "But it does not take nearly as many people to do the same work today as it did 5 years ago.",
              "score": 2,
              "created_utc": "2026-02-11 05:43:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lk8zz",
          "author": "Aggravating-Key6628",
          "text": "The nuance most people miss in this debate is that AI is not replacing marketers - it is replacing the parts of marketing that were already commoditized. Writing generic ad copy, pulling reports, scheduling posts. That stuff was already heading toward $15/hr VA territory before AI showed up. What is actually happening is the floor is rising. The baseline competence a client expects from day one is higher now because they have seen what ChatGPT can do. So the differentiator is not that you can write copy - it is that you know which copy to write, for which audience, at which stage. Strategy and judgment are harder to automate than people think.",
          "score": 2,
          "created_utc": "2026-02-10 11:39:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qgth4",
          "author": "TCpls",
          "text": "Hate to be the bringer of bad news, but it’s finally happening… Display and Video will be first. So learn multiple channels and practice your client facing skills.\n\nAssuming you’re working with smaller brands, it will be affordable to you soon.\n\nThey will learn how you work, what your flare is, and how to mimic you. They will optimize the buy in a way you can tell the client their money won’t be a blank check to any platform.\n\nDo I trust it in something like Google Ads? No. Can I see it replacing those who manage small buys in Google Ads? Yes, easily. When there are less levers to pull, it learns faster.",
          "score": 2,
          "created_utc": "2026-02-11 03:01:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qoe6f",
          "author": "gasolinemike",
          "text": "OP is like pushing a rock up a slope with his nose. \n\nThe fact remains that people just take too much time to get from a novice to a craftsman level. And too expensive to boot, considering the number of years it will take. And then, they repay you for the years & expense in training by leaving for another job for RM200 more. \n\nNo one has yet made a compelling reason for me to hire freshies out of uni, the cohort that’s most prone to jumping ship after the requisite 2 years experience. Pisses me off. \n\nSo, my senior team now use Claude Code to do the work it would taken 5-10 engineers in the past. \n\nSo, yes, AI will be eating your jobs. Just takes some time to work through the system. And soon.",
          "score": 2,
          "created_utc": "2026-02-11 03:50:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54qhcl",
              "author": "Firm_Distribution999",
              "text": "If you don’t hire interns, there will be no mid-experienced people in 5 years. Hiring freshies is a long term investment ",
              "score": 1,
              "created_utc": "2026-02-13 08:21:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o565tuy",
                  "author": "gasolinemike",
                  "text": "Yes, I will let some one else spend the money train freshies. Then I come in to hire -- most newbies get pissed off at their first job bosses anyway. \n\nI agree that there can be a hollowing out of the middle layer after 5 years of people like me who don't want to take on new hires anymore.",
                  "score": 1,
                  "created_utc": "2026-02-13 14:40:58",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5behtk",
                  "author": "your-Fun-Pass",
                  "text": "Hardly any fresher would stay for more than 2 years. It's better to hire a mid-exp person when you need one.",
                  "score": 1,
                  "created_utc": "2026-02-14 09:46:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4r3slq",
          "author": "Jenikovista",
          "text": "You’re disconnected from the reality of what is actually happening on the streets today.",
          "score": 2,
          "created_utc": "2026-02-11 05:42:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54ql8o",
              "author": "Firm_Distribution999",
              "text": "This. So many people have a corporate shell protecting them from the fast moving world of what’s really happening. \n\nJust because AI hasn’t replaced OP’s job yet doesn’t mean it won’t soon ",
              "score": 1,
              "created_utc": "2026-02-13 08:22:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4rfyjn",
          "author": "Ashamed_Dentist_6442",
          "text": "Ehhh... you're half right lol\n\nAI won't replace the strategic stuff or reading clients in meetings. But those 5 people who used to do manual reports? Yeah, they're gone. \n\nMy buddy's agency went from 12 to 7 people while handling MORE clients.\n\nThe AI just copies thing is kinda outdated too. These tools spot patterns we'd never catch. It's less about replacement, more about needing way fewer people to do the same work.\n\nThe squeeze is real for average marketers. You either gotta be strategic enough to be irreplaceable, or really good with these tools. The comfortable middle is disappearing.\n\nNot trying to doom spiral, just saying \"chill people\" hits different when rent's due ",
          "score": 2,
          "created_utc": "2026-02-11 07:27:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4slw0x",
          "author": "HariSeldon16",
          "text": "<meme = “simpsons”> AI is not taking our jobs “right now” </meme>\n\nLook, the thing is AI might not be at that stage just yet but you’ve gotta look at the improvement curve over even just the last year. \n\nI was experimenting with cursor AI to do some heavy reasoning jobs in data analysis yesterday. It wrote python code in minutes that would have taken me days to write. The code itself was perfect. The actual logical approach needed to accomplish the task not so much, and led to major hallucinations.\nEven a year ago it would not have been able to do that.  I’m pretty sure if I had prompted it better it could have achieved the task. I’m taking another crack at it today.\n\nI think within 2-3 years we will be seeing AI doing more complex reasoning and things that are unthinkable even today.\n\nThe biggest barrier to AI imo is the infrastructure cost. Electricity, RAM, processors. We just saw micron exit the consumer RAM market to provide all of its capacity to AI. But as quantum computing becomes more commercially available those barriers are going to become non existent.",
          "score": 2,
          "created_utc": "2026-02-11 13:19:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l16od",
          "author": "Existing-Cod5443",
          "text": "Absolutely, we use AI for more smart or instead of hard work",
          "score": 1,
          "created_utc": "2026-02-10 08:42:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l4mc5",
          "author": "Low_Confection_2433",
          "text": "I 100% agree with this. AI can help us and define how we work, sometimes for good and sometimes for worse, but it's hard to foresee a near future where it can replace human expertise and relationships. \n\nThe best way to handle this is to specialise using AI to improve your skills and become better at something, not just letting the AI handle your job. ",
          "score": 1,
          "created_utc": "2026-02-10 09:16:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4liq4j",
          "author": "NaturalEase2367",
          "text": "I fully agree",
          "score": 1,
          "created_utc": "2026-02-10 11:26:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lkq87",
          "author": "kra73ace",
          "text": "Marketing is about differentiation and claiming a niche, if not a category.\n\nAI is averaging down, so that regardless of where you start in terms of positioning, you always drift towards the center.\n\nThat's my usual criticism when \"chatting\": \"great, that works for Google Cloud but it's way to ambitious for us.'",
          "score": 1,
          "created_utc": "2026-02-10 11:43:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lsex4",
          "author": "Fit-Donkey-3181",
          "text": "YES! Preach this harder!! AI can automate reports and spit out generic content, but it can’t read a client’s room, understand their brand voice, or pivot strategy when market trends shift. Tools like Blobr and Ryze are great helpers, but they’ll never replace the human ability to build relationships and think creatively",
          "score": 1,
          "created_utc": "2026-02-10 12:39:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lttju",
          "author": "three_s-works",
          "text": "A shitty economy is taking the fall for a flood of productivity tools",
          "score": 1,
          "created_utc": "2026-02-10 12:48:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4sg71v",
              "author": "Bweasey17",
              "text": "I agree with this.   Lot of people getting let go for reasons other than performance.   Economy isn’t in the tank as some say, but it isn’t thriving like the administration claims.",
              "score": 1,
              "created_utc": "2026-02-11 12:43:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lw1mm",
          "author": "chayprabs",
          "text": "Running ads needs a human touch that AI wont be able to compete with. Atleast for now.",
          "score": 1,
          "created_utc": "2026-02-10 13:02:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54qcic",
              "author": "Firm_Distribution999",
              "text": "There are already AI tools that’ll plug into Meta to run creatives and hooks for you automatically ",
              "score": 1,
              "created_utc": "2026-02-13 08:20:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lx2m1",
          "author": "Calm_Ambassador9932",
          "text": "I agree with this take. AI is great at scaling patterns, but marketing lives in the exceptions, the nuance, the context that only shows up when you actually work with people. If anything, the more automation we get, the more valuable human judgment and taste become.",
          "score": 1,
          "created_utc": "2026-02-10 13:09:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m5m9f",
          "author": "Careless-Parsnip-248",
          "text": "Yeah I’m with you on this. AI’s great at speeding things up, but it doesn’t replace judgment, context, or that human read on a business that actually makes marketing work. Every client’s different and that nuance is the job. Tools change, but the thinking part hasn’t gone anywhere.",
          "score": 1,
          "created_utc": "2026-02-10 13:57:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mb4b8",
          "author": "TheGCmind",
          "text": "This is heartening to hear.. If you need a strategic communications specialist do DMe",
          "score": 1,
          "created_utc": "2026-02-10 14:27:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ogjcw",
          "author": "UziMcUsername",
          "text": "AI can combine things in new ways. Perhaps no one has asked AI to come up with homepage copy for a company that does space tourism for cats, but AI could write the copy for that page is seconds, and it would be better than what most copywriters could produce in a day.\n\nThere will always be companies that don’t want to do it themselves, and a one man operator will always be able to find work, but the people who just write copy, or just do one or a few of the marketing jobs, are definitely losing their jobs to AI.",
          "score": 1,
          "created_utc": "2026-02-10 20:31:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pu7bo",
          "author": "jack_belmondo",
          "text": "Not yet...",
          "score": 1,
          "created_utc": "2026-02-11 00:45:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q57nr",
          "author": "stable_king",
          "text": "AI is the future, sooner or later you will accept it",
          "score": 1,
          "created_utc": "2026-02-11 01:51:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q63r5",
          "author": "InnovateNarrator",
          "text": "Not yet 🤞",
          "score": 1,
          "created_utc": "2026-02-11 01:57:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qcrx4",
          "author": "Slow-Bake-9603",
          "text": "I’m taking your jobs",
          "score": 1,
          "created_utc": "2026-02-11 02:37:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rev0l",
          "author": "Cultural_Try4776",
          "text": "I agree",
          "score": 1,
          "created_utc": "2026-02-11 07:17:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rpeo7",
          "author": "JJRox189",
          "text": "Love this post. Not panicking but be conscious of the potential!",
          "score": 1,
          "created_utc": "2026-02-11 08:57:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sb990",
          "author": "asunder3000",
          "text": "I think unfortunately a lot of folks need to get burnt before they realise this.",
          "score": 1,
          "created_utc": "2026-02-11 12:08:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sbciw",
          "author": "dudewafflesc",
          "text": "I wish you were 100% right, my friend.  Right now, many customers are holding off on new deals with agencies or expanding their in-house marketing infrastructure waiting to see if AI can help them cut costs.  That is pure fact and accounts for the tight job market, at least in part.  I also think you don’t really understand the technology.  It’s capable of learning and improving anything. What’s to stop a company from taking all of your work and using AI to replicate and continue it?",
          "score": 1,
          "created_utc": "2026-02-11 12:09:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4upjzv",
          "author": "quantumjedi",
          "text": "AI is going to take some people's jobs. It's not going to erase marketers. AI can do lots of things well, consistently, and cheaply, that people have been getting paid to do at varying skill levels, that's not anything new. That's just technology advancing. I think what the rise of AI does more than anything is push us to different types of marketing, like you said, adding a human touch, using human intuition to know how to key a campaign into the cultural zeitgeist is one of the most important parts of being a marketer.",
          "score": 1,
          "created_utc": "2026-02-11 19:28:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ws1st",
          "author": "Andrej760",
          "text": "Give it 10 more years..",
          "score": 1,
          "created_utc": "2026-02-12 02:01:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54qo8n",
              "author": "Firm_Distribution999",
              "text": "Give it 2 more years. Every 6 months, we experience a 10-year jump in AI capability and quality ",
              "score": 1,
              "created_utc": "2026-02-13 08:23:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4zvut8",
          "author": "Business_Roof786",
          "text": "100% agree. Tools can automate tasks, but they can’t replace taste, intuition, and lived experience. Strategy is still deeply human. AI won’t replace marketers , but it will replace marketers who don’t use AI. 😎 The real shift is augmentation, not elimination.  \nOut of curiosity, how are you addressing responsible AI usage in your campaigns?🤨",
          "score": 1,
          "created_utc": "2026-02-12 15:38:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54qpul",
              "author": "Firm_Distribution999",
              "text": "If your only differentiator is that you use AI tools, you’re one layer away from redundancy. ",
              "score": 1,
              "created_utc": "2026-02-13 08:24:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o56gxif",
          "author": "hell0mat",
          "text": "AI solves many current problems which will inevitably lead to creation of future bigger problems to solve. This had been happening in cycles since people walk on earth.  \n  \nAs a software developer I can now build in half a day the software thing that took me 5 days. But now businesses asks me for 10 things to build in 5 days just to remain in level with competition. \n\nSo go figure.  \n  \nThe AI productivity results hasn't quiet fully kicked in. When it does businesses will need more AI using human staff to keep up with increased level of required business operations to be relevant on the market.  \n  \nAI will be yet another tool in human hands to deal with fresh and newly created issues. Now, more complex ones because thats what we, humans, do. ",
          "score": 1,
          "created_utc": "2026-02-13 15:35:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56lqjk",
          "author": "TheSkepticGuy",
          "text": "\"AI\" is killing the marketing teams of sales-centric organizations. Such companies have always been loath to accept and understand the value of brand positioning, creative excellence/consistency, and customer journey mapping. So if they can replace designers and copywriters wth AI, they are.\n\nI've experienced this firsthand and know many marketing creatives who have as well.",
          "score": 1,
          "created_utc": "2026-02-13 15:58:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5d1gj3",
          "author": "Acrobatic-Aerie-4468",
          "text": "If you are the only person running the marketing firm, that itself says how much technology has enabled you to be productive and make profit all by yourself. Kudos to you.\n\nIf you have a team working for you, then try a few of the Paid AI models for 15 days. After that tell whether you will retain your team and pay them for what AI can do. \n\nThat human touch argument will be thrown out when the quality of the work given by AI is \"good enough\". \n\nAI can produce new stuff through randomness, which can become \"original\" in near future. There is a high chance, so explore before concluding. Don't use the information that others tell you.",
          "score": 1,
          "created_utc": "2026-02-14 16:32:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5en8sw",
          "author": "Odd_Buyer1094",
          "text": "Most of you aren’t built for hard work anyway.\nYou’ve been behind a desk for years.\nNow learn to adapt… or starve.”",
          "score": 1,
          "created_utc": "2026-02-14 21:31:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0vte6",
      "title": "What marketing tool mentioned on this subreddit actually ended up useful?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r0vte6/what_marketing_tool_mentioned_on_this_subreddit/",
      "author": "Mysterious-Age-4850",
      "created_utc": "2026-02-10 08:59:44",
      "score": 46,
      "num_comments": 27,
      "upvote_ratio": 0.98,
      "text": "Hi all- I constantly see people mentioning new and cool marketing tools on this sub, especially after the whole AI craze but until then I haven't had the time to check most of these out! But have a little bit of time on my hand right now!\n\nSo for ones who tried a bunch, what marketing tool mentioned on this subreddit actually ended up useful?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r0vte6/what_marketing_tool_mentioned_on_this_subreddit/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4l2yjc",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 08:59:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l3nci",
          "author": "Ok-Macaron2516",
          "text": "Google Nano Banana has been a game changer in helping us create marketing assets from scratch with simple product images. It can easily turn simple images to full blown product shoots!  \n\nAnother would be Frizerlly! Their AI agent can learn all about your business and competitors to automatically publish an SEO blog on our website every day! We usually let is publish as a draft and manually switch it to published after a quick review! \n\nFinally Youform! We have been massively overpaying for Typeform and ended up recently switching to Youform, which is a much cheaper option with almost all the same features! It's basically free for most use cases as well! Not sure how they are making money lol! ",
          "score": 12,
          "created_utc": "2026-02-10 09:06:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4raemi",
          "author": "Super-Catch-609",
          "text": "If I’m honest, the stuff that actually sticks is pretty simple, Notion for keeping organized, Canva for quick design tweaks, and Zapier for automations. On top of that, I’ve been using GetHookd AI to feed in an existing ad or style and get fresh variations in seconds, definitely speeds up testing without overthinking.",
          "score": 3,
          "created_utc": "2026-02-11 06:38:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mkmq5",
          "author": "Equal-Direction-8116",
          "text": "What usually ends up being useful are the boring ones that remove friction you already feel. Things that surface anomalies, summarize what changed, or reduce manual back-and-forth. Tools that promise to “do marketing for you” rarely stick, but ones that help you see faster or explain performance better tend to earn a permanent place.",
          "score": 2,
          "created_utc": "2026-02-10 15:16:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p67cw",
          "author": "Dry_Procedure_2000",
          "text": "i do not know about tools but one of the comment in this subreddit actually helped my brand some one gave advice about using tiktok and especially tiktok effects AR and gamifcations for brand marketing researched alittle and found tiktok has this branded effects so the tool they had for effect creation was kind of too much for me to handle hired an agency and they did it for 250$ and more then 2500 people recorder videos with this effect and viewer reach was 24million in a month gain around 5k followers on tiktok  and it just started from such comment maybe someone will write about this comment same post one day lol     ",
          "score": 2,
          "created_utc": "2026-02-10 22:32:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4s1m2w",
          "author": "ialwayssaywhaat",
          "text": "we’re using gomarble AI for insights",
          "score": 2,
          "created_utc": "2026-02-11 10:50:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l4eyy",
          "author": "Low_Confection_2433",
          "text": "Following this thread for inspo :) ",
          "score": 2,
          "created_utc": "2026-02-10 09:14:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lsr6q",
              "author": "Fit-Donkey-3181",
              "text": "Same here!",
              "score": 1,
              "created_utc": "2026-02-10 12:41:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4m53cv",
          "author": "Lonely_Mark_8719",
          "text": "I’d break this into smaller experiments instead of trying to optimize everything at once. Pick one metric that actually matters (signups, demos, replies) and test small changes weekly. It’s way easier to see signal when you limit variables.",
          "score": 1,
          "created_utc": "2026-02-10 13:54:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qhirg",
          "author": "Electronic-Cat185",
          "text": "honestly the most useful ones were boring like analytics and heatmaps. tools that show how people actually behave tend to beat shiny ai tools that just promise speed.",
          "score": 1,
          "created_utc": "2026-02-11 03:06:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rmgyh",
          "author": "Different_Dinner9267",
          "text": "Honestly, the best \"tool\" that worked for me wasn't really tool, it's reaching out to nano/micro influenceurs directy. No fancy Platform, just finding creators in your product to an audience that already trust them. Way better ROI most marketing tools i've tried. The tools are great for tracking and optimizing but the real growth comes from people talking about your product authentically. \n\n",
          "score": 1,
          "created_utc": "2026-02-11 08:29:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rrifw",
          "author": "mildlylogical",
          "text": "Here for answers",
          "score": 1,
          "created_utc": "2026-02-11 09:17:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ruo8j",
          "author": "SimonBuildsStuff",
          "text": "Most of what gets mentioned here is either shilling or genuinely useful to one person and useless to everyone else. What we have found actually useful: For content production at scale the tools that worked had constraints built in, not generate anything but generate within these brand rules. The open-ended AI tools produced volume but created cleanup work. Scheduling tools are pretty interchangeable. Analytics tools only matter if you actually look at them. The honest answer is that most tools are not the bottleneck. Process is. A team with a clear workflow and a spreadsheet will outperform a team with expensive tools and no process. What problem are you actually trying to solve?",
          "score": 1,
          "created_utc": "2026-02-11 09:47:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sd0mh",
          "author": "AdhesivenessLevel574",
          "text": "I kept seeing people hype different tools, but the one that actually helped me was the one that saved time on research and made execution easier. Fancy features are great, yet simple workflows that remove manual work usually win in the long run.\n\nDo you like this personality?",
          "score": 1,
          "created_utc": "2026-02-11 12:21:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ytetu",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-12 11:57:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ytfs1",
              "author": "haikusbot",
              "text": "*Nano banana, gpt,*\n\n*Google flow, grok have been great*\n\n*Help in marketing.*\n\n\\- SpiritedAwayInHell\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
              "score": 1,
              "created_utc": "2026-02-12 11:57:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o58qpt1",
          "author": "Tight_Tree8390",
          "text": "Cubeo AI, not a very popular tool, but it made my marketing workflow much more efficient.",
          "score": 1,
          "created_utc": "2026-02-13 22:13:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58yzqx",
          "author": "According-Dinner-495",
          "text": "I honestly couldn’t run my buisness without Go high level",
          "score": 1,
          "created_utc": "2026-02-13 22:58:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2luqh",
      "title": "What Digital Marketing tools should beginners focus on first?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r2luqh/what_digital_marketing_tools_should_beginners/",
      "author": "Entri_App_Official",
      "created_utc": "2026-02-12 06:11:19",
      "score": 43,
      "num_comments": 46,
      "upvote_ratio": 0.98,
      "text": "Share what helped you the most in the comments 👇",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r2luqh/what_digital_marketing_tools_should_beginners/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4xs8fo",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-12 06:11:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xtmwc",
          "author": "supriya_l89",
          "text": "Begin your learning process by studying fundamental concepts instead of attempting to learn multiple tools simultaneously. The beginner stack which works best for beginners includes Google Analytics and Search Console for data analysis, Canva for creating basic graphics, Meta and Google Ads Manager for handling paid advertising, and Ubersuggest or Ahrefs Webmaster Tools as basic SEO tools. Start your learning path by mastering strategic planning and analytical methods because tools will evolve but your ability to comprehend audience behavior and messaging effectiveness and performance metrics will provide lasting benefits.",
          "score": 14,
          "created_utc": "2026-02-12 06:23:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o52qsyh",
              "author": "fatjoe-SEO",
              "text": "This is solid. I’d just add that beginners shouldn’t get tool-obsessed. Most tools overlap a lot. A beginner should understand why he's using them.  \n and Search Console alone can teach you more about user behavior than 10 shiny SaaS dashboards",
              "score": 7,
              "created_utc": "2026-02-12 23:58:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4y842n",
          "author": "LaunchLabDigitalAi",
          "text": "If you are just starting, don't try to learn 25 tools at once. Focus on the essentials that cover research, execution, and measurement.\n\nFirst, Google Analytics and Google Search Console. These are non-negotiable. They teach you how traffic actually works, what keywords bring visitors, and what pages perform. Most beginners skip this and operate blindly.\n\nSecond, a basic keyword research tool like Ubersuggest, Ahrefs (if budget allows), or even Google Keyword Planner. Understanding search intent and keyword demand is foundational for SEO and content marketing.\n\nThird, a simple content and design tool like Canva. You don't need Photoshop in the beginning - Canva is more than enough for social posts, thumbnails, and basic creatives.\n\nFourth, an email marketing tool (Mailchimp, ConvertKit, etc.). Even if your list is small, learning how to build and nurture an audience early is powerful.\n\nAnd finally, a social scheduling tool (like Buffer or Meta Business Suite) to stay consistent without burning out.\n\nBeginners often think advanced tools equal better marketing. In reality, mastering a small stack deeply is far more valuable than juggling everything. What helped me most early on was understanding analytics and search intent - everything else builds on that.",
          "score": 14,
          "created_utc": "2026-02-12 08:40:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4z2tmj",
              "author": "lonerass88",
              "text": "Thankyou this was helpful",
              "score": 1,
              "created_utc": "2026-02-12 13:03:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4zca3i",
              "author": "[deleted]",
              "text": "[deleted]",
              "score": 1,
              "created_utc": "2026-02-12 13:58:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54hnad",
                  "author": "LaunchLabDigitalAi",
                  "text": "That's actually a great transition. As a photographer/videographer, you already understand visuals, storytelling, framing, and audience emotion, which gives you a huge edge in digital marketing. Most marketers struggle with creative; you already have that part.\n\nYes, the list above is a solid place to start. I'd suggest this order for you specifically:\n\nStart with Google Analytics and Search Console, so you understand how traffic and performance work. Then learn basic SEO and keyword research, because that's what connects content to visibility. After that, explore paid ads (Meta and Google Ads) since your creative background will help you massively there. Good creatives often outperform average ones even with the same targeting.\n\nAs for courses, you don't need anything overly expensive at the beginning. Solid options:\n\n* Google's free Digital Marketing & E-commerce Certificate\n* HubSpot's free marketing certifications\n* Meta Blueprint (for paid social)\n\nThose give you structured fundamentals without heavy investment. But here's something important: alongside courses, try applying it immediately. Maybe offer to handle SEO or social strategy for one of your current clients at a small fee or as a test case. Practical experience will teach you faster than theory alone.",
                  "score": 1,
                  "created_utc": "2026-02-13 07:01:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4xx6rb",
          "author": "Dangerous_Bowler3286",
          "text": "If you’re just starting out, don’t try to learn every tool at once. Start with fundamentals first how marketing works, how people buy, how messaging influences action.\n\nThen choose one path based on what feels easier for you. For example, you can focus on Google Ads, Meta Ads, or email marketing but go deep into one before jumping around.\n\nIf you choose email marketing, even free tools are enough at the beginning. That’s where you really understand workflow, systems, targeting, and follow-ups.\n\nThe key isn’t the tool it’s how well you understand the process behind it. Pick what you can learn consistently and what helps you solve real problems.\n\nStart simple, master one area, then expand.",
          "score": 3,
          "created_utc": "2026-02-12 06:55:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xyvi2",
          "author": "Low_Confection_2433",
          "text": "I strongly recommend starting with Google Analytics and Search Console to understand the basics of data and then, from there, decide where you want to get specialised and start choosing the tool or processes you will need to learn",
          "score": 4,
          "created_utc": "2026-02-12 07:10:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y1bg4",
          "author": "Aunker",
          "text": "Most beginners obsess over tools instead of fundamentals. You really only need a small stack to start. Google Analytics and Search Console to understand traffic. One ads platform like Meta or Google to learn paid traffic. Canva for basic creatives. And one simple SEO tool like Ahrefs Webmaster Tools or Ubersuggest. More tools won’t make you better. Knowing how to read data and improve messaging will. Start simple and go deep instead of wide.",
          "score": 3,
          "created_utc": "2026-02-12 07:34:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y9652",
          "author": "Alternative_Yard_170",
          "text": "Tools that automate your digital marketing processes:\n\n1. Inbound - SEO, Content Creation, Scheduling Social Media Posts\n2. Outbound - Cold email, List Building, Ads, Directory Listing\n\nStart with one tool/platform and keep evaluating more as you move forward.",
          "score": 3,
          "created_utc": "2026-02-12 08:50:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y99h3",
          "author": "Terrible-Repair-9421",
          "text": "• Google Search Console – real SEO data  \n• Google Analytics – understand behavior  \n• Canva – quick visuals  \n• Keyword Planner / Ubersuggest – search intent  \n• ChatGPT – ideas + structure\n\nMaster 5 tools, not 20.\n\n",
          "score": 3,
          "created_utc": "2026-02-12 08:51:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yobn8",
          "author": "ki3e",
          "text": "Start with media math - eCPMs, CPCs, CTRs, etc. Define your metrics of success and understand what they mean.\n\nNext understand your channels - social, search, display / video.. what each is used for.\n\nAlign all these to business goals. Brand awareness, performance.\n\nYes it's good to use tools to learn these concepts.. but keep in mind.. media buying will be obsolete in a few years.\n\nIt's learning and understanding the \"why\" that's going to carry you forward and not make you redundant in the future.",
          "score": 3,
          "created_utc": "2026-02-12 11:15:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yue4j",
          "author": "ArmOk3290",
          "text": "The real shift in 2026 is learning how to work with AI tools for content creation and research, not against them. Start with Google Analytics and Search Console for fundamentals, Canva for visuals, and experiment with one AI writing assistant for drafts. The tools will keep changing but understanding data and audience intent stays the same.\n\n  \n",
          "score": 3,
          "created_utc": "2026-02-12 12:04:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yy3hj",
          "author": "Larik_Kroft",
          "text": "If you’re just starting out, don’t try to learn everything at once. Focus on tools that build fundamentals:\n\n1. **Google Analytics (GA4)** – understand traffic, behavior, and conversions. If you can’t measure, you can’t improve.\n2. **Google Search Console** – learn how search works and what people actually find you for.\n3. **Meta Ads Manager or Google Ads** – pick one paid channel and understand targeting + creatives.\n4. **Canva** – fast way to produce decent visuals without a designer.\n5. **An email tool (Mailchimp, Brevo, etc.)** – learn basic lifecycle and retention.\n\nTools change. Principles don’t. Master analytics + one acquisition channel + basic content creation first. The rest builds on that.",
          "score": 3,
          "created_utc": "2026-02-12 12:31:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y3sbr",
          "author": "GTMSignals",
          "text": "First try to understand where you want the core focus if its content focus on AI writing tools understand how to give prompt and focus on research part and if its seo then focus on google analytics and GSC.",
          "score": 2,
          "created_utc": "2026-02-12 07:57:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yp5be",
          "author": "nelsontalk",
          "text": "Start with Google Analytics to track performance and Canva for creating visuals simple tools, yet super effective for beginners.",
          "score": 2,
          "created_utc": "2026-02-12 11:22:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yzzn0",
          "author": "DigitalHarbor_Ease",
          "text": "If you’re a beginner, honestly don’t chase too many tools. Start simple.  \n**GA4** and **Search Console** helped me the most to understand what’s actually working. **Canva** is great for quick creatives, and one SEO tool (Ahrefs/SEMrush or even free ones) is enough to learn basics.\n\nOnce you get comfortable, then move to ads tools. Tools matter, but learning how to read data matters more.",
          "score": 2,
          "created_utc": "2026-02-12 12:44:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50pf65",
          "author": "Yapiee_App",
          "text": "Beginners usually don’t need more tools they need clarity. If I had to restart, I’d focus on:\n\n1. Google Analytics (to understand behavior)\n2. Search Console (to understand demand)\n3. A simple content scheduler\n\nTools matter less than knowing what problem you’re solving.",
          "score": 2,
          "created_utc": "2026-02-12 17:57:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yebn0",
          "author": "jerRy_0009",
          "text": "Have you checked the definiteseo plugin",
          "score": 1,
          "created_utc": "2026-02-12 09:41:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yhh7r",
          "author": "Superb-Novel-3628",
          "text": "For beginners, I think it’s best to start simple. Google Analytics and Search Console are must haves to understand traffic and performance. A basic SEO tool for keyword research and audits helps a lot too. For content and social, even simple scheduling and tracking tools are enough at the start.\n\nThe main thing is learning how to use a few tools properly instead of trying everything at once. This is something we also see at Bonoboz when working with new brands. The tools matter, but strategy and consistency matter more.",
          "score": 1,
          "created_utc": "2026-02-12 10:12:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zbo5s",
          "author": "SeparateQuality8416",
          "text": "Complex tools like GA4( Amplitude ) or any other analytics tools is needed mostly for everyone, for now everyone wants data-driven marketing so analytics is a key, but all the other ones depends on what marketing functions you wanna do. If you wanna run ads - it would be Google or Meta ads and so on",
          "score": 1,
          "created_utc": "2026-02-12 13:55:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zreaa",
          "author": "Dizzy_Attorney9853",
          "text": "Gsc , GA4 and screaming frog , ahref or semrush\nYou need nothing else. Just try to master these and with time you’ll choose your own supportive extension for ease",
          "score": 1,
          "created_utc": "2026-02-12 15:17:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zyt93",
          "author": "Anita78202",
          "text": "New Ai tech like search intent technology.  It will help you get to leads faster and leads that have expressed interest in. your business by typing in your keywords.  Not PPC.",
          "score": 1,
          "created_utc": "2026-02-12 15:52:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50exon",
          "author": "RayzinBran18",
          "text": "Python and ClaudeCode. But more seriously the google ecosystem. GA4 and Search Console. Alongside Python and ClaudeCode / Cowork.",
          "score": 1,
          "created_utc": "2026-02-12 17:07:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50kh8w",
          "author": "Getrekt2333",
          "text": "Ahrefs,Semrush,GA,Tag Manager,Looker Studio",
          "score": 1,
          "created_utc": "2026-02-12 17:33:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50ofd8",
          "author": "Confident-Tank-899",
          "text": "Disagree with the \"master fundamentals first\" take. That's backwards. You learn fundamentals by using tools.\n\n\n\nHere's what actually matters for beginners:\n\n\n\n1. Start with Google Analytics. Seriously, sit with this for 2-3 months before adding anything. Most beginners don't understand what UTM parameters are or why conversion tracking matters. If you don't know this, nothing else makes sense.\n\n\n\n2. Pick ONE channel and go deep. Don't try SEO + Ads + Social simultaneously. You'll be mediocre at everything. I'd pick SEO because it compounds and actually teaches you how marketing works (keyword intent, conversion paths, content strategy).\n\n\n\n3. After 3 months with #1 and #2, then add a design tool (Canva) and an email tool. Not before.\n\n\n\nThe problem with the \"full stack\" approach is beginners get distracted. They spend 2 hours in Figma, 2 hours in Mailchimp, 2 hours trying to set up a CRM, and never actually execute the one thing that would move the needle.\n\n\n\nTools don't matter. Execution matters. 80% of beginners need less tools, not more.",
          "score": 1,
          "created_utc": "2026-02-12 17:52:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53mxpf",
          "author": "Slow-Bake-9603",
          "text": "Wtf is up with all thr bots in this chat",
          "score": 1,
          "created_utc": "2026-02-13 03:12:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54vco7",
          "author": "Key_Salamander_7733",
          "text": "Start with the essentials:\n\nGoogle Search Console (to understand real search data), Google Analytics (to track behavior), and one keyword research tool. Master the basics before jumping into advanced automation tools.",
          "score": 1,
          "created_utc": "2026-02-13 09:07:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58ic59",
          "author": "sawaisingh",
          "text": "Most beginners don’t struggle because they lack tools. They struggle because they don’t know what question they’re trying to answer.\n\nBefore picking tools, I’d suggest understanding:\n\n* What problem are you trying to solve?\n* Is it traffic, conversion, retention, or positioning?\n* What metric would prove progress?\n\nGoogle Analytics, Search Console, ads managers, etc. are useful. But without clarity on the decision behind them, they just become dashboards.\n\nIn my experience, learning how to interpret data matters more than learning how to operate software.\n\nTools change every few years. Decision-making doesn’t.",
          "score": 1,
          "created_utc": "2026-02-13 21:32:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58r4vf",
          "author": "Tight_Tree8390",
          "text": "Google Search Console helped me the most early on because it shows what people are actually finding you for and what’s worth improving. \n\nCanva is great for visuals, and Notion helped me stay organized.\n\nI also use Cubeo AI for marketing workflows like research, content briefs and updates. It’s not complex and doesn’t require technical skills, which makes it easier to actually use AI in practice instead of just experimenting.\n\nThe biggest mistake is using too many tools too early. A few simple tools you understand well are much more valuable than a stack you barely use",
          "score": 1,
          "created_utc": "2026-02-13 22:15:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jmr7g",
          "author": "Confident-Tank-899",
          "text": "Honestly the best advice I got early on was to pick ONE channel and master it first instead of trying to learn everything at once. Everyone always talks about all these tools but the gap isn't the tools, it's understanding your fundamentals.\n\n\n\nGoogle Analytics and Search Console are non-negotiable, that part everyone nailed here. But then just pick either content, paid, or email, get really good at one, and THEN expand. I spent months juggling 5 things, felt productive, got nowhere.\n\n\n\nOnce I focused on one thing and actually had systems for it, the other channels made way more sense. Plus you'll actually have data to inform your next moves. What channel are you planning to focus on first?",
          "score": 1,
          "created_utc": "2026-02-15 18:05:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0z9p2",
      "title": "GEO for local business? Is it possible? Are there any strategies I need to research?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r0z9p2/geo_for_local_business_is_it_possible_are_there/",
      "author": "Cupcakii",
      "created_utc": "2026-02-10 12:21:18",
      "score": 30,
      "num_comments": 35,
      "upvote_ratio": 1.0,
      "text": "I run an agency for local businesses and we're getting more questions from our clients about showing up in Al-generated answers for location specific questions. Like when someone asks Chatgpt \"best dentists in Austin\", can we influence our clients to show in those searches?\n\nBecause I know with regular SEO we'd do Google Business Profile, local citations, location pages, reviews, but I genuinely have no idea if any of that matters for Al or if LLMs pull from totally different signals.\n\nWhat are you guys doing for local GEO? Or are we just telling clients it's a blackbox since we'd have no way of knowing if its working?? I know basically nothing about this lol",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r0z9p2/geo_for_local_business_is_it_possible_are_there/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4lpuku",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 12:21:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lu0qb",
          "author": "imaginary_name",
          "text": "Sure you can. When a user asks his chatGPT a question \"recommend me the best dentists in Austin\", the LLM does a QFO (query fan out) and sends multiple sub-queries to Google and/or Bing.  \nYou need to rank for the long tailed search queries in QFO, in case of your dentist, it would probably be queries along the lines of \"top dentists in travis county\" \"top dentist austin area 2025\" and so on.",
          "score": 8,
          "created_utc": "2026-02-10 12:49:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lu6x4",
          "author": "mariyagel",
          "text": "Local GEO isn’t directly controllable yet, but strong local SEO helps indirectly through consistent reviews, PR submissions, and brand mentions.",
          "score": 5,
          "created_utc": "2026-02-10 12:50:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lvtja",
          "author": "Fit-Donkey-3181",
          "text": "Are you sure this even matters yet? personally wouldn't allocate\nbudget unless their GA shows some traffic from ChatGPT and others. Imo, monitor for free, only optimize if you see actual signal it's driving business. I'd assume most of the small local clients are operating with a smaller budget so you need to be choosy.",
          "score": 3,
          "created_utc": "2026-02-10 13:01:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lwb5c",
          "author": "ArmOk3290",
          "text": "Honestly GBP and reviews still matter most since LLMs scrape Google rankings heavy. Add schema markup to location pages, get featured in local pubs/blogs for authority signals. Track with GA4 chatgpt referrals if any. Its early but traditional local SEO translates 70% imo.",
          "score": 2,
          "created_utc": "2026-02-10 13:04:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lz2j3",
          "author": "Rikkitikkitaffi",
          "text": "Publishing to knowledge graphs that are on the LLMs' radars is a concrete way to increase the probability of surfacing in response to a user's LLM query.  Gemflush is one platform that does the publishing for local businesses, other platforms provide various metrics for measuring the impact as well and address enterprise brand monitoring.  Anecdotally, I know of one dentist that had specific mercury-free amalgams specified as a service in a kg and got a handful of inbound solicitations from new patients citing that same service, and prior to that he doesn't think he ever heard a patient use the term amalgam.  As everyone says everywhere, if you're not in the graph, they're gonna laugh.",
          "score": 1,
          "created_utc": "2026-02-10 13:21:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m2jz0",
          "author": "sriracha_saws",
          "text": "What metrics are you even reporting to clients for this? Like with SEO it's rankings and traffic. With GEO what's the KPI?",
          "score": 1,
          "created_utc": "2026-02-10 13:41:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m5c6b",
              "author": "Maybe_Synthren",
              "text": "Yeah this is part of my hesitation too. What do we even measure success by?",
              "score": 1,
              "created_utc": "2026-02-10 13:56:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4n4mrp",
              "author": "Putrid-Conference409",
              "text": "From what I have seen, most agencies are just monitoring AI answers right now, not really trying to optimize them yet.\n\nThere is still no clear KPI like rankings in SEO.\n\nLocal SEO basics still seem to help though. Reviews, citations, and mentions in local sites show up pretty often in AI answers.\n\nFeels very early still.",
              "score": 1,
              "created_utc": "2026-02-10 16:50:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4ojpk5",
              "author": "RayzinBran18",
              "text": "Ahref and SEMrush have early ai overview results that are correlated to search volume, but you have to pay for a new tier. Search Console does have data for people who found you through AI-Mode in Google though.",
              "score": 1,
              "created_utc": "2026-02-10 20:46:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4rbge0",
              "author": "td1176",
              "text": "The most common metrics I’m seeing (and what was heavily discussed at Brighton SEO last sparked) are: authority score, number of monthly LLM citations, and AI share of voice. There are others, but it’s all still rapidly evolving.",
              "score": 1,
              "created_utc": "2026-02-11 06:47:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4n6a16",
          "author": "RKulegi",
          "text": "Do PR oof your client business, diversify reviews to all the important platforms that top rankings businesses are doing, and then get high quality backlinks from niche relevant websites using guest posts, sponsered posts.",
          "score": 1,
          "created_utc": "2026-02-10 16:58:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nd1kk",
          "author": "Yapiee_App",
          "text": "From what I’ve seen, local GEO still borrows heavily from the same real-world signals as local SEO, but filtered through trust. Mentions in reviews, local media, forums, and comparison threads seem to matter more than classic citations. It’s less rankable and more about being consistently referenced where AI pulls context from.",
          "score": 1,
          "created_utc": "2026-02-10 17:29:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ndvjl",
          "author": "Larik_Kroft",
          "text": "Yes, local GEO is possible, but it’s indirect.\n\nLLMs don’t rank like Google. They learn from public web mentions over time. Brand + location mentions, third-party reviews, and solid location pages help. GBP matters only indirectly.\n\nGEO = probability of being mentioned, long-term, hard to measure. Anyone promising direct optimization is guessing.",
          "score": 1,
          "created_utc": "2026-02-10 17:33:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nril6",
          "author": "Confident-Tank-899",
          "text": "Local GEO is definitely possible and honestly still works really well. The stuff you mentioned like Google Business Profile, local citations, and location pages are still the foundation. Your problem with AI is valid though because those tools can't understand the nuances of your specific market. What I do is focus on things like local reviews management and making sure your NAP (name address phone) is consistent across every directory. The AI stuff can generate templates but you have to understand your actual local competitive landscape. Also getting local backlinks from chamber of commerce, local media, that kind of stuff matters way more than the AI tools will tell you.",
          "score": 1,
          "created_utc": "2026-02-10 18:35:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4r14z4",
          "author": "addllyAI",
          "text": "It’s not completely different from local SEO, but the visibility comes more indirectly. AI answers often pull from places that already summarize local businesses, like review sites, directories, and well-structured location pages. Businesses that have consistent info, strong reviews, and clear service pages tied to specific locations tend to show up more often in those sources. It’s less about optimizing for AI directly and more about making sure the business is clearly represented in the places AI systems already trust.",
          "score": 1,
          "created_utc": "2026-02-11 05:21:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4r6s1i",
          "author": "supriya_l89",
          "text": "The current situation prevents you from ranking AI responses because the system lacks the same ranking capabilities as Google. The basic principles of local SEO remain essential because LLMs use public web signals as their primary source of information. Strong GBP profiles, consistent citations, high-quality reviews, local press mentions, and clear location/service pages all help build entity trust. I would concentrate on structured data and authoritative directory listings and local site mentions because AI models use trustworthy sources as their primary reference material. The most important requirement at this moment demands that businesses handle GEO as an additional facet which connects effective SEO and brand authority while explaining to clients that tracking and attribution capabilities remain restricted.",
          "score": 1,
          "created_utc": "2026-02-11 06:06:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rhnwc",
          "author": "AgilePrsnip",
          "text": "you’re not crazy, local geo is fuzzy right now, but it is not a total black box. most llms pull from a mix of bing, structured web data, high authority directories, and review platforms, so your local seo basics still matter. tighten nap consistency, add solid localbusiness schema, build out real location pages with unique details, and push for detailed reviews that mention services plus city names. get listed on trusted local directories that actually rank, not junk ones. track branded search lift and ask new leads how they found you to spot ai influence. it is messy, but it is not random.",
          "score": 1,
          "created_utc": "2026-02-11 07:43:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rzjiw",
          "author": "sangeetseth",
          "text": "total valid question.\n\nchatgpt doesn't really \"browse\" the google map pack the same way a user does. it relies heavily on **text** and **directories**.\n\ntraditional seo (gbp, citations) is still the baseline. you need those to exist.\n\nbut for geo (generative engine optimization), the game is **context**. if someone asks \"cheapest emergency dentist in austin\", the llm is looking for pricing and \"emergency\" keywords on the actual page, not just a category tag on google maps.\n\nmy strategy for local clients:\n\n1. **detailed service pages:** stop just listing \"teeth cleaning\". write the full pricing, process, and faq for every single service.\n2. **structure the reviews:** don't just use a widget. put the top reviews in actual text on the page so the llm can read \"best for kids\" and associate it with your brand.\n\nhonestly, i automate the service page creation now because writing unique descriptions for 50 local keywords is a nightmare. once we structured the data, we started showing up in those \"best of\" ai answers.\n\nit’s not a black box. it’s just a text box. feed it better text.",
          "score": 1,
          "created_utc": "2026-02-11 10:31:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sdtwk",
          "author": "svlease0h1",
          "text": "you are not wrong about local geo feeling unclear right now. llms tend to repeat businesses that show strong location proof across reviews, local pages, citations. publish city faq content, grow reviews each month, keep business listings consistent across platforms. one dentist client started appearing in ai answers after review count crossed about 70 within two months.",
          "score": 1,
          "created_utc": "2026-02-11 12:27:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4shopb",
          "author": "webgility_hq",
          "text": "LLMs don’t rank businesses the way Google does, so there isn’t really a direct GEO playbook yet.\n\nThat said, they still rely on strong underlying signals. Consistent NAP data, solid Google Business Profiles, structured schema markup, clear location-specific service pages, and strong third-party reviews all help reinforce your business as a credible local entity.\n\nIt’s less about AI-specific hacks and more about strengthening your overall digital footprint across trusted sources.",
          "score": 1,
          "created_utc": "2026-02-11 12:53:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4t7wkx",
          "author": "phb71",
          "text": "Yea they do matter. Just having a google business profile is a simple difference between being visible and invisible. \n\nYou need to create content onsite - check programmatic SEO for this. \n\nYou also need to be present offsite - local forums, public social media threads, etc.\n\nWe help a few local biz with this - check airefs (not ahrefs)",
          "score": 1,
          "created_utc": "2026-02-11 15:17:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o544b2g",
          "author": "akash_09_",
          "text": "Local SEO will matter the most in GEO.. since they are most trustworthy data for these AIs. so if you're doing good local SEO, it'll help a lot. though you can look for specific sources these AI giving the answers from and try to be present over there... how to look for sources? you can use any tool in the market.. Amadora AI might be one of the best options. ",
          "score": 1,
          "created_utc": "2026-02-13 05:11:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hl9gp",
          "author": "Available_Cup5454",
          "text": "Build entity authority with consistent NAP, structured data, and third party mentions tied to the exact city modifier then publish location pages that mirror how people phrase questions and update them monthly so the model keeps refreshing its source confidence.",
          "score": 1,
          "created_utc": "2026-02-15 10:42:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jwxm2",
          "author": "TankAdmin",
          "text": "The fundamentals still matter (GBP, NAP consistency, reviews), but AI pulls differently than Google.\n\nWhat I've found testing this since May: entity-level infrastructure matters more than content volume. Schema markup, professional directory listings (NAHA, AIA for my aromatherapy work), consistent presence across platforms.\n\nThe invisible tenant problem is real. Solo practitioners in salon suites, estheticians, massage therapists get skipped even with great reviews because they lack entity presence separate from the building they work in.\n\nLocal GEO works, but it's entity optimization, not content optimization.\n\nI'm documenting the whole methodology at The Visible Practitioner. Test it yourself first.",
          "score": 1,
          "created_utc": "2026-02-15 18:54:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5kukb9",
          "author": "evanmrose",
          "text": "The core pain is getting local/search signals to line up across platforms and AI risk of invisibility. To actually move the needle 1) pick 2 core local outcomes (e.g., more verified NAP consistency checks weekly; higher review velocity). 2) Create a lightweight AI-assisted audit: scan 5 listings daily for NAP variance and schema gaps; auto-suggest fixes in a mini 2‑step checklist per site. 3) standardize 1-page SOP per platform (update cadence, who does what). What’s your current split between directories vs. on-site schema?",
          "score": 1,
          "created_utc": "2026-02-15 21:45:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ngucs",
          "author": "GPTinker",
          "text": "Great question. We faced the exact same inquiries from our local clients about 6 months ago. Telling them \"it's a black box\" is leaving money on the table. While AI algorithms are opaque, the inputs they rely on are actually very clear.\n\nHere is how we explain (and sell) \"Local GEO\" vs. \"Local SEO\":\n\n1. The Shift from \"Proximity\" to \"Sentiment\"\n\nLocal SEO (Google Maps): Cares about where the user is standing (Proximity).\n\nLocal GEO (ChatGPT/Perplexity): Cares about what people are saying.\n\nActionable Step: We optimize reviews not just for stars, but for keywords. If a client wants to rank for \"Best Emergency Dentist,\" we encourage reviews that specifically mention \"saved me in an emergency.\" LLMs read this semantic context and serve it as an answer.\n\n2. Data Consensus (The Trust Signal)\n\nLLMs hallucinate, so they crave verification. If your client's NAP (Name, Address, Phone) varies across Yelp, Apple Maps, and Bing, the AI lowers its \"Confidence Score\" and won't recommend them.\n\nOur pitch: \"We sanitize your data so the AI trusts you enough to recommend you.\"\n\n3. The \"Best Of\" Ecosystem\n\nWhen you ask ChatGPT for a recommendation, it often synthesizes answers from top-ranking blog posts like \"Top 10 Dentists in Austin.\"\n\nStrategy: Getting your client mentioned in these local \"listicles\" is essentially the new backlink strategy for AI.\n\nSo no, don't tell them it's unknown. Tell them you are optimizing their \"Digital Trust Footprint\" so AI models feel safe recommending them.\n\nHope this helps frame it for your agency!",
          "score": 0,
          "created_utc": "2026-02-10 17:47:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r54x42",
      "title": "What’s the best site to buy Instagram followers? Looking for Honest experiences",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r54x42/whats_the_best_site_to_buy_instagram_followers/",
      "author": "That-Bobcat-167",
      "created_utc": "2026-02-15 04:05:04",
      "score": 26,
      "num_comments": 8,
      "upvote_ratio": 0.82,
      "text": "Hi everyone, \n\nI'm looking for the best site to buy Instagram followers for my profile. There are many sites which are claiming to provide real growth, but I’m not sure which actually works. I’ve never bought followers and before actually trying this service, I want to hear from people who have experience with such sites. \n\nSo far, I've tried to make my profile stand out by adding a high-resolution profile picture, a well-written bio, and pinning my best posts to the top. Im also using hashtags related to my niche and appealing captions with each post. But still, the organic growth is slower than I thought. \n\nThat's why I'm looking for a reputable and working platform that offers the best service for buying followers. Every other site says they offer real followers, their service is safe and it helps to increase organic growth of an Instagram profile. But its hard to know which actually provide best results. \n\nBefore trying anything, I want to understand the real impact from people who have tested these services. \n\nFor those who have bought followers before: \n\n● Did the followers look like real people with posts and activity? \n\n● Did they interact with your content at all, or just increase the number? \n\n● Did your reach, impressions, or engagement change after buying? \n\n● Did it help attract real followers later, or did growth slow down? \n\n● Did you notice any issues with the algorithm, shadow bans, or reduced visibility? \n\n● Did these Instagram followers drop over time, and were they replaced? \n\n● How was customer support if something went wrong? \n\n● In hindsight, was it worth the money?\n\nMy main goal isn't to increase numbers only. I want to build real credibility, maintain healthy engagement, and grow without risking my Instagram account. I'm especially interested in whether buying followers can ever support organic growth or hurt it.\n\nI'm not looking for promotions or affiliate links, only honest experiences, good or bad, from people who have tried it.\n\nThanks in advance for sharing your experiences.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r54x42/whats_the_best_site_to_buy_instagram_followers/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5gdabq",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-15 04:05:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5n5812",
          "author": "Ok_Addition3639",
          "text": "Honest advice: don't do it. You mentioned your main goal is to build real credibility, but buying followers is actually rather a quick way to destroy it.\n\nFrom a data perspective, the Instagram algorithm heavily favors Engagement Rate (Engagement / Total Followers). If you buy 5,000 followers, they will be inactive bots. When you post that high-quality content you mentioned, your new \"followers\" won't interact with it. This crashes your engagement rate.\n\nYou may even get shadow-banned and see your profile get hurt even more.\n\nWhen the algorithm sees a large account with near-zero engagement, it signals that the content is irrelevant or low-quality. The result? It actually stops showing your posts to the real organic followers you already have. You essentially pay to get \"shadow-banned\" by the math.\n\nSince you are already creating good content, I suggest to take the budget and put it into a legitimate Engagement or Traffic objective ad campaign. Boost your top-performing organic post to get you in front of audiences who are actually interested in your niche. That is how you build authority that sticks.\n\nBuying followers is almost always a negative ROI play long-term.",
          "score": 3,
          "created_utc": "2026-02-16 06:42:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5o4wbq",
          "author": "Ash_Skiller",
          "text": "Buying followers usually hurts engagement and credibility. Real audience growth and targeted promotion work much better long term. Brecktic focuses on branding and authentic growth instead of fake boosts.",
          "score": 3,
          "created_utc": "2026-02-16 12:07:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pfbh8",
          "author": "Frost_lannister",
          "text": "Buying followers completely messes up your current audience and core metrics, hence I'd advise against this cause of action",
          "score": 2,
          "created_utc": "2026-02-16 16:24:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5q3mng",
          "author": "Separate_Ad_4781",
          "text": "\nFocus on Reels; that is how people are getting 1k followers quickly now.",
          "score": 2,
          "created_utc": "2026-02-16 18:16:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5q6fdx",
          "author": "Middle-Dirt2899",
          "text": "I'm also interested in such an option, if it exists!",
          "score": 2,
          "created_utc": "2026-02-16 18:29:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sk2n3",
          "author": "delhitop_7inches",
          "text": "\nif you want worthless numbers go for it, the boost lasts five minutes.",
          "score": 1,
          "created_utc": "2026-02-17 01:55:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jk23e",
          "author": "gurtjit",
          "text": "I've used SocialFuel and their services weren't bad and didn't drop on me so I would recommend them. Focus more on the content side of things tho cuz that matters more and will help you more in the long run.",
          "score": -5,
          "created_utc": "2026-02-15 17:52:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2yfoi",
      "title": "Took me 5 years to learn this satisfying thing - some clients are NOT worth saving",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r2yfoi/took_me_5_years_to_learn_this_satisfying_thing/",
      "author": "darmaan-seowizard",
      "created_utc": "2026-02-12 16:45:19",
      "score": 23,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "Early in my career, I had this mindset that if a client was unhappy or leaving, it was MY failure. So I'd bend over backwards, extra revisions, discounted rates, working weekends just to \"save\" them.\n\nOne client in particular wrecked me for months. E-commerce brand, decent budget, but impossible expectations. They wanted page 1 rankings in 4 weeks for keywords that had 50K+ monthly searches. When I explained that's not how SEO works, they'd go quiet... then come back a week later asking why they're not ranking yet.\n\nI kept trying to educate them. Kept sending reports. Kept justifying every move.\n\nEventually, they left anyway. Called my work \"too slow.\"\n\nHere's what hit me later: I spent SO much energy on someone who was never going to be happy, that I half-assed my communication with 3 other clients who actually trusted me. One of them even churned because I was \"hard to reach.\"\n\nLost a good client trying to save a bad one.\n\nNow I qualify harder upfront. If someone's first question is \"how fast can you rank me #1\", I know we're probably not a fit. And I'm genuinely okay with that.\n\nHas anyone else been through something similar? Curious how others handle the \"this client is draining me, but I don't want to quit\" situation.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r2yfoi/took_me_5_years_to_learn_this_satisfying_thing/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o50a5uk",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-12 16:45:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52qvax",
          "author": "RobertLigthart",
          "text": "the \"lost a good client trying to save a bad one\" part is the real lesson here. opportunity cost is invisible until its too late\n\n  \nmy red flag list now: asking for guarantees on rankings, comparing you to their last agency in the first call, wanting weekly reports but never reading them. if you hit 2 out of 3 just save everyone the trouble",
          "score": 3,
          "created_utc": "2026-02-12 23:59:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50nghh",
          "author": "Confident-Tank-899",
          "text": "This took me way too long to learn. I used to think every client problem was my fault, like I just needed to explain better or work harder. Spoiler: some people just don't want results, they want problems to complain about.\n\n\n\nThe clients worth keeping have these in common:\n\n\\- They actually read and implement feedback\n\n\\- They're honest about their budget from the start\n\n\\- They have realistic timelines\n\n\\- If something isn't working, they want to fix it instead of blame you\n\n\n\nThe nightmare clients:\n\n\\- They ask for \"quick and cheap\" like that's how marketing works\n\n\\- They compare your work to a competitor's multi-million dollar campaign\n\n\\- They want results without actually giving you the information you need\n\n\\- They disappear for months then ask why nothing changed\n\n\n\nOnce I started saying no to bad fits, my revenue actually went up because I had time to actually deliver for people who weren't draining me.",
          "score": 1,
          "created_utc": "2026-02-12 17:48:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50ojjz",
          "author": "ladipn",
          "text": "Yh, i think most learn this way. The relationship needs to be reciprocal. Unless you’re at risk of homelessness, the juice is rarely worth it for clients who want miracles.\n\nSometimes that attempt at education is actually counter productive as you’re teaching them that being difficult will produce more attention. \n\nBe firm and clear upfront.\n\nI wouldn’t ever ignore a client but very happy to reiterate a simple point without wasting everybody’s time.",
          "score": 1,
          "created_utc": "2026-02-12 17:53:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o524iqy",
          "author": "Adcero_app",
          "text": "same thing on the paid ads side. had a client who'd approve a campaign strategy, then panic two days in and want to change everything because \"it's not converting yet.\" two days. on a cold audience.\n\nended up spending more time managing their anxiety than actually optimizing the campaigns. meanwhile my other accounts were on autopilot when they shouldn't have been.\n\nthe moment I started qualifying on patience and realistic expectations, the quality of my work across the board went up. some people just want someone to blame when things don't go perfectly, and no amount of reporting or education changes that.",
          "score": 1,
          "created_utc": "2026-02-12 21:59:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52pa9u",
          "author": "fatjoe-SEO",
          "text": "The real cost isn’t the difficult client, it’s the opportunity cost.  \n draining account can quietly lower the quality of delivery for 3 good ones. Most agencies only realize that after losing a solid client trying to save a bad fit",
          "score": 1,
          "created_utc": "2026-02-12 23:50:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53vg1j",
          "author": "Terrible-Repair-9421",
          "text": "This is a painful but powerful realization.\n\nNot every client who leaves is a failure some are just misaligned from the start. When expectations are unrealistic, no amount of extra work or reporting will make them satisfied. The real danger is exactly what you said: draining clients steal time and energy from the good ones.\n\nLearning to qualify harder upfront isn’t quitting it’s protecting your business.\n\nSometimes the most professional move isn’t saving the client.  \nIt’s choosing not to take them on.",
          "score": 1,
          "created_utc": "2026-02-13 04:08:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53wox7",
          "author": "asunder3000",
          "text": "Totally resonate with this lesson! It’s so hard to step away when you’ve got good intentions and you want to genuinely help. I had a client who needed help with their online store but had zero interest in actual doing the stuff needed that would help us make it happen. I had to use my contract to get out of it after trying and facing unrealistic expectations",
          "score": 1,
          "created_utc": "2026-02-13 04:17:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53ybyp",
          "author": "SimonBuildsStuff",
          "text": "The good client you lost chasing the bad one is the real cost. You just don't see it until it's too late.\n\nTime-box the effort. If you're spending 2x on a client, that's a signal. Name the mismatch early, in writing. And when it's clearly not working, offer an exit. The relief is worth more than the revenue.\n\nBest filter I've found: ask them about their last agency. If they hated everyone, they'll hate you too.",
          "score": 1,
          "created_utc": "2026-02-13 04:28:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54uypr",
          "author": "Beneficial_Youth_844",
          "text": "I also learnt this few months back. Hope new comers will get lesson from this and save themself from this headache of losing a good client, in trying to saving the bad one. After losing the client the mental situation becomes worse and we assume that we can not bring results that is why clients leave",
          "score": 1,
          "created_utc": "2026-02-13 09:04:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55gnq5",
          "author": "Scary_Historian_9031",
          "text": "the gut punch here is the good client who left quietly while you were busy babysitting the impossible one. had almost the exact same setup - difficult client kept changing goalposts weekly, meanwhile my chill client who actually trusted the process just ghosted one day because i was \"hard to reach.\" losing a client who liked you hurts infinitely worse than losing one who was never going to be happy.",
          "score": 1,
          "created_utc": "2026-02-13 12:14:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r47opk",
      "title": "My 60-day experiment with \"Faceless\" AI channels. Here is what actually made money vs. what stayed at zero views.",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r47opk/my_60day_experiment_with_faceless_ai_channels/",
      "author": "SuccotashSignal3715",
      "created_utc": "2026-02-14 01:44:52",
      "score": 22,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "The \"Faceless Channel\" hype is everywhere right now, but most of the advice is just gurus trying to sell a course. I decided to actually put some hours into it to see if a normal person can make an extra $500/month.\nI tested three niches: AI kids' stories, \"Daily Stoic\" motivation, and travel lists.\nWhat actually worked:\nThe \"Stoic\" niche was the winner. People love short-form inspiration. I’m currently at $140 in ad-share and a small affiliate deal. Not \"quit your job\" money, but it’s growing.\nThe \"Stack\" (All have free tiers):\nScripting: ChatGPT. Tip: Ask it to write in a specific author's style to avoid that \"robotic\" feel.\nVoiceover: ElevenLabs. It sounds human enough to keep people watching.\nVisuals: Leonardo.ai for images and Pexels for stock footage.\nEditing: CapCut. The \"Auto-Captions\" are a non-negotiable for mobile.\nMy 3 Big Takeaways:\nRetention is everything. If your first 3 seconds don't hook them, the algorithm kills the video.\nInstagram and TikTok are search engines now. I started ranking higher once I put keywords in my \"Name\" field (e.g., \"Daily Wisdom | Stoic Motivation\").\nThe \"Quality\" Trap. Don't spend 5 hours on one video. Spend 30 minutes. Volume \"trains\" the algorithm on who your audience is.\nI’m not selling anything and I'm not here to share links. Just wanted to post some real-world data because I’m tired of the \"passive income\" lies.\nWhat are you guys currently using to automate your workflow? I feel like I'm still spending too much time on captions.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r47opk/my_60day_experiment_with_faceless_ai_channels/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o59qivc",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-14 01:44:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5aumy3",
          "author": "aech_afiz",
          "text": "Cool bro",
          "score": 1,
          "created_utc": "2026-02-14 06:36:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5b3oq0",
          "author": "vahidfaal",
          "text": "I wanted to do it for a long time but was very skeptical. Good to see you actually earned something. Do you post on TT, IG and YouTube? Assume it’s only YT that shared ad revenue. \nHow long are your videos usually?",
          "score": 1,
          "created_utc": "2026-02-14 08:00:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5l1igv",
          "author": "unicorn69love",
          "text": "yo that stoic niche is smart evergreen gold   retention on motivation vids is insane if you nail the hook. on automating captions and workflow i switched to vidmachine after grinding capcut like you, it spits out full shorts with ai scripts voices visuals and auto-captions then posts direct to yt/tt, cut my time to like 5 mins per vid. scales way better than manual stacks tbh",
          "score": 1,
          "created_utc": "2026-02-15 22:21:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pcx42",
          "author": "Defiant-Example-8212",
          "text": "Ancient  of history\n\n![gif](giphy|22EKRZrceeBSxXMbxX)",
          "score": 1,
          "created_utc": "2026-02-16 16:13:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4ki6a",
      "title": "What are the SEO tactics you should NEVER do, no matter how tempting?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r4ki6a/what_are_the_seo_tactics_you_should_never_do_no/",
      "author": "SERPArchitect",
      "created_utc": "2026-02-14 13:22:28",
      "score": 21,
      "num_comments": 21,
      "upvote_ratio": 0.93,
      "text": "We always see posts about \"what moves the needle in SEO\" or \"best practices to rank higher\" - but I'm curious about the opposite.\n\nWhat are the SEO tactics that you should absolutely avoid, even when you're desperate for rankings or when competitors seem to be getting away with them?\n\nI'm talking about things that might work short-term but will hurt you long-term, or practices that seem harmless but are actually red flags for Google.\n\nWhat's on your \"never do this\" list and why?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r4ki6a/what_are_the_seo_tactics_you_should_never_do_no/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5c3cy3",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-14 13:22:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5c625f",
          "author": "thelwb",
          "text": "Never listen to random people on the Internet",
          "score": 10,
          "created_utc": "2026-02-14 13:40:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5flknx",
              "author": "remixclashes",
              "text": "Nice try random internet person.",
              "score": 4,
              "created_utc": "2026-02-15 00:54:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5i0y6g",
              "author": "Starter-for-Ten",
              "text": "r/SEO is full of people that have no clue (including the mods), so clueless! ",
              "score": 2,
              "created_utc": "2026-02-15 12:57:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5dmghb",
          "author": "Massive-Poet-767",
          "text": "Biggest ones that still tempt people:\n\n**PBN links** — Private blog networks worked great until they didn't. One manual penalty and your entire site is gone. Not worth the Russian roulette.\n\n**AI-generated content at scale without editing** — Google's getting scary good at detecting mass-produced AI content. Using AI as a starting point? Fine. Publishing 200 unedited AI articles? You're building on a house of cards.\n\n**Exact-match anchor text spam** — If 60% of your backlinks say \"best email marketing tool\" Google knows exactly what you're doing.\n\n**Buying links from \"authority\" sites** — Those DR 70+ sites selling guest posts for $200? Google has a list. Everyone who's bought from them gets hit in the same wave.\n\n**Keyword stuffing in 2026** — Sounds obvious but I still see agencies doing it with synonyms. \"Our *email marketing platform* is the best *email marketing solution* for *email marketing campaigns*...\" Google reads that as spam because it IS spam.\n\nThe boring truth: create genuinely useful content, build real relationships for links, and be patient. Not sexy, but it compounds.",
          "score": 6,
          "created_utc": "2026-02-14 18:18:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hbxfe",
              "author": "windex88",
              "text": "All of those things unequivocally still work (situationally) in 2026. Sounds like you've learnt seo by reading and not doing.",
              "score": 2,
              "created_utc": "2026-02-15 09:11:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5foxdy",
              "author": "willingseraph",
              "text": "What do you do instead of PBN for link building?",
              "score": 0,
              "created_utc": "2026-02-15 01:16:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5dnqv3",
          "author": "proriterz",
          "text": "Several. Doing automated citations, try to stuff keywords, BH seo all in all itself screams - NO",
          "score": 2,
          "created_utc": "2026-02-14 18:24:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5fzznb",
          "author": "HarjjotSinghh",
          "text": "spoiler: never spam my keywords like a toddler.",
          "score": 2,
          "created_utc": "2026-02-15 02:30:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5g0iz5",
          "author": "GlitchAronwald",
          "text": "Buying backlinks from link farms or PBNs. Google's gotten way too good at spotting unnatural link patterns, and the penalty isn't worth the temporary boost. Also, keyword stuffing in 2026 is basically self-sabotage. Focus on semantic relevance and user intent instead of cramming exact-match phrases everywhere.",
          "score": 2,
          "created_utc": "2026-02-15 02:34:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5eb7hh",
          "author": "Ok-Depth1397",
          "text": "building hundreds of thin pages targeting keyword variations. it feels productive because the traffic comes in fast. then one core update wipes out 80% of it overnight because google figured out none of those pages actually helped anyone.",
          "score": 1,
          "created_utc": "2026-02-14 20:26:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5f6xnd",
          "author": "cheekymonkey_toronto",
          "text": "White text on a white background? Lol",
          "score": 1,
          "created_utc": "2026-02-14 23:24:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gi51l",
          "author": "Genxdada",
          "text": "Service area links for the 300 nearest town bars in your footer.",
          "score": 1,
          "created_utc": "2026-02-15 04:42:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gzwt3",
          "author": "acapkenobi",
          "text": "Posts made solely for the purpose of obtaining backlinks.",
          "score": 1,
          "created_utc": "2026-02-15 07:15:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hhpos",
          "author": "ChestChance6126",
          "text": "Buying links from obvious networks and pumping out thin AI content at scale. they can move rankings fast, but when the footprint gets flagged, cleanup is painful. anything that optimizes for loopholes instead of user intent usually comes back to bite you.",
          "score": 1,
          "created_utc": "2026-02-15 10:08:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mpmq5",
          "author": "Most_Armadillo_4601",
          "text": "One thing I've learned to avid is pushing execution before a page or site is actually ready for it.\n\nI've seen teams invest heavily in content production, link building, or technical optimization when the core pages still don't clearly match search intent or guide users well. Nothing is technically \"wrong,\" but results don't compound because the foundation isn't aligned yet.\n\nThe tempting part is that these tactics feel productive short-term, but they often just add more noise instead of strengthening rankings.\n\nCurious if others have seen cases where good SEO work failed simply because it was done too early?",
          "score": 1,
          "created_utc": "2026-02-16 04:37:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5fj4vg",
          "author": "DragonfruitKiwi572",
          "text": "Buying followers",
          "score": 0,
          "created_utc": "2026-02-15 00:39:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r60umu",
      "title": "Beginner in Digital Marketing confused About Where to Start with AI",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r60umu/beginner_in_digital_marketing_confused_about/",
      "author": "Sol_ce",
      "created_utc": "2026-02-16 05:16:54",
      "score": 16,
      "num_comments": 33,
      "upvote_ratio": 0.86,
      "text": "Hi everyone,\nI’m a beginner in digital marketing and honestly feeling a bit overwhelmed. There’s so much information out there that I don’t know where to start.\nI really want to learn AI and use it in marketing, but I’m confused about a few things:\nWhich AI tools should I learn first?\nWhat kind of projects should I do to build a strong portfolio?\nHow do experienced marketers actually use AI in their daily workflow?\nWhich websites or platforms should I follow to stay updated on AI trends in marketing?\nI don’t want to randomly learn 10 different tools without understanding how they’re practically used. I’d rather focus on a few important ones and build real, portfolio worthy projects (like campaigns, content strategies, automation setups, etc.).\nIf you’re an experienced marketer who has successfully integrated AI into your workflow, I would genuinely love to know:\nWhat tools do you use daily?\nWhat would you suggest a beginner master first?\nWhat projects helped you stand out?\nWhere do you get reliable information about AI + marketing trends?\nI’m really curious and motivated, just need some direction so I don’t waste time learning things that aren’t relevant.\nWould appreciate any guidance 🙏",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r60umu/beginner_in_digital_marketing_confused_about/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5muxq6",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-16 05:16:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5n30i1",
          "author": "supriya_l89",
          "text": "The anxiety which people experience results from the need to concentrate on specific use cases instead of evaluating different technological solutions.   \n  \nYou should begin your learning process with three essential tools because these tools will help you to solve actual marketing challenges. For most beginners:  \n  \nThe research and content drafting process, which involves creating advertisement concepts and developing strategic plans requires users to utilize ChatGPT and Claude.  \n  \nThe design platform Canva AI provides users with artificial intelligence tools for their creative work.  \n  \nThe combination of GA4 and Looker Studio enables users to produce reports, which should only use AI for analyzing insights instead of taking over the process of data analysis.  \n  \nTo create your portfolio projects, you should do more than just produce content through generation. Create:  \n  \nA complete advertising campaign which includes the development of consumer personas, choosing marketing messages, producing advertisement materials, writing email content, and creating landing page text.  \n  \nA content calendar which uses artificial intelligence to develop its strategic plan.  \n  \nThe creation of an automated system which includes a lead magnet and an email sequence together with segmentation rules.  \n  \nThe main objective behind AI usage among skilled marketers involves using the technology for generating new ideas, transforming existing content into different formats, performing data evaluation, conducting tests on various options, and reducing time spent on work tasks.  \n  \nTo maintain my knowledge about current events, I read industry newsletters which include Marketing Brew and the HubSpot blog, I follow LinkedIn creators who focus on growth and AI, and I conduct weekly experiments.  \n  \nThe ability to apply practical knowledge should take precedence over the desire to pursue every latest instrument which becomes available.",
          "score": 4,
          "created_utc": "2026-02-16 06:23:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5oxp63",
          "author": "VosTampoco",
          "text": "No te abrumes. En realidad es muy sencillo... Proba vos crear algo propio y tener que necesitar la IA para su crecimiento. Solo te vas a ir dando cuenta cual te sirve, cual no, y así... Las que te sirven para crecer son las que van.",
          "score": 2,
          "created_utc": "2026-02-16 14:59:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nb8fb",
          "author": "Dangerous_Bowler3286",
          "text": "If you’re just getting started, don’t overwhelm yourself by trying to master every tool at once. Focus on the basics first  understand how marketing works, how customers make decisions, and how messaging drives action.\n\nThen pick one direction and go deep. That could be Google Ads, Meta Ads, SEO, or email marketing. The important part is commitment, not variety.\n\nFor example, if you choose email marketing with AI , you can begin with simple or even free tools. That’s where you learn the real mechanics targeting, writing, sequencing, follow-ups, and tracking responses.\n\nTools are secondary. Process understanding is primary.\n\nChoose the path that feels natural to you, practice consistently, and solve real problems for real people.\n\nStart simple. Master one skill. Then expand with confidence.",
          "score": 1,
          "created_utc": "2026-02-16 07:37:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nfy6i",
          "author": "Typical_Scallion8042",
          "text": "Start with one core tool like ChatGPT and use it for real tasks audience research, content outlines, ad copy drafts, email flows. Then maybe add one design tool like Canva AI and one automation tool like Zapier once you understand funnels.\n\nFor portfolio, don’t showcase prompts. Showcase outcomes. Build a mock campaign, create a content strategy for a niche, design a simple lead funnel with automation, and explain your thinking behind it.\n\nMost experienced marketers use AI to save time on research, drafting, and analysis not to replace strategy. If you focus on fundamentals + one or two tools deeply, you’ll move way faster than trying to master everything at once.",
          "score": 1,
          "created_utc": "2026-02-16 08:21:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ngosb",
          "author": "Willing-Training1020",
          "text": "Start with ChatGPT and get really good at prompting for copy, email sequences, ad variations, and content outlines. That one skill alone covers 80% of what marketers use AI for daily. Then learn a basic automation tool like Zapier or Make to connect things together. For portfolio projects, pick a fake brand or local business and build out a full content calendar, email sequence, and ad campaign using AI, document your process and results. Don't chase every new tool, most of them do the same thing with different interfaces. For staying updated, just follow a few marketers on LinkedIn or Twitter who actually use AI in their work, you'll learn more from seeing real workflows than from trend articles.",
          "score": 1,
          "created_utc": "2026-02-16 08:28:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5niisu",
          "author": "Difficult_Buffalo544",
          "text": "I totally understand the overwhelm. The trick is to start with content creation because that is where AI delivers the quickest results. Focus on mastering one workflow like blog writing or social media first. Most people fall into the trap of using tools that sound like robots. \n\nWe have been using Atom Writer lately and it is a game changer for staying on brand. It has this Logic Layer that actually follows our specific tone and vocabulary instead of that generic AI fluff. It creates content that needs zero edits which saves us hours every week. \n\nAre you looking to focus more on SEO blogging or social media content first?",
          "score": 1,
          "created_utc": "2026-02-16 08:45:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nkr2j",
          "author": "Terrible-Repair-9421",
          "text": "Don’t learn 10 AI tools. Master a small stack.\n\nStart with:  \n• ChatGPT – content + research  \n• Canva – creatives  \n• Google Analytics – performance basics  \n• Meta Ads Manager – ads\n\nUse AI for:  \n• Content briefs  \n• Ad variations  \n• Email sequences  \n• Competitor analysis  \n• Automation ideas\n\nBuild portfolio projects like:  \n• Content strategy  \n• Mock ad campaign  \n• Email automation flow  \n• SEO blog + brief\n\nFollow:  \n• HubSpot  \n• Search Engine Journal\n\nFocus on proof, not tools.",
          "score": 1,
          "created_utc": "2026-02-16 09:07:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nnv8h",
          "author": "Mukul-With-Seo099",
          "text": "Don't waste your time in starting learning immediately. All thoughts clear after learning.",
          "score": 1,
          "created_utc": "2026-02-16 09:36:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nuivq",
          "author": "Xavier_Caffrey_GTM",
          "text": "honestly everyone here is telling you to learn tools but that's backwards. the tools change every \\[6 months\\]. what doesn't change is understanding why people buy things.\n\nlearn how to write a good subject line. learn what makes someone click an ad vs scroll past it. learn how to segment an audience. you can figure out any AI tool in an afternoon once you actually understand what you're trying to accomplish with it.\n\nthe portfolio thing, don't build fake campaigns for made up brands. find a real small business or a friend's side project and actually run something. even if it's small and free, \"i got this local bakery 47 email signups in 2 weeks using X\" beats any mock campaign you could build.",
          "score": 1,
          "created_utc": "2026-02-16 10:39:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nywr7",
          "author": "AppointmentEven9033",
          "text": "Totally normal to feel overwhelmed. Don’t start with 10 tools,  start with use cases.\n\nFirst, learn how AI helps with:\n\n* Content ideas & outlines\n* Ad/email copy improvement\n* Basic research\n* Simple automation\n\nMaster one solid AI writing tool, Canva for creatives, and a basic automation platform. That’s enough to begin.\n\nFor your portfolio, build:\n\n* A content strategy for a niche\n* A mock ad campaign\n* A simple email funnel\n\nExperienced marketers mostly use AI to save time and improve output, not replace strategy.\n\nFocus on marketing fundamentals first, AI just makes you faster and sharper.",
          "score": 1,
          "created_utc": "2026-02-16 11:18:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nz69m",
          "author": "RobertLigthart",
          "text": "honestly just pick one tool and start using it for actual work, not portfolio projects. I use claude and chatgpt daily for everything from writing copy to brainstorming product ideas to analyzing competitor stuff... learned more in 2 months of just using it than I would have from any course. the specific tools dont matter that much because they all change constantly anyway. what matters is learning how to prompt well and knowing when the output is good vs garbage. that skill transfers to whatever new tool comes out next",
          "score": 1,
          "created_utc": "2026-02-16 11:20:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nzxu2",
          "author": "meriadigitalmarketer",
          "text": "First of all, feeling overwhelmed at the beginning is completely normal. You don’t need to learn all the tools; you just need a small, solid stack and a few projects.\n\n\n\nFor a beginner, start with tools that solve real marketing tasks. \n\n* ChatGPT\n* Canva\n* Google Analytics\n* Semrush or Ahrefs\n\n\n\nIn real workflows AI is used for:\n\n* Content briefs\n* Keyword clustering and search intent analysis\n* Ad copy variations\n* Email sequences\n* Competitor research summaries\n* Reporting insights\n\nWhen building your portfolio, document your prompts, process, and before/after results. Follow people and platforms that show real use cases.\n\n* Hubspot blog\n* Search Engine Journal\n* LinkedIn creators sharing workflows\n* Youtube case studies\n\n\n\nDon’t aim to become “someone who knows AI tools.” Aim to become a marketer who can execute faster and smarter using AI.\n\n",
          "score": 1,
          "created_utc": "2026-02-16 11:27:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5o4ma4",
          "author": "DigitalHarbor_Ease",
          "text": "Totally get this feeling almost everyone hits this phase at the start.\n\nIf you’re a beginner, don’t chase **too many AI tools at once**. Start by understanding **how marketing actually works**, then layer AI on top of it. AI is a multiplier, not a shortcut.\n\nI’d suggest:\n\n* First learn **core marketing basics** (content, SEO, ads, funnels, email).\n* Then pick **2–3 AI tools max** and go deep (for content, research, automation).\n* Build **real projects**, not tool demos  like an SEO content plan using AI, ad copy testing, email automation flows, or a mini campaign with results.\n* Follow people who **share case studies**, not just “AI hacks”.\n\nMost experienced marketers use AI daily for **research, content drafts, data analysis, automation, and idea validation**, not blindly publishing AI output.\n\nIf I were starting today, I’d master:\n\n1. One core marketing skill\n2. One AI writing/research tool\n3. One automation or analytics use case\n\nFocus on **outcomes**, not tools. That’s what makes a portfolio stand out.",
          "score": 1,
          "created_utc": "2026-02-16 12:05:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5o9dcm",
          "author": "AgilePrsnip",
          "text": "totally get the overwhelm, but you only need a few tools and real practice not ten random apps start with chatgpt for research and copy, canva for creatives, and one automation tool like zapier then build three small projects a mock campaign for a fake brand, a simple content plan with tracked results, and one basic email automation most marketers use ai daily for faster drafts, idea angles, ad variations, and data cleanup not magic just speed follow hubspot and marketing brew for grounded updates and focus on learning positioning and funnels first since tools will change but fundamentals will not.",
          "score": 1,
          "created_utc": "2026-02-16 12:40:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5p0l2i",
          "author": "linkdra",
          "text": "Just dive in with OpenClaw. Pick between anthopic or gemini models ",
          "score": 1,
          "created_utc": "2026-02-16 15:14:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pe08j",
          "author": "stpauley45",
          "text": "Drop your post into Claude and learn the basics.",
          "score": 1,
          "created_utc": "2026-02-16 16:18:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pnpye",
          "author": "pranay_227",
          "text": "1. one strong language model (chatgpt or similar) use it for research, positioning drafts, ad angles, email flows, and critique. learn how to give context, not just prompts.\n2. one visual production tool this is where runable is useful. instead of spending hours designing decks, carousels, or campaign mockups manually, you can turn strategy into clean visual assets fast. that makes your portfolio look professional without needing deep design skills.\n3. analytics basics google analytics + conversion tracking. AI helps you generate ideas, but metrics tell you what actually works.\n\nfor portfolio projects:\n\n* build a mock campaign and present it as a polished deck (use runable to format it properly).\n* create a niche content strategy with sample creatives.\n* design a simple funnel and document your reasoning.",
          "score": 1,
          "created_utc": "2026-02-16 17:02:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pxec2",
          "author": "AnyExit8486",
          "text": "don’t learn 10 ai tools.\n\nlearn marketing first, then use ai to move faster.\n\nstart simple: one writing tool, one design tool, one automation tool.\n\nonce you get comfortable, tools like runable can help you plan and execute full campaigns end to end instead of just generating content.",
          "score": 1,
          "created_utc": "2026-02-16 17:48:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pzxod",
          "author": "Yapiee_App",
          "text": "You’re thinking about this the right way. Don’t try to learn 10 tools master one core AI tool (like ChatGPT) and use it to improve real marketing tasks: content briefs, ad angles, email flows, and simple automation ideas.\n\nFocus on building small, practical projects (a mini campaign plan, a content strategy, a lead funnel mockup). That’s what makes a portfolio strong not tool collection, but applied thinking.",
          "score": 1,
          "created_utc": "2026-02-16 17:59:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r0a23",
          "author": "Resident-Rain-2197",
          "text": "to be honest i dont think you should even worry about ai until you have a good foundation first",
          "score": 1,
          "created_utc": "2026-02-16 20:52:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ra132",
          "author": "No_Surround_4149",
          "text": "Ask Claude/chat gpt/ LLM… to learn, plan, review, strategy… that is the point to ask the BIG BRAIN LLM",
          "score": 1,
          "created_utc": "2026-02-16 21:40:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rill6",
          "author": "ReactionVarious5768",
          "text": "I shall tell you where to start. Purchase the one page marketing plan by alla dibb, read it, then read it again and then build.  once you've built read lean marketing by Allan dibb. Then from there build your business",
          "score": 1,
          "created_utc": "2026-02-16 22:22:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5riw21",
          "author": "Just-Limit9072",
          "text": "start with the basics, don't jump into every ai tool at once\n\nlearn chatgpt/claude for copywriting and content strategy. that's the foundation. write ad copy, email sequences, social posts. build a portfolio showing before/after examples\n\nperplexity for research when you need sources\n\nfor video content, creatify is useful for generating product ads fast. helps if you're working with ecom brands\n\ndon't worry about learning 10 tools. most marketers use 2-3 consistently and ignore the rest\n\nportfolio projects that matter: run a small campaign for a friend's business, create a content calendar with ai-generated copy, build an email nurture sequence, make 5 different ad variations and explain the strategy\n\nfor staying updated, just follow marketing twitter and reddit. most \"ai marketing courses\" are overhyped\n\nwhat kind of marketing are you most interested in? paid ads, content, social, email?",
          "score": 1,
          "created_utc": "2026-02-16 22:24:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rskkr",
          "author": "Collins_Miri",
          "text": "use adcrafty ai for videos :) ",
          "score": 1,
          "created_utc": "2026-02-16 23:15:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6bxn0",
      "title": "I exposed a digital marketing coach.",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r6bxn0/i_exposed_a_digital_marketing_coach/",
      "author": "Delicious_Fondants",
      "created_utc": "2026-02-16 15:03:16",
      "score": 15,
      "num_comments": 17,
      "upvote_ratio": 0.86,
      "text": "I’ve been in the SMMA niche for a while to know the basics. All the online marketing “coaches”, all of the 1M MRR from 5 clients and etc.\n\nI was sitting on Reddit the other day and read a post about an e-com influencer being caught faking his sales and having an open collaboration with the platform that lets you fake the results. A peanut for a brain basically.\n\nBut I decided to do some research myself since I had too much free time that day, I investigated all of the brez scale of the industry, basically the biggest influencers and all of the go-to coaches for digital marketing.\n\nGuess what.\n\nI noticed the same thing, one of the best known “coaches” within the space who constantly flexes his “Yellow Ferrari” (which by now I think is rented) forgot to remove a “,” when faking his stripe numbers. You can connect the dots yourself on who it is.\n\nI thought to myself this couldn’t be real, I sent the video to multiple friends, they all saw the same thing.\n\nMessaged the guy, asked to join his course, the usual. Then once the call link got sent, I sent him the screenshot.\n\nHis reply was the same, he said the dashboard wasn’t real but it helped him push out more content. He sent me the platform and a discount code for it as an affiliate partnership reference. The platform is extremely polished and you genuinely couldn’t tell the original from the fake apart if you didn’t make any typo’s. (Yes, I bought the dashboard for research purposes ONLY)\n\nI thought to myself “No shit, they’re all faking it”.\n\nThe internet, especially the digital marketing coaching scene, is full of fakes. There’s even tools helping them do it to lure you into the “get rich quick online” scene.\n\nI’m not saying every coach is fake, but please for the love of God, do your own due-diligence prior to falling to the guy with the rented lambo and the rented penthouse.\n\nEDIT: I can see some of you are DM'ing me for the tools name. I do not condone this type of business, never have, and wouldn't support anything or anyone partaking in it. Those claiming \" for research\" purposes, it's dashmock or something like it. Again, I don't encourage anyone using it but it does amaze me how someone decides to build it out this well. I'm not affiliated with them in any shape or form.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r6bxn0/i_exposed_a_digital_marketing_coach/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5oye23",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-16 15:03:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5p76ki",
          "author": "Radiant-Security-347",
          "text": "did you, by any chance, wake up from a decades long coma?",
          "score": 15,
          "created_utc": "2026-02-16 15:46:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5pbmxb",
              "author": "Delicious_Fondants",
              "text": "?",
              "score": 0,
              "created_utc": "2026-02-16 16:07:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5pcy0o",
                  "author": "MAXIMAL_GABRIEL",
                  "text": "There's been fraudulent \"gurus\" since the dawn of mankind. \n\nYour \"discovery\" is something common sense assumes.",
                  "score": 10,
                  "created_utc": "2026-02-16 16:13:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5pt9e9",
          "author": "Adcero_app",
          "text": "the funniest part is the product they're actually selling IS the course. the \"digital marketing agency\" is just the storyline to make the course feel credible. it's like a movie set, it looks real from the front but there's nothing behind it.\n\nI think the real tell is when someone's ad spend screenshots are always from brand new accounts with like 3 days of data. anyone who's actually managed campaigns for years has messy dashboards with paused campaigns and failed tests all over the place, not a clean $50k month screenshot.",
          "score": 2,
          "created_utc": "2026-02-16 17:28:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5pzl3p",
              "author": "Delicious_Fondants",
              "text": "Agree on the ads manager part. I also wonder how the lies are holding as most of these guys pitch their 1:1 calls like it's gold. What are they discussing during those calls and how are the lies actually holding up?",
              "score": 1,
              "created_utc": "2026-02-16 17:58:16",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o5r2nyh",
              "author": "Tim-Sylvester",
              "text": "People used to buy ads in newspapers that said \"Make money fast! Send $10 to XYZ to learn how!\" and if you were dumb enough to send them the money they'd send you a page that said \"Buy an ad in newspapers that says...\"",
              "score": 1,
              "created_utc": "2026-02-16 21:04:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5pi5ua",
          "author": "Monkeyboogaloo",
          "text": "I’ve seen plenty of people go from a novice asking questions of forums to claiming to be a guru in under a year. \n\nNo person who has nailed it and consistentaly delivered high income spends their time flogging a course.",
          "score": 1,
          "created_utc": "2026-02-16 16:37:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5piqpa",
          "author": "DeliciousMoments",
          "text": "These courses work in the sense that gullible people pay for them and make money for the coaches.\n\nNobody who actually makes their living doing digital marketing takes them seriously.",
          "score": 1,
          "created_utc": "2026-02-16 16:40:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pmzkk",
          "author": "pranay_227",
          "text": "the digital marketing niche is especially noisy because the barrier to entry is low and perception sells. it’s much easier to sell “how to make money” than to quietly make money.\n\na simple rule i use: if someone’s main content is lifestyle flexing and dashboards, they’re selling aspiration. if they’re breaking down client case studies, mistakes, churn, margins, and tradeoffs, they’re probably operating.",
          "score": 1,
          "created_utc": "2026-02-16 16:59:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r24sw",
          "author": "Tim-Sylvester",
          "text": "If you follow many startup or marketing subs on reddit you'll quickly realize many of the posts are people lying about their success. There are some pretty obvious patterns people follow.",
          "score": 1,
          "created_utc": "2026-02-16 21:01:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sfxr6",
          "author": "Prize-Enthusiasm3828",
          "text": "well yeah the whole online make money guru thing has been going on for a while now its so effin clearly visible how good these guys show off and lie ",
          "score": 1,
          "created_utc": "2026-02-17 01:30:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sodyt",
          "author": "HarjjotSinghh",
          "text": "this coach's secret sauce smells like expired hope.",
          "score": 1,
          "created_utc": "2026-02-17 02:21:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pddbu",
          "author": "stpauley45",
          "text": "# Why would anyone these days hire a \"coach\"? Just ask Claude or any one of the AI tools HOW to achieve a goal and spend some time prompting it. You can even ask the AI to write the comprehensive prompt for the AI itself.\n\nThere is no reason to hire a coach these days.\n\nThe HOW is known. The differentiator nowadays is \"Who is willing to take action.\"",
          "score": 2,
          "created_utc": "2026-02-16 16:15:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qyrm2",
              "author": "NuncProFunc",
              "text": "If knowledge were the problem, everyone would be rich. You hire help to convert knowledge into outcomes. Sometimes that's a coach, or a contractor, or a vendor, or an employee. The solution depends on the source of the problem.",
              "score": 2,
              "created_utc": "2026-02-16 20:45:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r5cvoq",
      "title": "Is seo still worth it in 2026?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r5cvoq/is_seo_still_worth_it_in_2026/",
      "author": "DowntownLaugh454",
      "created_utc": "2026-02-15 11:57:56",
      "score": 13,
      "num_comments": 25,
      "upvote_ratio": 0.93,
      "text": "I keep seeing people say SEO is dead, but at the same time I see businesses getting solid traffic from organic search. Paid ads are getting more expensive, and social reach feels unpredictable.\n\nFor those actively working in digital marketing right now, are you still investing heavily in SEO? If so, what’s actually working for you, content, backlinks, technical fixes, niche authority?\n\nCurious what strategies are driving real results this year.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r5cvoq/is_seo_still_worth_it_in_2026/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5htiiy",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-15 11:57:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5i80pu",
          "author": "marketingguru2024",
          "text": "Yes — SEO remains valuable in 2026. But not the 2016 version of SEO.\n\nWhat’s changed isn’t whether SEO works; it’s what “ranking” actually means now.\n\nIn 2026, SEO is less about “10 blue links” and more about:\n\n* Showing up in AI Overviews / generative results\n* Owning high-intent commercial keywords\n* Building topical authority\n* Optimizing for entity signals + user experience\n* Converting traffic, not just getting it\n\nGoogle still drives massive high-intent traffic. If someone searches *“emergency plumber near me”* or *“best CRM for small business”*, that intent is commercial and valuable. Ads are expensive long-term. Organic visibility compounds.\n\nThat said:\n\nSEO is not worth it if:\n\n* You expect results in 30 days\n* You’re in a hyper-competitive niche with a tiny budget\n* You treat it like “publish blogs and pray”\n\nSEO is worth it if:\n\n* You’re building a long-term brand\n* You care about customer acquisition cost over time\n* You invest in content + technical + authority (not just one piece)\n* You optimize for conversions, not vanity traffic\n\nWhat’s different in 2026:\n\n* AI content alone doesn’t rank. Structured expertise does.\n* Topical clusters > random blog posts.\n* UX + engagement signals matter more.\n* Brand searches and authority signals are huge.\n* Digital PR is replacing old-school link spam.\n\nMany businesses still quietly scale through organic search. Agencies that focus on measurable ranking growth (not fluff metrics) are doing well; the game now requires more strategy.\n\nIf you treat SEO as an asset instead of a tactic, it’s still one of the highest ROI channels available.\n\nCurious what niche you’re asking about? That changes the answer.",
          "score": 7,
          "created_utc": "2026-02-15 13:44:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5imj74",
              "author": "Dr_Gong",
              "text": "Ver well answer. I offer this frame of work, more implicit in the business helping to get more convertions and strategy. Old ranking SEO about just ranking keywords or spammy link are done.",
              "score": 1,
              "created_utc": "2026-02-15 15:07:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5ir9bp",
              "author": "HappyBuddha01",
              "text": "Great answer.",
              "score": 1,
              "created_utc": "2026-02-15 15:31:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5nxqyr",
              "author": "Functionas",
              "text": "I’m still curious how much value .edu/.gov backlinks really carry with Google now — what are you all seeing?",
              "score": 1,
              "created_utc": "2026-02-16 11:08:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5in1ca",
          "author": "its_avon_",
          "text": "SEO is absolutely still worth it, but the game has shifted. The people saying it's dead are usually the ones who were gaming the system with thin content and link farms — yeah, that version of SEO is dead.\n\nWhat's actually working right now in my experience:\n\n- Topical authority > individual keywords. Google rewards sites that go deep on a subject rather than chasing random high-volume terms. Pick a lane and own it.\n- Content that answers specific questions real people ask. Not generic \"ultimate guides\" but stuff like \"how do I fix X when Y happens.\" Long-tail is where the money is.\n- Technical SEO matters more than ever. Core Web Vitals, proper schema markup, fast load times — boring stuff but it compounds over time.\n- Backlinks still matter but quality over quantity. One contextual link from a relevant site > 50 directory submissions.\n\nPaid ads are getting more expensive every quarter, which actually makes SEO MORE valuable as a channel, not less. The ROI timeline is longer but the compounding effect is real. I'd rather build an asset that generates traffic for years than keep feeding the Google Ads machine.",
          "score": 2,
          "created_utc": "2026-02-15 15:10:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5iw9qr",
          "author": "Itheta_Labs",
          "text": "Long and short of it is, without solid SEO the new forms op AI optimization won't yield much fruit",
          "score": 1,
          "created_utc": "2026-02-15 15:56:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ln0i0",
          "author": "seogeospace",
          "text": "AI systems still rely heavily on search engine indexes, so companies should absolutely keep investing in SEO.\n\nGo with content + internal links + backlinks.",
          "score": 1,
          "created_utc": "2026-02-16 00:24:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nhyop",
          "author": "vladi5555",
          "text": "Definitely. I've personally helped multiple businesses generate thousands of organic traffic and 6 figures+ in organic revenue.",
          "score": 1,
          "created_utc": "2026-02-16 08:40:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nxig6",
          "author": "Functionas",
          "text": "SEO isn’t dead in 2026 — it’s just shifted toward Google E-E-A-T, search intent, and genuinely helpful, people-first content… what’s actually working for you all right now?",
          "score": 1,
          "created_utc": "2026-02-16 11:05:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nxv8p",
          "author": "gawiz93",
          "text": "still works great honestly it’s all about authority now",
          "score": 1,
          "created_utc": "2026-02-16 11:09:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ny38s",
          "author": "ChestChance6126",
          "text": "SEO isn’t dead. Easy SEO is dead.\n\nIf you’re publishing generic content hoping to rank off volume alone, that’s rough now. But high intent queries, niche authority, and tight topical depth still work.\n\nWhat’s driving results for us lately is:\n\n* Fewer, better pages with real differentiation.\n* Strong internal linking and clean site structure.\n* Updating old content aggressively instead of pumping out net new.\n* Building distribution outside Google so branded search grows.\n\nPaid is getting expensive, and social is volatile, that makes owned traffic more valuable, not less. SEO in 2026 is less about tricks and more about being the best answer in a narrow lane.",
          "score": 1,
          "created_utc": "2026-02-16 11:11:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5o0ars",
          "author": "Temporary-Constant51",
          "text": "SEO isn’t dead - low-effort SEO is. Generic, AI-spun content isn’t working anymore, but brands that are building real topical authority and solving specific search intent are still seeing consistent growth. It’s less about “publishing more” and more about publishing smarter.",
          "score": 1,
          "created_utc": "2026-02-16 11:30:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5opm8m",
          "author": "patagiona",
          "text": "\"SEO is dead\" has been said every year for the past 15 years. It's not dead – it just changed. The people saying that are usually the ones who relied on one trick that stopped working.\n\nWhat's actually driving results right now from our experience:\n\nContent that answers real questions – not keyword-stuffed filler, but pages that genuinely help people. Google has gotten very good at telling the difference. We see the best results when content matches search intent exactly.\n\nTechnical foundation – this is the unsexy part nobody talks about. Fast site, clean structure, proper indexing, mobile experience. Doesn't matter how great your content is if Google can't crawl it properly or your site takes 5 seconds to load.\n\nLocal SEO – honestly one of the biggest opportunities right now, especially for service businesses. A solid Google Business Profile, consistent NAP data, real reviews, and localized content still drives serious leads. Most competitors barely try here.\n\nBacklinks – still matter, but quality over quantity. A handful of relevant links from real sites in your niche beats hundreds of random directory submissions.\n\nThe trick is that none of these work in isolation. We've seen sites with great content go nowhere because the technical side was broken. And technically perfect sites with thin content that nobody links to.\n\nAnd to your point about paid ads getting expensive – that's exactly why SEO is worth investing in. Organic traffic compounds over time. Ads stop the second you stop paying.",
          "score": 1,
          "created_utc": "2026-02-16 14:17:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5opsvi",
          "author": "UnkWinnie",
          "text": "Like everything in SEO it depends. If you are wanting to get into blogging / providing information to make money from ads, no not worth getting into anymore",
          "score": 1,
          "created_utc": "2026-02-16 14:18:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ovny2",
          "author": "hellorenn",
          "text": "yeah it’s still worth it, just not the 2018 version.\n\nseo now is basically:\nwrite stuff that actually answers real questions, build topical authority in one niche, and make pages that are clear enough for google and AI tools to pull from. fluff posts are dying.\n\npaid ads are getting expensive, socials are shaky. organic traffic that compounds is still gold if you can wait a bit. it’s slower, but once it hits it’s way more stable than chasing algorithms every week.",
          "score": 1,
          "created_utc": "2026-02-16 14:49:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5p8d52",
          "author": "Background-Pay5729",
          "text": "seo isn't dead but it's a massive grind compared to a few years ago. ai overviews basically killed the top-of-funnel traffic for simple queries so you're mostly fighting for high-intent clicks now and it's getting crowded.\n\nwhat's actually working is doubling down on \"human\" signals. things like original data, hot takes, and real-world experience that ai can't just scrape and summarize easily. technical stuff is still important but it’s just the bare minimum to play the game, niche authority is where the real growth is imo.",
          "score": 1,
          "created_utc": "2026-02-16 15:51:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5piu2g",
          "author": "Claneo",
          "text": "It is like asking if people are still using Google in 2026. Or if you include GEO in SEO because they are close to one another - asking if people are still using AI chatbots (ChatGPT / Gemini ...) in 2026. If the users / audiance is there the company wanting to reach them has to be there ... ",
          "score": 1,
          "created_utc": "2026-02-16 16:40:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5q3tml",
          "author": "online-optimism",
          "text": "SEO if anything is making a comeback, as people are discovering they need to adapt their SEO strategy to AEO, GEO, and LLMs. At Online Optimism, we're seeing clients come back for SEO, GEO, and AEO services more than ever before.\n\nWhat's working now: content that answers specific questions (not just targets keywords), clean technical foundations (schema, site speed, mobile), and showing up where AI tools are pulling answers from (Reddit, niche forums, Q&A sites).\n\nBacklinks still matter, but quality over quantity. A few relevant links from trusted sources beat 50 random directory submissions.\n\nThe biggest change is that ranking on Google alone isn't enough anymore. You also need to show up when people ask ChatGPT or Perplexity for recommendations. That means your content needs to be written for questions, not search terms.\n\nIf your SEO foundation is solid and you're still not seeing results, it's probably because your content still reads like it was written for a search engine instead of a person.",
          "score": 1,
          "created_utc": "2026-02-16 18:17:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5repl7",
          "author": "Evening_Scholar_970",
          "text": "A lot of traditional advice (while many say it's the old way of doing things) it still works. Getting good & reputable backlinks, having unique content that is valuable to your niche, and site speed. Those are the big ones in my eyes. And keeping your meta data updated with good us of keywords.",
          "score": 1,
          "created_utc": "2026-02-16 22:03:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5snmia",
          "author": "CaregiverInternal298",
          "text": "👌",
          "score": 1,
          "created_utc": "2026-02-17 02:16:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3qqxo",
      "title": "Are online banks friendly to small businesses in comparison to mainstream banks?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r3qqxo/are_online_banks_friendly_to_small_businesses_in/",
      "author": "oreynolds29",
      "created_utc": "2026-02-13 14:34:45",
      "score": 11,
      "num_comments": 17,
      "upvote_ratio": 0.93,
      "text": "I run a small business with international contractors and have been using a BoA business account the last two years. Now, we've expanded our operations and we're suddenly getting crazy 3-5 day holds on our payments. Our accounting team has referenced using online banks citing ease of operations plus extra features that will help manage admin workload. Has anyone here switched to digital banking for their small business and how has the experience felt?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r3qqxo/are_online_banks_friendly_to_small_businesses_in/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o564myb",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-13 14:34:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56bjm2",
          "author": "BrentMaxey",
          "text": "Online banks sound cute until you need help and its a bot on the other end. Branch access is peace of mind to me imo",
          "score": 2,
          "created_utc": "2026-02-13 15:09:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56y5ri",
              "author": "oreynolds29",
              "text": "This is a huge concern that you may get stuck chatting with bots when you need human intervention",
              "score": 1,
              "created_utc": "2026-02-13 16:57:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o56fp35",
          "author": "NiceStraightMan",
          "text": "Switched from Chase to online banking 18 months ago and never looked back. The difference in payment processing speed is night and day. I enjoy lots of bookkeeping and tax categorization features too. ",
          "score": 1,
          "created_utc": "2026-02-13 15:29:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56yd7x",
              "author": "oreynolds29",
              "text": "I'm curious over what made you leave Chase for an online alternative.",
              "score": 1,
              "created_utc": "2026-02-13 16:58:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o56w68i",
          "author": "Fun_Average_3813",
          "text": "Holds are common with all banks when transaction patterns change. The only difference is that online banks have capacity for real-time risk assessment instead of the blanket holds that old banks use.",
          "score": 1,
          "created_utc": "2026-02-13 16:47:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56yjh4",
              "author": "oreynolds29",
              "text": "I've never thought about it this way. Ty for the explanation.",
              "score": 1,
              "created_utc": "2026-02-13 16:59:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o57odry",
          "author": "quadrapay1",
          "text": "I like online banking",
          "score": 1,
          "created_utc": "2026-02-13 19:03:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5asg4q",
              "author": "oreynolds29",
              "text": "How has it been for you?",
              "score": 1,
              "created_utc": "2026-02-14 06:17:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5atl3y",
                  "author": "quadrapay1",
                  "text": "Never visited bank branch in 10 years lol.  However every business has unique requirements. What works for me may not be a fit for others. All the best.",
                  "score": 1,
                  "created_utc": "2026-02-14 06:27:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o58sp96",
          "author": "zenbusinesscommunity",
          "text": "Online banks tend to handle digital transactions more smoothly, and some have better options for international payments than traditional banks. If you're paying contractors internationally a lot, worth looking into what you're actually paying in wire fees and currency conversion since there can be some sharp differences in those fees and exchange rate markups.\n\nThe customer service tradeoff other commenters mentioned is a great point though since you lose branch access but get better digital tools and processing speed. Just depends on how often you actually need in-person help.",
          "score": 1,
          "created_utc": "2026-02-13 22:23:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5asmi7",
              "author": "oreynolds29",
              "text": "I'm worried about not having branch access, but the holds are making branch access look like a non-issue since you don't often get the help you need anyway",
              "score": 1,
              "created_utc": "2026-02-14 06:18:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5apjgy",
          "author": "The-Big-Chungis",
          "text": "Do your homework on FDIC coverage limits and customer support availability. Some online banks offer higher insurance coverage via sweep networks, which matters when you're holding larger operating balances.",
          "score": 1,
          "created_utc": "2026-02-14 05:51:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5aso9q",
              "author": "oreynolds29",
              "text": "I'll check on these, ty. ",
              "score": 1,
              "created_utc": "2026-02-14 06:19:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5aqa2z",
          "author": "Former_Tea1131",
          "text": "Switched two years ago after similar BoA frustrations. The difference in payment processing speed is significant. We moved to lili and the customer support is great, no holds to this date. Feels like digital banks understand modern business operations.",
          "score": 1,
          "created_utc": "2026-02-14 05:58:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5assk2",
              "author": "oreynolds29",
              "text": "I guess I'm used to banking operations that I don't even stop to think about how fast is ACH and if it could get faster. I'll look into this!",
              "score": 1,
              "created_utc": "2026-02-14 06:20:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r4g903",
      "title": "One small change that's made client communication 10x less exhausting",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r4g903/one_small_change_thats_made_client_communication/",
      "author": "darmaan-seowizard",
      "created_utc": "2026-02-14 09:19:40",
      "score": 11,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Running an agency, I used to dread Mondays. Not because of the work itself but because my inbox would be flooded with some version of:\n\n\"Hey, quick question...\" \"Just checking in on progress...\" \"Can we hop on a call to discuss?\"\n\nI'd spend half my day replying to stuff that could've waited. Or worse getting pulled into \"quick calls\" that turned into 45-minute therapy sessions about why their competitor is ranking higher.\n\nThe change: I started sending every client a short async update every Friday. Just 4-5 lines max.\n\n* What we did this week\n* What's in progress\n* Any blockers or things I need from them\n* What's coming next week\n\nThat's it. No fancy dashboard. No Loom video. Just a few lines in WhatsApp or email wherever they prefer.\n\nThe result? Monday inbox chaos dropped by like 70%. Clients stopped \"checking in\" because they already knew what was happening. And the ones who still wanted calls? At least now the calls had context.\n\nSounds basic, but I resisted this for years thinking \"I'll just update them when there's something big to share.\" Turns out clients don't want big updates. They want to feel like things are moving.\n\nAnyone else have a small process change that had an outsized impact on client relationships?",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r4g903/one_small_change_thats_made_client_communication/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5bbrp0",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-14 09:19:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bnhss",
          "author": "Admirable-Pomelo2699",
          "text": "The Friday Email. Working on making this a habit with myself and my team. Also improves client satisfaction so they feel you are thinking about them and communicating well.",
          "score": 2,
          "created_utc": "2026-02-14 11:14:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bwb0d",
          "author": "RobertLigthart",
          "text": "this is underrated honestly. I had the same issue and started doing something similar just a quick end-of-week message in slack. the key thing you nailed is keeping it short... the moment you try to make it a full report with metrics and screenshots nobody reads it anymore. 4-5 lines is the sweet spot",
          "score": 1,
          "created_utc": "2026-02-14 12:31:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5fmllp",
              "author": "giovaughnii",
              "text": "Short and sweet is definitely the key. My Friday email stopped getting read because it took 3 hours to put everything together and was a huge message.",
              "score": 1,
              "created_utc": "2026-02-15 01:01:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5d4y8a",
          "author": "BigDaddy9102",
          "text": "Seems very good ngl. I never looked at it this way",
          "score": 1,
          "created_utc": "2026-02-14 16:50:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pp1ny",
          "author": "AppearanceBudget7318",
          "text": "Yeah, this is spot on. Proactive updates do kill many unnecessary conversations. We do a similar process, but we use an AI automation tool with it. Team drops voice updates throughout the week, and it generates the client reports automatically on Fridays. Saves me from having to remember to write them out each time.\n\nClients just don't want to feel left in the dark, even if there's nothing groundbreaking happening on a certain week.",
          "score": 1,
          "created_utc": "2026-02-16 17:08:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5hh8i",
      "title": "I reverse-engineered how agencies are using AI to turn Instagram into a client pipeline. Full breakdown of what's actually working in 2026",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r5hh8i/i_reverseengineered_how_agencies_are_using_ai_to/",
      "author": "Pure_Data3489",
      "created_utc": "2026-02-15 15:32:46",
      "score": 10,
      "num_comments": 7,
      "upvote_ratio": 0.72,
      "text": "**THIS IS GOING TO BE VERY LONG but it is worth your time**  \n  \nIf you run an agency and you're not treating Instagram as a lead generation system , you're behind.\n\nI spent some time pulling this apart. Here's everything I found.\n\n**First — the numbers that made me take this seriously**\n\n2 billion monthly users. 33 minutes of daily average scroll time. 61% of users actively research products and services on the platform — including enterprise buyers and B2B decision makers.\n\nFor agencies specifically: Reels get a **3.2% engagement rate** vs 1.1% for static posts. They drive **41% higher click-through rates** to your website. Your potential clients are scrolling right now. The question is whether your agency shows up when they do.\n\n**What's actually dead in 2026 (stop doing this)**\n\n* Single-message DM blasts with no follow-up\n* Generic \"thanks for following!\" auto-replies\n* Link-only messages with zero conversation\n* Bulk follow/unfollow tools (these will get you banned — more on this below)\n* Posting without any keyword or SEO strategy on the profile\n* Treating every lead the same regardless of intent signals\n\nInstagram's spam detection has gotten significantly smarter. Meta's API keeps tightening. The shortcuts that worked in 2022 are now account-suspension risks.\n\nWhat replaced them is more interesting.\n\n**Stage 1: AI Content at Scale (the table stakes layer)**\n\nAI tools have made content production genuinely fast now. Not \"decent for AI\" fast. Actually fast.\n\n**What AI handles:**\n\n* Caption and hashtag generation tailored to your niche and audience\n* Optimal posting time recommendations based on your audience's behavior patterns\n* Video editing for Reels — automated cuts, captions, transitions\n* Content variations for different audience segments\n\nTools that are actually good right now: **Zebracat** and **InVideo AI** for Reels, **Canva AI** and **Adobe Express** for carousels and graphics, **CapCut AI** for quick video editing, **Flick** and **SocialBee** for scheduling + caption strategy, **Planable** and **Ritetag** for caption and hashtag optimization.\n\n*The important caveat: AI handles execution. You still need to provide the strategic direction, the brand voice, the insight. Agencies that fully automate content sound robotic and lose trust fast. The ones winning use AI to execute faster while humans drive the narrative.*\n\n**Stage 2: Instagram SEO (the thing almost nobody does)**\n\nInstagram has a real search function now. People type in problems, services, and topics the same way they use Google. If your profile isn't optimized for this, you're invisible to an entire discovery channel.\n\n**What actually moves the needle:**\n\n**Keyword-optimized bio** — Don't write a clever bio. Write a clear one. \"Shopify web design agency for DTC brands\" will outperform \"we build digital dreams\" every single time. **Tools like Flick can audit and rewrite your bio for searchability.**\n\n**Descriptive captions** — Captions that naturally include terms your clients search for (\"email marketing for SaaS companies,\" \"web development agency for startups\") get surfaced in search. **Ritetag helps you build these without sounding forced.**\n\n**Hashtag strategy** — Not 30 random hashtags. A deliberate mix of trending, niche, and branded tags. You can use Ritetag \n\n**Alt text on every image** — This is skipped by 95% of accounts. Adding descriptive alt text improves both accessibility and Instagram's ability to categorize and surface your content. Takes 30 seconds per post.\n\n**Stage 3: DM Automation — the old way is dead**\n\nHere's where things get interesting.\n\nMost agencies doing DM automation are running the 2021 playbook:\n\n>\n\nThat's not automation. That's a vending machine. And it converts like one.\n\nWhat the better agencies figured out is that the DM is not a delivery mechanism — **it's a qualification conversation.**\n\nThe new approach looks like this:\n\n>\n\nNotice what just happened. Multiple touchpoints. The lead got qualified (experience level). Multiple pieces of value were delivered. An email was captured — naturally, inside the conversation, without a form.\n\n**Why this outperforms the old way:**\n\n* Multiple touchpoints = stronger relationship before any sales conversation\n* You know the lead's context before your team talks to them\n* Email captured inside the conversation feels helpful, not transactional\n* Relationship-driven sequences convert significantly higher than one-shot blasts\n\nThe tools running this: **ManyChat** (most powerful, most flexible), **CreatorFlow** (built specifically for conversation flows), **Jotform Instagram Agent** (great for combining DM automation with data capture).\n\n**Stage 4: AI Message Variation (why your bot sounds like a bot)**\n\nHere's a small thing with a big impact.\n\nIf everyone who triggers your DM automation gets the exact same message — word for word, every time — two things happen. Instagram's spam detection flags the pattern. And people can tell it's automated, which kills trust.\n\nThe fix is AI message variation. Instead of one static response, AI generates multiple versions that rotate automatically:\n\nRather than *\"Hey! Here's the link you requested: \\[URL\\]\"* — identical every time — the system rotates:\n\n* *\"Hey \\[Name\\]! Here's that link: \\[URL\\]\"*\n* *\"Here you go! \\[URL\\] — let me know if you have questions\"*\n* *\"Got you! Here's the link: \\[URL\\]\"*\n* *\"Link incoming! \\[URL\\]\"*\n\nSame message. Four different phrasings. Feels human. Avoids detection. Takes about 10 minutes to set up inside ManyChat's advanced settings.\n\n**Stage 5: Story Reply Automation — the most underused channel right now**\n\nEveryone is automating comment replies. Almost nobody is automating story replies.\n\nThat's your gap.\n\nStory replies convert better than comment triggers for three reasons:\n\n1. **Higher intent** — they actively chose to respond to your story, not just scroll past\n2. **More intimate** — stories feel personal, not broadcast\n3. **Almost zero competition** — barely any brands are automating this\n\nSetup is simple: keyword trigger on story replies → automated DM with relevant content.\n\n**Real example:**\n\n>\n\n**Story automation ideas that work:**\n\n* Product mention story → trigger \"INFO\" → auto-DM with product details and link\n* Behind-the-scenes story → trigger \"HOW\" → DM with process breakdown\n* Launch announcement → trigger \"NOTIFY\" → add to waitlist with confirmation\n* Tutorial teaser → trigger \"FULL\" → send the complete tutorial link\n\nHigh intent, personal channel, almost no competition. This is the easiest win most agencies aren't taking.\n\n**Stage 6: The Multi-Touch Nurture Sequence**\n\nThe most effective DM automation in 2026 isn't one message. It's a timed sequence.\n\nThe framework that works:\n\n* **Touch 1 (immediate):** Deliver the requested value. Link, guide, resource — whatever they asked for. Add one specific tip about what to look at first.\n* **Touch 2 (12–24 hours):** Check in. Surface the one thing inside the content they're most likely to miss. Keep it genuinely helpful.\n* **Touch 3 (48–72 hours):** Ask a genuine question about their situation. Soft pitch only if it's relevant. This is where intent signals start surfacing.\n* **Touch 4 (5–7 days):** Final touchpoint. Leave the door open. Don't pressure. Give them an easy way to re-engage if the timing wasn't right.\n\n**The principle behind all of it:** every message should either deliver new value or ask a real question. If you can't answer \"why would this person want this message?\" — don't send it.\n\nSequences that feel helpful get responses. Sequences that feel like sales funnels get blocked.\n\n**The compliance layer (non-negotiable)**\n\nThis whole thing falls apart if your account gets restricted.\n\nOnly use tools that operate within Meta's **official API**. This means:\n\n* ✅ ManyChat, Jotform Instagram Agent, CreatorFlow\n* ✅ Hootsuite, Sprout Social, SocialBee, Flick, Ritetag\n* ❌ Anything promising bulk follows, automated likes, or mass DM blasts\n\nThose \"growth tools\" that promise fast follower counts violate Instagram's Terms of Service. They lead to shadowbans or permanent account restrictions. You'll lose the entire pipeline you built.\n\nEvery tool I've mentioned operates within API-safe practices. When evaluating anything new ,  that's the first question to ask.\n\nI put together a two-edition breakdown in my newsletter ( mentioned in comments ) covering the complete funnel stack — stages 6 and 7 in full detail, the DM-to-email pipeline with ESP integration options, AI lead scoring tools and how to set them up, reputation monitoring AI, Meta's native AI ad tools (Advantage+, Opportunity Score, Advantage+ Creative), and a step-by-step build order so you know exactly what to set up first for **AGENCIES . The first edition will be released tomorrow**\n\nIf you have questions on anything in stages 1–5, drop them below. Happy to go deep on any of it.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r5hh8i/i_reverseengineered_how_agencies_are_using_ai_to/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5iriti",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-15 15:32:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5k4nro",
          "author": "Pure_Data3489",
          "text": "None of the research is from chatgpt or anything , I have manually gone through a lot of websites , videos and spoken to people to write this article :)  \nI've used Ai just to make it sound better and format it :) That's it",
          "score": 1,
          "created_utc": "2026-02-15 19:32:16",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o5kdgjw",
          "author": "HarjjotSinghh",
          "text": "this is why i finally quit my soul-sucking job.",
          "score": 1,
          "created_utc": "2026-02-15 20:17:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ltrrk",
          "author": "Kml777",
          "text": "One thing I'd add to Stage 1 (AI content at scale): The agencies winning aren't just using AI for execution speed - they're using it to test 10 different messaging angles in the time it used to take to create 1 post. When it comes to generating AI video content at scale as an alternative to Invideo, I would suggest Tagshop AI. This tool helps you to generate realistic AI avatar videos for different social media platforms quickly and in a cost effective way.",
          "score": 1,
          "created_utc": "2026-02-16 01:05:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2mvay",
      "title": "Anyone else drowning in content tools? (Jasper, HubSpot, etc.)",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r2mvay/anyone_else_drowning_in_content_tools_jasper/",
      "author": "Otherwise_Economy576",
      "created_utc": "2026-02-12 07:11:44",
      "score": 9,
      "num_comments": 18,
      "upvote_ratio": 1.0,
      "text": "I’ve been using \\[Jasper / HubSpot / Copy.ai\\] for a year and I barely touch half the features. I really just need: plan topics → research → write → post → see what worked.\n\nHas anyone found something that does that without the “marketing cloud” bloat and $100+/month? Or are you all just stacking 5 different tools and making peace with it?\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r2mvay/anyone_else_drowning_in_content_tools_jasper/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4xyyky",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-12 07:11:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ye0ga",
          "author": "anajli01",
          "text": "You’re not alone — most people barely use half of Jasper/HubSpot.\n\nIf you just need plan → research → write → post → track, a lean stack works better:\n\n* Planning: Google Trends\n* Research/Writing: ChatGPT or Perplexity\n* Publish: WordPress/Ghost\n* Track: GA + Search Console\n\nBig suites are for teams. Most solo creators just stack a few simple tools and skip the $100+ bloat.",
          "score": 3,
          "created_utc": "2026-02-12 09:38:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ysdco",
              "author": "Otherwise_Economy576",
              "text": "That's what I have been hearing from others also.",
              "score": 1,
              "created_utc": "2026-02-12 11:49:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ypnb6",
          "author": "MarcoMusings",
          "text": "We use Monday for most of our workload planning as that does most of what you describe. Just need a list of whose doing what, when, and where. The actual writing aspect is done by people in our company.",
          "score": 2,
          "created_utc": "2026-02-12 11:26:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ysbx4",
              "author": "Otherwise_Economy576",
              "text": "That's a nice way of doing things with human in loop. Would it help if the frist drafts were already ready for people to build upon?",
              "score": 1,
              "created_utc": "2026-02-12 11:48:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4z9dhn",
                  "author": "MarcoMusings",
                  "text": "I have extremely talented writers who specialise in technical subjects - it’s faster and more effective with them writing from scratch. Has far more emotion baked in too.",
                  "score": 1,
                  "created_utc": "2026-02-12 13:42:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4yr5vp",
          "author": "Aggravating-Key6628",
          "text": "Had the exact same realization. Was paying for a full marketing suite and using maybe 15 percent of it. The plan-research-write-post-measure loop you described is really all most small teams need.\n\nWhat I ended up doing: research and writing goes through one AI subscription (Claude, ChatGPT, whatever you prefer). Scheduling goes through a simple scheduler or even native platform scheduling. Analytics lives in a basic dashboard or spreadsheet tracking what performed.\n\nTotal cost went from $100+ per month down to about $20-30, and the workflow is actually faster because there is less UI to navigate between steps.\n\nThe real insight is that the all-in-one tools are optimized for teams of 10+ where handoffs between people matter. For a solo operator or a small team, the overhead of learning and maintaining a complex platform outweighs the convenience of having everything in one place. Stack two or three simple tools and move on.",
          "score": 2,
          "created_utc": "2026-02-12 11:39:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4yrf94",
              "author": "Otherwise_Economy576",
              "text": "Makes sense. All in one tools being optimised for larger teams is the takeaway for me here",
              "score": 1,
              "created_utc": "2026-02-12 11:41:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4yu4j0",
          "author": "ArmOk3290",
          "text": "The marketing cloud tools are built for teams with dedicated specialists, not solo operators who just need to publish consistently. What works for most people is a stripped-down stack with AI for drafting, native scheduling tools, and basic performance tracking. The savings add up quickly when you avoid platforms that charge for features you will never touch.\n\n  \n",
          "score": 2,
          "created_utc": "2026-02-12 12:02:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ywz7r",
              "author": "Otherwise_Economy576",
              "text": "Yup. This! That's why I am building on in house. For exactly this",
              "score": 1,
              "created_utc": "2026-02-12 12:23:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o50wpo2",
          "author": "Yapiee_App",
          "text": "You’re not alone. Most of us use 20% of the tools we pay for. Simpler workflow > bigger stack",
          "score": 2,
          "created_utc": "2026-02-12 18:30:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o518yoq",
          "author": "AndyIsNotKuhl",
          "text": "The stack you described plan - research - write - post - review is conceptually simple, but most of the big tools bundle a ton of stuff that feels useful in marketing decks and useless in day t day work.\n\nWhat helped me was:\n\n* Separating decision flow from feature list most tools can do something in each stage, but the real time suck is moving context between them. If you spend more time exporting/importing than thinking, it’s not simplifying anything.\n* Defining “done” for each stage this was the game changer. When a topic hits ready for draft, what inputs are really required? When something goes live, what one metric actually matters? Once you define those, half the features in most clouds become noise.\n\nFor us, that looked like:\n\n* lighter planning in something simple calendar + shared doc\n* research either manual or scoped to what matters for that topic\n* writing in the simplest editor that gets version history\n* posting via scheduler\n* a quick post-mortem list what worked, what didn’t\n\nIn one project we also tested visibility layers like SyndrAI not because it replaced tools, but because it made clear what wasn’t being tracked. That clarity alone cut down how much we felt like we needed the next thing.\n\n",
          "score": 2,
          "created_utc": "2026-02-12 19:28:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54cike",
          "author": "svlease0h1",
          "text": "tool overload is real. most people end up paying for features they never touch. we simplified our workflow to one planning tool, one writing space, and basic analytics tracking. content output stayed the same and stress dropped a lot. sometimes fewer tools just means fewer decisions during the day.",
          "score": 2,
          "created_utc": "2026-02-13 06:17:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54jk5f",
          "author": "pietro_e_mina",
          "text": "I hit the exact same wall last year. I was paying for Jasper + other tools and using maybe 30% of what they offered. All I really wanted was a defined pipeline, but everything was super messy, everything felt like bloat.\n\nAfter trying way too many stacks, I stopped looking for the perfect tool and just built a small system around ChatGPT instead.\n\nIt sounds very complicated, but it wasn’t some huge coding project. I basically built a lightweight script that orchestrates prompts: it takes a topic + keywords, generates an outline, runs structured research prompts, writes a draft section by section, and exports a clean article. Most of it was copy/paste + tweaking code with ChatGPT/Copilot. Took around 3 days total.\n\nNow my workflow is pretty tight:\n\n• I generate a 3-month content strategy in one sitting with ChatGPT/Perplexity (12–16 articles)  \n• Quick manual keyword research per article (5–10 min)  \n• Feed the topic + keywords into my script, which runs a prompt pipeline (outline → research → draft) in the background  \n• 4–6 minutes later I have a structured draft  \n• I spend \\~15 minutes editing and polishing\n\nThe biggest win isn’t just speed (though it cut my production time by around 70%). It’s control. I’ve standardized client profiles, brand voice prompts, and article configs, so every piece of content is consistent and easy to tweak. The best part: I’m not locked into a $100+/month platform I barely use!\n\nAt this point I honestly think a simple custom workflow + AI beats most all-in-one marketing suites unless you need heavy team features...\n\nCurious if anyone else ended up building their own lightweight system instead of stacking tools. If anyone’s curious about mine, I’m happy to break down how I structured the prompt pipeline, it’s surprisingly simple once you see it laid out.",
          "score": 2,
          "created_utc": "2026-02-13 07:18:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54kd3s",
              "author": "Otherwise_Economy576",
              "text": "exactly. human in loop is important. atleast for me, i also went into same direction. created an in-house tool for this. and its working nicely so far",
              "score": 1,
              "created_utc": "2026-02-13 07:25:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o50o6fr",
          "author": "Confident-Tank-899",
          "text": "The problem with the big marketing clouds is they're built for huge orgs with departments. A solo person or small team doesn't need 80 features, you need 3-4 that are great.\n\n\n\nThe better approach: Start with what you actually use then add one tool at a time when it saves more time than it costs.\n\n\n\nMy current stack:\n\n\\- Google Sheets + Zapier for workflow automation (costs almost nothing, does 80% of what people pay $300/mo for)\n\n\\- ChatGPT API for drafts\n\n\\- WordPress + Elementor for publishing\n\n\\- Google Analytics + Search Console\n\n\n\nThat's genuinely it. The tools don't matter as much as having a system. If you spend 20 minutes deciding which AI writing tool to use instead of actually writing, you've lost.\n\n\n\nHubSpot makes sense if you're managing a sales team. Jasper makes sense if you're doing volumes of content. But if you're one person? You're paying for complexity you'll never use. Don't let FOMO drive tool decisions.",
          "score": 1,
          "created_utc": "2026-02-12 17:51:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o552w5a",
          "author": "Afraid-Wrongdoer-551",
          "text": "We use Writitude, as it has automated writing guidelines that are quite specific and give us required detailing, when it comes to the nuances of style and tone. It's done with specific rules, although you can add also a prompt as one of the rules for your guidelines. I guess, it's a major difference with the tools like Copy ai or Jasper, as this gives you more control and make guidelines more manageable. Then the guidelines can be shared with your team and applied to LLMs or running check for human-written texts.     ",
          "score": 1,
          "created_utc": "2026-02-13 10:19:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o556ii6",
          "author": "Gloomy_Ad_896",
          "text": "What industry are you in?",
          "score": 1,
          "created_utc": "2026-02-13 10:52:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5koj7",
      "title": "Traditional SEO feels like it’s missing the mark for AI search engines. I’ve been tinkering with a new approach.",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r5koj7/traditional_seo_feels_like_its_missing_the_mark/",
      "author": "Lopsided_Dig_8672",
      "created_utc": "2026-02-15 17:37:49",
      "score": 8,
      "num_comments": 4,
      "upvote_ratio": 0.91,
      "text": "I’ve been going down a massive rabbit hole lately trying to figure out why some of my high-ranking pages get zero love from Perplexity and SearchGPT, while some random niche pages get cited constantly. \n\nIt’s pretty clear that traditional keyword stuffing or even \"standard\" backlinking isn't the main driver here. I’ve been experimenting with what people are calling \"GEO\" (Generative Engine Optimization), and it feels like a totally different game. \n\nI started using some autonomous agents to crawl my own site and try to \"explain\" it back to me from the perspective of an LLM. What I found was pretty embarrassing—my internal data structure was a mess for anything using RAG (Retrieval-Augmented Generation). \n\nI’ve been trying to build a sort of \"playbook\" for myself on how to structure data specifically for these agents to pick up. It’s less about \"optimizing for humans\" and more about \"optimizing for the agents that feed humans.\" I’m trying to focus more on entity relationships and knowledge graphs rather than just long-form content.\n\nThe weirdest part is how inconsistent it is. One day a specific schema change gets me cited in a Perplexity answer, the next day it's gone. I'm currently trying to automate the monitoring of these citations to see if I can find a pattern, but it's slow going.\n\nIs anyone else here shifting their focus to this? Are you treating \"AI Search\" as a separate channel yet, or just hoping your current SEO carries over? I feel like we're in the wild west again.",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r5koj7/traditional_seo_feels_like_its_missing_the_mark/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o5jh5nu",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-15 17:37:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nkbtw",
          "author": "Difficult_Buffalo544",
          "text": "It definitely feels like the wild west again. You're right that these LLMs don't care about your backlink profile. They care about how clearly your data connects the dots between concepts. If your brand voice or entity data is inconsistent, the model just loses trust and drops the citation.\n\nI've been using Atom Writer to help with this. It has this logic layer that keeps everything incredibly consistent with our specific brand guidelines and vocabulary. It's massively underrated for GEO because it ensures every piece of content follows the same structural patterns that RAG systems love. Since switching, our citations have stayed way more stable across different search snapshots.\n\nAre you seeing the citation drops happen after you update the content, or does it seem totally random even when the page is stagnant?",
          "score": 1,
          "created_utc": "2026-02-16 09:02:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qjst3",
          "author": "Lemonshadehere",
          "text": "The inconsistency you're seeing is the most frustrating part. been dealing with this exact thing and it's wild how a page can be cited one week and then just disappear\n\nyour point about internal data structure is spot on. we've found that a lot of \"SEO-optimized\" content is actually terrible for RAG systems because it's written for humans scanning pages, not for semantic extraction\n\nwhat's worked: focusing on entity clarity and making sure relationships between concepts are super explicit. like not just saying \"our product does X\" but making it clear \"our product is designed for Y industry to solve Z problem\" in a way that's easy to extract\n\nthe knowledge graph approach makes sense but honestly it feels like overkill for most sites. simpler structured data + clear positioning seems to get you 80% of the way there\n\none thing I've noticed: third-party mentions still matter more than anything on your own site. even with perfect schema and entity structure, if you're not being discussed elsewhere, LLMs skip over you\n\nare you tracking specific queries or just monitoring general brand mentions? we've had better luck focusing on 20-30 high-intent prompts rather than trying to monitor everything",
          "score": 1,
          "created_utc": "2026-02-16 19:31:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r302v5",
      "title": "What Seo tools should beginners🥇 focus on first?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r302v5/what_seo_tools_should_beginners_focus_on_first/",
      "author": "Ibrahim-08",
      "created_utc": "2026-02-12 17:45:55",
      "score": 7,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "Share what helped you the most in the comments",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r302v5/what_seo_tools_should_beginners_focus_on_first/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o50mzpj",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-12 17:45:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52zvfx",
          "author": "fatjoe-SEO",
          "text": "Google Search Console.\n\nThat’s the only tool a beginner truly needs at the start. It shows what you rank for, what gets impressions, what gets clicks, and where you’re leaking traffic. Most people ignore the Queries and Pages reports and jump straight into fancy tools.\n\nAfter that, use a crawler like Screaming Frog to see what Google actually sees on your site. You’ll learn more from fixing indexation, internal linking, and thin pages than from any keyword tool",
          "score": 4,
          "created_utc": "2026-02-13 00:51:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5151t5",
          "author": "No_Hedgehog8091",
          "text": "Google Search Console. Free, direct data from Google itself.",
          "score": 2,
          "created_utc": "2026-02-12 19:09:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54b0yo",
          "author": "supriya_l89",
          "text": "Begin your learning by using basic tools which help you learn essential skills instead of using advanced technological tools which create confusion. The initial step to learn about website traffic and performance metrics begins with Google Search Console and Google Analytics. You need to combine that with a keyword research tool which can be used through Ubersuggest or the free features of Ahrefs and a fundamental site evaluation tool which helps you identify technical problems on your website. You must first learn to interpret data before you can use tools because their value depends on your ability to understand the numerical data.",
          "score": 2,
          "created_utc": "2026-02-13 06:04:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54unl2",
          "author": "Getrekt2333",
          "text": "GSC, GPT.",
          "score": 1,
          "created_utc": "2026-02-13 09:01:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54xf22",
          "author": "Existing-Cod5443",
          "text": "Semrush, Moz,ubwesuggest",
          "score": 1,
          "created_utc": "2026-02-13 09:27:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58rdmd",
          "author": "Tight_Tree8390",
          "text": "Google Search Console was the most useful for me at the beginning because it shows what people search and how your pages perform. Canva is great for creating content quickly and Notion helped me keep everything structured. I also use Cubeo AI to handle parts of my marketing workflow like topic research and content preparation. It’s easy to use and doesn’t require technical knowledge, which makes it practical for beginners who want to integrate AI without complexity.\n\nWhat matters most early on is keeping your stack simple and focusing on tools you’ll actually use consistently.",
          "score": 1,
          "created_utc": "2026-02-13 22:16:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58sh7j",
          "author": "PatchneckRed",
          "text": "Google Search Console has been thrown out here a lot. I'll say that at my company, we started with Serpfox pretty early on and that's been a great tool. ",
          "score": 1,
          "created_utc": "2026-02-13 22:22:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5al78w",
          "author": "Riya_blogger12",
          "text": "For beginners, I’d say start with the basics before jumping into expensive tools. Google Search Console and Google Analytics should be your first focus; they’re free and show you real data from your own site. After that, tools like Ubersuggest, Ahrefs (even the free version), or SEMrush can help with keyword research and competitor analysis. But honestly, understanding search intent and content quality matters more than any tool. Tools support strategy; they don’t replace it.",
          "score": 1,
          "created_utc": "2026-02-14 05:16:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1bj8h",
      "title": "AI is NOT taking our jobs. Just because Y Combinator is now investing in AI first agencies, they will learn it ain't that easy.",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r1bj8h/ai_is_not_taking_our_jobs_just_because_y/",
      "author": "stpauley45",
      "created_utc": "2026-02-10 20:05:52",
      "score": 7,
      "num_comments": 17,
      "upvote_ratio": 0.82,
      "text": "AI can't do eveything. It's not that good. The needs of an SMB versus <$25m are HUGE and still it will take nuance and tribal knowledge the machines can never fully know or understand. MILLIONS of businesses stay under $10m in revenue FOREVER or fail. There is no shortage of businesses that will need human consultants that simply use AI as a tool to do work faster, but AI will not outright replace us digital marketers.\n\nHunker down. Lean into AI. Get good at using it as a powertool.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r1bj8h/ai_is_not_taking_our_jobs_just_because_y/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o4ob45j",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 20:05:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qmrj4",
          "author": "anajli01",
          "text": "Hard agree. AI is a power tool, not a replacement. SMBs run on nuance, context, and messy human decisions that’s where consultants still win. The edge isn’t “AI-first,” it’s human judgment + AI leverage.",
          "score": 3,
          "created_utc": "2026-02-11 03:39:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p44j2",
          "author": "Single-Sea-7804",
          "text": "I'm curious as to how many agencies are switching from ad management or SMMA to AI automation and processes entirely. I'm tempted to make the switch... ",
          "score": 2,
          "created_utc": "2026-02-10 22:21:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4pyihg",
              "author": "stpauley45",
              "text": "Here's the problem EG. PMAX shits the bed after 3-4 months for NO REASON...you have to pause/restart/delete the campaign and start over. How is AI gonna fix that internal Adwords glitch?\n\nFrom a noobs perspective I can see people thinking it's the greatest thing in the world, but from an experienced practitioner perspective there are too many nuances to trust AI to handle them all. Hell, OPtimyzr doesnt even automate 100% of everything, but does a pretty good job of makig account management easier.\n\nHaven't tried Preflect yet though for ecommerce but it looks pretty nice. \n\nWhere real performance matters, I see AI making the management EASIER and more scalable but in no way replacing adwords experts.",
              "score": 2,
              "created_utc": "2026-02-11 01:11:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4tdotn",
                  "author": "Rybaco",
                  "text": "That issue with Pmax degrading over time I thought was solved years ago? Or maybe our processes have just negated the issue. We follow a few simple rules now and have Pmax campaigns that can run on autopilot. I only have to check them once or twice a quarter.\n\nIf it doesn't have at least 100 conversions over a 30 day period, Pmax will have a lot of trouble. Not always, but most of the time it fails after 2-3 months. Have a campign with 300 conversions a month? You can only divide into 3 campaigns max before performance starts to suffer, and that's if conversions are spread evenly over all skus which is never the case.\n\nIf your product feeds are not completely automated yet, don't even bother with Pmax. Merchant center should be updated every few hours, minimum. Best practice is to send an update via Merchant Center API anytime your product data changes on your website. Even once a day isn't enough anymore, products flickering between approved/disapproved because your website updates before Merchant Center will kill performance.\n\nThere isn't much strategy to Pmax outside of dividing products into campigns that make sense. Products with similar margins should be grouped together in campaigns to take advantage of lower ROAS targets for high margin products while protecting run away spend for low margin items.\n\nOverall, good Google Ads performance has become less about marketing and more about plumbing. At least when it comes to product ads. Also, I've never found an off the shelf solution that actually works well. Our IT dept handles the automation, it's almost impossible to do without at least 1 programmer on staff. And no, vibe coders don't count lol.",
                  "score": 2,
                  "created_utc": "2026-02-11 15:45:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4rem37",
          "author": "adifounder",
          "text": "AI is best for assistance, but they still need you as a manager",
          "score": 2,
          "created_utc": "2026-02-11 07:15:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54jmfq",
              "author": "Firm_Distribution999",
              "text": "For now…",
              "score": 1,
              "created_utc": "2026-02-13 07:18:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4rrc4u",
          "author": "Low_Confection_2433",
          "text": "AI is a good tool to help you, definitely not a replacement for human judgment nor expertise, at least not yet. Hence, to me, all these investments is just a way to inflate the hype around it without listening to the real users and consumers",
          "score": 2,
          "created_utc": "2026-02-11 09:15:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4s78en",
          "author": "Aggravating-Key6628",
          "text": "The nuance most people miss is that AI doesn’t replace the strategist - it replaces the person who was basically already acting like a bot. If your job was \"write 20 variations of ad copy and see which performs best,\" yeah, AI does that faster. If your job was \"figure out why this client’s CAC doubled despite more traffic,\" that’s not going anywhere.\n\nThe YC investment in AI-first agencies is interesting but the graveyard of \"AI will replace X\" startups from 2023-2024 is massive. Most failed because they underestimated how much of marketing is relationship management, context-switching between client problems, and just knowing that this particular industry has weird compliance rules that no training data captures.\n\nWhere I’d actually worry is the junior positions. The entry-level \"manage these social accounts and write these blog posts\" role is genuinely getting compressed. But the mid-level and senior work - campaign architecture, attribution modeling, client communication - that actually gets more valuable because AI handles the grunt work and frees you up for the strategic layer.\n\nBest move right now is exactly what you said: get insanely good at using AI as a power tool. The gap between someone who can prompt well and someone who can’t is already bigger than the gap between junior and senior was 5 years ago.",
          "score": 2,
          "created_utc": "2026-02-11 11:38:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tdesn",
          "author": "Yapiee_App",
          "text": "I think the real shift isn’t replacement, it’s compression. AI reduces execution time, but judgment, positioning, and context still sit with humans. The marketers who treat it like leverage instead of a threat will probably be the ones who benefit most.\n\n",
          "score": 2,
          "created_utc": "2026-02-11 15:43:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wappf",
          "author": "Tangentkoala",
          "text": "Whata gonna stop companies from hiring 1 creative manager to manage 10 chat bots. Vs the same company hiring 11 different market analysts",
          "score": 2,
          "created_utc": "2026-02-12 00:17:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rcs4e",
          "author": "Xavier_Caffrey_GTM",
          "text": "agree AI isn't replacing us but the framing is slightly off imo. the threat isn't AI vs marketers, it's marketers who use AI vs marketers who don't. the agencies that figure out how to 10x their output per person using AI as a power tool will absolutely crush the ones still doing everything manually. so yeah it's not taking our jobs, but it IS raising the bar for what \"good enough\" looks like",
          "score": 1,
          "created_utc": "2026-02-11 06:58:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54jswp",
          "author": "Firm_Distribution999",
          "text": "Simply being a human who uses AI tools is just one step away from redundancy. \n\nYou truly have to do more than just use the AI tools to stay relevant. \n\nAssuming your job is safe is sticking your head in the sand. Adapt every 2-3 years or you’ll become irrelevant. The squeeze is real. ",
          "score": 1,
          "created_utc": "2026-02-13 07:20:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54k54d",
          "author": "Firm_Distribution999",
          "text": "There is also no way all of these companies are investing billions upon billions for AI to “not be that good” - AI is adapting and changing at the speed of light. \n\nEvery 6 months, there is a new mini AI tech revolution where capacity is enhanced and the results are better and better. \n\nAI will be better, it will do rote human tasks better, and we will continue to work alongside it. \n\nOur jobs will change and what companies will pay humans to do will change. \n\nAs always, adapt or die. ",
          "score": 1,
          "created_utc": "2026-02-13 07:23:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3f0ws",
      "title": "Am I looking for a unicorn?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r3f0ws/am_i_looking_for_a_unicorn/",
      "author": "ahsman1122",
      "created_utc": "2026-02-13 03:59:28",
      "score": 7,
      "num_comments": 45,
      "upvote_ratio": 0.62,
      "text": "I run a lawn care & landscaping company and I’ve been looking for someone to help run my meta ads for me for the last month or so. All of the prices I’ve gotten have seemed so astronomically high ranging from $800-$1500. And the $800 offer is from 2 18 year olds with little to no experience.\n\nI’m looking for someone who does their pricing on a per lead basis, every job that they bring in for me I pay them a percentage of that job. Is that unreasonable to look for? It adds a layer of security for me so I don’t get ripped off, and it uncaps their potential profit as long as their services work as well as they say they should.\n\nLet me know if I’m crazy to be looking for something this specific, I feel like I’m running out of local options.\n\n\\*EDIT\\*. Thank you guys for all the information and insight, it seems like I’m pretty off-base with what my idea of a marketing agency would look like for my business.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r3f0ws/am_i_looking_for_a_unicorn/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o53u30e",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-13 03:59:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53wbj9",
          "author": "tomowudi",
          "text": "Unless your commission will reasonably be more than $2k monthly for leads that turn into sales, your expectations are not really reasonable. \n\n\nAfter all, what if your sales process sucks?\n\n\nThey could send you awesome leads that you can't convert, and you expect them to risk their paycheck?\n\n\nWhat you are setting them up for is an argument about lead quality that will result in them not getting paid for the work and expense of the campaign they will have to put together for you.",
          "score": 35,
          "created_utc": "2026-02-13 04:14:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5457c8",
              "author": "Obvious_Classic_2355",
              "text": "This is the main reason alot of marketers avoid lead based payments, save alot of arguments in the future.",
              "score": 7,
              "created_utc": "2026-02-13 05:18:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5anylz",
                  "author": "Commercial_Set581",
                  "text": "Going the other direction -\n\nI had a meeting with a marketing firm. In the first meeting, before delivering anything, they wanted to move us to a 12 month exclusive retainer. \n\n\"This is the only way we work\"\n\nOk - then we're not working together.",
                  "score": 2,
                  "created_utc": "2026-02-14 05:38:49",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o57rdp5",
                  "author": "tomowudi",
                  "text": "Yup, if you can deliver consistently, you just put together an affiliate program. That's why those exist, because if people can make money giving you leads to convert, you'll get all the leads you can handle. \n\n\nIf you can't...\n\n\nWhy the hell would I drive traffic for you when I can spend the same amount of time driving traffic to a better paying offer?\n\n\nMarketers that are great at delivering this sort of targeting make more money promoting programs that pay per lead or per sale, and they do so because they already have their own lists to monetize.\n\n\nIf they don't, they need the data for the metrics, and that's always going to be risky with each new campaign. ",
                  "score": 1,
                  "created_utc": "2026-02-13 19:18:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o54619k",
          "author": "NaturalSelecty",
          "text": "The reason I’d never to agree to this is because what if you’re not great at closing. I could spend hours bringing you solid leads, but if they don’t turn into customers, I don’t get paid even if the leads were good.\n\nYou’d also have to think about whether that percentage applies to every month they stay on and to any future projects they add on. My gut says that would be a no.\n\nThe prices you received are on-par with the small agencies I’ve worked for/with in the past. Based on this post, you don’t really have the funds for an agency or even freelancer to begin with. \n\nWhile marketing may not cost as much as retaining a lawyer, hiring marketers and allocating budget toward strategy is still one of the more significant expenses in business since it’s a direct investment in your brand.",
          "score": 9,
          "created_utc": "2026-02-13 05:24:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54xeix",
          "author": "alexandrealmeida90",
          "text": "Yes, that is unreasonable.\n\nNo one experienced will be shooting video ads, running ads, sending reports, and taking proper care of lead quality without any guarantees.\n\nYour close rate will drop significantly once you start running ads. So there's a good chance this person would be putting in dozens of hours of work just to gain some change.\n\nYou're only going to get 18 year olds with this approach\n\nAnd you'll get what you pay for",
          "score": 6,
          "created_utc": "2026-02-13 09:27:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54bo4c",
          "author": "Thirtysixx",
          "text": "$1500 is not high lol \n\nI wouldn’t touch your ad account for less than $2500",
          "score": 9,
          "created_utc": "2026-02-13 06:10:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o550ydj",
          "author": "SystemicCharles",
          "text": "Sounds like a good deal for you, but...\n\nWhat if they send you more leads than you can handle?\n\nOr they send you jobs you are not equipped to handle?\n\nOr they send you a bunch of lower ticket jobs (that are still worth something)?\n\nDo you see where this is going? In my opinion, these types of deals work best when you have a lot of other things already in place too.",
          "score": 3,
          "created_utc": "2026-02-13 10:01:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5540o4",
          "author": "BotsAndCoffee",
          "text": "You're looking at this the wrong way. Marketing costs should be viewed as an investment, not as an expense.  You are investing in getting somebody to come in and set up a stable, repeatable, reliable source of leads that will lead to growth.\n\nIn a role like this, you're not paying for somebody to push buttons. You're paying for somebody's expertise. Even more so if you expect them to provide creative.\n\nAdditionally, it's important to understand why paying people on a per-lead basis is generally not viewed as a fair deal to them.  They are using their time, energy, and expertise to generate leads, but then are constrained by issues outside of their control, such as:\n\n* Your ability to convert the jobs\n* Your pricing\n* Your capacity to take on new jobs\n* Your reputation.\n\nThese can be serious constraints to anybody generating leads.  If you want good people and people with deep expertise in your niche, you should pay them accordingly.",
          "score": 3,
          "created_utc": "2026-02-13 10:29:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55th78",
          "author": "Monkeyboogaloo",
          "text": "How much an hour do you charge for your work?  Are you willing to wait for me to pay you in the summer when the flowers bloom? \n\nThe prices you have been quoted a more than fair.",
          "score": 3,
          "created_utc": "2026-02-13 13:34:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55u3e7",
          "author": "Scary_Historian_9031",
          "text": "the pay-per-lead model sounds fair on paper but it attracts the worst marketers because good ones know their time is worth more than gambling on your close rate. 800-1500/mo for meta ads is actually the lower end of market. real question for lawn care specifically - have you tried google local services ads first? for service businesses those convert way better than meta because the intent is already there. meta is great for awareness but LSAs catch people actively searching for lawn care in your area.",
          "score": 3,
          "created_utc": "2026-02-13 13:38:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55xaff",
          "author": "No_Breadfruit8393",
          "text": "Most marketers know they can’t trust business owners to actually do what they say. So they spend time running your ads and get you leads - do you have a good sales process to respond quickly to convert the most? Are you going to give them % from total or after costs? How long will it take to pay? And most good marketers find that the more money they make someone the less that someone wants to pay them so then they start arguing about paying anything…\n\nSo yes you’re being unreasonable. Most will charge a base plus percentage of ad spend. $800-1500 is not unreasonable at all.",
          "score": 3,
          "created_utc": "2026-02-13 13:55:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54bkx2",
          "author": "Yazim",
          "text": "To explain a little bit about why: the challenge is scale. Nobody is trying to overcharge you, but it ironically takes about the same amount of time to optimize an ad spend of $1k/month as it does $100k a month. And sometimes the $1k/month is harder to manage because you have no room for testing, experimentation, or risks/error, and it takes a long time to go through the cycle of test-->deploy-->measure, since your ads are reaching so few people and it might take days to know if your change really did anything useful.\n\nAnd from an ad management perspective, it's really hard to add sufficient value while also making it worth your time to manage it at all. If the ad spend is $1k and my fee is $1k, I have to at least double the effectiveness of your ads to make it worthwhile (while also not spending so much time on it that the $1k isn't worthwile. That's hard. Or in other words, if you didn't actively manage it, you could afford for it to perform twice as bad and the ROI would be the same.\n\nThat said, outsourcing here might be perfect. $1k goes a lot further in other areas of the world, and may get you someone with a lot more skill who is willing to spend a lot more time to optimize it correctly . Vet them very carefully of course - they can cause you a lot of problems too - but overall it might fit better for the scale you need.",
          "score": 2,
          "created_utc": "2026-02-13 06:09:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o567nv3",
              "author": "Unique_Self_5797",
              "text": "> Nobody is trying to overcharge you, but it ironically takes about the same amount of time to optimize an ad spend of $1k/month as it does $100k a month.\n\nIn my experience, like 80% of the $1,000/month clients demand more service than the $100k/month clients. The small-budget clients want every penny accounted for, want immediate results, and constant updates. The $100k/month clients are usually spending that much or more with like 5 other partners, and just want an excel report they can upload to their dashboard.",
              "score": 3,
              "created_utc": "2026-02-13 14:50:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o58ej7z",
          "author": "Terrible-Guitar-5638",
          "text": "With that low of a budget, make some ads on canva and learn how to run your own ads! \n\nLots of YouTube videos and it's lots of trial and error. Set a $5 a day budget to start, test ads to see what converts and send it",
          "score": 2,
          "created_utc": "2026-02-13 21:13:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o541hez",
          "author": "fuckswithboats",
          "text": "What kind of percentage are you looking for and what’s your average ticket price?",
          "score": 1,
          "created_utc": "2026-02-13 04:51:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o545bvr",
              "author": "ahsman1122",
              "text": "I would ideally be giving the person running my ads 15-20% of revenue from each booking that comes from them. Average ticket price is say $350, some much higher($800-$1,000) jobs. This would mean on the low end they’d receive $50-75 per job. 5 jobs a week would be pretty reasonable to attain for them, so they’d be looking at something like $375 a week",
              "score": -4,
              "created_utc": "2026-02-13 05:19:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o548aso",
                  "author": "dunksbx",
                  "text": "Who pays for the ads? You're expecting someone to pay money out of pocket in hopes you can close a sale? Pay per lead, pay their rate, or get lost.",
                  "score": 1,
                  "created_utc": "2026-02-13 05:42:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o547k39",
          "author": "Good-Work2301",
          "text": "What’s the range a price per lead you would be comfortable with?",
          "score": 1,
          "created_utc": "2026-02-13 05:36:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54i3eu",
          "author": "Lankythunder576",
          "text": "Setup Local Service Ads and you’ll be fine. It’s pay per lead based and you get refunded by Google on any non qualified or spam leads. We have set them up for a bunch of our service based clients and are seeing great results for them. Decent CPLs too. Ranging in the $20-$80/lead range. The $80 leads are for our dentists and orthodontics offices. Tree care and window replacements are running at $35-$40 currently.\n\nDefinitely recommend you look into LSAs.",
          "score": 1,
          "created_utc": "2026-02-13 07:04:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o55z260",
              "author": "polygraph-net",
              "text": "> It’s pay per lead based and you get refunded by Google on any non qualified or spam leads.\n\nWait - can you clarify this?\n\nHow does Google know which leads are non-qualified? How do they know which leads are fake? What proof do they need from you? When did they introduce this?",
              "score": 1,
              "created_utc": "2026-02-13 14:05:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o54nuci",
          "author": "SteviaMcqueen",
          "text": "I am pro pay per lead. Send me a dm so we can deep dive.",
          "score": 1,
          "created_utc": "2026-02-13 07:57:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54ucrr",
          "author": "snazzydesign",
          "text": "You need to hire them for 1 month at 1500, and see the results",
          "score": 1,
          "created_utc": "2026-02-13 08:58:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55c9l5",
          "author": "MySEMStrategist",
          "text": "That is not a crazy request, and there are lead gen companies that operate that way (usually selling shared leads like HomeAdvisor) but for a dedicated ad manager, it’s rare unless there’s meaningful proof that the company is already generating leads in volume successfully. \n\nEven if they run the best ads in the world, if your market is saturated, your pricing is higher than competitors, or you miss a few calls, they don't get paid.  Granted, they shouldn’t be taking you on as a client regardless of payment model if this is the case.",
          "score": 1,
          "created_utc": "2026-02-13 11:41:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55d9pr",
          "author": "Aggravating-Key6628",
          "text": "You're not crazy but you're going to have a really hard time finding someone good who works on pure pay-per-lead for Meta ads. Here's why.\n\nThe person running your ads still has to spend time on creative, testing audiences, managing the campaigns daily, and dealing with Meta's constant platform changes. That's real labor regardless of whether leads come in week one or week three. Good media buyers know their time has value and they've been burned by performance-only deals where the business owner ghosts them after a slow first month.\n\nThat said, $800-$1500/month for ad management alone isn't crazy for someone competent. The issue is what you're getting for that money. A lot of agencies charge those rates and then run cookie-cutter campaigns with zero strategy customization.\n\nWhat I've seen work well for local service businesses like lawn care is a hybrid model. Something like a smaller base retainer ($400-500/month) plus a per-lead bonus. That way the marketer has skin in the game but isn't working for free during the ramp-up period. It also filters out the agencies who don't actually believe in their own results because they'll refuse the bonus structure.\n\nFor lawn care specifically, your cost per lead on Meta should land somewhere around $15-35 depending on your market. If someone is quoting you management fees but can't tell you what CPL to expect in your area, that's a red flag. Ask them about their experience with service-area businesses and what kind of lead volume they've driven before. The good ones will have numbers ready.",
          "score": 1,
          "created_utc": "2026-02-13 11:48:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55kwtc",
          "author": "Radiant-Security-347",
          "text": "You’re not crazy to want alignment. But the structure you’re proposing is why experienced operators won’t take the deal.\n\nIf you pay on percentage of closed jobs, the agency is carrying all the upfront labor while having no control over your response time, quoting process, close rate, or upsells. They control traffic and leads. You control revenue conversion. Tying their pay to your sales execution is a risk most seasoned agencies won’t accept.\n\nWhen you add required video production, you’re asking them to concept, shoot, edit, test, set up campaigns, configure tracking, and optimize before earning a dollar. That’s real labor and real cost. In effect, you’re asking another business to fund your growth with their time and expertise as an interest-free operational loan. Established operators don’t finance client businesses that way.\n\nAlso, “per lead” in lawn care is rarely clean. Some leads price shop. Some don’t answer. Some ghost after quotes. Who decides what counts? Those disputes are common in performance-only models.\n\nAs for the $800–$1,500 quotes, that’s not astronomical for Meta management. It covers strategy, creative testing, tracking setup, optimization, and reporting. The real money at risk isn’t the management fee. It’s your ad spend if campaigns are poorly structured\n\nHiring inexperienced people might feel cheaper, but if they haven’t managed real budgets over multiple months and corrected underperforming campaigns, you’re paying for their learning curve.\n\nIf you want serious talent, expect a monthly management fee plus ad budget and a defined testing window. If you insist on performance-only, you’ll mostly attract operators who have little leverage or little experience.",
          "score": 1,
          "created_utc": "2026-02-13 12:43:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55qp9u",
          "author": "Full-Penalty6971",
          "text": "We can arrange something similar 👍",
          "score": 1,
          "created_utc": "2026-02-13 13:18:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o568pdd",
          "author": "SnoooCookies",
          "text": "I'm assuming your planned media spend is too low to make it worthwhile.\n\nBuying the cheapest agency you can find will not help you. You're in a difficult position and to be honest I think a motivated cousin that works for 30$ an hour will yield a better result than an agency.\n\nReason is you just need someone that has some marketing skills or is willing to learn and adapt quickly. You don't need to do anythig facy, just aim for a best practice and make it a little more unique/personal.\n\nAlso:  \nAssuming agency receives 100$ per lead. They need to deliver minimum 12 leads / month to make it worth their time.\n\nI'd even say 16 as they're taking on some risk by working on a variable basis.\n\nIf they need to spend 100-200$ per lead in ads, the minimum media budget is 1600-3200$. +1600$ in commissions to the agency.\n\n\n\nAssuming the hypothetical cousin is't terrible I'd imagine you get away with a cost per lead that might b a littl higher, but it's offset due to the big reduction in people cost. \n\nEve the most talented marketer will not be able to offset his high people cost vs the limited media budget.",
          "score": 1,
          "created_utc": "2026-02-13 14:55:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56fibz",
          "author": "Eightysixstrategies",
          "text": "I specifically partner with service businesses and provide affordable solutions. Facebook ads are not the most effective approach in my experience although I don’t know where you are located. I am happy to walk you through how I support my clients and what has been successful for them.",
          "score": 1,
          "created_utc": "2026-02-13 15:28:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56ll4z",
          "author": "xRyozuo",
          "text": "You want to charge people based on how much you make, which means if you’ve got a shit pitch/product/pricing which they have no power over, they’re working for free. That’s just not gonna work. Would you even consider working for someone you don’t know who is not willing to front materials cost and will only pay if they like it?\n\nYou might be able to offer slightly lower + lead gen commission after you prove you can convert their leads. You might have an easier time of convincing someone who has done work for a similar client before so they don’t need to do as much research into your field from the ground up. \n\nDon’t bet on the 18 year olds for the chance they’re good and not just setting your campaigns on auto, or worse, simply going by vibes or what ChatGPT tells them. Might as well do it yourself if you’re seriously considering doing this.",
          "score": 1,
          "created_utc": "2026-02-13 15:57:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56oubu",
          "author": "debdeb1011",
          "text": "Marketer here who has worked with some big companies, now I'm helping local businesses grow through digital marketing. \n\nAds do great tbf, I've generated over 1500 leads for local businesses in australia over the past few months for multiple people. Though the 800-1500 range sounds a bit much for no experience. Drop a DM if you'd like to chat.",
          "score": 1,
          "created_utc": "2026-02-13 16:13:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57ux09",
          "author": "failingscaling",
          "text": "Check out upwork.com. You can hire skilled professionals from remote countries that value hard work and allows you to arbitrage lower wages.",
          "score": 1,
          "created_utc": "2026-02-13 19:35:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58qipl",
          "author": "BlueGridMedia",
          "text": "Not unreasonable to ask, but uncommon, agencies don’t control your sales process, so pure pay-per-lead rarely works long term. Hybrid pricing is usually the compromise.",
          "score": 1,
          "created_utc": "2026-02-13 22:12:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5430vh",
          "author": "RealisticIllusions82",
          "text": "I’ll do it, maybe. \n\nHow do I ensure you’ll be honest about the leads booked?\n\nHow many leads and jobs do you get on average per month now? And average job size?\n\nWhat do you expect the cost per acquisition to be and how much of each job are you willing to pay",
          "score": 1,
          "created_utc": "2026-02-13 05:02:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o545ks1",
              "author": "ahsman1122",
              "text": "I think I’d prefer to work with someone local so they’d be able to film ad creatives for me. Unless you have some good testimonials and think we’d be a good fit I’d be open to talk more",
              "score": -8,
              "created_utc": "2026-02-13 05:21:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o54fl1n",
                  "author": "bluehairdave",
                  "text": "So you'd like someone to not only manage your ads for you but to also film your ads for you as a videographer and you're balking at the price that other people are offering to do it for?\n\nThe problem isn't that you're looking for a unicorn it's that you don't want to pay for the work that you want done. But you've got two 18 year olds willing to do it without a track record and that's exactly the kind of money that you're offering up. I dont say this to be mean. Its just the facts for the situation. \n\nHere's the other dilemma that you're going to face how much is each one of those contracts worth to you and how much would you pay them? Is it a high amount is it the $100 to $500 per 1 lead they could get getting leads for somebody who does say solar installations or Roofing? Would the percentage of any gigs that you get from it is high as the 2000$ to $4000 they would get from other Home Services on deals you close?\n\nYou should expect to pay at least a third of your gross revenue on things like your leads and incoming clientele marketing.\n\nSo this is the other Dilemma. If somebody is experienced and understands how to do your social media and you want them to film which is an entirely different area of expertise they're going to do it for clients who can pay them a lot more money for the same amount of work.\n\nNot to mention that with local Home Services it's more of a holistic approach between your Instagram and Facebook accounts mixed with your Google reviews and Google lead generation and then mix that with Google search and YouTube. And then add in the sprinkle of Yelp. So it's really like a whole thing and it's basically the most important thing that your company is going to have besides providing good services so yes it's going to cost you.\n\nI wish I had better news but I hope I laid it out in a pretty straightforward way of the problem you're going to run into. But somebody who's good at running ads and creating ads can get paid $80 to $150 pwr lead just sending those leads Nationwide to one of the lead services that you would probably be buying leads from. And they can make 20 grand to $500,000 a month. And maybe that can give you some perspective of why one client for $2,000 a month doesn't make much sense.\n\nThere are agencies that take on accounts but they'll probably charge a flat fee of like $2,000 a month plus 15% of AD spend and you're going to be required to spend at least 10 to $20,000 a month in ad spend. And even then it's going to be one of their guys in Pakistan or the Philippines running your campaigns. And then you'll have to pay $100 to $300 per ugc ad or video ad that you want to make at a minimum.\n\nThis is what I do for a living from A to Z companies in digital marketing from the ads all the way up to the leads.\n\nAnd unfortunately smaller ticket home services really just need to get basic internet presence done and then buy leads from one of these marketplaces and try and do their best to close them all.",
                  "score": 12,
                  "created_utc": "2026-02-13 06:43:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o55lxik",
                  "author": "PileofMail",
                  "text": "Are you trolling us? You’re also expecting this person to film and edit content at no cost to you? I think you need to have a sit down with a business consultant so you can learn how marketing investments work.",
                  "score": 8,
                  "created_utc": "2026-02-13 12:49:46",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o549px6",
                  "author": "DragonfruitKiwi572",
                  "text": "If you need someone local where are you based? How many ppc experts are around there that do lead gen? How will they know you’re not screwing them and saying well that one sort of came from ads but also I know his cousin and met him at a baseball game once so you don’t get commish on that one",
                  "score": 4,
                  "created_utc": "2026-02-13 05:54:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o545zh8",
          "author": "kanguru",
          "text": "I do exactly this, DM me.",
          "score": 0,
          "created_utc": "2026-02-13 05:24:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r43oju",
      "title": "Which digital side hustle would you double down on if you were me?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1r43oju/which_digital_side_hustle_would_you_double_down/",
      "author": "energy_trapper",
      "created_utc": "2026-02-13 22:47:52",
      "score": 6,
      "num_comments": 20,
      "upvote_ratio": 0.88,
      "text": "I'm trying to pick a lane and actually launch something in the next 30 days instead of overthinking forever.\n\n**Background:** MBA, ex-Big 4 consulting, work in commodities trading full-time. People CONSTANTLY ask me for career help (resumes, LinkedIn, interview prep). I'm the \"successful\" one. I've never had a hard time finding a job though. I also love old Euro cars and have 2K followers on a car IG where I feature my cars, do some film photography, and have weirdly specific knowledge/travel exp in the former Soviet Union. Studied abroad there.\n\n**The options I'm debating:**\n\n1. **Career services** (resume reviews, LinkedIn optimization) - feels like easiest money since people already ask me for this, but I do have a day job and don't want there to be any intersect (don't want my boss seeing me push career content on LinkedIn)\n2. **YouTube channel** on travel to strange places like Eastern Europe, former Soviet Union, etc. (like Bald and Bankrupt style)\n3. **Affiliate marketing/paid ads** for things I like such as tech and gadgets that I already spend A TON of research on before buying them\n4. **Food content** on social media (friends always come to me to find the best food)\n\n**My hesitation:** Career services feels too \"job-like.\" Travel content sounds fun but seems like a long game. Affiliate marketing feels spammy? Food content is oversaturated?\n\n**What would you pick if you were me and had at least 4 hours a week to dedicate to this?**\n\nThanks in advance!",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1r43oju/which_digital_side_hustle_would_you_double_down/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o58x6at",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-13 22:47:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58xvsg",
          "author": "Character_Cable_1531",
          "text": "I would say travel. Sounds like you would enjoy it most and from my background also in finance, we need a break haha. Even if its a long game, you have an excuse to travel!",
          "score": 1,
          "created_utc": "2026-02-13 22:51:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59a5dj",
          "author": "Suspicious_Skin_1523",
          "text": "Why not mix marketing and consulting to start an agency? With your background, there’s a lot you can do.",
          "score": 1,
          "created_utc": "2026-02-14 00:04:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cwku1",
              "author": "energy_trapper",
              "text": "My Big 4 consulting background adds to my legitimacy, but I don't know if I want to help people get into consulting specifically. My pathway in was not traditional as well.",
              "score": 1,
              "created_utc": "2026-02-14 16:08:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5cwq0s",
                  "author": "Suspicious_Skin_1523",
                  "text": "No, I meant start your own consultancy rather than pushing people into it",
                  "score": 1,
                  "created_utc": "2026-02-14 16:08:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o59ndak",
          "author": "OMAnxiety",
          "text": "Which one do you think you would be able to do consistently that wouldn’t feel like as much of a ‘job’ after a while? esp if you don’t see a return quickly or monetarily?",
          "score": 1,
          "created_utc": "2026-02-14 01:24:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cwpo7",
              "author": "energy_trapper",
              "text": "Maybe the career thing. It's second nature. I could edit the f\\*ck out of a resume or a LinkedIn. ",
              "score": 1,
              "created_utc": "2026-02-14 16:08:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5a6z53",
          "author": "tsukihi3",
          "text": "> YouTube channel on travel to strange places like Eastern Europe, former Soviet Union, etc. (like Bald and Bankrupt style)\n\nIf that's what rocks your boat, I think you should go for it, but if you want to turn it into a \"hustle\", you'll have to commit a huge amount of time filming, editing and promoting before it's worth any penny... plus, there's the issue of consistency too, how often can you dish those videos out? \n\nWhen building your channel at first, you'll have to publish regularly in order to build the audience and that's got to be a serious commitment.\n\nIf you can do all of that, go for it, have fun and enjoy. Life's too short for affiliate marketing, food is overcrowded (could be part of your travel stuff), and as you said, you don't want your boss to see you push career content on LinkedIn so that's not exactly an option. \n\nI give career advice too, although my resume doesn't look as good as yours. It's not easy to monetise it, imho.\n\nHave a discussion with your boss if it's OK to build something on the side for fun if you get along with him. From my experience, some bosses enjoy entrepreneurship and will push you to try something new as long as it doesn't impact your own work.",
          "score": 1,
          "created_utc": "2026-02-14 03:31:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5b10pv",
          "author": "Zain_320",
          "text": "Food is i think would be the choice and i have a proposal i and my 3 friends (2dev,1 business) are building a voice agent for businesses to automate inbound leads. Sales are the part we are struggling with if you are down with it will you be open to working with us ??",
          "score": 1,
          "created_utc": "2026-02-14 07:35:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cx13p",
              "author": "energy_trapper",
              "text": "I'd love to. Message me.",
              "score": 1,
              "created_utc": "2026-02-14 16:10:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5bfa0z",
          "author": "That-Travel-5697",
          "text": "I would do affiliate marketing, there are so many opportunities and it can be lucrative if you promote correctly",
          "score": 1,
          "created_utc": "2026-02-14 09:54:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bgt1c",
          "author": "ChestChance6126",
          "text": "If I had 4 hours a week and wanted something live in 30 days, I’d double down on the thing already pulling demand toward me.\n\nPeople are literally asking you for career help. That’s a signal, not a theory. You don’t have to turn it into “thought leader on LinkedIn.” You could keep it low profile and productize it quietly, structured resume audits, mock interviews, maybe a small paid workshop off platform. No public posting required.\n\nTravel and food are both long games. They reward consistency and volume. Four hours a week is tough unless you genuinely love the process enough to do it for years with minimal return early on.\n\nAffiliate is viable, but only if you enjoy the media side, writing, SEO, or video. Otherwise, it becomes another research rabbit hole with no distribution engine.\n\nIf it were me, I’d run a 30 day validation sprint on career services. Cap it at 10 paid sessions. Track time spent, energy, and conversion rate. Worst case, you make some side cash and learn you hate it. Best case, you have proven demand without guessing.\n\nFun projects are great. Proven demand is better when time is tight.",
          "score": 1,
          "created_utc": "2026-02-14 10:09:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cx9b8",
              "author": "energy_trapper",
              "text": "How do I start the career services gig?",
              "score": 1,
              "created_utc": "2026-02-14 16:11:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5cbbc8",
          "author": "pranay_227",
          "text": "career services is boring, but it already has proof of demand. people are asking you for help without you marketing it. that’s signal. you could keep it off linkedin and build it through referrals, a simple landing page, or even anonymous reddit/twitter positioning if you really want separation from your day job.\n\ntravel youtube is interesting but it’s a long compounding game. unless you can commit to consistent uploads for 6–12 months, it’ll feel slow and frustrating.\n\n\n\n",
          "score": 1,
          "created_utc": "2026-02-14 14:12:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5d4kn4",
          "author": "fletchergray_1",
          "text": "Travel to former soviet/eastern europe is the most unique lane here. nobody else in your circle has that specific combo of knowledge + film photography + old euro cars.\n\nbald style works because it's raw, you could do a slightly more premium version with better production.. cross-post clips to your car ig for instant audience..\n\n4 hours a week is enough to batch edit one long-form yt video every 10-14 days plus shorts.. monetization kicks in slower but affiliates for camera gear or travel booking links fit naturally",
          "score": 1,
          "created_utc": "2026-02-14 16:48:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5e9g78",
          "author": "Dr_Gong",
          "text": "3rd. More stability and, less work in the future. Or at least your income will not depend on your time. You don’t have to be spammy. You can do it in a natural way sharing your experience and letting your affiliate links.",
          "score": 1,
          "created_utc": "2026-02-14 20:16:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5g1wnu",
          "author": "Lake-Gal-87",
          "text": "I joined MWR Life a couple weeks ago. It is a travel membership with wholesale pricing of 30-80% off of hotel, resorts, cruises, car rental, activities and excursions, and ground transportation. Some airfare is also discounted, but airlines change prices often. \n\nOur discounted prices beat other travel site’s prices. Comparing is pretty exciting. \n\nMWR has been around globally for over 12 years, and is officially launching in the US later this month. \n\nI am not a travel agent and do not manage itineraries. \n\nI sell the memberships, and there are several ways to earn passive and residual income (commissions and bonuses).\n\nI have a team surrounding me with support and resources, which I find so helpful.",
          "score": 1,
          "created_utc": "2026-02-15 02:44:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}