{
  "metadata": {
    "last_updated": "2026-02-02 09:09:57",
    "time_filter": "week",
    "subreddit": "digital_marketing",
    "total_items": 20,
    "total_comments": 170,
    "file_size_bytes": 158501
  },
  "items": [
    {
      "id": "1qnle1z",
      "title": "I analyzed 2,500+ subject lines across 12 industries. Here's what actually gets clicks in 2026",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qnle1z/i_analyzed_2500_subject_lines_across_12/",
      "author": "PuzzleheadedTalk5159",
      "created_utc": "2026-01-26 16:48:32",
      "score": 44,
      "num_comments": 18,
      "upvote_ratio": 0.92,
      "text": "I'm pretty obsessed with email marketing recently, so I decided to spend the last month digging through email data from newsletter tools, ESPs, and my own experiments, and analyzed what gets people to actually open their emails.\n\nSome of this will piss off the \"best practices\" crowd. But the data doesn't lie.\n\nHere's what I found, ranked by worst to best:\n\n(I put a lot of effort into this post, so hope you find it valuable)\n\n**10. \"Newsletter\" in the subject line** \\- Instant death. People are drowning in newsletters. Calling yours a newsletter is like wearing a sign that says \"delete me.\" The worst? \"Monthly Newsletter - \\[Month\\].\" Please, just stop.\n\n**9. All caps + excessive punctuation** \\- \"LAST CHANCE!!!\" Screams desperation. Your audience isn't deaf, they're just ignoring you. Also spam filters absolutely hate this.\n\n**8. Generic promotional language** \\- \"Special offer inside\" or \"Exclusive deal for you.\" Everyone says it's exclusive. Nobody believes you anymore. These worked in 2019. It's 2026. Move on.\n\n**7. Overly clever/cryptic lines** \\- \"You won't believe what happened...\" Clickbait works on Facebook. Email audiences are smarter and more annoyed. They want value, not mystery.\n\n**6. Emoji-heavy subject lines** \\- Controversial take: emojis work, but MAX one per subject line. More than that and you look like a 14-year-old's text message. One well-placed emoji? Chef's kiss. Three fire emojis? Trash.\n\n**5. Question-based subject lines** \\- \"Are you making this mistake?\" Better than clickbait but still pretty meh. Works better in B2B than B2C. Needs to be hyper-specific to actually work.\n\n**4. Personalization (first name)** \\- \"Hey \\[Name\\], check this out.\" Works, but it's baseline now. Everyone does it. You're not special for using merge tags. Better than nothing though.\n\n**3. Time-sensitive + specific** \\- \"48 hours left: \\[specific thing\\].\" Creates urgency without being scammy. Key word: SPECIFIC. \"48 hours left\" alone doesn't work. Tell them what they're actually missing.\n\n**2. Ultra-specific value proposition** \\- \"How \\[Company\\] grew to $10M with email\". Pure value. Tell them exactly what's inside and why they should care. Funny thing - long subject lines (10-15 words) actually performed better here. All that \"keep it short\" advice? Not always true.\n\n**1. Plain, conversational, from a person** \\- \"Question for \\[name\\]\" or \"great business advice\" Why? It doesn't look like marketing. It looks like an email from a human. The best performing emails in my analysis looked like they came from a coworker, not a brand. Wild, right?\n\n**The stuff that actually matters:**\n\n* Shorter is NOT always better - 6-10 word subject lines performed best overall, but context matters way more than length\n* Mobile preview text is criminally underused - 70% of emails are opened on mobile. USE THAT SPACE.\n* Industry matters more than you think - What works in SaaS dies in e-commerce. Test your own audience.\n\nThe biggest lesson? Stop trying to \"hack\" opens. Write subject lines like you're emailing a friend. \n\nWhat's working for you? Genuinely curious what I'm missing here.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qnle1z/i_analyzed_2500_subject_lines_across_12/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1uigbt",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 16:48:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wcia9",
          "author": "debarn",
          "text": "Thanks for sharing this very insightful! \n\n\nI also became somewhat obsessed with email marketing recently, especially that I do B2B biz dev, so gotta try a tons of different things, and I must say that the simpler ones increased my open rate, and some event reply rate.\n\n\nStill WIP but this post may help me refine it even further.\n\n\nSo - cheers, great work! :)",
          "score": 3,
          "created_utc": "2026-01-26 21:34:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1wlmld",
              "author": "PuzzleheadedTalk5159",
              "text": "I appreciate the feedback!",
              "score": 1,
              "created_utc": "2026-01-26 22:15:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1yh0jf",
          "author": "anajli01",
          "text": "This lines up hard with what we’re seeing.\n\nThe “from a person” insight is the big one once a subject line looks like marketing, the open is already dead. The best performers we’ve tested could literally pass as internal emails.\n\nAlso +1 on longer, ultra-specific lines. Clarity > cleverness every time.\n\nThe most underrated lever IMO: preview text. When subject + preview read like a single human sentence, opens jump.\n\nCurious if you noticed differences by audience maturity cold vs warm lists behave *very* differently here.",
          "score": 3,
          "created_utc": "2026-01-27 04:13:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1yqfp9",
              "author": "PuzzleheadedTalk5159",
              "text": "Oh yeah 100%, it's key to adabt based on your audience.\n\nIt's really all about testing a lot at this point. What's working with one audience might not work with the other, so it's crucial to test a lot and adapt.\n\nWhat do you think? Curious to hear your opinion",
              "score": 1,
              "created_utc": "2026-01-27 05:15:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o25votf",
          "author": "KONPARE",
          "text": "This tracks with what I’ve seen too, especially the “looks like a human wrote it” part. The plain, boring subjects that feel almost accidental consistently beat anything polished or clever for me. The preview text point is huge as well, most teams still treat it like an afterthought when it’s basically a second subject line on mobile.\n\nOne thing I’d add: sender name matters more than people admit. A real person vs a brand name can swing opens a lot. Solid breakdown overall.",
          "score": 2,
          "created_utc": "2026-01-28 05:20:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26c4h4",
              "author": "PuzzleheadedTalk5159",
              "text": "100%, sender name is a key part here",
              "score": 1,
              "created_utc": "2026-01-28 07:28:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o26ihdo",
          "author": "Mrqzz",
          "text": "Interesting analysis",
          "score": 2,
          "created_utc": "2026-01-28 08:24:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27t6tm",
              "author": "PuzzleheadedTalk5159",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-01-28 14:11:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2v5z8f",
          "author": "DeeloGoodquest",
          "text": "I took this advice and used \"Sorry we missed you. IRE2026\" For a recap email from a trade show we attended... which was really just a video testimonial compilation for our products *packaged* as a recap video. lol. **🤌😘😘** \n\nMy open rate was triple my average for unengaged and 50% higher for engaged contacts. CTR was also higher. No attributed revenue yet, but it's the slowest of our slow season right now.\n\nThanks so much for your effort into this post. The trade show was kind of a bust as far as attendance, so getting these testimonials I captured at the show out to our customer base was important to me.\n\nCheers!",
          "score": 2,
          "created_utc": "2026-01-31 22:03:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2v6d59",
              "author": "PuzzleheadedTalk5159",
              "text": "So glad to see this, congrats!!!!",
              "score": 1,
              "created_utc": "2026-01-31 22:05:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1wm2ii",
          "author": "abcdsjcbdisicbd",
          "text": "Great work! I feel like the short and human once are always the best performing (just from my experience). Really dependes on the niche ofc",
          "score": 1,
          "created_utc": "2026-01-26 22:17:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1wmnrg",
              "author": "PuzzleheadedTalk5159",
              "text": "Thanks! Yeah I agree 100%",
              "score": 1,
              "created_utc": "2026-01-26 22:20:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1ys4n7",
                  "author": "abcdsjcbdisicbd",
                  "text": "Glad to hear that!",
                  "score": 1,
                  "created_utc": "2026-01-27 05:27:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o24zd2y",
          "author": "elzubeir",
          "text": "This list makes no sense. I call bs.",
          "score": 1,
          "created_utc": "2026-01-28 02:12:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp7qg5",
      "title": "What is a marketing hack that is too good to be true?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qp7qg5/what_is_a_marketing_hack_that_is_too_good_to_be/",
      "author": "StandardNecessary218",
      "created_utc": "2026-01-28 10:26:13",
      "score": 40,
      "num_comments": 20,
      "upvote_ratio": 0.97,
      "text": "I feel like most content online is super generic and in a way that makes sense because if something really works- you probably dont wanna tell this to everyone.\n\nBut every once in a while I come across I come across some tip or hack in marketing that is often too good to be true. So curious, what is a marketing hack that is too good to be true that you have come across?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qp7qg5/what_is_a_marketing_hack_that_is_too_good_to_be/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o26vo4p",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 10:26:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2827ix",
          "author": "No-Marionberry8257",
          "text": "Especially in the age of AI overview and people asking ChatGPT etc, we have found that its often as simple as doing a quick research on what questions your customers are already searching or asking these tools and just answering them on your website as blogs- ideally these are questions where your tool or business is the answer and you wanna frame it that way! Most of these are automatable using modern tools like Frizerlly that connect with your google search data as well!",
          "score": 11,
          "created_utc": "2026-01-28 14:55:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o271z7t",
          "author": "KnowledgeExciting627",
          "text": "From what I’ve seen as an intern, a lot of “marketing hacks” that sound too good to be true usually **work only in very specific contexts**, not universally.\n\nOne example is *“just go viral on social media”* or *“post consistently and the algorithm will reward you.”* In practice, consistency alone doesn’t do much if distribution, timing, audience fit, and message aren’t right. People who share these hacks often leave out the context, existing audience, budget, or prior traction.\n\nAnother one I’ve seen is *“build in public and customers will come.”* It can help with trust, but without a clear ICP and problem, it often just builds an audience of other marketers, not buyers.\n\nAs an intern, the biggest realization for me has been that real marketing isn’t about hacks, it’s about **doing unglamorous fundamentals well** (clear positioning, good copy, decent distribution) for a long time. The “hack” is usually just consistency + patience, which isn’t very sellable online.",
          "score": 2,
          "created_utc": "2026-01-28 11:19:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28qzxn",
          "author": "Puzzleheaded-Walk426",
          "text": "Stay genuine. That's the most effective marketing hack. Whether it's an ad copy, a Facebook post, or an article, stay genuine, and the audience will recognize it.",
          "score": 2,
          "created_utc": "2026-01-28 16:45:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29pfs6",
              "author": "PatchneckRed",
              "text": "Yeah, I was going to say something pretty similar to this. Like, actually sitting down to write something, to create something, and to really think about it can go such a long way.",
              "score": 1,
              "created_utc": "2026-01-28 19:14:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o287qbj",
          "author": "Prestigious-Whole544",
          "text": "Manage your budget and play the long game",
          "score": 1,
          "created_utc": "2026-01-28 15:21:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a5cv1",
          "author": "Odd-Macaroon-9528",
          "text": "Just make sure all the basics are covered properly = 80% of results",
          "score": 1,
          "created_utc": "2026-01-28 20:25:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a9s39",
          "author": "Stew_with_a_u",
          "text": "No one is sharing the real answers because we don’t want them getting out. Sorry but hacks are your IP. They matter too much to give away because once everyone does them, they stop working.",
          "score": 1,
          "created_utc": "2026-01-28 20:45:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ajfb5",
          "author": "Low-Tackle7606",
          "text": "Totally, any hack that promises instant virality or leads is usually too good to be true. Real results come from consistency, knowing your audience, and adding value. One legit “hack” that works: personalized, well-researched outreach instead of generic blasts.",
          "score": 1,
          "created_utc": "2026-01-28 21:27:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2as8sd",
          "author": "jello_house",
          "text": "reddbot sounds like one of those hacks too good to be true an ai agent that autonomously scans reddit posts and drops natural promo comments 24/7 to snag leads. straight up scales your reddit outreach without the manual grind but honestly itll flop hard if your product sucks. game changer if youre lazy smart tho",
          "score": 1,
          "created_utc": "2026-01-28 22:05:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bpdpu",
          "author": "tejones01",
          "text": "Building what I call your Brand DNA, getting your company narrative clear, and finding where your story meets your target audience. Not really a hack though.",
          "score": 1,
          "created_utc": "2026-01-29 00:52:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bqgog",
          "author": "ShallotQuirky1189",
          "text": "I use Nettmark lol, gives you pretty much everything you need. It’s more affiliate based tho but you can run ads for brands on Nettmark.",
          "score": 1,
          "created_utc": "2026-01-29 00:58:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2d3ese",
          "author": "supriya_l89",
          "text": "Most “too good to be true” marketing hacks claim they deliver quick results which require no work and which can be achieved at large scale through their single solution that doubles user engagement. The marketing process exists as a permanent establishment which requires real effort to achieve its goals. The process of achieving sustainable victories requires organizations to implement basic business practices which they must maintain through their ongoing operations. A hack becomes hype when it fails to include required background information and necessary work and all the current trade-offs.",
          "score": 1,
          "created_utc": "2026-01-29 05:52:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2de2xs",
          "author": "imnotafanofit",
          "text": "To just build in public and clients will come lol. They won’t unless you already know how to sell and position yourself.",
          "score": 1,
          "created_utc": "2026-01-29 07:20:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dj3ud",
          "author": "parkerauk",
          "text": "If you are an expert, prove it. Add 'knowsAbout' Schema to your profile and for all your iterations of the same content across the Internet use subjectOf to join it all together, adds authority. See it as endorsing backlinks.",
          "score": 1,
          "created_utc": "2026-01-29 08:04:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27iher",
          "author": "Careless-Parsnip-248",
          "text": "Honestly anything that promises fast, repeatable growth with zero tradeoffs. Stuff like “one funnel that works for every business” or “AI content that ranks on autopilot” sounds great but never holds up in real life. Every time we chased a “hack,” it worked briefly or not at all. The boring fundamentals always ended up doing more.",
          "score": 0,
          "created_utc": "2026-01-28 13:13:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qsrb0w",
      "title": "reddit marketing agency - any saas focused ones?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qsrb0w/reddit_marketing_agency_any_saas_focused_ones/",
      "author": "0ctaviusRex",
      "created_utc": "2026-02-01 06:53:21",
      "score": 19,
      "num_comments": 68,
      "upvote_ratio": 0.87,
      "text": "I need to vent a little here but also ask for some help because I'm at my wit's end with marketing.\n\nI'm a solo dev running a SaaS that helps local service businesses (think cleaning businesses, plumbers, etc) streamline their hiring process. Before using my product, these businesses have 0 processes in place and after they are able to hire in about half the time.\n\nI have been able to grow to 1.3k MRR by providing helpful posts and comments in local service specific subreddits but have hit a wall with my account being shadow banned and comments removed (even when they were genuinely helpful). Reddit has my customers but I can't seem to reach them effectively.  \n\n\nI am looking for a reddit marketing agency that understands reddit much more than I do and helps SaaS businesses specifically. Unsure of how these services are priced so any clarity there would be great as well.",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qsrb0w/reddit_marketing_agency_any_saas_focused_ones/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2xj5lc",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 06:53:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xofv3",
          "author": "pmagi69",
          "text": "I would like to know what you did to be shadowbanned. Did you copy-paste the same post or comment a lot of times?",
          "score": 2,
          "created_utc": "2026-02-01 07:40:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2y471y",
              "author": "rahulroy",
              "text": "Would like to understand this as well. Reddit has always been sensitive about marketing and spam, and lately it feels like a lot of subs are pushing back harder.\n\nRecently, I was heavily downvoted just for participating in the discussion. My comment wasn’t promotional at all. I only mentioned that I’m a builder in the relevant space to add context and share a builder’s perspective.\n\nHonestly, it was one of the most unwelcoming experiences I’ve had on Reddit, which was surprising given that the thread was meant to be a discussion.\n\nI think, reddit is onto builders and they might want to push people towards paid ads.",
              "score": 3,
              "created_utc": "2026-02-01 10:06:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2yf54h",
                  "author": "pmagi69",
                  "text": "Yeah, well, it's not really Reddit. It's mostly the users that are sensitive. And of course you can get banned, but that is usually from a subreddit. And then you can also be banned from the whole of Reddit. I don't really know how that works. That's probably heavy abuse. So yeah, I would love to have a link to see where you get all the downvotes. It's interesting to see that.",
                  "score": 1,
                  "created_utc": "2026-02-01 11:44:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2xrksi",
          "author": "Murky_Maximum1472",
          "text": "I had a similar issue when trying Reddit ads. For us, Google Ads worked better initially, then we tested Reddit once we understood the audience…",
          "score": 2,
          "created_utc": "2026-02-01 08:09:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31bp4x",
          "author": "Impossible-Double-53",
          "text": "Totally get this — Reddit is a weird beast for advertising. What’s worked better for me (also SaaS) is treating Reddit less like an ad channel and more like a research + credibility channel. We focused on genuinely answering questions in niche subs, then paired that with Google Ads for high-intent traffic.\n\nIf you *do* want paid, Reddit Ads can work but only with very tight targeting and non-salesy creative. Facebook/LinkedIn were more predictable for us. I haven’t found many Reddit-marketing agencies that are truly SaaS-focused tbh — most seem better at ecom. Curious if anyone’s actually had a good experience with one.",
          "score": 2,
          "created_utc": "2026-02-01 20:47:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xn37o",
          "author": "No-Boat-5517",
          "text": "Would love to discuss more on this !\nHappy to help and collaborate",
          "score": 1,
          "created_utc": "2026-02-01 07:28:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xog68",
          "author": "Leather_Heart_3847",
          "text": "Totally relatable. Reddit ads are confusing and users hate obvious promotion. I’ve had better luck either posting organically in relevant subs or just skipping Reddit and using Google Ads or Facebook/IG where targeting and intent are clearer.",
          "score": 1,
          "created_utc": "2026-02-01 07:40:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xrvji",
          "author": "StatisticianOdd8871",
          "text": "I feel your frustration. From my experience you should focus on targeting the right keywords on your posts. This should help drive clicks on the posts and subsequently allow you reach potential clients in the target market.",
          "score": 1,
          "created_utc": "2026-02-01 08:12:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xx1m0",
          "author": "Jaxyndamere",
          "text": "We could explore google ads, cold calling as well. Check your DM",
          "score": 1,
          "created_utc": "2026-02-01 09:00:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xy0su",
          "author": "Appropriate-Age-5790",
          "text": "The good ones focus on trust-building, organic discussions, and long-term presence ",
          "score": 1,
          "created_utc": "2026-02-01 09:09:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2y6n2i",
          "author": "iGrowJazzCigarettes",
          "text": "Maybe use paid ads instead of spamming subreddits",
          "score": 1,
          "created_utc": "2026-02-01 10:28:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2y9lig",
          "author": "lnjsl5465",
          "text": "Reddit can be strict, even when you're genuinely trying to help. There are agencies and marketers who specialize in Reddit marketing and understand the platform's nature and how to grow SaaS products without getting banned. They often offer services like strategy development, posting, engagement, and ensuring compliance with Reddit's rules.",
          "score": 1,
          "created_utc": "2026-02-01 10:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ycavy",
          "author": "Relative-Fortune-417",
          "text": "I was in a similar spot with a SaaS product and honestly Reddit ads weren’t the magic bullet for us.\n\nWhat worked better was first figuring out where the ICP already hangs out. A lot of niche SaaS audiences respond more to Google Search (high intent) and LinkedIn or Twitter for awareness. Reddit is great for learning the language users use, but converting directly can be tricky unless the offer is very specific.\n\nIf you do stick with Reddit, I’d avoid broad ads. Instead, test a few smaller subreddits, run value-first posts (guides, breakdowns, case studies), and only then experiment with ads once you know what resonates.\n\nAlso worth testing a mix rather than betting everything on one channel. Google Ads for demand capture + Reddit or content for demand creation worked better for us.",
          "score": 1,
          "created_utc": "2026-02-01 11:19:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yg9w5",
          "author": "HauntingAd8264",
          "text": "Shadowbans usually happen because you’re triggering spam filters by being the sole source of your own promotion. Even if you're helpful, mods see it as a conflict of interest.\n\nI run a small organic Reddit marketing agency, and the \"wall\" you hit is common for founders. The secret isn't posting more; it’s about being truly helpful and giving genuine solutions before mentioning your product. \n.",
          "score": 1,
          "created_utc": "2026-02-01 11:54:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zubhr",
          "author": "Mushy-Mushroom12",
          "text": "I’m in the same boat tbh. Reddit feels powerful but also really hard to crack as a business owner because most subs are super anti-promotion. What helped me a bit was shifting focus to platforms that are more ad-friendly — Google Ads for high-intent searches and Facebook/Instagram ads for testing creatives and audiences. Reddit Ads can work too, but only if you treat it like community targeting rather than direct selling. Sometimes it’s less about forcing Reddit to work and more about using it alongside other channels.",
          "score": 1,
          "created_utc": "2026-02-01 16:40:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o319k1j",
          "author": "Quiet_Blackberry7493",
          "text": "Okay understand that Saas audience is one of the biggest and oldest on reddit which also makes them vulnerable to spam and bot comments, so it's understanable why these communities are highly skeptical and smell promo stuff from miles away, I run organic campaigns for a lot of different industries here, and out of all the industries that I work with, SaaS was def a league of its own in terms of complexity and getting the tone right but you see once I understood the language they speak, and studied a lot of examples on how saas brands operate here, I figured it out. \n\nSo if you want to do that, go through company run subreddits and see how founders speak to their audience, for example one of fave subreddit is r//framework they have done a great job at building a community here, spend time understanding one subreddit at a time and get familiar with no intent of promotion till you are an established member of the sub, only then will it be easy to not be downvoted, also dont comment rapidly that's one of the reasons u get labeled as a bot and potentially shadowbanned. \n\nIf you are aiming for reddit organic then be prepared to spend a few months building visibility, it's long but it has compunding returns, u just gotta be patient. And if you are getting DMs from reddit agencies please evaluate them carefully cuz anyone promising quick results will get your domain or brand name banned from the whole platform, understand their approach well before deciding, most of my clients get burned when they get promised leads and visibility in a month and have their whole domain banned on here cuz of the agency's spam acitivtity.",
          "score": 1,
          "created_utc": "2026-02-01 20:36:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qom1lf",
      "title": "Need advice on best practices for syncing email marketing data with crm",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qom1lf/need_advice_on_best_practices_for_syncing_email/",
      "author": "Just-Maximum-5679",
      "created_utc": "2026-01-27 18:26:07",
      "score": 16,
      "num_comments": 19,
      "upvote_ratio": 0.95,
      "text": "Running into some friction trying to get our email campaigns to play nice with our crm system. Currently manually updating lead scores and campaign responses which is eating up way too much time.\n\nIs there a smooth workflows for automatically pushing email engagement data back into crm.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qom1lf/need_advice_on_best_practices_for_syncing_email/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o22915i",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 18:26:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22dem0",
          "author": "Nastya_Tan",
          "text": "Def you need to tighten up automations and scoring rules. For us, the trick was making email engagement update fields that sales look at, not just activity logs. Some crms handle this cleaner than others, we’re on monday crm and use native automations plus a lightweight email integration to push clicks/replies into lead scores automatically. It’s not magic, but once set up, it killed the manual updates. Also, align marketing and sales definitions first, then automate. Otherwise you’re just syncing chaos faster.",
          "score": 2,
          "created_utc": "2026-01-27 18:44:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22i50j",
              "author": "Just-Maximum-5679",
              "text": "That looks like a good process. We have done the alignment part, just need to follow through.",
              "score": 1,
              "created_utc": "2026-01-27 19:04:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22b2ne",
          "author": "TurnoverEmergency352",
          "text": "First, define what engagement actually matters first. Opens/clicks mean nothing if sales doesn’t trust the score anyway.",
          "score": 1,
          "created_utc": "2026-01-27 18:34:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22hokc",
              "author": "Just-Maximum-5679",
              "text": "I can say we're past that stage",
              "score": 1,
              "created_utc": "2026-01-27 19:02:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22cmqd",
          "author": "Physical-Radio-8769",
          "text": "This is usually less about email tools and more about workflow design. You want triggers that update lead status automatically, not just dump raw metrics. We mapped engagement to action (MQL, task, follow-up) and friction dropped a lot. If reps still have to “interpret” data manually, the sync isn’t doing its job.",
          "score": 1,
          "created_utc": "2026-01-27 18:41:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22hvvj",
              "author": "Just-Maximum-5679",
              "text": "thank you for pointing out the aspect of process over tools. Spot on.",
              "score": 1,
              "created_utc": "2026-01-27 19:03:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22es69",
          "author": "crazyreaper12",
          "text": "Rule of thumb: stop syncing everything. Only push meaningful events (clicks, replies, conversions) into the crm. Otherwise you end up with noisy data no one uses and dashboards everyone ignores.",
          "score": 1,
          "created_utc": "2026-01-27 18:50:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22iagz",
              "author": "Just-Maximum-5679",
              "text": "I know the chaos of tracking and syncing everything trackable",
              "score": 1,
              "created_utc": "2026-01-27 19:05:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22jjni",
          "author": "Numerous-Movie3107",
          "text": "Honestly sounds like an integration problem, not a best practices one. Manual updates means something’s broken.",
          "score": 1,
          "created_utc": "2026-01-27 19:10:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22vumw",
          "author": "No_Hedgehog8091",
          "text": "Set up webhook triggers for opens, clicks, and replies to push real-time data into your CRM via API.\n\nMap engagement events to lead score increments (open +5, click +10, reply +20).\n\nUse engagement thresholds to auto-tag leads as hot, warm, or cold.\n\nThis cut our manual work by 80% and improved response time to hot leads.",
          "score": 1,
          "created_utc": "2026-01-27 20:05:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22xf9d",
          "author": "boundlessmedia",
          "text": "Been there. Manual updates are a time suck.\n\nWhat’s worked for me: make the CRM the source of truth for lead score, then have your email tool push events to it. Use the native integration if it exists. If not, use Zapier or Make with webhooks to send opens, clicks, unsubscribes, and bounces as activities, and increment a single Engagement Score field. Add UTM tags and a campaign ID to every link so the CRM can tie activity to the right campaign. Match on email plus a contact ID if you have one to avoid dupes. Do a one-time backfill, then switch to real time. We’ve done this for landscapers and turf shops and it’s smooth once naming and fields are set. Seen the same at Boundless Media, but you can totally DIY this.",
          "score": 1,
          "created_utc": "2026-01-27 20:12:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25vi3r",
          "author": "DigitalHarbor_Ease",
          "text": "Manually updating lead scores and campaign responses is such a time sink.\n\nBest bet: use your email tool’s **native CRM integration**, or hook them up via **Zapier/Integromat** so opens, clicks, and replies flow automatically. APIs work too if you want more control.\n\nStart small, keep data clean, then expand. Makes life way easie",
          "score": 1,
          "created_utc": "2026-01-28 05:19:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28dx9s",
          "author": "QuimbyDigital",
          "text": "Most email tools have native CRM integrations now. Mailchimp + HubSpot, Active Campaign syncs automatically. Set up Zapier if yours don't connect directly takes like 20 min to build. Way better than manual updates honestly.",
          "score": 1,
          "created_utc": "2026-01-28 15:49:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dobdl",
          "author": "ContextFirm981",
          "text": "I’d set up native integrations or a tool like Zapier/Make so your email platform automatically pushes opens, clicks, and tag/segment changes into your CRM, then use those fields to drive lead scoring rules instead of doing manual updates.",
          "score": 1,
          "created_utc": "2026-01-29 08:53:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq8dib",
      "title": "Posting daily destroyed my confidence and fixing one thing brought it back",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qq8dib/posting_daily_destroyed_my_confidence_and_fixing/",
      "author": "Due_Employment_829",
      "created_utc": "2026-01-29 13:21:08",
      "score": 16,
      "num_comments": 12,
      "upvote_ratio": 0.94,
      "text": "Used to love making videos. Now I dread posting because I know it's probably going to fail. Posted daily for 6 months. Most videos died under 500 views. Few random ones hit 2k to 3k. No pattern I could see.\n\nStarted second guessing everything. Is my personality boring? Is my voice annoying? Am I just not entertaining enough? Stopped enjoying the process. Just felt anxious and defeated.\n\nHit my breaking point 2 weeks ago. Either figure out what's wrong or quit. Looked at my retention graphs for real this time. Not just glanced. Actually studied them.\n\nEvery video that died lost people at second 7 to 9. Every video that worked held people past second 10. Watched what I was doing between second 7 and 9 in my failed videos.\n\nPausing. Visual not changing. Still explaining instead of showing. Watched what I was doing in my successful videos. Moving fast. Visual changing. Delivering value immediately.\n\nFixed my failed videos' problems. Made everything like my successful ones. Next 5 videos all hit over 15k views. My confidence came back immediately.\n\nHere's what fixed it for me.\n\n**Lack of confidence comes from not knowing why you're failing.** When you don't know what's wrong you start thinking everything's wrong. You're not. Something specific is wrong and you just can't see it.\n\n**Success builds confidence faster than anything.** One video that works because you actually knew how to fix it matters more than ten motivational posts. Fix what's broken. Post something that works. Confidence returns.\n\n**You need to see your blind spots.** I couldn't see my pauses were too long. I couldn't see my visuals were too static. They felt normal to me. I needed external feedback that was specific not just \"make better content.\"\n\n**Get something that shows you the actual problem.** Started using TikAlyzser that tells you exactly what's wrong with your videos and what to change to get more views. Second 8 pause 1.5 seconds visual static 6 seconds. Then I knew exactly what to fix. Not guessing. Knowing.\n\n**Post with confidence because you already fixed what would have killed it.** Now I post knowing it's going to work because I caught the problems before they went live. That confidence shows in my content. People can tell.\n\nLast 12 videos all over 10k views. Confidence is completely back. Enjoying creating again.\n\nIf posting fills you with dread instead of excitement something's broken and you don't know what it is. Fix that first. Confidence comes back fast after that.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qq8dib/posting_daily_destroyed_my_confidence_and_fixing/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2emgb0",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 13:21:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2io9oe",
          "author": "bodhisattvass",
          "text": "**The Poop That Took a Pee**\n\nBy: Leopold \"Butters\" Stotch\n\n**Chapter 1**\n\nDouglas had to poop. His butt was all stinky because he had to poop so badly. There was a gross woman named Rebecca who was sunbathing all naked, and she was fat. Douglas walked up to her and said, \"I need to poop.\" \"Okay,\" Rebecca replied, \"I like poop.\" Douglas squatted down over the fat sunbathing lady and went poop. The poop sat there on Rebecca's boobs looking like a wiener.\n\n**Chapter 2**\n\n\"Why are we here?\" Douglas cried as poop came out his wiener in a long, thin strip. It was wiener poop, which is the grossest poop of all. The pee-pee got on the woman's leg and she screamed, pooping out her boobs. And so when the pee got mixed with the poop it smelled like a butt. And the poop and the pee lived happily ever after. \n\n**THE END**",
          "score": 3,
          "created_utc": "2026-01-30 01:06:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hbvfg",
          "author": "AnUglyGuy89",
          "text": "I'm going to apply some of youre advice, sounds interesting",
          "score": 2,
          "created_utc": "2026-01-29 20:58:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2it1oc",
          "author": "Rich-Editor-8165",
          "text": "If you're feeling stuck with your content, figure out exactly what's going wrong instead of guessing. This person used a tool to identify pacing and visual issues, then made fixes. Once they did, their views shot up. The key is fixing what's broken, posting confidently, and letting success boost your confidence.",
          "score": 1,
          "created_utc": "2026-01-30 01:32:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2j00y1",
          "author": "Sad-Butterfly-4299",
          "text": "This really resonated with me. What you described is exactly how confidence erosion actually happens — not from “lack of discipline,” but from **lack of clarity**.\n\nWhen you don’t know *why* something fails, your brain fills in the gaps with self-blame. Personality, voice, intelligence, talent — everything becomes suspect. That’s brutal mentally, especially when you’re doing the “right” thing by showing up daily.\n\nWhat stood out most is the **specificity** of the fix. Second 7–9 drop-off, static visuals, pausing too long. That’s actionable. “Make better content” never helps anyone — knowing *what moment loses people* does.\n\nI also think your point about confidence being a **byproduct of competence** is underrated. Motivation doesn’t fix confidence. Seeing something work because you understood and corrected a real issue does.\n\nCurious question for you:  \nDo you think posting daily helped you gather enough data to spot the issue, or do you think daily posting actually masked the problem for too long?\n\nReally solid breakdown. Thanks for sharing this.",
          "score": 1,
          "created_utc": "2026-01-30 02:11:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2j8i57",
          "author": "Competitive-Bee-8604",
          "text": "I’ve been in a very similar spot to what you described.  For about two years, I tried to post consistently on Instagram—mostly infographics, across multiple different pages and I eventually completely burned out and walked away from it.\n\nReading your breakdown of how you used retention data and specific seconds in the video to pinpoint what was actually going wrong really resonated with me.  It’s so encouraging to see you fix the problem and rebuild your confidence!\n\nA part of me wishes I had the same level of clarity and confidence back then, but this post is a genuine inspiration and makes me want to come back to content with a more analytical, less self‑blaming mindset.",
          "score": 1,
          "created_utc": "2026-01-30 02:58:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l5ixq",
          "author": "ChestChance6126",
          "text": "This is a really good example of separating identity from mechanics. You weren’t “bad at content,” you had a very specific retention leak early on. When creators don’t know the cause, they personalize the failure, and their confidence tanks. Once you tied outcomes to a concrete behavior, pauses, and visuals in the first 10 seconds, it became a fixable system problem, not a self worth problem. That’s usually where confidence actually comes from, knowing what lever to pull.",
          "score": 1,
          "created_utc": "2026-01-30 11:49:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pqe5m",
          "author": "Imaginary-Fall1983",
          "text": "Great",
          "score": 1,
          "created_utc": "2026-01-31 01:32:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f97or",
          "author": "PutridWin2070",
          "text": "Looking at the data is so important! It tells you what you need to do to fix or improve things",
          "score": 0,
          "created_utc": "2026-01-29 15:17:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gorm6",
          "author": "Mrqzz",
          "text": "Interesting post",
          "score": 0,
          "created_utc": "2026-01-29 19:08:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq2b70",
      "title": "Why you are equally at fault as your marketing agency for failing ad campaigns",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qq2b70/why_you_are_equally_at_fault_as_your_marketing/",
      "author": "Middle_Lavishness137",
      "created_utc": "2026-01-29 07:44:08",
      "score": 14,
      "num_comments": 2,
      "upvote_ratio": 0.86,
      "text": "I have seen many people ask Meta Ad or Google Ads, but they don’t pay attention to the fact that their medium isn’t as big of as a deal as their marketing agency. I am not personally attacking anyone but many are simply burning their money by not intervening and questioning their marketing agency enough. I have many clients whose trust has been eroded by scammy marketing agency and I tell them, why did you let this happen? Their answer is always the same. They were oblivious. So, here are a few of my tips that everyone should use if they think their marketing agency is not doing their job.  \n  \n1. The \"Platform Trap\"Google and Meta are designed to make you spend. Their \"Auto-Apply\" recommendations are often biased toward their revenue, not your ROI. A great agency acts as a filter, knowing when to lean into the machine and when to take back the wheel\n\n.2. Creative is the New Targeting-As privacy laws and \"cookie-less\" tracking have leveled the playing field, your creative is what does the heavy lifting. If your agency isn't using data-backed storytelling, they’re just guessing.\n\n3. The Shift to \"Agentic\" Execution-The best agencies have stopped doing manual, repetitive \"button-clicking.\" They are now leveraging autonomous AI tools to handle the grunt work. By integrating stacks like Blobr AI or Ryze AI, agencies can run 24/7 audits and creative swaps that a human simply can’t keep up with.\n\nNext time, ask the important questions. It pains me to see us marketing agencies get a horrible reputation just because of a few sour apples.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qq2b70/why_you_are_equally_at_fault_as_your_marketing/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2dgqnu",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 07:44:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqyqyn",
      "title": "Anyone else trying to figure out GPT ads and how they will affect brand perception?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qqyqyn/anyone_else_trying_to_figure_out_gpt_ads_and_how/",
      "author": "feliceyy",
      "created_utc": "2026-01-30 07:20:27",
      "score": 12,
      "num_comments": 22,
      "upvote_ratio": 0.88,
      "text": "Still trying to understand this shift. When Google rolled out AI Overviews and started pushing sponsored results deeper into the flow, it completely changed how I expected people to find my brand. And also not in a way I felt ready for. \n\nNow that GPT ads will appear directly in conversations, I feel both curious and cautious. I want to stay ahead of competitors, but I’m unsure how intrusive these placements might feel to users. I’m trying to figure out whether leaning into these conversational ads could boost visibility or risk coming across as forced. How about you?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qqyqyn/anyone_else_trying_to_figure_out_gpt_ads_and_how/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2karaa",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 07:20:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l6em8",
          "author": "EnvironmentalFact945",
          "text": "It’s less about “ads” and more about how AI frames your brand in answers. That framing sticks. We’ve been auditing how we’re described across sources and testing tools that monitor AI mentions. Stuff like limy ai have been helping us shape how often and strategic our brand appears in AI searches. Also, we're in its GPT ads waiting list to test if such advertisement will make our business more selectable and visible. Early days, but brand narrative inside AI feels important.",
          "score": 2,
          "created_utc": "2026-01-30 11:56:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2lafe6",
              "author": "feliceyy",
              "text": "Sure, brand mentions in ai searches is key and businesses need to know where such traffic is coming from. I'm surprised there are tools have already implementing such ads in their system.",
              "score": 1,
              "created_utc": "2026-01-30 12:24:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kf0a0",
          "author": "Sea_Mirror1453",
          "text": "following",
          "score": 1,
          "created_utc": "2026-01-30 07:57:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2khsn1",
              "author": "feliceyy",
              "text": "stay tuned!",
              "score": 1,
              "created_utc": "2026-01-30 08:22:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ki7qg",
          "author": "bambidp",
          "text": "I feel like this is overhyped. Most people still don’t trust AI answers blindly.",
          "score": 1,
          "created_utc": "2026-01-30 08:26:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kjt3z",
              "author": "feliceyy",
              "text": "I know. Some people are still skeptical about AI recommendations.",
              "score": 1,
              "created_utc": "2026-01-30 08:40:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kno20",
          "author": "filename_tbd",
          "text": "I'm also interested. I could see it going both ways, either incredibly annoying and ignored or accepted as a convenient answer... which way are you leaning now?",
          "score": 1,
          "created_utc": "2026-01-30 09:16:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kqp3v",
              "author": "feliceyy",
              "text": "I'm thinking of giving it a benefit of doubt- becoming a convenient answer.",
              "score": 0,
              "created_utc": "2026-01-30 09:43:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ksys9",
          "author": "Snaddyxd",
          "text": "Low key I think this will matter more for unknown brands than big ones. If AI summaries define you before someone visits your site, perception gets shaped faster and you don’t fully control it.",
          "score": 1,
          "created_utc": "2026-01-30 10:04:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kzgaa",
              "author": "feliceyy",
              "text": "I love your school of thoughts, unknown brands might take advantage of these ads and position themselves better in the market.",
              "score": 1,
              "created_utc": "2026-01-30 11:01:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kt9ei",
          "author": "kubrador",
          "text": "gpt ads in a chatbot conversation are basically the marketing equivalent of someone interrupting you mid-sentence to sell you stuff. people tolerate search ads because they're already shopping. they're gonna tolerate chat ads about as well as they tolerate spam calls.",
          "score": 1,
          "created_utc": "2026-01-30 10:07:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2labl7",
          "author": "OrganicClicks",
          "text": "Brand perception will probably come down to relevance. If the ad actually fits the question and feels like a natural suggestion, it could work really well. If it’s shoehorned in, it’ll backfire fast. My guess is early winners will be brands that treat it more like content and less like classic ads.",
          "score": 1,
          "created_utc": "2026-01-30 12:24:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2lfpu6",
              "author": "feliceyy",
              "text": "You have explained it so well- GPT ads will favor brands that align themselves with what customers are looking for.",
              "score": 1,
              "created_utc": "2026-01-30 12:58:47",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2lki3x",
              "author": "ThomasFromChannable",
              "text": "Completely agreed! Big questions is, where does the relevance come from? I reckon it's from a product feed filled with as much data as you can possible gather to feed the AI with.",
              "score": 1,
              "created_utc": "2026-01-30 13:26:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2lf9zb",
          "author": "Single-Use1800",
          "text": "Yeah, same here. It feels like we’re moving from search intent to conversation intent, which is a big mental shift. I’m cautiously optimistic, but only if these ads feel genuinely helpful and context-aware. If they’re too pushy, I think users will tune them out fast. Feels like brands that focus on value-first messaging will win, while hard sells might actually hurt perception.",
          "score": 1,
          "created_utc": "2026-01-30 12:56:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2m0836",
              "author": "feliceyy",
              "text": "This is for sure. the ads should be relevant and solve real customer's issues.",
              "score": 1,
              "created_utc": "2026-01-30 14:47:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2lk6gz",
          "author": "ThomasFromChannable",
          "text": "To be honest, I think it will all come down to your product feed... The more data you feed AI with which accurately represents your brand, the smaller the chance that GPT will mess it up for you. Take the time to invest in your feed management before starting GPT ads, you'll see the benefits long-term in control of your brand consistency",
          "score": 1,
          "created_utc": "2026-01-30 13:24:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2m0pjw",
              "author": "feliceyy",
              "text": "I agree. we should focus on feeding AI with the correct info about our brands first for long-term benefits.",
              "score": 1,
              "created_utc": "2026-01-30 14:49:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2m7grh",
          "author": "localkinegrind",
          "text": "We treat it like early social media days, that is, influence more than direct attribution. You won’t always see the path, but you’ll feel the impact in branded search and assisted conversions. Platforms like OpenAI don’t exactly hand over referral data, so we’re piecing things together using surveys, landing page questions, and trend correlations. Not precise, but ignoring it feels riskier than experimenting.",
          "score": 1,
          "created_utc": "2026-01-30 15:21:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qlg8r",
          "author": "Electronic-Cat185",
          "text": "i feel the same mix of curiosity and unease. conversational ads feel much closer to the user intent so the margiin for being annoying is smalller. if they add context or genuinely help they might work but anything that feels shoved in could hurt trust fast. it feels less like classic ads and more like product placement inside reasoniing which makes brand perception way more fragile.",
          "score": 1,
          "created_utc": "2026-01-31 04:46:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2t7kz9",
          "author": "BigDaddy9102",
          "text": "You're right to be thinking about this now because the shift is already happening and most brands have zero visibility into what AI tools are actually saying about them. Brandlight might be what you're looking for since it's built specifically to monitor and improve how your brand shows up in AI-generated answers, which seems to be exactly the blind spot you're trying to solve. Worth checking out if you want to get ahead of this instead of just reacting when competitors start showing up favorably in thos conversations.",
          "score": 1,
          "created_utc": "2026-01-31 16:23:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpm4m6",
      "title": "My emails landed in spam for over a year straight. Here's how I fixed that",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qpm4m6/my_emails_landed_in_spam_for_over_a_year_straight/",
      "author": "PuzzleheadedTalk5159",
      "created_utc": "2026-01-28 19:57:16",
      "score": 12,
      "num_comments": 13,
      "upvote_ratio": 0.94,
      "text": "I'm pretty obsessed with email marketing so watching my emails go straight to spam was absolutely soul crushing. Open rates under 5%. Complaints through the roof. Gmail basically blacklisted me.\n\nSpent hundreds of hours and way too much money figuring this out (most of the \"expert advice\" online is completely useless). But I think I finally cracked it.\n\nHere's what I found, ranked from least to most impactful:\n\n**10. Removing spam trigger words** \\- Everyone says \"avoid FREE and URGENT.\" Did almost nothing. Removed every \"trigger word\" and still landed in spam. This advice is from 2015 and spam filters are way smarter now. Don't waste your time obsessing over this.\n\n**9. Adding a physical address** \\- Required by law, yes. Did it help deliverability? Barely. Maybe a 1-2% improvement. Still important for compliance, but it won't save you from spam hell.\n\n**8. Using a professional email signature** \\- Added my logo, social links, the works. Looked more legit but didn't really move the needle on deliverability. Nice to have, not a game changer.\n\n**7. Reducing image-to-text ratio** \\- The old advice is \"too many images = spam.\" Cut my images way down and saw a small improvement. Maybe 5-8% better inbox placement. Helps, but it's not the main issue.\n\n**6. Consistent sending schedule** \\- This one surprised me. Sending randomly (whenever I felt like it) killed my sender reputation. Once I went to a consistent Tuesday/Thursday schedule, things improved noticeably. \n\n**5. List hygiene (removing inactive subscribers)** \\- Huge. I was scared to lose subscribers, but keeping dead emails on my list was tanking my engagement metrics. Removed anyone who hadn't opened in 6 months. Painful but necessary.\n\n**4. Double opt-in** \\- I resisted this forever because \"it reduces signups.\" Yeah, by about 30%. But the people who confirm? They're REAL. Engagement went up, complaints went down. ISPs started trusting my emails more. Worth the trade-off.\n\n**3. SPF, DKIM, and DMARC records** \\- This is where it gets technical. Set up proper email authentication. Sounds boring and complicated but it's absolutely critical. Gmail and Outlook basically require this now. \n\n**2. Warming up a new domain** \\- My old domain was burned. Started fresh with a new sending domain and warmed it up properly - started with 50 emails/day, slowly increased over 6 weeks. game changer. You can't just start blasting 10k emails from a new domain.\n\n**1. Actually getting engagement (replies, opens, clicks)** \\- This is the thing nobody wants to hear. All the technical fixes mean nothing if people don't engage with your emails. ISPs watch this like hawks. I had to completely rewrite my emails to be more conversational and actually valuable. Asked questions. Encouraged replies. Made it feel like a real conversation, not a broadcast. Once engagement went up, everything else fell into place.\n\n**The biggest lesson?**\n\nThere's no magic bullet. It's a combination of technical setup + list quality + actual good content people want to read. I wasted months looking for a hack. The \"hack\" is doing the boring work correctly and writing emails people actually care about.\n\nAlso, if you're in spam now, you probably need to start fresh. Your domain reputation might be too damaged to recover. Sucks, but it's reality.\n\nAnyone else been through spam hell? What worked for you? Genuinely curious if I missed anything.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qpm4m6/my_emails_landed_in_spam_for_over_a_year_straight/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o29yzqv",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 19:57:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a0ov3",
          "author": "No_Hedgehog8091",
          "text": "Your ranking is spot on. Most people waste time on trigger words when the real issue is engagement.\n\nOne thing that saved me: seed your list with your own email addresses across different providers. Reply to yourself from those accounts. Sounds weird but it trains the algorithms early that people interact with your emails.\n\nAlso, segment aggressively. Different content for different engagement levels keeps your overall metrics healthy.",
          "score": 6,
          "created_utc": "2026-01-28 20:04:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2a2yrr",
              "author": "PuzzleheadedTalk5159",
              "text": "Love it, speaking facts. Appreciate the feedback!",
              "score": 1,
              "created_utc": "2026-01-28 20:15:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2aibis",
          "author": "Low-Tackle7606",
          "text": "This is spot on! 🙌 Engagement really is everything, no technical fix helps if people aren’t opening or replying. Starting fresh with a new domain and warming it up slowly is usually the only way out if your old one’s burned. Curious. what’s your open/click rate now?",
          "score": 2,
          "created_utc": "2026-01-28 21:22:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ajjbh",
              "author": "PuzzleheadedTalk5159",
              "text": "I 100% agree!\n\nCurrently my open rate is sitting at around 25%, which isn't the best, but still decent (compared to before).\n\nHow about you?",
              "score": 2,
              "created_utc": "2026-01-28 21:27:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2akxbl",
                  "author": "Low-Tackle7606",
                  "text": "25% is solid progress! 🙌 My open rate is around 30%, and someone actually taught me that focusing on engaging subject lines and a real, conversation-style tone really helps boost it.",
                  "score": 2,
                  "created_utc": "2026-01-28 21:33:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2b7hkg",
          "author": "chaika22",
          "text": "What are you using to send the emails? Mailchimp or similar? I just launched a new LLC with new website and email, all through Squarespace and Google workspace. My first few emails just from gmail went to spam and ChatGPT filled me in on the SPF/DKIM issue, I wish that was made known to me as a higher priority while setting up the accounts.  I haven’t setup a marketing platform for email marketing and was curious if you had any suggestions on what to use.",
          "score": 2,
          "created_utc": "2026-01-28 23:19:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ceqlk",
          "author": "TemporaryKangaroo387",
          "text": "the biggest lesson here for anyone reading: sending infrastructure matters as much as content. you can have the best email copy in the world but if your domain reputation is trashed or you have no authentication set up its going straight to spam. dkim, spf, dmarc are table stakes now",
          "score": 2,
          "created_utc": "2026-01-29 03:11:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2d82ld",
              "author": "PuzzleheadedTalk5159",
              "text": "I 100% agree, sending infrastructue is a must these days",
              "score": 1,
              "created_utc": "2026-01-29 06:29:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qpa1jf",
      "title": "Thinking about buying Instagram followers - looking for honest feedback",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qpa1jf/thinking_about_buying_instagram_followers_looking/",
      "author": "throawayaaa",
      "created_utc": "2026-01-28 12:29:20",
      "score": 9,
      "num_comments": 4,
      "upvote_ratio": 0.78,
      "text": "Hi everyone,\n\nI’m struggling with Instagram growth and honestly feeling a bit lost. I’ve been posting high quality content, using clean profile pictures, and interacting with other IG users, but my IG account is still growing very slowly. Because of that, I started looking into options to buy Instagram followers, but the more I read, the more confusing it becomes.\n\nThere are so many posts and ads about the best sites to buy Instagram followers, promising real, active followers, premium followers, and strong organic growth. Some say it helps increase follower count, popularity, and social proof, while others warn about fake followers, empty accounts, and damaged engagement rate. It’s hard to know what’s real.\n\nWhat I really care about is my overall Instagram presence. I don’t want to buy IG followers just to see numbers go up. I want genuine followers who don’t hurt organic engagement or confuse Instagram algorithms. I’m worried about services that offer instant delivery but later cause followers to drop, reach to fall, or engagement to disappear.\n\nI’m also curious about how these Instagram services actually work in real life. Do the followers look like real IG users or fake accounts? Does buying followers help bring more followers over time, or does it only inflate the follower count? And what about customer support is there a real customer support team, or do they disappear once you pay?\n\nI’m not trying to cheat or fake success. I just want my IG account to grow in a healthy way without ruining organic engagement. If anyone here has experience with buying Instagram followers, I’d really appreciate honest feedback, good or bad. Did it help your growth, or did it hurt your account in the long run?\n\nNot looking for promotions, just real experiences from people who’ve tried this.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qpa1jf/thinking_about_buying_instagram_followers_looking/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o27ber3",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 12:29:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28ilrh",
          "author": "Zestyclose_Sort1883",
          "text": "Same here. I was posting consistently, and engagement wasn’t terrible, but the follower count was stuck, which made the account look kind of dead from the outside. I started small and used gradual delivery, and that’s what made it feel the least sketchy for me.",
          "score": 1,
          "created_utc": "2026-01-28 16:09:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28a2h0",
          "author": "ComplexTell25",
          "text": "I had a good experience with Media Mister as well. What stood out to me was how steady the delivery was. The account didn’t look like it jumped overnight, and everything felt balanced with my organic activity. It helped my profile look more established.",
          "score": -19,
          "created_utc": "2026-01-28 15:32:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpp0kc",
      "title": "I've got got a Pinterest account with 8.2 million monthly views if your interested hmu",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qpp0kc/ive_got_got_a_pinterest_account_with_82_million/",
      "author": "IllSource32",
      "created_utc": "2026-01-28 21:44:02",
      "score": 7,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "For anyone who has startups that need a Pinterest account",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qpp0kc/ive_got_got_a_pinterest_account_with_82_million/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2an7wg",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 21:44:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2b9dqr",
          "author": "StunningAd4284",
          "text": "Price?",
          "score": 1,
          "created_utc": "2026-01-28 23:28:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fc219",
              "author": "Bluestripedshirt",
              "text": "Any audience details to share?",
              "score": 1,
              "created_utc": "2026-01-29 15:30:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2imp1k",
          "author": "Top-Courage3279",
          "text": "I have a product launch coming up possibly next month. Please send me the details",
          "score": 1,
          "created_utc": "2026-01-30 00:57:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2q80zr",
          "author": "BuildingUsual3645",
          "text": " Please send details",
          "score": 1,
          "created_utc": "2026-01-31 03:17:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xk9tj",
          "author": "UgcWithNis",
          "text": "Please send details",
          "score": 1,
          "created_utc": "2026-02-01 07:03:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33nk3u",
          "author": "anthony7722",
          "text": "Guys if it's not your niche it will never really get the right audience. People like to follow what it's about and a sudden change would get a lot less people interested.",
          "score": 1,
          "created_utc": "2026-02-02 04:27:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qseae9",
      "title": "How i made 500$ in 24 days from Content Creation as a Newbie",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qseae9/how_i_made_500_in_24_days_from_content_creation/",
      "author": "roatopsgrid",
      "created_utc": "2026-01-31 21:06:52",
      "score": 7,
      "num_comments": 10,
      "upvote_ratio": 0.68,
      "text": "So everyone knows social media like Instagram, TikTok doesn't pay new creators much.  \nBut their are some brands which are willing to pay you if you get engagement for them on your completely new page, they don't care.  \n  \nI found a company which was a bridge between creators and brands. They were training creators like me and paying at the same time. Not only on basis of views. but some pays on how much you post because they know if you post according to them the views are guaranteed.\n\nThe hooks, style, text format. everything matters and they have a bible of it.\n\nAnd if you perform too well the method can be changed to performance basis, 2$ for every 1000 views.\n\nNo Matter where you are from. you can be paid.\n\nTo be honest i was skeptical. but you just have to start and i started enjoying and everything worked in a flow.\n\nHappy to help if anyone wanna do this too! giving back to the community. Upvotes are appreciated!",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qseae9/how_i_made_500_in_24_days_from_content_creation/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2uugo8",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-31 21:06:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2v5tu9",
          "author": "Outrageous-Brain3539",
          "text": "Technically \"guaranteed views\" is a statistical impossibility in a probabilistic algorithm, which implies you are likely serving impressions to bots or an engagement pod. while the revenue is tangible, your account's long-term attribution model is now corrupted because the engagement quality is effectively zero.",
          "score": 2,
          "created_utc": "2026-01-31 22:02:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2vb5qh",
              "author": "roatopsgrid",
              "text": "are you a bot",
              "score": 0,
              "created_utc": "2026-01-31 22:29:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2wysnc",
          "author": "Character_Economy168",
          "text": "i would just recommend finding a solid platform to get gigs from. ive had the most luck on a website called Home From College, ive gotten well-paying gigs consistently on there and its very flexible with my university schedule!",
          "score": 2,
          "created_utc": "2026-02-01 04:19:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2uyz8f",
          "author": "MiaSilk05",
          "text": "What company is?",
          "score": 1,
          "created_utc": "2026-01-31 21:29:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xoclm",
              "author": "roatopsgrid",
              "text": "yo, the link is on my profile",
              "score": 0,
              "created_utc": "2026-02-01 07:39:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ybppc",
          "author": "MichaelNjogu",
          "text": "Take me through it",
          "score": 1,
          "created_utc": "2026-02-01 11:14:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ycd00",
              "author": "roatopsgrid",
              "text": "you can check my profile, you will see process",
              "score": 1,
              "created_utc": "2026-02-01 11:20:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qqu9gn",
      "title": "Do you still check business websites, or mostly use Google Maps now?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qqu9gn/do_you_still_check_business_websites_or_mostly/",
      "author": "Hot-Astronaut-1916",
      "created_utc": "2026-01-30 03:28:23",
      "score": 6,
      "num_comments": 19,
      "upvote_ratio": 0.88,
      "text": "I noticed something about how I search for local services.\n\nMost of the time I don’t click through to a business’s website anymore. I scroll Google Maps, read a few reviews, look at photos, and decide from there.\n\nWhen do you think that shift happened for you?\n\nIt seems that now you have three things that define a click\n\n\\-photo\n\n\\-rating\n\n\\-amount of reviews\n\nDo you think it changes what businesses should focus on showing online?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qqu9gn/do_you_still_check_business_websites_or_mostly/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2jdp8g",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 03:28:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jf6jr",
          "author": "bayoubunny88",
          "text": "I go to google maps to look for their website.",
          "score": 4,
          "created_utc": "2026-01-30 03:36:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ngqsw",
              "author": "PatchneckRed",
              "text": "I was about to say this exact thing. Google Maps makes the first impression, sometimes (quite literally) getting me to the door. But, far more often than not, I have to see the website too before I reach out.",
              "score": 3,
              "created_utc": "2026-01-30 18:42:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2noibb",
                  "author": "bayoubunny88",
                  "text": "It’s also a good way to get to the right website.",
                  "score": 2,
                  "created_utc": "2026-01-30 19:17:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2jqx94",
          "author": "KONPARE",
          "text": "Yeah, same here. For anything local I’m basically living in Maps now. Website is usually only if I’m about to spend real money or I need specifics like pricing, hours, menu, booking, whatever.\n\nThe shift for me was when Maps got good enough that it stopped feeling like a gamble. Reviews, photos, “busy times,” quick call button. Done. Also honestly, a lot of small business sites are slow or annoying on mobile, so I just… don’t.\n\nAnd yep, those three things matter a lot. Photo, rating, review count. Plus a couple extras people forget:\n\n* recent reviews (last 30 to 90 days)\n* owner responses (even short ones)\n* accurate categories and hours\n\nBusinesses still need a site, but I’d treat it like the closer. Maps gets the first decision. The site just seals it.",
          "score": 2,
          "created_utc": "2026-01-30 04:49:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2q3tql",
              "author": "Hot-Astronaut-1916",
              "text": "The first site definitely gets at least a click. Another reason why ranking on Google matters.",
              "score": 1,
              "created_utc": "2026-01-31 02:51:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2k8hne",
          "author": "bambidp",
          "text": "I agree. Businesses need to optimize their Google Map content.",
          "score": 2,
          "created_utc": "2026-01-30 07:01:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kaolb",
          "author": "jluisseo",
          "text": "Depende del tipo de negocio. Para restaurantes, cafeterías, servicios locales -> Google Maps es suficiente.\n\n\n\nPero para ecommerce o servicios B2B, la web sigue siendo crítica. Ahí es donde se cierra la venta.\n\n\n\nLo que mata conversiones:\n\n\\- Web sin WhatsApp directo\n\n\\- Formularios largos que nadie llena\n\n\\- Falta de reseñas/casos de uso\n\n\n\nLo mejor: Google Maps optimizado + web limpia y rápida. No hace falta diseño super fancy, mejor funcional.",
          "score": 2,
          "created_utc": "2026-01-30 07:19:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2klsnc",
          "author": "kubrador",
          "text": "yeah the website became like a backup tab nobody opens. google maps is basically the new homepage for local businesses.\n\n\n\nhonestly though if you're in digital marketing and \\*not\\* obsessed with your google business profile at this point you're basically running a pizza place with no sign. the rating/photo/review trifecta is doing more heavy lifting than your whole site probably.",
          "score": 2,
          "created_utc": "2026-01-30 08:59:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2q53ju",
              "author": "Hot-Astronaut-1916",
              "text": "Agreed. Google Ranking and clarity are becoming a dynamic that is integral and increasingly important in business success.",
              "score": 1,
              "created_utc": "2026-01-31 02:59:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2le87l",
          "author": "HostAdviceOfficial",
          "text": "Yeah, nowadays visiting websites is usually the last step. Usually just for credibility, prices, payment details, and such. What changes for businesses is that now they need to show information that adds clarity and credibility like quality photos, clear and up to date pricing, and functioning contact information.",
          "score": 2,
          "created_utc": "2026-01-30 12:49:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2q46wd",
              "author": "Hot-Astronaut-1916",
              "text": "Agreed. I'm seeing the funnel starts with Google Maps. Getting to the page finally puts you at least into the final phase of landing the customer.",
              "score": 1,
              "created_utc": "2026-01-31 02:54:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ll8ma",
          "author": "ThomasFromChannable",
          "text": "Google Maps is a way for me to find smaller companies websites, and honestly if the company isn't on Maps then I'll be very hesitant to give them my business... Visibility is a key factor to trust for me",
          "score": 2,
          "created_utc": "2026-01-30 13:30:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2q4ay9",
              "author": "Hot-Astronaut-1916",
              "text": "Agreed. Google ranking and showing up is increasingly important.",
              "score": 1,
              "created_utc": "2026-01-31 02:54:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kiree",
          "author": "semantic_ops",
          "text": "Je confirme cette utilisation pour certains secteurs. Je fais par exemple de la location de salle de réunion, et 8 personnes sur 10 qui appellent me demandent le prix alors que tout est expliqué sur le site web... j'en conclue qu'ils restent sur la fiche Google (d'ailleurs il y a quelques mois j'ai changé mon numéro de téléphone fixe en oubliant de faire la modification sur la fiche Google... et je n'avais quasiment plus d'appel de prospects). En revanche pour mon agence web Pixeldorado j'ai plus de mal à déterminer le rôle des fiches Google. Les gens semblent prendre plus de temps pour lire les contenus du site web.",
          "score": 1,
          "created_utc": "2026-01-30 08:31:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m8wb2",
          "author": "noval5",
          "text": "I check Yelp for reviews + photos, Google Maps for photos, directions, busy hours, + hours, and the website to order takeout/make a reservation",
          "score": 1,
          "created_utc": "2026-01-30 15:28:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2q4ikt",
              "author": "Hot-Astronaut-1916",
              "text": "Interesting you mention Yelp. Besides Google Maps and Yelps is there anything else you use to vet being a customer to a potential business.",
              "score": 1,
              "created_utc": "2026-01-31 02:56:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qoi1yv",
      "title": "is it just me, or has LinkedIn Sales Navigator become a graveyard of outdated data?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qoi1yv/is_it_just_me_or_has_linkedin_sales_navigator/",
      "author": "tersbackwrec",
      "created_utc": "2026-01-27 16:08:54",
      "score": 6,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "Has anyone herefound a marketing automation or an agentic tool that actually _reasons_ through a profile before adding it to a list? I’m looking for something that understands the \"why\" behind a lead, not just the job title. What are you guys using that actually feels \"smart\" in 2026?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qoi1yv/is_it_just_me_or_has_linkedin_sales_navigator/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o21d6g4",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 16:08:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21fg16",
          "author": "Delicious_Peanut_645",
          "text": "I tired LinkedIn Sales navigator a year ago sent more than 1000 message haven't got a single conversion from that",
          "score": 1,
          "created_utc": "2026-01-27 16:18:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22culy",
          "author": "Nastya_Tan",
          "text": "A hard nut to crack",
          "score": 1,
          "created_utc": "2026-01-27 18:42:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25xyqb",
          "author": "Antler-gxy",
          "text": "Yep, Sales Nav feels ancient now. I haven’t seen anything that truly “reasons” yet — most tools still do keyword/title matches. The best results I get are from combining context signals (recent moves, role changes, activity) + manual filtering.\n\nWould love to hear tools that actually act smart in 2026.",
          "score": 1,
          "created_utc": "2026-01-28 05:37:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33pkv4",
              "author": "Suspicious_Candy9048",
              "text": "I’m in a similar place. Sales Nav definitely feels dated now — most of it is still title/keyword matching with very limited real “reasoning.”I’ve been testing Apollo, ZoomInfo, and Lessie recently: Apollo does a solid job on people search and contact enrichment, and the product is fairly mature, but pricing starts to get painful once you scale; ZoomInfo has strong coverage and depth, especially for B2B, but it’s hard to justify the cost unless you’re already operating at a larger budget; Lessie feels lighter and more flexible, with decent intelligence around people search and fresher signals, which makes it more workable for smaller teams.Overall, all three are good at people search in different ways, but Apollo and ZoomInfo still feel overpriced for teams that want smarter filtering without committing to a big contract.",
              "score": 1,
              "created_utc": "2026-02-02 04:41:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o260gex",
          "author": "Livid_Pace8596",
          "text": "LSN is fine... but a bit old-school.",
          "score": 1,
          "created_utc": "2026-01-28 05:55:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o263q30",
          "author": "Humble-Climate7956",
          "text": "I feel your pain with Sales Navigator. We were drowning in bad data – outdated job titles, people who'd left the company months ago, you name it. Our sales team was wasting so much time chasing ghosts that it was impacting morale. The real killer was trying to understand the connections between data points. Like okay this person is a VP of Marketing now but they used to work at a company thats a known competitor and theyve been posting about a specific technology on LinkedIn. We were manually trying to piece all of that together which was taking forever. We actually found a solution thats been a game-changer. They basically have this AI-powered platform that automatically maps all these hidden relationships in our data. It sounds like magic but it pulls data from all our different sources – Sales Navigator our CRM marketing automation platform even some internal databases – and figures out whos connected to whom and how. It scrubs the data highlights important changes like someone getting a new role and flags potential leads that actually align with our ideal customer profile. For instance we had a situation where someones title hadnt been updated in Sales Navigator but the tool picked up that they were actively involved in a project related to a technology we sell based on their LinkedIn activity and mentions in some industry publications. It was buried in the noise but the platform surfaced it. The biggest win honestly was freeing up our data team. Before they were constantly building ETL pipelines and cleaning up data but now the AI handles most of that automatically. They can finally focus on more strategic stuff. Plus its empowered our sales and marketing teams to build their own custom workflows using natural language to look for the types of leads that convert so its taken the pressure off the data team. Its made a huge difference in our lead quality and conversion rates. The company that made it has a referral program (full disclosure I'd get a kickback if you sign up through me). But honestly it solved a massive headache for us and I think it could really help you too. Happy to connect you if youre interested.",
          "score": 1,
          "created_utc": "2026-01-28 06:20:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26noh6",
          "author": "FMBasho",
          "text": "After going back and forth with sales nav subscriptions, I decided to quit. The industry filters are terrible and even if you do a boolean search the results are quite messy and unreliable.  \nWhat I'm doing now is grabbing linkedin profiles from Apollo, then using Heyreach for outreach automation. You can really narrow down your search to specific niches, like e-commerce - dtc or tech - SaaS.",
          "score": 1,
          "created_utc": "2026-01-28 09:13:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2972dz",
          "author": "-TaskForge-",
          "text": "You’re right-many tools focus only on surface-level details like job titles, which often leads to outdated or irrelevant lists. Our approach uses freshly sourced leads tailored to our ideal customer profile. We combine data scraping with automation that checks for recent activity of prospects and engages with their recent LinkedIn activity before sending connection requests, and no recent activity means that we don't even see that prospect in our lead list. This helps create warmer introductions based on actual behavior, not just static information. It’s a more thoughtful way to build meaningful outreach in today’s market.",
          "score": 1,
          "created_utc": "2026-01-28 17:55:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2v06be",
          "author": "Embarrassed-Let4756",
          "text": "sales nav is def not great for anything outside of b2b tech/enterprise. tried it for local service businesses and the data was completely useless\n\nfor smb targeting i switched to scraping google maps directly and enriching from there. at least you know the business actually exists and is active. tools like pullleads or outscraper work better for that use case imo\n\nthe \"smart\" part youre looking for probably needs to come from your own filtering logic tbh. no tool is gonna understand your icp as well as you do",
          "score": 1,
          "created_utc": "2026-01-31 21:34:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpwx5r",
      "title": "When you search for a local service, what actually makes you click one result over another?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qpwx5r/when_you_search_for_a_local_service_what_actually/",
      "author": "Hot-Astronaut-1916",
      "created_utc": "2026-01-29 03:09:15",
      "score": 6,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "I keep noticing that the same local businesses show up at the top of Google, but I’m not sure *why* people actually choose them.\n\nWhen you’re scrolling through results, what makes you click?\n\n* reviews?\n* photos?\n* how clearly the service is listed?\n* something else?\n\nNot asking as a business owner — just curious how other people decide to pull the trigger or makes you commit. Looking to understand customer psyche.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qpwx5r/when_you_search_for_a_local_service_what_actually/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2cedpc",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 03:09:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ch3le",
          "author": "northowlmedia",
          "text": "When trying a new local place (esp a food place) the first thing I look at is the photos 😆 I usually look at the food and a picture of the menu for pricing if all looks good, then I will look at the reviews.",
          "score": 2,
          "created_utc": "2026-01-29 03:25:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jbonb",
              "author": "Hot-Astronaut-1916",
              "text": "I am in reverse order but that definitely correlates. Reviews and Pictures (activity) builds a decision.",
              "score": 2,
              "created_utc": "2026-01-30 03:16:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2d01x9",
          "author": "Imaginary-Quit-5337",
          "text": "When I search for a local service, I usually click based on a **combination of factors**: good **reviews and ratings**, clear description of the service, **recent photos**, and how professional the listing looks. If a business shows up with lots of positive reviews and relevant info at a glance, I feel more confident clicking it.",
          "score": 2,
          "created_utc": "2026-01-29 05:27:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jc0xe",
              "author": "Hot-Astronaut-1916",
              "text": "What is more likely to get your pick: 4.9 with 100 reviews or a 4.5 with 1000 reviews?",
              "score": 1,
              "created_utc": "2026-01-30 03:18:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2d9ume",
          "author": "MitoLinen",
          "text": "Social proof first  \nI always check a star rating and a volume of reviews. 4.7 with a high volume is bettere than 5.0 with only 11 reviews\n\nClear info second  \nIf the core of the service, pricing, or timeline isn't clear or if I have to dig through a site just to figure things out, I’m out and move on.",
          "score": 2,
          "created_utc": "2026-01-29 06:44:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jc7pf",
              "author": "Hot-Astronaut-1916",
              "text": "answered my question I just had above. I am of the same opinion. I wonder out of 10 of us what the breakdown would be?",
              "score": 1,
              "created_utc": "2026-01-30 03:19:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2gprkb",
          "author": "PatchneckRed",
          "text": "For me, it's that personal feeling of: \"could I see myself going there?\" If I really feel that, even if it's fleeting, I can't help but click",
          "score": 2,
          "created_utc": "2026-01-29 19:13:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jcc2y",
              "author": "Hot-Astronaut-1916",
              "text": "Is the vibe check more likely in the description and name or the photos?",
              "score": 1,
              "created_utc": "2026-01-30 03:20:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2h4f58",
          "author": "MonkeyMom1993",
          "text": "Social proof for sure. What does the place look like and what are people saying. Thats how I decide on a new place.",
          "score": 2,
          "created_utc": "2026-01-29 20:22:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jceyj",
              "author": "Hot-Astronaut-1916",
              "text": "Most important aspect of social proof?",
              "score": 1,
              "created_utc": "2026-01-30 03:20:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2jk3s0",
                  "author": "MonkeyMom1993",
                  "text": "There isn't multiple aspects to social proof. The definition reflects it's job - to show proof of other people's positive experiences to build trust, confidence and credibility in potential customers in a brand or product. \n\nNow if you're asking how to show that now you are asking for people to build a content pillar.\n\nYou may need to pause and build yourself some infrastructure.",
                  "score": 2,
                  "created_utc": "2026-01-30 04:06:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2jcgcv",
                  "author": "Hot-Astronaut-1916",
                  "text": "Your opinion?",
                  "score": 1,
                  "created_utc": "2026-01-30 03:21:13",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qov6w1",
      "title": "What SEO strategies are working for you guys?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qov6w1/what_seo_strategies_are_working_for_you_guys/",
      "author": "New-Strength9766",
      "created_utc": "2026-01-28 00:00:17",
      "score": 6,
      "num_comments": 32,
      "upvote_ratio": 0.8,
      "text": "I’ve recently been put in charge of SEO strategy at work. I was already handling most of the execution, but now I’m expected to be more proactive and drive results.\n\nWe’re doing a lot already. Link building, digital PR, content optimization, and creating supporting content for BOFU pages. Even with all that, our organic traffic keeps slipping\n\nAI visibility is trending up, but it’s not offsetting the traffic drop yet.\n\nFor those seeing growth this year, what’s actually working for you? Where would you double down if you were in my position?\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qov6w1/what_seo_strategies_are_working_for_you_guys/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o249v8t",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 00:00:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24aaid",
          "author": "prinky_muffin",
          "text": "That’s a tough spot. One thing that’s helped me reverse a slide like that was shifting some focus away from pure net new content and links, and going hard on refreshing pages that were already getting impressions. Updating structure, tightening search intent, improving internal linking, and adding missing subtopics moved a few stuck pages way faster than publishing brand new posts. I also started looking more closely at what was winning the SERP now, not what used to rank a year ago. A lot of times the format, depth, or angle had quietly changed.\n\nI also learned how to spot those opportunities better after digging into some of the strategies in odd angles media’s free Reddit SEO blueprint. It pushed me to think more in terms of demand signals and real questions people are asking, instead of just chasing keyword tools all day. That mindset shift alone helped me prioritize what was actually worth updating or expanding.\n\nIf traffic is slipping even with solid execution, I’d double down on refreshing proven pages, tightening intent match, and making sure internal links are really pushing authority where you want it. Small compounding improvements there tend to move the needle faster than constantly starting from zero.\n\nHope that helps!",
          "score": 6,
          "created_utc": "2026-01-28 00:02:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24acol",
          "author": "PerformanceLiving495",
          "text": "What helped us most was going back to fundamentals and focusing hard on search intent instead of just pumping out more content. We audited our top pages and rewrote them to better match what people were actually searching for, improved structure, internal linking, and tightened up page speed and mobile performance. We also refreshed older pages that already had some traction instead of constantly publishing new ones. Once we focused on depth, usefulness, and technical cleanup, rankings slowly stabilized and then started improving.",
          "score": 3,
          "created_utc": "2026-01-28 00:02:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24ahbd",
          "author": "Dusi99",
          "text": "We saw better results when we stopped treating publishing as the finish line and leaned more into building credibility in the niche. Partner content, expert quotes, and real mentions in relevant communities brought stronger signals than random placements. Another big win was cleaning up site architecture so important pages weren’t buried several clicks deep. It took a few months, but consistency plus easier crawl paths helped performance recover.",
          "score": 2,
          "created_utc": "2026-01-28 00:03:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24lc0e",
          "author": "Ill_Lavishness_4455",
          "text": "Honestly, the reason your traffic is dipping even with all that BOFU work is probably because you're still playing by 2023 rules. In 2026, standard organic is basically a secondary metric—AI \"Share of Model\" is the real game now.\n\nIf I were in your shoes, I’d stop chasing the click and start chasing the citation. A few things to double down on:\n\n1. Lead with the answer. Put a 2-3 sentence \"Direct Summary\" at the top of every page. If an LLM agent has to dig for your point, it’ll just cite a competitor who made it easier to scrape.\n\n2. Structure your content into modular blocks. Your H2s and H3s should work as standalone \"Knowledge Passages\" that don't need the rest of the page for context.\n\n3. Don't ignore schema. It’s basically the translation layer for AI crawlers. Use it to tell the agents exactly what your entities are so they don't have to guess.\n\n4. Focus on Entity Co-occurrence. Traditional backlinks matter less than having your brand mentioned in the same breath (and training data) as your main keywords.\n\nBasically, stop trying to win the search engine and start trying to win the reasoning engine.",
          "score": 2,
          "created_utc": "2026-01-28 00:58:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24aml1",
          "author": "Super-Catch-609",
          "text": "One thing that helped us was closely reviewing which pages were slipping and figuring out why instead of guessing. In many cases competitors had updated faster or covered topics more thoroughly, so we expanded our pages with clearer explanations, examples, and visuals. We also improved things like load time, layout, and readability to keep people engaged longer. Small upgrades across many pages added up more than chasing one big tactic.",
          "score": 1,
          "created_utc": "2026-01-28 00:04:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24gtg8",
          "author": "No-Air-1589",
          "text": "Short answer: The traffic drop probably isn't your fault. The game is changing. But scaling the same tactics while the game is changing won't work. Step back, ask 'which business outcome is this activity tied to,' and redesign from there.",
          "score": 1,
          "created_utc": "2026-01-28 00:35:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24id63",
          "author": "kubrador",
          "text": "sounds like you're doing the textbook stuff and google's still ghosting you. that's because everyone's doing the textbook stuff.\n\nif traffic's slipping while you're optimizing, the real answer is probably that your BOFU content isn't actually converting better or ranking for anything people give a shit about anymore. link building and digital pr are table stakes now, not differentiators.\n\nthe people seeing growth are either: 1) in verticals google hasn't completely destroyed yet, 2) doing something weird with their topical authority that actually works, or 3) just lucky enough to have branded searches propping them up. \n\nif you want my take: stop optimizing for keywords and start obsessing over whether your content answers questions better than the ai answer at the top. that's the actual competitive moat right now. but that's harder to report on than \"we built 47 backlinks\" so good luck pitching it upstairs",
          "score": 1,
          "created_utc": "2026-01-28 00:43:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25jl5s",
          "author": "swiftpropel",
          "text": "I have been redoubling topical authority in content cluster pillar pages with deep subtopic clusters. It is moving my traffic down reversal as AI summaries because Google prefers entity-based knowledge at the time. The refreshing of old human content is beneficial.",
          "score": 1,
          "created_utc": "2026-01-28 04:03:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25o3lw",
          "author": "patpatpat_pat",
          "text": "AI optimization and on page content for organic require a relationship that works for both, but one doesn’t necessarily cause the other to slip on organic super badly. You’re probably over optimizing or not giving it time to really take place. Big changes cause a drop and sometimes the work doesn’t pay off for months.",
          "score": 1,
          "created_utc": "2026-01-28 04:30:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25tq3r",
          "author": "rubberblutt",
          "text": "SEO is dead.  Get good at ads.",
          "score": 1,
          "created_utc": "2026-01-28 05:07:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2618dv",
          "author": "supriya_l89",
          "text": "The current expansion of our operations shows better results through focused efforts instead of implementing extra strategic approaches. The existing content needs updating and consolidation while we work to enhance internal links that support our main BOFU pages and create content that matches actual search intent. The work of tracking AI/SGE content extraction needs to be done because we need to optimize for that content categorization process from the beginning. The organic search results now prioritize content quality and relevance above content volume according to current assessment.",
          "score": 1,
          "created_utc": "2026-01-28 06:01:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26jzgc",
          "author": "cjsb28",
          "text": "Focus on AI-readable content with structured FAQs, schema markup, and clear expertise signals. Optimize for search intent, update existing pages regularly, and earn authoritative backlinks. Quality beats volume in 2026.",
          "score": 1,
          "created_utc": "2026-01-28 08:38:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26qny8",
              "author": "andrlac",
              "text": "Totally agree. Adding FAQs to all relevant landing pages has really helped us stabilize our traffic and also improve our SEO rankings.",
              "score": 1,
              "created_utc": "2026-01-28 09:41:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o26qdj5",
          "author": "ContextFirm981",
          "text": "The biggest wins I’m seeing now come from ruthlessly updating and consolidating existing content (fixing cannibalization, pruning weak pages), strengthening E‑E‑A‑T (real authors, case studies, original data), and tightening internal linking around a few key BOFU pages. Those moves have helped more than just “more links and more posts.”",
          "score": 1,
          "created_utc": "2026-01-28 09:38:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26rcnr",
          "author": "ChestChance6126",
          "text": "short answer, fewer bets, tighter focus. i’ve seen better results from pruning content, tightening intent match on money pages, and improving internal linking than from more links. ai visibility helps, but fixing weak pages that bleed rankings helped more.",
          "score": 1,
          "created_utc": "2026-01-28 09:47:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27ham5",
          "author": "hddjdjjdjd",
          "text": "What actually helped me with SEO traffic is building out all the other marketing platforms. Social media, podcast, linkedin, etc. Google wants to see that you are a real business.",
          "score": 1,
          "created_utc": "2026-01-28 13:06:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27krbq",
          "author": "Rich-Editor-8165",
          "text": "I’m seeing better results focusing less on volume and more on intent alignment. like updating existing pages to match current search intent, tightening internal linking around a few priority topics, and improving page experience has moved the needle more than new content. keep in mind to double down on what already ranks page 2-3 and make those pages unmistakably better rather than chasing new keywords.",
          "score": 1,
          "created_utc": "2026-01-28 13:26:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2811jz",
          "author": "TemporaryKangaroo387",
          "text": "youre describing the exact situation a lot of SEO people are struggling with rn -- doing all the right things but still watching traffic bleed out\n\nthe uncomfortable truth is that AI overviews are eating clicks that used to go to traditional results. and the tactics that work for traditional SEO dont necessarily work for getting cited by AI models. its basically a new channel that overlaps but isnt the same.\n\nsome things that have moved the needle for us:\n\n- track where youre actually showing up in AI answers (not just google search). tools like BrightEdge or manual checks in ChatGPT/Perplexity can help baseline this\n\n- structure content so its easy for LLMs to parse and cite -- clear headers, factual statements, entity references. the \"direct answer at the top\" approach others mentioned is legit\n\n- entity authority matters more than ever. being mentioned alongside relevant keywords in sources that get crawled (reddit, wikipedia, news, industry publications) seems to influence what LLMs recommend\n\n- honestly for BOFU pages the best move might be leaning harder into conversion optimization vs traffic volume. if AI is answering informational queries directly, your organic traffic composition is shifting toward more qualified intent anyway\n\nthe traffic number declining doesnt always mean business impact is declining, depends what queries youre losing. worth segmenting",
          "score": 1,
          "created_utc": "2026-01-28 14:50:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o288wv6",
          "author": "vinchenz112",
          "text": "FWIW I'm compiling our BuzzStream State of Digital PR 2026 and the overwhelming majority responded that digital PR is more effective than last year by a lot. Seems like that's where a lot are leaning for visibility given organic's dip.\n\n  \nMany sites are building owned audiences too!",
          "score": 1,
          "created_utc": "2026-01-28 15:27:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28cwuw",
          "author": "Reddygators",
          "text": "How would the group rate this for a strategy?  \n\nAdd custom video content aligning with website’s priorities.  If there are landing pages within the website for these key priorities, a video modified for each page.  \n\nTighten up the company YouTube channel and video titles descriptions thumbnails.  insure all Google YouTube platforms are connected properly and updated reflecting priorities.  \n\nMain Videos feature owner/spokesperson, product and credible client testimonials.  \n\nSnippets from a topic’s main video sprinkled across social media.  Track results, switch to next priority product/service.  \n\nWould this move the needle? If so how much? How soon?",
          "score": 1,
          "created_utc": "2026-01-28 15:45:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2aewbh",
          "author": "OrganicClicks",
          "text": "Rough timing to be taking over SEO leadership, the landscape is chaotic right now with AI overviews eating clicks. Look at improving topic authority over keywords because Google seems to favor sites that own entire topics, not just individual keywords. If you can include useful tools, or databases, would also help.\n\nIt could also be time to look at alternative traffic sources like YouTube SEO, newsletters and the like. Diversify before Google completely transforms.",
          "score": 1,
          "created_utc": "2026-01-28 21:07:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2au1ui",
          "author": "jello_house",
          "text": "Traffics dropping even with all the basics? Brutal but try automating consistent content creation with Nextblog AI does killer keyword research, gaps analysis, and pumps out SEO-optimized longforms that actually rank without you grinding daily. Doubled down there myself and its offsetting AI shifts better than manual stuff ever did.",
          "score": 1,
          "created_utc": "2026-01-28 22:13:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f193j",
          "author": "Heesdedjim",
          "text": "The Best plan for any company is to not put someone in charge of SEO who goes to Reddit to find out how to do SEO... ",
          "score": 1,
          "created_utc": "2026-01-29 14:39:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2nja3t",
          "author": "getcited",
          "text": "I totally get how frustrating it is to see organic traffic slip despite solid SEO efforts like link building and digital PR. We've had great luck doubling down on AI-driven visibility with outwrite.ai—it helps us quickly create citation-optimized content that actually gets traction faster than traditional SEO. Might be worth checking out to complement your current strategy and boost those AI search results!",
          "score": 1,
          "created_utc": "2026-01-30 18:53:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq65h0",
      "title": "What is the best platform to manage and schedule Instagram and Tiktok postst in 2026?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qq65h0/what_is_the_best_platform_to_manage_and_schedule/",
      "author": "Lurking_Long_Hours",
      "created_utc": "2026-01-29 11:32:09",
      "score": 5,
      "num_comments": 19,
      "upvote_ratio": 0.86,
      "text": "The title basically. And please, no low-effort vibe-coded shills. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qq65h0/what_is_the_best_platform_to_manage_and_schedule/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2e65m0",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 11:32:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gwf63",
          "author": "OrganicClicks",
          "text": "Later and Buffer are still the best for across both platforms. They have clean interfaces, reliable posting, decent free tiers. Hootsuite works well too but only if you're managing multiple accounts. It could feel overpriced if you are managing one or a few accounts.",
          "score": 1,
          "created_utc": "2026-01-29 19:44:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gywhc",
          "author": "Sonexomo",
          "text": "Biased answer since I built it, but if you're looking for just scheduling and posting - Schedulala.com. Handles Instagram, TikTok (we're API verified), Twitter, Facebook, Pinterest, YouTube, Threads, Bluesky from one dashboard.\n\n$9/month flat, unlimited posts. $18 if you want a shared dashboard so you and a partner can see all scheduled posts in one place.\n\nFair warning: we don't have analytics, comment management, or inbox features. If you need those, the big names (Later, Buffer, Hootsuite) are probably better fits.\n\nBut if you just want to batch content, schedule it out, and have it post reliably without paying per channel - that's what we do.",
          "score": 1,
          "created_utc": "2026-01-29 19:56:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hctrd",
          "author": "AnUglyGuy89",
          "text": "Following, I'm interested to Know more about other tools, since I Just use platforms itself",
          "score": 1,
          "created_utc": "2026-01-29 21:03:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ixbk2",
          "author": "hostsofinfluence",
          "text": "Vistasocial is cool!",
          "score": 1,
          "created_utc": "2026-01-30 01:56:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2j0uim",
          "author": "janieandmax_",
          "text": "I like Hookle and Content360.",
          "score": 1,
          "created_utc": "2026-01-30 02:16:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jg1kz",
          "author": "mannyned2",
          "text": "Check out ReGenr.app — we’re currently in beta and would love to have you as a tester to share feedback and help shape the product.\n\nReGenr is a creator-first platform for posting and scheduling across multiple channels, with advanced analytics, actionable insights, and automated blog sharing across major platforms like Facebook, Instagram, X (Twitter), TikTok, LinkedIn, YouTube, Discord, and Pinterest.",
          "score": 1,
          "created_utc": "2026-01-30 03:41:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jud2d",
          "author": "w23lfe",
          "text": "Just one tip, look for official api schedulers",
          "score": 1,
          "created_utc": "2026-01-30 05:13:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k3o43",
          "author": "supriya_l89",
          "text": "The solid picks of 2026 show tools which perform both platforms effectively through their main functions. The combination of Later and Hootsuite provides dependable solutions for scheduling and analytics and team workflow management. Metricool provides a strong value proposition because it delivers Instagram and TikTok analytics at a lower price than enterprise solutions. The Sprout platform provides excellent short-form content and trend analysis tools but comes at a high cost. The term best describes a specific product because your analytical needs determine how much you require beyond basic scheduling functions which should be handled by tools that make unrealistic claims about their AI capabilities.",
          "score": 1,
          "created_utc": "2026-01-30 06:22:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k6ja8",
          "author": "Andreiaiosoftware",
          "text": "I am using schedpilot for scheduling my social media stuff, i dont really do tiktok that much but the tool has tik-tok as well and you can schedule posts, and more important for me i can manage all in one place.",
          "score": 1,
          "created_utc": "2026-01-30 06:45:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k8v54",
          "author": "Viral_Graphs",
          "text": "For scheduling and managing content, most people go with tools like Buffer, Hootsuite, or Loomly because they support multiple platforms and have analytics built in. If you use Instagram and TikTok a lot, Later is solid too. Choose based on which social networks you need and how deep your reporting has to be.",
          "score": 1,
          "created_utc": "2026-01-30 07:04:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33vbqg",
          "author": "Confident-Smile-7161",
          "text": "I like metricool, i can uplaod by a csv file which makes it alot easier if i want to schedule a months worth of content at one time, the free tier is pretty good to if you are 4 - 5 posts a week. they have a 30 free trial for their paid account with a promo code ( its easy to find the code online its  like ALBERTOJO or something. just type metricool promo code into google i think its the top site and maybe the 5th or 6th promo code down the list on the site)",
          "score": 1,
          "created_utc": "2026-02-02 05:22:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e6g5v",
          "author": "Lurking_Long_Hours",
          "text": "Excuse my fat fingers, I can't edit the title now.",
          "score": 0,
          "created_utc": "2026-01-29 11:34:29",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o2ei450",
          "author": "TypicalAd3489",
          "text": "I have two: \n\n1) metricool.com - For its analytics pretty amazing data\n2) followr.ai - I got a LTD and it’s pretty decent it does the job and the AI it’s helpful.",
          "score": 0,
          "created_utc": "2026-01-29 12:55:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2en0b1",
          "author": "Single-Use1800",
          "text": "Later is still the best all-around choice in 2026 if you care about planning, looks, and consistency on Instagram and TikTok. The calendar view, grid preview, and analytics actually assist with thinking, not just auto-posting.\n\nIf you want lean + no-nonsense, Buffer is awesome less “creator sparkle,” more dependability.\n\nIf you have a team or brand overwhelmed with approvals, Hootsuite is fine, but it’s clunky and pricey.\n\nA true note that won’t be shouted from the rooftops: For TikTok, in particular, manual posting may still beat out schedulers in certain situations. The best combination, therefore, is often Later for planning and native posting for high-pressure content.\n\nNo magic tools just trade-offs.",
          "score": 0,
          "created_utc": "2026-01-29 13:24:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp6p7r",
      "title": "“We need a video” is not a strategy",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qp6p7r/we_need_a_video_is_not_a_strategy/",
      "author": "Salamandra_UK",
      "created_utc": "2026-01-28 09:23:54",
      "score": 5,
      "num_comments": 6,
      "upvote_ratio": 0.86,
      "text": "I hear “we need a video” the same way I hear “we need a landing page”\n\nBut for what job?\n\n* conversion?\n* onboarding?\n* sales enablement?\n* retargeting?\n* brand trust?\n\nDo you brief creative based on funnel stage, or just “make it look good”?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qp6p7r/we_need_a_video_is_not_a_strategy/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o26otqn",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 09:23:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26s6kj",
          "author": "TemporaryKangaroo387",
          "text": "funnel stage 100%. ive seen so many \"lets make a brand video\" requests that end up being a $20k explainer that sits on youtube with 400 views while the sales team is screaming for a 30 second objection handler\n\nthe question i always push back with is: whats the one thing you want someone to DO after watching this? like specifically, not \"engage with the brand\"\n\nmost of the time the answer reveals what they actually need -- demo request? probably a product walkthrough with a clear cta. reduce churn? onboarding video with common friction points. close deals faster? sales enablement clip that addresses the top 3 objections from your lost deals\n\nvideo for \"brand awareness\" is usually code for \"we dont know what we want but everyone else has one\"",
          "score": 1,
          "created_utc": "2026-01-28 09:54:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kx9j8",
              "author": "Salamandra_UK",
              "text": "This is spot on 👏 “Brand video” becomes the default ask, but the real question is exactly what you said: what do you want someone to DO after watching?\n\nWe see the same thing all the time - a 30–60s “objection handler” or product walkthrough often moves the needle way more than a big hero explainer that sits quietly on YouTube.\n\nLove your examples too (demo request / onboarding / close deals faster) that’s the kind of clarity that makes creative actually perform.",
              "score": 1,
              "created_utc": "2026-01-30 10:42:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ky2gn",
                  "author": "TemporaryKangaroo387",
                  "text": "exactly, the objection handler angle is underrated. seen way too many companies spend 10k on a brand video that gets like 200 views while a quick loom walkthrough closes deals lol\n\nwhat kind of video content are you working on currently?",
                  "score": 1,
                  "created_utc": "2026-01-30 10:49:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o277v1f",
          "author": "JyoP2708",
          "text": "Honestly, “we need a video” without a job attached is how teams end up with nice-looking assets that don’t move anything. A video for top-of-funnel brand trust should feel completely different from one meant for retargeting or sales enablement, but a lot of briefs skip that part. I’ve found it helps to map examples by funnel stage first, then brief creative off those patterns instead of vibes. Tools like Socialmon are actually useful here you can search by topic and see what kinds of videos are performing at different stages, not just what “looks good.” Once the job is clear, the creative direction usually becomes obvious.",
          "score": 1,
          "created_utc": "2026-01-28 12:04:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kxatm",
              "author": "Salamandra_UK",
              "text": "Completely agree. “We need a video” without a job attached is how you end up with something that looks great… and does nothing\n\nThe intent matters so much and top-of-funnel vs retargeting vs sales enablement are totally different beasts, and the creative should reflect that from the start.\n\nAlso +1 on mapping by funnel stage first. Once the objective is clear, the right format tends to become obvious (and the brief gets 10x easier).",
              "score": 1,
              "created_utc": "2026-01-30 10:42:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qpmflp",
      "title": "Just published my first free Udemy course, looking for advice on promotion.",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qpmflp/just_published_my_first_free_udemy_course_looking/",
      "author": "Initial_Spend8988",
      "created_utc": "2026-01-28 20:08:05",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,\n\nI just published my first free Udemy course for my company and would love some advice from people who’ve done this before.\n\nThe course covers game production fundamentals and is aimed at vibe coders ,indie devs, students, and small teams.\n\nI’m mainly curious:\n\n* What has worked for you promoting a free course?\n* Anything you wish you’d known before launching?\n\nAppreciate any tips and feedback.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qpmflp/just_published_my_first_free_udemy_course_looking/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2a1eo4",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 20:08:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ah9a5",
          "author": "Mindless_Cow_6034",
          "text": "The key is to share specific modules in niche Discord groups or subreddits where students are actively looking for production tips. Providing a solution to a real pain point will drive many more signups than a generic announcement.\n\nI am the founder of the event marketing service MyWeb Glory. I have noticed that free courses gain the most momentum when you partner with smaller creators who can share it as a resource with their own followers. This approach turns your content into a recommended tool rather than just another ad, which is much more effective for building trust.\n\nYou should use Mydrop to schedule short clips of your best lessons across social media to keep the momentum going. If you want to turn those students into long term leads, GoHighLevel is excellent for organizing your contacts and sending automated follow ups so you can stay focused on your next production.",
          "score": 1,
          "created_utc": "2026-01-28 21:18:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2aqaaj",
              "author": "Initial_Spend8988",
              "text": "I will definitely lookout for these tools! Thanks a lot ^^",
              "score": 1,
              "created_utc": "2026-01-28 21:57:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2m2v6y",
                  "author": "Mindless_Cow_6034",
                  "text": "no problem \\^\\^ don't hesitate to dm if you want to discuss",
                  "score": 1,
                  "created_utc": "2026-01-30 15:00:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ahz93",
          "author": "Low-Tackle7606",
          "text": "Congrats on launching! 🎉\n\nFor promoting a free course: share on social media and relevant communities, post short preview clips, use email/newsletters, and encourage reviews.\n\nKey tips: free doesn’t mean automatic traffic, feedback is gold, and a clear landing page really helps.",
          "score": 1,
          "created_utc": "2026-01-28 21:21:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr8um7",
      "title": "For those who moved from linear to self-serve DSPs, did performance or inventory actually hold up?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qr8um7/for_those_who_moved_from_linear_to_selfserve_dsps/",
      "author": "Former_Tea1131",
      "created_utc": "2026-01-30 15:39:46",
      "score": 4,
      "num_comments": 8,
      "upvote_ratio": 0.84,
      "text": "We’ve been running linear for a while now, and with self-serve DSPs becoming more accessible, I’m starting to feel the pain of the “old” CTV model. On paper, self-serve DSPs seem like the obvious fix.  But I’m still not fully convinced the CTV inventory quality and actual performance really hold up compared to linear buys. For anyone who’s made the switch from linear to self-serve DSPs, did you see any real drop (or improvement) in scale, inventory quality, or outcomes? Curious over how it's gone for others who've made the switch.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qr8um7/for_those_who_moved_from_linear_to_selfserve_dsps/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2mbg5t",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 15:39:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mjmrx",
          "author": "InevitableImpress850",
          "text": "We are testing a couple of programmatic TV ad platforms side by side. Scaling is holding technically, but its fragmented across apps and deals. Inventory quality is fine, not magical. The real win is speed: flighting, creative swaps, geo tests in days, not weeks. The real loss? Fewer premium placements and way more QA pain. You trade certainty for control, basically.",
          "score": 2,
          "created_utc": "2026-01-30 16:16:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mq2ge",
              "author": "Former_Tea1131",
              "text": "When you say QA pain, is that mostly app-level transparency and placement validation? We’re feeling that risk, but the speed upside you mention is my biggest temptation.",
              "score": 1,
              "created_utc": "2026-01-30 16:45:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2mn1kq",
          "author": "oreynolds29",
          "text": "Scale dropped initially but CPMs were way better. Took about 3 months to dial in targeting properly. ",
          "score": 1,
          "created_utc": "2026-01-30 16:31:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mq8o5",
              "author": "Former_Tea1131",
              "text": "Did you mainly fix audiences, or was it more frequency + creative tuning?",
              "score": 1,
              "created_utc": "2026-01-30 16:45:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2mnd6f",
          "author": "fave_slinger",
          "text": "Most selfserve inventory is bottomtier remnant stuff. You get what you pay for.",
          "score": 1,
          "created_utc": "2026-01-30 16:33:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mqc5k",
              "author": "Former_Tea1131",
              "text": "Fair pushback. But is it really *most* inventory, or just what surfaces without PMPs/deals?",
              "score": 1,
              "created_utc": "2026-01-30 16:46:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2x9r12",
          "author": "The-Big-Chungis",
          "text": "Been testing a few selfserve platforms lately and honestly surprised by the quality we're getting through Vibe. It's solid for our D2C campaigns so far. I know we're still early in our testing phase but we have more control than linear buys and attribution is  trackable. Looks promising.",
          "score": 1,
          "created_utc": "2026-02-01 05:36:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp8f4k",
      "title": "Digital Marketing Agency Turkey",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qp8f4k/digital_marketing_agency_turkey/",
      "author": "Jazzlike_Ad_6288",
      "created_utc": "2026-01-28 11:05:39",
      "score": 4,
      "num_comments": 6,
      "upvote_ratio": 0.84,
      "text": "I’m looking for digital marketing agencies in Turkey and would love to hear real experiences. If you’ve worked with any agencies for SEO, paid media, or full-service digital marketing, feel free to share what worked. Thanks.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qp8f4k/digital_marketing_agency_turkey/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2708w7",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 11:05:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rmsd9",
          "author": "Kkilicer2",
          "text": "For Turkey, I strongly advise Scarlet Media, especially for Paid Media Management and Performance Marketing",
          "score": 2,
          "created_utc": "2026-01-31 10:12:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e6b5c",
          "author": "GPTinker",
          "text": "Sent you a DM",
          "score": 1,
          "created_utc": "2026-01-29 11:33:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}