{
  "metadata": {
    "last_updated": "2026-01-29 09:08:23",
    "time_filter": "week",
    "subreddit": "digital_marketing",
    "total_items": 20,
    "total_comments": 175,
    "file_size_bytes": 167836
  },
  "items": [
    {
      "id": "1qp7qg5",
      "title": "What is a marketing hack that is too good to be true?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qp7qg5/what_is_a_marketing_hack_that_is_too_good_to_be/",
      "author": "StandardNecessary218",
      "created_utc": "2026-01-28 10:26:13",
      "score": 40,
      "num_comments": 20,
      "upvote_ratio": 0.97,
      "text": "I feel like most content online is super generic and in a way that makes sense because if something really works- you probably dont wanna tell this to everyone.\n\nBut every once in a while I come across I come across some tip or hack in marketing that is often too good to be true. So curious, what is a marketing hack that is too good to be true that you have come across?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qp7qg5/what_is_a_marketing_hack_that_is_too_good_to_be/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o26vo4p",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 10:26:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2827ix",
          "author": "No-Marionberry8257",
          "text": "Especially in the age of AI overview and people asking ChatGPT etc, we have found that its often as simple as doing a quick research on what questions your customers are already searching or asking these tools and just answering them on your website as blogs- ideally these are questions where your tool or business is the answer and you wanna frame it that way! Most of these are automatable using modern tools like Frizerlly that connect with your google search data as well!",
          "score": 11,
          "created_utc": "2026-01-28 14:55:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o271z7t",
          "author": "KnowledgeExciting627",
          "text": "From what I’ve seen as an intern, a lot of “marketing hacks” that sound too good to be true usually **work only in very specific contexts**, not universally.\n\nOne example is *“just go viral on social media”* or *“post consistently and the algorithm will reward you.”* In practice, consistency alone doesn’t do much if distribution, timing, audience fit, and message aren’t right. People who share these hacks often leave out the context, existing audience, budget, or prior traction.\n\nAnother one I’ve seen is *“build in public and customers will come.”* It can help with trust, but without a clear ICP and problem, it often just builds an audience of other marketers, not buyers.\n\nAs an intern, the biggest realization for me has been that real marketing isn’t about hacks, it’s about **doing unglamorous fundamentals well** (clear positioning, good copy, decent distribution) for a long time. The “hack” is usually just consistency + patience, which isn’t very sellable online.",
          "score": 2,
          "created_utc": "2026-01-28 11:19:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28qzxn",
          "author": "Puzzleheaded-Walk426",
          "text": "Stay genuine. That's the most effective marketing hack. Whether it's an ad copy, a Facebook post, or an article, stay genuine, and the audience will recognize it.",
          "score": 2,
          "created_utc": "2026-01-28 16:45:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29pfs6",
              "author": "PatchneckRed",
              "text": "Yeah, I was going to say something pretty similar to this. Like, actually sitting down to write something, to create something, and to really think about it can go such a long way.",
              "score": 1,
              "created_utc": "2026-01-28 19:14:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o287qbj",
          "author": "Prestigious-Whole544",
          "text": "Manage your budget and play the long game",
          "score": 1,
          "created_utc": "2026-01-28 15:21:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a5cv1",
          "author": "Odd-Macaroon-9528",
          "text": "Just make sure all the basics are covered properly = 80% of results",
          "score": 1,
          "created_utc": "2026-01-28 20:25:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a9s39",
          "author": "Stew_with_a_u",
          "text": "No one is sharing the real answers because we don’t want them getting out. Sorry but hacks are your IP. They matter too much to give away because once everyone does them, they stop working.",
          "score": 1,
          "created_utc": "2026-01-28 20:45:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ajfb5",
          "author": "Low-Tackle7606",
          "text": "Totally, any hack that promises instant virality or leads is usually too good to be true. Real results come from consistency, knowing your audience, and adding value. One legit “hack” that works: personalized, well-researched outreach instead of generic blasts.",
          "score": 1,
          "created_utc": "2026-01-28 21:27:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2as8sd",
          "author": "jello_house",
          "text": "reddbot sounds like one of those hacks too good to be true an ai agent that autonomously scans reddit posts and drops natural promo comments 24/7 to snag leads. straight up scales your reddit outreach without the manual grind but honestly itll flop hard if your product sucks. game changer if youre lazy smart tho",
          "score": 1,
          "created_utc": "2026-01-28 22:05:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bpdpu",
          "author": "tejones01",
          "text": "Building what I call your Brand DNA, getting your company narrative clear, and finding where your story meets your target audience. Not really a hack though.",
          "score": 1,
          "created_utc": "2026-01-29 00:52:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bqgog",
          "author": "ShallotQuirky1189",
          "text": "I use Nettmark lol, gives you pretty much everything you need. It’s more affiliate based tho but you can run ads for brands on Nettmark.",
          "score": 1,
          "created_utc": "2026-01-29 00:58:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2d3ese",
          "author": "supriya_l89",
          "text": "Most “too good to be true” marketing hacks claim they deliver quick results which require no work and which can be achieved at large scale through their single solution that doubles user engagement. The marketing process exists as a permanent establishment which requires real effort to achieve its goals. The process of achieving sustainable victories requires organizations to implement basic business practices which they must maintain through their ongoing operations. A hack becomes hype when it fails to include required background information and necessary work and all the current trade-offs.",
          "score": 1,
          "created_utc": "2026-01-29 05:52:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2de2xs",
          "author": "imnotafanofit",
          "text": "To just build in public and clients will come lol. They won’t unless you already know how to sell and position yourself.",
          "score": 1,
          "created_utc": "2026-01-29 07:20:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dj3ud",
          "author": "parkerauk",
          "text": "If you are an expert, prove it. Add 'knowsAbout' Schema to your profile and for all your iterations of the same content across the Internet use subjectOf to join it all together, adds authority. See it as endorsing backlinks.",
          "score": 1,
          "created_utc": "2026-01-29 08:04:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27iher",
          "author": "Careless-Parsnip-248",
          "text": "Honestly anything that promises fast, repeatable growth with zero tradeoffs. Stuff like “one funnel that works for every business” or “AI content that ranks on autopilot” sounds great but never holds up in real life. Every time we chased a “hack,” it worked briefly or not at all. The boring fundamentals always ended up doing more.",
          "score": 0,
          "created_utc": "2026-01-28 13:13:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnle1z",
      "title": "I analyzed 2,500+ subject lines across 12 industries. Here's what actually gets clicks in 2026",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qnle1z/i_analyzed_2500_subject_lines_across_12/",
      "author": "PuzzleheadedTalk5159",
      "created_utc": "2026-01-26 16:48:32",
      "score": 37,
      "num_comments": 15,
      "upvote_ratio": 0.93,
      "text": "I'm pretty obsessed with email marketing recently, so I decided to spend the last month digging through email data from newsletter tools, ESPs, and my own experiments, and analyzed what gets people to actually open their emails.\n\nSome of this will piss off the \"best practices\" crowd. But the data doesn't lie.\n\nHere's what I found, ranked by worst to best:\n\n(I put a lot of effort into this post, so hope you find it valuable)\n\n**10. \"Newsletter\" in the subject line** \\- Instant death. People are drowning in newsletters. Calling yours a newsletter is like wearing a sign that says \"delete me.\" The worst? \"Monthly Newsletter - \\[Month\\].\" Please, just stop.\n\n**9. All caps + excessive punctuation** \\- \"LAST CHANCE!!!\" Screams desperation. Your audience isn't deaf, they're just ignoring you. Also spam filters absolutely hate this.\n\n**8. Generic promotional language** \\- \"Special offer inside\" or \"Exclusive deal for you.\" Everyone says it's exclusive. Nobody believes you anymore. These worked in 2019. It's 2026. Move on.\n\n**7. Overly clever/cryptic lines** \\- \"You won't believe what happened...\" Clickbait works on Facebook. Email audiences are smarter and more annoyed. They want value, not mystery.\n\n**6. Emoji-heavy subject lines** \\- Controversial take: emojis work, but MAX one per subject line. More than that and you look like a 14-year-old's text message. One well-placed emoji? Chef's kiss. Three fire emojis? Trash.\n\n**5. Question-based subject lines** \\- \"Are you making this mistake?\" Better than clickbait but still pretty meh. Works better in B2B than B2C. Needs to be hyper-specific to actually work.\n\n**4. Personalization (first name)** \\- \"Hey \\[Name\\], check this out.\" Works, but it's baseline now. Everyone does it. You're not special for using merge tags. Better than nothing though.\n\n**3. Time-sensitive + specific** \\- \"48 hours left: \\[specific thing\\].\" Creates urgency without being scammy. Key word: SPECIFIC. \"48 hours left\" alone doesn't work. Tell them what they're actually missing.\n\n**2. Ultra-specific value proposition** \\- \"How \\[Company\\] grew to $10M with email\". Pure value. Tell them exactly what's inside and why they should care. Funny thing - long subject lines (10-15 words) actually performed better here. All that \"keep it short\" advice? Not always true.\n\n**1. Plain, conversational, from a person** \\- \"Question for \\[name\\]\" or \"great business advice\" Why? It doesn't look like marketing. It looks like an email from a human. The best performing emails in my analysis looked like they came from a coworker, not a brand. Wild, right?\n\n**The stuff that actually matters:**\n\n* Shorter is NOT always better - 6-10 word subject lines performed best overall, but context matters way more than length\n* Mobile preview text is criminally underused - 70% of emails are opened on mobile. USE THAT SPACE.\n* Industry matters more than you think - What works in SaaS dies in e-commerce. Test your own audience.\n\nThe biggest lesson? Stop trying to \"hack\" opens. Write subject lines like you're emailing a friend. \n\nWhat's working for you? Genuinely curious what I'm missing here.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qnle1z/i_analyzed_2500_subject_lines_across_12/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1uigbt",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 16:48:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yh0jf",
          "author": "anajli01",
          "text": "This lines up hard with what we’re seeing.\n\nThe “from a person” insight is the big one once a subject line looks like marketing, the open is already dead. The best performers we’ve tested could literally pass as internal emails.\n\nAlso +1 on longer, ultra-specific lines. Clarity > cleverness every time.\n\nThe most underrated lever IMO: preview text. When subject + preview read like a single human sentence, opens jump.\n\nCurious if you noticed differences by audience maturity cold vs warm lists behave *very* differently here.",
          "score": 3,
          "created_utc": "2026-01-27 04:13:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1yqfp9",
              "author": "PuzzleheadedTalk5159",
              "text": "Oh yeah 100%, it's key to adabt based on your audience.\n\nIt's really all about testing a lot at this point. What's working with one audience might not work with the other, so it's crucial to test a lot and adapt.\n\nWhat do you think? Curious to hear your opinion",
              "score": 1,
              "created_utc": "2026-01-27 05:15:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1wcia9",
          "author": "debarn",
          "text": "Thanks for sharing this very insightful! \n\n\nI also became somewhat obsessed with email marketing recently, especially that I do B2B biz dev, so gotta try a tons of different things, and I must say that the simpler ones increased my open rate, and some event reply rate.\n\n\nStill WIP but this post may help me refine it even further.\n\n\nSo - cheers, great work! :)",
          "score": 2,
          "created_utc": "2026-01-26 21:34:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1wlmld",
              "author": "PuzzleheadedTalk5159",
              "text": "I appreciate the feedback!",
              "score": 1,
              "created_utc": "2026-01-26 22:15:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o25votf",
          "author": "KONPARE",
          "text": "This tracks with what I’ve seen too, especially the “looks like a human wrote it” part. The plain, boring subjects that feel almost accidental consistently beat anything polished or clever for me. The preview text point is huge as well, most teams still treat it like an afterthought when it’s basically a second subject line on mobile.\n\nOne thing I’d add: sender name matters more than people admit. A real person vs a brand name can swing opens a lot. Solid breakdown overall.",
          "score": 2,
          "created_utc": "2026-01-28 05:20:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26c4h4",
              "author": "PuzzleheadedTalk5159",
              "text": "100%, sender name is a key part here",
              "score": 1,
              "created_utc": "2026-01-28 07:28:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o26ihdo",
          "author": "Mrqzz",
          "text": "Interesting analysis",
          "score": 2,
          "created_utc": "2026-01-28 08:24:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27t6tm",
              "author": "PuzzleheadedTalk5159",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-01-28 14:11:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1wm2ii",
          "author": "abcdsjcbdisicbd",
          "text": "Great work! I feel like the short and human once are always the best performing (just from my experience). Really dependes on the niche ofc",
          "score": 1,
          "created_utc": "2026-01-26 22:17:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1wmnrg",
              "author": "PuzzleheadedTalk5159",
              "text": "Thanks! Yeah I agree 100%",
              "score": 1,
              "created_utc": "2026-01-26 22:20:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1ys4n7",
                  "author": "abcdsjcbdisicbd",
                  "text": "Glad to hear that!",
                  "score": 1,
                  "created_utc": "2026-01-27 05:27:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o24zd2y",
          "author": "elzubeir",
          "text": "This list makes no sense. I call bs.",
          "score": 1,
          "created_utc": "2026-01-28 02:12:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qknyd4",
      "title": "How to have a consistent brand voice when you are working with clients in different regions?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qknyd4/how_to_have_a_consistent_brand_voice_when_you_are/",
      "author": "absolutely_gorjas",
      "created_utc": "2026-01-23 11:05:20",
      "score": 22,
      "num_comments": 15,
      "upvote_ratio": 1.0,
      "text": "Our team has grown a ton over the past year, and we now have multiple teams across the US, along with contractors and clients in different countries.\n\nWhile we have some pretty clear brand guidelines, it's been tricky when we get to working across cultures and languages. Even just sticking within the US, it seems clients in the south have wildly different expectations from clients in the northeast or the PNW. It gets even more complicated when we add in having to get approvals from managers and clients. So, I'm wondering how everyone else is handling this as you scale. Do you have a dedicated brand team, do you employ Al checks, are you manually reviewing everything?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qknyd4/how_to_have_a_consistent_brand_voice_when_you_are/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o17vhzh",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 11:05:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o183slh",
          "author": "screechymeechydoodle",
          "text": "We used to just trust everyone was trained on our branding and following the rules, but that got messy after a while. Now we have a dedicated branding team, locked assets and templates, and we’ve recently started using AI as an extra measure to look for things we might miss manually. We have a brand voice checklist, and that’s helped a lot of our writers and designers. That way nothing is up for interpretation, it’s all laid out.",
          "score": 10,
          "created_utc": "2026-01-23 12:09:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o189jpn",
              "author": "Notorious_Insanity",
              "text": "i feel this, we have too many people creating content now to just trust they'll adhere to brand guidelines. Once we revamped our approval workflow it made things a lot easier. We're now using a digital asset management system\nthat keeps everything in one place and prevents people from pulling outdated assets or the wrong variations of things (we have slight differences in our internal and external branding communications and some teams would mix them up).",
              "score": 1,
              "created_utc": "2026-01-23 12:48:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o18fq0y",
                  "author": "absolutely_gorjas",
                  "text": "Seems like I've found my people, bc this is exactly what my team has been dealing with. We were talking about making the switch to a DAM, as we currently use google drive for everything, which isn't always the best for organization purposes. But I'm so nervous of making the switch. Can I ask which DAM you use, and do you like it?",
                  "score": 1,
                  "created_utc": "2026-01-23 13:25:33",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1ap6ye",
          "author": "elzubeir",
          "text": "I've experienced this as well and we decided that our company culture supersedes locale. I did not think this would work when we did it, but it created a stronger brand. Everyone outside of the company knew that this business operated with a standard (whatever the standard you choose).",
          "score": 1,
          "created_utc": "2026-01-23 19:49:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1b52z6",
          "author": "KNVRT_AI",
          "text": "Brand voice consistency at scale requires both guidelines and governance, not just documentation.\n\nClear guidelines need to include not just tone and style but how to adapt for regional or cultural differences without losing core identity.\n\nRegional adaptation is necessary. Define what's non negotiable, core values, personality, key messages, versus what's flexible, word choice, cultural references, tone adjustments.\n\nDedicated brand team or steward reviews high visibility content, trains regional teams, provides feedback. Without ownership, consistency erodes.\n\nTemplates and approved messaging banks give teams starting points. Pre approved phrases reduce drift.\n\nTraining matters more than tools. Regular workshops with regional teams on brand voice, examples of good and bad, Q and A on edge cases.\n\nAI checks flag obvious deviations but aren't sophisticated enough for nuanced brand voice. Use for basic consistency, not final approval.\n\nManual review for important or client facing content is unavoidable. High stakes work gets human eyes from someone who understands the brand.\n\nApproval workflows slow things but ensure quality. Balance speed with risk, templates get less review, custom work gets more.\n\nOur clients scaling successfully centralize strategy and guidelines while decentralizing execution. Regional teams have autonomy within guardrails, escalate when unsure.\n\nUS regional differences are real but often overstated. Your brand voice should work everywhere with minor tweaks. If it requires total rewrites by region, core voice might be too narrow.\n\nFor international work, hire local copywriters who understand cultural context. Direct translation fails. Transcreation, adapting message while maintaining intent, works.\n\nFeedback loops where regional teams share what's working helps everyone learn. Monthly syncs reviewing examples and common mistakes.\n\nBigger you scale, more important onboarding and training become. New team members absorb brand voice through immersion, examples, practice, feedback, not just reading a guide.\n\nAccept some inconsistency is inevitable. Perfection doesn't scale. Keep core consistent, forgive minor variations at edges.\n\nInvest in brand stewardship as you grow. It's protecting one of your most valuable assets.",
          "score": 1,
          "created_utc": "2026-01-23 21:04:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1d9r5x",
          "author": "anajli01",
          "text": "We solved this by separating **core voice** from **regional expression**.\n\nThe voice (values, POV, words we always/never use) stays global. The tone and style flex by region and client. Guidelines alone aren’t enough examples matter.\n\nWe use a short voice playbook + regional samples, with a light final review and AI only for consistency checks, not decisions.",
          "score": 1,
          "created_utc": "2026-01-24 04:00:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ebowy",
          "author": "Legitimate-Hat-4333",
          "text": "Have a clear core voice (values,tone,personality) that never changes - then flex the expression, not the identity. Adapt language, references and cultural nuisances for each region, but keep the same beliefs and intent.",
          "score": 1,
          "created_utc": "2026-01-24 09:03:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ruqk4",
          "author": "supriya_l89",
          "text": "The establishment of consistent voice patterns requires organizations to follow their core principles instead of relying on fixed regulations. The establishment of non-negotiable traits requires organizations to select specific tone and values and words to avoid while allowing them to adapt their style according to different locations. A lightweight brand council operates in most teams together with their final reviewer who uses shared market content examples to identify \"good\" material. The implementation of AI checks enables organizations to detect inconsistencies yet human examination remains essential particularly for cross-cultural situations.",
          "score": 1,
          "created_utc": "2026-01-26 06:18:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ulqi2",
          "author": "bob_builds_stuff",
          "text": "One thing that's helped us scale brand voice checks is focusing heavily on \"negative rules\" - what NOT to say.\n\nMost brand guidelines are aspirational (\"be friendly,\" \"sound confident\"), which is hard to validate programmatically. But listing out specific things to avoid - banned phrases, competitor mentions, jargon to skip, words that don't fit your tone - is much easier to check automatically.\n\nSome concrete examples that work well for AI checks:\n- Banned phrases (\"I'd be happy to help,\" \"please don't hesitate\")\n- Forbidden terminology (competitor names, outdated product names)\n- Tone violations (\"actually,\" passive voice overuse)\n- Formatting rules (excessive exclamation points, ALL CAPS)\n\nThe positive stuff (\"warm but professional\") still needs human judgment, but catching 80% of the obvious violations automatically frees up your reviewers to focus on the nuanced regional/cultural questions you mentioned.\n\nAlso worth having a running doc of \"things that got flagged in reviews\" - turns institutional knowledge into enforceable rules over time.",
          "score": 1,
          "created_utc": "2026-01-26 17:02:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26pdop",
          "author": "Afraid-Wrongdoer-551",
          "text": "You can try automated guidelines — define your voice and style using rules (what to say, what not to say and HOW to say it), share it with your team, and they can run automated check of their text, insuring compliance. Acrolynx is an old tool for that, you can try Writitude com which is also much more affordable.",
          "score": 1,
          "created_utc": "2026-01-28 09:29:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27sdpt",
          "author": "Objective_Bed6554",
          "text": "This is such a real problem. Not to pitch too hard but as a former CMO I used to have the same problem. Worse, some people would use either outdated or completely ignore the brand book.\nI built Robynn AI where you can build a brand book and have different styles, then your agents constantly use these for all your marketing tasks and collateral irrespective of who uses them which means you have consistency across your brand marketing.",
          "score": 1,
          "created_utc": "2026-01-28 14:06:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qn8leb",
      "title": "Hired an influencer agency and it was the most expensive lesson of my career",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qn8leb/hired_an_influencer_agency_and_it_was_the_most/",
      "author": "True-Sherbet-1443",
      "created_utc": "2026-01-26 06:38:58",
      "score": 19,
      "num_comments": 24,
      "upvote_ratio": 0.85,
      "text": "\n\n$8k/month for six months. $48k total. Results barely better than what I couldve done myself for maybe $5k.\n\nWhat we got: monthly \"strategy calls\" that were status updates. Creator recommendations that were obviously whoever was easiest to book. Reports that were templates with our numbers filled in. Campaign management that was basically forwarding emails.\n\nWhat we didnt get: actual strategic thinking. Creators matched to our audience. Any optimization. Transparency on margins.\n\nNot saying all agencies are bad but the structure is broken. They get paid regardless of results. Theyre spread across a dozen clients.\n\nWe dropped them. Brought it in house. Results improved. Costs dropped 60%.\n\nAnyone else have horror stories or am I just unlucky?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qn8leb/hired_an_influencer_agency_and_it_was_the_most/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1rxcm5",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 06:38:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o221gt7",
          "author": "Few_Economist_3658",
          "text": "There are a few lessons that I picked up:\n\n1. Always read through agency contracts to ensure there is a clause that protects you.\n\n2. Get examples of past work or case studies that are in industries related to your brand.\n\n3. Share what success looks like for an influencer campaign, or any campaign for that matter, based on the KPIs you've set internally.\n\n4. Ensure there is a multichannel strategy. Great marketing isn't achieved in a vacuum.",
          "score": 12,
          "created_utc": "2026-01-27 17:54:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1s3xq7",
          "author": "callmegg71",
          "text": "Kudos to you: you learned a new skill. Next time you will study first and delegate later eventually",
          "score": 11,
          "created_utc": "2026-01-26 07:32:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sddw2",
          "author": "hui_hui_95",
          "text": "the reporting thing is so real. these beautiful PDFs that said nothing useful. vanity metrics everywhere. no actual insight into what worked",
          "score": 7,
          "created_utc": "2026-01-26 08:56:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o23af70",
              "author": "Projectfluid",
              "text": "Ugghh. I hate those type of reports. I had to make them at the last agency I worked at and always found them so full of shit...",
              "score": 1,
              "created_utc": "2026-01-27 21:11:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1srz9r",
          "author": "Ok-Function5949",
          "text": "If they were so dreadful why did you keep them for so long? I’m asking genuinely and not trying to be a clever clogs…. Could you not exit the contract before 6 months? What KPIs did you set ? Anything you can claw back?",
          "score": 8,
          "created_utc": "2026-01-26 11:07:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1tzcc7",
              "author": "portrayaloflife",
              "text": "Assuming it was contractual",
              "score": 2,
              "created_utc": "2026-01-26 15:26:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1sdo6w",
          "author": "yummytoesmmmm",
          "text": "not just you. almost identical experience. agency promised \"full service\" but sent a list of creators they already knew regardless of fit. zero customization",
          "score": 7,
          "created_utc": "2026-01-26 08:58:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vadxu",
          "author": "Bear-back9044",
          "text": "Name and shame!",
          "score": 7,
          "created_utc": "2026-01-26 18:47:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1vbpza",
              "author": "fatman2442",
              "text": "Had a similarly worse situation using grapevine but that was 6-7 years ago. 20k down the drain zero value",
              "score": 1,
              "created_utc": "2026-01-26 18:53:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1vgxz3",
                  "author": "Bear-back9044",
                  "text": "Shame :( sorry hunny. Too many scamfluencers neh.",
                  "score": 1,
                  "created_utc": "2026-01-26 19:15:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1u32nm",
          "author": "Careful-Election9957",
          "text": "exact same. went in house using upfluence and one person. costs dropped by more than half and ROAS went up. turns out knowing your own brand matters more than whatever \"expertise\" agencies claim",
          "score": 5,
          "created_utc": "2026-01-26 15:42:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24zybz",
          "author": "elzubeir",
          "text": "This is pretty much how every marketing agency will run an account like yours. They templatize everything and if you're lucky one of the 4-5 people you interact with is actually interested in their job.\n\nWhen it comes to marketing agencies, unless you are a high ticket customer to them, it's better if you don't engage.",
          "score": 6,
          "created_utc": "2026-01-28 02:15:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sqlq8",
          "author": "SmallIntroduction345",
          "text": "Having worked with many startups as a Product Marketer and in my own startup, I can 💯 relate. Same old story. Free upfront gifting, overly scripted inauthentic content, next week same influencer is spruiking a competitor, and business end up with no assets they own to repurpose. Unfortunately it’s a common story 😢",
          "score": 4,
          "created_utc": "2026-01-26 10:55:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1u8i5t",
          "author": "Sensitive-Mixture663",
          "text": "This looks similar to another LLM spam post - someone’s gonna comment soon recommending a specific company as the solution…",
          "score": 4,
          "created_utc": "2026-01-26 16:06:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1wnqom",
              "author": "Agile-Duck8979",
              "text": "This forum has become all spam it’s such a shame",
              "score": 2,
              "created_utc": "2026-01-26 22:25:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1s28p3",
          "author": "The-Big-Chungis",
          "text": "No one else can care for your results as much as you can. In-house can well manage influencer partnerships,",
          "score": 4,
          "created_utc": "2026-01-26 07:18:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tmh8i",
          "author": "Sarthak999gupta",
          "text": "What was your in-house and agency CPM?",
          "score": 2,
          "created_utc": "2026-01-26 14:24:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v6b65",
          "author": "iamgoaty",
          "text": "Which agency?",
          "score": 2,
          "created_utc": "2026-01-26 18:30:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qom1lf",
      "title": "Need advice on best practices for syncing email marketing data with crm",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qom1lf/need_advice_on_best_practices_for_syncing_email/",
      "author": "Just-Maximum-5679",
      "created_utc": "2026-01-27 18:26:07",
      "score": 15,
      "num_comments": 19,
      "upvote_ratio": 0.95,
      "text": "Running into some friction trying to get our email campaigns to play nice with our crm system. Currently manually updating lead scores and campaign responses which is eating up way too much time.\n\nIs there a smooth workflows for automatically pushing email engagement data back into crm.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qom1lf/need_advice_on_best_practices_for_syncing_email/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o22915i",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 18:26:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22dem0",
          "author": "Nastya_Tan",
          "text": "Def you need to tighten up automations and scoring rules. For us, the trick was making email engagement update fields that sales look at, not just activity logs. Some crms handle this cleaner than others, we’re on monday crm and use native automations plus a lightweight email integration to push clicks/replies into lead scores automatically. It’s not magic, but once set up, it killed the manual updates. Also, align marketing and sales definitions first, then automate. Otherwise you’re just syncing chaos faster.",
          "score": 2,
          "created_utc": "2026-01-27 18:44:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22i50j",
              "author": "Just-Maximum-5679",
              "text": "That looks like a good process. We have done the alignment part, just need to follow through.",
              "score": 1,
              "created_utc": "2026-01-27 19:04:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22b2ne",
          "author": "TurnoverEmergency352",
          "text": "First, define what engagement actually matters first. Opens/clicks mean nothing if sales doesn’t trust the score anyway.",
          "score": 1,
          "created_utc": "2026-01-27 18:34:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22hokc",
              "author": "Just-Maximum-5679",
              "text": "I can say we're past that stage",
              "score": 1,
              "created_utc": "2026-01-27 19:02:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22cmqd",
          "author": "Physical-Radio-8769",
          "text": "This is usually less about email tools and more about workflow design. You want triggers that update lead status automatically, not just dump raw metrics. We mapped engagement to action (MQL, task, follow-up) and friction dropped a lot. If reps still have to “interpret” data manually, the sync isn’t doing its job.",
          "score": 1,
          "created_utc": "2026-01-27 18:41:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22hvvj",
              "author": "Just-Maximum-5679",
              "text": "thank you for pointing out the aspect of process over tools. Spot on.",
              "score": 1,
              "created_utc": "2026-01-27 19:03:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22es69",
          "author": "crazyreaper12",
          "text": "Rule of thumb: stop syncing everything. Only push meaningful events (clicks, replies, conversions) into the crm. Otherwise you end up with noisy data no one uses and dashboards everyone ignores.",
          "score": 1,
          "created_utc": "2026-01-27 18:50:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22iagz",
              "author": "Just-Maximum-5679",
              "text": "I know the chaos of tracking and syncing everything trackable",
              "score": 1,
              "created_utc": "2026-01-27 19:05:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22jjni",
          "author": "Numerous-Movie3107",
          "text": "Honestly sounds like an integration problem, not a best practices one. Manual updates means something’s broken.",
          "score": 1,
          "created_utc": "2026-01-27 19:10:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22vumw",
          "author": "No_Hedgehog8091",
          "text": "Set up webhook triggers for opens, clicks, and replies to push real-time data into your CRM via API.\n\nMap engagement events to lead score increments (open +5, click +10, reply +20).\n\nUse engagement thresholds to auto-tag leads as hot, warm, or cold.\n\nThis cut our manual work by 80% and improved response time to hot leads.",
          "score": 1,
          "created_utc": "2026-01-27 20:05:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22xf9d",
          "author": "boundlessmedia",
          "text": "Been there. Manual updates are a time suck.\n\nWhat’s worked for me: make the CRM the source of truth for lead score, then have your email tool push events to it. Use the native integration if it exists. If not, use Zapier or Make with webhooks to send opens, clicks, unsubscribes, and bounces as activities, and increment a single Engagement Score field. Add UTM tags and a campaign ID to every link so the CRM can tie activity to the right campaign. Match on email plus a contact ID if you have one to avoid dupes. Do a one-time backfill, then switch to real time. We’ve done this for landscapers and turf shops and it’s smooth once naming and fields are set. Seen the same at Boundless Media, but you can totally DIY this.",
          "score": 1,
          "created_utc": "2026-01-27 20:12:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25vi3r",
          "author": "DigitalHarbor_Ease",
          "text": "Manually updating lead scores and campaign responses is such a time sink.\n\nBest bet: use your email tool’s **native CRM integration**, or hook them up via **Zapier/Integromat** so opens, clicks, and replies flow automatically. APIs work too if you want more control.\n\nStart small, keep data clean, then expand. Makes life way easie",
          "score": 1,
          "created_utc": "2026-01-28 05:19:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28dx9s",
          "author": "QuimbyDigital",
          "text": "Most email tools have native CRM integrations now. Mailchimp + HubSpot, Active Campaign syncs automatically. Set up Zapier if yours don't connect directly takes like 20 min to build. Way better than manual updates honestly.",
          "score": 1,
          "created_utc": "2026-01-28 15:49:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dobdl",
          "author": "ContextFirm981",
          "text": "I’d set up native integrations or a tool like Zapier/Make so your email platform automatically pushes opens, clicks, and tag/segment changes into your CRM, then use those fields to drive lead scoring rules instead of doing manual updates.",
          "score": 1,
          "created_utc": "2026-01-29 08:53:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq2b70",
      "title": "Why you are equally at fault as your marketing agency for failing ad campaigns",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qq2b70/why_you_are_equally_at_fault_as_your_marketing/",
      "author": "Middle_Lavishness137",
      "created_utc": "2026-01-29 07:44:08",
      "score": 14,
      "num_comments": 2,
      "upvote_ratio": 0.86,
      "text": "I have seen many people ask Meta Ad or Google Ads, but they don’t pay attention to the fact that their medium isn’t as big of as a deal as their marketing agency. I am not personally attacking anyone but many are simply burning their money by not intervening and questioning their marketing agency enough. I have many clients whose trust has been eroded by scammy marketing agency and I tell them, why did you let this happen? Their answer is always the same. They were oblivious. So, here are a few of my tips that everyone should use if they think their marketing agency is not doing their job.  \n  \n1. The \"Platform Trap\"Google and Meta are designed to make you spend. Their \"Auto-Apply\" recommendations are often biased toward their revenue, not your ROI. A great agency acts as a filter, knowing when to lean into the machine and when to take back the wheel\n\n.2. Creative is the New Targeting-As privacy laws and \"cookie-less\" tracking have leveled the playing field, your creative is what does the heavy lifting. If your agency isn't using data-backed storytelling, they’re just guessing.\n\n3. The Shift to \"Agentic\" Execution-The best agencies have stopped doing manual, repetitive \"button-clicking.\" They are now leveraging autonomous AI tools to handle the grunt work. By integrating stacks like Blobr AI or Ryze AI, agencies can run 24/7 audits and creative swaps that a human simply can’t keep up with.\n\nNext time, ask the important questions. It pains me to see us marketing agencies get a horrible reputation just because of a few sour apples.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qq2b70/why_you_are_equally_at_fault_as_your_marketing/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2dgqnu",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 07:44:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmb0t0",
      "title": "Has DIY marketing replaced agencies?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qmb0t0/has_diy_marketing_replaced_agencies/",
      "author": "JohnWob",
      "created_utc": "2026-01-25 06:02:09",
      "score": 12,
      "num_comments": 19,
      "upvote_ratio": 0.88,
      "text": "I've lost quite a few clients over the past couple years with the rise of AI. Finding a lot of clients or potential clients doing diy methods of marketing wether it's through saas plarforms or using AI for content on their site.\n\nHave you guys noticed this when trying to convert leads? That they'd prefer doing it themselves?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qmb0t0/has_diy_marketing_replaced_agencies/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1kly32",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-25 06:02:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1kqv1s",
          "author": "hirschy75",
          "text": "No.",
          "score": 9,
          "created_utc": "2026-01-25 06:40:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1kr8xa",
          "author": "New_Criticism4996",
          "text": "They think it has but there's a reasons agencies exist.\n\nI just took over a meta account. The were sending people who clicked on the add to meta... meta users would see a meta ad and get redirected to meta. All paid for buy the advertiser.\n\n$600/mo down the drain. \n\nDIY only works if you know enough of what you are to get good enough results and have the time. In reality thats 5% of businesses.",
          "score": 7,
          "created_utc": "2026-01-25 06:43:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1lzo2f",
          "author": "bialettibrewmaster",
          "text": "We’re using an “agency” based in SE ASIA.  They are clearly some sort of weird farm AI’ing shit, literal shit. It’s more than a language barrier or cultural barrier. Should be pay8ng me more because the crap they produce is unusable. Keywords are truly fucked up. Copy is kindly written in English and makes no sense along with lack of grammar. Imagery is off-concept. Turn around times is 2-3wks.\nI would never recommend going cheap and hiring any agency in SE ASIA unless you are in SE ASIA and your business is there. My org doubled-down on cheap- outsource to SE ASIA and heavy AI usage.\n\nI realize this is off topic. I needed to vent on this weird convergence of cheap human labor combined with AIing digital marketing.",
          "score": 2,
          "created_utc": "2026-01-25 12:58:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1nbjzc",
          "author": "hddjdjjdjd",
          "text": "Not at all. Many will try, and then fail and go back to agencies.",
          "score": 2,
          "created_utc": "2026-01-25 16:58:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rwv3l",
          "author": "Just_Use8502",
          "text": "yeah it's definitely happening but the lower end is going DIY hard\n\ntools like creatify, canva, chatgpt make it easy for small businesses to handle basics themselves. they were never gonna pay agency rates long term anyway\n\nbut clients who need actual strategy, positioning, or complex campaigns still need agencies. AI can pump out content but it can't fix a broken funnel or figure out messaging\n\nthe middle is getting squeezed though. if you're just doing execution without strategic value you're probably cooked\n\nwhat kind of clients did you lose? small businesses or bigger brands?",
          "score": 2,
          "created_utc": "2026-01-26 06:35:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ktytl",
          "author": "abralytics",
          "text": "DIY is like cutting their own hair instead of a barber.",
          "score": 2,
          "created_utc": "2026-01-25 07:05:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1lvpt2",
              "author": "emmasexytime",
              "text": "Yes but budget is budget :)  hehe",
              "score": 1,
              "created_utc": "2026-01-25 12:30:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1lskhx",
          "author": "drteq",
          "text": "Mainly the economy forced many small businesses to cut their budget and try to survive",
          "score": 1,
          "created_utc": "2026-01-25 12:05:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1lvnpw",
          "author": "emmasexytime",
          "text": "Yes AI especially has helped those DIY. <3",
          "score": 1,
          "created_utc": "2026-01-25 12:29:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1q4etu",
          "author": "BlueGridMedia",
          "text": "AI can help but most owners dont have the time to optimize the ad accounts themselves",
          "score": 1,
          "created_utc": "2026-01-26 00:21:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1twv19",
          "author": "CranberryOk945",
          "text": "I am on the other side as a copywriter but in recent year some clients are coming in with this absurd,but very long critique ,like \"rewrite it all to be more x and add H1( I asked : H1 what? There is clearly a h1 header here, it's first time in 15 years someone wants me to write \"H1\" on top of the article?\"  and we waste like an hour to talk it through, and in the end they see it is not improving seo, its wasting everyone's time, but the hour of my life us gone. And I am sure they don't use chatGPT only for useless copywriting critique but generally they tinker they SEO knowing nothing!😬",
          "score": 1,
          "created_utc": "2026-01-26 15:14:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v0r8x",
          "author": "Kml777",
          "text": "Yes, it's true. AI has developed so vastly and is still developing in fast pace, that you can use them by your own. AI applications are solving the toughest part that is called execution. Now, with the help of AI, execution becomes very easy for everyone. Like - I am from AI ugc. Creators can cost you $500+, and content delivery will be more than 3 weeks. Now?? What should I do when I have no patience? Here, AI solved this problem. Quick + Cost-effective, content can be scaled. No need for core AI knowledge; anyone can generate. Just a DIY.\n\nIn the upcoming 2 to 3 years, the scenario will be very different in the AI space.",
          "score": 1,
          "created_utc": "2026-01-26 18:07:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20d7jb",
          "author": "Due-Tomatillo-8848",
          "text": "It certainly feels like AI is impacting agencies as we are constantly seeing social media posts and reels, telling our clients and potential clients that marketing can be done for $9.99 pcm using AI.\n\nAI should compliment the work done by agencies not replace them.",
          "score": 1,
          "created_utc": "2026-01-27 13:13:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1kynxv",
          "author": "Aunker",
          "text": "Yeah, I’m seeing that a lot. AI didn’t kill demand, it changed what people think they’re buying. They don’t want marketing help anymore, they want outcomes and someone to own the messy parts they still can’t DIY: strategy, tracking, creative testing, conversion, and consistency. Most DIY people aren’t saying no forever. They’re saying not yet. They try it, get mediocre results, then come back when they realize tools don’t equal growth. What works now is leading with one clear fix, not a full service pitch. Audit one thing, show the gap, give a tight plan, and let results sell the next step. What’s the main service you sell right now, ads, SEO, or full stack marketing?",
          "score": 1,
          "created_utc": "2026-01-25 07:44:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qk777o",
      "title": "Pricing is awkward conversation",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qk777o/pricing_is_awkward_conversation/",
      "author": "Affectionate-Sky-74",
      "created_utc": "2026-01-22 21:21:45",
      "score": 12,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "As a marketing consultant, do you find it awkward talking about price once you had a conversation with a potential client? How many actually say il send you a price through email later or do you give one on the spot.   \n  \nWhat does your workflow look like. would be really helpful to understand ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qk777o/pricing_is_awkward_conversation/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o14dbx3",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-22 21:21:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16hey4",
          "author": "thesinnedknight",
          "text": "I am very upfront with my pricing.  People weed themselves out, that way.",
          "score": 4,
          "created_utc": "2026-01-23 04:13:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17v15q",
              "author": "Affectionate-Sky-74",
              "text": "Brilliant. You know your worth and pricing doesn't need to be negotiable when value is apparent",
              "score": 1,
              "created_utc": "2026-01-23 11:01:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o14hw40",
          "author": "JazzFestFreak",
          "text": "Only when it to potential clients that can’t afford it",
          "score": 3,
          "created_utc": "2026-01-22 21:43:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15vz1d",
          "author": "MissionCaramel755",
          "text": "In my experience it all depends on the situation and also what kind of client it is. \nIf we are having a good understanding of the process and client has patience of getting a proposal with road map after couple of meetings then I try to keep it in mail.\nBut on the other hand I have had clients or prospects who starts from the pricing, I try and take the conversation  forward as much as I can and in some cases I have to tell the price in meeting itself.  . . But I try to keep the price higher because I feel that they will negotiate and I'll have to bring down to actual cost.",
          "score": 1,
          "created_utc": "2026-01-23 02:11:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o162tkh",
          "author": "christopherelang",
          "text": "Just show value, and give them the price right there on the call. That allows you to provide clarity on anything they may be unsure of right away without all the back and forth. They’ll either move forward or they won’t. The only reason to feel awkward about pricing conversations is if you yourself are unsure of the value you bring.",
          "score": 1,
          "created_utc": "2026-01-23 02:48:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o188ehj",
              "author": "christopherelang",
              "text": "I craft a few different offers. One of them is my core offer, one is a step above that and one below. That’s it. I make sure there is inherent value in each of my offers and based on how the call goes, I qualify them to one of my specific offers.  No cookie cutter nonsense or custom packages. \n\nMost importantly, my price is non negotiable and never discounted. I’ll work with a client on the best way for them to pay, be it all up front which is my default, or split it into 2 or 3 payments, but that’s about it. \n\nYour job is to identify the pain/problem you’re solving, make them understand that your offer solves that problem, and make them understand the cost of NOT solving that problem. If they understand that, they’ll find a way to get you your money.",
              "score": 2,
              "created_utc": "2026-01-23 12:41:19",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o17v8k5",
              "author": "Affectionate-Sky-74",
              "text": "Agree. How do you currently create pricing for new clients? Do you use templates, build custom each time or use specific software?",
              "score": 1,
              "created_utc": "2026-01-23 11:03:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o16z8f3",
          "author": "tsukihi3",
          "text": "> do you find it awkward talking about price once you had a conversation with a potential client?\n\nYes, because I'm not a salesman. I'm not really good with the selling process, but I do it because I got to put food on the plate. \n\nI don't have many clients so I don't get to practice a sales pitch, but that's been working for me so far thankfully.\n\nI have established a tiered pricing that works for me, and I have enough experience to know about how long something is going to take me, so I can just provide a range on the spot with a more formal confirmation later by email once I have all the detail.",
          "score": 1,
          "created_utc": "2026-01-23 06:18:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17uw5h",
              "author": "Affectionate-Sky-74",
              "text": "I get what you mean, I realised many dont get the most out their service because of this fear. Sometimes it's probably better to say this is my price take it or leave it. But I get you end of the day you still need to put food on the table",
              "score": 1,
              "created_utc": "2026-01-23 11:00:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1cstps",
                  "author": "tsukihi3",
                  "text": "imho, those who fear paying aren't worth working with. \n\nMy pricing is very reasonable considering my experience and skills, and if someone's pricing themselves out, I'm fine with that. I'm not chasing the sale since I'm a one-man operation.\n\nNegociating price today will probably mean being a pain later down the line.",
                  "score": 1,
                  "created_utc": "2026-01-24 02:18:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1g0hpl",
          "author": "bones605",
          "text": "No price on the call...it's too complex to figure out on the spot unless it's a cookie cutter/package service. But give a range on the call to set expectations...if they flinch then you've saved yourself any more wasted time. If not then follow up with a well thought out proposal (short and sweet but addressing exactly what they are looking for). Always at least 2 options...the one you'd be happy for them to choose and a better (more expensive) one. Never just a single option, otherwise you're putting a gun to their head...choose this or go away.  When maybe they would have moved forward had you offered another option that made your original one look like a steal.",
          "score": 1,
          "created_utc": "2026-01-24 16:02:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1hmymx",
              "author": "Affectionate-Sky-74",
              "text": "Great insight thanks. How do you currently create pricing for new clients? Do you use templates, build custom each time or use specific software?",
              "score": 1,
              "created_utc": "2026-01-24 20:20:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qpm4m6",
      "title": "My emails landed in spam for over a year straight. Here's how I fixed that",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qpm4m6/my_emails_landed_in_spam_for_over_a_year_straight/",
      "author": "PuzzleheadedTalk5159",
      "created_utc": "2026-01-28 19:57:16",
      "score": 12,
      "num_comments": 13,
      "upvote_ratio": 0.94,
      "text": "I'm pretty obsessed with email marketing so watching my emails go straight to spam was absolutely soul crushing. Open rates under 5%. Complaints through the roof. Gmail basically blacklisted me.\n\nSpent hundreds of hours and way too much money figuring this out (most of the \"expert advice\" online is completely useless). But I think I finally cracked it.\n\nHere's what I found, ranked from least to most impactful:\n\n**10. Removing spam trigger words** \\- Everyone says \"avoid FREE and URGENT.\" Did almost nothing. Removed every \"trigger word\" and still landed in spam. This advice is from 2015 and spam filters are way smarter now. Don't waste your time obsessing over this.\n\n**9. Adding a physical address** \\- Required by law, yes. Did it help deliverability? Barely. Maybe a 1-2% improvement. Still important for compliance, but it won't save you from spam hell.\n\n**8. Using a professional email signature** \\- Added my logo, social links, the works. Looked more legit but didn't really move the needle on deliverability. Nice to have, not a game changer.\n\n**7. Reducing image-to-text ratio** \\- The old advice is \"too many images = spam.\" Cut my images way down and saw a small improvement. Maybe 5-8% better inbox placement. Helps, but it's not the main issue.\n\n**6. Consistent sending schedule** \\- This one surprised me. Sending randomly (whenever I felt like it) killed my sender reputation. Once I went to a consistent Tuesday/Thursday schedule, things improved noticeably. \n\n**5. List hygiene (removing inactive subscribers)** \\- Huge. I was scared to lose subscribers, but keeping dead emails on my list was tanking my engagement metrics. Removed anyone who hadn't opened in 6 months. Painful but necessary.\n\n**4. Double opt-in** \\- I resisted this forever because \"it reduces signups.\" Yeah, by about 30%. But the people who confirm? They're REAL. Engagement went up, complaints went down. ISPs started trusting my emails more. Worth the trade-off.\n\n**3. SPF, DKIM, and DMARC records** \\- This is where it gets technical. Set up proper email authentication. Sounds boring and complicated but it's absolutely critical. Gmail and Outlook basically require this now. \n\n**2. Warming up a new domain** \\- My old domain was burned. Started fresh with a new sending domain and warmed it up properly - started with 50 emails/day, slowly increased over 6 weeks. game changer. You can't just start blasting 10k emails from a new domain.\n\n**1. Actually getting engagement (replies, opens, clicks)** \\- This is the thing nobody wants to hear. All the technical fixes mean nothing if people don't engage with your emails. ISPs watch this like hawks. I had to completely rewrite my emails to be more conversational and actually valuable. Asked questions. Encouraged replies. Made it feel like a real conversation, not a broadcast. Once engagement went up, everything else fell into place.\n\n**The biggest lesson?**\n\nThere's no magic bullet. It's a combination of technical setup + list quality + actual good content people want to read. I wasted months looking for a hack. The \"hack\" is doing the boring work correctly and writing emails people actually care about.\n\nAlso, if you're in spam now, you probably need to start fresh. Your domain reputation might be too damaged to recover. Sucks, but it's reality.\n\nAnyone else been through spam hell? What worked for you? Genuinely curious if I missed anything.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qpm4m6/my_emails_landed_in_spam_for_over_a_year_straight/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o29yzqv",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 19:57:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a0ov3",
          "author": "No_Hedgehog8091",
          "text": "Your ranking is spot on. Most people waste time on trigger words when the real issue is engagement.\n\nOne thing that saved me: seed your list with your own email addresses across different providers. Reply to yourself from those accounts. Sounds weird but it trains the algorithms early that people interact with your emails.\n\nAlso, segment aggressively. Different content for different engagement levels keeps your overall metrics healthy.",
          "score": 6,
          "created_utc": "2026-01-28 20:04:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2a2yrr",
              "author": "PuzzleheadedTalk5159",
              "text": "Love it, speaking facts. Appreciate the feedback!",
              "score": 1,
              "created_utc": "2026-01-28 20:15:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2aibis",
          "author": "Low-Tackle7606",
          "text": "This is spot on! 🙌 Engagement really is everything, no technical fix helps if people aren’t opening or replying. Starting fresh with a new domain and warming it up slowly is usually the only way out if your old one’s burned. Curious. what’s your open/click rate now?",
          "score": 2,
          "created_utc": "2026-01-28 21:22:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ajjbh",
              "author": "PuzzleheadedTalk5159",
              "text": "I 100% agree!\n\nCurrently my open rate is sitting at around 25%, which isn't the best, but still decent (compared to before).\n\nHow about you?",
              "score": 2,
              "created_utc": "2026-01-28 21:27:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2akxbl",
                  "author": "Low-Tackle7606",
                  "text": "25% is solid progress! 🙌 My open rate is around 30%, and someone actually taught me that focusing on engaging subject lines and a real, conversation-style tone really helps boost it.",
                  "score": 2,
                  "created_utc": "2026-01-28 21:33:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2b7hkg",
          "author": "chaika22",
          "text": "What are you using to send the emails? Mailchimp or similar? I just launched a new LLC with new website and email, all through Squarespace and Google workspace. My first few emails just from gmail went to spam and ChatGPT filled me in on the SPF/DKIM issue, I wish that was made known to me as a higher priority while setting up the accounts.  I haven’t setup a marketing platform for email marketing and was curious if you had any suggestions on what to use.",
          "score": 2,
          "created_utc": "2026-01-28 23:19:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ceqlk",
          "author": "TemporaryKangaroo387",
          "text": "the biggest lesson here for anyone reading: sending infrastructure matters as much as content. you can have the best email copy in the world but if your domain reputation is trashed or you have no authentication set up its going straight to spam. dkim, spf, dmarc are table stakes now",
          "score": 2,
          "created_utc": "2026-01-29 03:11:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2d82ld",
              "author": "PuzzleheadedTalk5159",
              "text": "I 100% agree, sending infrastructue is a must these days",
              "score": 1,
              "created_utc": "2026-01-29 06:29:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qjry3k",
      "title": "How can I improve my email open rates?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qjry3k/how_can_i_improve_my_email_open_rates/",
      "author": "mediaBOOM",
      "created_utc": "2026-01-22 11:19:18",
      "score": 11,
      "num_comments": 29,
      "upvote_ratio": 0.93,
      "text": "I have around 8,000 real subscribers who opted in on my website, but my email open rate is only about 2.26%. I’ve tried changing subject lines and sending times, but it hasn’t improved. At this point, it feels like I’m just wasting money. What strategies are other digital marketers using right now to boost open rates without coming across as spammy?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qjry3k/how_can_i_improve_my_email_open_rates/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o110vrp",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-22 11:19:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o116rcy",
          "author": "Aunker",
          "text": "2.26% usually means deliverability or a dead list, not bad subject lines. First check if you’re landing in spam or promotions. Warm up by emailing only engaged subscribers from the last 30-60 days for a couple weeks, then clean hard and stop emailing people who never open. Send a simple 2-email re-engagement to the rest asking if they still want the emails, and suppress anyone who ignores it. Keep emails short with one topic and one link, avoid heavy images and spammy wording, and use a consistent sender name and address. Sometimes add a simple question that encourages replies, since replies can help deliverability. What platform are you using and are you seeing spam placement in your reports?",
          "score": 6,
          "created_utc": "2026-01-22 12:04:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zp3h0",
              "author": "Greg_Benatar",
              "text": "Which CRM system are you using? The one I have requires a lot of admin e.g adding the client details manually and exporting the same data is also manual. I'm looking for a seamless and automated way to do this",
              "score": 1,
              "created_utc": "2026-01-27 10:12:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1zpmpq",
                  "author": "Aunker",
                  "text": "The tool matters less than the setup. Most of the pain you’re describing comes from using a CRM that isn’t really built for marketing emails, so everything feels manual. Any system that auto syncs form fills, tags engagement, and suppresses inactive contacts will solve 80 percent of that. What I’d look for is automatic contact creation from forms, native email tracking, and simple automation rules like if no opens in 60 days then pause. If you still have to manually add contacts or export lists, it’s going to keep breaking deliverability no matter the CRM. The process should be boring and automatic, not clever.",
                  "score": 2,
                  "created_utc": "2026-01-27 10:16:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o21x6r5",
              "author": "mediaBOOM",
              "text": "Thanks, that makes a lot of sense. I was mainly focused on subject lines and timing, but it sounds like deliverability might be the bigger issue. I’m using DRIP and I haven’t checked spam placement closely yet. I will start there. I like the idea of warming up the list with engaged subscribers and doing a short re-engagement sequence for the rest. Appreciate the detailed tips!",
              "score": 1,
              "created_utc": "2026-01-27 17:35:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o26yb98",
                  "author": "Aunker",
                  "text": "Yeah, MaxConv doesn’t really filter junk if the input signal is polluted. If the bots are hitting specific keywords, the algo just optimizes around that noise. In those cases I’ve seen better results by stepping back to exact + phrase only, isolating 1-2 keywords per campaign, and running manual CPC or capped clicks to regain control. It’s slower, but you at least see what’s actually happening. MaxConv tends to behave better only after you already have clean, consistent conversion data not when the market is full of scrapers and competitors hammering the SERP.",
                  "score": 1,
                  "created_utc": "2026-01-28 10:49:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11xmdj",
          "author": "Rich-Editor-8165",
          "text": "At that level, it is usually not a subject line problem. A 2 percent open rate often means list quality or relevance drift. I would pause sending, clean inactive subscribers, and tighten who gets what based on why they opted in. Fewer, more targeted emails almost always outperform blasting the full list.",
          "score": 3,
          "created_utc": "2026-01-22 14:40:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1415c5",
              "author": "within-co",
              "text": "Agree. Cleaning the list and narrowing down who gets what emails will make your open rate and engagement rate much better. Big numbers don't always equal better.",
              "score": 1,
              "created_utc": "2026-01-22 20:24:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o21xayr",
              "author": "mediaBOOM",
              "text": "Yeah, that makes sense. I think my list has drifted a bit and I haven’t cleaned inactive subscribers in a while. I like the idea of pausing, targeting emails more carefully, and focusing on relevance over volume. Thanks for the advice!",
              "score": 1,
              "created_utc": "2026-01-27 17:36:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o11zry3",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-01-22 14:51:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12ilbi",
          "author": "PearlsSwine",
          "text": "That's not a subject line problem. It's a deliverability/list problem. \n\nWhat domain are you sending from? Or you can check yourself on mxtoolbox to see if it's been blacklisted. \n\nWhat does google postmaster tools say?",
          "score": 1,
          "created_utc": "2026-01-22 16:19:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21xhi3",
              "author": "mediaBOOM",
              "text": "Got it, thanks. I haven’t checked mxtoolbox or Google Postmaster yet, but I’ll look into both to see if there are any issues. Appreciate the guidance!",
              "score": 1,
              "created_utc": "2026-01-27 17:36:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o21z1w8",
                  "author": "PearlsSwine",
                  "text": "You're very welcome.",
                  "score": 1,
                  "created_utc": "2026-01-27 17:43:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o13bwfy",
          "author": "OrganicClicks",
          "text": "Some comments have already addressed deliverability, cleaning the list and re-engagement email. I'd add to keep emails short, mostly text, one clear point, one link max, and use a consistent from-name and domain. And once deliverability improves, try segmenting the new list based on how and why people signed up.",
          "score": 1,
          "created_utc": "2026-01-22 18:30:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21xlf0",
              "author": "mediaBOOM",
              "text": "Thanks, that’s helpful. I’ve been thinking about cleaning the list and doing re-engagement, but I like the added tips on keeping emails short, mostly text, and sticking to one link. Segmenting based on signup reason makes a lot of sense too. Appreciate it!",
              "score": 1,
              "created_utc": "2026-01-27 17:37:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o14fxjz",
          "author": "coachscholze",
          "text": "Totally fair question, because most beginners quit right here.\n\nThe mistake is trying to learn everything at once. SEO, ads, funnels, analytics, content… that’s not a beginner stack, that’s an agency org chart.\n\nIf I had to simplify it, start with one channel and one outcome, and more importantly, learn what actually moves people before you touch tools.\n\nHere’s what that looks like in real terms.\n\nPain-driven copy\n“Your website gets traffic, but no one calls. You’re paying for clicks that don’t turn into customers, and you don’t know why.”\n\nThis works because it names an existing frustration they already feel.\n\nFear-driven copy\n“Every month you delay fixing this, your competitors get more visible, more trusted, and harder to catch.”\n\nThis works because it taps into loss and risk, not features.\n\nMystery-driven copy\n“Most businesses fail online for one reason no one talks about, and it has nothing to do with ads or SEO.”\n\nThis pulls people forward because it creates a knowledge gap.\n\nGain-driven copy\n“Imagine knowing exactly where your next 10 customers are coming from, and being able to repeat it on demand.”\n\nThis works because it paints a clear, desirable outcome.\n\nAll four approaches sell the same thing. The tools don’t change. The psychology does.\n\nThat’s why beginners feel overwhelmed. They’re learning platforms instead of learning how decisions get made.\n\nOnce you understand pain, fear, mystery, and gain, SEO, ads, funnels, and analytics stop feeling random. They become different ways to deliver the same message.\n\nStart with one channel. One outcome. One real problem. Then layer the tools on top.\n\nThat’s how you avoid drowning in “everything marketing” and actually build skill.",
          "score": 1,
          "created_utc": "2026-01-22 21:34:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o157364",
          "author": "Overall-Buffalo-3660",
          "text": "A 2% open rate usually means deliverability and list quality issues clean inactive subscribers, segment hard, and re-earn inbox trust before tweaking subject lines.",
          "score": 1,
          "created_utc": "2026-01-22 23:55:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16yc09",
          "author": "supriya_l89",
          "text": "The deliverability of emails experiences issues when their subject lines show a threshold value of 2.26 percent. First, the list requires thorough cleaning which involves eliminating all inactive users and users who have not opened their emails during the past two months. The next step requires testing email delivery to determine if messages reach the spam or promotions folders after establishing domain authentication and verifying SPF and DKIM and DMARC settings. The research should evaluate plain-text emails which display an actual sender name together with content that provides value instead of presenting marketing material. Smaller, engaged lists almost always outperform big cold ones.",
          "score": 1,
          "created_utc": "2026-01-23 06:11:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17itww",
          "author": "Legitimate-Hat-4333",
          "text": "The biggest lifts in my open rates came from writing subject lines like i talk - clear, personal and a little curious. if it sounds like a real person would say it , people usually open it.",
          "score": 1,
          "created_utc": "2026-01-23 09:10:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19dj3t",
          "author": "ContextFirm981",
          "text": "With an 8,000 list and 2.26% opens, I’d start by cleaning hard/soft bounces and long‑term inactives, tightening segmentation, and sending fewer but more targeted emails with clear, benefit‑driven subject lines. Then slowly rebuild engagement so inbox providers start trusting your domain again.",
          "score": 1,
          "created_utc": "2026-01-23 16:11:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1e5it1",
          "author": "Crescitaly",
          "text": "2.26% is definitely below average - here's what's worked for me to boost open rates:\n\n\n\n\\*\\*Quick wins that usually help immediately:\\*\\*\n\n\n\n1. \\*\\*Subject line formula:\\*\\* Keep it under 40 characters. Use curiosity gaps like \"The \\[X\\] mistake killing your \\[Y\\]\" or personalization \"\\[Name\\], quick question about...\"\n\n\n\n2. \\*\\*Send time optimization:\\*\\* Test Tuesday-Thursday, either 10 AM or 2 PM in your audience's timezone. Avoid Mondays (inbox overload) and Fridays (weekend mode).\n\n\n\n3. \\*\\*Preview text matters:\\*\\* Don't waste it on \"View in browser\" - use it as a second headline.\n\n\n\n\\*\\*Deeper fixes:\\*\\*\n\n\n\n\\- \\*\\*Segment ruthlessly:\\*\\* Send different content to engaged vs. cold subscribers. One-size-fits-all kills engagement.\n\n\n\n\\- \\*\\*Re-permission campaign:\\*\\* Send a \"Do you still want to hear from us?\" email. Remove anyone who doesn't click. Smaller engaged list > big dead list.\n\n\n\n\\- \\*\\*Check your From name:\\*\\* Company name or founder's name? Test both. Personal names often win.\n\n\n\n\\*\\*Technical stuff:\\*\\*\n\n\\- Verify your SPF, DKIM, and DMARC records\n\n\\- Use a dedicated sending domain\n\n\\- Check if you're on any blacklists (use MXToolbox)\n\n\n\nWhat ESP are you using? And what's your niche? That context helps narrow down the issue.",
          "score": 1,
          "created_utc": "2026-01-24 08:07:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jn0a8",
          "author": "New_Appearance2669",
          "text": "Human writing on subject",
          "score": 1,
          "created_utc": "2026-01-25 02:27:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mw1f6",
          "author": "parkerauk",
          "text": "Adopt CTC as a mantra. Cut the Crap, or Correctly Targeting Communication. Outcomes that resonate are all you should be selling ever.",
          "score": 1,
          "created_utc": "2026-01-25 15:51:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sa4ov",
          "author": "Gloomy_Ad_896",
          "text": "When open rates are low, most people assume it's a subject line problem. Yet, it can ALSO be irrelevant previous emails, sender fatigue, or a secondary inbox. The first step is to figure out your specific root cause.",
          "score": 1,
          "created_utc": "2026-01-26 08:26:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tlva6",
          "author": "PRIV0306",
          "text": "2.26% on an opted-in list = deliverability issue, not a content issue. your emails are probably landing in spam.\n\nthe culprit is almost always list hygiene. anyone who hasn't opened in 6+ months is tanking your sender reputation. ESPs see low engagement and flag you as junk. you might need to cut that list down to actually see improvement.\n\nalso worth running a spam test before you send. campaign monitor platform has a tool that checks how your email renders AND whether it triggers spam filters. caught a few issues for me that i wouldn't have found otherwise.\n\nstart with the list though. 8k subscribers might really be 3k active people.",
          "score": 1,
          "created_utc": "2026-01-26 14:21:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zox4c",
          "author": "Due-Tomatillo-8848",
          "text": "That is a very low open rate and if your list is genuine and of good quality, what you are sending is either of no interest or value to them or you are sending at bad times or too many campaigns.  \nIt also depends on your aims of the eshot. Are you just looking to keep your brand visible to the subscribers or are you actually selling something?   \nMailchimp etc have AI to help with subject headings etc, but have you ever conducted any research to the list as to why they dont open your eshots? Sometimes in this digital age, it is actually better to pick up the phone and talk to people.",
          "score": 1,
          "created_utc": "2026-01-27 10:10:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpa1jf",
      "title": "Thinking about buying Instagram followers - looking for honest feedback",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qpa1jf/thinking_about_buying_instagram_followers_looking/",
      "author": "throawayaaa",
      "created_utc": "2026-01-28 12:29:20",
      "score": 9,
      "num_comments": 4,
      "upvote_ratio": 0.78,
      "text": "Hi everyone,\n\nI’m struggling with Instagram growth and honestly feeling a bit lost. I’ve been posting high quality content, using clean profile pictures, and interacting with other IG users, but my IG account is still growing very slowly. Because of that, I started looking into options to buy Instagram followers, but the more I read, the more confusing it becomes.\n\nThere are so many posts and ads about the best sites to buy Instagram followers, promising real, active followers, premium followers, and strong organic growth. Some say it helps increase follower count, popularity, and social proof, while others warn about fake followers, empty accounts, and damaged engagement rate. It’s hard to know what’s real.\n\nWhat I really care about is my overall Instagram presence. I don’t want to buy IG followers just to see numbers go up. I want genuine followers who don’t hurt organic engagement or confuse Instagram algorithms. I’m worried about services that offer instant delivery but later cause followers to drop, reach to fall, or engagement to disappear.\n\nI’m also curious about how these Instagram services actually work in real life. Do the followers look like real IG users or fake accounts? Does buying followers help bring more followers over time, or does it only inflate the follower count? And what about customer support is there a real customer support team, or do they disappear once you pay?\n\nI’m not trying to cheat or fake success. I just want my IG account to grow in a healthy way without ruining organic engagement. If anyone here has experience with buying Instagram followers, I’d really appreciate honest feedback, good or bad. Did it help your growth, or did it hurt your account in the long run?\n\nNot looking for promotions, just real experiences from people who’ve tried this.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qpa1jf/thinking_about_buying_instagram_followers_looking/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o27ber3",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 12:29:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28ilrh",
          "author": "Zestyclose_Sort1883",
          "text": "Same here. I was posting consistently, and engagement wasn’t terrible, but the follower count was stuck, which made the account look kind of dead from the outside. I started small and used gradual delivery, and that’s what made it feel the least sketchy for me.",
          "score": 1,
          "created_utc": "2026-01-28 16:09:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28a2h0",
          "author": "ComplexTell25",
          "text": "I had a good experience with Media Mister as well. What stood out to me was how steady the delivery was. The account didn’t look like it jumped overnight, and everything felt balanced with my organic activity. It helped my profile look more established.",
          "score": -19,
          "created_utc": "2026-01-28 15:32:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qlqpet",
      "title": "curious how people think about risk vs convenience with social media tools",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qlqpet/curious_how_people_think_about_risk_vs/",
      "author": "shash_99",
      "created_utc": "2026-01-24 16:01:15",
      "score": 8,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "we manage multiple brands and clients, so native posting across platforms just isn’t realistic, but every time i research tools i run into warnings about api issues, shadowbans, and accounts getting restricted. i’m not trying to automate engagement or do anything aggressive. mostly just want sane scheduling, a shared inbox, and approvals that don’t live in five places. when i compare tools like sprout social, metricool, and vista social, they all say they’re legit, but it’s hard to separate real risk from internet horror stories\n\nin practice, is the risk more about how people use these tools, or have you actually seen downsides from using reputable all in one platforms day to day",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qlqpet/curious_how_people_think_about_risk_vs/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1g08vo",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-24 16:01:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gayr3",
          "author": "GrowthLaunch",
          "text": "Totally get it! Once you manage multiple brands, native posting turns into a full-time job.\n\nIn my experience, the “horror stories” are usually less about the scheduler itself and more about **permission + identity weirdness**. The moment you have 6 people logging in, 3 devices, VPNs, switching locations, and reconnecting accounts… platforms start treating it like suspicious behavior.\n\nA low-stress way to run it: keep **one admin login per platform**, connect via official partner API, and avoid any tool that asks for your password directly",
          "score": 3,
          "created_utc": "2026-01-24 16:49:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1j8x8h",
          "author": "Electronic-Cat185",
          "text": "in practice the riisk is way more about behavior than the tools themselves. reputable platforms that use official apis are generally fine for scheduliing approvals and inbox management. most of the horror stories come from people pushing volume repeatiing content or trying to game engagement. if your use case is boring and compliant these tools usually reduce risk instead of increasing it because everything is logged and consistent. conveniience tools get dangerous when they are treated like growth hacks instead of workflow infrastructure",
          "score": 2,
          "created_utc": "2026-01-25 01:09:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jt0hp",
          "author": "Rich-Editor-8165",
          "text": "The risk seems to be more about how people use tools rather than the tools themselves. If you're sticking to the basics like scheduling and managing communication, the risk is lower, but always be cautious of terms of service and limits on each platform.",
          "score": 2,
          "created_utc": "2026-01-25 03:00:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1g8maa",
          "author": "Necessary-Place-8321",
          "text": "we’ve been using vista social for a bit and honestly the risk conversation felt bigger online than in real life. as long as we’re not auto spamming or doing anything weird, it’s basically just a cleaner way to schedule and manage inbox without jumping between native apps",
          "score": 1,
          "created_utc": "2026-01-24 16:39:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1neevn",
              "author": "mick1706",
              "text": "I totally agree! I look at it like its working alongside with us",
              "score": 1,
              "created_utc": "2026-01-25 17:10:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1nru37",
              "author": "Old-Push-7296",
              "text": "that lines up with what i keep hearing. with vista social specifically, it seems like people are using it for basic scheduling and inbox cleanup. feels like “third party tool” and “automation” get mixed up when they’re really different things",
              "score": 1,
              "created_utc": "2026-01-25 18:07:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1lraok",
          "author": "No_Winner_6631",
          "text": "every actual issue i’ve seen came from someone pushing volume way too hard or using some sketchy plugin. i’ve never seen a legit platform randomly get an account banned.",
          "score": 1,
          "created_utc": "2026-01-25 11:55:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ndic1",
          "author": "Dramatic-Flamingo584",
          "text": "From my experience, the risk is way more about how people use these tools than the tools themselves. Most of the horror stories I’ve seen come from aggressive automation or sketchy engagement tactics, not basic scheduling, inbox management, or approvals. I’ve used third-party platforms for multiple brands because native posting just isn’t realistic, and as long as you’re staying within normal posting and engagement behavior, issues are rare.\n\nI treat these tools as operational support, not growth hacks. For things like scheduling, shared inboxes, and approvals, reputable platforms that work with official APIs have been solid for me day to day. I’ve found that something like Vista Social quietly does the job without pushing risky features, which makes the convenience worth it. Overall, the time saved and reduced chaos far outweigh the risk when you’re using the tools responsibly.",
          "score": 1,
          "created_utc": "2026-01-25 17:06:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1of36u",
          "author": "Fenrir_Max",
          "text": "every actual issue i’ve seen came from someone pushing volume way too hard or using some sketchy plugin. i’ve never seen a legit platform randomly get an account banned",
          "score": 1,
          "created_utc": "2026-01-25 19:45:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21s8kw",
          "author": "flamefreeze_YT",
          "text": "From what I’ve seen, most of the real risk comes from how tools are used, not the tools themselves. The horror stories usually involve aggressive automation or trying to game engagement. We’ve kept posting and listening separate, using native posting or approved schedulers for content and tools like Meltwater just for monitoring and insights, which feels safer day to day. As long as you stay within platform rules, reputable tools are generally fine for the basics you mentioned.",
          "score": 1,
          "created_utc": "2026-01-27 17:14:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23ef2b",
          "author": "hibuofficial",
          "text": "This usually ends up being more about usage than the tools themselves. The established platforms are tied to official APIs, so they’re generally not doing anything risky by default.\n\nWhere problems pop up is with patterns… posting identical content everywhere, sudden volume changes, or letting scheduling turn into full autopilot. For teams managing multiple local brands, some kind of centralized tool is almost unavoidable, and native posting often creates more inconsistency than it solves.\n\nThe horror stories are real, but they tend to be edge cases. Day to day, reputable all-in-one tools are mostly uneventful, which is kind of what most teams are aiming for.",
          "score": 1,
          "created_utc": "2026-01-27 21:28:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qn4cni",
      "title": "How do I gain more interactions and views for a government charity organisation?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qn4cni/how_do_i_gain_more_interactions_and_views_for_a/",
      "author": "shinebright9x",
      "created_utc": "2026-01-26 03:10:07",
      "score": 6,
      "num_comments": 22,
      "upvote_ratio": 0.88,
      "text": "I volunteer for a gov organisation doing their social media posts  but I dont know how to get more view and interactions. I want more young people to know about them but don’t know how to market them on TikTo. I’m currently using X but it’s not doing wel. \n\nThanks in advance ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qn4cni/how_do_i_gain_more_interactions_and_views_for_a/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1r1se1",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 03:10:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1r421v",
          "author": "Actual-Carrot-7183",
          "text": "X isnt great for young audiences. TikTok and IG Reels work much better.\n\nKeep it human: short videos, real stories, behind-the-scenes, and clear impact. Less perss-release, more authentic.",
          "score": 2,
          "created_utc": "2026-01-26 03:22:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1r8sbu",
              "author": "shinebright9x",
              "text": "Ik X isn’t great but that’s what the main office and the previous volunteer use but how do I create content for my organisation ?  I want to do it without showing myself. Like cartoon Ai videos or something that entertains but informs about the organisation? I actually want to use TikTok as well as X ",
              "score": 2,
              "created_utc": "2026-01-26 03:50:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1t71ao",
                  "author": "CautiousRuin392",
                  "text": "Wouldn't recommend using all AI it may seem inauthentic. And you can post the same videos on reels and tiktok to start - as for exactly what to post op it would help knowing what gov org space you're in",
                  "score": 1,
                  "created_utc": "2026-01-26 12:59:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1r8cy4",
          "author": "kubrador",
          "text": "x is basically a retirement home at this point so that tracks. tiktok's where the young people are, but you gotta actually be entertaining. government content is about as magnetic as a tax form. try posting behind-the-scenes stuff, user testimonials, or whatever your org actually does in a way that doesn't sound like it was written by a committee of lawyers.",
          "score": 1,
          "created_utc": "2026-01-26 03:47:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rcqsk",
          "author": "anajli01",
          "text": "Totally normal X is weak for discovery, especially for charities.\n\nFor TikTok:\n\n* Tell stories, not announcements (real people helped, volunteer POVs)\n* Use faces, not logos\n* Strong 2-second hooks (“Most people don’t know this service is free…”)\n* Educate first, mention the org at the end\n* Post 3–5 simple videos a week\n\nTikTok rewards usefulness + authenticity, not polished gov messaging.",
          "score": 1,
          "created_utc": "2026-01-26 04:14:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1vas06",
              "author": "shinebright9x",
              "text": "I don’t think those post suggestions are possible bc the org is very limited but I’ll ask about stories. ",
              "score": 1,
              "created_utc": "2026-01-26 18:49:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1sv8xw",
          "author": "levichambers_1",
          "text": "social media is tough for government charity orgs, but youth engagement is possible if the content feels real and human.. tiktok works best, short emotional videos, real impact stories, behind the scenes, or simple tips usually get views. avoid a corporate tone and use user style content, challenges, or duets with youth creators. x is mainly for awareness, so daily posts, hashtags, and quick replies to comments matter. even a small tiktok boost can increase reach a lot. authentic and youth focused content can usually increase engagement by 5 to 10x..",
          "score": 1,
          "created_utc": "2026-01-26 11:34:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tnspr",
          "author": "OldDepartment9591",
          "text": "Skip the word \"government\".",
          "score": 1,
          "created_utc": "2026-01-26 14:30:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1v9pzi",
              "author": "shinebright9x",
              "text": "Wdym",
              "score": 1,
              "created_utc": "2026-01-26 18:45:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1v9yrz",
                  "author": "OldDepartment9591",
                  "text": "No one would donate for a government institution. At least most people, so when promting your cause avoid using the word gov.",
                  "score": 1,
                  "created_utc": "2026-01-26 18:46:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1yyrpl",
          "author": "supriya_l89",
          "text": "You will achieve better results from X than from other options. TikTok and Instagram Reels serve younger audiences better than other platforms.  \n  \nThe short human stories should show their impact through behind-the-scenes content and day-in-the-life footage and quick facts which connect to the charity's mission. The videos should remain vertical and last between 30 to 45 seconds while displaying captions and hooks within their initial 2 seconds. The use of government language should be avoided because authentic and relatable content achieves better results.  \n  \nThe testing of various formats through weekly tests will show which format creates actual engagement for users. The testing of various formats through weekly tests will show which format creates actual engagement for users.",
          "score": 1,
          "created_utc": "2026-01-27 06:17:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20me68",
          "author": "Rich-Editor-8165",
          "text": "yea i think fr younger audiences, focus less on “announcements” and more on people and impact. Short videos showing real stories, behind the scenes work, or how the charity helps someone today tend to perform better than polished posts. Use simple hooks, native TikTok formats, and clear calls to action like “share this” or “did you know this exists?”. X is fine for updates, but TikTok is about relatability and storytelling.",
          "score": 1,
          "created_utc": "2026-01-27 14:02:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23ifw6",
          "author": "hibuofficial",
          "text": "Yeah, this is a pretty common challenge with public-sector and charity accounts, especially when the goal is younger audiences.\n\nOne thing that tends to get overlooked is that younger users don’t usually follow organizations on TikTok. They follow situations, people, or something that feels like it’s happening right now. When posts lean too much into updates or announcements, engagement usually drops, even if the mission itself matters.\n\nContent often works better when it starts small. A moment, a question, or a short explanation of something most people don’t realize about the issue. Real people help too. Volunteers, staff, or even voiceovers paired with simple footage usually land better than graphics or logos.\n\nX can be frustrating for this kind of goal. Discovery there is limited, especially for awareness. TikTok or Reels tend to give more room for reach, even with imperfect posts.\n\nConsistency usually matters more than polish. A few human-feeling posts each week often outperform something that sounds official but rarely shows up.\n\nWhat kind of posts have gone out so far?",
          "score": 1,
          "created_utc": "2026-01-27 21:46:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27w06y",
          "author": "PutChemical5725",
          "text": "Try hosting an event to give back - and make it fun.",
          "score": 1,
          "created_utc": "2026-01-28 14:25:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkrdaf",
      "title": "What are your chosen Multi-Channel Social Media Posting apps/sevices these days?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qkrdaf/what_are_your_chosen_multichannel_social_media/",
      "author": "focusedphil",
      "created_utc": "2026-01-23 13:52:53",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "As things have changed over the years, I was wondering what all you folks are using for your outgoing multi-channel SM tasks these days. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qkrdaf/what_are_your_chosen_multichannel_social_media/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o18ksoe",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 13:52:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19a7oa",
          "author": "daviswbaer",
          "text": "Hey Phil, I am the co-founder of a social media tool called OneUpApp.io\n\nwe support Instagram (including Stories, Reels, Trial Reels, collabs, and mixed media posts), TikTok, YouTube (including Shorts), Facebook, LinkedIn, Reddit, Threads, Bluesky, Pinterest, Snapchat, and Google Business Profiles.\n\nIn addition to scheduling, we also have client access, approvals, reporting, team collaboration, social inbox for replying to both comments and DMs, and social listening\n\nand our pricing is actually reasonable",
          "score": 8,
          "created_utc": "2026-01-23 15:57:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1abb0r",
              "author": "focusedphil",
              "text": "Thanks! I'll check it out!",
              "score": 1,
              "created_utc": "2026-01-23 18:44:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o18tq1j",
          "author": "ddskitt0629",
          "text": "Buffer and Metricool.",
          "score": 2,
          "created_utc": "2026-01-23 14:38:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o193yns",
          "author": "kubrador",
          "text": "buffer and later are the obvious picks if you want something that doesn't make you want to unalive yourself, though hootsuite still exists if you hate money and free time.",
          "score": 2,
          "created_utc": "2026-01-23 15:28:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o196621",
              "author": "focusedphil",
              "text": "I see Hoostuite has not changed much, then.",
              "score": 1,
              "created_utc": "2026-01-23 15:38:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o19cpy0",
          "author": "imnotafanofit",
          "text": "Facebook Creator Studio (Meta Business Suite). Free and handles FB and IG natively if you don’t want to pay for a fancy tool. But pick a tool that matches your stack. If IG + TikTok are your focus, make sure it schedules both well. ",
          "score": 1,
          "created_utc": "2026-01-23 16:08:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmzqtb",
      "title": "How do you figure out what caused a KPI change?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qmzqtb/how_do_you_figure_out_what_caused_a_kpi_change/",
      "author": "ElementaryBuild",
      "created_utc": "2026-01-25 23:50:31",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "When we notice a CVR/AOV drop, or really any weird shifts in historical data / other KPIs, we typically spend hours trying to figure out what happened.\n\nMost of the time we’re digging in with product or the data teams, reviewing what features deployed around that time, what configurations were changed etc… \n\nMost of the time we end up finding something obvious that changed just it was long lost in a slack thread / run by a different team.\n\nDo you maintain with product any system of record for “changes that can move our KPIs”? Or any other solution you’ve found that makes this all more manageable…?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qmzqtb/how_do_you_figure_out_what_caused_a_kpi_change/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1pxyba",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-25 23:50:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rdrvo",
          "author": "Actual-Carrot-7183",
          "text": "Yeah, same here ,most KPI drops end up being something ovbious that just wasnt documented anywhere. We try to keep a shared change log with product for anything that could impact metrics, but honestly its only useful if everyone actually updates it. Otherwise its back to digging through commits, release notes, and Slack threads.",
          "score": 1,
          "created_utc": "2026-01-26 04:21:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1u8ywr",
              "author": "ElementaryBuild",
              "text": "Uff yeah, exactly the issue. So tricky to make sure people update consistently... Did you find any magic to getting this change log to stick? / who typically owned the process - product?",
              "score": 1,
              "created_utc": "2026-01-26 16:08:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1so2t6",
          "author": "Ok_Professional2491",
          "text": "this is such a pain point, we've all been there digging through slack threads trying to find what broke. One thing that might be worth checking - if you're seeing sudden CVR drops, sometimes it's not a feature change at all but actually bot traffic or fraud skewing your data. I've been seeing fraud-blocker come up a lot lately for PPC teams dealing with this exact issue.\n\nIt automatically filters out fake clicks and junk leads so you're not wasting time investigating drops that are just from bad traffic inflating your numbers. Might help you rule out that variable at least before you go down teh rabbit hole with product and data teams. For the system of record question, I'd recommend setting up a simple shared doc or notion page where any team logs changes that could impact metrics.\n\nDoesn't need to be fancy, just a timestamped log everyone agrees to update.",
          "score": 1,
          "created_utc": "2026-01-26 10:33:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1sqe16",
              "author": "polygraph-net",
              "text": "Everyone needs to be aware Fraudblocker are scammers who use thousands of Reddit accounts to post fake positive reviews of their service.",
              "score": 1,
              "created_utc": "2026-01-26 10:54:00",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1uaw9h",
              "author": "ElementaryBuild",
              "text": "Makes sense - and honestly in the past sometimes the big shifts for us have come from changes the payment team have made (e.g. blocking more / less). When you've had these fire drills, which team has taken the lead on digging through it all (and I guess owning the shared doc)?",
              "score": 1,
              "created_utc": "2026-01-26 16:16:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1zhwml",
          "author": "Legitimate-Hat-4333",
          "text": "I start seeing on what changed-timing,channel,audience or messaging- then compare it to normal period. Most KPI swings have a simple trigger once you line up the context.",
          "score": 1,
          "created_utc": "2026-01-27 09:05:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o259ne3",
          "author": "TomTomAgain",
          "text": "We had this exact problem. Started keeping a simple log of any change that could affect metrics - deploys, config changes, ad tweaks, landing page stuff, whatever. Just timestamped with a one-liner on what changed. The key was making it low friction enough that people actually do it, if its more than 30 seconds nobody will bother. Took a few weeks to stick but now when something tanks we can actually trace it back instead of digging through slack for an hour.",
          "score": 1,
          "created_utc": "2026-01-28 03:06:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ql10mg",
      "title": "Influencer",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1ql10mg/influencer/",
      "author": "lucameiers",
      "created_utc": "2026-01-23 19:51:47",
      "score": 6,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Where can I find good youtube and instagram influencer that covers financial topics?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1ql10mg/influencer/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1aps0d",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 19:51:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1bqoe2",
          "author": "MrInternationalBunal",
          "text": "First place I’d look is YouTube and instagram, that’ll be $3500 \n\nThanks",
          "score": 1,
          "created_utc": "2026-01-23 22:47:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1erldh",
          "author": "ChestChance6126",
          "text": "I’d start from the audience instead of the influencer. Search YouTube for specific finance topics, then check who consistently ranks and has real comments, not just views. on instagram, look at who gets saves and thoughtful replies, that’s usually a better signal than follower count.",
          "score": 1,
          "created_utc": "2026-01-24 11:28:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1etyq5",
              "author": "lucameiers",
              "text": "Thank you for advice.",
              "score": 2,
              "created_utc": "2026-01-24 11:49:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1s06kv",
                  "author": "ChestChance6126",
                  "text": "no problem. one more thing that helps is checking if they’ve done paid promos before and how the audience reacted. comments tell you fast if trust is there or not.",
                  "score": 1,
                  "created_utc": "2026-01-26 07:01:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1f355u",
          "author": "ScottLewisF",
          "text": "It will depend on your budget. There are literally countless influencers that could work; their cost will be directly proportional to their follower count. Decide what you're willing to pay and start your research from there.",
          "score": 1,
          "created_utc": "2026-01-24 12:59:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fl1bz",
              "author": "lucameiers",
              "text": "I thought so too, but I can't reach small beginners, and the established ones I contact ask for a lot of money, without any guarantee that there will be results.",
              "score": 1,
              "created_utc": "2026-01-24 14:46:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1jtt1c",
          "author": "kubrador",
          "text": "try searching \"financial advice\" on youtube and see which creators have actual credentials vs just vibes and a ring light. most of the good ones aren't marketing themselves as influencers anyway.",
          "score": 1,
          "created_utc": "2026-01-25 03:05:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qoi1yv",
      "title": "is it just me, or has LinkedIn Sales Navigator become a graveyard of outdated data?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qoi1yv/is_it_just_me_or_has_linkedin_sales_navigator/",
      "author": "tersbackwrec",
      "created_utc": "2026-01-27 16:08:54",
      "score": 6,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Has anyone herefound a marketing automation or an agentic tool that actually _reasons_ through a profile before adding it to a list? I’m looking for something that understands the \"why\" behind a lead, not just the job title. What are you guys using that actually feels \"smart\" in 2026?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qoi1yv/is_it_just_me_or_has_linkedin_sales_navigator/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o21d6g4",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 16:08:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21fg16",
          "author": "Delicious_Peanut_645",
          "text": "I tired LinkedIn Sales navigator a year ago sent more than 1000 message haven't got a single conversion from that",
          "score": 1,
          "created_utc": "2026-01-27 16:18:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22culy",
          "author": "Nastya_Tan",
          "text": "A hard nut to crack",
          "score": 1,
          "created_utc": "2026-01-27 18:42:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25xyqb",
          "author": "Antler-gxy",
          "text": "Yep, Sales Nav feels ancient now. I haven’t seen anything that truly “reasons” yet — most tools still do keyword/title matches. The best results I get are from combining context signals (recent moves, role changes, activity) + manual filtering.\n\nWould love to hear tools that actually act smart in 2026.",
          "score": 1,
          "created_utc": "2026-01-28 05:37:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o260gex",
          "author": "Livid_Pace8596",
          "text": "LSN is fine... but a bit old-school.",
          "score": 1,
          "created_utc": "2026-01-28 05:55:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o263q30",
          "author": "Humble-Climate7956",
          "text": "I feel your pain with Sales Navigator. We were drowning in bad data – outdated job titles, people who'd left the company months ago, you name it. Our sales team was wasting so much time chasing ghosts that it was impacting morale. The real killer was trying to understand the connections between data points. Like okay this person is a VP of Marketing now but they used to work at a company thats a known competitor and theyve been posting about a specific technology on LinkedIn. We were manually trying to piece all of that together which was taking forever. We actually found a solution thats been a game-changer. They basically have this AI-powered platform that automatically maps all these hidden relationships in our data. It sounds like magic but it pulls data from all our different sources – Sales Navigator our CRM marketing automation platform even some internal databases – and figures out whos connected to whom and how. It scrubs the data highlights important changes like someone getting a new role and flags potential leads that actually align with our ideal customer profile. For instance we had a situation where someones title hadnt been updated in Sales Navigator but the tool picked up that they were actively involved in a project related to a technology we sell based on their LinkedIn activity and mentions in some industry publications. It was buried in the noise but the platform surfaced it. The biggest win honestly was freeing up our data team. Before they were constantly building ETL pipelines and cleaning up data but now the AI handles most of that automatically. They can finally focus on more strategic stuff. Plus its empowered our sales and marketing teams to build their own custom workflows using natural language to look for the types of leads that convert so its taken the pressure off the data team. Its made a huge difference in our lead quality and conversion rates. The company that made it has a referral program (full disclosure I'd get a kickback if you sign up through me). But honestly it solved a massive headache for us and I think it could really help you too. Happy to connect you if youre interested.",
          "score": 1,
          "created_utc": "2026-01-28 06:20:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26noh6",
          "author": "FMBasho",
          "text": "After going back and forth with sales nav subscriptions, I decided to quit. The industry filters are terrible and even if you do a boolean search the results are quite messy and unreliable.  \nWhat I'm doing now is grabbing linkedin profiles from Apollo, then using Heyreach for outreach automation. You can really narrow down your search to specific niches, like e-commerce - dtc or tech - SaaS.",
          "score": 1,
          "created_utc": "2026-01-28 09:13:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2972dz",
          "author": "-TaskForge-",
          "text": "You’re right-many tools focus only on surface-level details like job titles, which often leads to outdated or irrelevant lists. Our approach uses freshly sourced leads tailored to our ideal customer profile. We combine data scraping with automation that checks for recent activity of prospects and engages with their recent LinkedIn activity before sending connection requests, and no recent activity means that we don't even see that prospect in our lead list. This helps create warmer introductions based on actual behavior, not just static information. It’s a more thoughtful way to build meaningful outreach in today’s market.",
          "score": 1,
          "created_utc": "2026-01-28 17:55:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qov6w1",
      "title": "What SEO strategies are working for you guys?",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qov6w1/what_seo_strategies_are_working_for_you_guys/",
      "author": "New-Strength9766",
      "created_utc": "2026-01-28 00:00:17",
      "score": 5,
      "num_comments": 28,
      "upvote_ratio": 0.78,
      "text": "I’ve recently been put in charge of SEO strategy at work. I was already handling most of the execution, but now I’m expected to be more proactive and drive results.\n\nWe’re doing a lot already. Link building, digital PR, content optimization, and creating supporting content for BOFU pages. Even with all that, our organic traffic keeps slipping\n\nAI visibility is trending up, but it’s not offsetting the traffic drop yet.\n\nFor those seeing growth this year, what’s actually working for you? Where would you double down if you were in my position?\n\n",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qov6w1/what_seo_strategies_are_working_for_you_guys/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o249v8t",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 00:00:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24aaid",
          "author": "prinky_muffin",
          "text": "That’s a tough spot. One thing that’s helped me reverse a slide like that was shifting some focus away from pure net new content and links, and going hard on refreshing pages that were already getting impressions. Updating structure, tightening search intent, improving internal linking, and adding missing subtopics moved a few stuck pages way faster than publishing brand new posts. I also started looking more closely at what was winning the SERP now, not what used to rank a year ago. A lot of times the format, depth, or angle had quietly changed.\n\nI also learned how to spot those opportunities better after digging into some of the strategies in odd angles media’s free Reddit SEO blueprint. It pushed me to think more in terms of demand signals and real questions people are asking, instead of just chasing keyword tools all day. That mindset shift alone helped me prioritize what was actually worth updating or expanding.\n\nIf traffic is slipping even with solid execution, I’d double down on refreshing proven pages, tightening intent match, and making sure internal links are really pushing authority where you want it. Small compounding improvements there tend to move the needle faster than constantly starting from zero.\n\nHope that helps!",
          "score": 5,
          "created_utc": "2026-01-28 00:02:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24acol",
          "author": "PerformanceLiving495",
          "text": "What helped us most was going back to fundamentals and focusing hard on search intent instead of just pumping out more content. We audited our top pages and rewrote them to better match what people were actually searching for, improved structure, internal linking, and tightened up page speed and mobile performance. We also refreshed older pages that already had some traction instead of constantly publishing new ones. Once we focused on depth, usefulness, and technical cleanup, rankings slowly stabilized and then started improving.",
          "score": 3,
          "created_utc": "2026-01-28 00:02:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24ahbd",
          "author": "Dusi99",
          "text": "We saw better results when we stopped treating publishing as the finish line and leaned more into building credibility in the niche. Partner content, expert quotes, and real mentions in relevant communities brought stronger signals than random placements. Another big win was cleaning up site architecture so important pages weren’t buried several clicks deep. It took a few months, but consistency plus easier crawl paths helped performance recover.",
          "score": 2,
          "created_utc": "2026-01-28 00:03:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24lc0e",
          "author": "Ill_Lavishness_4455",
          "text": "Honestly, the reason your traffic is dipping even with all that BOFU work is probably because you're still playing by 2023 rules. In 2026, standard organic is basically a secondary metric—AI \"Share of Model\" is the real game now.\n\nIf I were in your shoes, I’d stop chasing the click and start chasing the citation. A few things to double down on:\n\n1. Lead with the answer. Put a 2-3 sentence \"Direct Summary\" at the top of every page. If an LLM agent has to dig for your point, it’ll just cite a competitor who made it easier to scrape.\n\n2. Structure your content into modular blocks. Your H2s and H3s should work as standalone \"Knowledge Passages\" that don't need the rest of the page for context.\n\n3. Don't ignore schema. It’s basically the translation layer for AI crawlers. Use it to tell the agents exactly what your entities are so they don't have to guess.\n\n4. Focus on Entity Co-occurrence. Traditional backlinks matter less than having your brand mentioned in the same breath (and training data) as your main keywords.\n\nBasically, stop trying to win the search engine and start trying to win the reasoning engine.",
          "score": 2,
          "created_utc": "2026-01-28 00:58:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24aml1",
          "author": "Super-Catch-609",
          "text": "One thing that helped us was closely reviewing which pages were slipping and figuring out why instead of guessing. In many cases competitors had updated faster or covered topics more thoroughly, so we expanded our pages with clearer explanations, examples, and visuals. We also improved things like load time, layout, and readability to keep people engaged longer. Small upgrades across many pages added up more than chasing one big tactic.",
          "score": 1,
          "created_utc": "2026-01-28 00:04:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24gtg8",
          "author": "No-Air-1589",
          "text": "Short answer: The traffic drop probably isn't your fault. The game is changing. But scaling the same tactics while the game is changing won't work. Step back, ask 'which business outcome is this activity tied to,' and redesign from there.",
          "score": 1,
          "created_utc": "2026-01-28 00:35:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24id63",
          "author": "kubrador",
          "text": "sounds like you're doing the textbook stuff and google's still ghosting you. that's because everyone's doing the textbook stuff.\n\nif traffic's slipping while you're optimizing, the real answer is probably that your BOFU content isn't actually converting better or ranking for anything people give a shit about anymore. link building and digital pr are table stakes now, not differentiators.\n\nthe people seeing growth are either: 1) in verticals google hasn't completely destroyed yet, 2) doing something weird with their topical authority that actually works, or 3) just lucky enough to have branded searches propping them up. \n\nif you want my take: stop optimizing for keywords and start obsessing over whether your content answers questions better than the ai answer at the top. that's the actual competitive moat right now. but that's harder to report on than \"we built 47 backlinks\" so good luck pitching it upstairs",
          "score": 1,
          "created_utc": "2026-01-28 00:43:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25jl5s",
          "author": "swiftpropel",
          "text": "I have been redoubling topical authority in content cluster pillar pages with deep subtopic clusters. It is moving my traffic down reversal as AI summaries because Google prefers entity-based knowledge at the time. The refreshing of old human content is beneficial.",
          "score": 1,
          "created_utc": "2026-01-28 04:03:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25o3lw",
          "author": "patpatpat_pat",
          "text": "AI optimization and on page content for organic require a relationship that works for both, but one doesn’t necessarily cause the other to slip on organic super badly. You’re probably over optimizing or not giving it time to really take place. Big changes cause a drop and sometimes the work doesn’t pay off for months.",
          "score": 1,
          "created_utc": "2026-01-28 04:30:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25tq3r",
          "author": "rubberblutt",
          "text": "SEO is dead.  Get good at ads.",
          "score": 1,
          "created_utc": "2026-01-28 05:07:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2618dv",
          "author": "supriya_l89",
          "text": "The current expansion of our operations shows better results through focused efforts instead of implementing extra strategic approaches. The existing content needs updating and consolidation while we work to enhance internal links that support our main BOFU pages and create content that matches actual search intent. The work of tracking AI/SGE content extraction needs to be done because we need to optimize for that content categorization process from the beginning. The organic search results now prioritize content quality and relevance above content volume according to current assessment.",
          "score": 1,
          "created_utc": "2026-01-28 06:01:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26jzgc",
          "author": "cjsb28",
          "text": "Focus on AI-readable content with structured FAQs, schema markup, and clear expertise signals. Optimize for search intent, update existing pages regularly, and earn authoritative backlinks. Quality beats volume in 2026.",
          "score": 1,
          "created_utc": "2026-01-28 08:38:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26qny8",
              "author": "andrlac",
              "text": "Totally agree. Adding FAQs to all relevant landing pages has really helped us stabilize our traffic and also improve our SEO rankings.",
              "score": 1,
              "created_utc": "2026-01-28 09:41:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o26qdj5",
          "author": "ContextFirm981",
          "text": "The biggest wins I’m seeing now come from ruthlessly updating and consolidating existing content (fixing cannibalization, pruning weak pages), strengthening E‑E‑A‑T (real authors, case studies, original data), and tightening internal linking around a few key BOFU pages. Those moves have helped more than just “more links and more posts.”",
          "score": 1,
          "created_utc": "2026-01-28 09:38:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26rcnr",
          "author": "ChestChance6126",
          "text": "short answer, fewer bets, tighter focus. i’ve seen better results from pruning content, tightening intent match on money pages, and improving internal linking than from more links. ai visibility helps, but fixing weak pages that bleed rankings helped more.",
          "score": 1,
          "created_utc": "2026-01-28 09:47:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27ham5",
          "author": "hddjdjjdjd",
          "text": "What actually helped me with SEO traffic is building out all the other marketing platforms. Social media, podcast, linkedin, etc. Google wants to see that you are a real business.",
          "score": 1,
          "created_utc": "2026-01-28 13:06:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27krbq",
          "author": "Rich-Editor-8165",
          "text": "I’m seeing better results focusing less on volume and more on intent alignment. like updating existing pages to match current search intent, tightening internal linking around a few priority topics, and improving page experience has moved the needle more than new content. keep in mind to double down on what already ranks page 2-3 and make those pages unmistakably better rather than chasing new keywords.",
          "score": 1,
          "created_utc": "2026-01-28 13:26:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2811jz",
          "author": "TemporaryKangaroo387",
          "text": "youre describing the exact situation a lot of SEO people are struggling with rn -- doing all the right things but still watching traffic bleed out\n\nthe uncomfortable truth is that AI overviews are eating clicks that used to go to traditional results. and the tactics that work for traditional SEO dont necessarily work for getting cited by AI models. its basically a new channel that overlaps but isnt the same.\n\nsome things that have moved the needle for us:\n\n- track where youre actually showing up in AI answers (not just google search). tools like BrightEdge or manual checks in ChatGPT/Perplexity can help baseline this\n\n- structure content so its easy for LLMs to parse and cite -- clear headers, factual statements, entity references. the \"direct answer at the top\" approach others mentioned is legit\n\n- entity authority matters more than ever. being mentioned alongside relevant keywords in sources that get crawled (reddit, wikipedia, news, industry publications) seems to influence what LLMs recommend\n\n- honestly for BOFU pages the best move might be leaning harder into conversion optimization vs traffic volume. if AI is answering informational queries directly, your organic traffic composition is shifting toward more qualified intent anyway\n\nthe traffic number declining doesnt always mean business impact is declining, depends what queries youre losing. worth segmenting",
          "score": 1,
          "created_utc": "2026-01-28 14:50:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o288wv6",
          "author": "vinchenz112",
          "text": "FWIW I'm compiling our BuzzStream State of Digital PR 2026 and the overwhelming majority responded that digital PR is more effective than last year by a lot. Seems like that's where a lot are leaning for visibility given organic's dip.\n\n  \nMany sites are building owned audiences too!",
          "score": 1,
          "created_utc": "2026-01-28 15:27:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28cwuw",
          "author": "Reddygators",
          "text": "How would the group rate this for a strategy?  \n\nAdd custom video content aligning with website’s priorities.  If there are landing pages within the website for these key priorities, a video modified for each page.  \n\nTighten up the company YouTube channel and video titles descriptions thumbnails.  insure all Google YouTube platforms are connected properly and updated reflecting priorities.  \n\nMain Videos feature owner/spokesperson, product and credible client testimonials.  \n\nSnippets from a topic’s main video sprinkled across social media.  Track results, switch to next priority product/service.  \n\nWould this move the needle? If so how much? How soon?",
          "score": 1,
          "created_utc": "2026-01-28 15:45:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2aewbh",
          "author": "OrganicClicks",
          "text": "Rough timing to be taking over SEO leadership, the landscape is chaotic right now with AI overviews eating clicks. Look at improving topic authority over keywords because Google seems to favor sites that own entire topics, not just individual keywords. If you can include useful tools, or databases, would also help.\n\nIt could also be time to look at alternative traffic sources like YouTube SEO, newsletters and the like. Diversify before Google completely transforms.",
          "score": 1,
          "created_utc": "2026-01-28 21:07:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2au1ui",
          "author": "jello_house",
          "text": "Traffics dropping even with all the basics? Brutal but try automating consistent content creation with Nextblog AI does killer keyword research, gaps analysis, and pumps out SEO-optimized longforms that actually rank without you grinding daily. Doubled down there myself and its offsetting AI shifts better than manual stuff ever did.",
          "score": 1,
          "created_utc": "2026-01-28 22:13:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp6p7r",
      "title": "“We need a video” is not a strategy",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qp6p7r/we_need_a_video_is_not_a_strategy/",
      "author": "Salamandra_UK",
      "created_utc": "2026-01-28 09:23:54",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "I hear “we need a video” the same way I hear “we need a landing page”\n\nBut for what job?\n\n* conversion?\n* onboarding?\n* sales enablement?\n* retargeting?\n* brand trust?\n\nDo you brief creative based on funnel stage, or just “make it look good”?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qp6p7r/we_need_a_video_is_not_a_strategy/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o26otqn",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 09:23:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26s6kj",
          "author": "TemporaryKangaroo387",
          "text": "funnel stage 100%. ive seen so many \"lets make a brand video\" requests that end up being a $20k explainer that sits on youtube with 400 views while the sales team is screaming for a 30 second objection handler\n\nthe question i always push back with is: whats the one thing you want someone to DO after watching this? like specifically, not \"engage with the brand\"\n\nmost of the time the answer reveals what they actually need -- demo request? probably a product walkthrough with a clear cta. reduce churn? onboarding video with common friction points. close deals faster? sales enablement clip that addresses the top 3 objections from your lost deals\n\nvideo for \"brand awareness\" is usually code for \"we dont know what we want but everyone else has one\"",
          "score": 1,
          "created_utc": "2026-01-28 09:54:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o277v1f",
          "author": "JyoP2708",
          "text": "Honestly, “we need a video” without a job attached is how teams end up with nice-looking assets that don’t move anything. A video for top-of-funnel brand trust should feel completely different from one meant for retargeting or sales enablement, but a lot of briefs skip that part. I’ve found it helps to map examples by funnel stage first, then brief creative off those patterns instead of vibes. Tools like Socialmon are actually useful here you can search by topic and see what kinds of videos are performing at different stages, not just what “looks good.” Once the job is clear, the creative direction usually becomes obvious.",
          "score": 1,
          "created_utc": "2026-01-28 12:04:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnuong",
      "title": "What we learned trying (and failing) to track organic Instagram ROI - sharing our findings",
      "subreddit": "digital_marketing",
      "url": "https://www.reddit.com/r/digital_marketing/comments/1qnuong/what_we_learned_trying_and_failing_to_track/",
      "author": "Dense_Day7578",
      "created_utc": "2026-01-26 22:08:19",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 0.86,
      "text": "Hey everyone,  \nI run a small AdTech company and we’ve been banging our heads against the wall trying to prove which organic Instagram posts actually drive revenue vs. just engagement. Thought I’d share what we learned since I couldn’t find much practical info when we started.  \n**What didn’t work for us:**\n\n* Tracked links in captions/comments - complete dead end since Instagram disables clickable links on mobile\n* Trying to query the Instagram API for new followers after posts - there’s no official endpoint for this (as of Jan 2026), and scraping workarounds are risky if you’re managing client accounts\n\n**What actually worked:**\n\n* Tracked links in Stories, with posts/reels directing people to the story\n* Link-in-bio attribution tied to specific posts\n\nThe frustrating thing is Instagram deliberately makes this hard because they want you using paid ads for proper attribution. And “brand traffic” metrics that agencies use require enterprise-scale resources most smaller teams don’t have.  \nI wrote up our full breakdown including the specific approaches we tested on our Hacking Growth Substack.  \n  \nFull disclosure: I’m the founder of Leo AI, and we ended up building some of this into our platform. But the methods themselves work regardless of what tools you use - happy to answer questions about the approach itself.  \nHas anyone found other reliable methods? Curious what’s worked for others.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/digital_marketing/comments/1qnuong/what_we_learned_trying_and_failing_to_track/",
      "domain": "self.digital_marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o1wk49w",
          "author": "AutoModerator",
          "text": "[If this post doesn't follow the rules report it to the mods](https://www.reddit.com/r/digital_marketing/about/rules/). Have more questions? [Join our community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/digital_marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 22:08:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wtq6y",
          "author": "elcharrom",
          "text": "What about those reels that say \"read caption\" and just keep reproducing in loop while you read?",
          "score": 2,
          "created_utc": "2026-01-26 22:53:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1x5ny2",
          "author": "cuteman",
          "text": "You won't be able to get post-level attribution because the only clickable link is at the account level even with a UTM",
          "score": 2,
          "created_utc": "2026-01-26 23:54:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}