{
  "metadata": {
    "last_updated": "2026-01-27 16:59:04",
    "time_filter": "week",
    "subreddit": "Entrepreneurship",
    "total_items": 14,
    "total_comments": 119,
    "file_size_bytes": 110401
  },
  "items": [
    {
      "id": "1qiidj2",
      "title": "Need advice/a mentor. Business is booming , it feels like too much to handle sometimes. what do I do ?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qiidj2/need_advicea_mentor_business_is_booming_it_feels/",
      "author": "burgerknapper",
      "created_utc": "2026-01-21 00:13:03",
      "score": 20,
      "num_comments": 41,
      "upvote_ratio": 1.0,
      "text": "  Started a service business , business is going very well. Need to expand to take advantage of the large account I acquired. I also need to fix how we operate and get the office sorted out much better. But I essentially need to hire in more people , and potentially open another location soon. But I need help navigating all of that , it’s crazy to me. Didn’t expect to grow and need more help. And especially to grow in every direction like we are…. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qiidj2/need_advicea_mentor_business_is_booming_it_feels/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0rl35c",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 00:13:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0td6ga",
          "author": "Big_Tie_1153",
          "text": "Find someone whos exited a company before and pay for their time.",
          "score": 6,
          "created_utc": "2026-01-21 07:04:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xiwu8",
          "author": "alex_building",
          "text": "Stop growing in every direction at once.\n\nYou're trying to: expand, hire, fix operations, open new location, take big account.\n\nThat's 5 priorities. You'll execute none of them well.\n\nPick ONE for the next 90 days. Just one.\n\nEverything else waits.\n\nI run 3 businesses. The only way it works: 1-3 priorities max per week. Everything​​​​​​​​​​​​​​​​",
          "score": 3,
          "created_utc": "2026-01-21 21:27:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0xmqk6",
              "author": "burgerknapper",
              "text": "I’m trying to do everything at once because it’s all happening at once\n\nWe have had a big account for several months now and between the big account and our regular customers it got me to the point where I felt like I was working 24/7 \n\nAnd then now that I have had a good solid employee and they see that we’re getting more done. They just keep feeding us more work so I’m still staying busy basically 24/7 .\n\nWith the amount of work that we are doing, I feel like we should have 3 to 4 technicians in the field. Plus one person full-time in the office. Plus me putting out fires and handling emergency calls and special assignments.",
              "score": 4,
              "created_utc": "2026-01-21 21:44:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o107lku",
                  "author": "SellSideShort",
                  "text": "Welcome to the dream. Poster above is right though, it’s happening all at once but it can’t be handled all at once, not by one person anyways. \n\nTry sitting down with a pen and a pad, and make a plan to execute on all of these items, see what makes sense to do when, what can wait, what should be in place before the others are put in place, dependencies etc. Action items for each one on the list, and then get moving!",
                  "score": 1,
                  "created_utc": "2026-01-22 06:53:49",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o108w05",
                  "author": "alex_building",
                  "text": "Sounds like you're caught between capacity and demand.\n\nWhen you hired that first person, did things actually get easier? Or did it just create new problems like training, management, coordination?\n\nI ask because I've seen this pattern: hire more people thinking it'll solve the overload, but without clear systems, it just adds complexity.\n\nNot saying don't hire. But maybe what if you hired one more person AND spent time this month documenting how things should work?\n\nThat way when you scale to 3-4 people, they're not all coming to you for every decision.\n\nJust a thought. You know your business better than anyone here.\n\nWhat's your biggest bottleneck right now, finding good people, training them, or something else?",
                  "score": 1,
                  "created_utc": "2026-01-22 07:04:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o10aujk",
          "author": "embellishedmind",
          "text": "You are currently in what is called **'**Growth Death Zone' (in business). Kill the second location immediately. You cannot export a broken process. If you scale chaos, you scale bankruptcy. Do not sign a lease until the first office runs for 14 days without your physical presence.\n\nRegarding the 'Large Account', it is a liability until paid. If they pay Net-60 days, and you hire staff on Net-14 days, you will run out of cash in 45 days. Audit the terms. You do not need a 'mentor'; you need a Line of Credit or a Factoring arrangement to bridge the gap between payroll and the invoice payment. Don't hire more 'doers' yet. Hire an Operator (Office Manager/Admin). Their only job is to organize the chaos you create. Stop doing $20/hour admin work so you can do $500/hour strategy work. Stabilize the ship before you add more cargo.",
          "score": 2,
          "created_utc": "2026-01-22 07:21:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v9mmv",
          "author": "Technical_Project169",
          "text": "Rapid growth breaking systems is a good problem, but it burns founders fast.\n\nFirst thing I’d look at: what tasks must be done by you vs everything else.\n\nCurious, what’s currently taking most of your time day to day?",
          "score": 1,
          "created_utc": "2026-01-21 15:22:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wn66a",
          "author": "TheKirinX",
          "text": "Bro, you're doing great proud of you. You are actually doing much better than most of the people on Reddit. So this might not be a good place to ask. Either you find a mentor in person who has gone through your situation, try LinkedIn. Or, you hire consultants with scaling experience. Never as a butcher how to craft jewelry.",
          "score": 1,
          "created_utc": "2026-01-21 19:03:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ys5he",
              "author": "burgerknapper",
              "text": "Thank you",
              "score": 1,
              "created_utc": "2026-01-22 01:20:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0wr6fw",
          "author": "Spirited_Radio9804",
          "text": "What type of business?",
          "score": 1,
          "created_utc": "2026-01-21 19:21:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0wralv",
              "author": "burgerknapper",
              "text": "Automotive",
              "score": 1,
              "created_utc": "2026-01-21 19:21:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0xs37k",
                  "author": "Spirited_Radio9804",
                  "text": "As in sales, repair, rental, cleaning, transporting?",
                  "score": 1,
                  "created_utc": "2026-01-21 22:09:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0yk6be",
          "author": "mrclarkellc",
          "text": "That is a good problem to have. Where are you based?",
          "score": 1,
          "created_utc": "2026-01-22 00:35:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ykbaf",
              "author": "burgerknapper",
              "text": "Northeast USA , not too far from NYC",
              "score": 1,
              "created_utc": "2026-01-22 00:36:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0yrud3",
                  "author": "mrclarkellc",
                  "text": "Would love to learn more",
                  "score": 1,
                  "created_utc": "2026-01-22 01:18:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0z16id",
          "author": "Drumroll-PH",
          "text": "Growth beat your systems.\n\nPause expansion, fix operations, hire one strong ops hire. Do not open another location until this one runs without you.",
          "score": 1,
          "created_utc": "2026-01-22 02:11:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zmikw",
          "author": "D-Consulting",
          "text": "This is a stressful but good problem, and you are doing good! I would take a minor mental pause and really bring some experts (probably contract or fractional) to help in the areas that you are not as skilled as. Let them own the improvement and let them bring the ideas to you. Consider it an investment into that growth. \n\nFocus your attention on bringing in the expert support and the rest will come and stabilize! Key areas to really not lose sight of here is finance/accounting! You want to do all the things, but need to make sure the flow (or another solution) is there to support it. \n\nWould love to connect if you want to chat more or need a thought partner!",
          "score": 1,
          "created_utc": "2026-01-22 04:17:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zmsbl",
          "author": "BreakNational8627",
          "text": "I have 18 years in automotive experience, different sector it sounds but I do consulting now and I’d be happy to have a chat.",
          "score": 1,
          "created_utc": "2026-01-22 04:19:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10ph8q",
          "author": "Intelligent-Web-4678",
          "text": "Hey! I’ve worked as a business analyst for 15+ years, and what you’re describing is something I see all the time when a service business grows faster than the internal structure can support.\n\nWhen growth hits you from multiple directions (bigger accounts, hiring needs, operations breaking), it feels like you’re drowning, but usually it comes down to one thing:\n\nYour business outgrew the systems it was built on.\n\nA few things that might help you get your head above water:\n\nIdentify the bottleneck. Your biggest constraint right now is likely operational load, not demand.\n\nAsk yourself: “If I had to 2× tomorrow, what breaks first?” That’s the true problem.\n\nSeparate the business into two lanes:\n• Fulfillment (the service you deliver)\n• Infrastructure (the systems that support it)\nMost founders try to fix both at once and burn out.\n\nPrioritize one structural change, not ten.\nYou mentioned hiring + expanding + fixing operations.\nIt’s tempting to chase all of that.\nPick ONE change that gives you the most breathing room.\n\nIf you want, I’m running a small prototype where I help entrepreneurs map their business clearly and spot the bottlenecks holding them back. Happy to take a look and give you some direction at no cost, no pitch, just clarity.\n\nEither way, you’re not crazy, this stage hits every business that grows fast. Congrats again on all the clients :)",
          "score": 1,
          "created_utc": "2026-01-22 09:37:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10tinc",
          "author": "Natural-Guard375",
          "text": "Rapid growth is a good problem, but it often breaks systems before people realize it. The key is to shift focus from hustle to structure clear processes, delegation, cash-flow visibility, and defined KPIs. A mentor helps most when growth starts creating operational or decision fatigue.",
          "score": 1,
          "created_utc": "2026-01-22 10:15:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10zjvz",
          "author": "Brasdroitdirigeants",
          "text": "Ce que tu décris est très classique dans les boîtes de services quand **la traction arrive avant la structuration**.  \nLe problème n’est généralement pas “trop de travail”, mais plutôt que **tout grandit en même temps** : clients, équipe, décisions, charge mentale… sans cadre clair pour absorber ça.\n\nDans les situations comme la tienne, les points clés à travailler (dans cet ordre) sont souvent :\n\n1. **Clarifier ce qui doit absolument rester sous ta responsabilité** vs ce qui peut être délégué rapidement.\n2. **Stabiliser le fonctionnement actuel** avant d’ouvrir un nouveau lieu ou d’accélérer les embauches (processus, priorités, règles simples).\n3. Penser la croissance non pas comme “faire plus”, mais comme **faire autrement**, pour éviter que tout repose sur toi et permettre un développement futur sans t'épuiser.\n\nJ’accompagne des dirigeants de TPE/PME dans ce type de phase de croissance (quand ça va bien… mais que ça devient lourd à porter).  \nSi tu veux, tu peux m’écrire en message privé : je peux te poser quelques questions pour t’aider à y voir plus clair, sans engagement.",
          "score": 1,
          "created_utc": "2026-01-22 11:08:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o115mph",
          "author": "Mentor-Pak",
          "text": "It is good that you are growing have the right people with you built and believe let people bring their experience and expertise alongside. You need just the right blend of resource that can do the needful",
          "score": 1,
          "created_utc": "2026-01-22 11:56:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16fm5l",
          "author": "Opposite_Aside9554",
          "text": "Don’t do it alone and don’t do it all! Feel free to DM\nMe for advice, I have had two companies and learned valuable lessons that will share with you. Congrats on the success brother and I hope to talk to you soon!",
          "score": 1,
          "created_utc": "2026-01-23 04:02:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16gezu",
          "author": "Opposite_Aside9554",
          "text": "You need to fix processes and automate some tasks. Make SOPs and training. Get back office set up or fixed. Let’s talk",
          "score": 1,
          "created_utc": "2026-01-23 04:07:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19djto",
          "author": "Dry_Roll_749",
          "text": "Check out Thawe (https://thaweapp.com/). The main purpose is to help find connections and mentors. It’s relaxed and you just swipe through profiles until you find someone that match what you’re looking for and you can message them directly in the app. I think it could be a really good resource for you.",
          "score": 1,
          "created_utc": "2026-01-23 16:12:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1bxxnx",
          "author": "small-business-OS",
          "text": "This is the exact moment when structure matters most.\n\nGrowth without structure creates chaos. You're doing everything at once because nothing's been systematized yet.\n\nPick one priority for the next 90 days. Get operations stable, or hire right, or fix the office. Not all three.\n\nBuild one system before adding the next complexity. That's how you turn chaotic growth into controlled growth.\n\nTrying to do everything means nothing gets done well.",
          "score": 1,
          "created_utc": "2026-01-23 23:25:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20wcoa",
          "author": "fractionalconsultant",
          "text": "Always great to hear of new businesses booming. Operations can be tricky, especially when you scale quickly. Sounds like you picked the right vertical though",
          "score": 1,
          "created_utc": "2026-01-27 14:52:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vr6lz",
          "author": "Unable_Musician5446",
          "text": "Totally get this. I’ve been there too. When things started growing fast for me, the hardest part wasn’t getting clients, it was handling everything at once. What helped was getting outside support. I use CollabFabrik’s founder support service, and it honestly took a lot of pressure off. Having help with hiring, operations, and just thinking things through made the growth feel manageable instead of chaotic.",
          "score": 0,
          "created_utc": "2026-01-21 16:41:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qikqhi",
      "title": "What would you build or learn at 17 to make serious money later?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qikqhi/what_would_you_build_or_learn_at_17_to_make/",
      "author": "Designer_Okra_557",
      "created_utc": "2026-01-21 01:54:11",
      "score": 19,
      "num_comments": 58,
      "upvote_ratio": 0.91,
      "text": "I’m 17 and thinking long-term about wealth.\n\nIf you were starting over at my age with little capital, what skills, businesses, or paths would you focus on first?\n\nLooking for honest advice",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qikqhi/what_would_you_build_or_learn_at_17_to_make/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0s33f5",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 01:54:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t1mg4",
          "author": "Sea-Environment-5938",
          "text": "At 17 the goal isn’t “get rich fast,” it’s build rare skills + proof you can ship. If you can learn to create value for someone else and communicate it clearly, money shows up later. What do you enjoy more: building stuff, selling stuff, or managing people?",
          "score": 10,
          "created_utc": "2026-01-21 05:29:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0vwbi4",
              "author": "Ill_Reality180",
              "text": "agree!",
              "score": 1,
              "created_utc": "2026-01-21 17:04:45",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1axdrs",
              "author": "Cool-Net-1902",
              "text": "Any examples of those \"rare\" skills?",
              "score": 1,
              "created_utc": "2026-01-23 20:27:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tji3o",
          "author": "lovescro",
          "text": "Sales and marketing. Master these and everything else is much easier.",
          "score": 6,
          "created_utc": "2026-01-21 08:01:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t7sxi",
          "author": "Drumroll-PH",
          "text": "I’d focus on learning one skill that sells directly, like sales, coding, or paid ads, and get real reps as fast as possible. The biggest advantage at that age isn’t money, it’s time to suck early and compound later.",
          "score": 3,
          "created_utc": "2026-01-21 06:18:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0xo7jv",
              "author": "Electrical_Archer965",
              "text": "Would video editing fall into this category",
              "score": 2,
              "created_utc": "2026-01-21 21:51:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0yrt0j",
                  "author": "Major-Fuel6891",
                  "text": "I would like to know myself, been thinking about learning to add along with a few other skills I have.",
                  "score": 1,
                  "created_utc": "2026-01-22 01:18:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0vwd88",
              "author": "Ill_Reality180",
              "text": "true",
              "score": 1,
              "created_utc": "2026-01-21 17:04:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1xxsuu",
              "author": "Individual_Turn_9154",
              "text": "That last part is something I didn't think about. Too focused on getting immediate results",
              "score": 1,
              "created_utc": "2026-01-27 02:23:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tshgw",
          "author": "the-techpreneur",
          "text": "I would think of skills I wish I had in 10 years. Don't think about wealth. Think about who would a person who makes that wealth be? What skills and traits would he have? How would be spend his day? Then try to become that person",
          "score": 3,
          "created_utc": "2026-01-21 09:27:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uiyls",
          "author": "Capital-Way5517",
          "text": "You could focus on building your personal brand first. People follow people they connect with, and when they like you, they’re more likely to support and buy from you. That’s where I’d start.",
          "score": 3,
          "created_utc": "2026-01-21 13:01:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0vwfs9",
              "author": "Ill_Reality180",
              "text": "Indeed!",
              "score": 1,
              "created_utc": "2026-01-21 17:05:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0td1dx",
          "author": "Big_Tie_1153",
          "text": "Get into info sales or any type use that money to run a business. U can always sell yourself out of a bad situation",
          "score": 2,
          "created_utc": "2026-01-21 07:03:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u0frw",
          "author": "Upbeat-Employer-3194",
          "text": "Hello, I'm currently working on a platform designed to help people build a business using AI agents (business plans, logos/branding, pitch decks, landing pages, grant submissions etc.) You just need to prompt one idea and the agents will build a full business plan and project plan. Would you be interested in testing the full platform and sharing feedback with me?",
          "score": 2,
          "created_utc": "2026-01-21 10:42:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1dmsq2",
              "author": "Free-Employee-1070",
              "text": "sir",
              "score": 1,
              "created_utc": "2026-01-24 05:29:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1sdsvq",
                  "author": "Upbeat-Employer-3194",
                  "text": "I've sent you a DM. Let me know :)",
                  "score": 1,
                  "created_utc": "2026-01-26 08:59:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0uo03y",
          "author": "alex_building",
          "text": "At 17: Build one skill deeply. Not 10 skills poorly.\n\nPick something where you can get paying customers within 6-12 months. Prove you can deliver value.\n\nThe biggest advantage you have at 17: Time to fail and learn.\n\nMost people at 17 chase \"get rich quick.\" You're already thinking long-term. That's rare.\n\nMy advice: Pick one thing. Get good at it. Get paid for it. Build proof.\n\nThen at 20-25, you'll have:\n- A real skill\n- Paying customers\n- Credibility\n- Options\n\nDon't spread thin across 5 ideas. Go deep on one.\n\nExecution​​​​​​​​​​​​​​​​ :)",
          "score": 2,
          "created_utc": "2026-01-21 13:31:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1axty9",
              "author": "Cool-Net-1902",
              "text": "Do you have any examples of those skills? I am looking to improve myself but I am not sure where to start and what to do",
              "score": 1,
              "created_utc": "2026-01-23 20:29:45",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1nmdhn",
              "author": "Special_Leek_1370",
              "text": "I would suggest taking a look at what you value about yourself.  Dependability, Independence, Kindness.  I use ACT a lot with clients, Russ Harris has a great list of values.\n\nTaking that in, can help you determine skills: timeliness, communication, critical thinking.  \n\nThose skills are used in a lot of areas.  What do you enjoy doing, have passion for that align with your values?  Go shadow someone, go be curious about it.  When you love what you do, it's rarely a job.\n\nAdditionally for the OP: Follow through with regular setting aside money into a 401K, and leveraging your funds in savings, or investments, and learning a lot of basic financial information.",
              "score": 1,
              "created_utc": "2026-01-25 17:44:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0vw826",
          "author": "Ill_Reality180",
          "text": "If I were 17 and thinking long term, I’d focus on skills that compound, not quick money.\n\nI’d pick one high income skill like sales, copywriting, coding, video editing, data, or automation and stick to it. One skill done well beats chasing ten things halfway.\n\nI’d learn how businesses actually make money. Offers, pricing, distribution, and why people buy. Talent doesn’t matter much if you don’t understand this.\n\nI’d start building proof early. Small projects, freelancing, internships, helping businesses even for free at first. At 17, you can mess up without real consequences.\n\nI’d get comfortable with sales and communication. Being able to explain value and persuade ethically is a life cheat code.\n\nI wouldn’t chase passive income yet. I’d focus on active income, then turn skills into leverage later.\n\nGoal isn’t money at 17. It’s becoming very competent by 25. Money follows that.",
          "score": 2,
          "created_utc": "2026-01-21 17:04:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x15fw",
          "author": "kbk3173",
          "text": "I’ve made over a million euro I’m 29M. It’s not that much but I have the experience in hindsight. \n\nI would pick up an industry where I can make big bucks and I would go study that at Uni + Coursera.   \n\nYou just want to make sure that you become competent and that there is demand for whatever you choose to pursue. The rest will sort itself out. \n\nThen develop social skills and discipline around your earnings, don’t spend too much money on dates etc. Reinvest in your skills, until you’re about 25. You’re the single best investment you’ll make.",
          "score": 2,
          "created_utc": "2026-01-21 20:06:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xk0h4",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-21 21:31:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0xnxyf",
              "author": "Xaymaca_",
              "text": "Definitely worth researching. Like the book think and grow rich, it’s about being open to the universe which is always providing infinite opportunities. Any opportunity that comes I believe deserves researching",
              "score": 2,
              "created_utc": "2026-01-21 21:49:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0xn8ne",
              "author": "DCASPX6900",
              "text": "Even if you just buy a couple of coins and hold them for a long time, it could be a great deal in the future. It won’t cost you a lot to just dip your toes in. If you have any questions, feel free to just ask them here. :)",
              "score": 1,
              "created_utc": "2026-01-21 21:46:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0xrqyu",
              "author": "realcryptocow",
              "text": "I’ve worked at a FAANG, exited one of my own companies, was a part of an AI startup (acquired) for 3 years w funding from the largest companies in the US, and I’ve failed quite a few times.\n\nCapital formation is increasingly \n1. Onchain\n2. Decentralized\n\nDemosthenes speaks the truth. AI has commoditized innovation. The final moat is a congregation of believers.",
              "score": 1,
              "created_utc": "2026-01-21 22:07:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0yy82w",
              "author": "undy_aeon",
              "text": "100%",
              "score": 1,
              "created_utc": "2026-01-22 01:54:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0xojed",
          "author": "Daytoven55",
          "text": "If the goal is to make serious money later learn\n\n1. Sales (i hate to admit everything seems to be all tied to sakes at the end of the day, just be good at it. Add empathy, I'm introverted)\n\n2. Basic Psychology (why we behave, think or act the way we do, why certain people want certain things at a certain time)\n\n3. Communication (especially how to pitch); Learn how to communicate ideas as quickly as possible (as someone that gives a lot of attention to details, learning this was somehow strange) \n\n4. Understand the basics of finance (Learn cashflow statement, balance sheet and income statement, understand working capital, it's the life bar in the game we play called \"business\")\n\n5. Learn whatever you want to learn (maybe what you are passionate about)\n\n6. You could take it a step further by learning about the basics of economics.\n\n\n  At the end, permit me to say, just have enough conviction in what you set out to do.. if it works out, everything falls into place (most times)\n\nLet me throw in this one\n\n7. Know yourself (your capabilities, and what you wish they would be in future, your current limitations, and what they might be in future, your weaknesses, what they might be in future, what guardrails you need to put in place now and what guardrails you might need to put in place in the future etc etc...)\n\nDepending on your situations.. you may not be bothered about money now. \n\nYou may choose to Divide the year into 2 or 3 months and learn each of these, even if it's just for 1hr each day. (I did this through 2023/24) \n\nI failed to learn some things like communication (pitching aspect) until last Year when I set about building a company and realized I had to depend on my co-founder to do the pitching (he wasn't really communicating the ideas well enough. I had to learn by listening, doing, failing, learning, & doing it again)\n\nHowever, I learnt almost every other thing here, and the roi is Good.",
          "score": 2,
          "created_utc": "2026-01-21 21:52:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0upnh6",
          "author": "AdministrationOk3987",
          "text": "Learn as many skills as possible to monetize it later.",
          "score": 1,
          "created_utc": "2026-01-21 13:40:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uv3t6",
          "author": "NullTerminator99",
          "text": "If all you want from life is wealth you are setting yourself up for disappointment. Even the best laid plans can come to ruins and wealth is not guaranteed. I am not saying a good career and financial stability aren't important because they are. But what i am saying is you should consider asking some deeper questions about life.   \n  \nStatistically i am sorry to say but serious $$ don't always go to the hard working or the smart.  Luck and chance happen to us all. There is a quote that basically says this \"if working hard made you rich donkeys would be covered in gold\" \n\nI have also known people who make great money but are always broke (lifestyle creep and poor life partner choices can burn you real good)\n\nyou can make serious money as a Doctor, Lawyer, Software Engineer, Investor, running a septic tank service business etc.. Your asking someone to predict the future \"If i do A i will get B\" Sorry life don't work that way.\n\nJust keep making the wisest most logical choice you can given you gifts, talents, interests, and resources and I hope the best for your future.",
          "score": 1,
          "created_utc": "2026-01-21 14:09:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uwdgf",
          "author": "PavelBoss13",
          "text": "Where are you from? How much money do you want? $100 per month or $10,000 per month?",
          "score": 1,
          "created_utc": "2026-01-21 14:16:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0uyryd",
              "author": "Designer_Okra_557",
              "text": "I’m based in new york , as much as i can make to be honest",
              "score": 2,
              "created_utc": "2026-01-21 14:28:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0uzkdw",
                  "author": "PavelBoss13",
                  "text": "Approx How much money do you want?",
                  "score": 1,
                  "created_utc": "2026-01-21 14:33:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0v474g",
          "author": "ConstantPhotograph77",
          "text": "communication skills. aka  gift of the gab.  I began doing standup in college.  Very extraverted with a father who was a professional actor { wasnt a stretch for myself}   If you can become comfortable performing in front of a crowd  you are way ahead of most people entering business, entrpreneurial field..",
          "score": 1,
          "created_utc": "2026-01-21 14:56:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v91av",
          "author": "StillLoadingit",
          "text": "At 17 I would focus on building real skills like selling, networking, and solving problems people actually care about so you can make money from day one. Try testing ideas with customers early and keep iterating based on feedback because that will teach you way more than theory alone.",
          "score": 1,
          "created_utc": "2026-01-21 15:19:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v97ix",
          "author": "Embarrassed_Key_4539",
          "text": "I did an exchange program my junior year in high school, I attended a public school and had no knowledge of the language. That year made me the most resilient, capable person and I really attribute it to a lot of my success later in life.",
          "score": 1,
          "created_utc": "2026-01-21 15:20:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wczgq",
          "author": "Developer68",
          "text": "Sell something people actually need or want",
          "score": 1,
          "created_utc": "2026-01-21 18:18:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wf33w",
          "author": "Scott_Malkinsons",
          "text": "Learn what compound interest is; and how to use it to build wealth, not take wealth away from you.",
          "score": 1,
          "created_utc": "2026-01-21 18:27:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wxvou",
          "author": "BusinessStrategist",
          "text": "Know your limitations and master the art of working effectively with others to fill in those gaps.\n\nAnd yes, sales skill is all about people skills.\n\nAnd do google “business for dummies.”\n\nThe dummies books give you an easy to learn framework for identifying the large amount of stuff that “you don’t know that you don’t know.”\n\nYou can always find ways to “fill in gaps” and “overcome obstacles” if you know where to look.",
          "score": 1,
          "created_utc": "2026-01-21 19:51:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wzl0h",
          "author": "Here-For-The-Tea2000",
          "text": "Think of industry that machine/robots/AI can’t do. HVAC, Plumbing, welder, pipe fitter, trades that take people and decision making on the fly plus ppl skills. Then tie in some sort of making it easy to get those people, an easy website that works with a bunch of folks in the trade, kinda like a union, and then you’re filling a need that’s needed forever. Even more niche, a cobbler, or something like that….",
          "score": 1,
          "created_utc": "2026-01-21 19:59:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0y8s9h",
          "author": "Jeffrey_Banks6900",
          "text": "Use all my free cash to DCA Apple. In 2006 Apple was essentially a sleeping giant. iPod era, iPhone not even released yet, strong brand, loyal users, with a culture forming. I would have bought and held without touching it for decades.\n\nIf I was 17 today?  DCA spx6900",
          "score": 1,
          "created_utc": "2026-01-21 23:34:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ypdwe",
          "author": "Dihsael",
          "text": "Stock market.",
          "score": 1,
          "created_utc": "2026-01-22 01:04:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o101if6",
          "author": "SeraphSurfer",
          "text": "I was cleaning toilets late at night at age 17 for min wage.  I found out my boss was charging 5x min wage.  So I started my own cleaning company.  \n\nFor a kid,  I was making good money, more than my teachers.  It paid for my college but more important,  I learned how much I liked being an owner and gave me direction.",
          "score": 1,
          "created_utc": "2026-01-22 06:03:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10c888",
          "author": "Fuzzy_Tangelo_4702",
          "text": "How to save&invest. Starting early and building money discipline makes a huge difference in the long run, no matter you income or career.",
          "score": 1,
          "created_utc": "2026-01-22 07:34:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10po7b",
          "author": "FreedomNormal2113",
          "text": "Learn to code, sell something online.",
          "score": 1,
          "created_utc": "2026-01-22 09:39:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11bmj2",
          "author": "protagonist_888",
          "text": "Negotiation and story telling. No one teaches you either in school. Sure you learn “sales” skills but learning to sell is not story telling. Story telling goes much deeper than sales and builds connection with your audience. If you can do both and find ways to consistently apply under any setting, you will do well.",
          "score": 1,
          "created_utc": "2026-01-22 12:38:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1215i3",
          "author": "TheOGGizmo",
          "text": "I would nurture my brain better if I was 17 again",
          "score": 1,
          "created_utc": "2026-01-22 14:57:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12wosx",
          "author": "Hella-Rock",
          "text": "As someone your age 17, I've already started my own innovative idea using agricultural products in different ways. You can check out my post if you want. My advice start with whatever resources you have,whether from your family or your own, and make something unique out of it!",
          "score": 1,
          "created_utc": "2026-01-22 17:22:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16umvg",
          "author": "Portfoliana",
          "text": "Learn to code (basics), learn to sell (most underrated skill), and learn to write clearly. Those three unlock everything.\n\nCoding lets you build stuff without paying developers. Sales means you can monetize anything. Writing is how you communicate at scale - emails, landing pages, content.\n\nAlso: start investing now, even if its just $50/month into an ETF. At 17, time is your biggest advantage. Compounding over 40+ years is insane.\nDont overthink it - just start building random stuff and putting it out there. You’ll learn more from shipping one crappy project than from 100 hours of tutorials.​​​​​​​​​​​​​​​​",
          "score": 1,
          "created_utc": "2026-01-23 05:43:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o176mdz",
          "author": "SayYesEnterprises",
          "text": "Great question. The fact that you’re asking this puts you ahead of so many! I started my first “really” successful business at 24 years old. (Sold that company when I was 31) \n\nI’d recommend you invest heavily into these 3 core areas: \n-sales training \n-public speaking training \n-business development (learning about business models, business growth, investments) \n\nBonus points if you turn around and teach someone else what you learn. In addition to being generous to others, this will actually help you learn those things better by teaching.",
          "score": 1,
          "created_utc": "2026-01-23 07:19:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a83i7",
          "author": "CK_LouPai",
          "text": "Becoming multilingual.",
          "score": 1,
          "created_utc": "2026-01-23 18:30:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1byvhg",
          "author": "jsnuggz",
          "text": "Depends what you are willing to do and what you like. Id advise a trades job, getting gold certified and starting a business. You can easily make 100k+ working for yourself then build a company. As long as you are willing to do hard work and lead.\n\nFigure out what you like to learn about and turn it into a job or business. Doing something satisfying makes work feel less like work.",
          "score": 1,
          "created_utc": "2026-01-23 23:30:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0s42hm",
          "author": "Euphoric-Set-2227",
          "text": "I’m 18 and im asking the questions",
          "score": 1,
          "created_utc": "2026-01-21 01:59:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qme5ux",
      "title": "What brought you the most leads",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qme5ux/what_brought_you_the_most_leads/",
      "author": "Akraam_Gaffur",
      "created_utc": "2026-01-25 08:58:39",
      "score": 11,
      "num_comments": 13,
      "upvote_ratio": 0.92,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qme5ux/what_brought_you_the_most_leads/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o1l751r",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-25 08:58:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1njori",
          "author": "Capital-Way5517",
          "text": "Google. Getting your business on google.",
          "score": 5,
          "created_utc": "2026-01-25 17:33:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ntkkn",
          "author": "FatherOften",
          "text": "I always just searched google maps for commercial truck repair shop plus whatever the city name is. More results than I could shake a stick at.",
          "score": 3,
          "created_utc": "2026-01-25 18:14:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ntp9t",
          "author": "shaon343",
          "text": "ranking website on google's top position is the best thing we did. Right now, we are just trying to get cited by ai tools along with SEO.",
          "score": 2,
          "created_utc": "2026-01-25 18:15:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1nw11w",
          "author": "Foreign_Tower_7735",
          "text": "Lead magnets",
          "score": 2,
          "created_utc": "2026-01-25 18:24:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1p26ma",
          "author": "Virtual-Ad0459",
          "text": "My Local SEO built my business really quick. \nMy Facebook community group posts second. \nWord of mouth is now coming third.",
          "score": 2,
          "created_utc": "2026-01-25 21:26:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1qr6oo",
          "author": "DeviantHistorian",
          "text": "Word of mouth",
          "score": 2,
          "created_utc": "2026-01-26 02:15:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1s6y0f",
          "author": "Overall-Lead-4044",
          "text": "Networking, especially referral networking groups like BNI",
          "score": 2,
          "created_utc": "2026-01-26 07:58:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1voqcm",
          "author": "Intelligent-SBCA",
          "text": "SEO works and now we are starting with social media (LinkedIn)",
          "score": 1,
          "created_utc": "2026-01-26 19:49:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qiu52d",
      "title": "i have 3d modeling, 3d printing experience i got 5k to invest should i do service or build product ?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qiu52d/i_have_3d_modeling_3d_printing_experience_i_got/",
      "author": "Mysterious_Note5146",
      "created_utc": "2026-01-21 10:12:04",
      "score": 8,
      "num_comments": 11,
      "upvote_ratio": 0.9,
      "text": "hello ,  \nim trying to make something sense 2 months ago but nothing is working.  \nwhat you guys could you do in 2026 to make money !  \nalso i quit a job that making 3k a month to invest in a business !\n\ni have 3d printer , 3d cad , modeling experince and capital also up to 5k to invest .  \nshould i go for offline business / online ?  \nshould i do e commecrce for cash flow or anything else ?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qiu52d/i_have_3d_modeling_3d_printing_experience_i_got/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0tx4pl",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 10:12:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10n06m",
          "author": "nilkanth987",
          "text": "With your background and limited runway, I’d start with services first, not a product. Services give cash flow, feedback, and market insight. Products are way riskier without proof of demand.",
          "score": 2,
          "created_utc": "2026-01-22 09:13:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10vt8o",
              "author": "Mysterious_Note5146",
              "text": "Ill tried in fivver and upwork..\nI didnt get a single job thats why im thinking in a selling a product.\nOr build a e commerce for cash flow from anything else .",
              "score": 2,
              "created_utc": "2026-01-22 10:35:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1j3h51",
          "author": "whitelabelsolutions",
          "text": "Products but offer custom one offs as a service until you get the products rolling",
          "score": 2,
          "created_utc": "2026-01-25 00:40:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tzj5g",
          "author": "TokxoDev",
          "text": "Why did you quit your job? What if an idea works and your running out of money?",
          "score": 1,
          "created_utc": "2026-01-21 10:34:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u2frz",
              "author": "Mysterious_Note5146",
              "text": "first my job was in field i hate .  \nand also im took a step to force my self to work ..  \nalso if i feel im not doing well ill back to a job which im interested in it ! not working only for money !   \nany idea my friend ?",
              "score": 1,
              "created_utc": "2026-01-21 10:59:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10vvab",
          "author": "OmariBangs",
          "text": "can you create video game levels or maps? if so let’s talk",
          "score": 1,
          "created_utc": "2026-01-22 10:36:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10vzt8",
              "author": "Mysterious_Note5146",
              "text": "Hey , my friend i do things in fusion or blender but only in stl for 3d printing ..",
              "score": 1,
              "created_utc": "2026-01-22 10:37:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qjrxjj",
      "title": "Surviving the dark phase",
      "subreddit": "Entrepreneurship",
      "url": "https://v.redd.it/9nvuvpm5xveg1",
      "author": "nucleus2024",
      "created_utc": "2026-01-22 11:18:23",
      "score": 8,
      "num_comments": 20,
      "upvote_ratio": 0.65,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qjrxjj/surviving_the_dark_phase/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o110s8y",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-22 11:18:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o135am7",
          "author": "FatherOften",
          "text": "This is the way this is the reality.For many.",
          "score": 6,
          "created_utc": "2026-01-22 18:01:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o13f799",
              "author": "nucleus2024",
              "text": "For me too",
              "score": 2,
              "created_utc": "2026-01-22 18:44:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o13hsol",
                  "author": "FatherOften",
                  "text": "It's worth it though, because of the person you become. Everything else can be taken away or disappear due to tragedy or accident or bad timing or just life.\n\nWho you become is a unique bundle of skills, knowledge, experience and character.\n\nWith those things, you can reaccomplish anything at any time. As long as you're still breathing.",
                  "score": 2,
                  "created_utc": "2026-01-22 18:56:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o116zi9",
          "author": "sushiwit420",
          "text": "What’s her company?",
          "score": 2,
          "created_utc": "2026-01-22 12:06:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o122kyd",
              "author": "nucleus2024",
              "text": "Fuelled",
              "score": 2,
              "created_utc": "2026-01-22 15:04:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o13hjk5",
                  "author": "sushiwit420",
                  "text": "I saw a bunch of companies with the same name. Which one is it ? Oil related or an agency",
                  "score": 2,
                  "created_utc": "2026-01-22 18:54:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o12d233",
          "author": "PersonoFly",
          "text": "She was just about to tell you what that thought was……. then changed the subject.. 🤷🏻‍♂️",
          "score": 2,
          "created_utc": "2026-01-22 15:54:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o178iei",
          "author": "AnonJian",
          "text": "Three years, no money. What do you want to bet they were calling whatever they were developing a Minimum Viable Product without ever thinking about it.\n\nAnd then they made some money. Not minimal. Not viable.\n\nWhile this is the way, and I approve of survival instinct driving the venture forward, it's a crappy way. Founders make obvious bad decisions and fight themselves every step of the way. Just to finally figure out supply does not force demand to manifest automagically. Dull instincts for survival need to be honed. \n\nIt's not the struggle, it's the completely avoidable boring problems wantrepreneurs wallow in that sucks. At the end of they day, the source of all those problems stares back from a mirror. This shouldn't be called the dark phase. It should be called something like *getting over yourself*.",
          "score": 2,
          "created_utc": "2026-01-23 07:36:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1o5327",
          "author": "AdOutrageous1751",
          "text": "more info on them? how are they now?",
          "score": 2,
          "created_utc": "2026-01-25 19:01:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1o7r9j",
              "author": "nucleus2024",
              "text": "Check her Insta handle, mentioned below the video",
              "score": 1,
              "created_utc": "2026-01-25 19:13:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1w8qzv",
                  "author": "AdOutrageous1751",
                  "text": "lol I didnt even see it ... thanks!",
                  "score": 2,
                  "created_utc": "2026-01-26 21:17:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qna3k5",
      "title": "Problem with getting new clients",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qna3k5/problem_with_getting_new_clients/",
      "author": "Elmo_1337",
      "created_utc": "2026-01-26 08:04:34",
      "score": 8,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "I have a small webdesign agency in germany, we started a year ago and had a couple of clients, but now we have problems with getting new one's. We already post on instagram and of course have our own Website with good SEO. \n\nWhat worked for you ? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qna3k5/problem_with_getting_new_clients/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o1s7mje",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 08:04:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sa8u0",
          "author": "ASLegend",
          "text": "Getting the first few clients is the hardest part and you have got that covered. The next best step is to ask your previous clients for referrals. You can also partner with other agencies who are not your direct competitors like marketing agencies. They can refer clients to you for web development and you can refer them clients who are in a need for marketing service.",
          "score": 4,
          "created_utc": "2026-01-26 08:27:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vfigc",
          "author": "vmco",
          "text": "Yep. A few things that worked: \n\n1. Cold called small businesses. I built an entire agency from just picking up the phone and dialing local businesses. Note: Do not try to sell on the first call - it won't work.  \n2. Built relationships. Would strongly suggest that you get to know your local businesses - they all belong to similar organizations/clubs  and know each other - we began to receive regular referrals.  \n3. Niched down into a specific industry. Marketing, messaging, and referrals became much easier.  \n4. Stopped selling websites. Most business owners do not care about websites. They care about solutions and results so instead, my agency sold 'Marketing Solutions' (Packaged several services together to get them to the end result).\n\nOnce you get your process, offers and experience locked-in it will become easier to scale with partners, affiliates, and other complimentary businesses.\n\n  \nHope this helps!",
          "score": 4,
          "created_utc": "2026-01-26 19:09:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1w86qs",
              "author": "TheKirinX",
              "text": "Thanks! If not try to sell on first call, what to talk about? Not weather for sure",
              "score": 2,
              "created_utc": "2026-01-26 21:15:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1x08bk",
                  "author": "vmco",
                  "text": "Haha!\n\nWell, of course if you happen to possess the ability to 'One Call Close', you don't need to spend time on Reddit - you would be too busy on the phone closing ;-)\n\nSure, what worked for me was just starting with a casual intro (Who you are and why you are calling). \n\nSomething very simple such as:  \n\nHi (\"Name\"), I'm the owner of (\"Agency\"). We are a small startup here in (\"Name of city\") and I'm reaching out to other business owners in the area to talk about (eg. \"Getting more foot traffic or how their getting customers - what's working or not\") --or -- I'm hoping to set up a quick call with you to talk about (\"Benefit you provide to common problem\"). Would you be open to quick 10 minute call?\n\nThe above may not work for every prospect, but the objective in the first call was always to set a meeting, but sometimes they would want to speak right then so be prepared.\n\nEither way, just relax and be yourself - it goes a long way.\n\nCheers.",
                  "score": 1,
                  "created_utc": "2026-01-26 23:26:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1wr0cs",
              "author": "Elmo_1337",
              "text": "Thanks, thats some really good advice",
              "score": 2,
              "created_utc": "2026-01-26 22:40:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1u214o",
          "author": "StillLoadingit",
          "text": "Getting new clients is always tough at first because it takes time to find where the people who actually need you are hanging out. Talking to them, understanding their goals, and testing simple offers until something sticks will make it way easier over time.",
          "score": 2,
          "created_utc": "2026-01-26 15:37:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1s9023",
          "author": "Expensive-Lion3464",
          "text": "Ask your existing clients to refer you.",
          "score": 1,
          "created_utc": "2026-01-26 08:16:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnsa7m",
      "title": "Hello everyone. I want to introduce myself.",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qnsa7m/hello_everyone_i_want_to_introduce_myself/",
      "author": "Glittering-Result402",
      "created_utc": "2026-01-26 20:42:26",
      "score": 7,
      "num_comments": 15,
      "upvote_ratio": 0.89,
      "text": "I am a 37yo female from Maine, USA and after spending the majority of my life denying where in life I feel more like myself, I'm looking to get into entrepreneurship. Business in general feels so fitting for me, but I don't know what spaces to spend time in on or off the internet. \n\nI'm doing as much self education as I can.\n\nEdit: Does anyone have anyone have any recommendations?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qnsa7m/hello_everyone_i_want_to_introduce_myself/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o1w0uqj",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 20:42:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w605i",
          "author": "Prior_Low_6269",
          "text": "You’re not behind, you’re at a very normal (and honest) starting point.\n\nOne thing that helps early is not trying to “pick a business,” but picking rooms to spend time in. Entrepreneurship usually comes from exposure before ideas.\n\nA few directions that tend to work well:\n\t•\tCommunities where people talk openly about problems they’re dealing with (small business, operations, wellness, local services, creators)\n\t•\tSpaces where you already feel some pull, even if you don’t know why yet\n\t•\tLearning by helping first (support roles, coordination, research, operations) before trying to lead something\n\nInstead of asking “what should I build?”, ask:\n\t•\tWhat kinds of problems do I naturally pay attention to?\n\t•\tWho do I enjoy helping?\n\t•\tWhat conversations make me feel more energized instead of drained?\n\nIf you want, I’m happy to suggest specific communities or paths, it just helps to know what’s felt most “like you” so far, even outside of work.",
          "score": 3,
          "created_utc": "2026-01-26 21:05:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xe9wp",
          "author": "Purple_Ride5676",
          "text": "I do affiliatemarketing its a business model where you promote companies products for commissions through their affiliate programs. You will be working for yourself. Also you will be learning new skills (digital marketing skills) I am with a program that provides the training and tools for the beginner to get started. You need to learn and be consistent to see results. Will share more if curious",
          "score": 2,
          "created_utc": "2026-01-27 00:38:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z0ics",
          "author": "Mentor-Pak",
          "text": "Search for nearby incubation centre and join them, attend events, seminars, conferences",
          "score": 2,
          "created_utc": "2026-01-27 06:31:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wbeb0",
          "author": "Nervous_Brilliant441",
          "text": "Lean startup by Eric Ries. It shows you how to validate ideas without spending too much money, so you don’t build stuff no one wants.",
          "score": 1,
          "created_utc": "2026-01-26 21:29:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zxyar",
              "author": "Extreme-Layer-1201",
              "text": "Good book but note that it is more so for experimental tech startups",
              "score": 1,
              "created_utc": "2026-01-27 11:27:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1x3w7y",
          "author": "jo0stjo0st",
          "text": "Talk to as many entrepreneurs in real life as you can. Join a local business club, or several. Entrepreneurs will be happy to talk to someone who's really motivated.",
          "score": 1,
          "created_utc": "2026-01-26 23:45:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yk7kf",
          "author": "SmoothBizOperator",
          "text": "Congrats and welcome to the wonderful, but chaotic world on entrepreneurship! One thing I like to encourage people with, is to really focus on your “why.” \n\nAnyone can jump into being a business owner, but I feel it’s the ones who really discover their “why” will not only have what it takes to push themselves towards success, but also can use their why to pull them out of the hard times and propel them forward. \n\nI would encourage you to check out Simon Sinek and his book Start with Why in part of your discovery process. Lastly, whatever I do, I like to focus on making meaning over money. Every time I follow this path it is great what I accomplish and I always make money along the way, because my passion comes alive! When I focus on how much money I’m going to make, nothing impactful ever is born and definitely no money is made.",
          "score": 1,
          "created_utc": "2026-01-27 04:33:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zcc3e",
          "author": "PavelBoss13",
          "text": "What are you already learning? Do you read books about finance or self-education? Do you have experience in entrepreneurship?",
          "score": 1,
          "created_utc": "2026-01-27 08:13:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zqjwu",
          "author": "salim_hariz",
          "text": "Find your passion and go beyond it. There are many opportunities to brainstorm and get ideas and support. Explore it. Perfectly plan everything before jumping into it.",
          "score": 1,
          "created_utc": "2026-01-27 10:25:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o204cz3",
          "author": "Motor_Object_6181",
          "text": "Welcome. You’re in the right place, and also in a very noisy one.\n\nOne thing I wish someone had handed me early on is The E-Myth by Michael Gerber. Not because it tells you what business to start, but because it clears up a huge misunderstanding most of us walk into entrepreneurship with.\n\nThe short version is this: being interested in business and being good at a skill are not the same as building a business that works without eating your life. That distinction alone can save years of frustration.\n\nAs for “where to spend time online,” I’d be careful there. A lot of spaces feel productive but mostly keep you consuming instead of building. Books and long-form thinking tend to give a better foundation early on than bouncing between platforms.\n\nCurious what pulled you toward entrepreneurship in the first place. Was it freedom, creativity, control, or something else?",
          "score": 1,
          "created_utc": "2026-01-27 12:16:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20gxjk",
          "author": "Stratis-gewing",
          "text": "Definitely not too late! Many of the most successful startups are run by folks who are 45 according to HBR.\n\nhttps://hbr.org/2018/07/research-the-average-age-of-a-successful-startup-founder-is-45\n\nPersonally, the best advice I've received is to find something that you really enjoy and then get good at it.  By immersing yourself in a community you are exposed to the problems in that community and can help solve them.  For example, I work with a lot of small to medium size businesses in my day-to-day job and saw that many of them struggle to find smart, confidential experts who can help those business execs brainstorm and evaluate ideas from diverse perspectives. But the solution to that only came from being with people and talking to people all the time.  \n\nGood luck!",
          "score": 1,
          "created_utc": "2026-01-27 13:33:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20i398",
          "author": "Marksp245",
          "text": "Find your local SBDC (Small Business Development Center) office and visit them (Google Maine SBDC for the signup link). They are a free resource for small businesses anywhere in the small business life cycle. They can help you with deciding what industries and businesses might be right for you to get into.",
          "score": 1,
          "created_utc": "2026-01-27 13:39:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qix2es",
      "title": "Fellow Entrepreneur in need of your Help",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qix2es/fellow_entrepreneur_in_need_of_your_help/",
      "author": "New_Public_203",
      "created_utc": "2026-01-21 12:51:33",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 0.99,
      "text": "Hello Startup friends my name is John, and I’ve been on the “startup world” for the last 15+ years. Through it all I bootstrapped my tech companies, I closed million dollar deals, I worked with big brands such as PWC, Teleperformance, L’Óreal, LVMH, Toyota, Fiat, Red Bull, Sony, Epic Games etc… I’ve been the only Developer, Designer and Marketeer and led teams of people and whole departments as CTO. I’ve given talks at Websummit, VivaTech, IGS, AWE and taught classes or gave workshops on colleges and universities.\n\nBut right now I’m facing some really tough times.\n\nInvestment (which I finally turned too) is taking too long to materialize and each day that goes through, the hole I’m in gets deeper and with 3 kids that’s not something you want.\n\nSo that’s why I’m turning to you all for help.\n\nAll I want is a shot to work my way out of this hole and I’ve got a lot of wisdom and experience building and marketing all kinds of technology as well as living and bootstrapping as an Entrepreneur and I’m available to share it all with you.\n\nSo if you want to know how to build things well or fast or performative, how to make tech stacks cheaper (I’m really good at finding cheaper alternatives), how to market something, how to price it, how to make a good pitchdeck (i worked with a lot of startups in the past for this), how to make a good presentation, how to speak at an event, or just have a conversation and vent about the VC ecosystem or what not to do as startup, PLEASE LET’S TALK and make that time worth for both of us.\n\nAs I said, all I want is a shot to work my way out of this and I have faith in the brotherhood/sisterhood that is the Startup Community and that you will help me.\n\nThank you for your time and may all your businesses prosper!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qix2es/fellow_entrepreneur_in_need_of_your_help/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0uhf34",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 12:51:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ggwnu",
          "author": "Sad_Vacation5832",
          "text": "Would you like a chance to work from home on my team as an business broker?",
          "score": 1,
          "created_utc": "2026-01-24 17:15:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ly7ag",
          "author": "lonewarrior786",
          "text": "Hello i am 20 years old and i am still learning and i have my own idea (D2C) brand, i have already seeked validation from hundreds of people and would love to have a mentor who is already well versed and experienced.",
          "score": 1,
          "created_utc": "2026-01-25 12:48:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qllkj2",
      "title": "i'm 16. i coded a script for $500 but now the client wants a monthly contract. i'm just a student, not a \"business\". help?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qllkj2/im_16_i_coded_a_script_for_500_but_now_the_client/",
      "author": "Safe_Thought4368",
      "created_utc": "2026-01-24 12:19:28",
      "score": 5,
      "num_comments": 9,
      "upvote_ratio": 0.69,
      "text": "hi everyone.\n\ni'm a high school student from argentina. i've been learning python (cs50p) for a few months just for fun.\n\nrecently, my dad told me to stop playing around and build something useful. so i approached a local clothing shop that needed help with their catalog images.\n\ni spent 2 weeks writing a script to automate their image editing.\n\nthe owner was happy and paid me $500 cash.\n\nhere is the problem:\n\nnow he wants to hire me on a \"monthly retainer\" to help with other tech stuff (excel automation, data entry, etc).\n\ni am not a company. i am not an \"agency\". i'm just a kid with a laptop.\n\ni don't have contracts, invoices, or a team.\n\ni want to say yes because the money helps my family, but i don't want to pretend to be a professional business when i'm just a student.\n\nquestions:\n\n1. can i just agree to a price and do the work? or do i need legal stuff?\n\n2. how do i tell him \"i have exams next week so i can't work\" without losing the client?\n\n3. is it better to charge by hour or by project?\n\ni just want to code and help, i don't want to get into trouble. thanks.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qllkj2/im_16_i_coded_a_script_for_500_but_now_the_client/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o1exo6k",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-24 12:19:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ezzrt",
          "author": "WrongMix882",
          "text": "Awesome problem to have! Congratulations! \n\n1. GPT your situation and get your questions answered about this. My guess is it’s not a big hurdle \n2. In your simple contract (you can also GPT this, or I can help for free) you can state a SLA to cover your needs when you’re busy: ‘I won’t be able to help immediately always’\n3. You’re going to charge a flat fee so your time commitment is valued. That means you’re going to deliver constant value each month\n\nHappy to talk more by DM if you need help",
          "score": 9,
          "created_utc": "2026-01-24 12:37:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1f2ryu",
              "author": "Safe_Thought4368",
              "text": "thanks my friend!",
              "score": 2,
              "created_utc": "2026-01-24 12:57:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1if10j",
                  "author": "Neo-Armadillo",
                  "text": "Your situation is exactly how I got started, but there was no AI when I did it. I got started around 2010 and I just drafted up a simple agreement, the amount of money with the expected amount of work, expected response times (day-of, Monday through Friday 8a-5p), and hourly rates beyond the scope. Keep it simple.",
                  "score": 1,
                  "created_utc": "2026-01-24 22:34:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1fdohi",
          "author": "Boring-Tadpole-1021",
          "text": "Great. Go help. Let the customer guide. Get your dad to do the business end",
          "score": 1,
          "created_utc": "2026-01-24 14:04:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fn6aq",
          "author": "SimilarComfortable69",
          "text": "You want to make sure that your work is not owned by the company, unless you feel that it should be. Call around and see if you can find an attorney who will give you a consultation for free, and then spend 200 bucks for them to write up any agreement that you might need.",
          "score": 1,
          "created_utc": "2026-01-24 14:57:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ftu02",
              "author": "Safe_Thought4368",
              "text": "thank you",
              "score": 1,
              "created_utc": "2026-01-24 15:31:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1gsu8g",
          "author": "Any_Interest_3509",
          "text": "Absolute blessing to have this happen. Good money as a student, and you're also going to have real-world experience before even going to college 10/10 man pursue it",
          "score": 1,
          "created_utc": "2026-01-24 18:08:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ql7ugi",
      "title": "I have 20K followers on social media combined.",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1ql7ugi/i_have_20k_followers_on_social_media_combined/",
      "author": "Dazzling-Ad3020",
      "created_utc": "2026-01-24 00:22:04",
      "score": 4,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "I just created 70 digitals downloadables. Organically I have around 20K followers on four platforms. I've advertised and made business posts. I get very little interactions and no comments for 6 months. After I make a post, I'm prompted to boost the post by paying. I think it is super expensive to pay for such a small audience (300 -1000 people) for $40. My product niche and caters to a very small portion of the population and sells $9.99. I'm agreed my return on investment would be negative. Is there good way to market my products?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1ql7ugi/i_have_20k_followers_on_social_media_combined/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o1c8ewz",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-24 00:22:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ds8o7",
          "author": "AnonJian",
          "text": "In the old days a 'follower' would sell their worldly possessions to donate to your cause -- no longer. Marketing is just feeling good about what you've done, and sales is an outgoing personality and the gift of gab. \n\nThanks Internet. \n\nYou were supposed to use posts to discover what the audience wants ... then Sell It To Them. Preferably after reading a book on marketing, or at least business. \n\nLet me guess what you actually did, because you ain't telling. You did random shit. Then you waited ... and waited. Learning nothing about market demand. Understanding not one damn thing about the audience over that time. That's not business. \n\nYou get a random large number of followers. Not one clue about them. There is no strategy. And then ... You ... Just ... Monetize. \n\nYeah ...no.",
          "score": 1,
          "created_utc": "2026-01-24 06:11:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fi65i",
              "author": "Dazzling-Ad3020",
              "text": "I develop a customer avatar, and I identified my customers. My marketing campaigns have been losses. I think I should hire a professional.",
              "score": 1,
              "created_utc": "2026-01-24 14:30:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1fl2m6",
                  "author": "AnonJian",
                  "text": "What data from your followers have you used for development of your customer avatar?\n\nProblem being without knowing about marketing (successfully) you have little hope of finding an adequate marketer. Do call up a candidate's clients. Do understand what vanity metrics are (such as followers) to make sure you aren't being flim-flamed.\n\nIt does no good to triple the number of followers when few to none buy. And whatever antics you used to get the twenty thousand might be wrong for getting an audience full of customers. It's always possible you may lose the audience you have in trying to gain an audience that actually wants what you sell.\n\nWhile you're asking, have the marketer you hire explain there is no such thing as a product supply niche. That's what gets you thinking why isn't there a coffee pod ...for juice? The tale of the infamous Juicero boondoggle.",
                  "score": 1,
                  "created_utc": "2026-01-24 14:46:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qkqhsl",
      "title": "Should I learn coding If I want to be a businessman?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qkqhsl/should_i_learn_coding_if_i_want_to_be_a/",
      "author": "Akraam_Gaffur",
      "created_utc": "2026-01-23 13:14:49",
      "score": 4,
      "num_comments": 14,
      "upvote_ratio": 0.75,
      "text": "Hello. I've seen a post recently on this sub. The title said \"what are you working on in 2026\". Almost everyone answered something related to IT sphere. \n\nBut I'm a bit confused. I've tried once to change my career. It was a year ago. I started learning python. Learned it for 2 months and stopped due to over saturated market, fierce competition, ai replacement and so on and on.    \nOn the top of that literally every programmer I talked to said to me - don't start learning coding, it's a dead sphere ,you won't be able to find a job. But my final goal is to scale my skill to a business. And when they hear this they always say then you definitely shouldn't start coding. Freelance is dead in IT and so is job market.\n\nWhat do you guys think? Is coding still worth learning if one wants to scale this skill to a profitable business? If not, then what speheres are better to consider choosing? I made a post on boring businesses not a long time ago. Honestly I'm not interested in them at all. So, what do you think? Thx. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qkqhsl/should_i_learn_coding_if_i_want_to_be_a/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o18dtvw",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 13:14:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18ue7d",
          "author": "Drumroll-PH",
          "text": "Yes, learn coding if you want to build or understand products. It helps you think clearly and make better business decisions. You do not need to be a top developer, just capable enough to build and communicate.",
          "score": 4,
          "created_utc": "2026-01-23 14:42:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a2zv0",
          "author": "New-Studio148",
          "text": "yes, because you have to understand your projects if coding is a part of them. You don't have to be an expert but you have to know how to put things in context. \n\nOnce you have a 'bigger' business, this is less necessary but in the beginning yes.",
          "score": 2,
          "created_utc": "2026-01-23 18:07:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1jtglt",
              "author": "Akraam_Gaffur",
              "text": "Isn't a tech related business big enough? Can you please share with your thoughts on what businesses you consider big? I'm aiming to big",
              "score": 1,
              "created_utc": "2026-01-25 03:03:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1b6k40",
          "author": "AnonJian",
          "text": "The business answer is you learn how to evaluate, hire, manage coders because that's your job as the business partner. What that also means is precise communication and I suggest you learn pseudocode for project management. \n\nThe huge problem we face in this Business Forum is so few appreciate or understand business or what the business partner should be doing. It is not waiting around for the tech partner to finish the product. Because Build It And They Will Come has nothing whatsoever to do with business. \n\nI have recently witnessed the rise of the 'non-technical partner' which only means not anything else either. What's embarrassing is if they didn't code in some fashion, I really don't think they could describe what else they would be doing. Sure, filing for the corporate shell or some such. But really, this isn't a business forum. It's the amateur coders forum.",
          "score": 2,
          "created_utc": "2026-01-23 21:11:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1kb82o",
          "author": "sandyflame",
          "text": "coding is a free resource ...not perfect but soon will be. You cant learn faster than AI....I don't understand a single thing about coding but have created many useful tools through AI. I know what coding can do, I dont need to know how.",
          "score": 2,
          "created_utc": "2026-01-25 04:50:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19xkgq",
          "author": "Responsible-Brick881",
          "text": "You don't need to learn coding to be a businessman!\n\nIt all depends on what you're planning to do.\n\nI haven't a breeze about coding and hasn't stopped me setting up a business.\n\nIf you want to set up a massively technical company then yeah, maybe go learn coding. If not, understand how to sell and market a product.",
          "score": 1,
          "created_utc": "2026-01-23 17:43:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1afwyp",
          "author": "everything_in_sync",
          "text": "yes 111% yes one of the most valuable tools for business",
          "score": 1,
          "created_utc": "2026-01-23 19:05:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jp9ux",
          "author": "bEffective",
          "text": "The quick answer is no, if you want to be a businessman.\n\nThe slow answer a businessman investigates the IT that will enable his business.  Specifically, is there a single stack to handle them all?  Traditionally, for example, QuickBooks handled financials, Salesforce handles marketing and sales, and so on.  And the question to learn might be how to integrate them to enable the flow.  Today, there is a new kid in town, or AI.  You, the businessman, don’t need to learn how to do AI again.  But you do need to improve your assessment of which AI will help and perhaps grow your business along with the new IT evolving because of AI.",
          "score": 1,
          "created_utc": "2026-01-25 02:40:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1jq3hv",
              "author": "Akraam_Gaffur",
              "text": "Thx",
              "score": 1,
              "created_utc": "2026-01-25 02:44:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1o75kc",
          "author": "secretamigo",
          "text": "Go out and talk with people, build your network in the space you want to contribute. Relationships and your network are #1",
          "score": 1,
          "created_utc": "2026-01-25 19:10:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wbh63",
          "author": "No-Morning-2369",
          "text": "Well it depends,you can always link with technical co-founder, Peter theal co-founded Paypal and Palentier without any coding skills, he had a degree in Law and philosophy.",
          "score": 1,
          "created_utc": "2026-01-26 21:29:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi9p7p",
      "title": "How I revived a Dubai flower shop’s dead Instagram & increased walk-ins (no ads)",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qi9p7p/how_i_revived_a_dubai_flower_shops_dead_instagram/",
      "author": "UpstairsDifficult889",
      "created_utc": "2026-01-20 18:47:51",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 0.72,
      "text": "My **first** paying client was a flower shop in Dubai.\n\nThe product was genuinely **premium** (flowers & gifting), but the brand looked **cheap** online.\n\nCheap visuals, lead to cheap perception , which overall resulted in **low** willingness to pay.\n\nSocial media was dormant, inconsistent, and wasn’t nurturing demand or generating walk-ins.\n\nMost small retail shops don’t have a “traffic problem,” they have a **brand perception** problem. When the brand looks cheap, the customer assumes the product is **cheap**.\n\nWhen the product is premium but the brand is cheap, nothing **converts**.\n\nOver 7 months we rebuilt the **brand identity** on Instagram. The goal wasn’t virality, it was **pricing power**, awareness and building trust.\n\nExecution stack: editorial product shots (high-value visuals), daily posting (consistency engine), gifting context content (flowers need use-case), light education (flower types & care) and replying to comments & DMs (nurture base)\n\nResults in the first 3 months of execution:\n\n* Reach: 11 → 5,200 (+87,200%)\n* Views: +43.9%\n* Interactions: +31.5%\n\nBut the real win was offline: Customers started walking in saying: “I saw your IG, **looks luxury now**.”\n\nPerceived value went up, pricing resistance went down.\n\nNo ads. No influencers. No trends. Just brand + content + consistency.\n\nI'm doing 2-3 free social media audits right now, let me know if you need some help",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qi9p7p/how_i_revived_a_dubai_flower_shops_dead_instagram/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0ppxbo",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 18:47:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjqp9t",
      "title": "Google AI mode says my site is a scam relying on reviews of other companies",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qjqp9t/google_ai_mode_says_my_site_is_a_scam_relying_on/",
      "author": "Local_Quote3820",
      "created_utc": "2026-01-22 10:05:49",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "We literally dont have any negative reviews anywhere that we aware of, and yet google AI mode (on top of every search on google) says our site is a scam, partially basing on other companies reviews (with partially similar names, but in totally different industry) AND \"citing\" linkedin post as if that post says we are a scam.  \nI went to that linkedin post:  \n1 - it wasnt even about our company. this post was posted before we even established our company.  \n2 - this post doesnt have even 1 mention of a name that even remotely close to our company or domain.\n\nThats so frastruating! Google is destroying new businness by calling us scam and basing on... nothing!!!\n\nAnyone faced that and knows how to fix it?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qjqp9t/google_ai_mode_says_my_site_is_a_scam_relying_on/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o10shay",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-22 10:05:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkmwp3",
      "title": "Business Idea - Is this a viable offline marketing channel for larger brands?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qkmwp3/business_idea_is_this_a_viable_offline_marketing/",
      "author": "Dry-Plate-9120",
      "created_utc": "2026-01-23 10:02:12",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Hey everyone - I’m doing some early-stage market research on a new offline advertising concept and I’d love honest, critical feedback from people who work in marketing, brand, growth, or media buying.\n\n**The idea:**\n\nInstead of just billboards, posters, or bus ads, brands can sponsor **to-go coffee cups**.  \nA company buys blocks of branded cups, and those cups get distributed for free to consumers in the area selected by the brand.\n\nSo if a brand wants to target commuters in Manchester, London, Leeds, etc., their branding and message/CTA appears on thousands of takeaway cups in those areas.\n\nThe thinking is that this channel is:  \n• Offline and real-world (like billboards, OOH, transit ads)  \n• Hyper-targeted by location  \n• High frequency (people carry the cup around)  \n• High goodwill (people associate it with something positive – coffee)\n\n**I’m** ***not*** **selling anything here** – just genuinely trying to understand if this is:  \nA) A serious marketing channel  \nB) A gimmick  \nC) Something brands would only test at a small scale\n\nMy questions:\n\n👉 If you work with brands or in marketing:  \n• Would this be something you’d consider testing?  \n• What would make it feel legit vs gimmicky?  \n• How would you measure success?  \n• What kind of brand or campaign do you think this fits best?\n\n👉 If you’ve bought offline ads before:  \n• Would this sit alongside billboards / transit / posters – or not really?  \n• What budget range would make sense for something like this to try?\n\nI’m especially interested in hearing from:  \n• Media buyers  \n• Brand managers  \n• Growth marketers  \n• Anyone who’s run OOH / offline campaigns\n\nBrutal honesty is welcome. If it’s bad, tell me why. If it’s interesting, tell me what would need to be true for it to actually work.\n\nThanks in advance 🙏",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qkmwp3/business_idea_is_this_a_viable_offline_marketing/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o17oc6s",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 10:02:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1807jk",
          "author": "Remote_Substance_113",
          "text": "The actual medium of a small static, printed advertisement is definitely inferior to most modern forms of advertisement. \n\nIt could work as an exposure tool, I suppose. \n\nI don't see how this is a business however. How would you make any money from this?",
          "score": 2,
          "created_utc": "2026-01-23 11:43:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18en4j",
              "author": "Dry-Plate-9120",
              "text": "Well that's the ultimate question for sure. Not sure if that's a literal question or if you are questioning if it's financially viable. In the literal sense - the business model, in theory (not proven or validated yet), is that businesses would pay for x amount of coffee cups to be printed and distributed with their brand and QR code/CTA on the coffee cup - the price of which would be higher than what it costs to print and distribute the cups - which results in profit (apologise if you didn't mean your question in the literal sense). \n\nIf you are questioning if it's financially viable, I have no idea - that's what I'm trying to figure out. This is very very early idea stage, so I'm speaking with as many people as I can to see if I can invalidate the idea before anything else. But it's reaching the point where we'll have to do a real-world test and see how it stacks up. Maybe this medium has a huge conversation and offers huge ROI opportunity for companies - I have no idea, it probably won't, but I don't have any data or insights to validate or invalidate that. \n\nBut I do absolutely take your point around being an inferior medium, and I agree, I think it is, but I guess it depends on the business/industry and a whole bunch of other factors. Nonetheless, I really appreciate your feedback and giving your opinion - it's helping me massively in terms of shaping (or binning) the idea - thank you!",
              "score": 1,
              "created_utc": "2026-01-23 13:19:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1emb2q",
          "author": "AnonJian",
          "text": "I wouldn't consider this for testing. But people into brand development are into vanity metrics and this could work for that infamous phrase \"Who cares about sales ...it's building *the brand*.\"\n\nAny pitch you can crowbar 'brand awareness' into might work. Brand developers are a delusional bunch.\n\nUnfortunately, this isn't new ... nobody has any reason to even bother to consult with you. They'll partner, then send whatever materials to the supplier of that partner. In other words you are an intermediary on the ultimate disintermediation platform, a middleman without a meaningful purpose.\n\nFor anybody unaware, large brands already have marketing employees whose only job is to justify their existence at the corporation's expense. It's called overhead. And you shouldn't aspire to be an overhead cost.",
          "score": 1,
          "created_utc": "2026-01-24 10:41:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}