{
  "metadata": {
    "last_updated": "2026-02-03 02:59:57",
    "time_filter": "week",
    "subreddit": "Entrepreneurship",
    "total_items": 12,
    "total_comments": 98,
    "file_size_bytes": 90418
  },
  "items": [
    {
      "id": "1qqxxp4",
      "title": "I've made my first 4.5k month",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qqxxp4/ive_made_my_first_45k_month/",
      "author": "Katana_XI",
      "created_utc": "2026-01-30 06:33:04",
      "score": 8,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "Hello guys!!! For those of you don't know I started a software/web development agency back in September and have been updating my progress throughtout.\n\nAs of January 2026, I've made 4.5k this month alone. I've been handling alot of projects along with my team. My biggest goal going into this year is gaining alot more monthly recurring clients (i currently only have 2).  \n  \nI'll keep posting my progress on Reddit. Thank you so much for dming and supporting my journey guyss :)\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qqxxp4/ive_made_my_first_45k_month/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2k4z4t",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 06:33:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kuh40",
          "author": "Secure-Ebb5290",
          "text": "How did you made it? really keen to know your journey",
          "score": 1,
          "created_utc": "2026-01-30 10:17:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2nd1oz",
          "author": "Spotch_Platform",
          "text": "Congrats on hitting 4.5k so early on. Focusing on recurring clients is smart since predictable revenue makes growth easier and less stressful. Keep tracking what works and you’ll see those numbers add up consistently.",
          "score": 1,
          "created_utc": "2026-01-30 18:26:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39uaju",
          "author": "WebEaze",
          "text": "Congratulations!",
          "score": 1,
          "created_utc": "2026-02-03 02:33:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp4ylx",
      "title": "Buying vs Building: What Entrepreneurs Miss Until They See Real Deals",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qp4ylx/buying_vs_building_what_entrepreneurs_miss_until/",
      "author": "This_Is_Bizness",
      "created_utc": "2026-01-28 07:39:20",
      "score": 7,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "Sitting in on real conversations around small SaaS acquisitions changed a few assumptions I didn’t even realize I had.\n\nI used to think building from scratch was the “clean” option. Blank slate, full control, no mess. Buying felt like inheriting problems. But the more deals I watched, the more it made me think buying might be better than building.\n\nThe problems are there either way. The difference is whether you find them upfront or six months in, when you’re already emotionally and financially committed.\n\nOne thing I keep noticing, people don’t stall because there aren’t enough businesses out there. They stall because they’re everywhere at once. Marketplaces today, cold emails tomorrow, a new niche every week. After a while, everything blurs together and decision-making gets worse.   \n  \nSmart buyers tend to limit their niche down to few businesses which they are good at, this makes you more efficient and does’t waste your time exploring 10 diff niches. \n\nAnother thing, most of the important stuff comes out in conversation before it ever shows up in a spreadsheet. Metrics tell you **what** is happening. Talking to the founder usually tells you **why.** The timing, the burnout, the part of the business they’re tired of carrying, that context often explains the opportunity more than the numbers do.\n\nRevenue matters, obviously. But not as much as whether the product has crossed that invisible line from “side project someone tinkers with” to “something people quietly rely on.” That distinction alone filters out a lot of shiny distractions.\n\nAnd then there’s the part no one really talks about. The slow checks. The verification. The awkward questions. The walking away from deals that looked exciting at first glance.   \n  \nEvery buyer I respect seems to develop a weird tolerance for this stage. It’s not fun, but it’s where most bad decisions get avoided, and this is what you call Due Diligence phase. \n\nNone of this felt obvious until I’d seen a few deals up close, especially the ones that almost happened and probably shouldn’t have.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qp4ylx/buying_vs_building_what_entrepreneurs_miss_until/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o26day0",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 07:39:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28vx41",
          "author": "Spotch_Platform",
          "text": "Numbers tell you what’s happening, but talking to the founder shows why. Sticking to niches you know and leaning into the slow, awkward parts of due diligence makes spotting the right opportunities way easier. At the end of the day, context beats spreadsheets every time.",
          "score": 2,
          "created_utc": "2026-01-28 17:07:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ezab9",
              "author": "This_Is_Bizness",
              "text": "Totally agreed",
              "score": 1,
              "created_utc": "2026-01-29 14:29:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2exm8y",
          "author": "StillLoadingit",
          "text": "A lot of entrepreneurs don’t realize how much building teaches you about the problem and the market in a way buying never does. Going through the process of creating and talking to real users gives you insights you just can’t get by starting with a ready-made product.",
          "score": 2,
          "created_utc": "2026-01-29 14:20:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ez8rc",
              "author": "This_Is_Bizness",
              "text": "I agree with this, building gives teaches you 10x more than just the theory and honestly going on the ground level talking to users is like a whole different experience if it's your first startup or build",
              "score": 1,
              "created_utc": "2026-01-29 14:28:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o26geiz",
          "author": "AnonJian",
          "text": "Due diligence is a no-no word here. Buy versus Build is a moot point for those afflicted with inventor's syndrome and sunk cost fallacy. \n\nBut yes, the buy versus build dilemma is real for business management. Why you brought it up here is the real mystery.",
          "score": 1,
          "created_utc": "2026-01-28 08:06:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26km8p",
              "author": "This_Is_Bizness",
              "text": "Idk maybe not for others for me this was like a big thing which I realised as I closed few SaaS deals and thought it would be good share.",
              "score": 1,
              "created_utc": "2026-01-28 08:44:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o26p0qa",
                  "author": "AnonJian",
                  "text": "Basically, all business forums turned into amateur coder forums. And any management discussion is about coping rather than proactive problem solving ... or planning ... or thinking things through. \n\nUnscrambling an egg feels about right.",
                  "score": 0,
                  "created_utc": "2026-01-28 09:25:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qt1uco",
      "title": "Struggling to Get My First Bookkeeping Clients – Looking for Honest Advice",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qt1uco/struggling_to_get_my_first_bookkeeping_clients/",
      "author": "Bumbaclaat27",
      "created_utc": "2026-02-01 15:45:24",
      "score": 7,
      "num_comments": 26,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,\n\nI’m looking for some realistic advice because I’ve been spinning my wheels a bit trying to get bookkeeping clients.\n\n**Background:**  \nI have a college diploma in accounting and about a year of combined experience (school + \\~9 months as a staff accountant/bookkeeper). I’m not a CPA, and I’m not trying to position myself as one. I’m aiming strictly at **basic bookkeeping** for small businesses (monthly books, reconciliations, cleanup, etc.).\n\n**What I’ve done so far:**\n\n* Set up a simple service offering (monthly bookkeeping, cleanup)\n* Reached out to small businesses locally (cold emails / DMs)\n* Posted in a few Facebook and Reddit groups (mostly ignored or very low response)\n* Talked to people I know personally (some interest, nothing converted)\n* Tried to keep pricing reasonable and transparent\n* I’m confident in my ability to do the work once I actually get a client\n\n**Where I’m struggling:**\n\n* Getting *any* traction or responses\n* People seem hesitant to trust someone without a CPA or years of solo experience\n* Competing with very cheap overseas bookkeepers and very established firms at the same time\n* Feeling like I’m stuck in the “need clients to get experience, need experience to get clients” loop\n\nI’m not expecting instant success or big money. I just want **my first few real clients** so I can build proof, testimonials, and momentum.\n\n**My questions:**\n\n* Is this just normal early-stage friction, or am I missing something obvious?\n* Where did your *first* bookkeeping clients actually come from?\n* Should I niche down harder (industry, software, cleanup only, etc.)?\n* Is it smarter to work under another firm first before trying solo?\n* Any mistakes you see beginners make that I might be making?\n\nI’m open to blunt feedback. If the answer is “this takes way longer than you think” or “you’re approaching it wrong,” I’d rather hear that now.\n\nThanks in advance to anyone willing to share real experiences.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qt1uco/struggling_to_get_my_first_bookkeeping_clients/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2zij2y",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 15:45:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zoe70",
          "author": "FatherOften",
          "text": "I have a GED, but taught myself Quickbooks 30 years ago by getting a torrent copy and playing business.\n\nI cold called every local business within 50 miles of my home. Plumbers, roofers, truck shops, electrical, hvac, cleaning services, truck driver.....\n\nYou are cold email and cold dm.\n\nThe secret you are looking for is hidden in the work you are avoiding.\n\nCold call in person and over the phone. Send an email right after you hangup or walk away. It should have your contact info, and your offer/pricing.\n\nIts not fun. It takes hundreds of cold calls.\n\nYou're gonna suck at it for awhile. It never gets fun.\n\nYou have to do it anyway and you have to get good at it.\n\nAim for 1000 cold calls to start with. Sounds like a lot, but its not at all. Its just a start.",
          "score": 3,
          "created_utc": "2026-02-01 16:12:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2zpagv",
              "author": "Bumbaclaat27",
              "text": "Thanks for the advice",
              "score": 2,
              "created_utc": "2026-02-01 16:17:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2zm90c",
          "author": "ScradleyToronto",
          "text": "Try some paid ads on meta or Reddit.",
          "score": 1,
          "created_utc": "2026-02-01 16:02:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32zssv",
              "author": "Lopsided-Bag-5167",
              "text": "No don’t do it..Waste of money!",
              "score": 1,
              "created_utc": "2026-02-02 02:06:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2zmgy8",
          "author": "Chris_StayStrategy",
          "text": "I am not an accountant, but I personally would not see value in your offer with such minimal experience. \n\nI think the big challenge you will have as a solo practitioner with this offer is that you can’t really handle escalations for serious issues. If I were to hire you and need a CPA to look at something, I would then have to source that separately and coordinate knowledge transfer, etc. I suspect many small businesses are either:\n\na) have some basic system they consider to be working well enough\n\nb) looking for legitimate support when their basic system from point a triggers an audit or something serious \n\nc) have growth aspirations and recognizes you won’t be able to grow with them \n\nI think ultimately you will have better success working with someone established for now and building towards a solo thing in a couple years.",
          "score": 1,
          "created_utc": "2026-02-01 16:03:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2zobdf",
              "author": "Bumbaclaat27",
              "text": "I have worked in a cpa firm for about a year and handled the books of large companies. The problem is far from the fact that I can't handle the volume because in my solo practice I would be scaling back from what I serviced while employed at my firm. This is the jump I'm taking to get smaller clients, I'm just not sure how to find them efficiently",
              "score": 1,
              "created_utc": "2026-02-01 16:12:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2zp7x7",
                  "author": "Chris_StayStrategy",
                  "text": "That makes sense, I don’t doubt you’re capable of the bookkeeping work. It’s moreso that when you were doing it at the firm, the clients knew it was being done with oversight of CPAs.",
                  "score": 1,
                  "created_utc": "2026-02-01 16:16:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2zr0mx",
              "author": "FatherOften",
              "text": "I agree that OP should definitely keep a full-time job under someone else.\n\nI did this type of work while working full-time full commission sales positions in other industries and in the early years of building my current commercial truck parts manufacturing and sales business.\n\nI have a ged, no formal education, and taught my self QB though downloading a torrented copy.\n\nI made $1k-$5k a month pretty consistently doing reconciliations, cleanup, and re categorizing for many small to medium business owners. \n\nA. Is a great point, but you have to assume they don't really have a good system and find the pain. The majority of the people I cold called hated reconciliations and stumbled through it. All of them really wanted to be assured that they had their chart of accouts setup correctly. \n\nThat's where I made my money. I just needed extra cash and would make a couple hundred bucks here or there, but it added up. It took awhile to get out of that side gig as my primary business grew larger. \n\nOP you need to be scrappy, lean on social engineering, and real talk people skills. You cannot compete face to face with accounting firms, but your target customer of family owned small businesses cannot justify the spend to use those firms until they have to.",
              "score": 1,
              "created_utc": "2026-02-01 16:25:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2zvjlv",
          "author": "abbyy007",
          "text": "Totally normal to struggle at first. Narrow your niche, lean on your network and talk to local small businesses most people land their first clients through referrals not cold emails. Get a couple of clients and things start rolling.",
          "score": 1,
          "created_utc": "2026-02-01 16:45:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o302vn6",
          "author": "Affectionate_Gap2887",
          "text": "It's definitely a bit of work to get going in the beginning but just keep at it. We started off slow but growth eventually came. Started off as a single bookkeeper offering services to 2 clients and grew into full-time staff and servicing 30+ and doing adhoc \"project\" work often . I said in a previous post that what really helped us branch out is offering totadvi advisory services along with bookkeeping. It helped us upsell to already bookkeeping clients and individually sell totadvi. It's often an over looked product for bookkeepers and the best part is you only pay when your client agrees to accepting the service",
          "score": 1,
          "created_utc": "2026-02-01 17:19:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o309fau",
          "author": "MathewGeorghiou",
          "text": "I think it will be easier to win the first client locally.  Maybe put together an affordable package where you will help set up the accounting app for new businesses so they can take over their own bookkeeping.  The one-time expense may attract a few clients who know they need the help but don't want to commit to a recurring service. Some may then convert to have you do the bookkeeping once you have the relationship established.",
          "score": 1,
          "created_utc": "2026-02-01 17:49:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30g5w5",
          "author": "jesseaknight",
          "text": "how do you price a service like this?",
          "score": 1,
          "created_utc": "2026-02-01 18:19:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30phne",
          "author": "AwkwardRent5758",
          "text": "Can you motivate why I'd get you and then still paying for a CPA accountant? I think this is the key issue.\nIf I'm correct then you are approaching the wrong customers. Actually you'd approach the CPA accountants as potential clients of your service.",
          "score": 1,
          "created_utc": "2026-02-01 19:01:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32ct6a",
          "author": "Responsible-Brick881",
          "text": "For cold outreach - have you tried calling people? Or better still, go to every local business in person. Yes you'll get a lot of rejection, but I'd be shocked it you didn't fall into 1 or 2 clients. \nThe main problem i see for a of solopreneurs is they lack the desire to do the hardest thing - making sales calls on the phone and in person. Ring 100 business and knock at 100 businesses doors and if you don't find a single customer I guarantee you'll at least have a better understanding of what people want",
          "score": 1,
          "created_utc": "2026-02-01 23:57:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32q3v5",
          "author": "rt2828",
          "text": "What is the clear pain point you’re trying to solve which you can quickly talk about? If you even have one client, what do they appreciate about your service which you can advertise? For your outreach, start by refining your message specifically to one type of clients so that each rejection can help you get better faster.",
          "score": 1,
          "created_utc": "2026-02-02 01:10:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33gjgc",
          "author": "23cscott23",
          "text": "I kinda need someone to look over my books and make sure I’m doing it all right",
          "score": 1,
          "created_utc": "2026-02-02 03:43:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33omc8",
              "author": "TheOGGizmo",
              "text": "I can help with that. Dm?",
              "score": 1,
              "created_utc": "2026-02-02 04:35:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o33ox6b",
          "author": "TheOGGizmo",
          "text": "I’m sort of in the same boat spot as you. I’m trying to save up for my CPA exams. Maybe we can link up and try to land clients with each other for our firms?",
          "score": 1,
          "created_utc": "2026-02-02 04:37:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34d2pg",
          "author": "Overall-Lead-4044",
          "text": "I suggest you try networking groups, especially those focused on referral networking like BNI. It's not cheap, easy or quick, but over the years I've found that this has got me the most clients, who have stayed for many years.",
          "score": 1,
          "created_utc": "2026-02-02 07:53:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37i66m",
              "author": "Bumbaclaat27",
              "text": "I see a lot of people suggest networking groups. What does this even mean? Are you referring to local Facebook groups/organizations etc...?",
              "score": 1,
              "created_utc": "2026-02-02 19:20:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37s1pf",
                  "author": "Overall-Lead-4044",
                  "text": "No, this is face to face in person. Google networking groups near you",
                  "score": 1,
                  "created_utc": "2026-02-02 20:06:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o34jh6v",
          "author": "Cool_Assistant_5660",
          "text": "Anyone here who wants to partner up with me for an accounting and bookkeeping business? \nLooking for partners in US or UK.",
          "score": 1,
          "created_utc": "2026-02-02 08:54:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqn3vn",
      "title": "Making 8k–14k/month as a freelancer… and scaling still feels like a trap",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qqn3vn/making_8k14kmonth_as_a_freelancer_and_scaling/",
      "author": "Special_Abalone_7630",
      "created_utc": "2026-01-29 22:23:30",
      "score": 5,
      "num_comments": 9,
      "upvote_ratio": 0.69,
      "text": "I’m in my twenties and currently a freelancer making around 8k–14k per month. Margins are basically 100% since it’s just me, and I work around 50-60 hours per week. For where I live, this is very good money.\n\nThe issue is I’m fully booked. Every new opportunity feels like:\n\n* take it and burn out\n* or say no and feel stuck\n\nThat’s what **pushed** **me** **to** **think** **about** **starting a company** and scaling beyond myself, mostly because I’m worried there’s nothing beyond my personal brand and trading time for money.\n\nBut the more I look at the numbers, the less it makes sense.\n\nA realistic service company in my space probably runs on 20–30% margins. To make the same \\~120k/year I make now as a freelancer, the company would need to do something like 400k–500k in revenue. And that’s **just** **to** ***match*** my income, **not even exceed it**, and obviously I wouldn’t just take all of that out personally. All with way more stress, risk, and management.\n\nAlso:\n\n* My clients hire *me*, not a team\n* I’d still be the bottleneck for sales and quality\n* Selling random products doesn’t feel like a real long term asset or exit\n\n**So now I’m torn:**\n\n1. Double down on freelancing + personal brand\n2. Keep freelancing stable and slowly try to build a company or asset on the side\n\nThe math makes scaling feel kinda crazy, but the idea of having nothing beyond freelancing long term also worries me.\n\nCurious how others have thought about this or what they’d do.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qqn3vn/making_8k14kmonth_as_a_freelancer_and_scaling/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2htk51",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 22:23:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hy07t",
          "author": "hexwit",
          "text": "This is self promotion ad. Seen in different subs.",
          "score": 2,
          "created_utc": "2026-01-29 22:45:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2i2bsn",
          "author": "vettotech",
          "text": "AI slop",
          "score": 2,
          "created_utc": "2026-01-29 23:08:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ijuio",
              "author": "some_user_2021",
              "text": "It's not just AI slop, it's a lifestyle.",
              "score": 1,
              "created_utc": "2026-01-30 00:42:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2juxpf",
          "author": "ScradleyToronto",
          "text": "Why don’t you say what it is you do?",
          "score": 1,
          "created_utc": "2026-01-30 05:17:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2i34d0",
          "author": "ineedanamegenerator",
          "text": "Just my opinion:\n\nI don't want a business that linearly relies on people to scale. Growing in selling services means more people. As you said, you need to be significantly large already to exceed solo freelance income. Overhead eats up a lot of the profit.\n\nSo, either think about a product company you could start. I always encourage people who want that to start it on the side. Sacrifice a few days a week of your freelance job to work on the product company. It will take longer than you think before it brings income.\n\nAlternatively just keep doing what you are doing and buy real estate for passive income.",
          "score": 0,
          "created_utc": "2026-01-29 23:12:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2j0wdb",
          "author": "FullPractice6896",
          "text": "Masivo Bro",
          "score": 0,
          "created_utc": "2026-01-30 02:16:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hvatv",
          "author": "Boring-Tadpole-1021",
          "text": "Free lance and start a company",
          "score": -1,
          "created_utc": "2026-01-29 22:32:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr4yd2",
      "title": "How Do You Know the Best Way to Start a Business Today?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qr4yd2/how_do_you_know_the_best_way_to_start_a_business/",
      "author": "Policy_Boring",
      "created_utc": "2026-01-30 13:06:41",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "This is a question I hear all the time. With so many options out there. Starting from scratch, buying an existing business, or going the franchise route. It’s easy to feel stuck before you even begin. From my experience working with business owners and franchises, there’s no single “right” answer. It really comes down to your goals, your risk tolerance, and how much guidance you want along the way.\n\nSome people love building everything themselves, while others prefer a proven system with support already in place. Both paths can work, it’s about choosing the one that fits you. If you’re just starting to explore your options, don’t rush the decision. Ask questions, learn from people who’ve done it before, and be honest about what kind of business owner you want to be.\n\nCurious to hear how others here decided on their path. What helped you choose?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qr4yd2/how_do_you_know_the_best_way_to_start_a_business/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2lh0y6",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 13:06:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2na20a",
          "author": "DecisionOperator",
          "text": "This is an indecision buffer framed as exploration\n\nClarity will not arrive from comparing paths\n\nThe choice only materializes once commitment replaces analysis",
          "score": 2,
          "created_utc": "2026-01-30 18:13:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqg945",
      "title": "Entrepreneurship sounds exciting, what’s the part no one talks about?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qqg945/entrepreneurship_sounds_exciting_whats_the_part/",
      "author": "ChatYourCareer",
      "created_utc": "2026-01-29 18:12:27",
      "score": 4,
      "num_comments": 36,
      "upvote_ratio": 0.7,
      "text": "For founders or early-stage entrepreneurs:  \n– What’s harder than expected?  \n– What’s more rewarding than you thought?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qqg945/entrepreneurship_sounds_exciting_whats_the_part/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2gcbtg",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 18:12:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gjqxy",
          "author": "505browser",
          "text": "harder - the real amount of time it consumes. Basically a 24/7 commitment.\n\nMore rewarding - creating a job for someone from a blank sheet of paper",
          "score": 6,
          "created_utc": "2026-01-29 18:45:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gmrur",
              "author": "ChatYourCareer",
              "text": "That’s such an honest way to put it. The time commitment really doesn’t get talked about enough, and the “always on” part can be exhausting. But creating something that actually gives someone else a job is a pretty special kind of reward. Thanks for sharing that perspective.",
              "score": 1,
              "created_utc": "2026-01-29 18:59:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2jx5z4",
                  "author": "Innurendo_",
                  "text": "Hasn’t been the same for me. I hired a manager and delegate // automate as much as possible. I have plenty of free time, but I do take calls any time of day. \n\nAgreed on it being rewarding to know that my work has put food on my team’s table. It helped ‘em buy a car. Pay student loans. Get an engagement ring. Etc",
                  "score": 1,
                  "created_utc": "2026-01-30 05:33:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2he4c8",
              "author": "Sad-Mousse5066",
              "text": "If you live what you love then it’s not a job alway be closing",
              "score": 1,
              "created_utc": "2026-01-29 21:09:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2mwag3",
                  "author": "ChatYourCareer",
                  "text": "Yeah, I think loving what you’re building definitely helps, but it still comes with real pressure and responsibility. Even when it doesn’t feel like a “job,” the stakes don’t really go away.",
                  "score": 1,
                  "created_utc": "2026-01-30 17:12:53",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ihzvw",
          "author": "EdThePodcastGuy",
          "text": "the hard part is that you need to get your shit together across the board. It's not just about the time you spend working, but the habits that you have outside of work. In our day and age it can make you into a bit of a social reject. \n\nThe rewarding part for me is being trusted by really smart people (sometimes with Ivy league educations) and being able to sit at the table with them as a creative and strategic partner. I never got to go to a fancy university but always wanted to, so there is a bit of a pedestal there.",
          "score": 3,
          "created_utc": "2026-01-30 00:32:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mu4hv",
              "author": "ChatYourCareer",
              "text": "That really resonates. People talk a lot about the work itself, but not how much it forces you to get your life and habits in order, and how isolating that can be if you’re not careful. And that last part hits hard. Being taken seriously and trusted by people you once put on a pedestal is a huge reward, especially when you didn’t come through the “traditional” path. Thanks for sharing that perspective.",
              "score": 2,
              "created_utc": "2026-01-30 17:03:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2grv79",
          "author": "limitlesssolution",
          "text": "The hard work. Possibly working 10, 12 + hours every day. Having to improve yourself constantly. And be abreast of any changes in technology and the marketplace.",
          "score": 2,
          "created_utc": "2026-01-29 19:22:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mvk55",
              "author": "ChatYourCareer",
              "text": "Yeah, that part doesn’t get sugar-coated enough. The hours and constant self-improvement can be exhausting, especially when things around you keep changing. It definitely takes a lot more than just a good idea to keep going long term.",
              "score": 2,
              "created_utc": "2026-01-30 17:09:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2gtjsi",
          "author": "FatherOften",
          "text": "It will cost you more time, energy, health, relationships, stress and money than you can ever plan for but it's worth it for who you could become.",
          "score": 1,
          "created_utc": "2026-01-29 19:30:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gvrnc",
          "author": "Salt-Association6876",
          "text": "I concur on creating a paying job for someone else from just an idea is the most rewarding and fulfilling feeling. \n\nWhat has been the hardest for me is the constant test of conviction. \n\nIt's time, it's money, it's family, it's relationships, it's insecurity, it's pride, it's doubt, it's isolation, it's fear, it's clarity, it's happiness, it's freedom, it's belief.",
          "score": 1,
          "created_utc": "2026-01-29 19:41:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2h6oq8",
          "author": "FieldNoticing",
          "text": "The more time and dedication you spend bringing this vision to life, the more sacrifices you’ll have to make. You’ll have multiple inflection points that will ask you to choose this or that. That’s where actual grit shows up.",
          "score": 1,
          "created_utc": "2026-01-29 20:33:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ihzhk",
          "author": "d-monroy",
          "text": "If you’re not getting paid, you’re not providing enough value.",
          "score": 1,
          "created_utc": "2026-01-30 00:32:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2imqqf",
          "author": "Rich-Editor-8165",
          "text": "Entrepreneurship is tougher than it seems, especially with the emotional grind, constant decisions, and uncertainty. But it’s rewarding when you learn what truly matters and discover who you are under pressure.",
          "score": 1,
          "created_utc": "2026-01-30 00:57:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k4lae",
          "author": "deep_m6",
          "text": "The unglamorous part is the mental load which includes constant uncertainty and decision fatigue and the need to perform all tasks by yourself during the initial period. Small achievements bring unexpected satisfaction because they include your first customer and actual feedback and the demonstration of your solution to a real problem. The peak experiences exist as actual events but the continuous work required to reach those peaks also exists.",
          "score": 1,
          "created_utc": "2026-01-30 06:30:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2klx0u",
          "author": "Overall-Lead-4044",
          "text": "Harder - soloness ( if that's a word). Being on your own, no support or encouragement from colleagues. Although this can be mitigated by building up a network of trusted people, mostly other entrepreneurs in the same situation.\n\nMotivation. It's easy to get distracted by other things, like answering questions on Reddit ☺️",
          "score": 1,
          "created_utc": "2026-01-30 09:00:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kqplz",
          "author": "RevolutionaryLeg7978",
          "text": "Its a vocation not a job. There is no 9-5, its 24/7",
          "score": 1,
          "created_utc": "2026-01-30 09:44:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kueo0",
          "author": "PavelBoss13",
          "text": "If you \"expect\" that when you start entrepreneurship will be good or bad, then it's better not to be an entrepreneur.",
          "score": 1,
          "created_utc": "2026-01-30 10:17:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2la7iy",
          "author": "Unable_Musician5446",
          "text": "Harder than expected: the constant mental load. You’re always thinking about the business, even when you’re not working. There’s no real off switch.\n\nMore rewarding than I thought: once I got proper support, things actually felt manageable. I was overwhelmed at one point and used CollabFabrik’s Founder Support, which helped me get organised and stop doing everything myself. That shift made running the business feel sustainable, not just stressful.",
          "score": 1,
          "created_utc": "2026-01-30 12:23:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lxl98",
          "author": "Final_Schedule_3129",
          "text": "The sheer weight of decision fatigue. You underestimate how physically draining it is to be the final bottleneck for 500 micro-choices a day, knowing that if you don't decide, nothing moves.",
          "score": 1,
          "created_utc": "2026-01-30 14:34:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m44zk",
          "author": "Internal-Combustion1",
          "text": "Expect to work a lot if you want a chance at success.  Expect to fail a lot, get up, try and fail again, get up and try again.   It’s high risk but also can be high reward (when your successful enough)",
          "score": 1,
          "created_utc": "2026-01-30 15:06:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mfrqm",
          "author": "Due-Mood-6356",
          "text": "The boring bureaucratic paperwork that you go through especially in initial setup.",
          "score": 1,
          "created_utc": "2026-01-30 15:59:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ml71w",
          "author": "WrongMix882",
          "text": "Loneliness. You will be marooned on an island of doubt.",
          "score": 1,
          "created_utc": "2026-01-30 16:23:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2n0y66",
          "author": "Kindly-Teach-1256",
          "text": "work life balance",
          "score": 1,
          "created_utc": "2026-01-30 17:33:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o3cr1",
          "author": "LordOfTheMoans",
          "text": "The unsexy grind is the hardest part: constant context switching, decision fatigue, and realizing no one is coming to save you when things stall. What surprised me most is how rewarding tiny wins feel, your first real customer, a product finally clicking, those moments hit way harder than I expected.",
          "score": 1,
          "created_utc": "2026-01-30 20:26:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2p2a95",
          "author": "Electronic_Size_1323",
          "text": "It’s not fun at all most of the times",
          "score": 1,
          "created_utc": "2026-01-30 23:17:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pygg3",
          "author": "Medieval-Mind",
          "text": "Anxious, sleepless nights.",
          "score": 1,
          "created_utc": "2026-01-31 02:19:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2r9lnb",
          "author": "realViewTv",
          "text": "Luck - you need it and preferably lots of it. Behind any really successful business there is always luck (or a crime!)",
          "score": 1,
          "created_utc": "2026-01-31 08:07:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sa1px",
          "author": "MaleficentPlate9104",
          "text": "I’m usually working, on my business, 2 hours before I go to my salary job and work 3-4 hours afterwards. This is during weekdays. \n\nSaturday/Sunday I typically work an additional 5-10 hours depending on the day. \n\nSalaried job is $110k annually. Business is $12-$15k monthly revenue.",
          "score": 1,
          "created_utc": "2026-01-31 13:23:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xk9ad",
          "author": "Correct_Attempt4964",
          "text": "Working 100 hour weeks and still end the year negative. Feeling sick to your stomach and not being able to sleep at night because you dont know what to do and you have peoples jobs on the line. \n\nSure it looks and sounds exciting because its easy to show the positive side of it but it rarely comes without the rest.",
          "score": 1,
          "created_utc": "2026-02-01 07:02:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o310wlq",
          "author": "Awaisikram788",
          "text": "The harder part is marketing. Educating people about your product.",
          "score": 1,
          "created_utc": "2026-02-01 19:54:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o333rnn",
          "author": "OwnSwin3207",
          "text": "Harder: the actual lived experience of uncertainty and loneliness, even when you have a founding team. \n\nRewarding: you set the standard and bar - in the early stages, the market is your boss. There’s no fucking human telling you what you’re doing wrong, gaslighting you, or giving all sorts of paranoia.",
          "score": 1,
          "created_utc": "2026-02-02 02:28:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpfxrm",
      "title": "New cleaning business model",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qpfxrm/new_cleaning_business_model/",
      "author": "Middle-Substance1257",
      "created_utc": "2026-01-28 16:23:05",
      "score": 3,
      "num_comments": 15,
      "upvote_ratio": 0.81,
      "text": "I'm trying a new model (at least I haven't seen it done exactly like this). Uber for cleaning that benefits the customer and the cleaner.\n\nCleaners want leads - good leads. And they want to reduce the friction it takes to start the paying job.  \n  \nCustomers want their place cleaned when they want it, with trust and quality.  \n  \nLike Uber, customers request a cleaning (a ride) on-demand at a schedule of their choosing. Their request is broadcast to all nearby cleaners (drivers). The cleaners get texted a quote to review and can choose to accept it or not. A standard cleaning for 4 bed, 4 bath, 3k sqft @ $232.  \n  \nOne cleaner decides the timing or price isn't right, but it works for another. Quote accepted and the customer is notified!  \n  \nThe cleaner still retains the right to decline service or change the quote upon arrival, and can even contact the customer prior to arriving to double check the quote is accurate.  \n  \nWhat do you think? Would you use it as a customer or a cleaner?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qpfxrm/new_cleaning_business_model/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o28lq6k",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 16:23:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29qx7h",
          "author": "BusinessGrid",
          "text": "I think the real issue might be the trust factor. Calling an uber you need to trust that they know how to drive and that they have insurance+ and get you there on time. For cleaning as a service, the trust factor might be a lot higher bar to cross. Ratings, comments, past experience, maybe background checks would be needed for new customers. Scheduling past cleaners (favorited) would be needed for existing customers. Also, Ubers are quick point to point services. Cleaning takes longer so you would need to be able get people on the ready when a job becomes available. Initially, one approach might be to each out to existing local business that do cleaning as a service and build a campaign that this can increase their business by filling excess downtime. Lastly, the real issue is pay, sales and insurance. How would they be paid, what if they break some thing or theft? Do they do windows?",
          "score": 2,
          "created_utc": "2026-01-28 19:21:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ask7t",
              "author": "Middle-Substance1257",
              "text": "I agree. At the same time, Airbnb and Uber seemed crazy that you’d go into a stranger’s house or car. Cleaners already face this challenge so it does require good reviews, verifications, and insurance.",
              "score": 2,
              "created_utc": "2026-01-28 22:07:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2cgxhi",
          "author": "funnysasquatch",
          "text": "There is a lot of room for improvement in the in-house cleaning service business. But the Uber for House Cleaning isn't one of them. \n\nUber and Door Dash are popular because those are irregular and on-demand problem. \n\nPeople don't typically have that type of demand for house cleaning. Most house cleaning is a predictable, scheduled service. It's not on-demand. \n\nThe home owner contacts the cleaning service and works with them to schedule the service. For example, every other Monday at 9am. The service often contacts the home owner to confirm the service for that week. \n\nFor example, we were supposed to have the service this week. But because of the ice storm, we asked them to skip.",
          "score": 2,
          "created_utc": "2026-01-29 03:24:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2q0g95",
          "author": "Antique-Magazine7478",
          "text": "Are you going to build an app? What are the steps?\n\nHow will pricing work hourly or set pricing?\nDoes the customer choose the price, or will pricing be set per service?\n\nHow will you keep cleaners onboarded?\nIf it’s going to work like “Uber,” cleaners will need to be active and online so they can accept jobs on the go. But if they stay idle for too long without receiving jobs, could that cause them to lose trust in the platform?\n\nAnother question what happens if a customer really likes a certain cleaner and wants to skip the middleman (you)?\nAssuming the platform runs on a commission based model per completed job, what’s to stop customers from paying the cleaner directly instead of going through the app?\n\nThese are just a few thoughts, but I genuinely think it could work if these challenges are solved properly.",
          "score": 2,
          "created_utc": "2026-01-31 02:31:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a3dpa",
          "author": "DicksDraggon",
          "text": "Way late to the party my friend. Other than the few that have leads for all kinds of businesses... Angi & Thumbtack.... \n\nsixtyfourleads (owned by Tim on Youtube although I have never seen him say he owns it, he does), Salesgenie and probably more and maybe even some local ones. I do remember there being a couple more but I can't think of their names.",
          "score": 1,
          "created_utc": "2026-01-28 20:16:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2at1de",
              "author": "Middle-Substance1257",
              "text": "There are a lot of players, and big ones. What I’m finding is that there’s a lot of consolidation in Thumbtack and Yelp but cleaners don’t really want to use them unless they have to. And home services is just such a huge market that there’s plenty of room to spare!",
              "score": 1,
              "created_utc": "2026-01-28 22:09:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ay6ca",
                  "author": "DicksDraggon",
                  "text": "Oh, there is plenty of room, you just said, \"I'm trying a new model (at least I haven't seen it done exactly like this). Uber for cleaning that benefits the customer and the cleaner.\"\n\nYelp is kind of like the BBB = 1983.\n\nI had some rent & rank sites for awhile until my sister got cancer (fully recovered now). We never did any house cleaning but if you can make a great website with great SEO you should be able to make it work. We sold all our sites but it has crossed my mind to make more and maybe we will as soon as she gets moved in to her new house next week.",
                  "score": 1,
                  "created_utc": "2026-01-28 22:32:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2aawy8",
          "author": "AnonJian",
          "text": "There was a decade of people claiming to be the Uber of whatever. We are thankfully done with it. \n\n I have a cleaning service. It does not go by capricious pricing -- it works due to background checks not five-star ratings widgets. I think you couldn't guess what customers want and are trying to get encouragement to Just Do It. No customer discovery, just affirmations.\n\nOkay. U go grrl.",
          "score": 1,
          "created_utc": "2026-01-28 20:50:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2i1k3g",
          "author": "drpepperwho",
          "text": "Director of Sales for a commercial cleaning company (for a decade). This idea isn't a winner, just being honest. Whether it's residential or commercial, people want a predictable and reliable schedule. The \"on-demand\" cleaning requests are usually tougher jobs: post-construction, bio-hazard (aka poop / vomit) etc....",
          "score": 1,
          "created_utc": "2026-01-29 23:04:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jgl3w",
          "author": "ImpressiveAppeal8922",
          "text": "It’s a smart, convenient idea that gives customers flexibility and cleaners more control, as long as pricing stays clear and consistent.",
          "score": 1,
          "created_utc": "2026-01-30 03:45:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2r6exa",
          "author": "Economy_Ad_4306",
          "text": "Sqft doesn’t tell anyone the real man hours involved. Walk throughs are done for a reason. This sounds like a great way to get hosed on every job you take.",
          "score": 1,
          "created_utc": "2026-01-31 07:37:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2uupzv",
          "author": "Big-Swan-8039",
          "text": "Hi middle, this is done with homeaglow. I worked for that company to fill in some down time a few years ago. The cleaner has a profile and fee and can bid on the cleaning jobs.\n\n\nThe cleaner is paid by homeaglow. I was charging $22 an hour and my Max job was 3 hours. It is high demand, and you are on your own in the house. The client may be there while you're cleaning. It's pretty fast pay for a side hustle/gig.\n\n\nThe only problem is that you go to a house and if you turn it down after you get there, it would affect your ratings. In other words the more you do the more priority that you have from the company. I had to turn down one client and it was so bad that child services should have been called. I didn't have the heart to tell her why I couldn't clean her house. But when I turn down a job I have to explain the reason to the company.\n\n\nThere's another company that also is set up like this and you have to pay for the training and also buy the shirts. However you are your own boss contracted out by the company and you can bid on whatever you want to do.\n\n\nThe problem is that the company's offer specials and you're dealing with a lot of cheap clients.\n\n\nI no longer  consider this as a fallback anymore because I don't think it's safe for me as one person these days, and that's my personal opinion. When you get to the house it's a 50/50 chance it would be decent. I've had requests for no animals but they have dogs who growl and are aggressive. There is money maker but not for me.\n\n\nCleaners have to pay angi and thumbtack.  ",
          "score": 1,
          "created_utc": "2026-01-31 21:08:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32tun8",
          "author": "Correct_Cat4414",
          "text": "If I have confidence that the cleaner has been vetted and passed a criminal check and has experience cleaning I think it would be a great service.",
          "score": 1,
          "created_utc": "2026-02-02 01:32:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qozh5r",
      "title": "Need feedback on Landing Page - Major Refactor",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qozh5r/need_feedback_on_landing_page_major_refactor/",
      "author": "Additional_Alarm_604",
      "created_utc": "2026-01-28 03:01:17",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Hello everyone,\n\nI've had my landing up for less than 30 days, and it's doing okay. We're getting 100 visitors a day, and 7 interactions on visit. So that feels good, however, I'm not getting emails like I need, and that is really hurting me. Without a few hundred to a few thousand, I just don't see the point in launching our Kickstarter campaign. \n\nI can get people to the site, but earnestly, without emails, I'm stuck.\n\nI've made a major refactor of the site. Increased Mobile compatibility in UI/UX, and I've improved my modals and email placement.\n\nI've add(ed/ing) a beverage guide, which I think will shine, but I'm hesitant to pour a lot of money into marketing till I know I can capture interest.\n\nI've done a ton of businesses, but this is my first Kickstarter, and my first \"direct to consumer\" company, so I really would appreciate guidance. \n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qozh5r/need_feedback_on_landing_page_major_refactor/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o258mpm",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 03:01:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qt4k8c",
      "title": "Do I take the risk and violate my non-compete?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qt4k8c/do_i_take_the_risk_and_violate_my_noncompete/",
      "author": "BeachBum419",
      "created_utc": "2026-02-01 17:25:04",
      "score": 3,
      "num_comments": 24,
      "upvote_ratio": 1.0,
      "text": "I work in healthcare and will be opening my own small business this year. I'm in a non-compete is in effect until the fall.   \nI am VERY tempted to ignore it, open early, and offer services that were not available at my old job and be careful with my wording, limit advertising, and do more word of mouth. Keep it limited and small until the non-compete is up- then expand services.   \nBusiness is about risks- but I am worried I will get going, then they will send a cease and desist because they are petty like that. Then it could hurt my business in the long run if I have to shut down- then re-open.   \nI also worry that if I don't get on this now, other people may open up shop before I do and I'll loose this opportunity. \n\nI had an attorney review my non-compete. He doesn't think they could enforce it if I am careful with how I advertise and select the patients I see- as it would not cause them hardship. I just don't want to get tied up with a ton of legal costs. \n\nAny advice? Thoughts?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qt4k8c/do_i_take_the_risk_and_violate_my_noncompete/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o3044z4",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 17:25:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32n8qj",
          "author": "PersonOfInterest007",
          "text": "I am not an attorney.\n\n“Doesn’t think they could enforce it” doesn’t sound like very solid advice. If the business you start would violate the terms of the non-compete, wait for the non-compete to expire. \n\nHonor your legal commitments. It’s not only ethical; it’s the smart thing to do. And you won’t lose sleep at night worrying that the word will get out and your petty former employer will make your life an expensive legal hell.\n\nSo I suggest that you either play it safe and wait, or else get a solid second opinion from another attorney, and if they think you wouldn’t be violating the agreement for some reason, at least get their opinion in writing. It’s no guarantee, but it might (maybe, possibly) weigh in your favor with the court when you get sued.",
          "score": 2,
          "created_utc": "2026-02-02 00:54:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o309mq9",
          "author": "SimilarComfortable69",
          "text": "Trust your attorney. Is there some reason you don't feel comfortable with their advice?",
          "score": 1,
          "created_utc": "2026-02-01 17:50:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30d2aj",
              "author": "BeachBum419",
              "text": "Fear I suppose. I am worried IF I do this- and they IF come after me, I will get tied up with fees, or have to shut down which could hurt future business. They are a big mega corp and I am lil ole me and don't have money to fight them.",
              "score": 1,
              "created_utc": "2026-02-01 18:05:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o313vzg",
                  "author": "SimilarComfortable69",
                  "text": "Then no answer here should sway you anywhere else either.",
                  "score": 1,
                  "created_utc": "2026-02-01 20:08:53",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o36kw0l",
                  "author": "imapilotaz",
                  "text": "Thats the biggest deterrent for most individuals. They can cause tens of thousands of lawyer fees, digital forensic fees, etc. \n\nI have a friend who left one company for a competitor. He acrued nearly $30k in lawyer fees and fees associated with them going after him. \n\nBig companies have much deeper pockets. And in your cause they have a document you are threatening to ignore. Maybe rightly. Maybe wrongly. Itll be for courts to decide. And thats expensive",
                  "score": 1,
                  "created_utc": "2026-02-02 16:48:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o309mrh",
          "author": "EmbarrassedOne2329",
          "text": "Have thought to consult with a lawyer?",
          "score": 1,
          "created_utc": "2026-02-01 17:50:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30cpa9",
              "author": "BeachBum419",
              "text": "I did, mentioned that in my post :)",
              "score": 1,
              "created_utc": "2026-02-01 18:03:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o30dowm",
                  "author": "EmbarrassedOne2329",
                  "text": "Oh sorry now I read it, if your attorney told you “I don’t think” you better check out with another attorney. This is not a matter of “I think” this has to be a yes or no. It’s better to avoid these risks when you first start a business.",
                  "score": 1,
                  "created_utc": "2026-02-01 18:08:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o328cak",
          "author": "ScradleyToronto",
          "text": " Non-competes for sole proprietors are rarely enforced. I’m in canada where I could extend “rarely” to “virtual never”.  \nThe risk is negligible. \nAnd what’s the downside?\nThey can get an injunction (super unlikely) and sue you for the profits you cost them (super impractical for them). \n\nJust do it!",
          "score": 1,
          "created_utc": "2026-02-01 23:32:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32btb9",
              "author": "BeachBum419",
              "text": "I want to really bad. I’m 8 months out. I don’t know if I’m brave enough to do it now- but I am strongly considering minimum 2-3 months early.",
              "score": 1,
              "created_utc": "2026-02-01 23:51:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o32c9un",
                  "author": "ScradleyToronto",
                  "text": "Your lawyer has told you you’re fine. \n\nI’m telling you that as a practical matter, you have nothing to worry about because honestly, how much can they possibly sue you for?  They can only recoup damages.  The most they could possibly get is whatever profit you make during the period  \n\nHow much is that?",
                  "score": 1,
                  "created_utc": "2026-02-01 23:54:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o32av5l",
          "author": "ZTRADEZLLC",
          "text": "Create an off shore LLC they won't find out",
          "score": 1,
          "created_utc": "2026-02-01 23:46:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34cgb6",
          "author": "kovaxmasta",
          "text": "Pretty sure the Supreme Court struck down non-competes in the US",
          "score": 1,
          "created_utc": "2026-02-02 07:47:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35eg0r",
              "author": "BeachBum419",
              "text": "It didn’t pass",
              "score": 1,
              "created_utc": "2026-02-02 13:13:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34zbbp",
          "author": "LordOfTheMoans",
          "text": "I wouldn’t gamble on it. Even a weak non-compete can still mean lawyer letters, stress, and distraction right when you need momentum. If your attorney thinks waiting keeps you clean, use the time to prep ops, branding, and referrals so you can launch hard the day it expires.",
          "score": 1,
          "created_utc": "2026-02-02 11:23:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35tg35",
          "author": "mike8111",
          "text": "Don't let fear decide for you.\n\nI say, full send.",
          "score": 1,
          "created_utc": "2026-02-02 14:37:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36aymw",
          "author": "desultorySolitude",
          "text": "Since your attorney gave you ambivalent advice, and you feel that the previous employer could be petty, it might be best to defer starting your own operations until the Fall. in the meantime, you could do peripheral activities that are directly not covered by the non-compete but could aid in boosting your customer base when the time arrives to start your own outfit.",
          "score": 1,
          "created_utc": "2026-02-02 16:03:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o373lfb",
          "author": "TattooedCFO",
          "text": "Open offering services outside the scope of the non-compete and potentially advertise “additional services coming soon.”",
          "score": 1,
          "created_utc": "2026-02-02 18:14:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38qw75",
          "author": "GermantownTiger",
          "text": "Here're some additional questions to ask and answer yourself honestly:\n\nHow solid/cordial is the relationship with my current MegaCorp boss? Are they the type of person who'd string you up and hang you at the first opportunity?\n\nWill the services I offer in the new startup fully, partially or rarely compete directly with the previous business? If it's partially or rarely, what percentage range might the overlap be in terms of MegaCorp's perception?\n\nIf any of your current patients work with you in the new venture, does that cause them to not do any business with MegaCorp?\n\nI would answer these types of questions openly and honestly with yourself and get another legal opinion on your non-compete if the opportunity arises.\n\nEach state often treats non-competes differently...make sure your attorney is up to speed on yours.\n\nGodspeed and good luck.",
          "score": 1,
          "created_utc": "2026-02-02 22:54:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38yir3",
          "author": "flancafe",
          "text": "Personally I wouldn't risk it and would just wait. For one fall will be here before we know it and I wouldn't want to pay an attorney fee just for them to also tell me it's better to wait.  I would focus on getting a business plan done and preparing the back end of the business.",
          "score": 1,
          "created_utc": "2026-02-02 23:35:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39hs3l",
          "author": "Dope_Martian",
          "text": "You could spend time getting everything ready including building your network then you can hit the ground running in September.",
          "score": 1,
          "created_utc": "2026-02-03 01:22:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qry0o9",
      "title": "How do you screen candidates before interviews?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qry0o9/how_do_you_screen_candidates_before_interviews/",
      "author": "JackfruitOwn3238",
      "created_utc": "2026-01-31 09:34:27",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Quick question for founders:\n\nBefore doing interviews, how do you usually screen candidates?\n\n* Forms feel too loose.\n* Calls feel too slow.\n* Tests feel too heavy.\n\nWe’re trying to find a middle ground that’s structured but fair.\n\n\n\nWould love to hear what’s working (or not) for you.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qry0o9/how_do_you_screen_candidates_before_interviews/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2risf0",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-31 09:34:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rkvo7",
          "author": "Nervous_Brilliant441",
          "text": "A 15-30min video call is always our first round. Probably like 70% will not make it to the second round. \n\nFinding the right person for the job (especially for startups) is insanely important. Never take it lightly or think you don’t have the time.",
          "score": 1,
          "created_utc": "2026-01-31 09:54:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2t5ysg",
          "author": "StillLoadingit",
          "text": "I usually start with a simple screening task or questionnaire that’s directly tied to the work they’d be doing so I can see real thinking instead of just resumes. It cuts down pointless interviews and gives you something concrete to talk about when you do meet.",
          "score": 1,
          "created_utc": "2026-01-31 16:16:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vcaw9",
          "author": "therealtricklowe",
          "text": "Hire fast, fire faster, and keep the ones that work out. \n\nOver thinking, over planning, over estimating people, is all a waste of time.   \n  \nYou'll find out who they are 1-2 months after they start working there.   \n  \nWhat's written on their resume doesn't matter.\n\nTheir work ethic, ability to learn, creativity, loyalty, and reliability will never show on a resume, they show up in the workplace.\n\nResume's are lie sheets.   \nInterviews are lie presentations.  \nYou'll never know who the person is, until they start working for you. \n\nSo, interview those that look qualified on paper, nobody else.   \n  \nHire people that can hold the conversation in the interview. Those that are living, breathing, seem capable, and fit the culture. \n\nAnyone that doesn't work out, fire them quickly, and hire someone else. \n\nIn any growing business, hiring and recruitment never stops.\n\n",
          "score": 1,
          "created_utc": "2026-01-31 22:35:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34v50l",
              "author": "JackfruitOwn3238",
              "text": "Nicely put down! well said",
              "score": 2,
              "created_utc": "2026-02-02 10:46:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2yu4z9",
          "author": "Technical-Spend-9037",
          "text": "Use a short structured application 5–7 focused questions plus a quick async [task.It](http://task.It) filters for clarity and effort without taking too much time for the candidate.",
          "score": 1,
          "created_utc": "2026-02-01 13:34:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrxjnl",
      "title": "19 years old lost in life",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qrxjnl/19_years_old_lost_in_life/",
      "author": "927363729",
      "created_utc": "2026-01-31 09:05:17",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Just lost feel like i’m in a hole scratching the walls trying to climb myself back up to the surface tried multiple business models but haven’t had any luck with anything, I learned meta ads which I feel is a valuable skill but I have no motivation calling any business or haven’t started any successful business to use that skill on. i’m just here to see if someone can give me some advice, I feel hopeless i’ve been trying entrepreneurship for almost 3 years now i’ve made money but throughout that time always had issues with consistent income ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qrxjnl/19_years_old_lost_in_life/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2rfr8f",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-31 09:05:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2umjot",
          "author": "Tim-Sylvester",
          "text": "Buddy you've barely even got started. Keep going, you'll figure it out.",
          "score": 1,
          "created_utc": "2026-01-31 20:27:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wxdjh",
          "author": "zombiechickenhd",
          "text": "I am also 19 and the simple answer is that we are young and lost. Its a lame answer, and really doesn't solve the problem, but its true. \n\nMy .02, It may help to start \"finding yourself\" (whatever that means for you, for me it's meditation). For real just keep going and keep the gears turning.",
          "score": 1,
          "created_utc": "2026-02-01 04:09:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o303o0s",
          "author": "PersonoFly",
          "text": "Sit back for a moment and look at all those failures for a minute and think about what you actually learnt. \n\nDid you fail to understand the market ? Did you assume you could follow what was hot at the time and slot in with the money making? Did you gain any feedback from clients that helped you tune your service and proposition ?",
          "score": 1,
          "created_utc": "2026-02-01 17:22:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3425ul",
          "author": "MikeSimsTL",
          "text": "A few things here from my perspective: \n\n1) Everyone is lost at 19. Don't be so hard on yourself, but still be hard on yourself – if that makes sense.   \n2) The fact that you have experimented with even ONE business idea and failed is commendable. I know 50 year olds who are still talking about the same ideas they told me about 10 years ago and haven't even taken one step to progress it.   \n3) When you say, \"I learned Meta Ads\" – this isn't true. The top Meta advertisers in the world haven't \"learned\" Meta Ads. \"Learned\" means completion. What you learned is probably a very basic level of Meta Ads. In other words, if you want to make money here, you must KEEP learning, KEEP experimenting, KEEP iterating, until you almost become a master... and then you realize there's still 400 million things you don't know, so you go back in student mode and keep compounding knowledge and experience. A master of anything knows that you never actually master anything.   \n4) The one thing I don't like about your post is \"... I have no motivation calling any business or haven't started any successful business to use that skill on.\" followed by \"I'm feeling hopeless....\" If you're motivated to not be hopeless, you should be motivated to pick up that phone and call those business owners – if that's going to get you clients. Being a successful entrepreneur (or anything else) means doing the things that are uncomfortable or that you're not motivated to do. Trust me, when you pick up that phone the 300th time and that first person says \"Yes,\" you'll find your motivation. Until then, you need discipline. Discipline is 100x more powerful than motivation. \n\nJust my opinion though!",
          "score": 1,
          "created_utc": "2026-02-02 06:16:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o397ycl",
          "author": "therealtricklowe",
          "text": "At 19 years old, nobody knows what they want to do. The fact thast you've even started multiple businesses is awesome. You just need to learn the difference between a good business, and a bad one, and find something that works.   \n  \nNobody knows what the fuck they're doing at your age. \n\nEven at 25-30, most people don't have their shit together, either. \n\nAt 15 I was an electrician.   \nAt 19 years old I was a pro skater.   \nBetween my 20's and 30's, I was. apro skater, worked also in sales, and had businesses.   \nAt 30 years old, I started an Airsoft park, and it blew up, I was a CEO from 30-40 years old.   \nThen, went back into sales.   \nnow, I'm running a marketing egency.   \n\n\nYou don't need to know what to do, you just need to do as many things as possible, and find something you like doing,. ",
          "score": 1,
          "created_utc": "2026-02-03 00:27:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqif15",
      "title": "Need honest advice if your a experienced tech founders/entrepreneurs",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qqif15/need_honest_advice_if_your_a_experienced_tech/",
      "author": "PensionFinancial4866",
      "created_utc": "2026-01-29 19:28:49",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Fellow tech founder here! Currently building and recently launched a tech startup based in North America (Toronto, Canada & Chicago, USA). Things are going well, but I've got a burning desire to take this thing to the next level.\n\nWould love to get your advice if you achieved \\~$10K+ MRR, 5K+ MAU, or already raised your seed round. What I’m focused on improving right now:\n\n* What should I focus on to increase my chances and actually secure pre-seed funding?\n* Best ways to drive organic user growth at this stage and improve paid conversion?\n* If you were in my shoes, what would you do next to take this company to the next level? What would be your next move as CEO?\n\nAppreciate any honest advice or lessons you've learned that you could share.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qqif15/need_honest_advice_if_your_a_experienced_tech/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2gt3p0",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 19:28:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hk973",
          "author": "Tim-Sylvester",
          "text": ">What should I focus on to increase my chances and actually secure pre-seed funding?\n\nIf you have to ask, that means you don't know VCs or angels who will back you because of *you*. \n\nWhich means there's only one answer: Product in market with paying users. \n\n>If you were in my shoes, what would you do next to take this company to the next level? What would be your next move as CEO?\n\nIf you do not have product in market with paying users, that is your only objective.",
          "score": 2,
          "created_utc": "2026-01-29 21:38:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}