{
  "metadata": {
    "last_updated": "2026-02-27 16:59:57",
    "time_filter": "week",
    "subreddit": "Entrepreneurship",
    "total_items": 17,
    "total_comments": 80,
    "file_size_bytes": 88114
  },
  "items": [
    {
      "id": "1razp52",
      "title": "Scaling an influencer from $2M to $8M was easier than getting past a LinkedIn bot. What is happening?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1razp52/scaling_an_influencer_from_2m_to_8m_was_easier/",
      "author": "Dmastery",
      "created_utc": "2026-02-21 19:11:33",
      "score": 9,
      "num_comments": 10,
      "upvote_ratio": 0.8,
      "text": "I’m going to be blunt because I’m genuinely confused.\n\nI’ve spent 11 years as a Creative & Video Director. My last run was as Head of Content where I built a \"content-to-commerce\" ecosystem that scaled annual revenue from $2M to $8M in 18 months. We basically turned organic video into a high-ticket funnel that actually converted.  \n\nI’m talking high-end cinematic stuff, feature-length documentary standards. I’ve managed the P&L, built global teams from scratch, and handled everything from AI-integrated workflows to GEO/AEO strategy to keep us visible in the new search landscape.  \n\nThe problem:\n\nI’m back in the job market and it’s a graveyard. I’m seeing 500+ applicants on LinkedIn within 10 minutes. I have the data, the portfolio, and the ROI to prove I can move the needle, but I’m getting ghosted by automated HR filters. It feels like the \"apply\" button is just a black hole.\n\nIf you’re a founder or an agency owner here:\n\n1. Is the market actually this saturated, or are companies just overwhelmed by low-quality AI applications that they’ve stopped looking at the real talent?\n\n2. Where do you actually find your senior creative leadership? Because the traditional boards feel like a waste of time for anyone above mid-level.\n\nI’m not looking for a pity party, I’m looking for the \"new rules\" of the game. If you’ve managed to bypass the gatekeepers or you're a founder who hires for these roles, where should I be looking?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1razp52/scaling_an_influencer_from_2m_to_8m_was_easier/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o6nbuuh",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-21 19:11:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6oaz0q",
          "author": "KorelisH",
          "text": "SaaS recruiter here. In short:\n\nBuild relationships \n\nEngage meaningfully with relevant personas \n\nNever auto apply on LinkedIn (0.01 chance of success) \n\n\nThink and be outside of the box (following the first two points)\n \n\nApproach your job search as a full time role\n\n\nActivate your network for a referral (even if your contacts company isn’t actively hiring - many leadership roles aren’t posted publically) \n\n\nIf you’re looking for a leadership position, network and relationship building will be the most important aspects for you to consider. \n\n\n\nOne of my clients is the biggest GEO tool in Europe. Their best candidates don’t come through any form of application. Often headhunted, but the top 1% actively seek to engage with leadership. They add value upfront before asking for the job.",
          "score": 6,
          "created_utc": "2026-02-21 22:16:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6y6o2f",
              "author": "Round-Location-1486",
              "text": "The game now is treating yourself like a niche agency, not a job seeker. Your portfolio and numbers are crazy strong, but they only matter if specific people actually feel the pain you solve and see you talking directly to them. \n\n\n\nWhat’s worked for me in a similar spot: make a hit list of 30–50 founders/CMOs where your “content-to-commerce” case study is directly relevant, then spend 2–3 weeks just showing up in their world. Comment on their posts with specific ideas, send 30–60s loom breakdowns of their current funnel, and ask sharp questions that only someone who’s done this at scale would know to ask. That gets you into real conversations fast.\n\n\n\nOn the tooling side, I’ve used Apollo and Clay to build those target lists, and then Pulse for Reddit to surface founders talking about broken content or demand gen so I can join the thread with something useful instead of cold pitching. The point is to become the person they already trust before the role even exists.",
              "score": 1,
              "created_utc": "2026-02-23 13:39:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6yh4vc",
                  "author": "KorelisH",
                  "text": "Spot on and not surprised that strategy has worked for you!",
                  "score": 1,
                  "created_utc": "2026-02-23 14:37:34",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7ddv28",
                  "author": "These-Resource4356",
                  "text": "Both of these are great. The game has shifted almost entirely to \"it's all about who you know\". ",
                  "score": 1,
                  "created_utc": "2026-02-25 18:31:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7prkvn",
              "author": "KudzuFlowers",
              "text": "It's an extra step, but after applying on LinkedIn (not auto-apply, like you said), going to the employer's website and sending them an email is a way to hopefully not get lost. ",
              "score": 1,
              "created_utc": "2026-02-27 15:31:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ptnay",
          "author": "welshdragon1965",
          "text": "It's not just you. A lot of strong mid to senior candidates are running into the same wall right now. The volume of applications is insane, and companies are leaning heavily on filters just to survive the noise. Unfortunately that means nuance and real track records get lost.   \nFor roles at your level, I have seen more traction come from warm intros and direct conversations than job boards. Founders and hiring managers often hire through their network long before a role is fully public. Reaching out directly with a short, tailored message about how you would move revenue or fix a specific gap can sometimes cut through faster than a polished application.   \nThe market is crowded, but it’s also overwhelmed. The game seems less about credentials and more about getting in front of the right human. ",
          "score": 2,
          "created_utc": "2026-02-22 04:00:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ddkpw",
          "author": "These-Resource4356",
          "text": "The last thing I ever want to be is a doomer, but until LinkedIn, Indeed, other job boards fix the AI resume/AI resume reviewer problem, your #1 asset is going to be the way you network and build connections with decision makers. Hitting the apply button and sending your resume just doesn't work right now. \n\nThe only reason I got my current role (this was 2 years ago as the AI problem was heating up, but not near what it is now) was because I directly messaged the job poster and wrote a letter bragging about myself and why I'm the best fit for the role. She told me directly she wouldn't have ever seen my application without that message. \n\nJust an example, nowadays you may need to go above and beyond and message people at the company asking for advice on how to break through. Tap your already-built network, work with a recruiter, etc. ",
          "score": 1,
          "created_utc": "2026-02-25 18:30:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ptbos",
          "author": "KudzuFlowers",
          "text": "LinkedIn applications can look super half assed if a message/cover letter and all other relevant details are left out. As another user her said, definitely don't hit \"auto apply\"",
          "score": 1,
          "created_utc": "2026-02-27 15:39:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbmdkc",
      "title": "advice",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1rbmdkc/advice/",
      "author": "Fantastic-Bath3830",
      "created_utc": "2026-02-22 13:52:13",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "hey guys! i’m 22 years old, graduated college and landed at a sales job for manufactured homes. i get a salary, commission and bonus for each home I sell. so i have a lot of opportunity to make a ton of money, which is what i want to do so i can fulfill a dream of mine of owning a nightclub where i went to college. i previously owned a business and made $120k in 1.5 years, and loved every second of it, so im not new to entrepreneurship. \n\nI’d like to quit my job at the end of this year and am willing to put in all the work to make it happen, what would you guys do to get clients so i can get sales? just want to hear some ideas! thank you!!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1rbmdkc/advice/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o6rrht9",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-22 13:52:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6sh5bf",
          "author": "Lazzer_Glasses",
          "text": "First, before I quit my job, I would speak with contractors. Figure out how much work you need to do provided that you don't already have your nightclub. Then market research. Look around and find what demographics you're looking for and really lock in on the thematics and how to best appeal to your people. Next, I would slowly ease out of your job, rather than outright quitting all at once. As the nightclub takes off, transition into spending more and more time with that. \n\nIf you're talking about sales with your manufactured homes, work on building relationships. Making a move is a huge decision for a lot of people, and takes a lot of time to orchestrate. You as an agent are there to make that orchestration and the job of actually moving a lot less stressful and to make it a convenience for them.",
          "score": 1,
          "created_utc": "2026-02-22 16:02:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6t69sf",
          "author": "PavelBoss13",
          "text": "So what do you want to do to bring money to buy a club?",
          "score": 1,
          "created_utc": "2026-02-22 17:57:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6vkjim",
          "author": "Least-Can9474",
          "text": "What industry? If possible start a side hustle to transition into.",
          "score": 1,
          "created_utc": "2026-02-23 01:25:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73gjdx",
          "author": "Gamefreakinsanity",
          "text": "what market are you selling in? manufactured homes are blowing up in some areas and completely dead in others, changes everything about how you'd find buyers",
          "score": 1,
          "created_utc": "2026-02-24 06:53:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fzdm1",
          "author": "Hour-Pollution5452",
          "text": "I like the ambition. Just make sure the order is right.\n\nYou are in a role right now that has built-in leverage. Salary, commission, and product demand already exist. That is a gift.\n\nIf your goal is to stack capital to eventually own a nightclub, then your current job is not the enemy. It is the vehicle.\n\nBefore quitting, I would focus on mastering one thing:\n\nPredictable sales production.\n\nIf you can learn to consistently sell manufactured homes, you are building a skill that will fund anything you want later.\n\nA few practical ideas for getting more clients in your current role:\n\nBuild referral relationships with realtors, land developers, and mortgage brokers. They already talk to your buyer.\n\nTrack every objection and pattern. If three buyers say the same thing, fix that part of your pitch.\n\nOwn follow up. Most reps stop too early. Durable follow up wins in big ticket sales.\n\nAlso, be careful about quitting just because you are eager. Entrepreneurship is easier when funded.\n\nIf you can turn your current job into a predictable income engine for 12 to 24 months, you build capital, discipline, and reputation.\n\nNightclubs are capital intensive and margin sensitive. You will want strong cash reserves before stepping into that.\n\nAmbition is good. Structure makes it real.",
          "score": 1,
          "created_utc": "2026-02-26 02:23:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd01um",
      "title": "Looking to create a mastermind group",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1rd01um/looking_to_create_a_mastermind_group/",
      "author": "No-Comparison-546",
      "created_utc": "2026-02-24 01:00:06",
      "score": 6,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "Hi everyone,\n\nI read Think and Grow Rich not too long ago and became really intrigued by the idea of a mastermind group, so I decided to start one. Over the past six months, I led a small group of friends from home and university. It went well overall, but eventually things fizzled out as these things sometimes do.\n\nNow I’m looking to start another group with renewed focus. The goal would be to share goals and milestones, exchange knowledge, talk through challenges we’re facing, and give honest feedback and advice to help each other move forward. Looking to make a group chat and meet for a zoom maybe every other week.\n\nIf this sounds like something you’d be interested in, I’d love to connect.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1rd01um/looking_to_create_a_mastermind_group/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o71zl9w",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-24 01:00:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o725sst",
          "author": "RubixCage",
          "text": "Connect",
          "score": 1,
          "created_utc": "2026-02-24 01:36:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72bqi5",
          "author": "emc_syracuse_2016",
          "text": "Sure…I’ll send you a DM.",
          "score": 1,
          "created_utc": "2026-02-24 02:10:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72g2li",
              "author": "No-Comparison-546",
              "text": "Great!",
              "score": 1,
              "created_utc": "2026-02-24 02:35:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73tak5",
          "author": "PavelBoss13",
          "text": "And why not join those who have already created such a society? Not only share ideas or talk, but cooperate and make money? I think it's more effective than a hobby club",
          "score": 1,
          "created_utc": "2026-02-24 08:51:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7799b9",
          "author": "sushiwit420",
          "text": "A mastermind group can’t just be created like that man. It takes time and patience. Surely, I can join and talk a bit. But a group like that means doing business together too.",
          "score": 1,
          "created_utc": "2026-02-24 20:26:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78wd7y",
          "author": "Salva_X",
          "text": "I don't mind helping out where I can! ",
          "score": 1,
          "created_utc": "2026-02-25 01:25:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7c3m8b",
          "author": "DoorsWithDor",
          "text": "If there's clear direction regarding business avenues and joining skillsets to build, I'll be interested in a further conversation. ",
          "score": 1,
          "created_utc": "2026-02-25 14:59:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gdwgu",
          "author": "Opposite-Barracuda-1",
          "text": "lets connect ..",
          "score": 1,
          "created_utc": "2026-02-26 03:48:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7juana",
          "author": "unclehowzit-02",
          "text": "Aloooha… I have an idea",
          "score": 1,
          "created_utc": "2026-02-26 17:41:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nkkj1",
          "author": "Working-Art-3156",
          "text": "this sounds like something I’d genuinely love to be part of.\nI’m currently building an AI-based personal operating system focused on helping founders understand their decision patterns, long-term goals, and strategic blind spots. It’s still early, but I’m actively prototyping and refining the core logic.\nI’m serious about building, improving consistently, and learning fast. I’d value being part of a small group of solo entrepreneurs who are actually shipping, giving honest feedback, and holding each other accountable.\nIf that aligns, I’d be excited to join and contribute",
          "score": 1,
          "created_utc": "2026-02-27 05:47:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdv0o6",
      "title": "Senior about to graduate",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1rdv0o6/senior_about_to_graduate/",
      "author": "Krolix2",
      "created_utc": "2026-02-24 22:30:12",
      "score": 6,
      "num_comments": 6,
      "upvote_ratio": 0.88,
      "text": "So im currently a high-school senior thats about to graduate real soon and I feel lost. Im still trying to figure out what i want to do and so far all i know is i want money and to be successful. I see people make money online but i honestly don’t understand it really. Any advice would be helpful.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1rdv0o6/senior_about_to_graduate/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o77zsum",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-24 22:30:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ceo5l",
          "author": "These-Resource4356",
          "text": "Congratulations! No doubt you're an exciting point in your life, but I know it can also feel overwhelming. First, take it from someone who thought he had it figured out at your age - things will change. I would actually say it's better to admit you don't know what you want to do than thinking you're sure of what you want to do. You're going to be open to a lot more opportunities than your peers since you won't have tunnel vision. Stay in that space until the right things comes along. \n\nAlso, don't be afraid to just try things. If I could go back I would have tried every possible option I could to see what I could learn from it. \n\nBut in all honesty, if you're looking into making good money and being successful, look into starting what people call a \"boring business\". Just google that term and you'll find content on these types of businesses. They are stable and needed. \n\nGood luck to you and just remember one thing - you have WAY more time to figure this out than you're probably thinking right now. I am 31 and still figuring out where I belong. Just try as many things as you can. That will help you find your direction. ",
          "score": 2,
          "created_utc": "2026-02-25 15:52:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78v7rf",
          "author": "Salva_X",
          "text": "Hey, First congrats on almost finishing high-school! Their is honestly a couple directions you can go and depends on what you want to do. A saying I love is, Do what you love, learn how your passion can solve the problems of others and the money will follow. \n\nFor example, If you love cars, and the idea of helping others and get experience looking at other cars, Start a Detailing buisness. Save up some money for a few months doing any Quick service like Taco bell, KFC or anything. Buy your equpment, A few flyers and start adding them to \"nice places. Brownie points if you document your process (never have to show your face) and get paid to clean and look at cars while getting paid for views on TT, Reels, YT Shorts. \n\nThats just an example but remember, Quick money leaves quick and Slow, intentional money builds wisdom! Also, your only around 18. As someone that is 34, I will say the fact that you went on this page to post this question is doing more then most 30 yr olds I know! Keep your head up high, Try new things, and remember, you miss every swing you dont take. \n\nP.S Im a Dir for an Ops company and Starting my own business and i started at Taco Bell for 3 years beforeeI got my first job. You got this! DM if you ever want any questions or just some simple guidance always willing to help! ",
          "score": 1,
          "created_utc": "2026-02-25 01:19:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79sszg",
              "author": "Krolix2",
              "text": "Thanks a lot i appreciate the advice!",
              "score": 1,
              "created_utc": "2026-02-25 04:37:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o79rr8y",
          "author": "Outside-Argument-103",
          "text": "If you don’t know what you want to do next go with the easy option. Never stop learning. That means enrolling either in your local juco (may as well not spend on a 4 yr school until you know what you want) or a local trade school and learn a skill.",
          "score": 1,
          "created_utc": "2026-02-25 04:30:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79t2uq",
              "author": "Krolix2",
              "text": "What trades would u consider in todays world? I know some say some are better than others",
              "score": 1,
              "created_utc": "2026-02-25 04:39:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rch2h8",
      "title": "First Customer",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1rch2h8/first_customer/",
      "author": "Technical_Project169",
      "created_utc": "2026-02-23 13:13:02",
      "score": 5,
      "num_comments": 13,
      "upvote_ratio": 0.86,
      "text": "When you were trying to get your first customer, what was the hardest part?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1rch2h8/first_customer/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o6y2d6t",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-23 13:13:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yg3s7",
          "author": "AdAgreeable2397",
          "text": "Trust, I feel the hardest part is to build a brand that’s trust worthy for clients to pay to it. I have a clothing brand, and hardest thing was to build a trust worthy page that would make people comfortable to pay. And I still remember my very first customer",
          "score": 3,
          "created_utc": "2026-02-23 14:31:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6zhhbd",
              "author": "Technical_Project169",
              "text": "Trust is huge. I think that’s what I’m feeling right now asking someone to pay when you don’t have proof yet. That first customer really changes everything",
              "score": 2,
              "created_utc": "2026-02-23 17:31:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o70x902",
          "author": "AnonJian",
          "text": "I often ask what percentage of the research pool converted. You know, the people you developed alongside of so you weren't crapping something out market blind. \n\nPeople just stare at their screen, stunned. You find your first customers in the research phase most either skip or botch.",
          "score": 2,
          "created_utc": "2026-02-23 21:35:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o744v3n",
              "author": "Technical_Project169",
              "text": "That’s a good point. I probably rushed through research instead of really building with people. Makes sense the first customers should’ve come from there.",
              "score": 1,
              "created_utc": "2026-02-24 10:40:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o77rkab",
                  "author": "AnonJian",
                  "text": "You have come to a realization some spend two, three, five years reaching. Kudos.",
                  "score": 2,
                  "created_utc": "2026-02-24 21:50:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6y5j71",
          "author": "restacked_",
          "text": "I’m a software engineer, I can build like crazy, sales and marketing is not my cup of tea, but I’m learning. Sounds cliche now, but I put ChatGPT in deep research mode, describe my app, and tell it to produce a step-by-step complete marketing plan. Try that out and let me know how it works for you. I don’t always follow its plan verbatim, but it does give good insights.",
          "score": 2,
          "created_utc": "2026-02-23 13:32:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6zhe7i",
              "author": "Technical_Project169",
              "text": "That’s fair. I’ve been leaning on AI too for structure, but I’m realizing distribution and real conversations matter more than a perfect plan. Appreciate the tip",
              "score": 2,
              "created_utc": "2026-02-23 17:31:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6zi9cz",
                  "author": "restacked_",
                  "text": "Yep, distribution is key. I’ve built a lot of side projects first, never really knowing if it was something people actually wanted. My latest project I’m starting with distribution first, kinda. Lots more upfront research on “is this an actual problem someone will pay for” before I get into the weeds building it.\n\nThinking in founder mode vs engineering mode is key. Good luck to you!",
                  "score": 2,
                  "created_utc": "2026-02-23 17:35:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o77po85",
          "author": "PM_CHEESEDRAWER_PICS",
          "text": "Not posting questions like this instead of working on my product",
          "score": 1,
          "created_utc": "2026-02-24 21:41:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdkqqs",
      "title": "Looking for advice on launching an App",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1rdkqqs/looking_for_advice_on_launching_an_app/",
      "author": "AblePirate2663",
      "created_utc": "2026-02-24 16:22:43",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Hey guys, I have been working on an App for financial news intelligence, I am about to launch It and still can´t figure out a 'solid' launch strategy. \n\nI will do ASO, talk about it with people discussing the key problems on reddit, launch an X account and do some giveaways and promotion, but what else? \n\n  \nI don´t really have a budget and my social media following is quite small (>1k). \n\n  \nAny advice? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1rdkqqs/looking_for_advice_on_launching_an_app/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o75rcaz",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-24 16:22:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77yot5",
          "author": "jamo_n_tango",
          "text": "We found that improving visibility into where real interest was forming we noticed this when testing tools like SyndrAI helped us double down on conversations that actually converted instead of chasing vanity engagement",
          "score": 2,
          "created_utc": "2026-02-24 22:24:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1re8egg",
      "title": "I accidentally created a completely new untapped business model",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1re8egg/i_accidentally_created_a_completely_new_untapped/",
      "author": "LilTiit",
      "created_utc": "2026-02-25 09:11:27",
      "score": 4,
      "num_comments": 2,
      "upvote_ratio": 0.75,
      "text": "So I started off with SMMA but was struggling really hard, getting results to a random business with meta ads was so fkn challenging. \n\nI continued to suffer until I got a new, slightly different client. It was an older woman with a cooking youtube channel. She wanted to start making money other than the tiny YT adsense payouts. \n\nI told her to record a cooking course, then I built her a landing page, set up some automations along with the course hosting platform and we launched it to her followers.\n\nThe sales started coming in, she made 50K off that launch and my 10% commission on that was not bad.\n\nAfter that I continued finding people with big followings and helping them launch a product.\n\nThe success was always ultra predictable unlike with meta ads.\n\nThink of it like a big dam that’s holding water (loyal followers). You just come in, help break the dam (by launching a product) and the sales start pouring in. And you get all the credit.\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1re8egg/i_accidentally_created_a_completely_new_untapped/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o7api2d",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-25 09:11:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rem06t",
      "title": "Small decisions that ruins your business?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1rem06t/small_decisions_that_ruins_your_business/",
      "author": "Dry-Bowler182",
      "created_utc": "2026-02-25 18:47:36",
      "score": 4,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "Hi everyone, I'm back. I’m starting a B2B SaaS and I’d like to hear your tips on those small things that nobody cares about at first, but cause big problems later. I don’t mean the typical advice like 'you need to get clients' or 'earn more than you spend.' I’m looking for those small details that actually make a difference. I want to hear about your experiences the small decisions or problems that changed your business for better or worse",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1rem06t/small_decisions_that_ruins_your_business/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o7dhee7",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-25 18:47:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7evmbx",
          "author": "PineappleManMan18",
          "text": "Great question. The stuff that quietly hurts you later usually looks harmless at the beginning.  \nA few small decisions that ended up being big in my experience:\n\n1. Vague positioning  \nEarly on, it feels smart to keep messaging broad so you don’t limit yourself. What it actually does is attract mismatched customers. That leads to:  \n\\-higher support load  \n\\-feature creep  \n\\-messy roadmap decisions\n\n2. Letting early customers dictate the product  \nYour first 5-10 customers are loud and influential. If you overfit to them without checking whether they represent your real market, you can drift fast.\n\n3. Not defining what a qualified customer is  \nWe once didn’t clearly define who the product was not for. Sales closed deals that looked good on paper but created longterm churn and operational drag.\n\n4. Poor data hygiene  \nEarly on, nobody cares about clean tracking. Later, you realize you can’t trust your metrics. Then every growth decision feels like a guess. Visibility into what’s actually happening we noticed this when working with tools like SyndrAI in another context becomes far more important than new features.",
          "score": 2,
          "created_utc": "2026-02-25 22:43:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dvjad",
          "author": "BomberR6",
          "text": "Following trends. Just because something works for someone else doesn't mean it's going to work for you.  I run a small print shop as a side business and last year those custom magnets were all the rage online. Spent $150ish on cheaper supplies that did the same thing, added it to my services provided on all my pages and made some posts about making them.... not one person reached out in over a year to have a custom magnet made. I recently sold all my stuff for that for exactly what I paid for it as prices have increased on them a little.",
          "score": 1,
          "created_utc": "2026-02-25 19:52:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gl9e9",
          "author": "Cru_Jones_is_RAD",
          "text": "Never do business with the three F’s.  Friends, family, or free.  You are right you do not need more clients you need net profit. Volume kills, profit thrills!",
          "score": 1,
          "created_utc": "2026-02-26 04:36:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gxgi1",
          "author": "deep_m6",
          "text": "The decision to define your ideal customer profile because of its broad definition will bring permanent harm to B2B SaaS. The statement we can serve everyone seems harmless in the beginning but it creates problems with products which become excessively complicated and it causes sales processes which take an unending time to complete.  \n  \nThe main problem arises when companies set their initial product prices too low. The approach appears to be a strategic move, but it establishes your brand at an unprofitable level which creates difficulties for your company when you try to increase prices.  \n  \nThe process of onboarding needs to be skipped, which creates problems. Customers who join your company at the beginning will accept some level of difficulty, but ineffective onboarding methods will cause customers to stop using your service.  \n  \nThe small choices which determine how you will position your company and set prices and handle onboarding processes will create. You need to establish clear goals at the beginning of your SaaS project because this will help you avoid expensive changes during your development process.",
          "score": 1,
          "created_utc": "2026-02-26 06:06:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h33h5",
          "author": "Ukiyoprod",
          "text": "The majority of B2B SaaS failures I have seen are due to “small” things:\n\n\\* Saying yes to custom features\n\n\\* Unclear ICP (trying to serve everyone)\n\n\\* Poor onboarding\n\n\\* Not talking to users weekly\n\nNone of them seem risky in the beginning, but all of them add up.",
          "score": 1,
          "created_utc": "2026-02-26 06:54:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7i0b7o",
          "author": "HuckleberryPretty539",
          "text": "Good question. It’s usually not the big mistakes that hurt, it’s the quiet small ones.\n\nOne is choosing the wrong ICP at the start. If you go slightly too broad, your messaging stays generic, your product roadmap gets messy, and support becomes chaotic. It feels small early, but it compounds fast.\n\nAnother is weak onboarding. If users don’t hit value in the first few days, churn becomes normal and you start blaming marketing instead of fixing activation.\n\nIgnoring tracking is another silent killer. If you don’t define what a “qualified user” or “success event” is early, you’ll make decisions based on vibes instead of data.\n\nAlso, underpricing just to get traction. Cheap customers are usually the most demanding and least loyal. That positioning sticks longer than you think.\n\nAnd one more that people underestimate: saying yes to every feature request. It slowly turns a focused product into a Frankenstein tool.\n\nMost businesses don’t collapse from one big wrong move. They drift because of small, uncorrected decisions repeated for months.",
          "score": 1,
          "created_utc": "2026-02-26 11:57:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ifwil",
          "author": "That-Daikon-8093",
          "text": "1. Sell before you build. \n\n2. Understand your user and get deep into their problems. Always continue speaking to them\n\n3. Better do one think good, than many mediocre",
          "score": 1,
          "created_utc": "2026-02-26 13:38:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mjdia",
          "author": "Rich-Editor-8165",
          "text": "yea the small stuff really does come back to bite you. Hiring someone because they’re “good enough” instead of truly strong can slow you down for months. Underpricing just to get early users often attracts the wrong customers and makes it hard to raise prices later. Skipping proper onboarding feels harmless at first, but it quietly drives churn. And avoiding tough conversations with a cofounder never makes things better, it just delays the explosion. In B2B SaaS, the quiet decisions are usually the ones that shape everything.",
          "score": 1,
          "created_utc": "2026-02-27 01:49:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbifyh",
      "title": "Good idea?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1rbifyh/good_idea/",
      "author": "eindrey",
      "created_utc": "2026-02-22 10:24:05",
      "score": 4,
      "num_comments": 17,
      "upvote_ratio": 0.83,
      "text": "Would hiring someone from Fiverr to grow my facebook page be a good idea? cuz i’m doing Affiliate Marketing and was heavily advised to start posting on Facebook and i’m not really doing great so i need help so",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1rbifyh/good_idea/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o6r1byn",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-22 10:24:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6r4z8f",
          "author": "JestonT",
          "text": "Tbh, I think it would be a better idea to find someone you trusted or at least someone to work with you long-term, since affiliate marketing is a long term stuff, and Fiverr is mostly used for gigs, not jobs",
          "score": 2,
          "created_utc": "2026-02-22 10:58:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6u10u6",
              "author": "eindrey",
              "text": "i’ll see who’s available and what i can do . thank you",
              "score": 1,
              "created_utc": "2026-02-22 20:23:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6rvc88",
          "author": "HuckleberryPretty539",
          "text": "no, not the way you’re thinking about it.\n\nMost Fiverr “Facebook growth” gigs mean one of three things:\n• Buying low-quality followers\n• Engagement pods or bot comments\n• Spam posting in random groups\n\nThat might inflate numbers, but it won’t bring real affiliate sales. And fake engagement can hurt reach long term.\n\nIf you want help, hire for content strategy or content creation, not “growth.” For example:\n• Someone to help you define a niche and angle\n• Someone to write better hooks and posts\n• Someone to design simple visuals\n• Someone to analyze what’s working in your space\n\nAffiliate marketing works when you build trust and consistent value. Growth hacks without positioning usually waste money.\n\nBefore hiring anyone, ask yourself:\nDo I know exactly who I’m targeting and what problem I solve?\n\nIf that’s unclear, no freelancer can fix it.",
          "score": 2,
          "created_utc": "2026-02-22 14:14:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6u1f2a",
              "author": "eindrey",
              "text": "i’m in the vegan niche and i’m mainly targeting busy beginners that just got into being vegan and are overwhelmed with recipes and i’m trying to simplify that for them",
              "score": 1,
              "created_utc": "2026-02-22 20:25:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6xvhrw",
                  "author": "HuckleberryPretty539",
                  "text": "That’s actually a solid niche. Busy beginners is specific enough.\n\nYour issue probably isn’t growth help. It’s messaging clarity.\n\nIf you’re targeting overwhelmed beginners, your content should feel like relief.\nThink:\n\n• “5 lazy vegan dinners under 15 minutes”\n• “One simple grocery list for your first week vegan”\n• “Stop overcomplicating vegan meals”\n\nMake it practical and simple, not inspirational.\n\nHiring someone from Fiverr won’t fix this unless they understand your exact audience. First, tighten your angle. Once your posts clearly solve one small pain, growth becomes easier.",
                  "score": 2,
                  "created_utc": "2026-02-23 12:26:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6sfxj3",
          "author": "Technical-Spend-9037",
          "text": "It can help, but be careful. Some Fiverr sellers use fake followers which won’t help your affiliate sales and could hurt your page. If you hire someone, make sure they focus onreal engagement and organic growth not just numbers.",
          "score": 2,
          "created_utc": "2026-02-22 15:57:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6u0xbd",
              "author": "eindrey",
              "text": "alright i’ll keep that in mind and make sure to follow that advice",
              "score": 1,
              "created_utc": "2026-02-22 20:23:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6u8o5b",
                  "author": "Technical-Spend-9037",
                  "text": "Sure",
                  "score": 1,
                  "created_utc": "2026-02-22 21:02:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6vktk2",
          "author": "Least-Can9474",
          "text": "Do it yourself. Most of the people on Fiverr in this space will never care as much as you do. It will be tough, but eventually you will find your groove!! ",
          "score": 2,
          "created_utc": "2026-02-23 01:26:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7b8593",
              "author": "eindrey",
              "text": "thank you for the motivation , i’ll keep trying",
              "score": 1,
              "created_utc": "2026-02-25 11:55:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72fuya",
          "author": "No-Comparison-546",
          "text": "Depends what you need to do- could look into Virtual assistants",
          "score": 2,
          "created_utc": "2026-02-24 02:34:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7b86jr",
              "author": "eindrey",
              "text": "i’ll check it out at least",
              "score": 1,
              "created_utc": "2026-02-25 11:55:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o78aj26",
          "author": "AgenticRevolution",
          "text": "It sounds like you’re not at the stage to be paying for people to do work on your behalf.",
          "score": 2,
          "created_utc": "2026-02-24 23:25:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7b7yzw",
              "author": "eindrey",
              "text": "i guess not actually",
              "score": 1,
              "created_utc": "2026-02-25 11:54:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7e95xk",
          "author": "Alarming_Scene_5718",
          "text": "dont hire fiverr yet, i have learned, post consistently, engage followers, test small paid boosts",
          "score": 1,
          "created_utc": "2026-02-25 20:56:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfm3v1",
      "title": "Trying to figure out how fundraising actually works!",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1rfm3v1/trying_to_figure_out_how_fundraising_actually/",
      "author": "Low_Piglet_2257",
      "created_utc": "2026-02-26 20:54:42",
      "score": 4,
      "num_comments": 9,
      "upvote_ratio": 0.83,
      "text": "Folks, I’m genuinely very new to this. I’m someone who has always been fascinated about entrepreneurship and wanted to build something of my own with everything that I’ve got in me.\n\nGrew up consuming a lot of business podcasts, youtube videos, following startups that then became the next big name, a lot of Shark-Tank and Dragon’s Den episodes, and a ton of case-studies of both success and failure. Nonetheless, that made me more passionate about actually wanting to start executing and just keep consuming while putting all the knowledge to no fruitful use.\n\nHere’s something that I’ve been wondering-\n\nEverything looks so shiny, glamorous and a cup of tea on Television-pitches. (Yes, I am referring to Shark-Tank here) Never really had the opportunity to actually learn about how fundraising actually works. The thoughts that go behind actually plan to raise funds, garnering A-Z knowledge about the process, and how things sum up after a successful/failed attempt at raising capital- how do you build conviction regarding all of this?\n\nHow do you know when it’s time?\n\nHow do you plan to approach? How do you prepare? You get me? (Basically every detail that revolves around the entire process of the same.\n\nI have watched a lot of these explainer contents, but somehow, they do feel incomplete, and don’t look like the missing piece of the puzzle. And cannot be the same process for raising across business in varied niches.\n\nI bet many of you must have sailed in this boat that I am in currently. Seeking your expertise and insights.\n\nI really wish you have wonderful one ahead!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1rfm3v1/trying_to_figure_out_how_fundraising_actually/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o7kzf3d",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-26 20:54:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lec7a",
          "author": "PineappleManMan18",
          "text": "Fundraising becomes clear when momentum exists and capital is the bottleneck not when the idea feels exciting so preparation is about proving what works, why now, and how money accelerates it, a mindset that clicked for me once I started tracking real signals and visibility we noticed this when using SyndrAI.",
          "score": 2,
          "created_utc": "2026-02-26 22:05:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7o5wuq",
              "author": "Low_Piglet_2257",
              "text": "You put a fair point. It’s all the little nuts and bolts that help realise the outcomes. I’d love to discuss more on this. DM’ed you. :)",
              "score": 1,
              "created_utc": "2026-02-27 08:53:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7puv83",
          "author": "Ok_Tart5733",
          "text": "Fundraising definitely looks glamorous on TV, but the reality is a lot more strategic and messy. The first step is knowing why you need it and what it will achieve raising money without a clear plan often backfires. Timing usually comes when you have some traction, a clear market, and a roadmap for growth that investors can understand. Preparation means building your pitch, financial model, and story, and talking to mentors or experienced founders before ever emailing an investor. Approach it as a process, not a single meeting: research the right investors, warm up the conversation, and gather feedback along the way. Conviction comes from understanding your business deeply, knowing the numbers, and being ready to answer the tough questions honestly.",
          "score": 2,
          "created_utc": "2026-02-27 15:46:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pvs8k",
              "author": "Low_Piglet_2257",
              "text": "This is something I have been hearing so often, and it could be so true. Haven’t ever raised any kinds of funds yet, but I am definitely  able to get a gist of this thing. I appreciate your insight :)",
              "score": 1,
              "created_utc": "2026-02-27 15:51:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7px5xa",
                  "author": "[deleted]",
                  "text": "[removed]",
                  "score": 2,
                  "created_utc": "2026-02-27 15:57:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rajhdo",
      "title": "The most underrated entrepreneurial skill: reading between the lines of user feedback.",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1rajhdo/the_most_underrated_entrepreneurial_skill_reading/",
      "author": "Prestigious_Wing_164",
      "created_utc": "2026-02-21 06:05:14",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 0.71,
      "text": "Early users of Reoogle would say things like 'The search is great.' That's nice, but not useful. I learned to probe. 'What were you trying to find that you couldn't?' That's where the gold was. One user mentioned trying to 'time their posts for a UK audience.' That single comment led to the Best Posting Time Analyzer, a feature that differentiates the tool at https://reoogle.com. Users often can't articulate the solution, but they can vividly describe their struggle. Your job is to listen to the struggle, not the suggested fix. How do you extract actionable insights from vague user feedback?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1rajhdo/the_most_underrated_entrepreneurial_skill_reading/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o6k5ouo",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-21 06:05:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rahwjc",
      "title": "I'm a professor doing research on product ideation, and I need your help",
      "subreddit": "Entrepreneurship",
      "url": "https://virginiatech.qualtrics.com/jfe/form/SV_3n3uNygcCiZ4ciq",
      "author": "bltphd",
      "created_utc": "2026-02-21 04:41:41",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1rahwjc/im_a_professor_doing_research_on_product_ideation/",
      "domain": "virginiatech.qualtrics.com",
      "is_self": false,
      "comments": [
        {
          "id": "o6jv60w",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-21 04:41:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rc82cn",
      "title": "I need serious people",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1rc82cn/i_need_serious_people/",
      "author": "Dael_Gard",
      "created_utc": "2026-02-23 04:44:34",
      "score": 3,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "I need serious people who can guide me in structuring things better, obtaining financing and growing the import business. \nIn a country like Cuba, where there is no real financial system, in addition to little institutional support but my business is good. \nI need serious people, who know about business, to whom I can ask my questions. Or at least have the real impetus to help. \nI also need serious people who can represent me out there when it comes to raising money and creating alliances with other foreign entrepreneurs. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1rc82cn/i_need_serious_people/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o6wfm9a",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-23 04:44:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ww8ws",
          "author": "PavelBoss13",
          "text": "I know serious people, but they won't give me money",
          "score": 1,
          "created_utc": "2026-02-23 07:00:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x12lo",
          "author": "AnonJian",
          "text": "Anybody who knows about business knows what an embargo is. Serious people know what Communism is, and its relationship to business. If you don't know what crony capitalism is, you are not one of them.",
          "score": 1,
          "created_utc": "2026-02-23 07:45:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73dary",
              "author": "Dael_Gard",
              "text": "Mostly of chicken here is import from Miami, so...",
              "score": 1,
              "created_utc": "2026-02-24 06:25:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7j7b2k",
          "author": "OddInvite2544",
          "text": "May I know what kind of goods you are importing?",
          "score": 1,
          "created_utc": "2026-02-26 15:55:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kv9dg",
              "author": "Dael_Gard",
              "text": "cement and construction materials.\nBut I want to start importing food, which is easier and has greater turnover.",
              "score": 1,
              "created_utc": "2026-02-26 20:34:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1reew6p",
      "title": "Junk Removal Business",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1reew6p/junk_removal_business/",
      "author": "Life_Conclusion_6941",
      "created_utc": "2026-02-25 14:36:38",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Junk removal can make you some very serious cash, even just for those who are just starting out. You can easily charge $150+ per hour from the moment you leave home to the moment you get back home for most if not all junk removal jobs. All you really need is a vehicle that can pull a trailer, and a trailer. Or heck even just a pickup truck with an open bed and a couple ratchet straps. You can basically start this job with $0 given you already have a truck.\n\nA couple things that are useful are dolly’s, ratchet straps, trash bags, and for those with some extra money, a dump trailer.\n\nYou can start with a Facebook post or asking some friends or family if they need or know someone who needs junk removed from their home or around their home. You can quote them by asking for pictures or by going to the residence and quoting based off what you see.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1reew6p/junk_removal_business/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o7byzjl",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-25 14:36:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gbvxy",
          "author": "PatSabre12",
          "text": "are all posts in this sub AI now? ",
          "score": 2,
          "created_utc": "2026-02-26 03:36:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7iavf8",
              "author": "Life_Conclusion_6941",
              "text": "I’m not a bot lmao, was genuinely giving out some advice.",
              "score": 1,
              "created_utc": "2026-02-26 13:09:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rd9dri",
      "title": "What personal habit tool or system do you use to maintain consistency when business work gets unpredictable?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1rd9dri/what_personal_habit_tool_or_system_do_you_use_to/",
      "author": "Wide_Flatworm_489",
      "created_utc": "2026-02-24 07:03:49",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1rd9dri/what_personal_habit_tool_or_system_do_you_use_to/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o73hpco",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-24 07:03:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75s9mr",
          "author": "GoodAndBadPuns",
          "text": "I've been using Covoy and it's been an incredible unlock for me.",
          "score": 2,
          "created_utc": "2026-02-24 16:26:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78vtlx",
          "author": "Salva_X",
          "text": "I think We would need a little more details on what you mean by this. IF were talking like Ops and Business Strategy, I like Asana or the L10 Framework is another one good for new into ops. If you are looking for Project Management, Something like [Monday.com](http://Monday.com) is really nice to utilize as well. \n\nThere are so many options so if you can provide a little more context, like industry, type of issue, Personal to manage your work, or to manage your team. Etc... \n\n",
          "score": 2,
          "created_utc": "2026-02-25 01:22:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7a2ex9",
              "author": "Wide_Flatworm_489",
              "text": "I was thinking about tools to manage personal/business they are both same to me. ",
              "score": 1,
              "created_utc": "2026-02-25 05:47:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7bhhqx",
                  "author": "Salva_X",
                  "text": "Hmmm. I would encourage you to split them if possible or maybe that is just how my brain works. The tools I use for example to manage my house and personal habits I have is not the same that I do to manage items for my teams. I couldn't see where I would want to overlap them as they both have seperate end goals and I utilize the tool to help me get to my goal. ",
                  "score": 1,
                  "created_utc": "2026-02-25 12:59:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7jipyh",
          "author": "Hungry-Perception761",
          "text": "Honestly, hiring a VA changed everything for me.\n\nWhen work gets unpredictable, I delegate the repeatable and admin tasks so I can stay focused on the few things that actually move the business forward. Even just offloading email, scheduling, or follow-ups creates breathing room.\n\nConsistency gets a lot easier when you are not trying to do everything yourself.",
          "score": 1,
          "created_utc": "2026-02-26 16:47:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rewlde",
      "title": "A Hot take and looking for some insight.",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1rewlde/a_hot_take_and_looking_for_some_insight/",
      "author": "Ok-Association-2995",
      "created_utc": "2026-02-26 01:28:39",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I think retirement accounts are pointless, and here is why.\n\nBeyond tying that money up that you can't touch and if you even do get to touch it one day and \"retire\". What if you used every dime to start your own business or find other ways to get continuous cash flow?\n\nNot only that I think retirement is overrated. It's a death sentence. You have to have something to do. Stay moving, you rest, you rust.\n\nThe reason I have these thoughts is because I work for local government and the conversations between coworkers is all about our pension and how you can \"retire\" at 50. I've been thinking of leaving and starting my own business but people think you'll explode without a retirement account. My life doesn't start when I turn 50 with a pension.\n\nFirst off, the pension barely covers insurance when you do retire. so no, you cannot \"retire\". but even if you could. Why in the fuck would you want to throw the towel in at 50?! \n\n  \nI'm in my later 20s and not a bone in me cares to play it safe. At the end of the day pension or not you are going to die. So why not push boundaries with businesses and personal goals. Instead of playing it \"safe\" I don't think multi millionaires with multiple businesses are worried about IRAs or 401ks.\n\nAny insight? If I'm regarded let me know.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1rewlde/a_hot_take_and_looking_for_some_insight/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o7fpssj",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-26 01:28:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ftkap",
          "author": "o1thekidd",
          "text": "Definitely coming back to this one🤔👀👀",
          "score": 1,
          "created_utc": "2026-02-26 01:50:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kozaz",
          "author": "emc_syracuse_2016",
          "text": "You’re not alone.  The false assumption is that 401k plans are the ONLY retirement plan you need.  That’s just not true anymore, partly because retirement isn’t sitting on a rocking chair on your front porch anymore.  Retirees want to be active, giving back, staying busy, or just doing things their parents and grandparents didn’t do in their retirements.  So…plan accordingly.",
          "score": 1,
          "created_utc": "2026-02-26 20:04:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nkwri",
          "author": "cragwallaccess",
          "text": "I'm 63. Grew up in a business I was supposed to take over but failed that in the early 80s recession. Failed in 3 iterations of the first climbing wall businesses in the US. Then worked for early stage start-ups until finally seeing one through to a modestly successful exit...for the owners, and a very small stake for myself. But in those years I did get a house paid off, started doing some retirement savings, and took my business skills into financial leadership in 2 private equity backed construction platforms, the current one that went public last year. Almost all of these \"jobs\" had various levels of flexibility but also handcuffs, whether I owned them or worked for others. \n\nAt 63 I'm pretty happy to have some resources for my last 1000 weeks. I'm hoping for a little more optionality in the work I choose to stay involved in, hopefully a little less corporate score keeping and a little more applying what I've learned to some of the problems business will never solve.\n\n\"Why not push boundaries with business and personal goals?\" Yeah, why not? You can do that playing the odds of self-employment, or finding good organizations to work for and crafting a life within the means that provides. It's not either or. But if you're going to chase business, start with understanding what it always is at its core: get orders, fill them profitably, collect the money, above your true break-even point, without running out of cash. 10SecondMBA. Most businesses fail at those basics and often take down all types of other \"personal goals\" with them. Don't let the B2Be-Your-Own-Boss HypeTrain distract you from the basics or you'll be part of the wealth transfer to those that have figured out it's sales at volume with profitability forever.\n\nSix decades might be more insight than you're looking for, but motorcycle parts, climbing walls, custom guitars, razor wire, pipeline construction or data centers...business is simple at its (often brutal) core. That's no reason not to try the experiment. It's easier than ever. Just don't lose sight of the basics.",
          "score": 1,
          "created_utc": "2026-02-27 05:49:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ph94g",
          "author": "Snoo-23641",
          "text": "\"I don't think multi millionaires with multiple businesses are worried about IRAs or 401ks.\"\n\nI know I'm not, but I suspect it's because I have them.",
          "score": 1,
          "created_utc": "2026-02-27 14:40:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbsteq",
      "title": "Early stage entrepreneurs: how did you decide what to focus on?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1rbsteq/early_stage_entrepreneurs_how_did_you_decide_what/",
      "author": "Patient_Butterflies",
      "created_utc": "2026-02-22 18:06:28",
      "score": 3,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "I’m in the early stages of building my brand and honestly feeling the pull in a lot of directions.\n\nThere are so many possible offers, platforms, and revenue streams. I know money matters and I want to build something sustainable. But what really motivates me is alignment with my values and purpose, not just chasing income.\n\nI’m realizing I don’t get energized by “just make more money” advice.\n\nFor those of you who’ve been here, how did you decide what to double down on in the beginning?\n\nWhat helped you focus instead of trying everything?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1rbsteq/early_stage_entrepreneurs_how_did_you_decide_what/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o6t8do8",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-22 18:06:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6te0fe",
          "author": "Wise-Trouble-653",
          "text": "The tension isn’t between money and purpose. It’s between clarity and possibility.\n\nEarly stage feels scattered because everything looks viable in theory. Focus usually comes when you pick one problem, one audience, and commit long enough to see real data instead of emotional swings.\n\nValues matter. But values don’t remove trade-offs. They just help you choose which constraints you’re willing to live with.",
          "score": 4,
          "created_utc": "2026-02-22 18:32:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75acop",
          "author": "HuckleberryPretty539",
          "text": "Early on, I stopped asking “what could make money?” and started asking “what problem am I willing to stay obsessed with for 3 years?”\n\nThat filters 80% of distractions.\n\nThen I picked one audience, one core problem, one offer. Not because it was perfect, but because focus compounds. Scattered effort feels productive but rarely builds momentum.\n\nValues matter, but they need a market. So I tested small. Sold before building too much. If people paid and I still enjoyed delivering it, that was my signal to double down.\n\nClarity didn’t come from thinking. It came from committing, executing, and watching what pulled me forward instead of draining me.\n\nIn the beginning, depth beats variety.",
          "score": 3,
          "created_utc": "2026-02-24 15:04:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ttwjq",
          "author": "Cupidai111",
          "text": "Very simple, just follow what excites you most",
          "score": 2,
          "created_utc": "2026-02-22 19:48:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78ieqm",
              "author": "illseeutmrw",
              "text": "Super true if you get excited and jumpy thinking about how to make something and create something that's what you're supposed to do.",
              "score": 1,
              "created_utc": "2026-02-25 00:09:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o78kgfz",
                  "author": "Cupidai111",
                  "text": "This is the way, never stray from the way",
                  "score": 1,
                  "created_utc": "2026-02-25 00:20:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6uwft2",
          "author": "designingclarity",
          "text": "Hey, 4x founder here. I write about exactly this on substack, may be worth your while to check it out:\nDesigning for Clarity",
          "score": 2,
          "created_utc": "2026-02-22 23:06:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cthzn",
          "author": "Unhappy-Respect-4577",
          "text": "Create something that reflects who you are and stay focused on your initial vision (the solution may be modified based on feedback from your customers or testers, but the vision remains the same).",
          "score": 2,
          "created_utc": "2026-02-25 16:59:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6y6eag",
          "author": "Rich-Editor-8165",
          "text": "tbh most early founders choose based on one filter which is \" what problem can I solve well that people are already paying for\". Then they commit to it for a fixed period and ignore everything else. Focus usually comes from constraint, not inspiration. so i suggest to pick one direction, give it enough time to gain traction, and let real world feedback narrow the path.",
          "score": 1,
          "created_utc": "2026-02-23 13:37:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70ufj5",
          "author": "analyteprojects",
          "text": "In my opinion, the key is, what problem keeps you up at night? A sustainable business is built on addressing a problem for some audience. A problem that keeps you up at night likely intersects with your personal values. ",
          "score": 1,
          "created_utc": "2026-02-23 21:22:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78ibcy",
          "author": "illseeutmrw",
          "text": "Picking something you're actually knowledgable on and when you think about it you're like \"I have got to build this NOW this is a real problem that I know I can fix\". Once you have that I feel like you know what you're supposed to be doing.",
          "score": 1,
          "created_utc": "2026-02-25 00:09:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nnn2j",
          "author": "cragwallaccess",
          "text": "Nice. You're grappling with the conditional limits of business. At its core it's transactional and monetary. Even if you're solving a great problem, creating value, and being aligned with your values and purpose, as rare as getting all of those in alignment, via business will likely be. Not impossible. Not never. But statistically low. IF the business successfully achieves the fundamentals (get orders, fill them profitably, collect the money, above your true break-even point, without running out of cash - 10SecondMBA) then you'll have resources and options that can feed additional purpose and values, etc. IF it doesn't...hang onto your values and whatever you learn in the process, but say goodbye to your cash, time, energy, etc. until you finally pull the plug. That's most businesses.\n\nSo what helped me focus? At some point while battling a Fortune 50 conglomerate trying to put us out of business in a tiny $20M niche perimeter security market, I figured out what successful business is at its core, and made sure we did everything to cover those bases (enough cash for payroll and materials, relentless focus on sales and collections). This was in the middle of the 2007-2009 economic meltdown. Fortunately the focus was part of surviving to an eventual modestly successful exit. Better than most outcomes, but not enough to never work again for me.   \n  \nI moved on to making a lot more as a financial lead in a couple private equity platforms, one that went public last year. After 60 years in the trenches (from age 3 on my dad's shop floor in a family motorcycle business, to 23 starting the first US climbing wall company, to stints at Breedlove Guitars collecting money from U2, to razor wire, oil pipeline construction and now data centers, business is simple at its core. Take care of the fundamentals at an actual volume that funds the rest...and some of that time and financial freedom, purpose and value gets funded and realized along the way. But don't confuse what's business and what's human choices beyond the conditional limits of business. Hopefully we'll do business better so we can all go do the things we know are better than business.\n\n",
          "score": 1,
          "created_utc": "2026-02-27 06:11:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}