{
  "metadata": {
    "last_updated": "2026-01-21 17:20:01",
    "time_filter": "week",
    "subreddit": "Entrepreneurship",
    "total_items": 19,
    "total_comments": 179,
    "file_size_bytes": 153136
  },
  "items": [
    {
      "id": "1qhihl2",
      "title": "I don’t know how to start making money",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qhihl2/i_dont_know_how_to_start_making_money/",
      "author": "Brilliant_Week_3058",
      "created_utc": "2026-01-19 22:11:28",
      "score": 30,
      "num_comments": 42,
      "upvote_ratio": 0.89,
      "text": "I have the ambition, I have the ideas, I have the potential, but I don’t have the money to fund these ideas. I don’t know how to start or where to start. I don’t even have any money to my name. I don’t know how to start the businesses that I want. What do I do? Any business makers that can provide advice?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qhihl2/i_dont_know_how_to_start_making_money/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0k33m9",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-19 22:11:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kffsf",
          "author": "Timely_Hat_9643",
          "text": "Start a business that is a service. Do a service for other businesses or people, like homeowners. Use the money you make from that use as capital for your other ideas. There is lots of money to be made in home service businesses. If you don't know how to do the work, then subcontract it out. It's called the drop service business method",
          "score": 14,
          "created_utc": "2026-01-19 23:14:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0lw72g",
              "author": "invoice_reviewer",
              "text": "Agree with the idea. I wanted to build a product, but didn't want to burn through my salary. So I took a few consulting/development service jobs. It is a great way to save some money to spend on your idea without the guilt. It also keeps your skills sharp.",
              "score": 3,
              "created_utc": "2026-01-20 04:03:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0mrp2v",
              "author": "TheOGGizmo",
              "text": "It’s called service arbitrage 😂",
              "score": 1,
              "created_utc": "2026-01-20 08:01:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0nltb1",
              "author": "DeviantHistorian",
              "text": "I've been doing a service business for 15 years. I took it very serious the last three. It was always a side hustle before then and I only took cash and checked for years. Then the last three I took credit cards and I have an e-commerce functional website. Now they can take payments online. I just had a one-pager for years so yeah it's a lot easier. If you have some sort of skill or something you could offer locally as a service to start making money that way then jumping through all these hoops online and doing all this marketing and trying to do an MVP and all this stuff",
              "score": 1,
              "created_utc": "2026-01-20 12:25:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0k6ycm",
          "author": "AromaPapaya",
          "text": "get a job\nget some experience \nsave money\nstart it on the side",
          "score": 5,
          "created_utc": "2026-01-19 22:30:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kifoc",
          "author": "dragonflyinvest",
          "text": "Start with a job. Too many entrepreneurs are trying to skip that fundamental step. Then they’re surprised when even if they make some money they have little idea how to run the company.",
          "score": 5,
          "created_utc": "2026-01-19 23:30:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nloi0",
              "author": "DeviantHistorian",
              "text": "Yeah I would say having a job knowing the market having some experience would be good. But if people are having trouble getting a job even I would say start some sort of service business and you know print some flyers, get some business cards, have something that you're confident about that you can do and make it happen",
              "score": 2,
              "created_utc": "2026-01-20 12:24:44",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0o71qb",
              "author": "Molling-Xiyao",
              "text": "What if i have a job. But i found out this job has nothing to do with my ideas to do the startup. And also quiet exhausted. What should i do next?",
              "score": 1,
              "created_utc": "2026-01-20 14:30:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0o9f52",
                  "author": "dragonflyinvest",
                  "text": "A few things. You should learn how to learn in any situation. I had jobs in restaurants that showed me how to motivate staff making minimum wage and do financial reports. I don’t run restaurants. \n\nAlso working a job allows you to save money to invest in your next venture and working helps develop your work ethic. And work ethic helps you progress to your goals faster.",
                  "score": 1,
                  "created_utc": "2026-01-20 14:42:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0kvko8",
          "author": "Character_Comb_3439",
          "text": "Work full time in a related or adjacent field.",
          "score": 3,
          "created_utc": "2026-01-20 00:40:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lcfbb",
          "author": "analyteprojects",
          "text": "You could build a simple single page website for one of your ideas and see if you could pre-sell it. Tools like Carrd can help you set up something to do this.",
          "score": 2,
          "created_utc": "2026-01-20 02:13:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mnh9x",
          "author": "nilkanth987",
          "text": "The hard truth is: you don’t start with ideas, you start with cash flow. Forget big businesses for now. Your first goal is learning how to trade time or skills for money. Once you can reliably earn even a little, everything else becomes possible.",
          "score": 2,
          "created_utc": "2026-01-20 07:23:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kk952",
          "author": "Capital-Way5517",
          "text": "Get a job to build some capital and look around you. There are plenty of service-based businesses that are easy to enter, and most people in them are mediocre. Start a service business, get it on Google, practice marketing, and deliver great customer service. Of course, you need to do research, but making money is the easy part. Getting into a business that makes life-changing money - that’s where it gets hard.",
          "score": 1,
          "created_utc": "2026-01-19 23:40:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kn9fp",
          "author": "sdbest",
          "text": "What business do you want? And, where are you?",
          "score": 1,
          "created_utc": "2026-01-19 23:56:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ks3rg",
          "author": "dOdrel",
          "text": "if you don’t have the money, work and get it. if you don’t know how, learn it by doing. there’s no easy shortcut or checklist, have to figure out yourself",
          "score": 1,
          "created_utc": "2026-01-20 00:22:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ksym8",
          "author": "Developer68",
          "text": "Also if it’s a big idea you will need seed investors, do you know how to sell a pitch?",
          "score": 1,
          "created_utc": "2026-01-20 00:27:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0livo1",
          "author": "SithLordJediMaster",
          "text": "Income buys Assets.  \n\nSo you need high income first.   \n\nSo a high income job",
          "score": 1,
          "created_utc": "2026-01-20 02:48:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n3qw0",
              "author": "Akraam_Gaffur",
              "text": "How to get one without a degree?",
              "score": 1,
              "created_utc": "2026-01-20 09:55:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ls7vn",
          "author": "asdf_8954",
          "text": "Work and keep experimenting and looking for problems where there is the greatest shift happening (ai agent, ai models, robots, space). It doesn't matter if you're managing or not. Be at the value center and scale the most valuable ",
          "score": 1,
          "created_utc": "2026-01-20 03:40:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mc48j",
          "author": "Moming_Next",
          "text": "In a nutshell, do something, anything, try to sell it to someone else. It can be a digital product, a service, or anything.\n\nIf you don't have an idea look at others, copy and sell. You will learn how to sell by failing, and try to learn to pivot when it doesn't work and adapt.",
          "score": 1,
          "created_utc": "2026-01-20 05:50:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0me2wi",
          "author": "skysummmer",
          "text": "I’d say first get a job if you can and then learn how money (capital) works through providing products/services. \n\nOnce you have some experience working you can start a side business and keep growing it. Once your business is generating some revenue and you can afford to take risk then leave the job if you want (after weighing all the risks, pros and cons) and focus full time on maintaining and expanding your business or pivoting to more profitable domains.",
          "score": 1,
          "created_utc": "2026-01-20 06:05:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mg8ct",
          "author": "BoxAggressive2535",
          "text": "Nowadays you don't need much money, there are out there many AI Tools that help you build an mvp fast and cheap",
          "score": 1,
          "created_utc": "2026-01-20 06:22:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mo19k",
          "author": "mthurtell",
          "text": "Its all about networking.\nMy business exploded when i made a few key friends.",
          "score": 1,
          "created_utc": "2026-01-20 07:28:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n2pz6",
          "author": "deep_singh3106",
          "text": "I think the other comments have pretty much said everything. Have some cashflow first. You can do that by freelancing, consulting or building small one-off solution in your area of expertise. Even a small amount is enough at first because at least it will give you some traction. Then you can test/invest in your ideas.   \nSo, start small - get paid - learn -scale.",
          "score": 1,
          "created_utc": "2026-01-20 09:45:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n4v0g",
          "author": "trainmindfully",
          "text": "this feeling is more common than people admit. most businesses do not start with money, they start with one skill or problem you can help with right now. the first move is not building a big idea, it is finding something small you can do for someone else and getting paid once. that first dollar changes your mindset fast. ambition without cash usually means you need proof before scale. focus on learning how to sell effort or clarity before trying to fund an idea.",
          "score": 1,
          "created_utc": "2026-01-20 10:05:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0olymd",
          "author": "Greedy_Tea5551",
          "text": "Look for a job and get employed, start saving  the money that you will be payed, then you will use it as a capital to start your business.",
          "score": 1,
          "created_utc": "2026-01-20 15:44:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ou2zg",
          "author": "Jo-callaway",
          "text": "1- Before you do anything make sure your idea can be easily commercialised. We are all full of good ideas but 99% of them aren’t worth executing.\n\n2- you need to start something that you can turn into cash asap. If your idea needs upfront cash, break it down to smaller services that aren’t cash incentives and then build up from there.\n\n3- some might not agree, but don’t do anything for free, even at the very beginning. Put the value on what you do and research how much people are actually ready to pay for it.\n\n4- Don’t worry about trading time for money and automating things in the beginning, just make sure you charge for it.\n\nI have a bunch of free tools that I personally use to run a side hustle that I grew to £9k/month. Happy to share them",
          "score": 1,
          "created_utc": "2026-01-20 16:22:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0s114a",
          "author": "Drumroll-PH",
          "text": "You don’t need money to start if you focus on skills + sweat equity first. Pick one skill that can earn you cash quickly like writing, web dev, design, social media, or basic AI automation. Offer it freelance or as a service. Use that income to fund the bigger ideas. The hardest part isn’t ideas, it’s getting that first dollar and momentum.",
          "score": 1,
          "created_utc": "2026-01-21 01:42:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ttbdo",
          "author": "Own_Lengthiness_6485",
          "text": "Acquire a skill, manage that skill, start a business with that skill. Takes about 3 solid,dedicated years to do so but will set you up for life if you pick the right skill.",
          "score": 1,
          "created_utc": "2026-01-21 09:36:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uekm5",
          "author": "Extension-Tutor-7800",
          "text": "The first step isn’t a big idea, it’s just getting some money coming in. Start small, use your time or any skill you have to earn something. Once you have even a little cash flow, it’s way easier to figure out the next move.",
          "score": 1,
          "created_utc": "2026-01-21 12:32:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kvg9k",
          "author": "WanderingJuggler",
          "text": "Ideas are cheap. Go out there, get a job, build some skills, and make some connections. That or be born rich. Those are your only real options.",
          "score": 1,
          "created_utc": "2026-01-20 00:40:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kjr26",
          "author": "sigstrikes",
          "text": "pick one (only one) and start",
          "score": 0,
          "created_utc": "2026-01-19 23:37:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0krxwc",
          "author": "Old-Question-6112",
          "text": "If the main issue is money to fund an idea, getting a job first and saving some capital can help a lot before jumping in. But if the bigger challenge is deciding *which* idea to start with, I’d focus on some market research to see what actually has demand, then pick one and execute.",
          "score": 0,
          "created_utc": "2026-01-20 00:21:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lmqru",
          "author": "hrishi_comet",
          "text": "There are few easy ways to start earning. \n1. Have a paying customer. The cheapest cash flow you get. Because the customer gives an advance for your services. It requires you to have some experience or relation with the customer so you are paid in advance. Some businesses start in that model \n2. Raise easy debt from banks. If you have a good credit score you can always raise funds from a bank to fund your project. \n3. Look for grants in various domains from government initiatives. \n4. The most expensive option is to have an investor may be friends or family or a professional Investor.  But that’s the cost of form of debt since you have to repay a lot \n\nWhen I started my company, I use the first two forms to get my bank balance. I don’t run a large organisation, but I’m good for the last 12 years. The companies remain bootstrap. I am a fan of this because it keeps your business fundamentals on the right track.  \n\nYou can do some freelancing work or pick a job and raise some funds or you can demonstrate your work to some customers and get a gig.",
          "score": 0,
          "created_utc": "2026-01-20 03:09:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p6x0q",
          "author": "VangelisBizGrowth",
          "text": "Maybe you see the wrong objective?!\n\nMaking money comes later..\n\nMaybe the goal is to create something..\n\nI am just saying..",
          "score": 0,
          "created_utc": "2026-01-20 17:21:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdpqtp",
      "title": "Any entrepreneurs who are under 25 ?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qdpqtp/any_entrepreneurs_who_are_under_25/",
      "author": "sushiwit420",
      "created_utc": "2026-01-15 17:25:30",
      "score": 15,
      "num_comments": 42,
      "upvote_ratio": 0.86,
      "text": "Is it just me or it’s every entrepreneurs who takes risk earlier felt lonely sometimes, because everybody have their dream jobs. But for you, you just have your dream business… ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qdpqtp/any_entrepreneurs_who_are_under_25/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "nzrgj00",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 17:25:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsyavf",
          "author": "Extension-Team1172",
          "text": "It all depends on the people you surround yourself with",
          "score": 4,
          "created_utc": "2026-01-15 21:29:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzta74y",
              "author": "sushiwit420",
              "text": "I have only three friends who are into entrepreneurship. Taking risks and everything. I am still in university and all the people in my classes seem to be so ready with job applications at big companies. Can you please give me advice on how do I meet my type of people? I thought choosing a business major will get me some connections… but most want to be employees, climbing the corporate ladder. That is definitely not my thing.",
              "score": 1,
              "created_utc": "2026-01-15 22:25:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzvak6v",
                  "author": "Adept-Fly-2446",
                  "text": "You can use meetup (if you didn't) or similar sites to meet business minded people (could be older than you), I met a lot of people last year, and had countless conversation with people I didn't even think of (helped some along the way).",
                  "score": 2,
                  "created_utc": "2026-01-16 05:15:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzrknv0",
          "author": "MyAmazingDiscoveries",
          "text": "I’m building a tuition-free college exclusively for young entrepreneurs. Search for Founderstowne on the ‘net.",
          "score": 3,
          "created_utc": "2026-01-15 17:44:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzrntj0",
              "author": "sushiwit420",
              "text": "Sounds nice. Could you drop a link please? There are lots of generic name when I google it",
              "score": 2,
              "created_utc": "2026-01-15 17:58:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o00sdr1",
          "author": "ThatCherry1513",
          "text": "It’s kind of like comparing apples and oranges it’s not a clear comparison. It’s like people who get a job rather than going to university or college. \n\nHowever, running a business on your own can be lonely pursuit. You have to find other business owners to support, clients and friends own business. Build or join a community.",
          "score": 3,
          "created_utc": "2026-01-17 00:17:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n2st4",
              "author": "sushiwit420",
              "text": "One of my loyal client is starting to become my business partner. We probably will hang out a lot. But I was expecting to meet “ entrepreneurs mindset “ in my college. Not really 🤣 but I am grateful that I still managed to have my own business",
              "score": 1,
              "created_utc": "2026-01-20 09:46:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzt6nyv",
          "author": "Makemoremusicbro",
          "text": "Just over (just turned 27) building a brand (online & offline)",
          "score": 2,
          "created_utc": "2026-01-15 22:08:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nztadhk",
              "author": "sushiwit420",
              "text": "That’s nice ! I am also building a marketing agency. Maybe we can collaborate if you are interested man. Where are you based tho?",
              "score": 1,
              "created_utc": "2026-01-15 22:26:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nztwu2x",
          "author": "BusinessStrategist",
          "text": "It doesn’t matter what age.\n\nYOU are a “misfit” society outcast… An “outlier.”\n\nThe herd is stampeding left and you’re exploring that side road behind the bushes.\n\nUntil you prove that your “dream” called a “Vision” makes business sense, you’re on your own.\n\nWelcome to the “entrepreneurial journey!”\n\n\nYou MUST capture IN WRITING your plan for translating your idea into a “profitable” “profitable” “profitable” business.\n\nThis “blueprint” will allow you to consult with experienced business managers to help you with the “operational” do’s and “don’t” of building a “PROFITABLE” business.\n\nThe rest is a continuous stream of “gaps to fill” and “obstacles to overcome.” \n\nYour “tenacity” and “grit” can handle that.\n\nAnd keep in mind that YOUR primary obligation is to work on making “babyStartup” a success.\n\nNot on working “IN” your business.",
          "score": 2,
          "created_utc": "2026-01-16 00:24:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nztzig3",
              "author": "sushiwit420",
              "text": "Thanks for this mate ! I have got 2 loyal clients now. Slowly building it. I am not working for someone anymore too. Used to be a dishwasher to now having my own blueprint, as you say it or my marketing agency.",
              "score": 2,
              "created_utc": "2026-01-16 00:39:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzz1c48",
                  "author": "BusinessStrategist",
                  "text": "You might also want to invest some time in picking up some fluency in the language of business.\n\nLots of easy reading books to give you an understanding of the \"business decider\" mindset.\n\nAnd do some basic market research. Google your competitors. They have identified many of the \"keywords/expressions/touchpoints/etc. that motivate prospective clients to call.\n\nAnd do google \"buyer journey map.\" It will give you the big picture of how to land those big fish!",
                  "score": 2,
                  "created_utc": "2026-01-16 19:05:37",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzz224h",
                  "author": "BusinessStrategist",
                  "text": "Forgot to mention the \"... for Dummies\" series of books.\n\nThey give you a solid framework for identifying and prioritizing what it is exactly that would be most useful for you to learn.\n\nYou have two clients. What are THEIR profiles and how many more are their in your service area?",
                  "score": 1,
                  "created_utc": "2026-01-16 19:08:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o045qn4",
          "author": "Major_Ad_779",
          "text": "Here! 21 years old in the health care industry \n\n2 kids \n\nDecided I’m dedicating 10 years of my life to this. Every problem is solvable. And I will solve it",
          "score": 2,
          "created_utc": "2026-01-17 15:06:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n2uz8",
              "author": "sushiwit420",
              "text": "Wishing all the best !!",
              "score": 2,
              "created_utc": "2026-01-20 09:46:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0p72gv",
                  "author": "Major_Ad_779",
                  "text": "You as well!",
                  "score": 1,
                  "created_utc": "2026-01-20 17:22:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzsykgv",
          "author": "Vens_here",
          "text": "what’s even a dream job lol",
          "score": 1,
          "created_utc": "2026-01-15 21:31:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzt9kb4",
              "author": "sushiwit420",
              "text": "Right ?? I really can’t relate to those people",
              "score": 1,
              "created_utc": "2026-01-15 22:22:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzx0ciy",
                  "author": "Vens_here",
                  "text": "same , i dont understand them",
                  "score": 2,
                  "created_utc": "2026-01-16 13:29:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nztndtv",
          "author": "Afraid-Mess1894",
          "text": "ambition gets lonely!!!! check this out https://www.moregenz.com",
          "score": 1,
          "created_utc": "2026-01-15 23:33:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztse1p",
          "author": "Mac-Fly-2925",
          "text": "You will see more entrepreneurs when entrepreneurship becomes something that everyone learns and tries at high-school.",
          "score": 1,
          "created_utc": "2026-01-16 00:00:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzu0aav",
              "author": "sushiwit420",
              "text": "Honestly, during my high school times. We have this fun fair every year. And have to organize ourself what we will sell. The whole class wanted to sell only snacks. But for me, I said let’s sell a airsoft shooting game with just cheap guns. Only my best friend till now supported my idea. I persuaded the class teacher well and he agreed to it. Got 200 dollars profit out of it… and everybody was surprised.",
              "score": 2,
              "created_utc": "2026-01-16 00:43:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzzms6a",
                  "author": "Mac-Fly-2925",
                  "text": "You got a co-founder and persuaded an early investor ! Keep the momentum !",
                  "score": 2,
                  "created_utc": "2026-01-16 20:45:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzv9ksv",
          "author": "Witty-Ad-2125",
          "text": "I am on a journey to be one, just graduated of college last year and now felling left out by seeing people around me getting good packages(although they are very few), but to make myself feel positive I look into myself 10 years or 5 years later how will it be and then get back to work.",
          "score": 1,
          "created_utc": "2026-01-16 05:08:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00mych",
              "author": "Upstairs_Mushroom949",
              "text": "Wdym by good packages?",
              "score": 1,
              "created_utc": "2026-01-16 23:46:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o01geq3",
                  "author": "Witty-Ad-2125",
                  "text": "15 to 45 LPA",
                  "score": 1,
                  "created_utc": "2026-01-17 02:46:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o048688",
          "author": "DeviantHistorian",
          "text": "I've had side hustles and things like that since I was a teenager so I could say yes. I was an entrepreneur before 25 and around that age but I held a day job until my mid-thirties. \n\nI also bought a duplex when I was 27 years old. Live in one unit and rent the other one out so that was another entrepreneurial thing but fully convincing to you being an entrepreneur that wasn't until later",
          "score": 1,
          "created_utc": "2026-01-17 15:19:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0c2z2c",
          "author": "RoleHot6498",
          "text": "it's just you. Very few have their \"dream job.\" Most just work. Be different. Be vocal. Transform the world and ask questions later",
          "score": 1,
          "created_utc": "2026-01-18 18:41:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n2zsm",
              "author": "sushiwit420",
              "text": "No. Most really have dream jobs. I am not judging. And I will ask any questions I want. Because I am different, I have built loyal clients as well.",
              "score": 1,
              "created_utc": "2026-01-20 09:48:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0njfkj",
                  "author": "RoleHot6498",
                  "text": "Sorry to hurt your  feelings",
                  "score": 1,
                  "created_utc": "2026-01-20 12:08:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0dxkyr",
          "author": "Dejan_27",
          "text": "Started alone at 23. Now 28 job less",
          "score": 1,
          "created_utc": "2026-01-19 00:14:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0e57uq",
          "author": "Familiar-Jeweler6510",
          "text": "I am 21 and I am a programmerer doing indie businesses and startups \n\ndefinetely gets lonely sometimes because our gratification is delayed and most of the time we will see our surrounding people will just get jobs,  make money and it seems like they have it figured out since their path seems structured \n\nbut entrepreneurship is definetely a long game and you have to bare the uncertainity and constant uncertain decision making it requires on a day to day basis \n\nmost of the time people winning in this game by doing it long enough and baring the constant cricket noise for long enough until something hits",
          "score": 1,
          "created_utc": "2026-01-19 00:54:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gvesj",
          "author": "Enough-Reference3118",
          "text": "Me too",
          "score": 1,
          "created_utc": "2026-01-19 12:55:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qf6ncm",
      "title": "What I learned after being laid off 5 years ago",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qf6ncm/what_i_learned_after_being_laid_off_5_years_ago/",
      "author": "VictoryKlutzy5227",
      "created_utc": "2026-01-17 07:12:17",
      "score": 14,
      "num_comments": 7,
      "upvote_ratio": 0.94,
      "text": "Five years ago, I was laid off from a job I had dedicated years to. It was one of the hardest moments in my career., frustrating, confusing, and scary.\n\nLooking back, that layoff became a turning point. I decided to explore starting my own BPO. It wasn’t easy, I had to learn team management, systems, compliance, and how to run operations from scratch. Every step taught me more about resilience and trusting my own capabilities.\n\nToday, I see that moment not as a setback, but as the start of an entirely new journey. Being laid off pushed me to explore paths I never would have considered, and gave me confidence I didn’t know I had.\n\nSometimes, a career setback isn’t the end. It’s the start of the path you were meant to take.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qf6ncm/what_i_learned_after_being_laid_off_5_years_ago/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o02gj0y",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-17 07:12:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08tyfo",
          "author": "DowntownCanada416",
          "text": "Bpo?",
          "score": 1,
          "created_utc": "2026-01-18 05:41:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o09mpk3",
              "author": "QuestionedGirl",
              "text": "Business processing outsource as far as I know",
              "score": 1,
              "created_utc": "2026-01-18 09:56:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0a3yjo",
              "author": "VictoryKlutzy5227",
              "text": "Business Process Outsource/ Call Center.!",
              "score": 1,
              "created_utc": "2026-01-18 12:28:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0atrtu",
          "author": "CommunicationUsed33",
          "text": "Well done",
          "score": 1,
          "created_utc": "2026-01-18 15:07:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ubeks",
          "author": "Eng_Sci_Entra_8",
          "text": "Inspiring! Thanks!",
          "score": 1,
          "created_utc": "2026-01-21 12:10:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdgmeh",
      "title": "As an early stage founder, when did you start the serious marketing: before MVP, in parallel or after launch?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qdgmeh/as_an_early_stage_founder_when_did_you_start_the/",
      "author": "vijayeesam",
      "created_utc": "2026-01-15 11:01:42",
      "score": 11,
      "num_comments": 15,
      "upvote_ratio": 1.0,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qdgmeh/as_an_early_stage_founder_when_did_you_start_the/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "nzpil6e",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 11:01:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrfcb2",
          "author": "SixthGearPartners",
          "text": "If by “serious” you mean investing real dollars, NEVER before development, RARELY at MVP, and only after you have very high confidence in your ICP, your product/service’s ability to solve their pain point, and your business model.  Spend money before that and you are wasting it.\n\n  \nOf course, build social presence, generate any earned media you can, and build some awareness - those things are free or very low cost.  The caveat to these are if you are in a very highly competitive market and doing so enables competitors to plan how to squash you.",
          "score": 5,
          "created_utc": "2026-01-15 17:20:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqzqpq",
          "author": "Perfect-Complaint136",
          "text": "I'd suggest before development. You need to put the word out. Build in Public",
          "score": 2,
          "created_utc": "2026-01-15 16:10:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrb13e",
          "author": "Radiant-Design-1002",
          "text": "I started building my social media accounts well in advance because I knew that it was gonna take a long time to warm up the account and build an audience.\n\nSo the best time to start marketing would be before you’ve even built the product. The second best time is to start now. \n\nGreat things take time and your first little bit of marketing is going to be bad which is fine as long as you can learn from those mistakes and continue to get better with each and every post.\n\nBy the time you go for lunch on your actual product after your MVPs and all the beta testing, you should have a decent audience that’s engaged with your content and has a higher chance of converting.",
          "score": 2,
          "created_utc": "2026-01-15 17:00:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvj5id",
              "author": "vijayeesam",
              "text": "I agree with this. The earlier you start, the more reps you get before launch.",
              "score": 1,
              "created_utc": "2026-01-16 06:19:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzsbc1b",
          "author": "GoodAndBadPuns",
          "text": "Sell before you build. Best rule for startups I've heard. Applies to basically every type of company (B2B, D2C, etc.).",
          "score": 2,
          "created_utc": "2026-01-15 19:43:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzv5t9l",
          "author": "WizCommerceOfficial",
          "text": "Before development, honestly. Talking to users early shapes what you build and saves you from launching something no one actually wants.",
          "score": 2,
          "created_utc": "2026-01-16 04:43:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqbucy",
          "author": "team_AF",
          "text": "I launched two products. one recently and one last year. my strategy was different for both of them due to their nature and target market. however I'd say you can start a bit discussing about the problem that exists before you launch to aware ppl and then aggressive marketing post launch",
          "score": 1,
          "created_utc": "2026-01-15 14:15:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvjkgt",
              "author": "vijayeesam",
              "text": "thank you",
              "score": 1,
              "created_utc": "2026-01-16 06:22:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o03et24",
          "author": "ramen-AI-SDR",
          "text": "Sales first before you spend on marketing.",
          "score": 1,
          "created_utc": "2026-01-17 12:25:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04c1ic",
          "author": "Tight-Preference-823",
          "text": "I think it's essential to start marketing in parallel with MVP development. This way, you can validate your product and marketing strategy simultaneously, making adjustments as needed. What are your thoughts on this approach?",
          "score": 1,
          "created_utc": "2026-01-17 15:37:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0b4rsk",
          "author": "asupertram",
          "text": "Launch first - then iterate the MVP with some early feedback. Marketing really is needed after you get some feedback from users that would genuinely love your product to be better as it’s solving already some of their problems",
          "score": 1,
          "created_utc": "2026-01-18 16:01:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bx6v9",
          "author": "RoleHot6498",
          "text": "That's the same question every failed startup keeps asking. The better question is when to start marketing to investors, raise capital and take off. Stop building startups for the end user only and start building to be investable. Develop  your ICP for investors and skies the limit",
          "score": 1,
          "created_utc": "2026-01-18 18:15:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdncnm",
      "title": "How do entrepreneurs focus and build one thing at a time?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qdncnm/how_do_entrepreneurs_focus_and_build_one_thing_at/",
      "author": "Salmanmalik1988",
      "created_utc": "2026-01-15 15:59:21",
      "score": 11,
      "num_comments": 33,
      "upvote_ratio": 1.0,
      "text": "I have been struggling because of too many ideas and I am thinking of something where I can focus need some advice I have ideas which I think can be game changers for future but struggling with what to do and what not to? Need advice on building focus.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qdncnm/how_do_entrepreneurs_focus_and_build_one_thing_at/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "nzqxcn2",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 15:59:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzy6djv",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-01-16 16:48:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzylwzh",
              "author": "Salmanmalik1988",
              "text": "Well then how to manage the idea stream daily?",
              "score": 1,
              "created_utc": "2026-01-16 17:57:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzy7xjk",
          "author": "Greedy_Tea5551",
          "text": "The real entrepreneur focus only on one thing, until it become real.",
          "score": 1,
          "created_utc": "2026-01-16 16:55:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzylysr",
              "author": "Salmanmalik1988",
              "text": "How do they do it and who is a real one?",
              "score": 1,
              "created_utc": "2026-01-16 17:57:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzysm8p",
          "author": "rocketboss",
          "text": "Which idea are you comfortable working on for 5-10 years. And which one is still relevant in 5-20 years. Do that one",
          "score": 1,
          "created_utc": "2026-01-16 18:27:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00rwvf",
              "author": "Salmanmalik1988",
              "text": "Ideas are changing like crazy these days",
              "score": 1,
              "created_utc": "2026-01-17 00:14:43",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nzzdcfy",
              "author": "Sufficient-Lab349",
              "text": "Hi there, nice work btw, would you like to roast my app?",
              "score": -1,
              "created_utc": "2026-01-16 20:00:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzz6xd4",
          "author": "kuvvaci-tux",
          "text": "I don't, when I get bored with one project, I pass to other one for a while 😂😂",
          "score": 1,
          "created_utc": "2026-01-16 19:31:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzzdctg",
              "author": "Sufficient-Lab349",
              "text": "Hi there, nice work btw, would you like to roast my app?",
              "score": -2,
              "created_utc": "2026-01-16 20:00:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzzdu0k",
          "author": "giz92",
          "text": "Get multiple teams and let them help you build each idea. If you're good at coordinating teams and basic project management you should be good to go.",
          "score": 1,
          "created_utc": "2026-01-16 20:03:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0jt5eu",
              "author": "rioisk",
              "text": "Sounds great except need money to do that.",
              "score": 1,
              "created_utc": "2026-01-19 21:22:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzzlmn5",
          "author": "BusinessStrategist",
          "text": "You take a trip on your work-time machine.\n\nClose and remove all distracting sources of noise not related to the task at hand.\n\nPlan your work for the allotted time and make sure to have a reward at the other end of the tunnel.\n\nEnjoy the treat AND repeat.",
          "score": 1,
          "created_utc": "2026-01-16 20:39:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzyggg",
          "author": "sendsouth",
          "text": "My mantra: I can do anything but I can't do everything. Focus on one thing at a time",
          "score": 1,
          "created_utc": "2026-01-16 21:40:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00rzdq",
              "author": "Salmanmalik1988",
              "text": "Yes what if it fails and you have many dependents",
              "score": 1,
              "created_utc": "2026-01-17 00:15:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o00agmi",
          "author": "Spirited_Radio9804",
          "text": "They multi task and prioritize!",
          "score": 1,
          "created_utc": "2026-01-16 22:38:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00ruhh",
              "author": "Salmanmalik1988",
              "text": "Confused between focus and multi tasking",
              "score": 1,
              "created_utc": "2026-01-17 00:14:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o01w24z",
                  "author": "Spirited_Radio9804",
                  "text": "You’re going to have to be focused on many things at the time and make the best decision you can then move to the never ending things to do with priority in mind!",
                  "score": 1,
                  "created_utc": "2026-01-17 04:29:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o014mj5",
          "author": "Chicken_Brai",
          "text": "dont! Did you take just one class in school at a time? \n\nI ran an incubator and I think its false ideology. \n\nId focus on complementary businesses that tie together somehow. \n\nLike I build Ai's and also have a product company. \n\nThen I will mix them by bringing the ai together with the product company. \n\nCheck out how these 2 would collaborate. \n\n[Koala Meditation Miat](http://exhalethat.com)\n\n[Ai Toys](http://kingdomofni.com)",
          "score": 1,
          "created_utc": "2026-01-17 01:31:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01owb1",
          "author": "Rich-Editor-8165",
          "text": "i think this iis super common, especially if you are wired to spot opportunities. What helped me was picking one idea and forcing myself to define a very small first win, not the big vision. If I could not get that first milestone done in a few weeks, it was probably just an interesting idea and not the right focus right now. I also keep a running list of ideas so they feel parked, not lost, which makes it easier to commit. Momentum from finishing something small usually quiets the noise better than trying to think your way into focus.",
          "score": 1,
          "created_utc": "2026-01-17 03:40:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o028khi",
          "author": "Other-Image-2074",
          "text": "There are many entrepreneurs who work on multiple projects at a time. It all depends on your focus and discipline. Having said that its not everyone's cup of tea. Most people would do well to stick to one idea at a time.",
          "score": 1,
          "created_utc": "2026-01-17 06:03:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02c2xa",
          "author": "Scale_Mechanic",
          "text": "Idea paralysis is a real thing.  Write 50 of your favorite ideas down.  Then cut that in half. Then cut it down to 12, then 6 then 3.  Now, take the top 3 ideas and describe your ideal customer.  From those 3 customer profiles, who resonates with you the most? Choose that idea. The loop I think you might be in is common for creative minds.  You start working on an idea and your mind pivots.  Look at your top choice when this happens and keep moving forward.  You got this!",
          "score": 1,
          "created_utc": "2026-01-17 06:33:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02qcms",
          "author": "WamBamTimTam",
          "text": "Most entrepreneurs are brick and mortar and small physical based businesses. Considering anything fully online is relatively recently for human history in any large amount. So in that sense, it’s only ever one idea. Constantly juggling ideas doesn’t give any one idea enough time to fully form",
          "score": 1,
          "created_utc": "2026-01-17 08:42:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02qtlz",
          "author": "alex_building",
          "text": "I struggle with this too. What helped: pick ONE for 90 days. Not forever, just 90 days.\n\nWrite it down. When new ideas come, add them to a list but don't act.\n\nThe hard part isn't the work, it's saying no to new ideas. You need a forcing function that makes the decision for you when you want to jump.",
          "score": 1,
          "created_utc": "2026-01-17 08:47:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05i4u1",
          "author": "analyteprojects",
          "text": "Rather than ideas, focus on problems first. The most valuable ideas are needed solutions to problems that impact an audience. The idea to choose to focus on is the one with a problem that needs solving, that you can be passionate about, and where you have access to connect with the audience that has the problem. There are other aspects to success of course, but I'd start with that.",
          "score": 1,
          "created_utc": "2026-01-17 18:54:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o063oct",
          "author": "finding_ans",
          "text": "There's no point of reference as you navigate this path. I'd advise that you start by understanding your brain. It could be that you need one or select ideas to pursue, but then, there's also hybridity profession. If the ideas could marry, giving you an added advantage,  go for it.  If you simply need to sort through what to pursue as career, hobby, some may simply be a 3 month project you do annually.  Forge your path.",
          "score": 1,
          "created_utc": "2026-01-17 20:40:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06sl0b",
          "author": "ooizhiyi",
          "text": "I used to face the same issue, and I am still facing the same issue. I just keep reminding myself of the need to focus on one major thing.",
          "score": 1,
          "created_utc": "2026-01-17 22:45:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0eiac1",
          "author": "limitlesssolution",
          "text": "Day by day. Rituals, dedication, habits. Write out a timeline for dedicated focus on a certain task or idea.",
          "score": 1,
          "created_utc": "2026-01-19 02:07:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0foqrd",
          "author": "Drumroll-PH",
          "text": "Pick one idea, set a short deadline, and finish it. I wasted years juggling ideas until I forced myself to complete small things daily. Focus grows after action, not before.",
          "score": 1,
          "created_utc": "2026-01-19 06:43:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gybvs",
          "author": "cragwallaccess",
          "text": "This might help. Get clear first on WHAT business success always requires: get orders, fill them profitably, collect the money, above your true break-even point, without running out of cash. 10 Second MBA. Business is rarely easy. It's rarely successful. But it's incredibly simple at its core. \n\nNow, when you're trying to focus on building something, grapple with who you'll be selling it to, for how much, how often, and how many others you'll need to sell it to for this business to reach true break-even (pay you back for every minute and dollar you'll invest while building and your salary expectation from day one that you'll also be loaning your business).\n\nIf what you're building can't convince you it'll achieve profitable sales at volume to cover your true break-even point, it's not worth focusing on. If it can convince you then maybe you'll solve for your focus in the process. \n\n10 Second MBA. Don't complicate business.",
          "score": 1,
          "created_utc": "2026-01-19 13:14:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzz822a",
          "author": "Sufficient-Lab349",
          "text": "Hi there, I saw your work, would you roast my app?",
          "score": -2,
          "created_utc": "2026-01-16 19:36:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgfgin",
      "title": "Impostor Syndrome",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qgfgin/impostor_syndrome/",
      "author": "West-Put-8515",
      "created_utc": "2026-01-18 18:00:17",
      "score": 10,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "How do I overcome that first step of “daring” to be an entrepreneur? Every time I get an idea or motivation I hit a wall thinking I lack the skills or industry knowledge.\n\nI have 8 years of experience in Data Analytics and have some coding experience, but I always find myself thinking not enough technical or business skills to be an entrepreneur.\n\nAnyone has gone through this successfully? Any tips?\n\nThanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qgfgin/impostor_syndrome/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0bttl6",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-18 18:00:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0c5n6f",
          "author": "iNavin",
          "text": "I have grown up around businessmen/entrepreneurs and have been myself for many years. Trust me, the imposter feeling is real and most to through it at some point or another. Ignore the fear. Take the first step. Everything else follows. However, you should first reassess your motivations to be an entrepreneur. It's a lonely journey and scary and rewarding in its own unique way. Don't jump into it because it's glamorous. Do it because it helps you to find your own voice. I haven't met a single founder/entrepreneur who has ever not have this feeling of lack. Yet they find success in their own way. Some sooner and some later.",
          "score": 6,
          "created_utc": "2026-01-18 18:54:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ct0jl",
          "author": "Substantial_Tap_3641",
          "text": "I believe that in entrepreneurship, you will always lack the skills and knowledge in certain areas, but a part of that is hiring the experts to fill in those fields in which you lack at. Remember, an entrepreneur is a leader who shares their ideas, not everyone can solo all of their tasks alone. Just take small bites, and see whether the market digests it; once you’ve hit that evolutionary step, start finding a team to build up your idea.\n\nYou’re not alone in this journey, so take it.",
          "score": 4,
          "created_utc": "2026-01-18 20:46:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0cj1eu",
          "author": "GaryARefuge",
          "text": "Psychologist. ",
          "score": 2,
          "created_utc": "2026-01-18 19:58:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ee7yb",
          "author": "Swarupkb13",
          "text": "This resonates with me.\n\nI am a designer turned entrepreneur and that too accidentally at my young age of 19 yrs. \n\nFor the last 24 years I have been in business. Even today I feel the same way you have mentioned. I doubt my core skills + about my entrepreneur abilities.\n\nSometimes I feel a lot of pressure and insecurity. At the same time I am used to it.\n\nFind your single need rather than motivation which will help you to start working on your idea. Stop thinking and start acting. The flow will take ahead and give you clarity.\n\nBest wishes!! 🌞",
          "score": 2,
          "created_utc": "2026-01-19 01:45:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hzrlt",
          "author": "aicreds",
          "text": "Most people think Impostor Syndrome is a sign you aren't ready. Actually, it's usually a sign you are about to do something that matters.\n\nStop trying to build a business. Start by trying to solve *one* person's problem.\n\nYou’re hitting a wall because you’re looking at entrepreneurship as this giant, identity-shifting mountain that requires a perfect skill stack. That is the invisible rule that keeps smart people on the sidelines.\n\nThe truth? You don't need to be an expert in business to be an expert in a *problem*.\n\nYou have 8 years of data analytics experience. That means you likely see inefficiencies that 99% of the world is blind to.\n\n1. Don't code yet.\n2. Find one person who has the problem you see.\n3. Fix it for them manually.\n\nIf you can do that, you aren't an impostor, you're a solver. The business part is just the wrapper you put around the solution later.",
          "score": 2,
          "created_utc": "2026-01-19 16:24:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0c9gss",
          "author": "Moist_One_1337",
          "text": "Build an mvp on the side",
          "score": 1,
          "created_utc": "2026-01-18 19:11:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ciw2f",
          "author": "Vymir_IT",
          "text": "What helped me perhaps is watching and talking to more entrepreneurs, finding out that most of them are as moronic as majority of people and it's really just about percevierance and learnable skills.\n\nSo you don't have to be any special kind of person to be an entrepreneur. From all I've ever seen any idiot can be an entrepreneur. Cynical it may sound, it does deal with the imposter syndrome very well - no matter how bad you are there is always some businessman who's even worse and hey, that fella's doing fine, so why you're shaking?",
          "score": 1,
          "created_utc": "2026-01-18 19:57:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dvu6g",
          "author": "AnonJian",
          "text": "High achievement individuals look at their established business, their mansion, cars, money ...they feel it is just one step from going away. That's the syndrome. Everybody else playing fake it 'til they make it is a plain vanilla impostor.\n\nYou crap something out market-blind and you are are no perfectionist. You are supposed to have concerns about doing something monumentally stupid. That's called reasoning ability.\n\nAll this wantrepreneur propaganda is to make oneself feel better at doing everything badly. Glass half-full: you shouldn't feel good. If you wanted to feel good you would have conducted proper due diligence and followed the advice in business books *to the letter*. \n\nBusinesspeople engage in risk reduction and test. Wantrepreneurs amp themselves up and what they test is whether they are one of the favored of god.",
          "score": 1,
          "created_utc": "2026-01-19 00:04:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h0a29",
          "author": "Extension-Tutor-7800",
          "text": "Most of capable ones feel this. You don’t need to be ready to start, you learn by doing, not before. With 8 years in data, you already have more than enough to take a small first step.",
          "score": 1,
          "created_utc": "2026-01-19 13:26:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hke8y",
          "author": "funnelforge",
          "text": "Whether you think you can, or think you cant, you're right. Gotta fake it till you make it. Be a bit delusional about how successful you will be",
          "score": 1,
          "created_utc": "2026-01-19 15:14:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jvwub",
          "author": "Friendly_Homework346",
          "text": "Lie to yourself. Or create a alternate personality that takes risks, and channel them when its time to try it out.",
          "score": 1,
          "created_utc": "2026-01-19 21:36:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uni75",
          "author": "Dazzling-Ad3020",
          "text": "The thing about is you can do it on the side if you have a job or other obligations. You can always scale up. My entrepreneurship takes on my hats an consists of unlimited services. If I can't do a job. I hire freelancers to do it. The most important thing is pricing to insure profit. If there is little to no profit, I turn down the deal.",
          "score": 1,
          "created_utc": "2026-01-21 13:28:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhrn34",
      "title": "Why Can’t I Just Do It?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qhrn34/why_cant_i_just_do_it/",
      "author": "Katotonic01",
      "created_utc": "2026-01-20 04:47:21",
      "score": 10,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "I have grown a small business that has proven itself to be successful over the last 8 years. It has grown to supplement my income and ultimately would allow me more time with my young kids, hobbies, other creative outlets, etc. Additionally, I work a 9-5 in the engineering/construction field and although this career doesn’t set my soul on fire, it provides me a solid, consistent income. I have walked to the edge of the entrepreneur “just do it” cliff and have found myself standing here for well over a year. My soul, my gut, my heart they are all screaming at me to “jump”, to go for it, to invest 100% in my business endeavors and see where they take me. But I can’t seem to do it. Fellow entrepreneurs and business owners, what are some solid tips to make the leap that has consumed your mind for far too long? Any advice is appreciated! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qhrn34/why_cant_i_just_do_it/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0m3a0r",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 04:47:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m4jus",
          "author": "Dry-Grocery9311",
          "text": "Make a 5 year detailed business and financial plan. If it looks good and you believe the numbers you have written, you will have your answer.\n\nBefore quitting your job, go to the bank and ask them what financing they would offer based on your plan. Their reaction might help inform your decision.",
          "score": 3,
          "created_utc": "2026-01-20 04:55:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0m6avf",
              "author": "Katotonic01",
              "text": "Thank you! I appreciate your insight!",
              "score": 2,
              "created_utc": "2026-01-20 05:07:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0m7y8d",
          "author": "Innurendo_",
          "text": "Validate a business idea first. Both with customers and yourself. Do it part time. See if it fulfills that urge. Then jump off the ledge, but in a,steadily grow your business while working with stability and security until one day it surpasses your income and you can pivot to full time entrepreneurship, kind of way",
          "score": 2,
          "created_utc": "2026-01-20 05:19:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mvgw2",
          "author": "Lopsided-Bag-5167",
          "text": "Hi! Entrepreneur here and can relate to you..Fear is very normal and your fear is very rational..I’ve experienced this..A lot of us have…A lot of people are still in your position…Maintaining two jobs till one become successful..And it’s very hard..Takes a toll on your body.. BUT everyone has different timing..Maybe you’re not fully ready to quit..And while you can discipline yourself, you can’t force it :) We’re all part of nature..\n\nI did personal budgeting & then cut down my spending a lot ! Good thing is that your biz is making money…See whether you can sustain your life w/ your biz income..See if you can work part-time rather than full time….But if you quit full time job that may limit your borrowing power (biz or personal loan)..\n\nSo I say do your ground work & when you’re ready, you’ll jump :) It’s okay..This is hard & a lot of us are hard on ourselves :) Think about it, a lot of ppl are actually afraid to even start..And you’re way ahead of them! But try to do budgeting & cut down your expenses..Also see how much financing you’ll need and how you can secure them w/o a job or get it while you have one…All these prep will be helpful and will help you tackle fear…Good luck! :)))",
          "score": 2,
          "created_utc": "2026-01-20 08:36:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mzk2x",
          "author": "nilkanth987",
          "text": "You’re not stuck because you lack bravery, you’re stuck because you’re being rational. The fact that you’ve grown a business while working full-time already proves you can execute. Sometimes the final step isn’t about motivation, it’s about reducing unknowns.",
          "score": 2,
          "created_utc": "2026-01-20 09:15:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n60ty",
          "author": "AnonJian",
          "text": "I suppose -- as this provides only supplementary income -- we should go over the business books you have read. Next, marketing strategy starting with the value proposition. Then your online footprint of social, site, sales funnel. \n\nIf there are no books, no approach, no strategy, then you have already tried Just Do It and reached the limits of that three word advice.",
          "score": 2,
          "created_utc": "2026-01-20 10:16:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n7feg",
          "author": "Rich-Editor-8165",
          "text": "i think this hesitation usually is not about courage, it is about risk clarity. like you  are not failing to jump, you are trying to protect stability for your family, which is rational. Many people make the leap easier by defining a clear exit rule, like a savings runway or revenue threshold that removes the all or nothing pressure. If the business already works, the question becomes timing and downside control, not belief. Sometimes the real move is designing a safer bridge instead of forcing a leap.",
          "score": 2,
          "created_utc": "2026-01-20 10:29:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qikqhi",
      "title": "What would you build or learn at 17 to make serious money later?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qikqhi/what_would_you_build_or_learn_at_17_to_make/",
      "author": "Designer_Okra_557",
      "created_utc": "2026-01-21 01:54:11",
      "score": 7,
      "num_comments": 24,
      "upvote_ratio": 0.77,
      "text": "I’m 17 and thinking long-term about wealth.\n\nIf you were starting over at my age with little capital, what skills, businesses, or paths would you focus on first?\n\nLooking for honest advice",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qikqhi/what_would_you_build_or_learn_at_17_to_make/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0s33f5",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 01:54:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tji3o",
          "author": "lovescro",
          "text": "Sales and marketing. Master these and everything else is much easier.",
          "score": 5,
          "created_utc": "2026-01-21 08:01:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t1mg4",
          "author": "Sea-Environment-5938",
          "text": "At 17 the goal isn’t “get rich fast,” it’s build rare skills + proof you can ship. If you can learn to create value for someone else and communicate it clearly, money shows up later. What do you enjoy more: building stuff, selling stuff, or managing people?",
          "score": 3,
          "created_utc": "2026-01-21 05:29:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0vwbi4",
              "author": "Ill_Reality180",
              "text": "agree!",
              "score": 1,
              "created_utc": "2026-01-21 17:04:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tshgw",
          "author": "the-techpreneur",
          "text": "I would think of skills I wish I had in 10 years. Don't think about wealth. Think about who would a person who makes that wealth be? What skills and traits would he have? How would be spend his day? Then try to become that person",
          "score": 3,
          "created_utc": "2026-01-21 09:27:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t7sxi",
          "author": "Drumroll-PH",
          "text": "I’d focus on learning one skill that sells directly, like sales, coding, or paid ads, and get real reps as fast as possible. The biggest advantage at that age isn’t money, it’s time to suck early and compound later.",
          "score": 2,
          "created_utc": "2026-01-21 06:18:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0vwd88",
              "author": "Ill_Reality180",
              "text": "true",
              "score": 1,
              "created_utc": "2026-01-21 17:04:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0td1dx",
          "author": "Big_Tie_1153",
          "text": "Get into info sales or any type use that money to run a business. U can always sell yourself out of a bad situation",
          "score": 2,
          "created_utc": "2026-01-21 07:03:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u0frw",
          "author": "Upbeat-Employer-3194",
          "text": "Hello, I'm currently working on a platform designed to help people build a business using AI agents (business plans, logos/branding, pitch decks, landing pages, grant submissions etc.) You just need to prompt one idea and the agents will build a full business plan and project plan. Would you be interested in testing the full platform and sharing feedback with me?",
          "score": 2,
          "created_utc": "2026-01-21 10:42:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uiyls",
          "author": "Capital-Way5517",
          "text": "You could focus on building your personal brand first. People follow people they connect with, and when they like you, they’re more likely to support and buy from you. That’s where I’d start.",
          "score": 2,
          "created_utc": "2026-01-21 13:01:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0vwfs9",
              "author": "Ill_Reality180",
              "text": "Indeed!",
              "score": 1,
              "created_utc": "2026-01-21 17:05:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0uo03y",
          "author": "alex_building",
          "text": "At 17: Build one skill deeply. Not 10 skills poorly.\n\nPick something where you can get paying customers within 6-12 months. Prove you can deliver value.\n\nThe biggest advantage you have at 17: Time to fail and learn.\n\nMost people at 17 chase \"get rich quick.\" You're already thinking long-term. That's rare.\n\nMy advice: Pick one thing. Get good at it. Get paid for it. Build proof.\n\nThen at 20-25, you'll have:\n- A real skill\n- Paying customers\n- Credibility\n- Options\n\nDon't spread thin across 5 ideas. Go deep on one.\n\nExecution​​​​​​​​​​​​​​​​ :)",
          "score": 1,
          "created_utc": "2026-01-21 13:31:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0upnh6",
          "author": "AdministrationOk3987",
          "text": "Learn as many skills as possible to monetize it later.",
          "score": 1,
          "created_utc": "2026-01-21 13:40:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uv3t6",
          "author": "NullTerminator99",
          "text": "If all you want from life is wealth you are setting yourself up for disappointment. Even the best laid plans can come to ruins and wealth is not guaranteed. I am not saying a good career and financial stability aren't important because they are. But what i am saying is you should consider asking some deeper questions about life.   \n  \nStatistically i am sorry to say but serious $$ don't always go to the hard working or the smart.  Luck and chance happen to us all. There is a quote that basically says this \"if working hard made you rich donkeys would be covered in gold\" \n\nI have also known people who make great money but are always broke (lifestyle creep and poor life partner choices can burn you real good)\n\nyou can make serious money as a Doctor, Lawyer, Software Engineer, Investor, running a septic tank service business etc.. Your asking someone to predict the future \"If i do A i will get B\" Sorry life don't work that way.\n\nJust keep making the wisest most logical choice you can given you gifts, talents, interests, and resources and I hope the best for your future.",
          "score": 1,
          "created_utc": "2026-01-21 14:09:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uwdgf",
          "author": "PavelBoss13",
          "text": "Where are you from? How much money do you want? $100 per month or $10,000 per month?",
          "score": 1,
          "created_utc": "2026-01-21 14:16:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0uyryd",
              "author": "Designer_Okra_557",
              "text": "I’m based in new york , as much as i can make to be honest",
              "score": 2,
              "created_utc": "2026-01-21 14:28:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0uzkdw",
                  "author": "PavelBoss13",
                  "text": "Approx How much money do you want?",
                  "score": 1,
                  "created_utc": "2026-01-21 14:33:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0v474g",
          "author": "ConstantPhotograph77",
          "text": "communication skills. aka  gift of the gab.  I began doing standup in college.  Very extraverted with a father who was a professional actor { wasnt a stretch for myself}   If you can become comfortable performing in front of a crowd  you are way ahead of most people entering business, entrpreneurial field..",
          "score": 1,
          "created_utc": "2026-01-21 14:56:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v91av",
          "author": "StillLoadingit",
          "text": "At 17 I would focus on building real skills like selling, networking, and solving problems people actually care about so you can make money from day one. Try testing ideas with customers early and keep iterating based on feedback because that will teach you way more than theory alone.",
          "score": 1,
          "created_utc": "2026-01-21 15:19:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v97ix",
          "author": "Embarrassed_Key_4539",
          "text": "I did an exchange program my junior year in high school, I attended a public school and had no knowledge of the language. That year made me the most resilient, capable person and I really attribute it to a lot of my success later in life.",
          "score": 1,
          "created_utc": "2026-01-21 15:20:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vw826",
          "author": "Ill_Reality180",
          "text": "If I were 17 and thinking long term, I’d focus on skills that compound, not quick money.\n\nI’d pick one high income skill like sales, copywriting, coding, video editing, data, or automation and stick to it. One skill done well beats chasing ten things halfway.\n\nI’d learn how businesses actually make money. Offers, pricing, distribution, and why people buy. Talent doesn’t matter much if you don’t understand this.\n\nI’d start building proof early. Small projects, freelancing, internships, helping businesses even for free at first. At 17, you can mess up without real consequences.\n\nI’d get comfortable with sales and communication. Being able to explain value and persuade ethically is a life cheat code.\n\nI wouldn’t chase passive income yet. I’d focus on active income, then turn skills into leverage later.\n\nGoal isn’t money at 17. It’s becoming very competent by 25. Money follows that.",
          "score": 1,
          "created_utc": "2026-01-21 17:04:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0s42hm",
          "author": "Euphoric-Set-2227",
          "text": "I’m 18 and im asking the questions",
          "score": 1,
          "created_utc": "2026-01-21 01:59:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi1cn3",
      "title": "do you track your live chargeback win rate to improve dispute resolution?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qi1cn3/do_you_track_your_live_chargeback_win_rate_to/",
      "author": "Upper_Caterpillar_96",
      "created_utc": "2026-01-20 13:39:39",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 0.88,
      "text": "Genuine question for other ecommerce folks dealing with chargebacks. Do you actually track your win rate in real time or close to it or do you just look at it once a month and move on.\n\nI run an online store and we handle disputes across a couple payment methods. I realized recently that I dont really have a clear picture of how well our dispute process is working week to week. We know roughly how many cases we win but its usually after the fact and not tied to any specific changes we make.\n\nFeels like if you dont know your current win rate its hard to know whether your evidence process or responses are actually improving anything.\n\nJust looking to learn how other teams handle this in practice.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qi1cn3/do_you_track_your_live_chargeback_win_rate_to/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0nxmbw",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 13:39:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o1rp1",
          "author": "AdOrdinary5426",
          "text": "If your goal is to improve dispute resolution, near real time tracking is essential. Build dashboards or reports segmented by reason code, payment method, and evidence type. Measure the impact of changes immediately, iterate on what works, and catch regressions fast. Treat chargeback management like CRO. Experiment, measure, refine. Consider pairing your own tracking with a tool like Chargeflow, which gives real time analytics and alerts so you actually see win rate trends and dispute outcomes as they happen rather than just retrospectives.",
          "score": 3,
          "created_utc": "2026-01-20 14:02:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qecw49",
      "title": "As a freelancer, working with most small business owners is a dreadful experience",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qecw49/as_a_freelancer_working_with_most_small_business/",
      "author": "[deleted]",
      "created_utc": "2026-01-16 10:51:05",
      "score": 6,
      "num_comments": 7,
      "upvote_ratio": 0.71,
      "text": "As a freelancer, working with most small business owners is a dreadful experience.\n\nI’ve worked with over 50 entrepreneurs from all over the world in the last four years.\n\nStarting out, even though I already had software engineering skills, I started out as a VA. The way I saw it, SWE was a linear technical skill. Something you can learn from a book or a course.\n\n Entrepreneurship isn’t.\n\nSo I wanted to get behind the scenes.\nThat mix of being tech-savvy and having some marketing background quickly made me a trusted asset to my clients. I ended up taking on something close to a COO role.\n\nWhat made things suck was this: most entrepreneurs act on impulse.\n\nAnd not just in marketing or sales. Much deeper than that. Decisions coming from unresolved stuff. Past trauma. Insecurities. You name it.\n\nThat’s where it gets hard.\n\nBecause pushing back on an impulsive decision doesn’t land as an opinion. It lands as a personal attack. As invalidating their feelings. And even pointing that dynamic out feels like an attack, no matter how carefully you phrase it.\n\nThis shows up as obsession with the newest trend. The latest one? AI. Even when there’s no real use case for it. Just to realize $40,000 later.\n\nIt shows up as working until 2 a.m. every night, double-checking the work of team members who’ve been there for years and have already proven themselves.\n\nSpoiler: you won’t find anything.\n\nThat’s not about quality control. That’s about trust. Or avoidance. Or running from something else in life and needing to stay busy.\n\nAnd it goes on. And on.\n\nThe hardest part is that most are unwilling to accept this simple truth: personal struggles are not separate from business problems.\nThey bleed into everything.\n\nThey cloud your judgment as an entrepreneur. And they make things even harder for the people on your team.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qecw49/as_a_freelancer_working_with_most_small_business/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "nzwdshk",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-16 10:51:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzxlwf",
          "author": "sendsouth",
          "text": "Interesting perspective around what's triggering impulse decision making. I tend to work intuitively more than impulsively, but I'll definitely keep what you've said in mind when I'm considering big decisions. Cheers",
          "score": 1,
          "created_utc": "2026-01-16 21:36:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02q2gx",
              "author": "NoTeaForYouBro",
              "text": "cool that there are more people who follow their intuition. whenever i start conversation with my fellow founder friends about importance of intuition and data (data leads the way, but intuition makes the decision)- i am being dismissed for the intuition part, which is crazy in my opinion.",
              "score": 2,
              "created_utc": "2026-01-17 08:40:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o06dq1w",
                  "author": "sendsouth",
                  "text": "Intuition definitely needs to play a role guided by data. Good Intuition comes from experience.",
                  "score": 0,
                  "created_utc": "2026-01-17 21:31:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o02ng7t",
          "author": "NoTeaForYouBro",
          "text": "Well, that's kind of obvious that we are all humans and have our origin story and why we started a business. When it comes to treating others badly or being irrational, it sucks for sure. Depending of what kind of person you are and how you are close to the founder, you could theoretically call that out but in a very \"smart\" way, you know- but it requires very very good people skills. What i believe is - data AND gut feeling- that's my answer to everything. you follow the data, but when there is time for decision- you follow your gut feeling. and never copy what competitor does, just because they did it. first ask- is it really for me/ my business or am i following the hype.",
          "score": 1,
          "created_utc": "2026-01-17 08:15:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bke21",
          "author": "reboog711",
          "text": ">  I started out as a VA. \n\nIs VA \"Virtual Assistant\" here?\n\nFWIW: I've worked with a lot of entrepreneurs in my 20 year career as a custom software developer and never had the issues you point out, with questioning impulsiveness being treated like an attack on the client.  \n\nYou may need to read a Dale Carnegie book, which is all about communication.",
          "score": 1,
          "created_utc": "2026-01-18 17:15:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgyv5o",
      "title": "How do you know when a problem is real enough to commit months of build time?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qgyv5o/how_do_you_know_when_a_problem_is_real_enough_to/",
      "author": "vijayeesam",
      "created_utc": "2026-01-19 08:38:19",
      "score": 5,
      "num_comments": 21,
      "upvote_ratio": 1.0,
      "text": "I kept asking myself this while building my product. I wanted to solve people's writing problems and save them time, but was it real enough?\n\nFor me, seeing people waste almost as much time writing about work as doing the work itself was the sign. So i found a solution for it.\n\nWhat was your \"okay, this problem is actually real\" moment? How did you know your idea was worth the time?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qgyv5o/how_do_you_know_when_a_problem_is_real_enough_to/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0g1pks",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-19 08:38:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g2xwa",
          "author": "[deleted]",
          "text": "Months sounds too much.\n\nBetter weeks. \"12 weeks\" max.",
          "score": 2,
          "created_utc": "2026-01-19 08:49:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0o6gro",
              "author": "Akraam_Gaffur",
              "text": "It's still months. 3 at least",
              "score": 1,
              "created_utc": "2026-01-20 14:27:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0g6unt",
          "author": "AnonJian",
          "text": "Y Combinator tasks founders with discovery of \"hair on fire\" problems. Founders much prefer any lame excuse to start coding. I wrote a post about problem curation but don't link because nobody gave a shit.\n\nAll the problems are real. The mirages come from chasing after an inconsequential minor inconvenience because it is easy to solve. A targetable group has to want to solve the problem urgently enough to pay good money for a solution. You won't get that making excuses while developing a 'Hello World' product.\n\nScratching your own itch is a way to strip off the context of market validation and problem curation. You make the decision it is a problem you'll solve in a market vacuum. Doesn't matter in the least if anybody pays. Degree of pain and urgency is obvious if it took that long to make up your mind it was problem enough to scratch.\n\nIf you are calling it an itch don't bother wondering how many will pay. \n\nBecause validation is just a means to generate false positives, nobody asks the pertinent questions. If you ask how much somebody has spent to solve a problem over the last year and they say \"nothing\" ...take the hint and move on.\n\nI believe way too many are hellbent on their idea simply due to fear of coming up with another idea. Yet founders should be idea factories. Every product should be made up of many ideas.",
          "score": 1,
          "created_utc": "2026-01-19 09:27:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gb4iu",
              "author": "vijayeesam",
              "text": "what signals do people look for before deciding a problem is truly painful and urgent enough to be worth doubling down on?",
              "score": 1,
              "created_utc": "2026-01-19 10:07:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0gbvdc",
                  "author": "AnonJian",
                  "text": "I go over this -- with a specific question to ask detecting that signal -- in the post you've attached your question to.\n\nSo I think the answer would be the least of your worries.",
                  "score": 1,
                  "created_utc": "2026-01-19 10:14:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0if6dm",
              "author": "rioisk",
              "text": "What if no more \"hair on fire\" problems exist? People seem pretty content out there. Everything one would want is one google search away. The only real problem now seems to be people trying to break into the saturated market so they don't have to work as 9-5 slaves for the current players.",
              "score": 1,
              "created_utc": "2026-01-19 17:34:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0j7z43",
                  "author": "AnonJian",
                  "text": "Switch over to a news channel sometime.",
                  "score": 1,
                  "created_utc": "2026-01-19 19:42:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0i7f4s",
          "author": "Remarkable_Figure95",
          "text": "What's a writing problem?",
          "score": 1,
          "created_utc": "2026-01-19 16:58:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0if3go",
          "author": "Plus-Replacement-106",
          "text": "Hey Im trying to solve the exact problem you're asking. It's just an idea at this point, I'd love to know what you think about it.\n\n[https://www.reddit.com/r/advancedentrepreneur/comments/1qgxmf5/how\\_deeply\\_do\\_you\\_test\\_your\\_ideas/](https://www.reddit.com/r/advancedentrepreneur/comments/1qgxmf5/how_deeply_do_you_test_your_ideas/)",
          "score": 1,
          "created_utc": "2026-01-19 17:33:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0igzbo",
          "author": "Inside-Rain299",
          "text": "When people complain about it daily.",
          "score": 1,
          "created_utc": "2026-01-19 17:42:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pbvic",
              "author": "Ill_Reality180",
              "text": "really?",
              "score": 1,
              "created_utc": "2026-01-20 17:44:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0j6ad3",
          "author": "help_me_noww",
          "text": "Yeah Totally agree.",
          "score": 1,
          "created_utc": "2026-01-19 19:35:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kwkg1",
          "author": "BusinessStrategist",
          "text": "It used to be called a “field trial.”\n\nThe Japanese coined the “Gemba” walk.\n\nHow can you improve the productivity of a lemonade stand if you have no idea of how lemonade is produced and sold?",
          "score": 1,
          "created_utc": "2026-01-20 00:46:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pbmzu",
          "author": "Ill_Reality180",
          "text": "I kept asking myself this while building my product. I wanted to help people with writing and save them time, but I wasn’t sure if the pain was real enough to justify months of building.\n\nWhat convinced me was watching people spend almost as much time writing *about* their work as actually doing the work. That friction showed up everywhere, across different roles. That’s when it clicked that this wasn’t just a nice-to-have problem.",
          "score": 1,
          "created_utc": "2026-01-20 17:43:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qiqbq",
          "author": "matteoghetti",
          "text": "When you start getting paid for it. Otherwise you stay in delusion mode.",
          "score": 1,
          "created_utc": "2026-01-20 21:00:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tl188",
          "author": "Overall-Lead-4044",
          "text": "My \"OK, the problem is real\" was when a client nearly fell for a £250,000 phishing scam.\n\nReal enough that I went back to university to get a PhD researching how to automatically detect spear phishing emails",
          "score": 1,
          "created_utc": "2026-01-21 08:16:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ub7tb",
          "author": "barefamting",
          "text": "validate the hell out of the idea, refine it, understand your customer base, get signals. \n\nThis should take more time than building.",
          "score": 1,
          "created_utc": "2026-01-21 12:09:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qiidj2",
      "title": "Need advice/a mentor. Business is booming , it feels like too much to handle sometimes. what do I do ?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qiidj2/need_advicea_mentor_business_is_booming_it_feels/",
      "author": "burgerknapper",
      "created_utc": "2026-01-21 00:13:03",
      "score": 5,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "  Started a service business , business is going very well. Need to expand to take advantage of the large account I acquired. I also need to fix how we operate and get the office sorted out much better. But I essentially need to hire in more people , and potentially open another location soon. But I need help navigating all of that , it’s crazy to me. Didn’t expect to grow and need more help. And especially to grow in every direction like we are…. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qiidj2/need_advicea_mentor_business_is_booming_it_feels/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0rl35c",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 00:13:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0td6ga",
          "author": "Big_Tie_1153",
          "text": "Find someone whos exited a company before and pay for their time.",
          "score": 1,
          "created_utc": "2026-01-21 07:04:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v9mmv",
          "author": "Technical_Project169",
          "text": "Rapid growth breaking systems is a good problem, but it burns founders fast.\n\nFirst thing I’d look at: what tasks must be done by you vs everything else.\n\nCurious, what’s currently taking most of your time day to day?",
          "score": 1,
          "created_utc": "2026-01-21 15:22:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vr6lz",
          "author": "Unable_Musician5446",
          "text": "Totally get this. I’ve been there too. When things started growing fast for me, the hardest part wasn’t getting clients, it was handling everything at once. What helped was getting outside support. I use CollabFabrik’s founder support service, and it honestly took a lot of pressure off. Having help with hiring, operations, and just thinking things through made the growth feel manageable instead of chaotic.",
          "score": 1,
          "created_utc": "2026-01-21 16:41:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vx8nw",
          "author": "Spotch_Platform",
          "text": "Start by getting a clear view of your finances and operations so you know where the bottlenecks are. Then tackle one change at a time instead of trying to fix everything at once. Growth feels more manageable when you can see what is actually happening.",
          "score": 1,
          "created_utc": "2026-01-21 17:08:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qiu52d",
      "title": "i have 3d modeling, 3d printing experience i got 5k to invest should i do service or build product ?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qiu52d/i_have_3d_modeling_3d_printing_experience_i_got/",
      "author": "Mysterious_Note5146",
      "created_utc": "2026-01-21 10:12:04",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 0.83,
      "text": "hello ,  \nim trying to make something sense 2 months ago but nothing is working.  \nwhat you guys could you do in 2026 to make money !  \nalso i quit a job that making 3k a month to invest in a business !\n\ni have 3d printer , 3d cad , modeling experince and capital also up to 5k to invest .  \nshould i go for offline business / online ?  \nshould i do e commecrce for cash flow or anything else ?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qiu52d/i_have_3d_modeling_3d_printing_experience_i_got/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0tx4pl",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 10:12:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tzj5g",
          "author": "TokxoDev",
          "text": "Why did you quit your job? What if an idea works and your running out of money?",
          "score": 1,
          "created_utc": "2026-01-21 10:34:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u2frz",
              "author": "Mysterious_Note5146",
              "text": "first my job was in field i hate .  \nand also im took a step to force my self to work ..  \nalso if i feel im not doing well ill back to a job which im interested in it ! not working only for money !   \nany idea my friend ?",
              "score": 1,
              "created_utc": "2026-01-21 10:59:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qddgl8",
      "title": "Is Starting a Business From Scratch Worth It Today?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qddgl8/is_starting_a_business_from_scratch_worth_it_today/",
      "author": "Policy_Boring",
      "created_utc": "2026-01-15 07:45:15",
      "score": 3,
      "num_comments": 33,
      "upvote_ratio": 0.62,
      "text": "I hear this question a lot, especially from people who want more control over their future but aren’t sure if starting from zero still makes sense.\n\nI’m a franchise expert, and what I see is that starting a business from scratch can be incredibly rewarding, but it also comes with a steep learning curve. You’re figuring out the product, pricing, systems, and customers all at once, which can take time and money before things really click.\n\nThat’s why many people today weigh alternatives like proven models or businesses with built-in systems, especially if they want to reduce early mistakes and risk. Others love the freedom of building something entirely their own, even if it takes longer.\n\nThere’s no one right answer. It really depends on your risk tolerance, timeline, and how much support you want along the way.\n\nWould you start from scratch today, or choose a more structured path?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qddgl8/is_starting_a_business_from_scratch_worth_it_today/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "nzoxuov",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 07:45:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpnf8e",
          "author": "Khalizle",
          "text": "For me I’d rather start from scratch. I enjoy the process of building something up. It could be because I like to progress everyday vs having monthly or yearly goals. It’s like instant gratification when you start small and make “big” moves everyday. I plan to build a business some day and when I do I’ll probably put systems in place where I won’t need to be there at all so I can then build something else.",
          "score": 2,
          "created_utc": "2026-01-15 11:42:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq2t4b",
              "author": "Policy_Boring",
              "text": "I love that mindset. Enjoying the day-to-day progress makes the hard parts feel worth it. Building from scratch gives you that constant sense of momentum, and thinking about systems early shows you’re already planning beyond just one business. That’s a solid long-term approach.",
              "score": 2,
              "created_utc": "2026-01-15 13:26:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzq3gpr",
          "author": "growthconsultant93",
          "text": "Nearly everyone I know who got into a home service franchise is actively trying to sue the franchisor.",
          "score": 2,
          "created_utc": "2026-01-15 13:30:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvlmp4",
              "author": "Policy_Boring",
              "text": "That sounds rough, and I get why experiences like that can leave a bad impression. I’ve also seen cases where expectations weren’t clearly set, or people rushed in without really understanding the agreement. Franchises can work, but only when there’s solid due diligence and the right fit on both sides. It’s definitely not a one-size-fits-all path.",
              "score": 1,
              "created_utc": "2026-01-16 06:39:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzoy9x9",
          "author": "AnonJian",
          "text": "Define zero. If you're talking about zero money, zero business sense, zero imagination and less motivation, you're in the right place. These people do not choose to start from zero, they're trapped there. Go ahead and ask if they're read one business book. \n\nFranchises won't help them. They don't need advice. They need an intervention.",
          "score": 1,
          "created_utc": "2026-01-15 07:49:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzoztw9",
              "author": "Policy_Boring",
              "text": "I hear the frustration behind this, and I get the point you’re making. Starting from “zero” can mean very different things for different people. That said, I’ve seen plenty of folks who felt stuck at zero but were really just missing direction, structure, or confidence. Sometimes the right guidance or framework can help them move forward, not everyone starts motivated or informed, but many can grow into it once they get momentum.",
              "score": 1,
              "created_utc": "2026-01-15 08:03:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzp0an4",
                  "author": "AnonJian",
                  "text": "I've seen plenty of online folks selling something and using discussion as pretext. They are ever so amenable to interminable threads. \n\nNever attempt to teach a pig to sing. It wastes your time and annoys the pig.",
                  "score": 1,
                  "created_utc": "2026-01-15 08:07:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzoyz0g",
          "author": "PersonoFly",
          "text": "They are different solutions for different people. Franchises are great for people who want to focus on operations while starting from scratch is for people who want to create (and some maybe even hand over operations to someone else).",
          "score": 1,
          "created_utc": "2026-01-15 07:55:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpir19",
              "author": "Policy_Boring",
              "text": "That’s a great way to put it. Different paths fit different personalities and goals. Some people enjoy building and creating from the ground up, while others prefer focusing on execution and operations with a model that’s already proven. Neither is better, it’s really about alignment.",
              "score": 1,
              "created_utc": "2026-01-15 11:03:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzqbqk6",
                  "author": "PersonoFly",
                  "text": "Yes exactly. I’m a creative and not so much an ops person and so am impressed when I see those that get stuck in to operations doing well.",
                  "score": 1,
                  "created_utc": "2026-01-15 14:15:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzpyz9k",
          "author": "LordOfTheMoans",
          "text": "Starting from scratch can be really rewarding if you love total creative control, but it’s definitely a steep learning curve, you’re juggling product, pricing, marketing, and systems all at once. If you want less risk and faster results, proven models or franchises can save a ton of trial and error. It really comes down to how much time, money, and stress you’re willing to take on for the freedom of building your own thing.",
          "score": 1,
          "created_utc": "2026-01-15 13:04:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq9tki",
              "author": "Policy_Boring",
              "text": "Well said. That’s a really balanced take. Creative control can be incredibly rewarding, but the learning curve is real when you’re building everything at once. Proven models can definitely reduce early stress and mistakes. At the end of the day, it really comes down to personal priorities and how much risk someone is comfortable taking.",
              "score": 1,
              "created_utc": "2026-01-15 14:05:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzravp7",
          "author": "JS_157",
          "text": "Scratch if you don’t have money to blow. My solo window cleaning business hit $10k in sales in my first month of meta ads. I couldn’t keep up being that it was a side gig. It’s less about the business and more about skills in marketing, sales, hiring, managing, system creation etc.",
          "score": 1,
          "created_utc": "2026-01-15 16:59:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvqfe6",
              "author": "Policy_Boring",
              "text": "That’s a great example, and congrats on those results. You’re spot on. It’s really the skills that make the difference. Starting from scratch can work incredibly well when you know how to market, sell, and build systems, especially with low overhead. The business itself matters, but execution is what really moves the needle.",
              "score": 1,
              "created_utc": "2026-01-16 07:19:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzrdftz",
          "author": "Radiant-Design-1002",
          "text": "I’m just gonna speak for my experience. I started from scratch seven months ago building an app that I thought would fix my biggest problem and a bunch of other people I’ve spoken with.\n\nI would say it’s worth building from scratch because everything you get to do in the process from zero to launch and then from launch to your first thousand users is the most rapid self-development and educational part of your life.\n\nI see a lot of people who go on and take over other businesses or buyout, boomer businesses ensure they cash flow for the first year, but they slowly start declining because they never had the fundamental skills of how to run a business.\n\nPeople underestimate how important it is to learn from startup mistakes that’s what makes an entrepreneur successful. It’s having the ability to fail. Learn from that failure, and then continue to iterate and try again.",
          "score": 1,
          "created_utc": "2026-01-15 17:11:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzszez0",
          "author": "Vens_here",
          "text": "start from scratch, youll get more experience by building and failing rather than a 9 to 5 just to get experiences, the whole idea is false , you can’t get more experienced by just working a job, you have to be versatile as n entrepreneur",
          "score": 1,
          "created_utc": "2026-01-15 21:35:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gvgz9",
              "author": "Policy_Boring",
              "text": "I get what you’re saying. Building something from scratch really does force you to learn fast and wear a lot of hats, which a 9–5 doesn’t always give you. That versatility and hands-on experience are hard to replicate any other way.",
              "score": 1,
              "created_utc": "2026-01-19 12:55:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0tbbm4",
                  "author": "Unfair_Today_511",
                  "text": "Keep in mind that you will need a solid runway if you build from scratch.",
                  "score": 1,
                  "created_utc": "2026-01-21 06:48:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0167uy",
          "author": "leveragedtothetits_",
          "text": "I don’t believe in proven models",
          "score": 1,
          "created_utc": "2026-01-17 01:41:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01stjn",
          "author": "saggy_hotdog",
          "text": "Working on starting mine. Already have LLC registered. EIN established. Just need insurance and bank account now",
          "score": 1,
          "created_utc": "2026-01-17 04:07:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fyly2",
              "author": "Policy_Boring",
              "text": "That’s awesome! congrats on getting this far 👏 You’ve already knocked out some of the hardest setup steps. Once the insurance and bank account are done, it really starts to feel real. Wishing you the best as you move into the next phase, exciting times ahead!",
              "score": 1,
              "created_utc": "2026-01-19 08:09:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0akbi5",
          "author": "Familiar-Jeweler6510",
          "text": "if I would run a business , I would certainly want to create my own idea and brand and build up everything from there even it is insanely hard. But the key of this is to actually fall in love with the problem you are solving , because without this , you will just give up when things get hard most of the time \n\nI would rather run an agency if money would be really important but running an already successful franchise business would not really bring me any fulfillment of creation and the happiness of why I would run a business in the first place \n\nI understand otherwise , but it is just me",
          "score": 1,
          "created_utc": "2026-01-18 14:16:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fxhqt",
              "author": "Policy_Boring",
              "text": "I really like how you explained this. It sounds very self-aware. Falling in love with the problem you’re solving is such a big deal, especially when things get tough, and they always do.\n\nNot everyone is driven by the same kind of fulfillment, and that’s okay. For some, creation and ownership of the idea matter more than speed or predictability. Your approach makes total sense, especially if purpose is your main motivator.",
              "score": 1,
              "created_utc": "2026-01-19 07:59:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0bzeh5",
          "author": "DeviantHistorian",
          "text": "Yeah I would say from scratch. That's what I did with my business and it was a 15-year journey of a lot of ideas. A lot of refinement a lot of stuff like that and then I got serious in the last 36 months and knew I wanted to pivot to that full-time. But I really understand my market. My customers what I wanted for logo. It took me like 10 years to come up with a good logo but then it's something I could say I built I created. I didn't want to buy somebody else's business or buy myself a job. That's the way I feel it is. If you do franchises and some people franchise pride would be good. If you want someone to kind of tell him what to do or help them manage it or give them a road map. Other people want to just do what they want to do and that's how to do it",
          "score": 1,
          "created_utc": "2026-01-18 18:25:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fuvli",
              "author": "Policy_Boring",
              "text": "That’s a great perspective. You can really feel the pride in building something over time and truly knowing your market. It’s not something you can rush. That long journey gave you clarity on what you wanted and what you didn’t, and that matters. I also like how you framed it: some people want a roadmap, others want full creative control. Neither is wrong. It really comes down to how someone wants to work and what kind of ownership they value most.",
              "score": 1,
              "created_utc": "2026-01-19 07:35:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gpgrn",
          "author": "lazy-buoy",
          "text": "I the US where there is a fair bit of money to be raised or borrowed I'd say yes,\n\nFor us in the uk... I don't think so, it's just too hard,\nIf you bought a dying business that's been a round 10 years it would have proven cash flow, already have credit accounts and some customers to at least get things started.",
          "score": 1,
          "created_utc": "2026-01-19 12:12:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0guwlo",
              "author": "Policy_Boring",
              "text": "That’s a really fair point. Location and access to capital make a huge difference. What works in the U.S. doesn’t always translate the same way in the UK, and buying an existing business with cash flow can be a much safer starting point there. Context really matters with these decisions.",
              "score": 1,
              "created_utc": "2026-01-19 12:52:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qdap2y",
      "title": "Would a combined Rage Room + Zen Wellness Space help people cope? Seeking insights from entrepreneurs and people in the mental health space",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qdap2y/would_a_combined_rage_room_zen_wellness_space/",
      "author": "Royal_Avocado_8911",
      "created_utc": "2026-01-15 05:11:21",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Hi everyone! I’m developing a concept for Nairobi, that blends stress relief and wellness in one sanctuary. Imagine a lush green space with multiple rage rooms for safe emotional release, Zen spaces for calm and reflection, creative therapy corners (candle making, pottery, basket weaving), and soundproof rooms for crying or hugging huggable dolls. Guests can also talk to a therapist, walk a nature trail, all under one roof.\n\nThis is a new idea in my region, and I’d love to hear from those who have seen similar concepts in countries where mental health spaces are more established.\n\n* Do you think combining cathartic activities (rage rooms) with restorative ones (Zen, creative therapy) is beneficial or overwhelming?\n* What mental health considerations should I keep in mind to make this safe and supportive?\n* How can I ensure these spaces complement professional therapy rather than replace or contradict it?\n\nYour insights would mean a lot as I shape this project. Thank you!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qdap2y/would_a_combined_rage_room_zen_wellness_space/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "nzofam8",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 05:11:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzoynfe",
          "author": "AnonJian",
          "text": "Sounds like a contradiction. Somewhat like a weight loss center with a greasy spoon diner. Wantrepreneurs see this as an appealing challenge. Businesspeople see it like two separate and incompatible market segments. \n\nA rage room attracts people who see activity as the answer. Zen attracts people who see fostering patient stillness as the answer. I have no clue how anybody who even tried either would figure they went together.",
          "score": 1,
          "created_utc": "2026-01-15 07:52:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh1948",
      "title": "The hidden time sink in early-stage startup finances",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qh1948/the_hidden_time_sink_in_earlystage_startup/",
      "author": "chanderbing0212",
      "created_utc": "2026-01-19 11:01:31",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I’ve been working closely with a few early-stage founders on financial decision-making, and there’s a pattern I keep seeing.\nBasic bookkeeping is usually handled.\nBut when real decisions come up ,for example:\n-hiring or delaying a hire\n-expanding a team or pausing growth\n-increasing or cutting spend\n-pricing or packaging changes\n-committing to longer-term contracts or tools\n-deciding whether to extend runway or push growth\n-understanding what actually breaks if a plan doesn’t work\n…the numbers needed to answer those questions aren’t always immediately available or fully trusted.\nWhat often happens instead:\n-pulling data into Excel for the specific decision\n-rebuilding assumptions from scratch\nspending a lot of time validating that the numbers are actually correct\n-manually running scenarios\nstill feeling uncertain before making the call\nWhat should be a fairly straightforward decision can end up taking hours or days of spreadsheet work.\nI’m trying to better understand this in-between phase, after bookkeeping is in place, but before hiring dedicated finance help.\nI’m looking to work through a few real upcoming decisions with founders to understand how this is currently handled, where time gets spent, and what would actually make this easier in practice.\nIf this sounds familiar and you’re dealing with decisions around growth, spend, or runway, I’d be glad to connect and compare notes.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qh1948/the_hidden_time_sink_in_earlystage_startup/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0gh0mu",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-19 11:01:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qffm1p",
      "title": "Reporting feels way harder than it should be",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qffm1p/reporting_feels_way_harder_than_it_should_be/",
      "author": "Own_Chocolate1782",
      "created_utc": "2026-01-17 15:10:11",
      "score": 3,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "We’re a growing team with data spread across CRM, finance, and marketing tools, plus a bunch of spreadsheets holding it all together. Any simple question from leadership turns into exports, fixes, and rebuilding charts just to trust the numbers.\n\nIt feels like we *have* the data but no clean way to see it in one place or keep reports reliable.  What did others switched to once spreadsheets and disconnected dashboards stopped scaling. Please need a quick help to solve this issue!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qffm1p/reporting_feels_way_harder_than_it_should_be/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o046fna",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-17 15:10:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06xko6",
          "author": "Inside-Rain299",
          "text": "Ugh, the spreadsheet struggle is REAL.",
          "score": 1,
          "created_utc": "2026-01-17 23:11:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07c7ux",
          "author": "dragonflyinvest",
          "text": "Either keep it manual and make it someone’s job to produce the right reports. Or automate it and build dashboards. Kinda depends on your data sources.",
          "score": 1,
          "created_utc": "2026-01-18 00:28:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08w50o",
          "author": "Any_Bill1050",
          "text": "Build in a verification within the report and you will have a reliable data.  I thought it was a basic step in any financial model.",
          "score": 1,
          "created_utc": "2026-01-18 05:58:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09a1op",
          "author": "Flat-Shop",
          "text": "When leadership keeps asking the same questions and the answers take hours, it’s usually a tooling problem. We switched away from spreadsheets to a BI platform and it immediately cut down the back and forth and rework. We use domo, reporting stopped being a recurring fire drill.",
          "score": 1,
          "created_utc": "2026-01-18 07:59:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pcb4v",
              "author": "lil_tink_tink",
              "text": "Or the opposite is true if leadership keeps asking different questions then it is a KPI problem. Figure out what is most important and start there. The layer in new answers.\n\nJust like choice overload too much data can cause leadership to freeze instead of making decisions.",
              "score": 1,
              "created_utc": "2026-01-20 17:46:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o09lhn0",
          "author": "StillLoadingit",
          "text": "Totally, reporting always feels way harder than expected when you start digging into real data and numbers don’t match up how you thought. Keeping it simple with the key metrics that actually tell you whether things are moving in the right direction makes it much less painful.",
          "score": 1,
          "created_utc": "2026-01-18 09:45:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0a6s9w",
          "author": "QuestionedGirl",
          "text": "Hey, I know someone who might have the solution. But is your company big corp or small business?",
          "score": 1,
          "created_utc": "2026-01-18 12:50:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0alf9p",
          "author": "afahrholz",
          "text": "yes, reporting always feels harder than it should, especially when tools don't talk to each other and you're constantly cleaning and translating data instead of actually learning from it.",
          "score": 1,
          "created_utc": "2026-01-18 14:22:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ghd8d",
          "author": "chanderbing0212",
          "text": "This is a problem I’ve been seeing a lot with early-stage teams. The data exists, but every new question turns into exports, spreadsheet rebuilds, and time spent re-validating numbers instead of actually deciding.\nI’m currently working with a few founders on this and doing free pilots where we take one real decision or reporting need (for example: cash runway under different scenarios, team plan vs budget, or a recurring leadership report) and rebuild it end-to-end so it’s:\nbased on clearly defined inputs and assumptions\nconsistent across finance and ops\neasy to update without changing the structure each time\nThe goal isn’t more dashboards,it’s having one version you trust when leadership asks a question.\nIf you want to try this on a real issue you’re dealing with right now, happy to help as a pilot,  just trying to learn what actually reduces the spreadsheet churn in practice.",
          "score": 1,
          "created_utc": "2026-01-19 11:04:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l82ka",
          "author": "alexmancinicom",
          "text": "I like centralizing everything including synced spreadsheets to a data warehouse like BigQuery. Then can create simple views to start, and connect them to dashboarding tools even.",
          "score": 1,
          "created_utc": "2026-01-20 01:49:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lfo9a",
          "author": "analyteprojects",
          "text": "Curious - who has accountability for the data that supports business insights? What is the cadence for these \"questions\"? Are there clear indicators or metrics understood universally as important to business insights?",
          "score": 1,
          "created_utc": "2026-01-20 02:30:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nclsm",
          "author": "cragwallaccess",
          "text": "Our $2.5B platform went public last year. 14 companies with different ERP systems with core WIP functions, roll forwards, and KPIs all massive excel worksheets. It's all the corporate finance gurus know. \"Yay! We went public.\" \"Oh crap! We went public...\"",
          "score": 1,
          "created_utc": "2026-01-20 11:14:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qht3vf",
      "title": "What signals made you double down or kill something?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qht3vf/what_signals_made_you_double_down_or_kill/",
      "author": "vijayeesam",
      "created_utc": "2026-01-20 06:01:55",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I'm curious how other founders decide when to keep pushing vs when to pivot or kill an idea.  \nFor me, I'm building an AI tool that writes for you. I've got some early users, but traction is slow.  \nWhat made you realize it was time to:  \nDouble down and keep going?  \nKill a feature or pivot entirely?  \nWhat's your story?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qht3vf/what_signals_made_you_double_down_or_kill/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0mdn8m",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 06:01:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mwakt",
          "author": "AnonJian",
          "text": "The entire problem with any form of validation is doubling-down as the only option. If torches and pitchforks wouldn't get you to cancel, whatever you're calling validation is a sham -- it's actually procrastination. Just launch. \n\nLet's get this out there...\n\n...Three, six, twelve responses to a survey when nobody paid but a moment's attention for? Cancel. \n\n...Got one hundred signups on an internet with six billion users? Don't post to crow -- cancel. \n\n...Attempting to suggest non-paying users are just the same as customers paying full price? It didn't work: CANCEL. \n\nPeople don't post wondering if something validated. They post to figure out how to ignore a pretty clear invalidation signal. \n\nLet's save the mutilation of the word \"Pivot\" for further discussion.",
          "score": 1,
          "created_utc": "2026-01-20 08:44:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0netmg",
              "author": "vijayeesam",
              "text": "Fair point - most of us probably cling to weak signals way too long.",
              "score": 1,
              "created_utc": "2026-01-20 11:33:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0so6zn",
          "author": "Drumroll-PH",
          "text": "For me, the clearest signals are engagement vs effort. If people use it, pay for it, or tell you they can’t live without it. If adoption stalls despite repeated fixes, or the problem it solves isn’t urgent, that’s when I pivot or kill it. Early feedback and real usage beats gut feeling every time.",
          "score": 1,
          "created_utc": "2026-01-21 03:57:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi1k1b",
      "title": "Deliberately Practicing Business",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qi1k1b/deliberately_practicing_business/",
      "author": "Skedsman",
      "created_utc": "2026-01-20 13:48:35",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "In most skills, improvement comes from reps.\n\nIf you want to get good at guitar, you practice scales.\n\nIf you want to get good at math, you solve math problems.\n\nIf you want to get good at basketball, you shoot hoops.\n\nBut business feels abstract.\n\nSo my question is: what are the true equivalents of “putting in reps” for business?\n\nWhat do you actually practice day-to-day to build real business skill, instead of just consuming information or planning?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qi1k1b/deliberately_practicing_business/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o0nz8ow",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-20 13:48:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o5m71",
          "author": "MotoRoaster",
          "text": "It comes from doing. Many people don't start due to trying to plan perfection, just start, and learn on the journey.\n\nWant to start a fashion brand, buy 100 t-shirts, screen print them, and get out there selling. Your potential customers will gladly tell you what you did wrong and right.\n\nNow take the profits and learnings, and buy 300 more t-shirts, and do it again, but better.\n\nWhen your own time and money are on the line you learn very quickly about most of the important subjects like sourcing, buying, design, marketing, sales, finance. And you get better each time.",
          "score": 1,
          "created_utc": "2026-01-20 14:22:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q3whb",
          "author": "MathewGeorghiou",
          "text": "I've spent the past 25 years creating realistic business simulations for this exact purpose.\n\nIMO, playing the right business simulations plus doing a real side hustle will build more entrepreneurship skills faster than all the business courses in the best universities.",
          "score": 1,
          "created_utc": "2026-01-20 19:51:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}