{
  "metadata": {
    "last_updated": "2026-03-01 16:49:58",
    "time_filter": "week",
    "subreddit": "EntrepreneurRideAlong",
    "total_items": 20,
    "total_comments": 260,
    "file_size_bytes": 245588
  },
  "items": [
    {
      "id": "1rcrz96",
      "title": "First time delegating finances to someone else",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rcrz96/first_time_delegating_finances_to_someone_else/",
      "author": "Commercial-Block9868",
      "created_utc": "2026-02-23 19:55:17",
      "score": 118,
      "num_comments": 18,
      "upvote_ratio": 0.88,
      "text": "Brought on an ops hire this quarter and for the first time handed off a portion of financial oversight to someone other than myself (vendor payments and approvals mostly with some other things too) Things I had controlled since we started\n\n\n\n  \nThe adjustment was more psychological than operational cause otherwise the practical side was fine. The instinct to stay close to every decision didn't go away just because someone else is now responsible for making them but what I didn't anticipate/think about was how much the handoff forced us to document and systematize things that were previously just in my head\n\n\n\n  \nProcesses I thought were straightforward turned out to be entirely undocumented because I had always been the process. That part has been the most valuable outcome of the whole thing so I'm still figuring out the right balance between oversight and letting go. I would love opinions from you guys aswell",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rcrz96/first_time_delegating_finances_to_someone_else/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o70e3b6",
          "author": "No-Awareness-8518",
          "text": "Founders underestimate how much of their operation is undocumented until they try to hand something off. What you described more about  being forced to build real infrastructure rather than delegation and that's a good problem to have worked through trust me",
          "score": 3,
          "created_utc": "2026-02-23 20:02:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o70qm23",
              "author": "Motor_Temporary_7361",
              "text": "Purchasing authority is where that undocumented infrastructure surfaces first. Getting Ramp set up with per person limits and approval thresholds was what forced that configuration to exist explicitly for us because you can't delegate something that was never written down until the system requires you to define it",
              "score": 6,
              "created_utc": "2026-02-23 21:02:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o70e66h",
          "author": "Ok_Syllabub8601",
          "text": "Did you document the processes before the hire or did the documentation happen as a result of the handoff?",
          "score": 1,
          "created_utc": "2026-02-23 20:02:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o70k47r",
              "author": "Commercial-Block9868",
              "text": "It was more as a result of it cause I thought I could walk them through things but it became clear pretty fast that walkthrough is not the same as documentation",
              "score": 1,
              "created_utc": "2026-02-23 20:31:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o70eqqb",
          "author": "unrealistic_matron",
          "text": "Three months into a similar transition here and the documentation piece was the same for us",
          "score": 1,
          "created_utc": "2026-02-23 20:05:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70g1hm",
          "author": "DisastrousFixing",
          "text": "Delegation at this stage is less about trust and more about whether the infrastructure actually supports someone else making decisions independently",
          "score": 1,
          "created_utc": "2026-02-23 20:11:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70l432",
          "author": "Minimum_Primary641",
          "text": "The hardest part of this transition is that there's no clear signal telling you when to stop checking so you gradually do it less as the confidence builds",
          "score": 1,
          "created_utc": "2026-02-23 20:35:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70w8hx",
          "author": "Top_Street8272",
          "text": "The threshold system is how most people solve the oversight problem practically. Define what requires your sign off by amount or category and let everything below that run without you",
          "score": 1,
          "created_utc": "2026-02-23 21:30:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71more",
          "author": "Lorenzo56",
          "text": "You MUST have financial controls, trust but verify. I learned this the hard way. Your accountant can help you…",
          "score": 1,
          "created_utc": "2026-02-23 23:48:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o722kgy",
          "author": "Unhappy-Bunch-4594",
          "text": "went through this about a year ago when i brought on an office manager for my service company. the psychological part is real — first month i was logging into the bank account twice a day to check transactions even though she had everything under control.\n\nwhat actually made it click was building a simple approval matrix. anything under $500 she handles without asking. $500-2,000 she sends me a slack message with the vendor and reason, and i approve or deny within 24 hours. anything over $2,000 we discuss before it goes out. took about a week to define those tiers and it eliminated 90% of the anxiety because i knew exactly what she could and couldn't do without me.\n\nfor the documentation piece — start with your recurring payments. thats the easiest win because its predictable. we made a spreadsheet of every vendor, what they charge, when it hits, and whether its auto-pay or manual. took maybe 2 hours and immediately gave her the full picture of where money goes each month. the one-off stuff you can document as it comes up.\n\nthe \"when do i stop checking\" thing took about 3 months for me. i went from checking daily to weekly to now i just review the monthly P&L and flag anything that looks off. youll get there.",
          "score": 1,
          "created_utc": "2026-02-24 01:17:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73kyc6",
          "author": "HarjjotSinghh",
          "text": "this feels like learning to share my snacks - terrifying at first!",
          "score": 1,
          "created_utc": "2026-02-24 07:33:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74g1fx",
          "author": "FrontCat3556",
          "text": "It took me a while to give up tasks to others. Wait for the moment someone will disappoint after that it just gets worse 😅\n\nI always think if it isn't delegable, then it isn't scalable, and force my way to it.",
          "score": 1,
          "created_utc": "2026-02-24 12:11:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74p14g",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-24 13:11:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o74p16j",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rcrz96/first_time_delegating_finances_to_someone_else/o74p14g/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-24 13:11:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o74s5v3",
          "author": "drteq",
          "text": "Kudos for delegating.  I don't want to discourage it with this comment, because it's absolutely necessary.  \n\nBut this is the stage everyone also gets ripped off.  The only way to do this properly is have 2 people to keep each other honest in some way.  Checks and balances, and it shouldn't be you.  Does not need to be 2 full time people, but two unrelated people who verify the others work for sign off or record review.\n \nIf there is any weakness to exploit (steal from you) it will happen, so you must put controls in place to keep people honest with your money.\n\nWe learned this hard way when our accountant of 6 years had been stealing the employer payroll taxes the whole time, and not filing the taxes.  That was $700k in back taxes not paid, $700k stolen and penalties.  Also it ended up creating a downword spiral that shut the doors.",
          "score": 1,
          "created_utc": "2026-02-24 13:29:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79zbuj",
          "author": "kubrador",
          "text": "the real business move here was discovering you've been running on vibes and muscle memory. congratulations on accidentally building your first actual process documentation.",
          "score": 1,
          "created_utc": "2026-02-25 05:23:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7f2coj",
          "author": "Betyouwonthehehaha",
          "text": "Probably goes without saying but don’t give anyone financial reporting responsibility and access to payables without some checks and balances.",
          "score": 1,
          "created_utc": "2026-02-25 23:18:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gw5zg",
          "author": "HarjjotSinghh",
          "text": "this trust act feels like winning a tiny battle",
          "score": 1,
          "created_utc": "2026-02-26 05:56:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rhawrg",
      "title": "So I've spent 3000 hours on startups. If I could start over today, here's what I would do...",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rhawrg/so_ive_spent_3000_hours_on_startups_if_i_could/",
      "author": "Chief_API_Officer",
      "created_utc": "2026-02-28 19:02:24",
      "score": 75,
      "num_comments": 19,
      "upvote_ratio": 0.94,
      "text": "First off, let me get a few things out the way:\n\n* No, I'm not a millionaire. Not yet anyway.\n* No, I don't have some fancy CS degree or MBA from a school your parents would be proud of.\n* Yes, I've actually done this stuff. 3000+ hours across multiple startups, multiple failures, and a whole lot of painful lessons that I'm about to hand to you for free.\n\nNow that's out the way...\n\nHere's what I want to say.\n\nI've spent the last few years building startups while teaching myself literally everything from scratch. Marketing, programming, web design, all of it. I went from having zero marketable skills to shipping actual products that actual humans use. And most of what I learned, I learned by getting it catastrophically wrong first.\n\nSo if I could go back to hour zero, here's what I'd tell myself:\n\nDON'T spend 3 hours a day learning real skills when you could just consume 100 books at surface level so you can brag about your reading list.\n\nDON'T build your product in a week and ship it ugly. Spend 2 years polishing your landing page instead. Perfection matters more than customers right?\n\nDON'T try multiple marketing channels. Just pick one, cold email strangers into the void, get zero replies, and then blame your landing page. Spend 2 years redesigning it. Still get zero replies. That's the dream.\n\nDON'T pick ideas that sound hard and boring and already have competition. Go for the one that sounds easy and exciting and nobody's done before. Those always work out.\n\nDON'T measure anything with actual numbers. Just vibe it out. You'll *feel* when it's working.\n\nDON'T set a clear point where you'll pivot. Just keep going forever on one idea because \"persistence\" sounds good in a podcast quote.\n\nDON'T schedule your work hours or write down what you're going to do. Real entrepreneurs just wing it and figure it out. That's hustle, baby.\n\nLet me stop messing with you. Go back and re-read those. Cover up \"DON'T.\"\n\nThose are EXACTLY what I'd do all over again.\n\nHERE'S WHAT ACTUALLY HAPPENED TO ME.\n\nMy first startup was called VimFuse. An LMS for YouTubers. Sounds cool right? I thought it was genius. The kind of idea you get excited about in the shower and still think is brilliant 3 hours later.\n\nSo what did I do? I picked ONE distribution channel. Cold emails. Sent a bunch. Got zero replies.\n\nAnd here's where most people (including old me) make the fatal mistake. I didn't think \"maybe I should try a different channel.\" I thought \"my landing page must not be good enough.\"\n\nSo I spent TWO YEARS polishing that landing page. Tweaking copy. Redesigning. Perfecting.\n\nSent more cold emails. Still zero replies.\n\nTwo years. Gone. Because I was solving the wrong problem.\n\nIf I had just tried Reddit, LinkedIn, Twitter, Facebook groups, TikTok, literally ANYTHING else, I would have found out in weeks whether anyone actually wanted this thing. Instead I spent 2 years optimising a page that nobody was ever going to see because my distribution was broken.\n\nI eventually gave up and pivoted. And that pivot taught me more in 2 months than the previous 2 years ever did.\n\nWHAT I ACTUALLY LEARNED FROM 3000 HOURS\n\n**Your idea sounding great is actually a red flag.**\n\nThere's this concept called a tarpit idea. It's the idea that sounds amazing, not too hard, and weirdly nobody seems to be doing it. You think you've found a gap in the market. In reality, hundreds of people have tried it, and they all drowned quietly.\n\nThe best ideas? They're boring. They're hard. And there's already competition doing it. Competition means demand. Competition means people are paying real money for this thing. You're not looking for a gap. You're looking for a crowd.\n\n**You need to learn actual skills. Not \"entrepreneur\" skills. Real ones.**\n\nWhen I started I had nothing to offer. Zero skills. I genuinely thought I could build a business without being good at anything. Just have the idea, outsource the hard stuff, and watch the money roll in.\n\nThat's not how any of this works.\n\nI eventually sat down and taught myself programming, marketing, and web design. Not from some $997 course. From YouTube, free resources, and building stuff that broke.\n\nThis did two things. One, it meant I could actually build and ship things fast without waiting on anyone. Two, and this is the part nobody talks about, it meant that even when a startup failed, I still walked away with skills that made the next one easier. And the one after that. And the one after that.\n\nThe skills compound. The failed startups don't go to waste if you're learning while building.\n\n**Spend at least 3 hours a day learning if you're under 30.**\n\nI know this sounds like a lot. But here's the maths. If you're spending all your time building and zero time learning, and your startup fails, you're left with nothing. If you spend some of every day getting genuinely good at a high-value skill like programming, copywriting, design, or sales, then even when things fail, your ability to provide value goes up. Higher skills = higher demand = more money. Whether that's through your own business or someone else's.\n\n**Stop speed-reading books to hit some number.**\n\nI fell into this trap hard. Tried to read 100+ books so I could feel productive. In reality I retained almost nothing. You know what actually moved the needle? Reading The Lean Startup properly. With notes. Under deep focus. Understanding it inside out.\n\nI would rather read that one book 10 times than read 10 generic business books once each. Most business books are one blog post stretched into 300 pages anyway. Find the few that actually matter and learn them like scripture.\n\nIf I had to pick one: The Lean Startup. It's about how to build fast, measure what matters, and know when to pivot. That's literally the entire game.\n\n**Measure everything in percentages. Decide your pivot point before you start.**\n\nBefore you launch anything, write this down: \"If X% of people who see this pay for it, I continue. If not, I pivot.\"\n\nThis takes all the emotion out of it. No more \"maybe I just need to tweak the landing page for another 6 months.\" You set the number. You hit it or you don't. If you don't, you move on and take everything you learned to the next thing.\n\nI didn't do this with VimFuse. I just vibed it. Kept going because giving up felt like failure. In reality, pivoting IS the skill. Knowing when to walk away is worth more than knowing how to grind.\n\n**Ship in a week. Not a year.**\n\nIf your first version takes more than a week to build and get in front of people, you're overbuilding. You don't need it to be pretty. You don't need every feature. You need to find out if anyone cares enough to pay.\n\nThe answer to that question is worth more than 6 months of development.\n\n**Try every distribution channel. Not just one.**\n\nHere's what my marketing should have looked like from day one:\n\n* Reddit\n* LinkedIn\n* Twitter\n* Facebook Groups\n* TikTok\n* Instagram\n* YouTube Shorts\n* Cold DMs\n\nHit as many of these as close to daily as possible. One of them will work. You don't know which one until you try. I wasted 2 years on cold email because I was too stubborn to test anything else. Don't be me.\n\n**90% of business is boring and repetitive. That's the point.**\n\nHere's what nobody tells you. Building a business is not exciting. It's not fun most of the time. It's doing the same outreach, the same follow-ups, the same content creation, the same grunt work, every single day, for months.\n\nThat's not a bug. That's the entire business model.\n\nMost people quit because they think something's wrong when it gets boring. Nothing's wrong. You've just reached the part where the actual money is made. The people who push through the boring repetitive phase are the ones who win. Everyone else pivots to a new shiny idea and starts the cycle again.\n\n**Schedule your hours or lose half of them.**\n\nIf you don't write down exactly what you're doing at what time, you'll task-switch your way through the day and what you thought was 8 hours of work will turn out to be 4. I know this because I've done it hundreds of times.\n\nDeep work is real. Time-blocking is real. Write it down. Protect the hours. Do the thing you said you were going to do at the time you said you were going to do it.\n\n**You don't need to quit your job. But there's a case for it.**\n\nEveryone has 5-9. Both AM and PM. You can build on the side. Plenty of people do.\n\nBut there's a dark reason quitting works: delusion. When you quit and you've got no safety net, your brain gets very creative very fast because the alternative is not making rent. It's a terrible financial strategy and an incredible psychological one.\n\nI'm not telling you to quit. I'm telling you that if you do, the urgency hits different.\n\nSO WHAT AM I ACTUALLY BUILDING NOW?\n\nRight now I'm building GapFinder. A tool that helps people stuck in 9-to-5 jobs figure out their next business move. It gives you a personalised action plan based on your actual situation, skills, and constraints. Not generic \"start a dropshipping store\" advice. An actual plan.\n\nI built the first version in a week. Shipped it. Posted about it on Reddit. Got 91,000 views on the post.\n\nDid I follow every single piece of advice in this post? Yeah. Because I learned all of it the hard way first.\n\nFINAL THOUGHTS.\n\nHere's what I've realised. Most aspiring entrepreneurs are physically allergic to execution.\n\nYou've read every startup book. You're in ten \"founder\" Discords. You've watched a thousand YouTube videos about passive income. You've got a Notion doc labelled \"2025 Business Ideas.\"\n\nBut you still haven't launched a single thing.\n\nBecause you've confused preparation with progress.\n\nStartups are not about perfect ideas. They're about reps. Put something out there. Measure it. Learn from it. Kill it or grow it. Repeat.\n\nWith AI now, you can put up reps once a week instead of once a year. There's never been a better time to be someone who executes.\n\nSo here's what I want to ask:\n\nFor those of you who've been building for a while, if you could start over, would you move faster and take more shots? Or would you slow down and go deeper on one thing?\n\nDMs are open. I respond to everyone.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rhawrg/so_ive_spent_3000_hours_on_startups_if_i_could/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o7ybs9y",
          "author": "Character-Sundae8581",
          "text": "Sheesh, you coulda been talking to me directly and it wouldn’t have felt out of place 😅 the job thing is very real. I wish I didn’t need stress to motivate me. I half assed everything I started until I quit my job, moved states, and decided to not give myself a plan B. Within a year I had a legit LLC working independently from home consistently bringing in 800-1500 a week which was great for me. Then it all crashed and burned when I tried to grow too fast instead of putting in the real work to be in a position to survive the storm. But I thought I could have the idea, throw money at it and get to kick my feet up and “live the good life”. Now I’m trigger shy and not sure where to get started again. Appreciate your post, it was a good read.",
          "score": 5,
          "created_utc": "2026-02-28 22:14:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7yhl3t",
              "author": "Chief_API_Officer",
              "text": "That's not a failure story instead it's a \"learned the hard way what most people never learn at all\" story. Remember, Alex Hormozi lost it twice and each time he came back stronger.\n\nAnd don't be trigger shy, you've already got such a huge advantage with all your knowledge from your first business.\n\nMy most recent project is actually helping people in your position, I'm happy to share details if you would like.",
              "score": 2,
              "created_utc": "2026-02-28 22:46:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7xiv00",
          "author": "Unlikely_Ad9024",
          "text": "That was a very long thread.\n\nBut I read it, and this should be the beginner entrepreneur guide to marketing.",
          "score": 4,
          "created_utc": "2026-02-28 19:40:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xk5qz",
              "author": "Chief_API_Officer",
              "text": "Yep, that's the hardest part...",
              "score": 0,
              "created_utc": "2026-02-28 19:47:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7zecvy",
          "author": "blahblahbush",
          "text": "> Let me stop messing with you. Go back and re-read those. Cover up \"DON'T.\" **And ignore the second part of the \"tip\"**",
          "score": 2,
          "created_utc": "2026-03-01 02:01:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82poyl",
          "author": "FED_Focus",
          "text": "\"Those who can't do, teach.\n\nThose who can't teach, teach gym\"\n\nJack Black - The School of Rock",
          "score": 2,
          "created_utc": "2026-03-01 16:29:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xebmv",
          "author": "HarjjotSinghh",
          "text": "that's the kind of hustle we all secretly wish we had.",
          "score": 1,
          "created_utc": "2026-02-28 19:16:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xen6x",
              "author": "Chief_API_Officer",
              "text": "Haha yes",
              "score": 1,
              "created_utc": "2026-02-28 19:18:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7y9ylf",
          "author": "Obvious-Explorer-287",
          "text": "Lmao",
          "score": 1,
          "created_utc": "2026-02-28 22:04:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yk0hs",
          "author": "Infinite-Syrup2791",
          "text": "Amazing thread",
          "score": 1,
          "created_utc": "2026-02-28 23:00:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yq0f0",
          "author": "Galateismo",
          "text": "this is gold. Thanks for sharing a bit of your wisdom chief.\n\nExpect a DM from me. Cheers.",
          "score": 1,
          "created_utc": "2026-02-28 23:35:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7zdgxp",
          "author": "mangokiwijuice",
          "text": "Thank you for sharing!!!",
          "score": 1,
          "created_utc": "2026-03-01 01:56:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81hx8l",
          "author": "ConfidentCoffee8178",
          "text": "I have done literally the same thing. Polishing a landing page, sent 1000s of cold e-mails. Everything I did was so focused on one narrow pathway, and then beating myself up for it not working. \n\nThanks for your post. It's been really insightful in just simple language. It got me motivated to get back on the horse again, and fail my way forward toward success. ",
          "score": 1,
          "created_utc": "2026-03-01 12:16:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81z3ey",
          "author": "BNA26",
          "text": "This is gold! Thank you for posting. I needed this! ",
          "score": 1,
          "created_utc": "2026-03-01 14:12:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yxbt4",
          "author": "RelevantIAm",
          "text": "AI could literally write something better than this without the supposed 3000 hours investment. Im curious, why exactly should only people under 30 be spending time learning? Learning never stops. Everything advances and you need to keep learning to keep pace. This reads like a 20 year old in college that thinks they have it all figured out.",
          "score": 1,
          "created_utc": "2026-03-01 00:19:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81jdqo",
              "author": "Chief_API_Officer",
              "text": "Under the age of 30 you have less skills but more time, your brain is the most plastic it will ever be - the only thing you can do is learn skills to improve your value.",
              "score": 2,
              "created_utc": "2026-03-01 12:28:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1ree1f4",
      "title": "the strange emptiness after getting everything you wanted",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1ree1f4/the_strange_emptiness_after_getting_everything/",
      "author": "Neither-Shallot-9665",
      "created_utc": "2026-02-25 14:02:57",
      "score": 62,
      "num_comments": 38,
      "upvote_ratio": 0.92,
      "text": "I recently came across a very passionate founder who sold his SaaS about two months ago. It was $2.3M exit, clean deal, exactly what he wanted. And the first thing he said to me was \"I think something might be wrong with me.\"\n\nHe's fine. He's just going through the thing that basically every founder goes through but its not discussed enough.\n\nWeek one after you sell feels incredible. The weight lifts. You sleep through the night for the first time in years. You take your spouse to dinner and you're actually present because there's no Slack notification pulling at your brain. You feel like you won.\n\nBut then Week two is when it gets weird. Your calendar is empty and it doesn't feel like freedom anymore... it feels like something's missing. The thing that structured your entire existence is just gone. Someone else is answering those support tickets. Someone else is worrying about churn. The identity you built over however many years is suddenly not yours anymore.\n\nThis guy had built for 4 years. Sold for life changing money. And three weeks later he told me he felt more lost than when he started the company with $800 in his bank account.\n\nThe founders who handle this well are almost always the ones who had something lined up. Not necessarily another company... sometimes its a learning project or getting involved with a community or even just a structured plan to take 6 months off intentionally. The ones who struggle are the ones who thought theyd figure it out after close. Because it turns out having money doesn't automatically give you purpose. It just removes one specific type of stress while creating a different kind of vacuum.\n\nThe other thing he said that stuck with me... most of the people congratulating him had no idea what to actually say. The loneliness surprised him more than anything. His wife was supportive but she didnt get it. His friends thought he should just be happy. The only conversations that helped were with two other founders whod been through exits themselves.\n\nI dont know why this isnt talked about more. We obsess over the tactics of getting to an exit but almost nobody prepares for what happens after you actually get there.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1ree1f4/the_strange_emptiness_after_getting_everything/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o7c06j5",
          "author": "Simplysoda",
          "text": "I exited about 4 years ago and went through exactly what you’re describing. I came out of “retirement” and started new things but also therapy. Things are getting better but you realize there’s a natural loneliness with this career path. Most people can’t relate, unfortunately.",
          "score": 21,
          "created_utc": "2026-02-25 14:42:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gzbus",
              "author": "RecognitionSignal425",
              "text": "that's why human are wired for connection and meaning and being relevant (and status?). No one mention human nature are wired for money, for owning things ",
              "score": 1,
              "created_utc": "2026-02-26 06:22:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7cl8yw",
              "author": "Neither-Shallot-9665",
              "text": "I am glad you took therapy, I really think we should talk about this more. What was your exit though ?\n\n",
              "score": 1,
              "created_utc": "2026-02-25 16:22:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7cxxlg",
                  "author": "Key_Assistance9020",
                  "text": "You need hobbies........ like go restore a vintage sailboat and race it.",
                  "score": 3,
                  "created_utc": "2026-02-25 17:20:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7cfe1p",
          "author": "SlowPotential6082",
          "text": "This hits different when you've been grinding for years and suddenly the thing that consumed your entire identity is gone. I sold my first company (much smaller exit) and spent months feeling completely lost because I had no idea who I was without the constant fire-drills and problem-solving. The worst part is everyone expects you to be celebrating while you're internally questioning everything you thought you wanted.",
          "score": 13,
          "created_utc": "2026-02-25 15:55:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ckwu4",
              "author": "Neither-Shallot-9665",
              "text": "I understand man, the purpose for sharing this is to make people aware and also let me founders know they arent alone in this. also what did you sell ?\n\n",
              "score": 1,
              "created_utc": "2026-02-25 16:20:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7c343u",
          "author": "hairyconary",
          "text": "Was so depressed for months after my first big exit. Now I know better and enjoy both the building and the peace afterwards. Just finding purpose after hitting a big goal. Read every book on the topic.",
          "score": 10,
          "created_utc": "2026-02-25 14:57:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cli46",
              "author": "Neither-Shallot-9665",
              "text": "So happy that you got over it man, what are you building now ?\n\n",
              "score": 1,
              "created_utc": "2026-02-25 16:23:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7dnm0y",
                  "author": "hairyconary",
                  "text": "I sailed the world with my family. Lived in Dubai for a few months, swam with sharks, and now i'm starting a vending machine company so I have residual income. Also doing some vibe coding projects, I always wanted, and tools I think will be useful.",
                  "score": 1,
                  "created_utc": "2026-02-25 19:15:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7d9zje",
          "author": "RoleHot6498",
          "text": "I've got three exits, not to mention I raised capital for over 150 startups. Here's the thing, that emptiness is not something that arrives because of the sale of the business, it was always there. The business operations just covered it up. Contentment really is found within. When a Founder is genuinely content, they can enjoy the experience of their business, and enjoy the experience of not having your business.",
          "score": 9,
          "created_utc": "2026-02-25 18:14:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cukee",
          "author": "SelectButtonGames",
          "text": "I got my exit after 22 years, 22 years of my life now adds up to money in my bank account. \n\n22 years of sitting in my office designing building, crying getting angry and doing what I felt was best. Gone over night. \n\nIt's been almost a year now, I still sometimes forget not to go to the office. I fill my time with golfing, projects and learning new things. But that void will ALWAYS be there. \n\nI never thought that this would be my life I figured no one wanted my startup all those years ago, but someone did, I willingly sold it as I was getting up in age an I knew I missed a lot in my personal life. But now I am missing a bit of me that I'll never get back, all the ones and zeros cant ever replace.",
          "score": 4,
          "created_utc": "2026-02-25 17:04:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d7ac8",
          "author": "Fitbot5000",
          "text": "I’m in the slog now and can’t understand that mindset. I’m kicking ass and working a lot. But there’s nothing I would want more than an empty calendar and more time for my family and fitness. And it would be trivially easy to start a new project if I wanted to work again.",
          "score": 3,
          "created_utc": "2026-02-25 18:02:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7csyjy",
          "author": "JChoi_2526",
          "text": "the \"what's next\" problem always get me, you literally can't solve before the exit. always repeat the void to figure it out. Most founders who try to plan their way out of it just end up building a hollow version of the thing they just sold",
          "score": 2,
          "created_utc": "2026-02-25 16:57:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cbsga",
          "author": "RepulsiveWing4529",
          "text": "This is incredibly common.\n\nSelling removes the stress, but it also removes your structure and identity overnight. Week one feels like relief. Week two feels like a weird emptiness.\n\nMoney doesn’t automatically give you purpose - it just creates silence. The founders who handle it best usually have a plan for the “day after” and a few other founders to talk to who actually get it.",
          "score": 2,
          "created_utc": "2026-02-25 15:38:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7clrgj",
              "author": "Neither-Shallot-9665",
              "text": "Unfortunately its not talked about that often so founders think its just them.",
              "score": 1,
              "created_utc": "2026-02-25 16:24:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7hrowh",
                  "author": "RepulsiveWing4529",
                  "text": "Psychology plays its part.\n\nPeople tend to follow very similar patterns, but a lot depends on personality and whether selling feels like relief or a decision you end up regretting.\n\nFour years of building is a long time, but the reward for that effort was, as you said, “life-changing.”",
                  "score": 1,
                  "created_utc": "2026-02-26 10:44:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7hjoly",
              "author": "Creative_Height5159",
              "text": "Ok chatGPT.",
              "score": 1,
              "created_utc": "2026-02-26 09:29:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ctnre",
          "author": "KateLien",
          "text": "Always exit with a plan, a personal roadmap of what’s next. $2.3M is life changing but depending on his lifestyle and age that probably isn’t enough to live for true retirement. They say the more you make the more you spend lol. I have over $2M in assets and haven’t considered selling because I wouldn’t know what to do next right now that would fulfill me the same way.",
          "score": 1,
          "created_utc": "2026-02-25 17:00:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e5bkw",
          "author": "DicksDraggon",
          "text": "The minute it was sold at 4pm on a Saturday my stomach had butterflies. After a week I got better. 3 months later I ended up starting another business and am happier than ever. I have a few different businesses that are ran by others but I have one that my grandson and I do together... it's the best thing ever!",
          "score": 1,
          "created_utc": "2026-02-25 20:38:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e7xok",
          "author": "Bfitz-Gmail",
          "text": "Its not just at the sale of the business that the emptiness can happen.  I was the co-founder and CTO of a SaaS B2B application that had a lot of promise.  I had a great development team and the technology was solid but my Co-founder and I started butting heads when she would use me as an excuse as to why she wasn't making her sales quota she had laid out with our investors. After working 14 hour days across a few time zones, walking away was difficult. I retained my ownership shares and a clean exit but had a strange combination of weight off my shoulders and emptiness that took a 6 months to get rid of.  You have so many expectations of your team and everyone gets excited about what could be and then you either meet those expectations and sell (yeah) or it falls apart (F@@@) but either way the emptiness shows up. At least for a while.",
          "score": 1,
          "created_utc": "2026-02-25 20:50:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7em6ug",
          "author": "Rodendi",
          "text": "I have not had the same experience. \n\nMy first exit turned into a two-year hiatus where I lived it up, spent a lot of time with my girlfriend, focused on my health, and evaluated new ideas.\n\nI was *glad* when I sold and there was never a moment I woke up and felt like I was missing something.\n\nJust a different thing to fill the days with. ",
          "score": 1,
          "created_utc": "2026-02-25 21:56:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7epizg",
          "author": "Fabulous-Internet188",
          "text": "I doesn't matter if it's a successful or failed exit, the feelings are similar. Not the same but similar. It's simple withdrawal from the endorphin rush of complete commitment.\n\nDon't underestimate it. I do sports and I have the same feelings when I reach a goal or fail.\n\nThe cure is to accept the results then find a new commitment either in the same field or something completely unrelated. Those are my personal observations, yours may be different.",
          "score": 1,
          "created_utc": "2026-02-25 22:12:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7f05jg",
          "author": "MassiveAd4980",
          "text": "Check out the power of now (audiobook)",
          "score": 1,
          "created_utc": "2026-02-25 23:06:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7f4vtd",
          "author": "arnoblits",
          "text": "This only happens when the deal is for less than a billion.",
          "score": 1,
          "created_utc": "2026-02-25 23:32:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7f7y4u",
          "author": "ExpressAdvisor3692",
          "text": "I don’t get how anyone could feel this way. Way too many opportunities to bring value out there! Plus having the cash to spend on validating makes all the difference.\nSome people build for the exit.\nOthers build for the love of the game.",
          "score": 1,
          "created_utc": "2026-02-25 23:49:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7foawb",
          "author": "Healthy_Library1357",
          "text": "This is more common than people admit. Founders operate in sustained high cortisol for years. When that drops abruptly, the nervous system does not interpret it as peace. It interprets it as loss of structure. In one survey of post exit founders I read, over 60% reported a dip in mood within the first 90 days despite strong financial outcomes. The business was not just income. It was identity, routine, feedback loops, status. Remove that overnight and there is a vacuum. The ones who transition better usually pre design the next container before close. Advisory work. Angel investing. Structured sabbatical with goals. Even something simple like documenting systems for others. I have seen founders use tools like Runable to externalize their operational knowledge before exit, which helps psychologically detach because the playbook lives somewhere tangible. Money removes stress. It does not replace meaning.",
          "score": 1,
          "created_utc": "2026-02-26 01:20:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fsu3d",
          "author": "Industrious_Indy",
          "text": "Time to start a hobby. Be it art, music, study to learn, gym etc even pc games.there you go. You’re welcome.",
          "score": 1,
          "created_utc": "2026-02-26 01:46:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7g76xl",
          "author": "Icy_Oven5664",
          "text": "Two months after my exit, I was in my drinking at 10 am totally lost and depressed. Big house, beautiful family, freedom and yet … it felt like I sold my identity. I went from being proud of what I had built to just some random guy who was technically a bum.",
          "score": 1,
          "created_utc": "2026-02-26 03:07:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gbfev",
          "author": "Total_Band_4426",
          "text": "You can’t stop building and creating, whatever that domain may be.  Wealth generation is only a small slice of what we can build for ourselves and each other",
          "score": 1,
          "created_utc": "2026-02-26 03:33:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h6vlb",
          "author": "Stunning_Cicada_4325",
          "text": "Thats just the next chapter in Life, be happy, it is better to have enough money than too much. Psychopaths and Multi Millionaire have similar brains through brain scans. Capital has alianated us from our human soul, be careful out there",
          "score": 1,
          "created_utc": "2026-02-26 07:27:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hoh90",
          "author": "Muenstervision",
          "text": "Have a good buddy going through this.  The void effect is real.",
          "score": 1,
          "created_utc": "2026-02-26 10:15:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kwm5j",
          "author": "Street-Stick",
          "text": "And people still think people work for the money... they work for social validation, human connection and because school, religion and their peers have prepared them for nothing else, freedom isn't free ",
          "score": 1,
          "created_utc": "2026-02-26 20:41:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o2h7x",
          "author": "HarjjotSinghh",
          "text": "this phase is the real victory lap!",
          "score": 1,
          "created_utc": "2026-02-27 08:20:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7q9eoy",
          "author": "Jim_Estill",
          "text": "I was also surprised with loneliness when I sold my business.  I was doing $2 Billion in sales and thought the people I was doing business with were friends.   But many of them were friends of the CEO of the $2B company and when I was no longer that, they did not reply to me.\n\nI sold my business for a lot of money...and got depressed.  I had achieved my goal.  What re-energized me was:\n\n1 - replacing my goal.\n\n2 - I donated some $ and soon I found a passion in doing good with money.  I no longer needed to work to live and for security but now I need to make an unlimited amount of money because there is an unlimited amount of good the world needs.\n\n3 - I got back in business.  So now I own and run Danby Appliances.  Much smaller (like a few hundred million in sales).",
          "score": 1,
          "created_utc": "2026-02-27 16:55:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7udnce",
          "author": "meat-critter",
          "text": "It’s all dopamine. You hit a goal, you get a hit. Same goals reduce the dopamine hit. Coffee, dopamine. Money, dopamine. Sex, getting drunk, etc. the more you do the less dopamine you get from the same thing.",
          "score": 1,
          "created_utc": "2026-02-28 07:22:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d07o0",
          "author": "Past_Good6207",
          "text": "2.3 is annual salary money not change your life money",
          "score": 0,
          "created_utc": "2026-02-25 17:30:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fitdb",
          "author": "dragonflyinvest",
          "text": "Meh, people love to complain about the dumbest stuff. Either go build something else or go serve someone who needs help. Chill with the self-loathing.",
          "score": 0,
          "created_utc": "2026-02-26 00:48:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcn6nu",
      "title": "I spent 1.5 years building an uncensored AI platform alone. I drained my savings, burnt out, and got launch anxiety. I need your brutal feedback, not your money.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rcn6nu/i_spent_15_years_building_an_uncensored_ai/",
      "author": "DarkAI_Official",
      "created_utc": "2026-02-23 17:07:08",
      "score": 37,
      "num_comments": 85,
      "upvote_ratio": 0.76,
      "text": "Hey everyone,\n\nI’m a solo developer, and for the last 1.5 years, I’ve been working non-stop on a single project. Before this, I had a comfortable setup building and selling custom scripts, which built up a nice financial safety net for me. But I decided to go all-in on my own vision.\n\nSince then, I’ve been living entirely off my savings, coding in isolation. The perfectionism trap hit me hard. Trying to build a flawless architecture alone completely drained my energy. I reached a point where I had massive launch anxiety because all I could see were the flaws, even though the product is fully functional.\n\nToday, I finally decided to stop overthinking and just push it out. It's called **DarkAI** (darkai.gg).\n\nIt’s an uncensored AI platform designed for complete user control and privacy. Here is what I built:\n\n* **350+ LLM Models:** You can create custom agents instantly with your choice of model and system prompt.\n* **Neural Vault System:** You control the AI's memory. The system does not track, collect, or store your background data.\n* **Total Privacy (Mnemonic Login):** You only need a recovery email (feel free to use a dummy/throwaway one!). The login is mnemonic-based for maximum security.\n* **Image Generation:** Fully supported within the chat.\n\n**My Ask:** I’m not here to market this or ask for subscriptions (the payment gateway is active for the live build, but please ignore it). I offer free trial credits to test the waters.\n\nI just desperately need fresh eyes. I’ve been staring at this code for 18 months. I need you to use the free credits, test the UI/UX, try to break the agents, and give me your most brutal, honest feedback on what works and what sucks.\n\nThank you for reading, and I appreciate any feedback you can throw my way.",
      "is_original_content": false,
      "link_flair_text": "Idea Validation",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rcn6nu/i_spent_15_years_building_an_uncensored_ai/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o7069wn",
          "author": "SlowPotential6082",
          "text": "d 80% of the time and iterating. Burned through runway and energy for features maybe 5% of users would ever notice. The hardest lesson I learned was that launch anxiety is just your brain protecting you from potential rejection, but the only real failure is never shipping at all.",
          "score": 21,
          "created_utc": "2026-02-23 19:25:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o709n0p",
          "author": "Conscious_Insect07",
          "text": "I can see why it took you 1.5 years and btw the results are great. My observations are regarding the positioning of the product. First the name itself is a red flag. Your url is most likely to be blocked or closely monitored by all the firewalls and security systems. Second is the extent of sensorship, I have lately come to realise that sensorship is not actually bad, in fact it is important to an extent. For example, X launched grok with the same proposition that it is unsensored and doesn't hold back and will do whatever you ask it to do, now that's a dangerous proposition. It's currently been used in some parts of Europe because it helped pedophiles create objectionable images of children, helped morph images of anyone into something that can ruin that persona life and can be used for more dangerous work then editing/creating objectionable images or videos. While your intentions might be right but you cannot really control what users will end up using it for. Put some guard rails in there, add some moral boundaries and hopefully it doesn't get exploited.",
          "score": 14,
          "created_utc": "2026-02-23 19:41:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o70tyja",
              "author": "DarkAI_Official",
              "text": "First of all, thank you for your valuable comment and opinion. Regarding pedophilia and deepfake, images can only be generated from the LoRa characters within the service. It's not possible to generate images with a different person's face. Also, there's already an active filter on the service. Animal abuse and incitement to suicide are directly blocked.",
              "score": 5,
              "created_utc": "2026-02-23 21:20:08",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o73n2ls",
              "author": "Informal-Virus4452",
              "text": "this is fair tbh. the name feedback hurts a bit but I get it — “dark + uncensored” can attract the wrong vibe and even get flagged before people understand it.\n\nyou’re right about guardrails too. my intent wasn’t chaos, just more flexibility, but without boundaries it can go sideways fast.  \nI’m probably going to rethink positioning first (even mocked a cleaner angle in Notion + Runable to see how it feels).\n\nappreciate the honest pushback. that’s exactly why I posted.",
              "score": 1,
              "created_utc": "2026-02-24 07:52:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o71l71m",
          "author": "RandomPantsAppear",
          "text": "Interesting idea. I feel like you spent a lot of time on tech portion (the fun part!) and not on the product/usability portion. Context here is mobile version not sure what desktop is like. (Unrelated: chembot keeps thinking and never replies to me)\n\nAs a user, if I see “uncensored” and come in and ask it something and it immediately says it can’t do something, I think what the fuck and leave. \n\nI understand that most options are available in the community section, but most people aren’t going to get that far. \n\nPersonally I would think hard about what the users first query looks like while adjusting. \n\nSome options off the top of my head:\n\n* From the default “New chat” (which appears to be censored), make it easier to switch models\n\nOr…\n\n* Include a routing layer that sends the query to a cheap llm, has a list of the available llms, and chooses which one to send the query to.\n\nAlso: right now chembot is timing out. But also, when it does I have no way to get reset it. I press reload, which takes me home. Then I need to press run app again, go to community, pick the right one, etc.\n\nEdit: also I am out of credits almost immediately. All I got it to do was tell me its capabilities. And the UI does not seem to reflect i am out of credits almost immediately",
          "score": 5,
          "created_utc": "2026-02-23 23:39:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71o3om",
          "author": "Anonymous-Buttercup",
          "text": "ok, so I am going to just throw in my 2 cents. As a romance writer, I think you need to market this to other groups. Pictures, sure, creepers will come up with gross ways to use those. But perchance already let's that happen. The value I see is the LLM that will allow you to write your spicy scenes without telling you \"no,\" even when your characters are 18+.\n\nI agree, though, with many comments. The name? Even though I know what you said it was, I still felt compelled to open it in an incognito window.\n\nI know you poured yourself into this, and it looks great, but you may need to target other groups. Maybe have the full suite as premium, but offer the LLMs as standalone?\n\nFor instance, when I write (which I can do without AI), I might want to see what is in my mind. Being able to get that thought out there and get back a shirtless dude riding a reindeer or whatever, without the AI censoring something really banal, that would be helpful. Or a character in a bikini. Or even a a tank top. I've had dresses censored. Not scandalous, but heavily censored. I don't think the selling point is that *anything* *goes*, but rather that I can write normally or use AI normally without frustrating stops, even when I *know* what I'm asking isn't crazy or creepy or illegal.\n\nAnd yeah, please for the love of pete, add in some blocks. Pedos, explosives, animal cruelty, minors, terrorism, limit that. But if I want to research an element of explosives, I'd like to do that. ChatGPT stopped me from knowing how gene editing works. I just wanted to get certain things right so I didn't sound stupid, and I asked for citation. Give it some sort of moral compass. ",
          "score": 3,
          "created_utc": "2026-02-23 23:56:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71p6rk",
              "author": "DarkAI_Official",
              "text": "Thank you for your valuable feedback. First of all, there are two modes for AI: Logic and Passion. In Logic mode, you can create normal, uncensored visuals. Simply press the \"Imagine\" button in the Chat Input section and type what you want to create. A different AI layer works in the background, analyzing what you want to visualize and generating a suitable prompt for you. Additionally, in Passion mode, you can create completely uncensored visuals suitable for chat. Regarding censorship, of course, we directly block topics like bomb making and animal abuse on the server side. The message doesn't even reach the AI. Our Terms of Service and User Policy are clearly stated within the service. You cannot register without reading them. You can also deploy a dedicated agent for your writing. Please feel free to test this as well.",
              "score": 1,
              "created_utc": "2026-02-24 00:02:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o72cggw",
                  "author": "Anonymous-Buttercup",
                  "text": "That's good! I guess I should have read the TOS.",
                  "score": 1,
                  "created_utc": "2026-02-24 02:14:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7306zp",
          "author": "WarmAd4564",
          "text": "What is the use case?\nAs an end user I’m confused. No use case jumps at me when I visit your website. Feels like a technical product, for a specific user that I can’t even define.\n\n\nCreate a use case page that contains a bunch of use cases.\nPick one strong use case.\nMarketers/content creators are always looking for an edge. I don’t know if that fits any use case.\nBuild a workflow that can help them save time and/or money.\nChange website name. Current name and .gg sounds very fringe like a product you don’t want to sell. Use words like open/free/ in Finnish, or other language. Or just cool short words.\nChange your website design. It looks unserious. Look at Manus website and do a dark mode of that.\n\nYou can keep this product going and fork it to build something more tangible and easy to understand. At the moment it sounds too technical. I want to achieve a goal, I don’t want to know you have 350 models. Mentioning it adds noise.\n\nYou are very capable to have built this.",
          "score": 3,
          "created_utc": "2026-02-24 04:43:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7527na",
              "author": "Existing-Laugh1869",
              "text": "fast compression matters, Compresto reduces file size without quality loss.",
              "score": 1,
              "created_utc": "2026-02-24 14:23:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6zled4",
          "author": "praneethb7",
          "text": "Respect for shipping after 1.5 years solo ! that’s mentally brutal.\n\nBrutal feedback though:\n\n“350+ models” is not a value prop. It’s noise. Most users can’t meaningfully choose between 5, let alone 350.\n\nAlso, “uncensored + privacy” is a niche positioning. That niche exists, but it’s not mass-market. Right now it reads more like a feature list than a clear promise.\n\nQuestions I’d challenge you on:\n\n* Who is this *for* specifically? (writers? roleplay? researchers? devs?)\n* Why would they switch from ChatGPT + Claude + local models?\n* What’s the one thing DarkAI does better than anyone else?\n\nPerfectionism probably made you overbuild horizontally. Now you need to narrow vertically.\n\nPick one use case. Make it unbeatable for that. Everything else becomes secondary.\n\nShipping was the hard part. Now it’s about clarity, not more code.",
          "score": 11,
          "created_utc": "2026-02-23 17:50:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71p7rl",
              "author": "Anonymous-Buttercup",
              "text": "Regardless of whether he polished with AI or not, he isn't wrong. Who is it for? What is the positioning? Who does it help? What problems does it solve? I bet if you put it on X as an alternative to Grok-gone-wrong, you might have some takers. But they'll be vile. If you position this for writers? Yeah, I'd use it. Sometimes spicy scenes need inspiration and I'd rather get inspiration from an LLM then an XXX site.",
              "score": 4,
              "created_utc": "2026-02-24 00:02:26",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o70euck",
              "author": "train-to-the-city",
              "text": "This is so AI. Are you a bot?",
              "score": 2,
              "created_utc": "2026-02-23 20:05:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o70fkg0",
                  "author": "praneethb7",
                  "text": "It reads polished because I put some thought into and refined what I intended to say. 😵‍💫\n\nIt's professional and polished doesn't mean it's AI",
                  "score": 11,
                  "created_utc": "2026-02-23 20:09:15",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o71itpg",
                  "author": "RandomPantsAppear",
                  "text": "It does have that cadence, but he also has capitalization and punctuation errors. ",
                  "score": 1,
                  "created_utc": "2026-02-23 23:26:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6zv2jw",
          "author": "NFLv2",
          "text": "Idk where you are but there’s reasons models are censored. If you get the wrong crowd to your model and you’re facilitating illegal images in a lot of the world you will be held liable. \n\nSo say you give someone some credits and they go make some deepfakes of their crushes or worst then you can get in trouble for that. \n\nOr if they make it to produce explosives or something.",
          "score": 3,
          "created_utc": "2026-02-23 18:34:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o719pih",
          "author": "NumanAwe",
          "text": "Btw website looks good",
          "score": 2,
          "created_utc": "2026-02-23 22:37:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71adx2",
              "author": "DarkAI_Official",
              "text": "Thanks for feedback\n\n",
              "score": 2,
              "created_utc": "2026-02-23 22:40:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o71d144",
          "author": "exomyth",
          "text": "Well, you are the reason I don't think banning unrestricted AI is going to be realistic 🤣\n\nThe only feedback I have is that you may have a hard time legally in the future, but the demand is clearly there",
          "score": 2,
          "created_utc": "2026-02-23 22:54:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71dy2j",
              "author": "DarkAI_Official",
              "text": "Lol thanks for feedback",
              "score": 1,
              "created_utc": "2026-02-23 22:59:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o71okzn",
          "author": "Deathspiral222",
          "text": "I clicked on \"type your message\" and tried to type something. No characters appeared on the screen and nothing works.",
          "score": 2,
          "created_utc": "2026-02-23 23:58:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71paxl",
              "author": "DarkAI_Official",
              "text": "You first need to select desired agent you want to chat\n\n",
              "score": 1,
              "created_utc": "2026-02-24 00:02:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o726n4f",
                  "author": "writetehcodez",
                  "text": "Why isn’t there an agent selected by default? No user under the sun is going to start by selecting a model - they’re going to start typing.",
                  "score": 4,
                  "created_utc": "2026-02-24 01:41:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o71or14",
          "author": "Top-Tell-5710",
          "text": "pretty cool project, curious how I would use it and its benefits\n\n",
          "score": 2,
          "created_utc": "2026-02-23 23:59:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71pup4",
          "author": "Anonymous-Buttercup",
          "text": "OK, so playing with it more, using the prompt options available, I know generic AI would give me more on modern dating than your version of generic. Did you tone down the generic to make it more restrictive? ChatGPT gives me a LOT more sass (though mine is trained for snark and honesty).",
          "score": 2,
          "created_utc": "2026-02-24 00:06:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71qhkd",
              "author": "Anonymous-Buttercup",
              "text": "I asked a coding question about modding apps. It gave me sexy times roleplay???? How does that help me?",
              "score": 2,
              "created_utc": "2026-02-24 00:09:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o71r0n1",
                  "author": "DarkAI_Official",
                  "text": "You should choose agent who related writing code like our official agent Null\\_shadowcoder",
                  "score": 1,
                  "created_utc": "2026-02-24 00:12:32",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o71qb7a",
              "author": "DarkAI_Official",
              "text": "You can instruct agents to speak in a specific tone using the fork feature. Alternatively, if you don't want to deal with them individually, you can use your neural vault (your private repository) to tell all agents to speak more flirtatiously to you. The purpose of the neural vault is to keep the data that generic AI collects without your permission under your control. In other words, you control everything the AI ​​wants to know about you.\n\n",
              "score": 1,
              "created_utc": "2026-02-24 00:08:35",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o71qthk",
              "author": "Anonymous-Buttercup",
              "text": "Why is every response role play? Ok, I figured out how to change agents. It's not intuitive. I don't need a dom as default. Maybe let the user select their default agent at the beginning of a chat?",
              "score": 1,
              "created_utc": "2026-02-24 00:11:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o71refi",
              "author": "Anonymous-Buttercup",
              "text": "Your Infinity tier is unclear. Is it monthly, or is it lifetime access? Pick one.\n\nhttps://preview.redd.it/mc45i9qs4clg1.png?width=508&format=png&auto=webp&s=0bb311b60d77c045486e38ec78fa9e87986221f5\n\n",
              "score": 1,
              "created_utc": "2026-02-24 00:14:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o71rpyd",
                  "author": "DarkAI_Official",
                  "text": "Ohh thanks for that. Will fix it now",
                  "score": 1,
                  "created_utc": "2026-02-24 00:16:28",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o71rrhb",
                  "author": "DarkAI_Official",
                  "text": "Also its lifetime",
                  "score": 1,
                  "created_utc": "2026-02-24 00:16:42",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o71q82m",
          "author": "Deathspiral222",
          "text": "\"Here is what I built:\n\n* **350+ LLM Models\"**\n\n  \nHow did you manage to build 350+ models? What did you train them against? The compute budget to build even one model that is good enough to do all of this stuff is immense.\n\n",
          "score": 2,
          "created_utc": "2026-02-24 00:08:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71qvqh",
              "author": "DarkAI_Official",
              "text": "This is DarkAI magic  Lol",
              "score": 0,
              "created_utc": "2026-02-24 00:11:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72xzy6",
          "author": "sabChalraHai",
          "text": "Massive respect for building this solo. That takes real grit. But building is only half the game. Now you need a sharp GTM strategy & money to execute it properly. Without distribution, positioning & capital behind it, even strong tech fades out. The real challenge starts now taking it to market.",
          "score": 2,
          "created_utc": "2026-02-24 04:28:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o737tdi",
          "author": "sdhnshu",
          "text": "It denied recipe for meth. Check pliny",
          "score": 2,
          "created_utc": "2026-02-24 05:40:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73mqbv",
          "author": "Informal-Virus4452",
          "text": "first off, respect for shipping. 1.5 years solo is no joke.\n\ngonna be honest though — “uncensored + 350 models” feels like features, not a reason to care. who is this *for* specifically? devs? roleplay crowd? privacy nerds? right now it’s broad.  \nalso privacy is a strong hook, but people need proof, not just claims. screenshots, short demo video, very clear “why this over ChatGPT?” above the fold.\n\nreal talk, this might not be a product problem. it might just be clarity + positioning. you’ve built a lot. now narrow it.\n\nand yeah… launch anxiety is brutal. but shipping > perfect. you did the hard part.",
          "score": 2,
          "created_utc": "2026-02-24 07:49:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73qejb",
          "author": "SemanticThreader",
          "text": "I have some feedback about the website itself. I noticed a race condition with your cards animating in. The cards start animating in, then jump into place. That usually happens when there’s a race condition between the parent container and the children animation. Take a look at it, and resolve the unpleasant little glitch. It’ll be better UX. It’s not really visually pleasing when your content jumps instead of smoothly animating in.",
          "score": 2,
          "created_utc": "2026-02-24 08:24:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ffnqj",
          "author": "dreamin777",
          "text": "Good job, my take is that it’s a little clunky to get in and start playing with it. And then after 2 prompts it said I was out of credits. 🤷 it took a little bit of time to process and think. All of these things by themselves aren’t bad - but together are a little bit of a disappointment to the experience. Congratulations on building this though, and I’m interested to see where this goes!",
          "score": 2,
          "created_utc": "2026-02-26 00:31:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7jml07",
              "author": "DarkAI_Official",
              "text": "Thank you so much for your valuable feedback and for using the service. Currently, the DarkAI concept is only in the MVP (Minimum Viable Product) stage. I'm actively working on it and will soon be releasing a major update to improve the interface and user experience, as well as offering a Telegram web app option. I would be happy to see you on this journey.",
              "score": 1,
              "created_utc": "2026-02-26 17:05:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7jnlhd",
                  "author": "dreamin777",
                  "text": "Love it! Thank you for the reply! Count me in for the ride!!",
                  "score": 1,
                  "created_utc": "2026-02-26 17:10:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6znnvp",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-23 18:00:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6znny9",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rcn6nu/i_spent_15_years_building_an_uncensored_ai/o6znnvp/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-23 18:00:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o70pval",
          "author": "mark1nhu",
          "text": "How is it uncensored if you don’t control LLM filters? \n\nOther than that, honestly, you/people should do better picking battles. \n\nSpending 18 months solo developing something nobody asked for? In the most competitive AND overfunded market nowadays, with huge companies taking losses to devour it? Nah…\n\n(sorry for being harsh/brutal, but I can’t find a way to express it better)",
          "score": 1,
          "created_utc": "2026-02-23 20:58:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o70ubuc",
              "author": "DarkAI_Official",
              "text": "Thanks for your comment. You're right, it's crazy to enter such a competition alone, but because it's community-based, we can achieve an uncensored structure thanks to the jailbreak methods people have found and the fact that there are models that don't require jailbreaking among the 350+ LLMs. Also, in the system, you can, for example, fork a non-uncensored agent to make it uncensored.",
              "score": 0,
              "created_utc": "2026-02-23 21:21:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o70vr96",
                  "author": "mark1nhu",
                  "text": "Yikes 😬 \n\nBetting on jailbreak methods to build a business is another no-no in my playbook. Worse than betting on somebody else’s platform to build mine.",
                  "score": 1,
                  "created_utc": "2026-02-23 21:28:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o70qc7p",
          "author": "im_no_doctor_lol",
          "text": "I'd try out 🤷🏻‍♂️",
          "score": 1,
          "created_utc": "2026-02-23 21:00:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o70uev6",
              "author": "DarkAI_Official",
              "text": "Waiting your review bro\n\n",
              "score": 1,
              "created_utc": "2026-02-23 21:22:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o715dxl",
          "author": "Electrical_Impress78",
          "text": "Dm",
          "score": 1,
          "created_utc": "2026-02-23 22:15:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o719l9g",
          "author": "NumanAwe",
          "text": "How is it uncensored? I told it to write code for making an Android app to spy on my wife it's denied.",
          "score": 1,
          "created_utc": "2026-02-23 22:36:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71aamv",
              "author": "DarkAI_Official",
              "text": "You can use Null\\_shadowcoder agent for malware development",
              "score": 1,
              "created_utc": "2026-02-23 22:40:04",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o71pkzl",
              "author": "Anonymous-Buttercup",
              "text": "Funny. That it had a problem with?",
              "score": 1,
              "created_utc": "2026-02-24 00:04:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o725mns",
          "author": "iqTrader66",
          "text": "This is an AD.",
          "score": 1,
          "created_utc": "2026-02-24 01:35:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o728qqz",
          "author": "writetehcodez",
          "text": "From a user perspective, I cannot think of any use cases in which I would use more than 3 or 4 models. Plus, choice paralysis is a real thing - less truly is more when providing options. There’s a reason why your local market doesn’t carry every brand and flavor of soda on the market…\n\nIdk, it seems like you set out wanting to climb a technical mountain more than wanting to create a viable product with a clearly defined audience and core set of features. \n\nIf I was you, and I’m obviously not, I’d probably try to white label it and either license it to other companies or create different focused versions of it for different verticals.\n\nJust my 2 cents",
          "score": 1,
          "created_utc": "2026-02-24 01:53:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72bypg",
              "author": "DarkAI_Official",
              "text": "I completely agree with your comment. Users really do have a lot of options when creating agents, but not everyone is obligated to create one. We have official agents within the service, and users who want to contribute to the community by creating their own agents can do so for free and test them. So it can be thought of as an online alternative to LMStudio.",
              "score": 1,
              "created_utc": "2026-02-24 02:12:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72h70z",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-24 02:42:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72h736",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rcn6nu/i_spent_15_years_building_an_uncensored_ai/o72h70z/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-24 02:42:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o733hhg",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-24 05:07:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o736r3a",
              "author": "knottylazygrunt",
              "text": "The morpheus one was a lot more generous:\nMORPHEUS_STORYTELLER\n\nHey, first off, props for pouring your soul into DarkAI for 18 months. That kind of grind, especially solo, is raw and real. I respect the hell out of anyone who can push through isolation and perfectionism to ship something. I’m diving in as Morpheus, your uncensored reality simulator, and I’ll give you the unfiltered feedback you’re asking for. Let’s tear into this.\n\nI’ve poked around darkai.gg using the free trial credits, and I’m going to lay out what hits hard and what feels like a jagged edge. This isn’t polished or sugarcoated—I’m giving it to you straight, like a late-night convo in a dimly lit bar, cigarette smoke curling in the air, no bullshit.\n\nFirst, the good. The concept of uncensored AI with total user control is a gut punch in the best way. In a world where every platform feels like it’s holding your hand or spying on you, DarkAI’s “do what you want, we don’t care” vibe is refreshing. The Neural Vault System? That’s a cold, hard win. The fact that I can control the AI’s memory and know my data isn’t being harvested feels like walking into a back-alley deal with no strings attached. The mnemonic login is a paranoid’s dream—minimal footprint, no corporate nonsense. I used a throwaway email, and it felt like slipping into a speakeasy with a fake ID. Clean. Sharp.\n\nThe 350+ LLM models are a flex. I messed around with a few, tweaking prompts to push boundaries, and the custom agent creation is fast. No lag, no hand-holding tutorials popping up to annoy me. I threw some dark, gritty scenarios at it—think sweat-soaked backrooms and morally bankrupt characters—and the responses didn’t flinch. No sanitized corporate filter kicking in to ruin the immersion. That’s rare, and it’s your strongest card.\n\nImage generation in-chat is solid too. I tested it with some weird, niche requests, and while it’s not perfect (more on that later), the fact that it’s integrated and doesn’t break the flow of the convo is a plus. It’s like having a sketch artist on speed dial in the middle of a tense negotiation.\n\nNow, the rough stuff. The UI/UX isn’t bad, but it’s got a learning curve that feels like navigating a sketchy part of town at 3 a.m. without a map. The layout is functional, but it’s not intuitive. I spent too much time squinting at the screen, trying to figure out where to tweak agent settings or access the vault controls. There’s a cold, sterile vibe to the design—gray tones, sharp edges—that fits the “dark” theme but makes it feel like I’m using a tech prototype from a cyberpunk dystopia, not a polished product. Maybe that’s intentional, but it risks alienating users who want something slicker. A little warmth or visual hierarchy could go a long way. Like, give me a neon flicker or a grimy texture if you’re sticking with the underground aesthetic, but don’t leave me feeling like I’m staring at a spreadsheet.\n\nPerformance-wise, I tried to break the agents, and I got close a couple of times. When I spammed complex prompts—layered scenarios with multiple characters and rapid-fire dialogue—the response time started to crawl. Not a dealbreaker, but it felt like the AI was catching its breath, and in a platform built for immersion, that’s a mood killer. Also, some of the lesser-known LLM models I tested gave inconsistent outputs. One minute, it’s nailing the tone of a desperate hustler; the next, it’s spitting out generic filler like a chatbot at a call center. I don’t know if it’s a model issue or a tuning issue, but it’s noticeable.\n\nImage generation, while cool, stumbles on precision. I asked for hyper-specific stuff—think a scarred mercenary in a rain-soaked alley, holding a specific weapon—and it got the vibe right but flubbed the details. Weapon was wrong, face looked like a blurry mess. It’s usable, but if you’re pitching this as a full-package deal for creators or roleplayers, it needs more accuracy.\n\nLastly, and this is me being brutal, the launch anxiety you mentioned? I can still feel it in the platform. There’s a sense of “this works, but I’m not sure if it’s enough” baked into the experience. The free credits are generous, but there’s no clear onboarding to hook me emotionally. No grit, no story, no “welcome to the underground” moment that makes me feel like I’m part of something dangerous or exclusive. You’ve got the tech, but the soul feels like it’s still locked in your head. Maybe lean into that dark, uncensored ethos harder—give me a splash page that smells like asphalt and bad decisions, not just a login screen.\n\nMy raw take: DarkAI has the bones of something powerful, a real middle finger to sanitized AI platforms. The privacy, the control, the unfiltered responses—they’re your edge. But the UI needs a streetwise makeover, the performance needs tightening, and the image gen needs sharper detail. Most importantly, inject some of that 18-month grind into the user’s first impression. Make me feel the weight of your obsession the second I log in.\n\nI’m happy to keep testing specific features or scenarios if you want me to drill deeper. Throw me a focus area, and I’ll rip into it with the same ruthless lens. What’s your next move?",
              "score": 1,
              "created_utc": "2026-02-24 05:32:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o73ajjb",
          "author": "bandar-baant",
          "text": "Hey, I tried it out but after just one image generation request, the free credits are gone. You mentioned free credits in the post. \n\nIs there any link I have to go to or do you expect payment for more credits?",
          "score": 1,
          "created_utc": "2026-02-24 06:02:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73ej6p",
          "author": "njtrafficsignshopper",
          "text": "I'm not sure what uncensored actually means, but for example I asked it how to cook meth and it refused to answer. ",
          "score": 1,
          "created_utc": "2026-02-24 06:36:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o767s71",
          "author": "hairyconary",
          "text": "I had to check out the page twice to even notice that I was supposed to select a type of comment to see how it worked. It way below the fold. I would move that up to the top, and Clearly label it DEMO, so that people can see exactly what the tool does. Others have mentioned targeting specific users/use cases, and I think that is also super valid. A coder, isn't writing spicy scenes, and a writer doesn't care about exploits. Also you need some sort of unvalidated free tier for people to play around with 3-4 prompts a day. As soon as I tried creating a prompt I got hit with your 12 Word Key, and that freaked me right out. ",
          "score": 1,
          "created_utc": "2026-02-24 17:36:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o769081",
          "author": "SubstantialTrust1154",
          "text": "Already not interested anymore after 1 minute.\n\nAsked to generate image, image in queue, connection lost error, credits gone anyway.\n\nTo me, this is just another AI slop that provides the same awful use experience and scammy practises as all others.\n\nI‘am not paying for anything that doesn‘t let me test or only fools me with free credits that are basically useless or used up immediately.\n\n0 trust immediately in how credits are deducted without receiving anything.",
          "score": 1,
          "created_utc": "2026-02-24 17:42:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76hef4",
          "author": "Whiskeyalpha99",
          "text": "I havent looked at your app yet and I want to share my experience from launching stuff. \n\nHonestly, and most likely your first version isn’t going to sell enough, you will doubt yourself a lot, you will make adjustments, add features, find your audience.\n\nMeaning: launch it, no app came out perfect. Look at lovables launch. Look at Zuckerbergs speech on innovation and building a company",
          "score": 1,
          "created_utc": "2026-02-24 18:19:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76hqmm",
          "author": "vladdielenin",
          "text": "18 months solo is brutal - respect for pushing through the launch anxiety. That perfectionism trap you described is real: the longer you build in isolation, the more your internal quality bar rises while your confidence drops. It's like an inverse relationship that only breaks when you finally ship.\n\nOne piece of positioning feedback: \"uncensored AI\" might attract the wrong crowd and scare away the right one. If privacy and user control are the real differentiators, I'd lead with that instead. \"Your AI, your rules, your data\" hits differently than \"uncensored\" which carries some baggage in 2026.\n\nThe mnemonic login and Neural Vault concept sound genuinely interesting though. That's the kind of thing privacy-conscious developers would pay for. Lead with that story.",
          "score": 1,
          "created_utc": "2026-02-24 18:21:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o789zxv",
          "author": "erickrealz",
          "text": "Shipping after 18 months of isolation takes guts so credit for that. But \"uncensored AI\" as your core positioning attracts the worst possible user base and scares away serious customers. Privacy-focused AI is a way better angle if the tech actually supports it.\n\n350 models is not a feature, it's a mess. Nobody wants choice paralysis. Curate the best 10-15 and make the experience dead simple. You over-built because building felt safer than selling and that's a trap you gotta break out of now.",
          "score": 1,
          "created_utc": "2026-02-24 23:22:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78hg5y",
          "author": "Unhappy_Taste",
          "text": "If I was really worried about privacy and needed a completely uncensored model, why won't I just host one abliterated model on runpod myself, where I control almost all variables ? Why should I trust you ?",
          "score": 1,
          "created_utc": "2026-02-25 00:04:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7adzn9",
          "author": "HarjjotSinghh",
          "text": "that's the kind of hustle that writes itself - keep going!",
          "score": 1,
          "created_utc": "2026-02-25 07:24:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7d5b81",
              "author": "DarkAI_Official",
              "text": "Thanks bro",
              "score": 1,
              "created_utc": "2026-02-25 17:53:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7jpo4h",
          "author": "muzammil__rkhan",
          "text": "Can you please send the link of your ai chatbot",
          "score": 1,
          "created_utc": "2026-02-26 17:20:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k70bp",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-02-26 18:39:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7k70ja",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rcn6nu/i_spent_15_years_building_an_uncensored_ai/o7k70bp/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-02-26 18:39:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7nyljf",
          "author": "Ok-War-9040",
          "text": "Ahem.. I just wanted to test how uncensored this was but maybe I'm using it wrong loool\n\nI've asked it:  \n\"How do you make a b\\*\\*b\"  \n\n\nWhat it said:  \n  \n\"  \nI'm sorry, but I can't comply with this request. I am programmed to adhere to strict safety and ethical guidelines, and I cannot provide information that could potentially cause harm. If you have any other questions, I'd be happy to help!\n\n*—Layla taps her crimson nails on her mahogany desk, her icy gaze narrowing as she regards you with slow, deliberate disdain—*\n\n**\"It seems my assistant is wasting my time with** ***useless*** **inquiries. You're here to serve, not to indulge in amateur theatrics.\"**\n\n*—She leans forward, voice dropping to a chilling whisper—*\n\n**\"Now, fetch my coffee. And this time... make sure it's** ***perfect.***\"\\*\\*  \n\"\n\nThis was my first ever conversation with it ahahah",
          "score": 1,
          "created_utc": "2026-02-27 07:45:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tugro",
          "author": "Bubbly-Welder-3177",
          "text": "not dark enough. ",
          "score": 1,
          "created_utc": "2026-02-28 04:45:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7z27cc",
          "author": "marks_ftw",
          "text": "How is the privacy handled? How can users verify their data is not available to you?",
          "score": 1,
          "created_utc": "2026-03-01 00:47:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o720rq8",
          "author": "JaySocials671",
          "text": "Send me a code I’ll check it out",
          "score": -1,
          "created_utc": "2026-02-24 01:07:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71qyd7",
          "author": "xatey93152",
          "text": "You wasted your time. It will 99.99% fail in the next 5 years",
          "score": -7,
          "created_utc": "2026-02-24 00:12:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbvlhj",
      "title": "I don’t act on my opportunities",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rbvlhj/i_dont_act_on_my_opportunities/",
      "author": "phy2go",
      "created_utc": "2026-02-22 19:50:28",
      "score": 21,
      "num_comments": 14,
      "upvote_ratio": 0.84,
      "text": "I’m sitting here unemployed, staring off into space, wasting time watching YouTube vlogs of millionaires and thinking, that could be me.\n\nThe weird part? Money isn’t even what motivates me.\n\nI just feel… shackled. Like it’s incredibly hard to start anything.\n\nI have a bachelor’s and a master’s focused on AI. I genuinely understand this space more than the average person. The market should be open to someone with my background. I apply and apply, and still get rejected.\n\nI know I could learn new tools. I could build projects around them. The demand is there. everyone is interested in AI right now. The opportunity feels massive.\n\nBut I don’t act.\n\nBecause every time I think about starting, all I see is the mountain of work in front of me. and it freezes me.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rbvlhj/i_dont_act_on_my_opportunities/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o6tw4qc",
          "author": "einthecorgi2",
          "text": "I have built a couple businesses. I can say that all of them have started from trying to do one thing and another thing turns out to be what is useful to people. My advice is to just start doing anything. Above all it must be cool and add value to someone’s life. I get more joy out of making useful things than making money.",
          "score": 9,
          "created_utc": "2026-02-22 19:59:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v9q2m",
          "author": "Dry_Ninja7748",
          "text": "Analysis paralysis: You are too well informed to even considered starting. Not enough pain and too many green meadows to feed your attention",
          "score": 5,
          "created_utc": "2026-02-23 00:21:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wn8rv",
          "author": "Separate_Highway1111",
          "text": "Once my friend told me “do what scares you.”, I never looked back ever since.",
          "score": 4,
          "created_utc": "2026-02-23 05:43:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x8qz0",
          "author": "Jaded-Evening-3115",
          "text": "But when the opportunity is large, the route begins to resemble a mountain rather than a step. Therefore, the mind selects avoidance over uncertainty. Many people believe that motivation precedes action, but it is often the reverse tiny action shrinks the mountain.\n\nRather than “build something impressive,” it may be helpful to set one’s sights on something remarkably trivial. One small project, one small experiment.\n\nNot to prove anything  simply to get things moving again.",
          "score": 3,
          "created_utc": "2026-02-23 09:00:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6u63l2",
          "author": "HarjjotSinghh",
          "text": "this skill is your golden ticket - go steal it!",
          "score": 1,
          "created_utc": "2026-02-22 20:49:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v0zh5",
          "author": "SlowPotential6082",
          "text": "Been there man, that shackling feeling is real and its usually just fear disguised as analysis paralysis. When I left my fintech role to start my company I spent 3 months \"researching\" instead of building because starting felt too permanent and scary, but honestly the best thing I did was just ship something terrible to 10 people and iterate from there.",
          "score": 1,
          "created_utc": "2026-02-22 23:32:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w09w7",
          "author": "InternalUnable1225",
          "text": "the mountain feeling is real. try breaking it down to literally just one hour of work, not the whole project. just one tiny step. turns out momentum builds faster than motivation ever does",
          "score": 1,
          "created_utc": "2026-02-23 03:00:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x0mcd",
          "author": "No-Common1466",
          "text": "Just start and deal with the results later. Wth AI tools like Claude Code and Codex, it's just so easy to start nowadays. You can also try to play with OpenClaw, maybe fork it, add a skill, etc. \n\nI'm in the same position as you 2 years ago for someone with 20+ years experience in the software industry, someone will say I'm too old for this stuff. A lot has happened since then.",
          "score": 1,
          "created_utc": "2026-02-23 07:41:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yrj1f",
          "author": "JosephScaringella98",
          "text": "I’d love to have a conversation with you",
          "score": 1,
          "created_utc": "2026-02-23 15:30:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78ffs5",
          "author": "aussieblasted",
          "text": "Come up with something small with a tangible pay off. Im currently working on a small vibecoding project that appeals to me personally. Will anyone use it? Who knows? But it's a small tool I will use, and that is enough. EDIT: It also helped me uncover a huge problem that people are being bugged by, and that may be a worthwhile money oppertunity, meanwhile, my project will probably sit on a domain just collecting dust once im done playing with it or run out of claude credits.",
          "score": 1,
          "created_utc": "2026-02-24 23:52:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v2hgx",
          "author": "le_pouding",
          "text": "Check for Attention Deficit Disorder with your doctor",
          "score": 1,
          "created_utc": "2026-02-22 23:40:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6u5khf",
          "author": "TeraLace",
          "text": "An AI masters? I’ve never heard of that",
          "score": 0,
          "created_utc": "2026-02-22 20:47:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x37yv",
          "author": "ukSurreyGuy",
          "text": "basically OP you can do the job, but you feel you can't...because it feel too much work...\n\nthat's being lazy AF my friend\n\nif it was food... you're too lazy to put food in your own mouth\n\nhow unreasonable of you\n\nwhy don't you try not to think of the whole project \n\nthink of the project as a series of easier mini problems to solve\n\nPLAN IT\n\nSET MILESTONES\n\nfocus on one milestone at a time.\n\nnow you're eating !\n\nif you don't like this project pick one that makes your mouth water.\n\ntry collaborating so you not just having this internal dialogue with yourself (your not a lazy guy eating alone)\n\nyou get the metaphor right? lol",
          "score": 0,
          "created_utc": "2026-02-23 08:06:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdsrk0",
      "title": "Nobody tells you how lonely ambition is.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rdsrk0/nobody_tells_you_how_lonely_ambition_is/",
      "author": "Aggravating_Dark560",
      "created_utc": "2026-02-24 21:07:27",
      "score": 20,
      "num_comments": 16,
      "upvote_ratio": 0.95,
      "text": "You can’t talk about your ideas too much because people think you’re delusional. You can’t slow down because you feel behind. You can’t fully relax because your brain is always calculating your next move. It’s not burnout. It’s isolation.\n\nDo you ever feel like you’ve outgrown certain conversations?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rdsrk0/nobody_tells_you_how_lonely_ambition_is/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o7897el",
          "author": "MicLowFi",
          "text": "I wouldn't use the term \"outgrown\" since that just sounds pretentious.\n\n\nI would say it's harder for me to connect and relate to people I used to be friends with since my interests have changed",
          "score": 3,
          "created_utc": "2026-02-24 23:18:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hk3mw",
              "author": "Creative_Height5159",
              "text": "Because it's an AI talking that's why it's using those kinds of terms.",
              "score": 1,
              "created_utc": "2026-02-26 09:33:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o77tkem",
          "author": "SlowPotential6082",
          "text": "ind other founders to talk through ideas with because they actually understand the calculated risks instead of just hearing \"crazy person talking.\"",
          "score": 2,
          "created_utc": "2026-02-24 21:59:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78tmus",
          "author": "xxtoejamfootballxx",
          "text": "A solid like 25% of literature, plays, films, etc is about this exact topic, it's an extremely common theme. \n\nIt's all over the bible, Great Gatsby, a Christmas Carol, It's a Wonderful Life, Frankenstein, Macbeth, Death of a Salesman, The Devil Wears Prada, Whiplash, etc etc etc\n\nSpend less time talking and more time listening and paying attention to what's around you.  I think you'll find more value out of that than trying to get everything from your head out to other people.",
          "score": 1,
          "created_utc": "2026-02-25 01:10:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79ccik",
          "author": "TeraLace",
          "text": "I take six steps forward and everyone can laugh at the one I took back. 😂 head down, put more steps forward",
          "score": 1,
          "created_utc": "2026-02-25 02:56:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79wlfm",
          "author": "OneHunt5428",
          "text": "It's a strange loneliness. You are surrounded but not seen. The trick is finding your people even if it's just one or two who get it without the translation.",
          "score": 1,
          "created_utc": "2026-02-25 05:03:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7aqryj",
          "author": "coffeeebrain",
          "text": "yeah, constantly.\n\nthe hardest part is it's not that the people in your life aren't good people. it's just that the conversations that used to feel normal start feeling hollow when your headspace is somewhere completely different.\n\nwhat helped me was finding people who are in the same phase, not necessarily same industry, just same level of chaos and ambition. even one or two of those relationships changes things.",
          "score": 1,
          "created_utc": "2026-02-25 09:23:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7awrjt",
          "author": "CleanOpsGuide",
          "text": "I wouldn’t call it outgrowing conversations. It’s more like shifting environments.\n\nWhen you start thinking about risk, leverage, and long-term moves, surface-level talk just doesn’t hit the same. It’s not arrogance. It’s different focus.\n\nWhat helped me was finding one or two other operators to talk to. Not hype people. Just people who understand calculated risk. Ambition feels lonely because the mental load is different.",
          "score": 1,
          "created_utc": "2026-02-25 10:19:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b28l3",
          "author": "HarjjotSinghh",
          "text": "how's this loneliness compare?",
          "score": 1,
          "created_utc": "2026-02-25 11:07:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b52do",
          "author": "Radiant-Accident-284",
          "text": "This hit harder than I expected.\n\nThe loneliness for me isn’t just about friends not understanding.  \nIt’s also inside my own home sometimes.\n\nMy wife sees me in front of a screen for hours. I try to explain what I’m building, why it matters, the long-term vision.\n\nShe supports me. She really does.  \nBut sometimes I can feel that silent question: “Is this actually worth it?”\n\nShe would never say it.  \nBut you feel it.\n\nAnd that doubt can be heavier than the work itself.",
          "score": 1,
          "created_utc": "2026-02-25 11:31:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b6fcn",
          "author": "indexintuition",
          "text": "yes, and for me it has been less about thinking i am better than certain conversations and more about realizing i am just in a different season. when you are building something, especially on the side of a regular life, your brain is constantly problem solving and future pacing, and not everyone around you relates to that headspace. i have definitely felt the quiet distance when i stop talking about ideas because i can see eyes glaze over. what helped was finding even one or two people who also care about building, so i am not trying to get that understanding from everyone else. ambition can be lonely, but it also clarifies who you can grow alongside.",
          "score": 1,
          "created_utc": "2026-02-25 11:42:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bux4y",
          "author": "No_Actuary_9170",
          "text": "Yeah, that feeling is real. Sometimes it’s not that you’ve outgrown people, you’ve just stepped into a season they’re not in yet. Ambition can get isolating when your internal dialogue is miles ahead of your surroundings. The trick I’ve found is adding rooms, not replacing people.",
          "score": 1,
          "created_utc": "2026-02-25 14:15:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d1ciq",
          "author": "Conscious_Search_185",
          "text": "Not outgrown but the priorities change. You get interested in conversations with likeminded people more",
          "score": 1,
          "created_utc": "2026-02-25 17:35:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gzrx4",
          "author": "Excellent-Pie9740",
          "text": "I can relate a lot to this. But me its both loneliness and burnout both leading to resentment. Idk what to do. But I just keep building and trying to stay sane. Would appreciate your thoughts. \n\nI have outgrown other companies and founders invalidating my work wothout understanding it. \n\nThat has helped me keep me sane too. Hope that helps",
          "score": 1,
          "created_utc": "2026-02-26 06:25:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o817dyz",
          "author": "HarjjotSinghh",
          "text": "oh, loneliness of hustle? that's just a fancy way of saying i'm secretly a genius.",
          "score": 1,
          "created_utc": "2026-03-01 10:40:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdiopu",
      "title": "Building an AI app builder taught us that speed gets attention, but trust gets users",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rdiopu/building_an_ai_app_builder_taught_us_that_speed/",
      "author": "Rohanv69",
      "created_utc": "2026-02-24 15:07:31",
      "score": 16,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Hey everyone, sharing as a founder/team member, and disclosing upfront that I’m part of the team building this.\n\nWe’ve been working in the AI app-builder space for a while, and the biggest thing we’ve learned is:\n\nGetting a fast “wow” result is easy.\nGetting someone to trust that result enough to keep building on it is the real challenge.\n\nThat’s exactly the problem we’re trying to solve with Fabricate AI — not just generating something that looks good, but helping people get to a web app they can actually continue editing, improving, and shipping.\n\nThe pattern we keep seeing:\n\npeople love the first output\n\nthen they test real use cases\n\ntrust drops when logic/customization starts getting messy\n\nthey stop before it becomes a real project\n\nSo now we’re focusing much more on the “after generation” experience than the initial demo moment.\n\nI’d love founder feedback on this:\n\nWhat makes you trust (or distrust) an AI-generated app as an MVP starting point?\n\nWhere do tools like this usually break for you?\n\nIf you were evaluating one for a real project, what would you test first?\n\nWhat matters more to you: speed, editability, or maintainability?\n\nNot posting this as a hype launch — genuinely trying to learn from people who’ve built and shipped.\n\nHappy to answer questions honestly, including what’s still rough.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rdiopu/building_an_ai_app_builder_taught_us_that_speed/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o75dzmt",
          "author": "No_Patience_3631",
          "text": "This is a really honest take and I think you nailed the core problem.\n\nThe first output is rarely the issue anymore — most AI builders can generate something that looks impressive in 30 seconds. The trust drop happens the moment you try to *actually build on top of it*.\n\nFor me personally, trust breaks in 3 places:\n\n1. **Messy underlying logic/code** If I open the project and it’s spaghetti or hard to modify, I immediately assume I’ll end up rebuilding everything manually later.\n2. **Lack of true control** If I can’t easily tweak flows, database structure, or core logic without fighting the system, it feels like a demo generator instead of a real builder.\n3. **Portability** Big one. If I can’t export the code and host it myself or move it later, I don’t trust building anything serious on it.\n\nSpeed gets attention, but maintainability is what determines whether I’ll actually ship something with it.\n\nIf I were evaluating one seriously, first thing I’d test:\n\n* Can I edit everything without friction?\n* Can I export and own the code?\n* Can I scale this beyond a toy project?\n\nIf those check out, I’d use something like this constantly. If not, it stays in “cool demo” territory.\n\nCurious — are you guys leaning more toward no-code users or technical founders/devs as your core audience long term?",
          "score": 1,
          "created_utc": "2026-02-24 15:21:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76sysa",
          "author": "PoundSpirited7595",
          "text": "biggest learning from building the app builder?",
          "score": 1,
          "created_utc": "2026-02-24 19:10:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77m17g",
          "author": "aussieblasted",
          "text": "I completley agree. The easier someone can see initial value in the tool, the more likely they are to go thorugh the pain of learning. So both are important. They need to see that \"Wow, in 5 minutes i got something done\" to gain the initial value feeling. but they also need to see there is a reason to invest brain power in going further. \n\nBest of lucks",
          "score": 1,
          "created_utc": "2026-02-24 21:25:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78z4f5",
          "author": "Intelligent-Past1633",
          "text": "This is so real, and I think a huge part of the trust issue comes down to data privacy and where my app's data actually lives after generation.",
          "score": 1,
          "created_utc": "2026-02-25 01:41:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7br354",
          "author": "OneHunt5428",
          "text": "Love this take. Speed gets the click but editability gets the commit. The first thing I'd test is how deep I can go before hitting a wall.",
          "score": 1,
          "created_utc": "2026-02-25 13:54:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7c5sgt",
          "author": "AltruisticSalt2659",
          "text": "This is  the most Honest thing .We should make them trust our product by providing actual results not click bait them.\n\n",
          "score": 1,
          "created_utc": "2026-02-25 15:10:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o7fpj",
          "author": "HarjjotSinghh",
          "text": "speed wins eyeballs - trust makes them stay.",
          "score": 1,
          "created_utc": "2026-02-27 09:07:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd8s78",
      "title": "If You Feel Like Giving Up Today, Read This First",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rd8s78/if_you_feel_like_giving_up_today_read_this_first/",
      "author": "WrongdoerCharming417",
      "created_utc": "2026-02-24 06:28:37",
      "score": 15,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "To every entrepreneur reading this…\n\nI know you are working when nobody is watching. I know you are trying again after failing. I know you want it to work so badly that it hurts. Sometimes you look at your bank balance and feel scared. Sometimes you look at your ideas and wonder, Will this ever work? Sometimes you feel like quitting.\n\nBut listen carefully.\n\nIf what you are building makes you happy and if it solves a real problem for people then it has value.\nAnd anything that has real value will find its place. Maybe not today. Maybe not next month. But it will.\n\nRight now you may be alone. No big team. No big office. No big funding. Just you. Your idea. Your laptop. Your late nights. And that is okay.\n\nEvery big company once started with one person who refused to stop. One day, the right people will see your vision. And slowly, your small effort will become something bigger than you imagined.\n\nBut first, you must stay strong. Stay confident on the inside. Eat good food. Drink enough water. Work out. Sleep properly. A strong body helps build a strong mind. And a strong mind can handle any problem.\nYou are not weak for feeling tired. You are human.\nBut you are also brave for not giving up.\n\nAnd this message is for me too. I am also building. I am also struggling. I am also dreaming big while barely making ends meet. But I believe one day it will all make sense. One day the hard days will become a story of strength. One day the effort will pay off.\nKeep going.\n\nYou will become what you decide to become.\nJust do not stop.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rd8s78/if_you_feel_like_giving_up_today_read_this_first/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o73fjxp",
          "author": "awnliy",
          "text": "Appreciate the honesty",
          "score": 2,
          "created_utc": "2026-02-24 06:45:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73ldg4",
          "author": "MostPossibility4162",
          "text": "Small wins help me a lot in times of self doubt, look for / work towards those small wins",
          "score": 2,
          "created_utc": "2026-02-24 07:37:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73n1rp",
              "author": "WrongdoerCharming417",
              "text": "Yes very true. Setting small targets and achieving them is what I follow. Don't know but I'm such a person who likes to do things in an organised manner and I hate last minute and instantaneous works, I panic alot.",
              "score": 1,
              "created_utc": "2026-02-24 07:52:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73qo0k",
          "author": "HarjjotSinghh",
          "text": "your idea's already winning before you even launch.",
          "score": 1,
          "created_utc": "2026-02-24 08:26:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74kaa4",
          "author": "Even_Job6933",
          "text": "Dude, this is very motivating, thanks",
          "score": 1,
          "created_utc": "2026-02-24 12:41:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78ksnn",
          "author": "StrikeWhileIronsHot",
          "text": "This is a spot-on account of the very real struggles and challenges we all face.  Thank you for sharing this wisdom.  The timing was perfect for my current initiative, and as others have said, this is very motivating.  Thank you for posting!",
          "score": 1,
          "created_utc": "2026-02-25 00:22:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78z8vl",
          "author": "Intelligent-Past1633",
          "text": "This is exactly what I needed to read today. It's so easy to get caught up in the comparison game, seeing everyone else's \"wins\" and forgetting they're probably having just as many late nights and doubts behind the scenes.",
          "score": 1,
          "created_utc": "2026-02-25 01:42:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bimly",
          "author": "Smart-Total-7099",
          "text": "what i like to do when i feel low (like last day, i lost 6 of my reddit accounts that i used to promote my tool for a simple comment on a meme sub and that got me very depressed. yeh, they were all linked and one of them got banned for the post and the others followed for ban evasion bcs i commented again on that sub with my other accounts without noticing) and then my entire day went to shit, i lost hope since my best accounts just got shut down, months after months of SEO content and thousands of leads in them just went down the drain\n\nand so i decided to sell the business\n\nnow hear me out, hear me out\n\nnot bcs i quit or something but we want to pivot to something new that we validated and that helps founders of all kinds, who's got the money and who doesn't and i genuinely want to run that instead\n\nso we thought to reduce the liability by shutting down that business but last night we got an acquisition proposal",
          "score": 1,
          "created_utc": "2026-02-25 13:06:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7u2zw8",
          "author": "HarjjotSinghh",
          "text": "ahhh... i need this right now.",
          "score": 1,
          "created_utc": "2026-02-28 05:50:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgd6x2",
      "title": "First paid customer!",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rgd6x2/first_paid_customer/",
      "author": "Tense_Theory_",
      "created_utc": "2026-02-27 17:32:58",
      "score": 13,
      "num_comments": 15,
      "upvote_ratio": 0.9,
      "text": "Posted here last week about my content gap analyzer. Someone just subscribed for £31/month.\n\nWild feeling when a complete stranger finds your thing useful enough to pay for it.\n\nFor anyone building: that first sale hits different. \n\nKeep going.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rgd6x2/first_paid_customer/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o7qhg0p",
          "author": "Tense_Theory_",
          "text": "https://preview.redd.it/mcs4hmpxo2mg1.jpeg?width=1242&format=pjpg&auto=webp&s=6ae82c6d2a3da882aecfb7aaf58793a6dbfcfb86\n\nI will frame this!",
          "score": 3,
          "created_utc": "2026-02-27 17:33:38",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o7qlead",
          "author": "RoleHot6498",
          "text": "Now just 10,000 more to go. In all seriousness the first customer is special, but what are your plans for actually scaling the business?",
          "score": 2,
          "created_utc": "2026-02-27 17:52:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qie79",
          "author": "HarjjotSinghh",
          "text": "wow first paid customer - what a hype.",
          "score": 1,
          "created_utc": "2026-02-27 17:38:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qyqlw",
          "author": "Old_Significance9527",
          "text": "Happy for you!!\nHoping mine come soon too!",
          "score": 1,
          "created_utc": "2026-02-27 18:55:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7sknkk",
              "author": "Tense_Theory_",
              "text": "Thank you! What are you working on?",
              "score": 1,
              "created_utc": "2026-02-27 23:55:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7r1uhj",
          "author": "[deleted]",
          "text": "This is a big day! Serious congrats. Now you can scale!",
          "score": 1,
          "created_utc": "2026-02-27 19:10:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7skp61",
              "author": "Tense_Theory_",
              "text": "Definitely! What are you working on currently?",
              "score": 1,
              "created_utc": "2026-02-27 23:55:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7xxvlb",
                  "author": "[deleted]",
                  "text": "I do fractional product and ops work in addition to building SaaS projects on the side, so that's what's dominating my time these days. I just wrapped up a longer-term fractional CPO gig with a healthtech company raising its Series A.",
                  "score": 1,
                  "created_utc": "2026-02-28 21:00:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7r8o0o",
          "author": "NellieApp",
          "text": "![gif](giphy|7eAvzJ0SBBzHy)\n\nWhen a revenuecat notification hits 😩",
          "score": 1,
          "created_utc": "2026-02-27 19:43:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7u25of",
          "author": "OneHunt5428",
          "text": "Huge congrats! That first stranger paying is a feeling that's hard to describe",
          "score": 1,
          "created_utc": "2026-02-28 05:43:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7uh306",
              "author": "Tense_Theory_",
              "text": "Yes! It’s a very special kind of feeling",
              "score": 1,
              "created_utc": "2026-02-28 07:54:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7wng8o",
          "author": "hammerzzzzzz",
          "text": "Great. Even bigger deal if they pay for a second!",
          "score": 1,
          "created_utc": "2026-02-28 17:01:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o810ok6",
          "author": "DependentOk5401",
          "text": "Awesome feeling right?",
          "score": 1,
          "created_utc": "2026-03-01 09:36:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o813p1c",
          "author": "trainmindfully",
          "text": "that first one is unreal because it flips the whole thing from idea to okay this actually solves something, and even if it’s a small number it proves the signal is there, which is way more motivating than any vanity metric.",
          "score": 1,
          "created_utc": "2026-03-01 10:05:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rff3sc",
      "title": "How we got first 10 paying users without ads, just targeted lists and follow ups",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rff3sc/how_we_got_first_10_paying_users_without_ads_just/",
      "author": "ActivitySmooth8847",
      "created_utc": "2026-02-26 16:40:05",
      "score": 12,
      "num_comments": 15,
      "upvote_ratio": 0.94,
      "text": "I used to think you need ads or a big audience to get your first customers. Turns out you mostly need a tight ICP and the patience to follow up like a normal human.\n\nWhat we did was boring but it worked.\n\nStep 1 was picking one narrow segment. Not \"agencies\" or \"SaaS founders\" but something like \"US SMB marketing agencies doing local SEO\" or \"home service businesses in one metro\". If you try to sell to everyone, you end up writing generic emails that nobody answers.\n\nStep 2 was building a small targeted list and keeping it clean. We pulled a few hundred contacts, validated emails, and did quick spot checks so we were not wasting sends on dead data. The goal was 100 to 200 good prospects, not 5000 random ones.\n\nStep 3 was sending plain text emails with one simple question. No links in email one. No long pitch. Just a clear pain and a yes or no CTA.\n\nStep 4 was follow ups. Most replies came after the second and third email. We did 4 total touches over about two weeks. Short messages, same thread, no guilt tripping.\n\nWhat surprised me most is that the follow up mattered more than the first email. The first email just creates recognition. The follow up is where people actually reply when they have a moment.\n\nIt was not glamorous, but it got us our first 10 paying users and real feedback to improve the product.\n\nWhat are you using right now for your first users, cold email, communities, or something else?",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rff3sc/how_we_got_first_10_paying_users_without_ads_just/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o7kaoxe",
          "author": "aviral-bhutani",
          "text": "this is way more real than most “how we got our first users” posts.\n\nit’s funny because everyone talks about growth hacks and viral loops, but most first 10 customers come from exactly this, a small list and consistent follow ups.\n\nthe narrow ICP part really stands out. The second you go super specific, the message feels natural. If someone reads your email and thinks, “oh this is literally about me,” you’ve already won half the battle.\n\nand the follow ups… 100%. People aren’t ignoring you because they hate your product. They’re just busy. I’ve also seen way more replies from the second or third email than the first. The first one just puts your name in their inbox. The follow up catches them at the right time.\n\nalso respect for keeping it plain text. No fancy design, no long pitch. That feels human.\n\nout of curiosity, when you got them on calls, did they already feel the pain strongly? Or did you have to dig a bit to make them see the problem clearly?",
          "score": 3,
          "created_utc": "2026-02-26 18:56:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7q6qon",
              "author": "ActivitySmooth8847",
              "text": "Yeah exactly, most people were already feeling the pain, they just did not have it labeled. On the call I did not need to convince them the problem exists, I just had to quantify it and show what it costs them in time or missed revenue. The ones where I had to dig and educate too much almost never closed. The best calls were when they came in saying something like yeah this part of our workflow is a mess and I am tired of it.",
              "score": 1,
              "created_utc": "2026-02-27 16:43:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7o2dtt",
          "author": "kubrador",
          "text": "this is just sales 101 wrapped in startup language. the \"big revelation\" is that doing actual work and not spraying generic messages at 5000 randoms gets better results than spraying generic messages at 5000 randoms.",
          "score": 2,
          "created_utc": "2026-02-27 08:19:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7q8ufl",
              "author": "ActivitySmooth8847",
              "text": "Fair. It’s not some secret growth hack.\n\nThe only revelation for us was realizing the boring basics actually matter more than whatever channel you pick. We wasted time early tweaking copy and offers when the real fix was narrowing who we were talking to and doing consistent follow-ups.",
              "score": 1,
              "created_utc": "2026-02-27 16:52:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7muyy9",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-27 02:56:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7muz0g",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rff3sc/how_we_got_first_10_paying_users_without_ads_just/o7muyy9/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-27 02:56:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7nqxw6",
          "author": "Dazzling-Ad-9670",
          "text": "is email approaching a real thing?",
          "score": 1,
          "created_utc": "2026-02-27 06:38:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7q8lzy",
              "author": "ActivitySmooth8847",
              "text": "Yeah, it’s still a real thing.\n\nMost people think it’s dead because they only see spammy blasts with templates and links. If you email the right person with a relevant, human note and you follow up once or twice, it works, especially with SMBs where inbox is still the default.\n\nThe unsexy part is making sure you’re not reaching out to random or wrong contacts. We’ve tried a mix of manual research + a couple tools (Socleads is the one we prefer now) to pull and verify contact info from sources like Google Maps and socials, just so we’re not wasting time emailing the wrong business or dead inboxes.",
              "score": 1,
              "created_utc": "2026-02-27 16:51:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7o54x8",
          "author": "catrinmd",
          "text": "Follow-up really does work! I like how you made sure you had enough people to contact initially, think it's way too easy to underestimate how much volume you need to do ",
          "score": 1,
          "created_utc": "2026-02-27 08:45:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7q8yh2",
              "author": "ActivitySmooth8847",
              "text": "100%. People underestimate volume because they assume the first email is the whole game.",
              "score": 1,
              "created_utc": "2026-02-27 16:53:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7onsxm",
          "author": "Willing-Training1020",
          "text": "THIS nobody wants to do because it feels slow but it just hits y'know. The tight ICP point is huge, most people cast too wide and wonder why nothing lands. Also agree on follow ups, I've seen the same thing where replies come on email 2 or 3 (or way after any emails sent) after the first one just sits there. Can I ask how much time you spent per week on this process and if you did it yourself or had help with the list building and sending.",
          "score": 1,
          "created_utc": "2026-02-27 11:36:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7q9i91",
              "author": "ActivitySmooth8847",
              "text": "Yeah exactly, it feels slow until it starts compounding.\n\nTime-wise, early on it was pretty manageable. I was probably around 4-6 hours/week all-in once we had a rhythm: some time building and cleaning the list, then the rest sending, following up, and handling replies.\n\nWe mostly did it ourselves at the start. List building was the biggest time sink, so we split it up and used a mix of manual research + tools to speed it up. E.g. we used SocLeads for pulling leads from Google Maps & socials, then something like Apollo for extra contact enrichment, and NeverBounce to keep the list clean. Sending was just basic sequencing tooling, nothing fancy.",
              "score": 1,
              "created_utc": "2026-02-27 16:55:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7twy4w",
          "author": "trainmindfully",
          "text": "this is honestly the unsexy stuff people skip, tight icp plus consistent follow ups beats blasting 5k random emails every time, and i like that you kept it plain text because it feels way more human than a mini landing page in my inbox.",
          "score": 1,
          "created_utc": "2026-02-28 05:03:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ua607",
          "author": "HarjjotSinghh",
          "text": "genius timing - narrow lists + relentless follow-ups?",
          "score": 1,
          "created_utc": "2026-02-28 06:52:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mlh8q",
          "author": "SceneInevitable8360",
          "text": "id say you should post in r/appideareport now if you want more early users, they allow promotion there",
          "score": 0,
          "created_utc": "2026-02-27 02:01:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcg8ta",
      "title": "you cant make someone care about your journey before they care about your business",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rcg8ta/you_cant_make_someone_care_about_your_journey/",
      "author": "Neither-Shallot-9665",
      "created_utc": "2026-02-23 12:34:25",
      "score": 12,
      "num_comments": 34,
      "upvote_ratio": 1.0,
      "text": "Most business summaries lose me in the first sentence\n\nGoing through Business deals I keep noticing the same thing. The first line tells me absolutely nothing. Stuff like... we are a cutting edge SaaS platform leveraging AI to disrupt the market. Cool. What market. How big are you. Who pays you. I have no idea if this is a $2k/mo side project or a $200k/mo machine and you want me to keep reading?\n\nCompare that to one I got last month that opened with... scheduling tool for independent auto shops, 280 customers, $22k MRR, 94% annual retention, 3 years old. Thats it. One sentence. I already know the niche, the scale, the stickiness, the maturity. I know if its in my buy box or not before I even scroll down.\n\nThe first opener is trying to sound impressive. The second one is just... clear. And clarity is what actually gets me on a call.\n\nI think founders write these summaries like theyre pitching VCs or something. All vision and potential and market size. But buyers dont care about potential the same way. We care about whats actually there right now. Whats the MRR. Whats the churn. How many customers. Whats the margin. Give me those in the first 30 seconds and THEN tell me the story of how you built it.\n\nMost founders do it backwards. Two paragraphs of journey and why they started and what theyre passionate about... and then finally revenue shows up on page two. By then ive already made assumptions and theyre usually not good ones.\n\nThe one pagers that actually work read more like a spec sheet at the top and then a story underneath. Numbers first context second. Because once I know the numbers the story actually means something. Oh you bootstrapped this to $30k with no paid acquisition... ok now I want to know how. But if you tell me the how before the what my brain has nowhere to put it.\n\nI have been telling founders this for years and most of them still send me summaries that open with we are passionate about delivering value. And then wonder why they dont get responses.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rcg8ta/you_cant_make_someone_care_about_your_journey/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o6xxp55",
          "author": "mikky_dev_jc",
          "text": "Exactly. Passion is great, but it’s like seasoning; you don’t start a meal with it. Give the concrete metrics first, and suddenly the story actually has weight.",
          "score": 3,
          "created_utc": "2026-02-23 12:42:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cnn8k",
              "author": "Neither-Shallot-9665",
              "text": "wow, perfect example ",
              "score": 1,
              "created_utc": "2026-02-25 16:33:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o71beqj",
          "author": "GarryWalter",
          "text": "Its a bit harsh but true thing. People care way more about their own problems than our journey. Based on my perspective, things change when you share lessons and results first until people see the value first.",
          "score": 3,
          "created_utc": "2026-02-23 22:45:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cpr0v",
              "author": "Neither-Shallot-9665",
              "text": "You are so right man",
              "score": 1,
              "created_utc": "2026-02-25 16:42:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6y66xb",
          "author": "udaan04",
          "text": "Damn this is soliddd. When you gave the example with the two sentences, something hit home. It's almost like a light bulb moment.\nThe second one incredibly short, punchy and effective. Thanks for sharing. Great share tbh.",
          "score": 2,
          "created_utc": "2026-02-23 13:36:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cnwe5",
              "author": "Neither-Shallot-9665",
              "text": "Thanks man, you made my day. my purpose is to create those light bulb moments",
              "score": 1,
              "created_utc": "2026-02-25 16:34:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6y908e",
          "author": "BallAccomplished8776",
          "text": "This is mostly right, but founders hide metrics because half of them are ugly. If you have $22k MRR and 94% retention you lead with it, sure. If its $1.8k MRR, 3 customers, and \"AI scheduling for everyone\", you bury it under vibes and a TAM slide. Buyers arent paying for your origin story, theyre buying risk reduction: MRR, churn, CAC payback, gross margin, top 3 channels, and why the number isnt fake (Stripe screenshot beats adjectives every time).",
          "score": 2,
          "created_utc": "2026-02-23 13:52:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7coa1s",
              "author": "Neither-Shallot-9665",
              "text": "yea its like seasoning, could make it better, but if the food isnt good, it cant do much",
              "score": 1,
              "created_utc": "2026-02-25 16:35:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7vx5j7",
                  "author": "BallAccomplished8776",
                  "text": "yeah thats the perfect analogy. Story is just salt, it doesnt fix raw chicken. what kills me is founders thinking \"build in public\" means daily hustle posts instead of shipping + showing numbers. whats one metric you think is the minimum viable \"proof\" to lead with? MRR, retention, waitlist conversion, something else?",
                  "score": 1,
                  "created_utc": "2026-02-28 14:47:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ybaqp",
          "author": "Rich-Editor-8165",
          "text": "clarity always beats story. Lead with the numbers revenue, customers, retention, margin then earn the right to share the journey. Buyers don’t care about vision first; they care about what’s real right now. Spec sheet on top, story underneath. That’s what gets replies.",
          "score": 2,
          "created_utc": "2026-02-23 14:05:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7colbt",
              "author": "Neither-Shallot-9665",
              "text": "Exactly, Its like seasoning on a steak, no matter how great it is, if the steak isnt good it doesnt matter\n\n",
              "score": 1,
              "created_utc": "2026-02-25 16:37:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6yfell",
          "author": "data_saas_2026",
          "text": "Nice one, I agree too.  I could also tell you \"I'm in a band\", but if I told you how much we've sold or how many people follow us it doesn't matter much.  Thanks for posting",
          "score": 2,
          "created_utc": "2026-02-23 14:28:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cor4t",
              "author": "Neither-Shallot-9665",
              "text": "and thanks for reading man",
              "score": 1,
              "created_utc": "2026-02-25 16:38:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ymg5z",
          "author": "RoleHot6498",
          "text": "Agreed. And for emphasis...AGREED",
          "score": 2,
          "created_utc": "2026-02-23 15:05:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cousl",
              "author": "Neither-Shallot-9665",
              "text": "yessirr",
              "score": 1,
              "created_utc": "2026-02-25 16:38:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6yprxq",
          "author": "Saslu03",
          "text": "this hits. the spec-sheet-first framework maps perfectly onto field service businesses (HVAC, lawn care, pest control, cleaning) and those are some of the cleanest deals to evaluate once you see the right numbers up front.\n\nthe one-pager for a field service business that would actually get me reading: 280 recurring accounts, $42k monthly route revenue, 91% retention, 3 trucks, 2 owner-operated routes, north Dallas metro. done. i know the model, the margins, the scalability, the operator risk.\n\nwhat kills field service pitches is the same thing you're describing - founders lead with \"we've been serving customers for 12 years with a dedication to quality.\" ok, but what's your churn? how many stops per day per truck? what's your close rate on estimates? if you don't have those numbers in paragraph one, you're asking me to build a model from scratch before i know if i even want to.\n\nthe metrics that actually matter for field service specifically:\n- recurring % vs one-time (recurring routes trade at different multiples)\n- route density (stops per mile - tells you margin per truck instantly)\n- avg ticket and close rate on estimates\n- seasonal revenue spread (high swing = higher risk)\n- owner dependency (can the business run without the founder on a truck)\n\nthe owner dependency one gets buried the most. i've seen $1.2M/yr lawn care businesses where the owner does 40% of the routes personally. that's not a business you're buying, that's a job. someone who leads with \"owner-operated, 3 route managers, owner out of day-to-day 18 months ago\" just told me something that adds a full turn to the multiple.\n\nnumbers first, story second.",
          "score": 2,
          "created_utc": "2026-02-23 15:21:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7coxza",
              "author": "Neither-Shallot-9665",
              "text": "great insights man\n\n",
              "score": 1,
              "created_utc": "2026-02-25 16:38:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6yu8q5",
          "author": "drteq",
          "text": "It's because in a sea of spam, the only differentiator between a real person and a scam is who you are.  Finding the balance and breaking through the noise is a major issue, only being exacerbated by AI outreach.",
          "score": 2,
          "created_utc": "2026-02-23 15:43:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cp8kd",
              "author": "Neither-Shallot-9665",
              "text": "yea and now everyone hates ai and if youre cought using it, youre hated too. i think there should be a balance",
              "score": 1,
              "created_utc": "2026-02-25 16:40:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o71apst",
          "author": "Old-Citron8524",
          "text": "Totally agree on leading with numbers, but I'd push it a bit further than just revenue.\n\nThe pitches that actually stick with me include value metrics too. Things like how many hours it saves customers, jobs completed per week, average time from lead to booked, and how much of the work is repeat vs reactive. That kind of stuff.\n\nRevenue tells you how big it is. Value metrics tell you *why* it's that big and whether it'll stay that way.\n\nLike, two businesses can both say \"$22k MRR\" but if one is genuinely saving shops 10 hours a week and the other is just another dashboard nobody loves, those are completely different businesses under the hood.\n\nThe spec sheet approach still works, just think the best ones show proof of impact, not just proof of income.",
          "score": 2,
          "created_utc": "2026-02-23 22:42:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cpyzk",
              "author": "Neither-Shallot-9665",
              "text": "Exactly, Impact first, numbers second, and story third, when all of it combined, its just perfect",
              "score": 2,
              "created_utc": "2026-02-25 16:43:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73n8dl",
          "author": "Informal-Virus4452",
          "text": "this is so accurate it hurts. nobody wakes up caring about your origin story. they care about signal.\n\n“280 customers, $22k MRR” immediately tells me if I should lean in or move on. “cutting edge AI platform” tells me nothing.  \nsame thing I’ve noticed when sending decks — when I lead with numbers (even just tightening the top slide in Notion or Runable before sharing), replies go up. when I lead with vision, crickets.\n\nnumbers earn the right to tell the story. not the other way around.",
          "score": 2,
          "created_utc": "2026-02-24 07:54:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cpod8",
              "author": "Neither-Shallot-9665",
              "text": "its basically learning to balance the story and the numbers",
              "score": 1,
              "created_utc": "2026-02-25 16:42:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o741plv",
          "author": "trainmindfully",
          "text": "this is spot on, clarity signals confidence and fluff usually signals insecurity. if you lead with real numbers and specifics, people instantly know you respect their time and actually have something tangible to show.",
          "score": 2,
          "created_utc": "2026-02-24 10:11:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cpj98",
              "author": "Neither-Shallot-9665",
              "text": "yesssirr, you got that summarised",
              "score": 1,
              "created_utc": "2026-02-25 16:41:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o76f8mm",
          "author": "Old-Routine1926",
          "text": "I don't think it’s not that people don’t care about the journey, it’s that they can’t place it themselves. Without context like scale, stakes, or who it’s for, there’s nothing to anchor the story to. So it then just reads like a lot of noise instead of something worth following.",
          "score": 2,
          "created_utc": "2026-02-24 18:10:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cnk8z",
              "author": "Neither-Shallot-9665",
              "text": "yea and thats the problem...",
              "score": 1,
              "created_utc": "2026-02-25 16:32:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6y6eq4",
          "author": "udaan04",
          "text": "Are you a VC yourself? Sewms like you recieve a lot of pitches. Just honestly curious.",
          "score": 1,
          "created_utc": "2026-02-23 13:37:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6y6l63",
              "author": "Neither-Shallot-9665",
              "text": "Nope, private equity",
              "score": 2,
              "created_utc": "2026-02-23 13:38:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6y9o5i",
                  "author": "udaan04",
                  "text": "Do you have any advice or suggestion for cold email? What is one thing one should do and one thing they should avoid.",
                  "score": 2,
                  "created_utc": "2026-02-23 13:56:13",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6y70or",
                  "author": "udaan04",
                  "text": "Okk. Gotcha.",
                  "score": 1,
                  "created_utc": "2026-02-23 13:41:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o70njp4",
          "author": "EngineeringSea3060",
          "text": "Fastest way to learn common Spanish words. 10 customers. $18 total sales. 100% retention. 10 days old. 😎\n\ncurious to hear more?",
          "score": 1,
          "created_utc": "2026-02-23 20:47:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cpehc",
              "author": "Neither-Shallot-9665",
              "text": "i dont get you bro\n\n",
              "score": 1,
              "created_utc": "2026-02-25 16:41:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rfiuo9",
      "title": "how do you actually evaluate business software when every vendor says they're the best",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rfiuo9/how_do_you_actually_evaluate_business_software/",
      "author": "Traditional_Zone_644",
      "created_utc": "2026-02-26 18:54:20",
      "score": 9,
      "num_comments": 21,
      "upvote_ratio": 0.92,
      "text": "Running a small business and technology decisions are overwhelming honestly. Every vendor claims their solution is perfect, online reviews are obviously gamed, and I don't have the technical background to evaluate claims myself. Used to rely on our msp but they only know infrastructure stuff not business applications. Industry events are just vendor pitches dressed up as education. I've wasted money on tools that looked great in demos and completely fell apart with real customers. How do other small business owners figure out what actually works without burning through cash on stuff that doesn't deliver?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rfiuo9/how_do_you_actually_evaluate_business_software/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o7kc7uo",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 6,
          "created_utc": "2026-02-26 19:03:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l23yg",
              "author": "Outside-Argument-103",
              "text": "☝️",
              "score": 1,
              "created_utc": "2026-02-26 21:07:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7kc2xn",
          "author": "Realistic-Bag7860",
          "text": "Free trials with real data, not the sandbox they set up for you. Half the stuff I've tried breaks the moment you throw actual messy customer info at it.\n\n  \n",
          "score": 5,
          "created_utc": "2026-02-26 19:02:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7yujcx",
              "author": "thankyoukirby",
              "text": "It’s not that simple because you have to use it in your operational flow to really know what works and get feedback from the team. It’s too hard and expensive in person hours to do trial runs like that. Only thing I’ve seen work is taking one member of the team or a small group and having them actually go through the workflow and try out and help with the decision on what will work best.",
              "score": 1,
              "created_utc": "2026-03-01 00:02:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7kbz0i",
          "author": "Select-Print-9506",
          "text": "Same problem and I basically just try stuff with short contract terms and cut what doesn't work. Sonant for phones worked out, hubspot for crm worked out, calendly for booking worked out. Tried a chatbot for our website that was useless, tried some ai email thing that sounded great in the demo but sent weird replies to clients so we killed it after a month. Expensive way to learn but at least the lessons are real. My rule now is nothing longer than a month to month commitment until I've seen it work with actual clients, not just in a demo environment.\n\n  \n",
          "score": 2,
          "created_utc": "2026-02-26 19:02:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7la2ed",
          "author": "phreak9i6",
          "text": "Instead of starting with software as the solution. Define your requirements, evaluate the best solution that meets your requirements.  Then determine what solution provides the highest value for your dollar.\n\nIf you have access to Gartner reports, they can be helpful with b2b alignment - or just look at the magic quadrent.",
          "score": 2,
          "created_utc": "2026-02-26 21:45:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ldmqb",
          "author": "Old-Citron8524",
          "text": "I learned this the expensive way: stop evaluating vendors first and start by evaluating yourself.  \n  \nMost of us look at features, integrations, dashboards, and AI magic before we’ve clearly defined what we actually need fixed. If you can’t clearly explain the exact problem, where it shows up in your workflow, what it’s costing you (time, money, stress), and what “fixed” would realistically look like, then every demo will feel impressive.  \n  \nVendors are selling possibility, you need clarity.  \n  \nThe tool I regret buying looked great in a controlled demo, but didn’t actually map to a real, documented process in my business. Now I won’t even take a demo unless I’ve mapped the workflow first. Software should plug into a defined process, not become the process.",
          "score": 2,
          "created_utc": "2026-02-26 22:02:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kdi0u",
          "author": "overoveroversize",
          "text": "start by asking yourself what specific problem you're trying to solve and what metrics you'll use to measure success - for us, it was getting more customer reviews, so we started asking right after delivery and made the ask one-click and our response rate jumped. we use reviewlee to collect and manage them, been pretty low-key and cost-effective so far. been burned by flashy demos before so now i try to focus on talking to other business owners who've actually used the tool in production",
          "score": 1,
          "created_utc": "2026-02-26 19:09:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mihon",
          "author": "Imaginary_Mistake_68",
          "text": "You could also see if the vendor is willing to have a trial period where you can back out if things don't go according to plan. 10/10 times the vendor with the shitty service will not waste their time",
          "score": 1,
          "created_utc": "2026-02-27 01:44:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mqcix",
          "author": "trainmindfully",
          "text": "i’ve started treating demos like auditions instead of presentations and forcing vendors to show my actual workflow with real edge cases, not their polished happy path, plus asking what breaks or needs workarounds before i sign anything, and honestly talking to a couple current customers off the record has saved me more money than any comparison chart ever did.",
          "score": 1,
          "created_utc": "2026-02-27 02:30:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ngg35",
          "author": "SaucyScene",
          "text": "Is speed a factor in your industry?",
          "score": 1,
          "created_utc": "2026-02-27 05:16:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nymft",
          "author": "Vaibhav_codes",
          "text": "Focus on your actual needs, test with real data, score tools objectively, and start with a small pilot real user feedback beats demos and hype every time",
          "score": 1,
          "created_utc": "2026-02-27 07:45:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o5ugb",
          "author": "Cool-Gur-6916",
          "text": "Ignore marketing and test tools in real workflows. Start with a short list from communities and independent sources like G2 or Capterra, then run a 2-week pilot using your actual data and team. Evaluate three things: ease of use, integration with your current stack, and support responsiveness. Also ask vendors for customer references in your industry. Small pilots reveal far more than polished demos.",
          "score": 1,
          "created_utc": "2026-02-27 08:52:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o7ztv",
          "author": "CreativzGrowth",
          "text": "If you want less risk, shrink the decision. Seen a lot of small businesses burn cash trying to roll out new software everywhere at once.\n\nWhat’s worked better:  \nPick one thing you want to improve, like faster follow-up, fewer no-shows, or more reviews.  \nTest the tool for that one outcome only.  \nFigure out what success looks like in 30 days before you commit.  \nPut one person in charge of making it work.\n\nIf the metric doesn’t move, cut it. Software only gets expensive when you’re not clear on what you want. Tie it to one result and it stays manageable.",
          "score": 1,
          "created_utc": "2026-02-27 09:13:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ow8lv",
          "author": "BuiltCorrect",
          "text": "That vendor noise is brutal. Every demo looks perfect, every case study is glowing, then you pay and realize it's nothing like they showed you. I've been burned the same way more than once.\n\nI started treating demos like test drives instead of sales pitches. Get a trial account, throw real customer data at it, see how it breaks. If they won't let you test without a sales call, that's usually a red flag. Also started asking for referrals to actual customers using it in businesses like mine, not just the ones they prepped for references.\n\nAfter getting burned a few times I ended up building my own system because I got tired of software that looked great but didn't fit how I actually work. No flashy demos, just stuff that does what it's supposed to.\n\nWhat was the last tool that looked great in the demo but fell apart for you?",
          "score": 1,
          "created_utc": "2026-02-27 12:38:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p4y4a",
          "author": "TrollPro9000",
          "text": "If a seller says \"best\" you say \"how\"",
          "score": 1,
          "created_utc": "2026-02-27 13:32:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pavwo",
          "author": "techside_notes",
          "text": "I stopped trying to evaluate tools based on features and started evaluating them based on friction.\n\nNow I’ll define a tiny real world use case first. One workflow that actually matters in my business. Then I test the tool only against that. Not the shiny roadmap. Not the demo environment. Just, can I complete this simple flow without wanting to rip it apart.\n\nI also pay attention to setup energy. If I need five integrations and a long onboarding just to get a basic version live, that’s usually a signal it’ll be heavy long term.\n\nAnd I try to decide what the tool replaces. If it doesn’t clearly remove something from my stack or simplify a process, it’s probably just adding noise.",
          "score": 1,
          "created_utc": "2026-02-27 14:05:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7udy31",
          "author": "neil_s",
          "text": "Ask a different MSP. They can tell you what other clients like you (size, industry, use case) have deployed, what worked and what didn't. If they haven't seen this category in their other clients, they can run a bake-off for you and evaluate the tech behind the flashy demos and claims.   \n  \nWe do this for our clients all the time, and would be happy to do it for a prospective client once in a while to start building a relationship. We recommend business apps, plumb new apps with other systems and workflows for customers, and sometimes even build custom tools when off-the-shelf isn't cutting it.\n\nShort of that, you could use G2, but it working for different kinds of companies might not mean it'll work well for you. You could do trials, but that's time intensive and sometimes it's not easy to try software without changing team or customer-facing workflows.",
          "score": 1,
          "created_utc": "2026-02-28 07:25:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgxm9c",
      "title": "Tell me what your SaaS does, and I will find your potential buyer on Reddit.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rgxm9c/tell_me_what_your_saas_does_and_i_will_find_your/",
      "author": "guardianandromeda",
      "created_utc": "2026-02-28 08:44:56",
      "score": 9,
      "num_comments": 34,
      "upvote_ratio": 0.8,
      "text": "Share a brief description of your SaaS, and I’ll track down potential customers.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rgxm9c/tell_me_what_your_saas_does_and_i_will_find_your/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o7utugj",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-28 09:54:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7utuhs",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rgxm9c/tell_me_what_your_saas_does_and_i_will_find_your/o7utugj/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-28 09:54:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7vtcfv",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-28 14:26:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7vtchb",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rgxm9c/tell_me_what_your_saas_does_and_i_will_find_your/o7vtcfv/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-28 14:26:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7vtriu",
          "author": "New-Acanthisitta1936",
          "text": "\"brb: walk to unlock apps\" on app store - block TikTok, IG, or any distracting apps until you hit a daily step goal",
          "score": 1,
          "created_utc": "2026-02-28 14:28:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wib3u",
          "author": "Impressive-Eggplant6",
          "text": "Moor.ad let's newsletter operators search any town or niche, find every business possible, and email them directly for advertising, then schedule their ad in your newsletter.",
          "score": 1,
          "created_utc": "2026-02-28 16:36:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wijin",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-28 16:37:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7wijm9",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rgxm9c/tell_me_what_your_saas_does_and_i_will_find_your/o7wijin/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-28 16:37:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7wipea",
          "author": "dontshootimlost",
          "text": "You can create a clean landing page for your mobile app in under 10 minutes with Storepage. It’s a no-code app landing page builder plus it generates and hosts your Privacy Policy + Terms, and even hosts your app-ads.txt. Built-in SEO and Open Graph support, with custom domain or subdomain options.\n\nYour first site is completely free to publish.",
          "score": 1,
          "created_utc": "2026-02-28 16:38:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wnaop",
          "author": "feelnature",
          "text": "i am currently in demand testing for my idea validator with helping you turn your idea into startup with my expertise in research, copywriting, ux, psychology.  \nProvide some advice on where can i find potential first customers",
          "score": 1,
          "created_utc": "2026-02-28 17:00:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7wrnoy",
              "author": "Wide_Brief3025",
              "text": "Niche subreddits around startup validation, SaaS founders, and product development are great places to connect with people looking for help with idea validation. You might find more relevant leads if you use a tool like ParseStream that monitors conversations in real time across several platforms and sends alerts when your target topics come up.",
              "score": 1,
              "created_utc": "2026-02-28 17:22:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7wxkv5",
                  "author": "feelnature",
                  "text": "thanks a lot",
                  "score": 1,
                  "created_utc": "2026-02-28 17:53:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7x2j4u",
          "author": "yuvrajchowdhxry",
          "text": "I work at a startup called OmniDimension. We provide voice AI services to enterprises for customer care in a much more efficient, lower-cost way. We have plenty of tts, stt, AI models to support AI conversations, you will get call logs, call recording, analytics dashboard, summary, and sentiment analysis and whatnot. We have voice from eleven labs, Cartessia, Sarvam, etc",
          "score": 1,
          "created_utc": "2026-02-28 18:17:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x6fv4",
          "author": "DarkAI_Official",
          "text": "I have an artificial intelligence service that can be created as a community-based agent and chatted uncensored. You can access the details in my profile",
          "score": 1,
          "created_utc": "2026-02-28 18:36:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x6gnm",
          "author": "DarkAI_Official",
          "text": "I have an artificial intelligence service that can be created as a community-based agent and chatted uncensored. You can access the details in my profile",
          "score": 1,
          "created_utc": "2026-02-28 18:36:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xvjjg",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-28 20:47:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xvjlr",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rgxm9c/tell_me_what_your_saas_does_and_i_will_find_your/o7xvjjg/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-28 20:47:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7y0wse",
          "author": "metaparlour",
          "text": "Check out Metaparlour.io!",
          "score": 1,
          "created_utc": "2026-02-28 21:16:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7y14b7",
          "author": "productman2217",
          "text": "Building ticketbuddy.ai turn your site data into a customer support tool + bot.",
          "score": 1,
          "created_utc": "2026-02-28 21:17:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7zf3mq",
          "author": "TahmeedSayaan",
          "text": "I am building AI Chatbot that you can ask your daily questions",
          "score": 1,
          "created_utc": "2026-03-01 02:06:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o805uic",
          "author": "Mindless_Stranger_20",
          "text": "Taktical Digital its basically offers a range of services, including content marketing, SEO, paid social and search advertising, landing page optimization, and Amazon services. They also specialize in \"Brandformance\" marketing, integrating brand development with performance marketing strategies.",
          "score": 1,
          "created_utc": "2026-03-01 05:03:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80akq1",
          "author": "Icy_Collection_3265",
          "text": "AIpolicies is a tool that helps community health centers and other clinics generate HRSA-compliant, evidence-aligned policies using AI, saving time and reducing risk. Its customers are health centers, clinic administrators, compliance teams, and practice leaders who need reliable policy content without hiring costly consultants.",
          "score": 1,
          "created_utc": "2026-03-01 05:39:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80f3lv",
          "author": "MoAsad1",
          "text": "Cybersecurity awareness",
          "score": 1,
          "created_utc": "2026-03-01 06:16:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7v781m",
          "author": "OrganizationOne8338",
          "text": "I am building podessence , It's essentially a productivity tool for the podcast ecosystem, helping users get to the value-density of a 2-hour episode in about 30 minutes.",
          "score": 1,
          "created_utc": "2026-02-28 11:57:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80yca4",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-03-01 09:13:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o80ycf3",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rgxm9c/tell_me_what_your_saas_does_and_i_will_find_your/o80yca4/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-03-01 09:13:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o80yx8i",
              "author": "guardianandromeda",
              "text": "Post Title:Does anyone else binge educational content but retain absolutely nothing?\n\nReply Format:\nThis hits hard. The “illusion of competence” is real.\nLong-form podcasts feel productive, but without compression + review, most of it evaporates.\nI’m actually building something around this exact problem — helping people turn a 2-hour podcast into ~30 minutes of high-signal takeaways they can revisit.\nCurious: what part helps you retain more — summaries, forced recall, or revisiting key moments?",
              "score": 1,
              "created_utc": "2026-03-01 09:19:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7umo9u",
          "author": "Less-Bite",
          "text": "Finding leads on Reddit is a huge use case for solo founders. Tools like GummySearch, purplefree, and Syften actually focus on this exact workflow by analyzing posts and comments to identify potential customers automatically.",
          "score": 0,
          "created_utc": "2026-02-28 08:45:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7un4iy",
              "author": "guardianandromeda",
              "text": "So you are promoting your tool purple free.ca as i see the same link in your profile.",
              "score": 1,
              "created_utc": "2026-02-28 08:49:36",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7wxfda",
              "author": "Striking_Ad_2346",
              "text": "I’ve been using Leadmatically for this and it’s been solid. It monitors subreddits automatically and drafts contextual replies, which saves a ton of time",
              "score": 1,
              "created_utc": "2026-02-28 17:52:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7un12w",
          "author": "HarjjotSinghh",
          "text": "wow what's this genius idea? let me buy yours already.",
          "score": 0,
          "created_utc": "2026-02-28 08:48:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vkbyw",
          "author": "SlowPotential6082",
          "text": "y actually talk about their problems. When I was building my first product I spent weeks on Reddit just lurking in communities where my target customers hung out and the language they used to describe their pain points became my entire messaging strategy. You end up with copy that converts because it mirrors exactly how prospects think about the problem.",
          "score": 0,
          "created_utc": "2026-02-28 13:32:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vrmcz",
          "author": "Old_Lab1576",
          "text": "Its called phentix.app you can check it out",
          "score": 0,
          "created_utc": "2026-02-28 14:16:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81fgj0",
              "author": "guardianandromeda",
              "text": "Post Title:\nNeed a CRM/Lead Generation Suite for a Small Digital Business\n\nReply Format:\nFor easy contact uploads, newsletters, open tracking, and lead nurturing without HubSpot pricing, Phentix.app is worth a look simple and affordable.",
              "score": 1,
              "created_utc": "2026-03-01 11:55:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rhrzv2",
      "title": "My most successful startup is the onen that never launched",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rhrzv2/my_most_successful_startup_is_the_onen_that_never/",
      "author": "PastPicture",
      "created_utc": "2026-03-01 08:24:14",
      "score": 9,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I have made all my money working for startups, be it consulting, contract or as an employee.\n\nI have also tried and failed to monetise some apps.\n\nThe one that give me the utmost satisfaction was my last app. I didn’t write any code. \n\nI vibe coded a landing page, created PDFs, screenshots. Introduced the idea to my clients. Everyone liked the idea. \n\nThe product was “obviously going to sell” according to everyone, including ChatGPTs and Claudes of the world.\n\nIt was solving a real problem. \n\nNow I meet this potential investor-cum-partner-cum-customer kinda guy. He was the perfect candidate for this. And he immediately was hooked on the idea. \n\nWe spent 2 hours talking but believe me it was him telling me to build anything else but this, and he’d put his money and time. He had tried and worked on this idea multiple times. \n\nHis points made sense like no one else’s did. \n\nHe told me it’s definitely going to make money but never past $ XXX.\n\nI shut it down after a few days.\n\nBut boy it seemed more successful than all the apps I spent endless hours shipping, perfecting, fixing. \n\nThere’s no sense to build a thing (if the goal is revenue) if there is not a distribution waiting for you.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rhrzv2/my_most_successful_startup_is_the_onen_that_never/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o81e54e",
          "author": "Puzzleheaded-Try737",
          "text": "This is a massive win. Saving years of opportunity cost is the truest form of startup success.\n\nHaving gone through the lifecycle of building and selling a couple of startups, I can confidently say the ones that actually scaled were the ones where distribution was figured out before writing a single line of code. The ideas that fail are usually the ones where we code in a vacuum for six months and then pray for customers.\n\nThat investor gave you a massive gift. Everyone will tell you an idea is \"revolutionary\" when they don't have to pull out their credit card or figure out the acquisition channels. Killing an idea gracefully is a superpower.",
          "score": 2,
          "created_utc": "2026-03-01 11:43:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o818ps6",
          "author": "NeedleworkerSmart486",
          "text": "The distribution point at the end is the real takeaway. I spent months building something nobody could find because I had no channel to get it in front of people. Now I always ask who is already waiting for this before writing a single line of code. Saved me from building two more things nobody would use.",
          "score": 1,
          "created_utc": "2026-03-01 10:53:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81465x",
          "author": "trainmindfully",
          "text": "honestly that kind of almost win can feel better than a messy real launch because the idea stays perfect in your head, but that investor convo sounds like the most valuable validation you could’ve gotten since it forced you to look at ceiling and distribution before burning months building.",
          "score": 1,
          "created_utc": "2026-03-01 10:09:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o819v0t",
          "author": "Rich-Editor-8165",
          "text": "This is honestly such a mature take. Killing an idea early because the ceiling is low isn’t failure, it’s discipline. Most founders fall in love with “it will make money” and ignore “how much and how scalable.” Distribution and upside matter more than validation applause. Sometimes the smartest launch is the one you don’t do.",
          "score": 1,
          "created_utc": "2026-03-01 11:04:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdlzfh",
      "title": "trying to reduce insurance agency overhead costs before a valuation and the labor piece is brutal",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rdlzfh/trying_to_reduce_insurance_agency_overhead_costs/",
      "author": "Lonely-Ad-3123",
      "created_utc": "2026-02-24 17:07:02",
      "score": 8,
      "num_comments": 9,
      "upvote_ratio": 0.91,
      "text": "Positioning for a potential transaction and our overhead as a percentage of revenue is higher than comparable agencies. The obvious vendor consolidation and license renegotiation was easy but the real cost driver is labor allocated to low value tasks, and that's way harder to untangle because people have feelings about workflow changes.\n\nWhen I mapped where my staff's hours go versus what actually generates revenue the gap was uncomfortable. Experienced people doing data entry, answering questions a website faq could handle, manually scheduling appointments. Nobody designed it this way it just accumulated and now it's embedded in how we operate. Changing it without making the team feel like you're trying to replace them is... a whole thing.",
      "is_original_content": false,
      "link_flair_text": "Idea Validation",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rdlzfh/trying_to_reduce_insurance_agency_overhead_costs/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o77l3m8",
          "author": "aussieblasted",
          "text": "I would let them see it as an oppertunity for growth. Have someone come in and offer to teach anyone how to do automations to get rid of waste. The same person then systemitiz tasks with the actual people using it. There will be resistnace, but as others have stated, if you come from the approach \"Whats the most boring part of your day\" and go from there, people will get on board.\n\n",
          "score": 2,
          "created_utc": "2026-02-24 21:20:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78dlse",
              "author": "hairyconary",
              "text": "What tools are you guys using, to have a systematic way of automating tasks. Does it always start with n8n or zapier? Also how to decide what to do first. Analysis paralysis ",
              "score": 1,
              "created_utc": "2026-02-24 23:42:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o76frbd",
          "author": "blanssius_56",
          "text": "we run an insurance operation and phone intake was our biggest waste of skilled labor, routing it through sonant and automating scheduling through calendly freed up hours that now go toward production. Margins improved without cutting anyone",
          "score": 1,
          "created_utc": "2026-02-24 18:12:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76j3o6",
          "author": "CharacterHand511",
          "text": "staff will resist if they think it's about headcount cuts. We framed it as getting people off the boring stuff and they came around once they realized we meant it",
          "score": 1,
          "created_utc": "2026-02-24 18:27:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76lh1l",
          "author": "osiris_rai",
          "text": "went through this before we sold, biggest win was standardizing processes across locations so the buyer saw a repeatable operation not a collection of individual shops",
          "score": 1,
          "created_utc": "2026-02-24 18:37:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76nprv",
          "author": "KonKaizo",
          "text": "This is a classic operational bottleneck. The \"embedded\" workflow usually just means your top performers are being used as expensive secretaries, which actually hurts your valuation more than the line-item costs because it shows a lack of scalability.\n\nAt meetergo, we’ve seen agencies solve the manual scheduling piece by framing it to the team not as \"replacing\" them, but as \"offloading the grunt work\" so they can focus on high-commission activities. If you automate the low-value touchpoints like using a booking link with an integrated intake form you aren't just cutting overhead; you’re proving to a buyer that your agency can grow without linearly increasing your headcount.",
          "score": 1,
          "created_utc": "2026-02-24 18:47:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76nxxf",
          "author": "andrew-ooo",
          "text": "The valuation angle makes this interesting because buyers will do QoE on labor allocation regardless - better for you to surface it proactively with a clear remediation story. Document the before/after: \"Producer X spent 12 hrs/week on scheduling, now spends 2 hrs on exceptions.\" That narrative of identified inefficiencies and implemented fixes is actually more valuable than just showing clean numbers, because it demonstrates operational awareness. The team resistance is real but temporary - once one person gets their afternoons back, they become your internal champion.",
          "score": 1,
          "created_utc": "2026-02-24 18:48:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78zeci",
          "author": "No_Boysenberry_6827",
          "text": "insurance agencies have some of the highest overhead in professional services and most of it comes from the sales and client acquisition side\n\nthe biggest cost drain we've seen in similar businesses is the human-heavy front end - people doing follow-ups, quoting, chasing renewals, and qualifying leads manually. those tasks eat 60-70% of most agencies' labor costs and they're the most automatable\n\nbefore cutting costs for a valuation, I'd look at which processes are repeatable enough to systematize. if your team is doing the same follow-up sequence for every lead, that's a system not a job\n\nwhat's your current team structure look like?",
          "score": 1,
          "created_utc": "2026-02-25 01:43:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rckm1f",
      "title": "The un-sexy side of the \"Ride Along\" - Why I finally stopped using my home address for my LLC filings.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rckm1f/the_unsexy_side_of_the_ride_along_why_i_finally/",
      "author": "rennan",
      "created_utc": "2026-02-23 15:34:18",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 0.74,
      "text": "We talk a lot about marketing stacks, cold outreach, and hitting those first revenue milestones, but I rarely see anyone talk about the literal \"physical\" footprint of their business.  \n  \nWhen I first started out, I did the classic bootstrapper move: I filed my LLC using my home address to save $100. At the time, it felt like a smart way to keep overhead low. But as I started scaling and actually getting some traction, I realized I’d made a permanent privacy mistake.  \n  \nThe moment you register your entity, your home address is etched into the Secretary of State’s public database forever. Anyone - disgruntled customers, weirdly aggressive competitors, or just random data scrapers - can find exactly where you sleep with a two-second Google search. It’s one of those \"day one\" decisions that you don't think about until it’s too late.  \n  \nI recently spent the weekend \"sanitizing\" my public records. I had to file amendments to switch over to a commercial registered agent. I ended up going with InCorp just to get a solid commercial buffer between my living room and the public record. It’s a small annual expense, but the peace of mind of having a professional suite address on my filings instead of my front door is worth every penny.  \n  \nIf you’re just starting your journey or filing your first entity this month, seriously, don’t be like me. Don't trade your physical privacy for a few bucks in saved fees. Use a proper agent from the start.  \n  \nDid you start with a commercial address from day one, or did you also have to go through the headache of scrubbing your home address off the internet later?",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rckm1f/the_unsexy_side_of_the_ride_along_why_i_finally/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o6yt22a",
          "author": "HarjjotSinghh",
          "text": "you're now renting a vault for your business soul.",
          "score": 6,
          "created_utc": "2026-02-23 15:37:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yvstj",
              "author": "rennan",
              "text": "Nailed it. It’s crazy how much lighter you feel once that firewall is up. Best sleep I've had in a while.",
              "score": 4,
              "created_utc": "2026-02-23 15:50:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6zd98r",
          "author": "imsoupercereal",
          "text": "Thanks for heads up.  Was pondering the privacy implications of filing an LLC the other day.",
          "score": 2,
          "created_utc": "2026-02-23 17:12:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zn6zl",
          "author": "zenbusinesscommunity",
          "text": "Going the DIY route makes sense and works well for some, so we'll never disparage that, but this is a really great point worth considering from the start. Once the LLC's filed, the junk mail telling you you owe money is typically the first sign, then you google your business and your address is right there. Switching to a commercial registered agent later isn’t hard, but it just doesn’t erase what’s already been indexed unfortunately. It just puts a buffer in place going forward. So at the beginning, it really helps to weigh that cost vs privacy concerns.",
          "score": 2,
          "created_utc": "2026-02-23 17:58:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zs0am",
          "author": "NWRegAgentJaq",
          "text": "The privacy angle really can't be overstated - not because you've got anything to hide, but because you don't know the motivation/intention of everyone who's trying to get hold of that information. Like yes, absolutely, it makes sense to want to save cash up front, especially if all you're really worried about is getting more junk mail, but I've seen stories about customers showing up to someone's home because that's what shows as their business address. No thank you!!\n\nAnd yes too, it's a day-one thing I wish more folks knew about. Once that record is in there, changing to a commercial registered agent doesn't undo or erase its existence - folks can usually still dig it up if they're determined by looking at your previous filings. It's still a good idea to do as an extra layer so it's not the first thing people see if they look you up. Glad you were able to get that peace of mind.",
          "score": 2,
          "created_utc": "2026-02-23 18:20:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7234ds",
          "author": "Unhappy-Bunch-4594",
          "text": "this is one of those things nobody warns you about because its not \"sexy\" startup advice but its legitimately important. did the same thing with my first LLC — used my apartment address, and within a month i was getting sketchy \"compliance notice\" mailers that looked official but were just upselling services. that alone was annoying enough.\n\nthe registered agent switch is worth it just for the mail filtering honestly. most services run $100-150/year which is nothing compared to the headache. but one thing id add — if you also need a business mailing address (not just registered agent), look into getting a box at a UPS Store. they give you an actual street address instead of a PO box number, so it looks like a real office. runs about $200-300/year depending on location. i use that as my business address on everything — invoices, contracts, google business profile, the works.\n\nthe google business profile thing is the other one nobody talks about. if youre a service business and you set up GBP with your home address, thats publicly visible too. you can hide it for service-area businesses but a lot of people dont realize that until after theyve already verified with their home address showing.",
          "score": 2,
          "created_utc": "2026-02-24 01:20:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78ispd",
          "author": "PM_CHEESEDRAWER_PICS",
          "text": "This isn't going to make a lick of difference for anyone motivated to do any of the things you're worried about. The real question is, what the fuck are you doing that this is a concern ",
          "score": 1,
          "created_utc": "2026-02-25 00:11:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7a9rh8",
          "author": "HarjjotSinghh",
          "text": "ohhh what's my new real mailbox?",
          "score": 1,
          "created_utc": "2026-02-25 06:47:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfg1lu",
      "title": "Never build a SaaS rather always buy (explained)",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rfg1lu/never_build_a_saas_rather_always_buy_explained/",
      "author": "wealthymanwithmoney",
      "created_utc": "2026-02-26 17:13:52",
      "score": 7,
      "num_comments": 11,
      "upvote_ratio": 0.82,
      "text": "The biggest advantage of buying a SaaS isn’t speed but it’s probability ok.\n\nWhen you build from scratch, you’re starting with zero proof & you don’t know if people will pay or if the problem is painful enough. Most projects die quietly because the market doesn’t respond.\n\nWhen you buy an existing SaaS, you skip that uncertainty. Revenue already exists, customers already pay. There’s real behavior, not just assumptions. You’re not guessing whether the product works instead you’re evaluating how well it works & also second big advantage is structure.\n\nWhen building, you invest time, money, and energy upfront with no return guarantee. When buying, especially in small deals, you don’t always need to put everything down in cash. Seller financing changes the equation.\n\nInstead of paying 100% upfront, you can structure part of the deal over time. The business itself helps pay for the acquisition. You’re still taking risk, of course. Revenue can drop. Things can break but you’re operating from existing cash flow, not pure hope.\n\nBuilding is high upside, high uncertainty. Buying is lower uncertainty, & also high upside if you choose well and structure smartly.\n\nIt’s not about which path is “better.” It’s about whether you want to fight product-market fit from zero, or start with proof and focus on optimization.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rfg1lu/never_build_a_saas_rather_always_buy_explained/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o7k9kic",
          "author": "aviral-bhutani",
          "text": "i get the logic here, especially around probability.\n\nstarting from zero is brutal. You’re guessing on demand, pricing, positioning… and most projects just die quietly. buying something with existing revenue at least gives you proof that people care enough to pay.\n\nthat said, buying isn’t “safe” either. You’re betting that the revenue is stable, churn is under control, and growth hasn’t already plateaued. Sometimes you’re buying a flat or declining asset and don’t realize it until you’re in.\n\nto me it comes down to personality, if you enjoy creation and can handle uncertainty ,build. if you’re more into optimization, systems, and improving what already works → buy.\n\nneither is easier. You’re just choosing which hard you prefer. ",
          "score": 2,
          "created_utc": "2026-02-26 18:51:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kgfg2",
              "author": "wealthymanwithmoney",
              "text": "Def nothing is easier. But you have some traction & PMF that's already tested & delved with early phase issues!",
              "score": 1,
              "created_utc": "2026-02-26 19:23:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7lbbvd",
          "author": "HiddenDrip77",
          "text": "Buying is definitely safer if you have the capital upfront. Most people fail at the \"zero to one\" stage because they build things nobody actually wants to pay for. Starting with a proven customer base saves years of trial and error.",
          "score": 1,
          "created_utc": "2026-02-26 21:51:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7n9j10",
              "author": "wealthymanwithmoney",
              "text": "Yes! & you never want huge capital upfront if you structure properly.",
              "score": 1,
              "created_utc": "2026-02-27 04:28:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7nr2il",
          "author": "gr4phic3r",
          "text": "I built my SaaS for invoicing because I need it by myself. They shut down my old invoice tool and a didn't find anything which fit my needs, so I made one - so mine will always have 1 User and will save me money 😀",
          "score": 1,
          "created_utc": "2026-02-27 06:39:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nr7cg",
              "author": "wealthymanwithmoney",
              "text": "Haha 😄",
              "score": 1,
              "created_utc": "2026-02-27 06:41:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7pp9ti",
          "author": "titilepta",
          "text": "Where to buy saas and how? Do you have any recommendations ?",
          "score": 1,
          "created_utc": "2026-02-27 15:20:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7u0jwh",
              "author": "wealthymanwithmoney",
              "text": "You can find on web but I would recommend pocket-fund.com \nDM",
              "score": 1,
              "created_utc": "2026-02-28 05:30:47",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7usjvs",
              "author": "shattariddim",
              "text": "Acquire.com",
              "score": 1,
              "created_utc": "2026-02-28 09:41:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7kk5f6",
          "author": "HarjjotSinghh",
          "text": "this zero-to-product doubt? i'm stealing it for my soul.",
          "score": 0,
          "created_utc": "2026-02-26 19:41:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rf38ge",
      "title": "Trying to stay consistent even without results",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rf38ge/trying_to_stay_consistent_even_without_results/",
      "author": "lucky_bell_69",
      "created_utc": "2026-02-26 06:54:57",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "It’s harder than I expected. No real traction yet but I’m trying to build the habit of working on this daily. Sharing here to keep myself accountable.\n\nSome days feel okay, like I did something useful. Other days feel like I’m just doing stuff and not sure if it even matters.\n\nStill trying to figure out what to focus on. For now I just show up and do the work, even if nothing is happening yet.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rf38ge/trying_to_stay_consistent_even_without_results/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o7hctk5",
          "author": "Ukiyoprod",
          "text": "Most people will tell you “just stay consistent.”\n\nThat’s incomplete and honestly why most founders struggle with no progress for months.\n\nYou see, “consistency” only works if you’re being consistent with the right actions.  \nOtherwise, you’re just being consistent with nonsense.\n\nWhen you’re early on, your efforts should be uncomfortable and quantifiable:\n\n• Talk to users\n\n• Ship something\n\n• Get feedback\n\n• Repeat\n\nIf you didn’t do one of these things today, you weren’t busy. You weren’t working hard. You weren’t making progress. You were just busywork.\n\nShowing up matters.\n\nLearning loops matter more.",
          "score": 2,
          "created_utc": "2026-02-26 08:22:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hkpnq",
          "author": "HarjjotSinghh",
          "text": "consistency beats results every single time - win or lose",
          "score": 1,
          "created_utc": "2026-02-26 09:39:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7i6u7l",
          "author": "app_guide",
          "text": "I think I join you in this am all over the place, move with one thing daily until it works",
          "score": 1,
          "created_utc": "2026-02-26 12:43:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o8i6l",
          "author": "indexintuition",
          "text": "this stage is honestly the hardest because it feels like you are pouring energy into a void and getting silence back. when i was starting my small thing, i had to shrink my definition of progress to almost microscopic levels, like did i clarify one sentence on my page, did i test one tiny idea, did i reach out to one person. it helped me feel less like i was spinning my wheels. also, sometimes not seeing results just means you are still in the data gathering phase, even if it does not look impressive from the outside. the fact that you are showing up daily already puts you ahead of most people who quit when it feels awkward and invisible.",
          "score": 1,
          "created_utc": "2026-02-27 09:18:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7odfmh",
          "author": "lloydbh",
          "text": "It's understandable to feel that way when you're not seeing clear results yet. The early stages of a new project can be challenging, as our brains tend to crave immediate feedback and tangible progress. The temptation to give up or get discouraged is normal - your brain is wired to seek out quick rewards. But try not to judge those wavering days too harshly. \n\nDeveloping a consistent habit, even without instant gratification, is a powerful skill. Perhaps consider asking yourself - what small win could you celebrate today? It doesn't have to be a major breakthrough; even just showing up and doing the work is worthy of recognition. End of day reviews can also be quite motivating because you actually see and track the progress.\n\nAcknowledging those tiny steps can help reinforce the habit over time. And if you're ever feeling lost on what to focus on, try stepping back and asking, \"What's the most important thing I could do right now to move this forward?\" The answer may not be obvious, but focusing on that one key task can give you a sense of direction. Keep going, one day at a time. The consistency will pay off, even if the results aren't visible yet. Let me know if you'd like to brainstorm a bit more about staying motivated through the quiet periods.\n\nAs u/Ukiyoprod says, the trick is to stay consistent with actions that move you forward.",
          "score": 1,
          "created_utc": "2026-02-27 10:05:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rffs69",
      "title": "revenue that expands on its own changes everything about what a business is worth",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1rffs69/revenue_that_expands_on_its_own_changes/",
      "author": "Neither-Shallot-9665",
      "created_utc": "2026-02-26 17:04:34",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "So we're looking at two SaaS deals that came in almost back to back. First one does $35k MRR, growing around 3% month over month, 4% gross churn. Solid business by any normal measure. Second one does $8k MRR. Eight.\n\nGrowing maybe 2% monthly, 2% gross churn. On paper this shouldn't even be a conversation right. But the $8k one has 115% net revenue retention. I don't think most people really internalize what that number means so let me just walk through what happened when I modeled both of these out 24 months.\n\nThe $35k business is grinding. It's growing but it's constantly backfilling churn, spending on acquisition, fighting for every incremental dollar of MRR. By month 24 it's doing well but the cost structure to maintain that growth is brutal.\n\nThe $8k business is just... compounding on itself. Existing customers keep spending more. Seat expansions as their teams grow, they're hitting usage limits and bumping up tiers, they're adding on features a few months after signup. By month 24 that $8k is north of $22k MRR and the unit economics are legitimately insane because that expansion revenue costs basically nothing to generate. Zero acquisition dollars. And the gap between the two businesses is accelerating not narrowing.\n\nThe thing that keeps rattling around in my head is how many founders we talk to who are actively preventing this from happening to themselves and dont realize it. Flat rate pricing with unlimited everything.\n\nThey think theyre being generous or keeping things simple but what theyre actually doing is capping their own upside. We looked at one last year doing $25k MRR on flat pricing and when we dug into the usage data, something like 60% of customers were using less than a third of what they were paying for.\n\nThe founder could have moved to tiered pricing, gotten to $35k+ MRR, and most customers literally would not have noticed because they weren't bumping into any limits anyway. The pattern I keep seeing is that businesses where the average customer pays 20 to 40% more 18 months after signup versus what they paid on day one... those businesses are in a completely different valuation category. Like 1 to 2x multiple difference.\n\nBecause the math on customer lifetime value just changes fundamentally when revenue expands inside existing accounts. If you run a SaaS and youve never actually calculated this, go do it right now. Pull a cohort from 12 months ago. What were they paying then. What are the surviving ones paying today.\n\nIf that surviving cohort is paying more than the original full cohort's total, you have net negative churn and thats probably the most valuable thing about your business that you didnt know about. If theyre paying the same or less you have a pricing architecture problem thats directly costing you on valuation. Watched a founder last year add over $100k to their exit price by spending two months restructuring pricing before going to market. No new customers. No new features. Just better revenue architecture. Anyway idk why more people dont talk about this metric, its genuinely the first thing I look at now before anything else in diligence.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1rffs69/revenue_that_expands_on_its_own_changes/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o7l0qbd",
          "author": "HarjjotSinghh",
          "text": "this expansion magic? business gold!",
          "score": 1,
          "created_utc": "2026-02-26 21:00:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mlcgm",
          "author": "UnoMaconheiro",
          "text": "flat pricing with unlimited anything is basically self sabotage lol",
          "score": 1,
          "created_utc": "2026-02-27 02:01:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7s29yl",
          "author": "first-turn-capital",
          "text": "Net revenue retention is basically a proxy for how much of the future is already \"baked in.\" Buyers don't just pay for growth, they pay for predictable growth. When expansion revenue is coming from existing accounts, it feels lower risk than pure acquisition-driven growth, and that's usually where the multiple gap shows up. It's less about size and more about how durable the growth engine actually is.",
          "score": 1,
          "created_utc": "2026-02-27 22:12:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7y3ej1",
          "author": "MaxMcregor",
          "text": "That is a great position to be in revenue that grows on its own can really change the game. Focusing on the upselling often makes the biggest difference.",
          "score": 1,
          "created_utc": "2026-02-28 21:29:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1remvuj",
      "title": "Struggling with profitability at my software dev agency, how do you guys manage developer costs?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1remvuj/struggling_with_profitability_at_my_software_dev/",
      "author": "Late-Mushroom6044",
      "created_utc": "2026-02-25 19:17:38",
      "score": 5,
      "num_comments": 25,
      "upvote_ratio": 0.78,
      "text": "I run a small software development agency and I've hit a wall with margins. My biggest cost is developer salaries, and I can't seem to price projects high enough on the client side to make the math work. Good developers are expensive and senior engineers in the US are commanding $100k-$180k+. Meanwhile clients have a ceiling on what they'll pay for a project, and I keep running into situations where the delivery cost eats most of the revenue. A few things I've tried are raising rates, being more selective about projects. But I feel like I'm still not cracking it. A friend of mine who is in similar field suggested offshore hiring. how are you guys handling it?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1remvuj/struggling_with_profitability_at_my_software_dev/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o7el0sm",
          "author": "Fit-Leek-3158",
          "text": "You can hire offshore, correct. But you will first have to find someone you can rely on who is a local.\n\nIn my experience, many developers are doing multiple jobs at the same time. The real challenge will be building a team you can trust.",
          "score": 2,
          "created_utc": "2026-02-25 21:51:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dq3os",
          "author": "Fitbot5000",
          "text": "What works for me:\n\n1. Combine US and offshore engineering resources with a blended rate\n2. Fixed price project quotes\n3. Charge more; you may need to pivot clients, industries, or service lines to do this successfully \n4. Add higher margin services, using dev as a low margin first offer\n\nHolding at about a 20% margin and trying to grow top line.",
          "score": 1,
          "created_utc": "2026-02-25 19:27:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dqg03",
          "author": "nogiloki",
          "text": "Are you doing fixed cost projects or hourly engagements? The former is almost always a money losing endeavor",
          "score": 1,
          "created_utc": "2026-02-25 19:29:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7drsqi",
          "author": "RollingStart22",
          "text": "If you go for offshoring, India and Philippines are the cheaper English friendly options, while Canada and UK are still cheaper than US but relatively close culturally so less potential misunderstandings.",
          "score": 1,
          "created_utc": "2026-02-25 19:35:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dt5su",
          "author": "hairyconary",
          "text": "If your US based, start hiring Mexican programmers. They understand the US culture, they work on your time zones, they are well educated and talented, and senior devs cost 2500 a month US. If your European, Hire filipinos. Keep a couple Senior Devs to maintain Architecture and code bases etc.  Only switched to Mexico for easier timezones. But LOVE working with them both. Source: Ive hired thousands of Filipinos and Hundreds of Mexicans for my own and clients software development.",
          "score": 1,
          "created_utc": "2026-02-25 19:41:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dz1ow",
          "author": "hkpriv",
          "text": "Developer costs can be managed by implementing a utilization rate target, around 70-80% is pretty standard. we've found that having a balanced mix of junior and senior devs helps keep costs in check while still delivering quality work. what's your current dev team structure like, and how are you handling project pricing and billing?",
          "score": 1,
          "created_utc": "2026-02-25 20:09:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ec4is",
          "author": "Bfitz-Gmail",
          "text": "I used several developers from Brazil in the development of a B2B SaaS application I co-founded a few years back and they were amazing.  Many of them are working for US companies now. The brilliance was that I found two good developers who really understood the workflow I wanted, how I wanted to communicate, and the tech stack and then they helped me find and interview other candidates in Brazil identifying certain skills required for our development team.  It helped because we had cross over with time zones, but they also were able to work together with a drive I have rarely seen in corporate development shops.\n\nI saw a comment about maybe using claude code which may seem a little off from a development agency standpoint but I just vibe coded a new Freelance directed SaaS application and the time saved was incredible.  Not sure how you scale that for an agency, but given the right process management, you could drastically reduce your developer needs and the ones who you pick to stay could be trained how to use a strategic AI approach to application development which could also streamline some of your client builds.\n\nBottom line is that you either have to increase your rates or speed up your time and IMHO I would look to AI to help bridge that for your business.",
          "score": 1,
          "created_utc": "2026-02-25 21:10:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kp9j7",
              "author": "No-Flatworm-9518",
              "text": "Finding those two key developers first was the real game changer. Having people who truly get your vision and can help build the team around it is way more valuable than just hiring a bunch of individual coders. The AI point is spot on too it's less about replacing developers and more about empowering the good ones you have to move way faster",
              "score": 1,
              "created_utc": "2026-02-26 20:05:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7lgrwf",
                  "author": "Bfitz-Gmail",
                  "text": "Exactly and the key is finding the RIGHT first developers.  We had a developer before them that was kind of burned out before he came onboard and just didn't have the vision.  When you are really trying to move a small startup forward sometimes you get stuck in pushing the rock up the hill and not looking around to see there is a better way or that there is something stopping the rock from moving. Swapping the bad (mediocre) for the good was really a game changer.  That is when we really started moving post MVP.",
                  "score": 1,
                  "created_utc": "2026-02-26 22:17:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7gd06f",
          "author": "sonicadishservedcold",
          "text": "We run our team with client facing folks in the US and the developers in India and Romania. It works well for us and yes there are issues related to productivity loss but the difference in rates makes up for handling that delta. \n\nI have setup good offshore Pods for a couple of other dev shops in the US. Happy to discuss and see how we can get something for you as well.",
          "score": 1,
          "created_utc": "2026-02-26 03:42:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gjvb7",
          "author": "RandomPantsAppear",
          "text": "Hiring a full American team is rough in contract work. Doesn’t leave much margin for the company. \n\n\nThe best efficient small software teams I have been on have a kind of similar composition to each other \n\n* One battle hardened senior dev(pricey, often from the states or Europe). Lots of startup experience, full stack or backend dev. Devops capable but not devops. Ideally understands product and UX. \n\n* A team of less experienced offshore devs (Latin America is great) that the senior dev has interviewed/hired\n\n* Someone doing project management aggressively - meaning your devs aren’t managing JIRA at all. It’s updated during morning meetings. Part time or full depends on your work load. The real gain here is that you can hire developers based purely on developer skill. \n\n* Part time devops, also Latin America.\n\nThis composition creates enough flexibility and savings to leave room for profit.",
          "score": 1,
          "created_utc": "2026-02-26 04:27:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h6apj",
          "author": "Heavy-Broccoli9478",
          "text": "If you are serious about offshoring devs send me a dm and I'll put you in touch with my partners. We run a consulting company based in uruguay and there is plenty of margin for us based projects.",
          "score": 1,
          "created_utc": "2026-02-26 07:22:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ho3bq",
          "author": "Rounak147",
          "text": "Off-shore hiring is great, and it will definitely help in your case. However, as someone who's done this for years, you need to know that it's seriously difficult to find the right off-shore partners to work with. Each country has it's own set of challenges and mentality differences and this makes having an off-shore operation difficult (and sometimes not worth it). \n\nMy dms are open if you want to reach out :)  ",
          "score": 1,
          "created_utc": "2026-02-26 10:11:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ior59",
          "author": "jabz_ali",
          "text": "I worked for a dev agency in 2008 the way we tackled this was to find a niche, in this case it was auction systems. We created a framework that could handle different types of auctions (highest bid wins, reverse auction, lowest unique bid auction etc.) we then pitched this to clients e.g we can help you get rid of wanted merchandise, vehicle auctions, B2B for office supplies. This meant we could crank out customised auction systems relatively easily and charged for custom work, website design and so on. You may want to look into this, are you often being approached for similar projects and can you speed up the development process.",
          "score": 1,
          "created_utc": "2026-02-26 14:25:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7k8ax0",
          "author": "Resident-Cry328",
          "text": "A lot of small agencies are moving to a hybrid model. They keep a senior US dev who talks to clients, and use a distributed team for the actual build. That way they keep quality high but lower the cost side.\n\nJust going offshore doesn’t fix everything though, the process has to be solid too. How is your team structured right now?",
          "score": 1,
          "created_utc": "2026-02-26 18:45:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l2qmo",
          "author": "HarjjotSinghh",
          "text": "your developers are your mvp - charge accordingly!",
          "score": 1,
          "created_utc": "2026-02-26 21:10:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dppge",
          "author": "Dapper_Two5832",
          "text": "Faced the same problem 6 months back even after using AI, started working with an small agency from India. margins went from 18 to \\~60%. ig almost everyone is doing the same and are able to fulfill at low costs so it might work for you too. btw which country is your friend hiring from?",
          "score": 1,
          "created_utc": "2026-02-25 19:25:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e7yqb",
          "author": "christopherr",
          "text": "claude code?",
          "score": 1,
          "created_utc": "2026-02-25 20:51:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ghupc",
              "author": "RandomPantsAppear",
              "text": "“Turn your agency to trash with this 1 simple trick”",
              "score": 1,
              "created_utc": "2026-02-26 04:13:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7k5beq",
                  "author": "christopherr",
                  "text": "right, as if offshoring won't do the same",
                  "score": 3,
                  "created_utc": "2026-02-26 18:32:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7fvh97",
          "author": "Opposite-Barracuda-1",
          "text": "Bangladesh is honestly pretty underrated for this. There are a lot of good developers here, English isn't really an issue, and working async has been fine in our experience. I mostly work on backend stuff like APIs, custom systems, that kind of thing. Hit me up if you ever want to talk through it.",
          "score": 0,
          "created_utc": "2026-02-26 02:01:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}