{
  "metadata": {
    "last_updated": "2026-01-31 02:49:57",
    "time_filter": "week",
    "subreddit": "Entrepreneurship",
    "total_items": 10,
    "total_comments": 78,
    "file_size_bytes": 66289
  },
  "items": [
    {
      "id": "1qnsa7m",
      "title": "Hello everyone. I want to introduce myself.",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qnsa7m/hello_everyone_i_want_to_introduce_myself/",
      "author": "Glittering-Result402",
      "created_utc": "2026-01-26 20:42:26",
      "score": 15,
      "num_comments": 34,
      "upvote_ratio": 0.9,
      "text": "I am a 37yo female from Maine, USA and after spending the majority of my life denying where in life I feel more like myself, I'm looking to get into entrepreneurship. Business in general feels so fitting for me, but I don't know what spaces to spend time in on or off the internet. \n\nI'm doing as much self education as I can.\n\nEdit: Does anyone have anyone have any recommendations?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qnsa7m/hello_everyone_i_want_to_introduce_myself/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o1w0uqj",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 20:42:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w605i",
          "author": "Prior_Low_6269",
          "text": "You’re not behind, you’re at a very normal (and honest) starting point.\n\nOne thing that helps early is not trying to “pick a business,” but picking rooms to spend time in. Entrepreneurship usually comes from exposure before ideas.\n\nA few directions that tend to work well:\n\t•\tCommunities where people talk openly about problems they’re dealing with (small business, operations, wellness, local services, creators)\n\t•\tSpaces where you already feel some pull, even if you don’t know why yet\n\t•\tLearning by helping first (support roles, coordination, research, operations) before trying to lead something\n\nInstead of asking “what should I build?”, ask:\n\t•\tWhat kinds of problems do I naturally pay attention to?\n\t•\tWho do I enjoy helping?\n\t•\tWhat conversations make me feel more energized instead of drained?\n\nIf you want, I’m happy to suggest specific communities or paths, it just helps to know what’s felt most “like you” so far, even outside of work.",
          "score": 4,
          "created_utc": "2026-01-26 21:05:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z0ics",
          "author": "Mentor-Pak",
          "text": "Search for nearby incubation centre and join them, attend events, seminars, conferences",
          "score": 4,
          "created_utc": "2026-01-27 06:31:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20gxjk",
          "author": "Stratis-gewing",
          "text": "Definitely not too late! Many of the most successful startups are run by folks who are 45 according to HBR.\n\nhttps://hbr.org/2018/07/research-the-average-age-of-a-successful-startup-founder-is-45\n\nPersonally, the best advice I've received is to find something that you really enjoy and then get good at it.  By immersing yourself in a community you are exposed to the problems in that community and can help solve them.  For example, I work with a lot of small to medium size businesses in my day-to-day job and saw that many of them struggle to find smart, confidential experts who can help those business execs brainstorm and evaluate ideas from diverse perspectives. But the solution to that only came from being with people and talking to people all the time.  \n\nGood luck!",
          "score": 3,
          "created_utc": "2026-01-27 13:33:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2211be",
          "author": "Various_Gain49",
          "text": "Congrats on making the first step! The next step is to sell something. Anything. Find something someone is willing to pay for. That is the core of entrepreneurship and so many people spend years just learning that singular lesson",
          "score": 3,
          "created_utc": "2026-01-27 17:52:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1x3w7y",
          "author": "jo0stjo0st",
          "text": "Talk to as many entrepreneurs in real life as you can. Join a local business club, or several. Entrepreneurs will be happy to talk to someone who's really motivated.",
          "score": 2,
          "created_utc": "2026-01-26 23:45:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xe9wp",
          "author": "Purple_Ride5676",
          "text": "I do affiliatemarketing its a business model where you promote companies products for commissions through their affiliate programs. You will be working for yourself. Also you will be learning new skills (digital marketing skills)",
          "score": 2,
          "created_utc": "2026-01-27 00:38:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zqjwu",
          "author": "salim_hariz",
          "text": "Find your passion and go beyond it. There are many opportunities to brainstorm and get ideas and support. Explore it. Perfectly plan everything before jumping into it.",
          "score": 2,
          "created_utc": "2026-01-27 10:25:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22hodv",
          "author": "therealtricklowe",
          "text": "A great place to start would be to start with some ideas as to what type of business you're interested in starting?\n\nUnfortunately there's no such thing as generic and useful business advice, as all businesses are like fingerprints (they all need unique advice and strategy).Happy to help with anything you need help with.",
          "score": 2,
          "created_utc": "2026-01-27 19:02:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wbeb0",
          "author": "Nervous_Brilliant441",
          "text": "Lean startup by Eric Ries. It shows you how to validate ideas without spending too much money, so you don’t build stuff no one wants.",
          "score": 1,
          "created_utc": "2026-01-26 21:29:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zxyar",
              "author": "Extreme-Layer-1201",
              "text": "Good book but note that it is more so for experimental tech startups",
              "score": 1,
              "created_utc": "2026-01-27 11:27:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1yk7kf",
          "author": "SmoothBizOperator",
          "text": "Congrats and welcome to the wonderful, but chaotic world on entrepreneurship! One thing I like to encourage people with, is to really focus on your “why.” \n\nAnyone can jump into being a business owner, but I feel it’s the ones who really discover their “why” will not only have what it takes to push themselves towards success, but also can use their why to pull them out of the hard times and propel them forward. \n\nI would encourage you to check out Simon Sinek and his book Start with Why in part of your discovery process. Lastly, whatever I do, I like to focus on making meaning over money. Every time I follow this path it is great what I accomplish and I always make money along the way, because my passion comes alive! When I focus on how much money I’m going to make, nothing impactful ever is born and definitely no money is made.",
          "score": 1,
          "created_utc": "2026-01-27 04:33:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zcc3e",
          "author": "PavelBoss13",
          "text": "What are you already learning? Do you read books about finance or self-education? Do you have experience in entrepreneurship?",
          "score": 1,
          "created_utc": "2026-01-27 08:13:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21xa0v",
              "author": "Glittering-Result402",
              "text": "Not at all in entrepreneurship. All I know is keep track of money, to out it vaguely. The interest is definitely there after working for small biz and sales.",
              "score": 1,
              "created_utc": "2026-01-27 17:36:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o229o00",
                  "author": "PavelBoss13",
                  "text": "Got it. In which direction do you want to open a case? Or it doesn't matter?",
                  "score": 1,
                  "created_utc": "2026-01-27 18:28:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o204cz3",
          "author": "Motor_Object_6181",
          "text": "Welcome. You’re in the right place, and also in a very noisy one.\n\nOne thing I wish someone had handed me early on is The E-Myth by Michael Gerber. Not because it tells you what business to start, but because it clears up a huge misunderstanding most of us walk into entrepreneurship with.\n\nThe short version is this: being interested in business and being good at a skill are not the same as building a business that works without eating your life. That distinction alone can save years of frustration.\n\nAs for “where to spend time online,” I’d be careful there. A lot of spaces feel productive but mostly keep you consuming instead of building. Books and long-form thinking tend to give a better foundation early on than bouncing between platforms.\n\nCurious what pulled you toward entrepreneurship in the first place. Was it freedom, creativity, control, or something else?",
          "score": 1,
          "created_utc": "2026-01-27 12:16:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21r41c",
              "author": "Glittering-Result402",
              "text": "All of the above. I haven't been able to find where I can squeeze in and fit enough to move up in jobs without being a threat in the same breath I am praised and encouraged to contribute, and I am not happy keeping my head down in situations where I have been given and trusted with freedom, OR when I know from experience there are better ways to handle trouble shooting and customer issues.",
              "score": 2,
              "created_utc": "2026-01-27 17:09:10",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o21rdnm",
              "author": "Glittering-Result402",
              "text": "Plus, it's been what I have wanted since I was maybe 19?",
              "score": 2,
              "created_utc": "2026-01-27 17:10:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o27cvhg",
                  "author": "Motor_Object_6181",
                  "text": "\nI get that more than I probably should.\n\nI’m in a trade job right now, good work, good people, but there’s a ceiling. Not just on money, but on how much initiative or responsibility you’re really allowed to take before it becomes uncomfortable for everyone else.\n\nI’ve felt that same tension of knowing there are better ways to do things, wanting to contribute more, and realizing the structure just isn’t built for that long term.\n\nThat’s a big part of why I’m building something on the side. Not because I hate work, but because I don’t want my growth capped by someone else’s system.\n\nNo rush to answer this, but I’m curious. When you picture working for yourself, do you imagine solving a specific kind of problem, or is it more about the way you want to work?",
                  "score": 3,
                  "created_utc": "2026-01-28 12:39:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o20i398",
          "author": "Marksp245",
          "text": "Find your local SBDC (Small Business Development Center) office and visit them (Google Maine SBDC for the signup link). They are a free resource for small businesses anywhere in the small business life cycle. They can help you with deciding what industries and businesses might be right for you to get into.",
          "score": 1,
          "created_utc": "2026-01-27 13:39:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26fhtj",
          "author": "Overall-Lead-4044",
          "text": "I recently read \"Start With Why\". Some of the most successful businesses start by answering the question \"why we exist\",  for example I say about my business that \"we make the internet a safer place\".\n\nMaybe you could start by answering the question \"why do you want to be an entrepreneur\". That might help you decide what to do",
          "score": 1,
          "created_utc": "2026-01-28 07:58:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29515h",
          "author": "Technical-Spend-9037",
          "text": "That’s a great place to be. You don’t need to have it all figured out yet.I’d suggest spending time in general entrepreneurship spaces like Indie Hackers, small business or startup communities on Reddit, and watching creators who talk honestly about building businesses from scratch. \n\nOffline, coworking spaces can really help too.Most importantly, notice what problems you’re naturally interested in solving that’s usually where the best ideas come from. Just exploring and staying curious is already a solid first step.",
          "score": 1,
          "created_utc": "2026-01-28 17:47:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2btd34",
          "author": "ronchodelux",
          "text": "Welcome to freedom and true meritocracy! \n\nIf I were just starting over or starting out I’d deep dive on AI. There are so many opportunities that you could be earning in weeks or even days.",
          "score": 1,
          "created_utc": "2026-01-29 01:13:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2it5kt",
          "author": "quietcashsystems",
          "text": "You are not late, and you are not missing anything special. Everyone gets stuck because they are trying to “pick the right business” rather than learning about the flow of money.\n\nIf I had to start over, I would spend time in spaces where people are talking about real problems, not hype. Solopreneur, small business, and industry-specific niches are better than general “entrepreneur” stuff.\n\nI would focus less on ideas and more on learning about the flow of money in simple businesses. This stuff compounds quickly.",
          "score": 1,
          "created_utc": "2026-01-30 01:33:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2izkfn",
          "author": "Acrobatic_Horror_623",
          "text": "Find things that are a need in life or business and not just a wanr.",
          "score": 1,
          "created_utc": "2026-01-30 02:09:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2j03of",
              "author": "Acrobatic_Horror_623",
              "text": "Want",
              "score": 1,
              "created_utc": "2026-01-30 02:12:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2mp1ad",
          "author": "gforbes123",
          "text": "Just be yourself! Get a piece of paper and write down EVERYTHING you love in life - find something that you can create out of that list. But definitely something to do with social media/ digital marketing as this is what’s trending now and making tons over 6 figures a month😊",
          "score": 1,
          "created_utc": "2026-01-30 16:40:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qme5ux",
      "title": "What brought you the most leads",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qme5ux/what_brought_you_the_most_leads/",
      "author": "Akraam_Gaffur",
      "created_utc": "2026-01-25 08:58:39",
      "score": 10,
      "num_comments": 14,
      "upvote_ratio": 0.86,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qme5ux/what_brought_you_the_most_leads/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o1l751r",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-25 08:58:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1njori",
          "author": "Capital-Way5517",
          "text": "Google. Getting your business on google.",
          "score": 4,
          "created_utc": "2026-01-25 17:33:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ntkkn",
          "author": "FatherOften",
          "text": "I always just searched google maps for commercial truck repair shop plus whatever the city name is. More results than I could shake a stick at.",
          "score": 3,
          "created_utc": "2026-01-25 18:14:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ntp9t",
          "author": "shaon343",
          "text": "ranking website on google's top position is the best thing we did. Right now, we are just trying to get cited by ai tools along with SEO.",
          "score": 2,
          "created_utc": "2026-01-25 18:15:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1nw11w",
          "author": "Foreign_Tower_7735",
          "text": "Lead magnets",
          "score": 2,
          "created_utc": "2026-01-25 18:24:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1p26ma",
          "author": "Virtual-Ad0459",
          "text": "My Local SEO built my business really quick. \nMy Facebook community group posts second. \nWord of mouth is now coming third.",
          "score": 2,
          "created_utc": "2026-01-25 21:26:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1qr6oo",
          "author": "DeviantHistorian",
          "text": "Word of mouth",
          "score": 2,
          "created_utc": "2026-01-26 02:15:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1s6y0f",
          "author": "Overall-Lead-4044",
          "text": "Networking, especially referral networking groups like BNI",
          "score": 2,
          "created_utc": "2026-01-26 07:58:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1voqcm",
          "author": "Intelligent-SBCA",
          "text": "SEO works and now we are starting with social media (LinkedIn)",
          "score": 1,
          "created_utc": "2026-01-26 19:49:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qna3k5",
      "title": "Problem with getting new clients",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qna3k5/problem_with_getting_new_clients/",
      "author": "Elmo_1337",
      "created_utc": "2026-01-26 08:04:34",
      "score": 10,
      "num_comments": 14,
      "upvote_ratio": 0.92,
      "text": "I have a small webdesign agency in germany, we started a year ago and had a couple of clients, but now we have problems with getting new one's. We already post on instagram and of course have our own Website with good SEO. \n\nWhat worked for you ? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qna3k5/problem_with_getting_new_clients/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o1s7mje",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 08:04:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sa8u0",
          "author": "ASLegend",
          "text": "Getting the first few clients is the hardest part and you have got that covered. The next best step is to ask your previous clients for referrals. You can also partner with other agencies who are not your direct competitors like marketing agencies. They can refer clients to you for web development and you can refer them clients who are in a need for marketing service.",
          "score": 6,
          "created_utc": "2026-01-26 08:27:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vfigc",
          "author": "vmco",
          "text": "Yep. A few things that worked: \n\n1. Cold called small businesses. I built an entire agency from just picking up the phone and dialing local businesses. Note: Do not try to sell on the first call - it won't work.  \n2. Built relationships. Would strongly suggest that you get to know your local businesses - they all belong to similar organizations/clubs  and know each other - we began to receive regular referrals.  \n3. Niched down into a specific industry. Marketing, messaging, and referrals became much easier.  \n4. Stopped selling websites. Most business owners do not care about websites. They care about solutions and results so instead, my agency sold 'Marketing Solutions' (Packaged several services together to get them to the end result).\n\nOnce you get your process, offers and experience locked-in it will become easier to scale with partners, affiliates, and other complimentary businesses.\n\n  \nHope this helps!",
          "score": 5,
          "created_utc": "2026-01-26 19:09:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1w86qs",
              "author": "TheKirinX",
              "text": "Thanks! If not try to sell on first call, what to talk about? Not weather for sure",
              "score": 2,
              "created_utc": "2026-01-26 21:15:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1x08bk",
                  "author": "vmco",
                  "text": "Haha!\n\nWell, of course if you happen to possess the ability to 'One Call Close', you don't need to spend time on Reddit - you would be too busy on the phone closing ;-)\n\nSure, what worked for me was just starting with a casual intro (Who you are and why you are calling). \n\nSomething very simple such as:  \n\nHi (\"Name\"), I'm the owner of (\"Agency\"). We are a small startup here in (\"Name of city\") and I'm reaching out to other business owners in the area to talk about (eg. \"Getting more foot traffic or how their getting customers - what's working or not\") --or -- I'm hoping to set up a quick call with you to talk about (\"Benefit you provide to common problem\"). Would you be open to quick 10 minute call?\n\nThe above may not work for every prospect, but the objective in the first call was always to set a meeting, but sometimes they would want to speak right then so be prepared.\n\nEither way, just relax and be yourself - it goes a long way.\n\nCheers.",
                  "score": 1,
                  "created_utc": "2026-01-26 23:26:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1wr0cs",
              "author": "Elmo_1337",
              "text": "Thanks, thats some really good advice",
              "score": 2,
              "created_utc": "2026-01-26 22:40:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1u214o",
          "author": "StillLoadingit",
          "text": "Getting new clients is always tough at first because it takes time to find where the people who actually need you are hanging out. Talking to them, understanding their goals, and testing simple offers until something sticks will make it way easier over time.",
          "score": 2,
          "created_utc": "2026-01-26 15:37:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1s9023",
          "author": "Expensive-Lion3464",
          "text": "Ask your existing clients to refer you.",
          "score": 1,
          "created_utc": "2026-01-26 08:16:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp4ylx",
      "title": "Buying vs Building: What Entrepreneurs Miss Until They See Real Deals",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qp4ylx/buying_vs_building_what_entrepreneurs_miss_until/",
      "author": "This_Is_Bizness",
      "created_utc": "2026-01-28 07:39:20",
      "score": 7,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "Sitting in on real conversations around small SaaS acquisitions changed a few assumptions I didn’t even realize I had.\n\nI used to think building from scratch was the “clean” option. Blank slate, full control, no mess. Buying felt like inheriting problems. But the more deals I watched, the more it made me think buying might be better than building.\n\nThe problems are there either way. The difference is whether you find them upfront or six months in, when you’re already emotionally and financially committed.\n\nOne thing I keep noticing, people don’t stall because there aren’t enough businesses out there. They stall because they’re everywhere at once. Marketplaces today, cold emails tomorrow, a new niche every week. After a while, everything blurs together and decision-making gets worse.   \n  \nSmart buyers tend to limit their niche down to few businesses which they are good at, this makes you more efficient and does’t waste your time exploring 10 diff niches. \n\nAnother thing, most of the important stuff comes out in conversation before it ever shows up in a spreadsheet. Metrics tell you **what** is happening. Talking to the founder usually tells you **why.** The timing, the burnout, the part of the business they’re tired of carrying, that context often explains the opportunity more than the numbers do.\n\nRevenue matters, obviously. But not as much as whether the product has crossed that invisible line from “side project someone tinkers with” to “something people quietly rely on.” That distinction alone filters out a lot of shiny distractions.\n\nAnd then there’s the part no one really talks about. The slow checks. The verification. The awkward questions. The walking away from deals that looked exciting at first glance.   \n  \nEvery buyer I respect seems to develop a weird tolerance for this stage. It’s not fun, but it’s where most bad decisions get avoided, and this is what you call Due Diligence phase. \n\nNone of this felt obvious until I’d seen a few deals up close, especially the ones that almost happened and probably shouldn’t have.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qp4ylx/buying_vs_building_what_entrepreneurs_miss_until/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o26day0",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 07:39:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28vx41",
          "author": "Spotch_Platform",
          "text": "Numbers tell you what’s happening, but talking to the founder shows why. Sticking to niches you know and leaning into the slow, awkward parts of due diligence makes spotting the right opportunities way easier. At the end of the day, context beats spreadsheets every time.",
          "score": 2,
          "created_utc": "2026-01-28 17:07:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ezab9",
              "author": "This_Is_Bizness",
              "text": "Totally agreed",
              "score": 1,
              "created_utc": "2026-01-29 14:29:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2exm8y",
          "author": "StillLoadingit",
          "text": "A lot of entrepreneurs don’t realize how much building teaches you about the problem and the market in a way buying never does. Going through the process of creating and talking to real users gives you insights you just can’t get by starting with a ready-made product.",
          "score": 2,
          "created_utc": "2026-01-29 14:20:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ez8rc",
              "author": "This_Is_Bizness",
              "text": "I agree with this, building gives teaches you 10x more than just the theory and honestly going on the ground level talking to users is like a whole different experience if it's your first startup or build",
              "score": 1,
              "created_utc": "2026-01-29 14:28:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o26geiz",
          "author": "AnonJian",
          "text": "Due diligence is a no-no word here. Buy versus Build is a moot point for those afflicted with inventor's syndrome and sunk cost fallacy. \n\nBut yes, the buy versus build dilemma is real for business management. Why you brought it up here is the real mystery.",
          "score": 1,
          "created_utc": "2026-01-28 08:06:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26km8p",
              "author": "This_Is_Bizness",
              "text": "Idk maybe not for others for me this was like a big thing which I realised as I closed few SaaS deals and thought it would be good share.",
              "score": 1,
              "created_utc": "2026-01-28 08:44:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o26p0qa",
                  "author": "AnonJian",
                  "text": "Basically, all business forums turned into amateur coder forums. And any management discussion is about coping rather than proactive problem solving ... or planning ... or thinking things through. \n\nUnscrambling an egg feels about right.",
                  "score": 0,
                  "created_utc": "2026-01-28 09:25:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qllkj2",
      "title": "i'm 16. i coded a script for $500 but now the client wants a monthly contract. i'm just a student, not a \"business\". help?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qllkj2/im_16_i_coded_a_script_for_500_but_now_the_client/",
      "author": "Safe_Thought4368",
      "created_utc": "2026-01-24 12:19:28",
      "score": 5,
      "num_comments": 9,
      "upvote_ratio": 0.69,
      "text": "hi everyone.\n\ni'm a high school student from argentina. i've been learning python (cs50p) for a few months just for fun.\n\nrecently, my dad told me to stop playing around and build something useful. so i approached a local clothing shop that needed help with their catalog images.\n\ni spent 2 weeks writing a script to automate their image editing.\n\nthe owner was happy and paid me $500 cash.\n\nhere is the problem:\n\nnow he wants to hire me on a \"monthly retainer\" to help with other tech stuff (excel automation, data entry, etc).\n\ni am not a company. i am not an \"agency\". i'm just a kid with a laptop.\n\ni don't have contracts, invoices, or a team.\n\ni want to say yes because the money helps my family, but i don't want to pretend to be a professional business when i'm just a student.\n\nquestions:\n\n1. can i just agree to a price and do the work? or do i need legal stuff?\n\n2. how do i tell him \"i have exams next week so i can't work\" without losing the client?\n\n3. is it better to charge by hour or by project?\n\ni just want to code and help, i don't want to get into trouble. thanks.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qllkj2/im_16_i_coded_a_script_for_500_but_now_the_client/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o1exo6k",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-24 12:19:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ezzrt",
          "author": "WrongMix882",
          "text": "Awesome problem to have! Congratulations! \n\n1. GPT your situation and get your questions answered about this. My guess is it’s not a big hurdle \n2. In your simple contract (you can also GPT this, or I can help for free) you can state a SLA to cover your needs when you’re busy: ‘I won’t be able to help immediately always’\n3. You’re going to charge a flat fee so your time commitment is valued. That means you’re going to deliver constant value each month\n\nHappy to talk more by DM if you need help",
          "score": 9,
          "created_utc": "2026-01-24 12:37:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1f2ryu",
              "author": "Safe_Thought4368",
              "text": "thanks my friend!",
              "score": 2,
              "created_utc": "2026-01-24 12:57:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1if10j",
                  "author": "Neo-Armadillo",
                  "text": "Your situation is exactly how I got started, but there was no AI when I did it. I got started around 2010 and I just drafted up a simple agreement, the amount of money with the expected amount of work, expected response times (day-of, Monday through Friday 8a-5p), and hourly rates beyond the scope. Keep it simple.",
                  "score": 1,
                  "created_utc": "2026-01-24 22:34:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1fdohi",
          "author": "Boring-Tadpole-1021",
          "text": "Great. Go help. Let the customer guide. Get your dad to do the business end",
          "score": 1,
          "created_utc": "2026-01-24 14:04:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fn6aq",
          "author": "SimilarComfortable69",
          "text": "You want to make sure that your work is not owned by the company, unless you feel that it should be. Call around and see if you can find an attorney who will give you a consultation for free, and then spend 200 bucks for them to write up any agreement that you might need.",
          "score": 1,
          "created_utc": "2026-01-24 14:57:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ftu02",
              "author": "Safe_Thought4368",
              "text": "thank you",
              "score": 1,
              "created_utc": "2026-01-24 15:31:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1gsu8g",
          "author": "Any_Interest_3509",
          "text": "Absolute blessing to have this happen. Good money as a student, and you're also going to have real-world experience before even going to college 10/10 man pursue it",
          "score": 1,
          "created_utc": "2026-01-24 18:08:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqn3vn",
      "title": "Making 8k–14k/month as a freelancer… and scaling still feels like a trap",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qqn3vn/making_8k14kmonth_as_a_freelancer_and_scaling/",
      "author": "Special_Abalone_7630",
      "created_utc": "2026-01-29 22:23:30",
      "score": 5,
      "num_comments": 9,
      "upvote_ratio": 0.69,
      "text": "I’m in my twenties and currently a freelancer making around 8k–14k per month. Margins are basically 100% since it’s just me, and I work around 50-60 hours per week. For where I live, this is very good money.\n\nThe issue is I’m fully booked. Every new opportunity feels like:\n\n* take it and burn out\n* or say no and feel stuck\n\nThat’s what **pushed** **me** **to** **think** **about** **starting a company** and scaling beyond myself, mostly because I’m worried there’s nothing beyond my personal brand and trading time for money.\n\nBut the more I look at the numbers, the less it makes sense.\n\nA realistic service company in my space probably runs on 20–30% margins. To make the same \\~120k/year I make now as a freelancer, the company would need to do something like 400k–500k in revenue. And that’s **just** **to** ***match*** my income, **not even exceed it**, and obviously I wouldn’t just take all of that out personally. All with way more stress, risk, and management.\n\nAlso:\n\n* My clients hire *me*, not a team\n* I’d still be the bottleneck for sales and quality\n* Selling random products doesn’t feel like a real long term asset or exit\n\n**So now I’m torn:**\n\n1. Double down on freelancing + personal brand\n2. Keep freelancing stable and slowly try to build a company or asset on the side\n\nThe math makes scaling feel kinda crazy, but the idea of having nothing beyond freelancing long term also worries me.\n\nCurious how others have thought about this or what they’d do.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qqn3vn/making_8k14kmonth_as_a_freelancer_and_scaling/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2htk51",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 22:23:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hy07t",
          "author": "hexwit",
          "text": "This is self promotion ad. Seen in different subs.",
          "score": 2,
          "created_utc": "2026-01-29 22:45:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2i2bsn",
          "author": "vettotech",
          "text": "AI slop",
          "score": 2,
          "created_utc": "2026-01-29 23:08:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ijuio",
              "author": "some_user_2021",
              "text": "It's not just AI slop, it's a lifestyle.",
              "score": 1,
              "created_utc": "2026-01-30 00:42:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2juxpf",
          "author": "ScradleyToronto",
          "text": "Why don’t you say what it is you do?",
          "score": 1,
          "created_utc": "2026-01-30 05:17:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2i34d0",
          "author": "ineedanamegenerator",
          "text": "Just my opinion:\n\nI don't want a business that linearly relies on people to scale. Growing in selling services means more people. As you said, you need to be significantly large already to exceed solo freelance income. Overhead eats up a lot of the profit.\n\nSo, either think about a product company you could start. I always encourage people who want that to start it on the side. Sacrifice a few days a week of your freelance job to work on the product company. It will take longer than you think before it brings income.\n\nAlternatively just keep doing what you are doing and buy real estate for passive income.",
          "score": 0,
          "created_utc": "2026-01-29 23:12:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2j0wdb",
          "author": "FullPractice6896",
          "text": "Masivo Bro",
          "score": 0,
          "created_utc": "2026-01-30 02:16:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hvatv",
          "author": "Boring-Tadpole-1021",
          "text": "Free lance and start a company",
          "score": -1,
          "created_utc": "2026-01-29 22:32:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqg945",
      "title": "Entrepreneurship sounds exciting, what’s the part no one talks about?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qqg945/entrepreneurship_sounds_exciting_whats_the_part/",
      "author": "ChatYourCareer",
      "created_utc": "2026-01-29 18:12:27",
      "score": 5,
      "num_comments": 31,
      "upvote_ratio": 0.78,
      "text": "For founders or early-stage entrepreneurs:  \n– What’s harder than expected?  \n– What’s more rewarding than you thought?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qqg945/entrepreneurship_sounds_exciting_whats_the_part/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2gcbtg",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 18:12:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gjqxy",
          "author": "505browser",
          "text": "harder - the real amount of time it consumes. Basically a 24/7 commitment.\n\nMore rewarding - creating a job for someone from a blank sheet of paper",
          "score": 4,
          "created_utc": "2026-01-29 18:45:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gmrur",
              "author": "ChatYourCareer",
              "text": "That’s such an honest way to put it. The time commitment really doesn’t get talked about enough, and the “always on” part can be exhausting. But creating something that actually gives someone else a job is a pretty special kind of reward. Thanks for sharing that perspective.",
              "score": 1,
              "created_utc": "2026-01-29 18:59:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2jx5z4",
                  "author": "Innurendo_",
                  "text": "Hasn’t been the same for me. I hired a manager and delegate // automate as much as possible. I have plenty of free time, but I do take calls any time of day. \n\nAgreed on it being rewarding to know that my work has put food on my team’s table. It helped ‘em buy a car. Pay student loans. Get an engagement ring. Etc",
                  "score": 1,
                  "created_utc": "2026-01-30 05:33:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2he4c8",
              "author": "Sad-Mousse5066",
              "text": "If you live what you love then it’s not a job alway be closing",
              "score": 1,
              "created_utc": "2026-01-29 21:09:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2mwag3",
                  "author": "ChatYourCareer",
                  "text": "Yeah, I think loving what you’re building definitely helps, but it still comes with real pressure and responsibility. Even when it doesn’t feel like a “job,” the stakes don’t really go away.",
                  "score": 1,
                  "created_utc": "2026-01-30 17:12:53",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ihzvw",
          "author": "EdThePodcastGuy",
          "text": "the hard part is that you need to get your shit together across the board. It's not just about the time you spend working, but the habits that you have outside of work. In our day and age it can make you into a bit of a social reject. \n\nThe rewarding part for me is being trusted by really smart people (sometimes with Ivy league educations) and being able to sit at the table with them as a creative and strategic partner. I never got to go to a fancy university but always wanted to, so there is a bit of a pedestal there.",
          "score": 3,
          "created_utc": "2026-01-30 00:32:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mu4hv",
              "author": "ChatYourCareer",
              "text": "That really resonates. People talk a lot about the work itself, but not how much it forces you to get your life and habits in order, and how isolating that can be if you’re not careful. And that last part hits hard. Being taken seriously and trusted by people you once put on a pedestal is a huge reward, especially when you didn’t come through the “traditional” path. Thanks for sharing that perspective.",
              "score": 2,
              "created_utc": "2026-01-30 17:03:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2grv79",
          "author": "limitlesssolution",
          "text": "The hard work. Possibly working 10, 12 + hours every day. Having to improve yourself constantly. And be abreast of any changes in technology and the marketplace.",
          "score": 1,
          "created_utc": "2026-01-29 19:22:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mvk55",
              "author": "ChatYourCareer",
              "text": "Yeah, that part doesn’t get sugar-coated enough. The hours and constant self-improvement can be exhausting, especially when things around you keep changing. It definitely takes a lot more than just a good idea to keep going long term.",
              "score": 1,
              "created_utc": "2026-01-30 17:09:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2gtjsi",
          "author": "FatherOften",
          "text": "It will cost you more time, energy, health, relationships, stress and money than you can ever plan for but it's worth it for who you could become.",
          "score": 1,
          "created_utc": "2026-01-29 19:30:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gvrnc",
          "author": "Salt-Association6876",
          "text": "I concur on creating a paying job for someone else from just an idea is the most rewarding and fulfilling feeling. \n\nWhat has been the hardest for me is the constant test of conviction. \n\nIt's time, it's money, it's family, it's relationships, it's insecurity, it's pride, it's doubt, it's isolation, it's fear, it's clarity, it's happiness, it's freedom, it's belief.",
          "score": 1,
          "created_utc": "2026-01-29 19:41:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2h6oq8",
          "author": "FieldNoticing",
          "text": "The more time and dedication you spend bringing this vision to life, the more sacrifices you’ll have to make. You’ll have multiple inflection points that will ask you to choose this or that. That’s where actual grit shows up.",
          "score": 1,
          "created_utc": "2026-01-29 20:33:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ihzhk",
          "author": "d-monroy",
          "text": "If you’re not getting paid, you’re not providing enough value.",
          "score": 1,
          "created_utc": "2026-01-30 00:32:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2imqqf",
          "author": "Rich-Editor-8165",
          "text": "Entrepreneurship is tougher than it seems, especially with the emotional grind, constant decisions, and uncertainty. But it’s rewarding when you learn what truly matters and discover who you are under pressure.",
          "score": 1,
          "created_utc": "2026-01-30 00:57:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k4lae",
          "author": "deep_m6",
          "text": "The unglamorous part is the mental load which includes constant uncertainty and decision fatigue and the need to perform all tasks by yourself during the initial period. Small achievements bring unexpected satisfaction because they include your first customer and actual feedback and the demonstration of your solution to a real problem. The peak experiences exist as actual events but the continuous work required to reach those peaks also exists.",
          "score": 1,
          "created_utc": "2026-01-30 06:30:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2klx0u",
          "author": "Overall-Lead-4044",
          "text": "Harder - soloness ( if that's a word). Being on your own, no support or encouragement from colleagues. Although this can be mitigated by building up a network of trusted people, mostly other entrepreneurs in the same situation.\n\nMotivation. It's easy to get distracted by other things, like answering questions on Reddit ☺️",
          "score": 1,
          "created_utc": "2026-01-30 09:00:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kqplz",
          "author": "RevolutionaryLeg7978",
          "text": "Its a vocation not a job. There is no 9-5, its 24/7",
          "score": 1,
          "created_utc": "2026-01-30 09:44:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kueo0",
          "author": "PavelBoss13",
          "text": "If you \"expect\" that when you start entrepreneurship will be good or bad, then it's better not to be an entrepreneur.",
          "score": 1,
          "created_utc": "2026-01-30 10:17:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2la7iy",
          "author": "Unable_Musician5446",
          "text": "Harder than expected: the constant mental load. You’re always thinking about the business, even when you’re not working. There’s no real off switch.\n\nMore rewarding than I thought: once I got proper support, things actually felt manageable. I was overwhelmed at one point and used CollabFabrik’s Founder Support, which helped me get organised and stop doing everything myself. That shift made running the business feel sustainable, not just stressful.",
          "score": 1,
          "created_utc": "2026-01-30 12:23:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lxl98",
          "author": "Final_Schedule_3129",
          "text": "The sheer weight of decision fatigue. You underestimate how physically draining it is to be the final bottleneck for 500 micro-choices a day, knowing that if you don't decide, nothing moves.",
          "score": 1,
          "created_utc": "2026-01-30 14:34:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m44zk",
          "author": "Internal-Combustion1",
          "text": "Expect to work a lot if you want a chance at success.  Expect to fail a lot, get up, try and fail again, get up and try again.   It’s high risk but also can be high reward (when your successful enough)",
          "score": 1,
          "created_utc": "2026-01-30 15:06:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mfrqm",
          "author": "Due-Mood-6356",
          "text": "The boring bureaucratic paperwork that you go through especially in initial setup.",
          "score": 1,
          "created_utc": "2026-01-30 15:59:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ml71w",
          "author": "WrongMix882",
          "text": "Loneliness. You will be marooned on an island of doubt.",
          "score": 1,
          "created_utc": "2026-01-30 16:23:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2n0y66",
          "author": "Kindly-Teach-1256",
          "text": "work life balance",
          "score": 1,
          "created_utc": "2026-01-30 17:33:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o3cr1",
          "author": "LordOfTheMoans",
          "text": "The unsexy grind is the hardest part: constant context switching, decision fatigue, and realizing no one is coming to save you when things stall. What surprised me most is how rewarding tiny wins feel, your first real customer, a product finally clicking, those moments hit way harder than I expected.",
          "score": 1,
          "created_utc": "2026-01-30 20:26:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2p2a95",
          "author": "Electronic_Size_1323",
          "text": "It’s not fun at all most of the times",
          "score": 1,
          "created_utc": "2026-01-30 23:17:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pygg3",
          "author": "Medieval-Mind",
          "text": "Anxious, sleepless nights.",
          "score": 1,
          "created_utc": "2026-01-31 02:19:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr4yd2",
      "title": "How Do You Know the Best Way to Start a Business Today?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qr4yd2/how_do_you_know_the_best_way_to_start_a_business/",
      "author": "Policy_Boring",
      "created_utc": "2026-01-30 13:06:41",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "This is a question I hear all the time. With so many options out there. Starting from scratch, buying an existing business, or going the franchise route. It’s easy to feel stuck before you even begin. From my experience working with business owners and franchises, there’s no single “right” answer. It really comes down to your goals, your risk tolerance, and how much guidance you want along the way.\n\nSome people love building everything themselves, while others prefer a proven system with support already in place. Both paths can work, it’s about choosing the one that fits you. If you’re just starting to explore your options, don’t rush the decision. Ask questions, learn from people who’ve done it before, and be honest about what kind of business owner you want to be.\n\nCurious to hear how others here decided on their path. What helped you choose?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qr4yd2/how_do_you_know_the_best_way_to_start_a_business/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2lh0y6",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 13:06:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2na20a",
          "author": "DecisionOperator",
          "text": "This is an indecision buffer framed as exploration\n\nClarity will not arrive from comparing paths\n\nThe choice only materializes once commitment replaces analysis",
          "score": 2,
          "created_utc": "2026-01-30 18:13:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqxxp4",
      "title": "I've made my first 4.5k month",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qqxxp4/ive_made_my_first_45k_month/",
      "author": "Katana_XI",
      "created_utc": "2026-01-30 06:33:04",
      "score": 4,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Hello guys!!! For those of you don't know I started a software/web development agency back in September and have been updating my progress throughtout.\n\nAs of January 2026, I've made 4.5k this month alone. I've been handling alot of projects along with my team. My biggest goal going into this year is gaining alot more monthly recurring clients (i currently only have 2).  \n  \nI'll keep posting my progress on Reddit. Thank you so much for dming and supporting my journey guyss :)\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qqxxp4/ive_made_my_first_45k_month/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2k4z4t",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 06:33:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kuh40",
          "author": "Secure-Ebb5290",
          "text": "How did you made it? really keen to know your journey",
          "score": 1,
          "created_utc": "2026-01-30 10:17:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2nd1oz",
          "author": "Spotch_Platform",
          "text": "Congrats on hitting 4.5k so early on. Focusing on recurring clients is smart since predictable revenue makes growth easier and less stressful. Keep tracking what works and you’ll see those numbers add up consistently.",
          "score": 1,
          "created_utc": "2026-01-30 18:26:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qozh5r",
      "title": "Need feedback on Landing Page - Major Refactor",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qozh5r/need_feedback_on_landing_page_major_refactor/",
      "author": "Additional_Alarm_604",
      "created_utc": "2026-01-28 03:01:17",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Hello everyone,\n\nI've had my landing up for less than 30 days, and it's doing okay. We're getting 100 visitors a day, and 7 interactions on visit. So that feels good, however, I'm not getting emails like I need, and that is really hurting me. Without a few hundred to a few thousand, I just don't see the point in launching our Kickstarter campaign. \n\nI can get people to the site, but earnestly, without emails, I'm stuck.\n\nI've made a major refactor of the site. Increased Mobile compatibility in UI/UX, and I've improved my modals and email placement.\n\nI've add(ed/ing) a beverage guide, which I think will shine, but I'm hesitant to pour a lot of money into marketing till I know I can capture interest.\n\nI've done a ton of businesses, but this is my first Kickstarter, and my first \"direct to consumer\" company, so I really would appreciate guidance. \n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qozh5r/need_feedback_on_landing_page_major_refactor/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o258mpm",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 03:01:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}