{
  "metadata": {
    "last_updated": "2026-01-02 08:28:56",
    "time_filter": "week",
    "subreddit": "EntrepreneurRideAlong",
    "total_items": 45,
    "total_comments": 231,
    "file_size_bytes": 284940
  },
  "items": [
    {
      "id": "1pzbah5",
      "title": "Building an automated sales agent best ai talking avatar tools?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pzbah5/building_an_automated_sales_agent_best_ai_talking/",
      "author": "Admirable-Item-6715",
      "created_utc": "2025-12-30 06:58:05",
      "score": 47,
      "num_comments": 6,
      "upvote_ratio": 0.87,
      "text": "I know the market is flooded with ai talking avatar tools, but most are just wrappers. If you want to build your own with better control, check out the infrastructure at hypereal tech. They have the raw models (Sora 2, Kling, etc.) that power the high-end avatar stuff, but with much lower latency for production",
      "is_original_content": false,
      "link_flair_text": "Resources & Tools",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pzbah5/building_an_automated_sales_agent_best_ai_talking/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwpdi5l",
          "author": "luke-build-at50",
          "text": "Careful with this space. The tech is impressive, but most “AI sales agents” fail for a non-technical reason: people don’t want to be sold to by a talking head.\n\nAvatars are great for demos, walkthroughs, async explanations. The moment they pretend to be a salesperson, trust drops fast. Lower latency and raw models won’t fix that.\n\nIf you’re building one, I’d focus less on realism and more on usefulness. Let it explain, not persuade. The best sales agents don’t talk more, they reduce friction.",
          "score": 3,
          "created_utc": "2025-12-30 09:34:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqbqvb",
          "author": "No-Swimmer-2777",
          "text": "Raw models + lower latency definitely changes the game. Most avatar tools are wrappers on expensive APIs. Worth exploring if you can own the inference stack.",
          "score": 1,
          "created_utc": "2025-12-30 13:59:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqwizk",
          "author": "berlingrowth",
          "text": "If someone builds an agent that actually understands product state + user context and doesn’t break every time we ship a feature, I’m in. Until then, most of these feel like demos searching for founders with more time than I have.",
          "score": 1,
          "created_utc": "2025-12-30 15:49:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1u5in",
          "author": "TechnicalSoup8578",
          "text": "Are you planning to handle model switching and fallback yourself or keep it fixed per agent? You sould share it in VibeCodersNest too",
          "score": 1,
          "created_utc": "2026-01-01 07:56:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pylgcm",
      "title": "I've seen hundreds of pitch decks this year and here is my learnings:",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pylgcm/ive_seen_hundreds_of_pitch_decks_this_year_and/",
      "author": "duygudulger",
      "created_utc": "2025-12-29 12:48:24",
      "score": 44,
      "num_comments": 16,
      "upvote_ratio": 0.94,
      "text": "I've seen hundreds of pitch decks, met dozens of founders in 2025, and made dozens of pitch decks. Talked to many investors and asked their insights about pitch decks for whole year. Here is what I learned this year:\n\n1. **The problem slide is where you win or lose.** If an investor doesn't lean forward on slide 2, the rest doesn't matter. Most founders bury their best insight on slide 8.\n2. **Founders who've experienced the problem they're solving tell better stories.** Personal connection > market research every single time.\n3. **The \"platform\" word is poison.** I removed it from at least 10 decks this year. Just tell me what the thing actually does.\n4. **Traction without context is useless.** \"10K users\" means nothing. \"10K users, 23% MoM growth, $47 average revenue per user\" means something.\n5. **Most market size slides are bullshit, and investors know it.** TAM/SAM/SOM with numbers pulled from Statista doesn't impress anyone. Show me YOUR math based on YOUR customer segments.\n6. **Financial projections are fiction, but they reveal how you think.** Show you understand unit economics and investors will forgive aggressive growth assumptions. Show hockey sticks with no underlying logic and investors will assume you don't know your business.\n7. **The team slide should answer \"why you, why now.\"** Your advisor's LinkedIn profile doesn't matter. Your 10 years solving this exact problem does.\n8. **Asking for money without showing what milestones is just amateur.** \"We need $2M for hiring and marketing\" isn't a plan. \"$2M gets us to $100K MRR and 18-month runway\" is.\n9. **Design matters less than founders think, but more than they act like it does.** Your deck doesn't need to be gorgeous, but it can't look like you don't give a shit.\n10. **Every deck should answer: what's the insight only you have?** If I could've thought of your idea without domain expertise, it's not compelling enough.\n11. **Slide count doesn't matter.** Based on my experience and Carta's insights, there's no correlation between slide number and fundraising success. If a slide is meaningful, keep it. If a slide is just \"nice to have,\" remove it.\n12. **Founders confuse features with benefits.** \"AI-powered matching algorithm\" doesn't mean shit to anyone. \"Cuts hiring time from 60 days to 12\" does.\n13. **The fundraising story matters as much as the business story.** Why this round, why this amount, why now etc. If you can't articulate it clearly, investors smell desperation.\n14. **The decks that got funded weren't perfect but they were clear.** Clarity beats cleverness every single time.\n15. **Nobody reads Slide 1 (Cover slide).** They glance at it for 3 seconds. If your tagline is a paragraph, you've already lost.\n16. **\"AI\" is a feature, not a business.** In Q1 2025, slapping \"AI\" on a slide worked. Now? It's noise. Tell me what problem you solve, not what tech stack you use.\n17. **The \"Conservative Estimate\" Lie.** We know your Year 5 projection of $100M ARR is fake. You know it's fake. Focus on how you get the first $1M instead of giving huge promises.\n18. **One idea per slide.** I see founders trying to cram the Problem, Solution, and Market Size onto one slide to \"save space.\" Don't. It looks like a random note.\n19. **Your TAM is wrong.** If you claim your Total Addressable Market is \"The Global Internet,\" you don't know who your customer is. Niche down.\n20. **Font size 10 is illegal.** If an investor has to squint to read your LTV/CAC ratio on a mobile screen, they're closing the file.\n21. **Bullet points are boring.** Use icons, use charts, use big numbers. Walls of text are for legal contracts, not pitch decks.\n22. **Stop using \"Uber for X.\"** It's almost 2026. Come up with your own category.\n23. **The Appendix is your best friend.** Keep the main deck short and tell your story clearly. Put the technical deep dives in the appendix.\n24. **PDF is the only format.** Don't send a Keynote. Don't send a PPT. Fonts break. Layouts shift. Send a PDF.\n25. **Your \"Exit Strategy\" is presumptuous.** You haven't sold one unit yet. Don't tell me about your IPO plans.\n26. **Data needs context.** Don't just show a graph going up. Label the axes. Explain the spike. Everybody love labeled axes.\n27. **Consistency signals competence.** If your headers jump around and your colors shift slightly, investors subconsciously think your code is messy too.\n28. **Frameworks kill the story.** Most founders try to use famous frameworks. But those frameworks push founders to be standard. Instead of this, create your own story.\n29. **Competition slide is your positioning.** Everybody knows you cannot compete with Google, Apple, OpenAI or other big corporates. But you really can focus a niche and grow in a vertical. You don't have to write a complex competition slide. X-Y landscape is great but you have to choose the right X and Y angles and be perfect on your niche.\n30. **Don't separate \"Why Now\" into its own slide.** Weave it naturally into your problem (it's urgent), market (it's shifting), and competition (giants are slow). When \"why now\" is isolated, it feels forced.\n\n**My predictions for 2026:**\n\n**AI will review your deck before humans do.** I've talked to investors and many of them are already using AI reviews, custom GPTs, Claude, Gemini on their emails. Your pitch deck isn't just for humans anymore. You need to explain your business to AI too. Find the balance: clear enough for AI to understand, compelling enough for humans to care.\n\n**Pre-seed rounds will get harder.** Building an MVP is easier than ever thanks to AI. So investors are asking for revenue or real traction even at pre-seed, and their bar will keep rising. My advice? Generate traction first, fundraise later -when it is possible of course. (And possible doesn't mean \"if you have money\", it means \"if it is possible as technical\")\n\n**Investor outreach will be noisier than ever.** Automation tools are everywhere now. Anyone can build a bulk email campaign to investors. Standing out will require actual creativity, not just another cold email template. The spray-and-pray approach is literally dead.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pylgcm/ive_seen_hundreds_of_pitch_decks_this_year_and/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwk817a",
          "author": "Sakalule",
          "text": "tell this to a16z and the others who pump billions in fuggazi AI-powered, pre-revenue decks",
          "score": 2,
          "created_utc": "2025-12-29 15:49:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwnbj6k",
          "author": "windowsmediacenter",
          "text": "This is good advice, but I gotta say - point 3 about \"platform\" being poison made me laugh. It's like the pitch deck equivalent of \"We're going to get emails for this\" that podcasters say before every mildly controversial take. Everyone knows it's filler but people keep doing it anyway.\n\n\n\nThe traction point is so real though. Context matters for everything. \"10K users\" is like a headline that says \"Pregnant woman goes for a walk\" - technically true but tells you absolutely",
          "score": 2,
          "created_utc": "2025-12-30 00:59:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwnfs4g",
              "author": "duygudulger",
              "text": "There is too many \"platform\" for everything and this word is literally wrong for most lol \n\n\"We are going to get emails\" is spot on haha (and I guess they won't get any emails)",
              "score": 1,
              "created_utc": "2025-12-30 01:23:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwxh5mu",
          "author": "Pretty_Fisherman_746",
          "text": "This is an absolute goldmine of advice, thanks for sharing. The point about AI reviewing decks before humans really hit home, it’s the next big hurdle for founders.\n\nThat prediction is exactly why I built a custom “Pitch Deck Analyst” agent on GenSpark. I trained it on feedback from actual investors (and posts like this!). Now, when I feed it a draft, it acts like that brutally honest pre-screening AI you mentioned. It flags stuff like: “Your ‘10K users’ claim has no context,” or “Slide 5 crams problem and solution, pick one,” or “Your financials jump without a clear ‘how’.” It’s my sandbox to pressure-test decks for both AI clarity and human appeal before they go out the door.\n\nBuilding this kind of targeted agent is what platforms like GenSpark are great for. It’s become an indispensable tool to navigate exactly the future you’re describing.",
          "score": 2,
          "created_utc": "2025-12-31 15:45:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwxj1a2",
              "author": "duygudulger",
              "text": "Awesome! I'd love to try that if it is possible",
              "score": 1,
              "created_utc": "2025-12-31 15:54:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwlxmbl",
          "author": "OkDatabase1340",
          "text": "What is your role that you have seen so many pitch decks?",
          "score": 1,
          "created_utc": "2025-12-29 20:40:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwlz3wo",
              "author": "duygudulger",
              "text": "I'm making pitch decks as a service",
              "score": 1,
              "created_utc": "2025-12-29 20:48:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx1m1gj",
                  "author": "R12Labs",
                  "text": "But you're not an investor?",
                  "score": 1,
                  "created_utc": "2026-01-01 06:36:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx1ufyn",
          "author": "TechnicalSoup8578",
          "text": "This reads like hard-earned pattern recognition from real rooms, not theory, especially around problem clarity and traction context. If you had to cut this down to the three signals investors react to fastest, which would you keep? You sould share it in VibeCodersNest too",
          "score": 1,
          "created_utc": "2026-01-01 07:59:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx2v0rz",
              "author": "duygudulger",
              "text": "Good question! I'd keep;\n\nProblem validation (data from market)\nTraction or solution validation\nFirst 100 client or first $1M plan\n\nThose 3 points are really important for early stage investments\n\nP.S. I joined VibeCodersNest too but not sure if it is good post for this subreddit?",
              "score": 1,
              "created_utc": "2026-01-01 13:54:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx7s8wa",
          "author": "Obvious-Explorer-287",
          "text": "Pitch decks are mid asf and don’t mean shit",
          "score": 1,
          "created_utc": "2026-01-02 07:05:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q0h4de",
      "title": "Advice from someone who made his first 1k profit per month",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1q0h4de/advice_from_someone_who_made_his_first_1k_profit/",
      "author": "WashConsistent6355",
      "created_utc": "2025-12-31 16:31:56",
      "score": 39,
      "num_comments": 10,
      "upvote_ratio": 0.93,
      "text": "Last year around this time I was already trying for almost 2 years to make money online, had like 100 ideas written down, watched too much content, read a lot, and still… 0 dollars online.\n\nThe year change always hit hard, because you think this will be my year, but you’re still mostly thinking instead of actually doing. That was me.\n\nAt some point I read something very simple, it said stop thinking about 10k and just try to make 1 dollar. That sentence stayed in my head.\n\nSo in June I just tried to make 1 dollar online, nothing more. I’m in the surf niche, so I made a simple inside joke design, put it on a mug because mugs felt low risk, built a Shopify store in about 2 days and ran some ads.\n\nWhen the first sale came in and I saw that 1 dollar, I just stared at the screen for a moment. After almost 2 years of zero, it felt unreal.\n\nAt the beginning it wasn’t really profitable and some days I was just happy I didn’t lose money, but I kept changing small things, reading a bit, trying again, and then it clicked.\n\nIn around 20 days I sold about 400 mugs and made a bit over 2k profit.\n\nWhat surprised me the most wasn’t even the money, but what happened after I started really working instead of just thinking, because suddenly I understood how things actually work, I learned more in a few weeks than in the 2 years before, and I started seeing opportunities everywhere.\n\nIdeas stopped feeling like fantasies and more like things I could actually test, and that feeling alone is fucking gold.\n\nI’m still learning and still figuring things out, but I remember how stuck I felt before and just wanted to share this, maybe it helps someone who’s in that same place right now.\n\nThat’s it. Wish you all a good start:)",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1q0h4de/advice_from_someone_who_made_his_first_1k_profit/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwz2jsp",
          "author": "MacFG",
          "text": "That's awesome 👌.  I'm in a similar position. Been pushing like crazy and follow a similar step approach.  Each day I try do atleast one thing that gets me closer to my goal or make more sales. Even And if i dont get a sale, I must do somthing that wilI get me closer. Research, a call, reach out. I fight for every penny. I was close to getting my new target of 1K per month.  Got knocked down a peg or two but I'm close. \n\nCONGRATULATIONS!  I can totally appreciate your efforts.",
          "score": 3,
          "created_utc": "2025-12-31 20:36:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx2c6ey",
              "author": "WashConsistent6355",
              "text": "I wish you the best!",
              "score": 1,
              "created_utc": "2026-01-01 11:08:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx3ezhj",
          "author": "PavelBoss13",
          "text": "Some ideas don't bring money. It's a fact",
          "score": 3,
          "created_utc": "2026-01-01 15:58:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx3oi7z",
              "author": "WashConsistent6355",
              "text": "Yesss sure. I feel like with time you slowly get a feeling for what could bring money and what not.",
              "score": 2,
              "created_utc": "2026-01-01 16:49:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx3p1aq",
                  "author": "PavelBoss13",
                  "text": "It's true. But it takes a lot of time and effort. Really?",
                  "score": 2,
                  "created_utc": "2026-01-01 16:52:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx45r6s",
          "author": "Mr_LoveGrowth",
          "text": "This really resonates. Actions is so underrated, no matter how small it is",
          "score": 3,
          "created_utc": "2026-01-01 18:17:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx591d8",
          "author": "zxblood123",
          "text": "This is awesome. Are your mugs digital prints or actual mugs that you need to ship from a manufacturer",
          "score": 1,
          "created_utc": "2026-01-01 21:36:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxw9e3",
      "title": "How small changes tripled my sales twice in a year.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pxw9e3/how_small_changes_tripled_my_sales_twice_in_a_year/",
      "author": "apzuckerman",
      "created_utc": "2025-12-28 17:00:12",
      "score": 19,
      "num_comments": 13,
      "upvote_ratio": 0.85,
      "text": "I want to share a reminder that small, thoughtful changes can compound faster than most people expect.\n\nI created my first product after my father died. I called it the “Estate Preparation Package.” The goal was simple. Help families organize critical estate information so the people left behind were not scrambling.\n\nWhat I did not anticipate was the confusion.\n\nA lot of people assumed they were buying a will or legal documents and I lost them in the funnel. That was not the product. I was solving an organization and action problem, not a legal drafting problem. But the name and framing were bad.\n\nSo I made a change.\n\nI renamed the product the CLEAR Kit. It became both a product name and an acronym. (Comprehensive legacy and estate administration repository.) It sounded tangible, not like a professional service, but more importantly it clarified what it was (and just as importantly what it was not).\n\nSales tripled.\n\nRecently, I made another set of changes that were far less dramatic but just as intentional. I rewrote the product page to focus on benefits instead of features. Less about what is included, more about what families can actually do with it. I also cleaned up metadata across Shopify so the product was easier to understand by both people and search engines.\n\nSales tripled again.\n\nNo viral moment. No massive rebrand. No new product.\n\nJust clearer language, better positioning, and a willingness to admit that confusion is usually our fault as founders.\n\nThe lesson I keep relearning is this. Incremental improvements stack. When you remove friction at multiple small points, the cumulative effect can be enormous.\n\nIf something isn't converting, don't assume the idea is broken. Sometimes the explanation is.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pxw9e3/how_small_changes_tripled_my_sales_twice_in_a_year/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwiayar",
          "author": "Alarmed_Win_9351",
          "text": "Even if it was AI, the single point it boils down to is valid and a good reminder to not get stuck in a weak position just because you are in love with your own idea.",
          "score": 3,
          "created_utc": "2025-12-29 07:18:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwj6hcu",
          "author": "whyyoudidit",
          "text": "it's ai because you mentioned the name of your product. It's an ad disguised as something else.",
          "score": 1,
          "created_utc": "2025-12-29 12:04:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwevsz0",
          "author": "amhumanz",
          "text": "Slop",
          "score": 1,
          "created_utc": "2025-12-28 19:27:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwgcacu",
              "author": "Omissionsoftheomen",
              "text": "There is a tremendous amount of AI crap on this subreddit, BUT, this post isn’t that. If you have an info based product, it’s actually actionable information. Make sure the message matches the market, sell results not process.\n\nIf it was ChatGPT, there would have been a lot more drama.",
              "score": 3,
              "created_utc": "2025-12-28 23:51:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwewcbm",
              "author": "apzuckerman",
              "text": "Wow. The trolls are grumpy today.",
              "score": 3,
              "created_utc": "2025-12-28 19:29:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwewgsh",
                  "author": "amhumanz",
                  "text": "Nope, it's just obvious",
                  "score": 1,
                  "created_utc": "2025-12-28 19:30:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nweaiji",
          "author": "aVarangian",
          "text": "This AI post ain't selling shit, that's for sure.",
          "score": -2,
          "created_utc": "2025-12-28 17:47:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwebdjt",
              "author": "apzuckerman",
              "text": "Not AI, I wrote this sitting for a flight back home from Xmas. Appreciate the criticism though...\n\nHappy to share pics of the product and site evolution if you'll bet me $100 to a charity of my choosing.",
              "score": 5,
              "created_utc": "2025-12-28 17:51:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwegd87",
                  "author": "aVarangian",
                  "text": "It reads like many generic posts do. Could have been taken straight from a linkedin repost.\n\nYour suggestion is despicable. Charity is neither a game nor a show and my budget is none of your business. Eff off.",
                  "score": -11,
                  "created_utc": "2025-12-28 18:15:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pvbz57",
      "title": "Entrepreneur \"Muscle Memory\"",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pvbz57/entrepreneur_muscle_memory/",
      "author": "nucleustt",
      "created_utc": "2025-12-25 12:01:36",
      "score": 11,
      "num_comments": 4,
      "upvote_ratio": 0.93,
      "text": "I've had a small business since 2006.\n\nI was a software developer, and I built software systems to run companies.\n\nFor instance, a farmers' market hired me to build a system that tracks payments and vendor booth allocations.\n\nA commercial garbage collection company hired me to build a system that tracks company assets, maintains customer records, schedules garbage collection, allocates drivers and vehicles, etc.\n\nIt took me years to understand business and shift out of the employee mindset.\n\nIn 2019, I started another company with a business partner (who also had business experience). Within a couple of months, that company became more profitable than any of our previous ventures (\\~160k-200k per month) with an over 80% profit margin because it was a service-based business.\n\nThe company didn't leverage any of our existing networks and was a complete unknown.\n\nI heard others saying things like \"it takes time to build a business,\" etc., etc. Which I don't believe is entirely true.\n\nIt takes time to build a successful entrepreneur, but then the entrepreneur develops (in most cases) \"muscle memory\" with the skills and mindset needed to build other successful ventures in less time and less effort.\n\nIt's not just me. Many of the founders of famously successful startups came from being founders / early employees of previous startups.\n\nYou can give a newbie a step-by-step playbook, and they won't succeed. But a seasoned entrepreneur can start a completely new venture and become massively successful, effortlessly.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pvbz57/entrepreneur_muscle_memory/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nvzd3s9",
          "author": "LeiraGotSkills",
          "text": "I agree to this 101%",
          "score": 2,
          "created_utc": "2025-12-26 05:34:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvv5y9q",
          "author": "Piloz85",
          "text": "Effortlessly I don't know rick",
          "score": 1,
          "created_utc": "2025-12-25 13:07:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw2a277",
          "author": "vigilantvaliant",
          "text": "Just curious.. what was the service based business?? All ears!",
          "score": 1,
          "created_utc": "2025-12-26 18:37:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw2ivph",
              "author": "nucleustt",
              "text": "Company Compliance. So, company formation, annual filings, beneficial ownership declarations, etc.\n\nNon-accounting based.",
              "score": 1,
              "created_utc": "2025-12-26 19:23:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pxq9bi",
      "title": "Stuck in 0 user hell",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pxq9bi/stuck_in_0_user_hell/",
      "author": "Rough-Kaleidoscope67",
      "created_utc": "2025-12-28 12:30:23",
      "score": 9,
      "num_comments": 23,
      "upvote_ratio": 1.0,
      "text": "I've been working for a few months now on a one-page website builder that creates uniquely designed websites for small businesses with a strong focus on three areas: conversion, good SEO principles and ease of going live. I think the product solidly delivers on all of these.\n\nFrom here on I figured outreach would be the big one right, and I feel like I'm doing what I'm supposed to be doing, and keep iterating the product based on feedback I'm getting, trying to reach people for who the product would actually be useful. I feel my issue is that it is hard to actually reach my users. I think, at least initially I should be doing it in person, but right now I'm based in the country of Georgia, where most small businesses have no interest in a website. In my home country in Belgium, it seems like businesses want to have a website, but even the easy fast do it yourself option feels too much work for most of them, so I'm having more success selling the sites all-in for a fixed price. But this also feels off, because I'm basically asking them the input manually and than still use my own tool to make the site for them, so it's hard to price it \"right\" if that makes sense?\n\nI'm now doing cold out reach through Instagram / Messenger / WhatsApp DMs to SMB owners I find on Google Maps that do not have a website yet mainly (I'm also thinking of reaching out to those who already have a website, but a bad / outdated one). The highest reply rate by far is \"Hey, I had a question, do you mind if I ask?\" <- then proceed to ask them about why they don't have a website yet (but this feels like \"tricking\" them, which I don't like). Other outreach approaches seem to have a very low reply rate (I tried short / long / introducing me in detail / not doing that / reaching out with the a free preview offer and than having the option for them to continue building it / have an offer to do it all-in and handle everything for them (of course at a higher price point). But all of those seem to have a very very low reply rate (like less than 5%).\n\nSo I'm wondering looking at competitors like Wix, Squarespace, Durable who have all been able to scale to millions of users, why it's so hard for me to find even one paying user for a product a feel addresses quite a few of the pain points that SMB owners are talking about when using those services. What am I doing wrong? How do you think I should find users for what I have build? Should I just focus on doing the all-in websites (at least initially) as those pay the bills?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pxq9bi/stuck_in_0_user_hell/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nweqq2j",
          "author": "Particular_Film_8308",
          "text": "What you’re describing actually isn’t unusual, and it’s not a contradiction either.\n\nI recently discovered that behavior is usually the cleanest signal. What you are seeing suggests people are willing to pay more to make a problem disappear (than to learn a better way to handle it themselves). Especially smb owners.\n\nWhen someone pays more specifically to not be involved, that tells you something.   \nThey’re not really buying a website, they are buying relief from having to think about websites at all.\n\nThat doesn’t mean your tool or initial idea is wrong. It may just mean the first buyer isn’t the DIY user you imagined, but someone who wants the outcome without the cognitive overhead. a lot of successful software products started as services for exactly this reason.\n\nIt might help to stop asking why won’t they use the tool and instead ask who actually wants this problem off their plate, and when. Those are very different buyers.\n\nIf you zoom out for a moment, do you want the next phase to buy you validation that the tool works, or clarity about who truly wants to own this problem themselves?",
          "score": 8,
          "created_utc": "2025-12-28 19:03:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwi3t9i",
              "author": "draftset",
              "text": "Underrated comment",
              "score": 2,
              "created_utc": "2025-12-29 06:17:04",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwi4a3n",
              "author": "Obvela",
              "text": "This is a very good explanation. I had the same problem and noticed the exact same thing with business owners. \n\nThey would rather pay more and focus on other important things than pay less and have to do it themselves.",
              "score": 2,
              "created_utc": "2025-12-29 06:20:55",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwiddim",
              "author": "Rough-Kaleidoscope67",
              "text": "I definitely agree with you, but at the same time it makes me wonder than how Wix / Durable / Squarespace etc. get so many SMBs to actually prefer doing it themselves. But you're likely right in that the relief of not having to think about it at all has more demand (at least in Belgium for sure)!  \n  \nThat's a good question, I think I need more clarity on who truly wants to own this problem themselves <- and that might actually be a way smaller amount of people than those who just want relief!  \n  \nSuper helpful comment, much appreciated!",
              "score": 2,
              "created_utc": "2025-12-29 07:39:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwthjeb",
          "author": "erickrealz",
          "text": "The mismatch between what you built and what people are buying is your answer. You made a DIY tool but customers want done-for-you service. That's not a marketing problem, that's market feedback telling you what they actually value.\n\nThe small businesses you're targeting don't want another tool to learn. They want the website to exist without them thinking about it. Wix and Squarespace scaled with tens of millions in marketing spend and years of brand building, comparing yourself to them is pointless. They also target a different user, someone who actually wants to build their own site.\n\nThe \"tricking\" feeling about your opener is misplaced. Asking someone why they don't have a website isn't manipulation, it's genuine curiosity about their situation. That's just sales.\n\nWith our clients doing productized services the ones who succeed fastest stop fighting what customers are buying. If done-for-you at a fixed price is closing, do that. Price it based on the value of a working website to them, not based on how long it takes you. If your tool lets you build sites in 2 hours that would take someone else 10 hours, that efficiency is your margin.\n\nRun the productized service for 6-12 months, learn what these customers actually need, then decide if the DIY tool still makes sense. Revenue now beats theoretical SaaS scale later.",
          "score": 3,
          "created_utc": "2025-12-30 23:11:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvojgg",
              "author": "Rough-Kaleidoscope67",
              "text": "Yeah, interestingly enough we are already spreading quite well through word of mouth for the done-for-you strategy and the customers users of that seems very happy with their  websites! Maybe I should focus on that to the point that it becomes too much to handle and than funnel from there into the saas?\n\nI agree that right now I can't compare to Squarespace etc. but they must've gotten their first 100 customers from somewhere too right! 😄\n\nYeah, I definitely see what you're saying and that makes sense! Who knows the road might be to keep the builder internal and scale the \"we do it for you route\" somehow!",
              "score": 1,
              "created_utc": "2025-12-31 07:39:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwd7msl",
          "author": "Novel-Notions",
          "text": "You should dial 50 businesses a day for two weeks straight until you get your first 30 paid clients and then…",
          "score": 2,
          "created_utc": "2025-12-28 14:23:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwdngku",
              "author": "Rough-Kaleidoscope67",
              "text": "Yeah, this actually makes sense. I should probably call instead of messaging! Will give that a go and let you know how that went!",
              "score": 1,
              "created_utc": "2025-12-28 15:52:21",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nwj6dc9",
              "author": "Novel-Notions",
              "text": "What is your call script? Why don’t you post it as a reply to this message and welcome feedback. Cold calling isn’t for the faint of heart and a tight script takes craft",
              "score": 1,
              "created_utc": "2025-12-29 12:03:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nws5og9",
                  "author": "Rough-Kaleidoscope67",
                  "text": "In short the pitch I'm trying right now is: Hey my name is Tib from Boosterpack, I found your business and really liked X about it, but I noticed you didn't have a website yet / your website might benefit from a redesign (a lot of outdated websites out there for SMBs).  As we are about to launch a new service for beautiful one-page websites (without the crazy agency price tag) I figured I'd reach out to you. Right now we can make a first version for you for free, if you don't like it, no worries, if you do like it, we'll check together how we can get it live! <- than let the conversation go from there pretty much.\n\nFeedback welcome for sure!",
                  "score": 1,
                  "created_utc": "2025-12-30 19:19:07",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwdhru0",
          "author": "AnonJian",
          "text": "You ignored this was somewhere in the top five things people used AI for. You didn't examine the competition, find the persistent pain points people who built with Wix, Squarespace or AI still have, then marketed against them.\n\nBuild It And They Will Come is a bitch when you never solved for \"they.\" And it's 2026, where one of your relatives have a kid who can build a website.\n\nBasically you launched first, then asked questions later. First question is usually \"What In The Hell Just Happened?!\" The capitalism fairy does not grant you a fair share of the market just for showing up in a browser. Who Knew?\n\nZero response is an option, whether a newbie thinks that can happen or not.\n\nYou -- everybody with this question -- finds first users in the research phase they jettison to crap something out market-blind. Now you know not to crap something out market-blind. Kudos.\n\nSilence is feedback. It doesn't just mean \"no\" it means you are so off-the-rails it's not worth telling you \"no.\"",
          "score": 2,
          "created_utc": "2025-12-28 15:22:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwdncml",
              "author": "Rough-Kaleidoscope67",
              "text": "I get where you’re coming from, but I didn’t ship this blind or assume “build it and they’ll come.” I did a lot of upfront research, compared Wix/Squarespace/Durable, and the persistent pain points I kept hearing were: time / effort (even with site builders) and sites that don't convert (still requiring often the hiring of someone)*.* That’s exactly what I built around. Also want to be clear, that I do see SMBs wanting a website done for them, they're even willing to pay me a fixed price to do it for them of 1000 USD + 20 USD p.m. (even if they could literally do it themselves using the tool for 20 USD p.m. without the fixed fee in about 20 minutes,  maybe 1 hour with usual required changes).\n\nI’m not surprised the market for website builders is crowded at all, and I’m not expecting a \"fair share\" for showing up. But I am surprised by is how hard it is to even get a conversation going for a DIY builder especially if it can easily save them a 1000 USD. But the I do it for you for a 1000 USD works and the you can actually do it as easily yourself doesn't. So I feel it might be a communication problem <- I just never even get to the part where I can explain this if that makes sense, haha!",
              "score": 1,
              "created_utc": "2025-12-28 15:51:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwdp5ug",
                  "author": "AnonJian",
                  "text": "Charge 1000 + 20 monthly -- then offer a discount for a half-hour discussion. Or fold the customer discovery into requirements gathering. What I think you'll find is the offer of money dries up and blows away just the same. \n\nPoint being, people like to take what people say on face value, making the research they claim to have done null and void. Let me get this straight. Microsoft's Kin, canceled in forty-nine days of contact with market reality. HP Touchpad ...yanked off-market in forty-eight days. Marketing teams. Design teams. Focus groups. User labs. Millions in potential marketing budgets. And trained adults no less. \n\nBut those dolts didn't have Rough-Kaleidoscope67 on their team to unerringly steer them to truth. Yeah ...no.",
                  "score": 1,
                  "created_utc": "2025-12-28 16:01:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwhz3lx",
          "author": "Unique-Painting-9364",
          "text": "Early on, distribution usually matters more than the product. Big builders didn’t start self-serve either, they sold done for you first, learned objections, then abstracted it. Selling all in to a narrow niche to validate demand and messaging doesn’t sound wrong at all, it sounds like traction.",
          "score": 2,
          "created_utc": "2025-12-29 05:39:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwie3la",
              "author": "Rough-Kaleidoscope67",
              "text": "Thanks, I appreciate that. Maybe I should accept that this way is actually fine, haha!",
              "score": 1,
              "created_utc": "2025-12-29 07:46:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwh0qsk",
          "author": "HangJet",
          "text": "You do understand that besides those flagship sites, there are 1000's of these type of SaaS apps out there and the number keeps growing monthly.\n\nYou are in a highly saturated market doing the mostly the exact same thing everyone else does.  Also remember it really isnt sticky.  They build their site and then go away for the most part.",
          "score": 1,
          "created_utc": "2025-12-29 02:05:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwie06j",
              "author": "Rough-Kaleidoscope67",
              "text": "I agree but also disagree if that makes sense. I think there's three niches here:  \n\\- LLM direct coding help (think Cursor, etc.) <- requires you to be technical for good results  \n\\- LLM tools like Lovable, Replit etc. <- honestly, they still require you to be technical to get good results, but a little easier to get going  \n\\- Website builders integrating partial AI: Wix, Squarespace, Durable etc. <- the way they work mostly is using the LLM to \"match templates\"\n\nI would say Durable is likely the closest competitor to what we do, but we do it faster + get way better results (tested extensively for multiple SMBs). The websites score better on pretty much every aspect. The idea is that the sticky part is the included hosting (which we charge 20 USD per month for). So no need to move away. It's also why I focus on SMBs mainly.",
              "score": 1,
              "created_utc": "2025-12-29 07:45:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwi0nw5",
          "author": "Your-Startup-Advisor",
          "text": "You missed customer discovery. \n\nLeave your product as is and go do proper customer discovery.",
          "score": 1,
          "created_utc": "2025-12-29 05:51:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwicw8i",
              "author": "Rough-Kaleidoscope67",
              "text": "On it!",
              "score": 1,
              "created_utc": "2025-12-29 07:35:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwrxg4m",
          "author": "jo0stjo0st",
          "text": "You specialize in websites with good SEO principles which convert good, where are your SEO converting clients? Or your converting clients in general? The proof is in the pudding.",
          "score": 1,
          "created_utc": "2025-12-30 18:40:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtgt92",
          "author": "kiterdave0",
          "text": "Most people are intimidated by building themselves, even changing copy in a wp template. Smb owners might not be the customers. They go does this multiple times? Its agencies and designers. And with them you are competing against their existing stack.",
          "score": 1,
          "created_utc": "2025-12-30 23:07:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzonu6",
      "title": "I’m seeing more patience baked into launches",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pzonu6/im_seeing_more_patience_baked_into_launches/",
      "author": "QuantumCatapult",
      "created_utc": "2025-12-30 17:49:49",
      "score": 8,
      "num_comments": 12,
      "upvote_ratio": 0.91,
      "text": "Patience used to feel like a luxury that only established brands could afford—those with recognition, trust, and a built-in audience. Recently, though, I’ve noticed newer brands experimenting with the same approach. They’re posting less frequently, leaving more space between messages, and showing a willingness to let curiosity and anticipation build naturally instead of pushing constant updates. It’s still difficult to tell whether this reflects a long-term strategic choice or a period of experimentation, but either way, it noticeably alters how people pay attention, engage, and form expectations around a brand.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pzonu6/im_seeing_more_patience_baked_into_launches/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwu747e",
          "author": "JollyAd6242",
          "text": "Yeah, I've picked up on this too. Feels like some brands finally realized that flooding people's feeds doesn't actually do much. The slower pace lets things breathe a bit, and people seem more willing to actually pay attention when something does drop. Still early to say if it sticks or if it's just the current phase everyone's trying out.",
          "score": 1,
          "created_utc": "2025-12-31 01:33:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwuz52j",
          "author": "DayAffectionate8617",
          "text": "I’ve noticed the same thing with new watch brands too instead of constant drops or loud hype, they’re letting silence do the work. Rotoris comes to mind here Their tagline “for those who become more, not have more” only really makes sense if you don’t rush attention xd",
          "score": 1,
          "created_utc": "2025-12-31 04:22:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvrq2k",
              "author": "Puzzleheaded-Coat726",
              "text": "Yeah, that’s a good point Silence only works when there’s actual intent behind it otherwise it just feels lazy If a brand’s message is solid, they don’t really need to keep shouting anyway lol",
              "score": 1,
              "created_utc": "2025-12-31 08:09:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwvsgb7",
                  "author": "DayAffectionate8617",
                  "text": "Exactly broo",
                  "score": 1,
                  "created_utc": "2025-12-31 08:15:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwvu7um",
          "author": "yori4zero",
          "text": "Ok",
          "score": 1,
          "created_utc": "2025-12-31 08:32:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvus8h",
          "author": "hilegitspeaks",
          "text": "Which company you can suggest for this?",
          "score": 1,
          "created_utc": "2025-12-31 08:38:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvwo6q",
              "author": "QuantumCatapult",
              "text": "You need to understand the fundamentals of marketing and closely study how different brands operate in the industry. Looking at both established and upcoming brands is important—Rotoris is one good example you can learn from. There are many others as well; this is just to give you a clearer understanding.",
              "score": 1,
              "created_utc": "2025-12-31 08:55:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx59den",
                  "author": "DayAffectionate8617",
                  "text": "Damn m actually lowkey impressed seeing rotoris vision",
                  "score": 1,
                  "created_utc": "2026-01-01 21:38:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwvwo3c",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-31 08:55:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvwuin",
              "author": "bizglows_",
              "text": "True—and I think that restraint also filters the audience. The impatient ones leave, the curious stay.\n\nIts always the case",
              "score": 1,
              "created_utc": "2025-12-31 08:57:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwvx6py",
                  "author": "financially-yours",
                  "text": "Slow and steady wins the race 🏁 \n\nAny brand that follows it will surely succeed whatever the circumstances look like. A lot of history examples suggests this, isn't it?",
                  "score": 1,
                  "created_utc": "2025-12-31 09:00:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1px8xpk",
      "title": "I niched down and it worked out",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1px8xpk/i_niched_down_and_it_worked_out/",
      "author": "Xyz3r",
      "created_utc": "2025-12-27 21:20:30",
      "score": 8,
      "num_comments": 12,
      "upvote_ratio": 0.79,
      "text": "Until 2024 all of my projects were mobile apps.  They worked (to some extent) but they all ended up looking boring (flutter + material fml). Retention was bad. And shipping updates was always annoying because of the App Store and Play Store release process. Even small changes took too long to get out.\n\nOne thing I noticed was branding. My apps had no personality. People would try them and then forget about them (except for one that solves a real issue but I offer it for free because it is very niche and I like the mission. Costs me nothing to run too).\n\nSo for one app, I made a mascot. That helped. The app felt more memorable. Onboarding and empty states looked At least a bit better. \n\nBut making a mascot properly takes a lot of time. You need many versions: different poses, expressions, and situations. If you want it consistent, you spend hours doing small tweaks. I got tired of that.\n  \n\nSo I built a web tool. I built it for two reasons:\n\nA) to fix my own problem and generate mascots and other assets faster\n\nB) because I’m fkin annoyed by the App Store and Play Store release process, and I wanted to ship updates instantly\n  \n\nAt first it was a generic SVG tool. It could generate and export clean SVG assets.\n\nThen I watched what people did when I showed it. They cared way more about mascots than random illustrations. They wanted something they could reuse across onboarding, empty states, docs, emails, and ads. \n\nSo I doubled down on mascot creation. I focused the product on:\n\n- consistent character style\n- easy and fast to create lots of poses and variations\n- brand palette control\n- clean SVG export that can be used right away and also modified if necessary / integrated  into other existing illustrations easily \n\nAfter that, the product got much easier to sell. I hit some minor vitality on X (created a mascot for some medium sized account, he gave me a shoutout and people loved it). \n\nIn the first month, I hit 2k revenue mainly because I stopped pushing “generic SVG generation” and focused on mascots.\n\nNow I am building a library of free mascots anyone can use - free of charge and with MIT license. No login / signup required.\n\nCurrently only 5 mascots are available but I will be releasing more every few days. \n\nGenerating one mascot with ~25 poses plus vectorizing it in high quality costs around 5 bucks for me so let’s see how many I can / want to create and how it pays off as a marketing option.\n\n",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1px8xpk/i_niched_down_and_it_worked_out/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwa5l32",
          "author": "theravencromwell",
          "text": "website?",
          "score": 2,
          "created_utc": "2025-12-28 00:31:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwbnoxm",
              "author": "Xyz3r",
              "text": "Svgapp dot ai",
              "score": 1,
              "created_utc": "2025-12-28 06:20:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwa6s82",
          "author": "Professional-Ad6844",
          "text": "How did you get your users?",
          "score": 2,
          "created_utc": "2025-12-28 00:38:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwbnrh6",
              "author": "Xyz3r",
              "text": "Mostly posting on x doing free stuff for people (usually that’s me 1-2 min + 5-20 cents)",
              "score": 2,
              "created_utc": "2025-12-28 06:21:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwc9xgc",
                  "author": "Professional-Ad6844",
                  "text": "That’s cool. In x I got so tired of everyone just gloating sales numbers or stupid questions like I brought a mac what should I install kind of questions. I need to try this. Thanks for sharing",
                  "score": 1,
                  "created_utc": "2025-12-28 09:50:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwabjf3",
          "author": "quietstepsdaily",
          "text": "Very interesting. Thanks for sharing.",
          "score": 2,
          "created_utc": "2025-12-28 01:06:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwq12g5",
          "author": "Shot_Hall_3569",
          "text": "I have actually searched for such tool for my previous projects. Might be using for my next one. Really cool stuff.",
          "score": 2,
          "created_utc": "2025-12-30 12:53:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwrxwqs",
              "author": "Xyz3r",
              "text": "Thx 🙏 let me know if you have any feedback. Best via x @xz3dev",
              "score": 1,
              "created_utc": "2025-12-30 18:42:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwa8wl4",
          "author": "Real-Purple-6047",
          "text": "Nice pivot. The mascot angle is smart... way easier to position than \"generic SVG tool.\"\n\nCurious how the free library plays out. 5 bucks per mascot isn't terrible if it brings decent traffic, but that'll add up quick if you're dropping them every few days.",
          "score": 1,
          "created_utc": "2025-12-28 00:50:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwc3zxf",
          "author": "BeginningPollution78",
          "text": "This is cool! I've definitely noticed how much a good mascot can make an app feel more memorable vs just another generic tool. The pivot from mobile apps to web makes sense too - the App Store review process is such a pain for small iterations. Being able to ship fixes same-day instead of waiting 2-3 days (or longer if they reject something dumb) is a game changer.",
          "score": 1,
          "created_utc": "2025-12-28 08:52:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwc4krt",
          "author": "Xyz3r",
          "text": "These bots aren’t even trying with their generic ass responses 💀",
          "score": 1,
          "created_utc": "2025-12-28 08:57:45",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "nwayj6x",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": -2,
          "created_utc": "2025-12-28 03:23:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwbnslq",
              "author": "Xyz3r",
              "text": "Bot",
              "score": 1,
              "created_utc": "2025-12-28 06:21:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q10umc",
      "title": "Taking a year off to travel and build Apps",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1q10umc/taking_a_year_off_to_travel_and_build_apps/",
      "author": "PersistentBuild",
      "created_utc": "2026-01-01 10:03:39",
      "score": 8,
      "num_comments": 9,
      "upvote_ratio": 0.83,
      "text": "As I wrote this post, I was wondering what I really wanted to get out of posting this. I think it's partly to get the comfort of hearing about other people doing the same thing, and partly because I want to also be challenged and hence be able to prepare myself better for what's coming.\n\nIn March, I'll be leaving my 72K€/year job (in Spain) as a Product Manager to travel the world with my girlfriend and use a lot of the time to build products myself. I'm 28 years old and really like my job, I really do. At the same time, during the last months I have built a couple of products that get around 150 visits per month (no paid users yet), and it has been really eye-opening on how much I love doing this. I can't stop imagining myself doing this for a living. It's been hard to juggle between a demanding full-time job, social life, and building these products. I feel that if I had more mental capacity to focus on this, I could really make it.\n\nAt the same time, my girlfriend is up to traveling the world and I feel like it's now or never (I have no kids, no debts, no attachments).\n\nI have cash runway for 2–3 years, but my plan is to do this for a year, explore building products more seriously, and discover if I really want to do this full-time. Worst case, I come back to my job or find a new one (I have confidence I can find another one easily).\n\nAnyway, just wanted to share my experience and see if it resonates with someone. Any tips, challenges, will be greatly appreciated.\n\nThank you and happy building!",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1q10umc/taking_a_year_off_to_travel_and_build_apps/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nx2diy4",
          "author": "WashConsistent6355",
          "text": "That sounds awesome! Wish you best luck!",
          "score": 3,
          "created_utc": "2026-01-01 11:22:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx2veqh",
          "author": "Erveon",
          "text": "Sounds great, but beware that if you want to build a business, it's at minimum a full time job too (unless you strike gold, which you haven't yet) and if you want to get the most out of traveling, it'll take away from entrepreneurship and vice versa.\n\nThat being said, if this feels like the right thing in your life right now then it probably is a now or never thing and you should take the leap more-so for personal development at first and see if you can combine it with time.\n\nGood luck!",
          "score": 2,
          "created_utc": "2026-01-01 13:57:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx3lejk",
          "author": "Outskalr",
          "text": "This really resonates. You’re not escaping but exploring while the risk is low and the upside is there. Having runway and confidence changes everything. Worst case, you return with better skills. One tip I might offer would be to focus on one product at a time so freedom doesn’t turn into distraction. Things get exciting very quickly",
          "score": 2,
          "created_utc": "2026-01-01 16:32:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx3wdzf",
          "author": "Extension-College923",
          "text": "Seems like a good combo of traveling + building, and using the year for validation on doubling down after or getting a job. \n\nJust traveling could get boring so the building piece would give you a sense of purpose",
          "score": 2,
          "created_utc": "2026-01-01 17:30:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx4sj1j",
          "author": "Flaky_Ad_4087",
          "text": "I’m in the exact same boat 💯",
          "score": 1,
          "created_utc": "2026-01-01 20:10:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx6crhx",
          "author": "AffectionateHumor453",
          "text": "Sounds cool Good luck!",
          "score": 1,
          "created_utc": "2026-01-02 01:15:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx7thqe",
          "author": "ms-roundhill",
          "text": "So you didn't ask for financial advice, but yieldmax has sone high income ETFs that you could do your research and then invest a portion of your savings so that you aren't depleting your principle. \n\nI got DOGE'D last year and I've been living off of my dividends while building my website.",
          "score": 1,
          "created_utc": "2026-01-02 07:16:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pynad0",
      "title": "Employees cant seem to stay longer than 2 years in a startup",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pynad0/employees_cant_seem_to_stay_longer_than_2_years/",
      "author": "nucleustt",
      "created_utc": "2025-12-29 14:12:58",
      "score": 7,
      "num_comments": 34,
      "upvote_ratio": 0.71,
      "text": "I run a small business that handles compliance and company formation documents.\n\nI've discovered that employees usually leave around the 2-year mark.\n\nBesides being employed in my company, the thing they all have in common is that they're in their early to mid-twenties.\n\nThese are the challenges you'll most likely face as a startup.\n\n1. If you're bootstrapping, you're unlikely to be able to afford the best talent.\n2. Mostly Gen Z would apply, since they're the ones most actively hunting jobs. They also don't need job stability at this point, so a startup is a great place for them to begin.\n3. When you hire Gen Z, they'll come in inexperienced, learn from you, make lots of mistakes, and then churn because they're using your startup as a stepping stone.\n4. This would cost you in terms of time (having to train another new employee) and money (advertising the new position and interviewing the person, etc)\n5. You'll start the cycle all over again\n6. Over time, this would take a toll on your startup\n\nHow I'm tackling the problem.\n\nMy first and most important hire was in her forties and received equity, so she's heavily invested and is sticking around.\n\nThe employees who did good work are being utilized as freelancers.\n\nAI is being introduced. I'm confident that this would be a game-changer.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pynad0/employees_cant_seem_to_stay_longer_than_2_years/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwndh2f",
          "author": "loud-spider",
          "text": "These posts always go the same way:\n\n1 - Employees always leave after 2 years\n\n2 - I barely pay them enough, but I try to find other reasons why they'll leave.\n\n3 - I can't afford to pay them more so it is what it is\n\n4 - Loop back to 1\n\n'Affordability' on all sides may be a sign of the current state of the economy, but the problem you're not tackling is the pay issue that's likely at the core of the problem.",
          "score": 10,
          "created_utc": "2025-12-30 01:10:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwnfw6h",
              "author": "idubbkny",
              "text": "and im using AI to potentially replace them. why won't they stay?!",
              "score": 4,
              "created_utc": "2025-12-30 01:23:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwpa785",
              "author": "nucleustt",
              "text": "Nah, pay wasnt the issue for me.\n\nI just remembered that we pay better than many other established companies, and also more than any of their previous jobs,\n\nIn my case, the employee left because she disagreed with something the manager said.",
              "score": 1,
              "created_utc": "2025-12-30 09:03:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwpzzv1",
                  "author": "ktnaneri",
                  "text": "So is it only a single employee that left because of disagreement with management or are there multiple?",
                  "score": 1,
                  "created_utc": "2025-12-30 12:46:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwqq2bf",
                  "author": "loud-spider",
                  "text": "Fair enough. If it's not endemic and 'people' aren't leaving because they disagree with something the manager said, then I guess that's the way that goes then, you're always going to have disagreements and have individuals leave.",
                  "score": 1,
                  "created_utc": "2025-12-30 15:17:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwxivug",
              "author": "plmarcus",
              "text": "having tested this with technical talent there is very little correlation between people staying and being strongly compensated.  We've payed early career people market and 90th percentile with similar results.\n\nif you look at the employment research people generally leave for other reasons (not liking management being #1) \n\nthere are certainly people who only chase salary but small companies and startups often don't hire them as they are pretty easy to sniff out early on.",
              "score": 1,
              "created_utc": "2025-12-31 15:53:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwy2z8u",
                  "author": "loud-spider",
                  "text": "Yep, the number one reason people leave is that they don't like their manager. \n\nI've been hiring for 35+ years, you can often see if coming. When you can't it's often pay. Once people's hierarchy of needs are met they're pretty stable, but these days you never know who had a mortgage they can barely afford, or who is throwing half their pay check out the door to cover a parent in a care home. \n\nTelling staff \"AI is coming\" is only every perceived as a threat. I've spent the last 20+ years doing large scale efficiency programmes. It's fear of what they think will be done \"to them\" that becomes the driver at that point. \n\nI have no visibility on what OP's firm is like, but if he regularly can't keep people then purpose and fulfilment are high on the list as reasons that people go if not working conditions or pay. \n\nOne other thing is a misalignment of expectations. I was at a place maybe 15 years back now, and at 5pm there was a swinging door exodus that annoyed several of the managers. The inbound conversation twent \"Why don't they work later, stay and learn. I'm here til 7pm every day, they could at least stay til 6pm\". \n\nOmitted was the recognition that half of them were juniors payed between 16k and 18k, and incentives were low, and that it wouldn't have made a difference whether they'd stayed til 6pm, their prospects and pay wouldn't have improved.",
                  "score": 1,
                  "created_utc": "2025-12-31 17:33:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwkex1r",
          "author": "Neurojazz",
          "text": "Equity is the way. The performance difference is massive.",
          "score": 7,
          "created_utc": "2025-12-29 16:22:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwknacz",
              "author": "nucleustt",
              "text": "So it seems.Also, equity to the right people!",
              "score": 2,
              "created_utc": "2025-12-29 17:01:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwlk6q4",
                  "author": "Neurojazz",
                  "text": "Yeah, I’ve problems with lots of people on cap tables. It’s common sense to spread vesting over a long period of time, to stop talent bailing ship.",
                  "score": 2,
                  "created_utc": "2025-12-29 19:35:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nx5hc3b",
              "author": "Known-Importance-568",
              "text": "Equity only means something if it vests and gets paid out. I have worked in various startups and it's usually a 4 year vesting period on the options so quite a large commitment. \n\nThen you need the company to sell or for someone to buy your shares so it's not easy to get the cash.\n\nUnless i'm getting a huge amount of options it's usually not worth the hassle. I could take a 9-5 somewhere else with much better benefits and probably have to work half the hours.\n\nIf i'm being paid 30% more than I normally would or getting a six figure option then sure. Otherwise leaving at the 2 year mark makes a lot of sense as an employee. \n\nIf a start-up is cash poor then yes you will have issue. You will need a funding cycle to hire experienced employees otherwise you will get what you pay for.",
              "score": 1,
              "created_utc": "2026-01-01 22:19:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwmvc68",
          "author": "tinySparkOf_Chaos",
          "text": "Personally, it's normally a compensation issue. \n\nI almost never see \"cost of living\" raises to keep up with inflation at start ups. Similarly, raises to reflect increased experience. \n\nInitially you are a new to the job market, no experience. You take a salary that reflects this. Fast-forward 2 years. You've gotten 2 annual raises, both less than inflation. \n\nSo now your salary adjusted for inflation is LOWER than when you started. On top of that, you can now get a higher wage as someone with 2 years experience than you could with 0 years. Changing companies is a huge salary jump. \n\nI don't understand why this is so hard for HR to grasp. Proactively bring your employees salaries to be competitive with their increased experience and inflation or you will end up eating the price of employee churn.",
          "score": 5,
          "created_utc": "2025-12-29 23:31:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwuoho7",
              "author": "dalper01",
              "text": "Often. The challenges of a startup are countless. But, I found people stay based on how they are treated, whether they grow, if they are mentored, and appreciated.\n\nIn Engineering, value grows fast and there are always those out to hire your people. Especially if you teach them bleeding edge skills. But work is like life. Enjoying work is priceless. I've been able to keep people for sub market by empowering them.\n\nEquity is only hypothetical until the company has inherent value. And thats not easy. Giving equity doesnt mean much in value or risk. They can always be diluted and until the company had inherent value, equity is long odds.",
              "score": 1,
              "created_utc": "2025-12-31 03:15:14",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwmz3cj",
              "author": "nucleustt",
              "text": "Nice to hear an employee's perspective. But remember, I mentioned that a bootstrapped startup can't afford it? \n\nWhat employees need to understand is that bootstrapped startups **often** struggle to become profitable, let alone pay competitive salaries.\n\nThe best bet may be to avoid those hires altogether. Now we are discovering the reason no one wants to hire inexperienced employees.",
              "score": -5,
              "created_utc": "2025-12-29 23:51:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwn3zog",
                  "author": "tinySparkOf_Chaos",
                  "text": "An experienced company employee (not a new hire that's experienced elsewhere) can often do the same work as a new hire in half the time.  Which net makes them cheaper. But it takes time to train people to that level, you can't just hire someone with experience in how your specific company works.\n\nIt's a case of you get what you pay for. If you are paying your now experienced employees inexperienced employees wages because that's what they started as don't be surprised when they leave. \n\nWhat I've seen is that the employee churn comes with huge hidden costs, that far exceed giving proper raises. So much lost institutional knowledge and relearning.\n\nIn regards to affording it, one less employee, and everyone else given raises to not churn is going to cost less and get more work done. Just my 2 cents. (Or plan the roadmap better)",
                  "score": 2,
                  "created_utc": "2025-12-30 00:18:27",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwuozhl",
                  "author": "dalper01",
                  "text": "Employees dont need to understand a thing,\n\nTake it from someone who has had many ventures. It matters immensely when they feel valued and have dignity. I can only talk about Engineering firms, but my employees gain value in the work market with learned skills but stay.\n\nEven unhappy employees hate the search. Once people make enough to get by, the rest is more about self-esteem.",
                  "score": 1,
                  "created_utc": "2025-12-31 03:18:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwnsjve",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 3,
          "created_utc": "2025-12-30 02:33:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwpag62",
              "author": "nucleustt",
              "text": "This is some solid advice right here. I'm all for systems and SOPs.",
              "score": 1,
              "created_utc": "2025-12-30 09:05:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwmpu78",
          "author": "Hot-Spicy-Potato",
          "text": "2 years? They must be damn good. Most starups I worked with had an average 6 to 9 months retention.",
          "score": 2,
          "created_utc": "2025-12-29 23:01:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwmq77h",
              "author": "nucleustt",
              "text": "haha! Now I'm feeling good about my 2yr retention",
              "score": 2,
              "created_utc": "2025-12-29 23:03:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwv0vor",
          "author": "yoki_au",
          "text": "When I joined a startup at pre-launch the VC partner funding it gave a speech to the 4-5 person management team (at that time the only employees) and one of the things he said is that most of you won’t be here in two years.\n\nI didn’t get it at the time (and it was not particularly inspiring) but after two years I got it. When you start up you need a marketing person who can do everything, a tech person who can do everything and a few other people depending on your industry who can also do everything. But you don’t need people who can only do the one thing in those areas (eg you probably don’t need a data scientist in the first few years of a retail startup - you need a CTO who can implement something off the shelf, as well as trubleshoot a server beyond just restarting it, as well as fix a janky CSS issue.\n\nTwo years in you’ve figured out what will drive the business forward and you don’t need as many generalists - so the generalists go or need to go unless they adapt with how the business is changing. ",
          "score": 2,
          "created_utc": "2025-12-31 04:34:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nww49ui",
              "author": "nucleustt",
              "text": "This is the truth.",
              "score": 1,
              "created_utc": "2025-12-31 10:08:30",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nx3njov",
              "author": "jaydizzleforshizzle",
              "text": "I’ll be honest, I hate this. This may be my own personal bias, but I’d rather have generalists half the time, like obviously SME are great when you know the exact outcome, but systems as a whole have expanded to encompass every aspect of business and these siloed SMEs can’t handle anything outside their domain.",
              "score": 1,
              "created_utc": "2026-01-01 16:44:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwxbxmp",
          "author": "the-other-marvin",
          "text": "I believe you have a problem, but I’m not sure you know what it is yet… maybe keep digging on this. One thing that has been valuable at my company is exit interviews, conducted by a neutral 3rd party (not the manager, not the CEO, etc).",
          "score": 1,
          "created_utc": "2025-12-31 15:18:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwxh9hp",
              "author": "nucleustt",
              "text": "Oooo. Third-party exit interviews are a great idea.\n\nAlso, regarding the problem, I'd bet the most prominent is management.\n\nBut it's not what you think - I think the manager is too friendly with the staff. \n\nIn one case, she invited a staff member to her home for a few days, and the staff member slept with her nephew and then left the job to pursue the relationship. \n\nI remember Robert Herjavec saying, \"You can be their boss or their friend, but not both.\"",
              "score": 1,
              "created_utc": "2025-12-31 15:45:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pwbkw5",
      "title": "I spent weeks building something nobody asked for. Curious how others caught this earlier",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pwbkw5/i_spent_weeks_building_something_nobody_asked_for/",
      "author": "kook5454",
      "created_utc": "2025-12-26 18:43:08",
      "score": 7,
      "num_comments": 38,
      "upvote_ratio": 1.0,
      "text": "A while back I built a small product I was convinced people would love. I didn’t validate much, just trusted my instincts and kept polishing.\n\nWhen I finally showed it to potential users, the feedback wasn’t harsh it was indifferent. They didn’t hate it. They just didn’t care.\n\nThat experience made me realize how easy it is to confuse activity with progress. I’m curious how others here realized early that they were solving the wrong problem, and what signals you wish you’d paid attention to sooner.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pwbkw5/i_spent_weeks_building_something_nobody_asked_for/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nw2cr9g",
          "author": "fatmax5",
          "text": "For me the red flag was when I kept explaining the product instead of people “getting it” instantly. If it takes effort to convince someone why it matters, something’s usually off.",
          "score": 6,
          "created_utc": "2025-12-26 18:51:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw2dx5r",
              "author": "Walsh_Tracy",
              "text": "That’s such a good point. If you need a long pitch, the problem probably isn’t clear enough",
              "score": 1,
              "created_utc": "2025-12-26 18:57:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nw2cv56",
          "author": "DeathByWater",
          "text": "I did similar a while back. Launched a product for helping manage and review coding challenges. I know _I_ would have paid for it at some point, and treated that as enough.\n\n\nThis is with me telling clients for 5 years or so before that they should validate their market and GTM channels before building. Did I listen to my own advice? I did not.",
          "score": 3,
          "created_utc": "2025-12-26 18:52:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwrqetu",
              "author": "pshah74",
              "text": "How do you validate the market? How do you  know your GTM channel?",
              "score": 1,
              "created_utc": "2025-12-30 18:08:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwrsgvm",
                  "author": "DeathByWater",
                  "text": "Well, you know the bit that you do after you build the product where you try to get in touch with an audience that would buy so they can give you some cash and you can give them goods or services? Do that bit first. Best case scenario you say \"sorry, this isn't actually ready yet, but can I take some contact details for when it is?\". For me that meant:\n\n\n* Trying to find converting adwords keywords (but they were all either too highly priced or not nearly enough volume on the long tail)\n* Monitor social media sites and communities relevant to your product, and set up alerts so you can engage with people having the problem you're trying to solve at the time of greatest pain (not enough pain around my specific solution)\n* Trying value based content marketing (fell flat for same reasons as above)\n* Find qualified emails for cold outreach (actually, reasonable response rate because I wasn't spammy and targeted well - but the responses tended to be \"oh kinda cool, don't need it\")\n\n\nIf I'd have done that before, I could have pivoted or tried a different idea entirely before I'd put so much effort into building something that I couldn't find a viable GTM for.",
                  "score": 2,
                  "created_utc": "2025-12-30 18:17:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw2dqha",
          "author": "Landyn_4682",
          "text": "I realized I was off track when I got polite feedback instead of strong reactions. No excitement, no pushback, just “yeah, cool.” That was the loudest signal for me.",
          "score": 3,
          "created_utc": "2025-12-26 18:56:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw2e4mg",
              "author": "vector877",
              "text": "Indifference is brutal but honest. Way better than false enthusiasm",
              "score": 1,
              "created_utc": "2025-12-26 18:58:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw2edn5",
              "author": "kook5454",
              "text": "That’s so true. I’d rather hear “this is useless” than silence",
              "score": 1,
              "created_utc": "2025-12-26 18:59:59",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nw7xai8",
              "author": "Air_Feeling",
              "text": "The Mom Test comes to mind!",
              "score": 1,
              "created_utc": "2025-12-27 17:22:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwrqkcq",
              "author": "pshah74",
              "text": "What if you approached a wrong demographic or just one data point?",
              "score": 1,
              "created_utc": "2025-12-30 18:09:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nw2mivf",
          "author": "Zealousideal-Ad-8396",
          "text": "I think that this a big problem. Something like 80% of products fail because they don’t have customers. ",
          "score": 2,
          "created_utc": "2025-12-26 19:43:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw2c4tp",
          "author": "Oliver19234",
          "text": "I had a similar moment after building something in a vacuum. What helped me reframe things was reading Starting a Startup by James Sinclair. It wasn’t preachy or salesy, just a grounded take on how often founders confuse momentum with validation. That idea stuck with me more than I expected",
          "score": 1,
          "created_utc": "2025-12-26 18:48:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw2cwri",
              "author": "owenreed_",
              "text": "That’s interesting. Was it more about customer interviews or testing assumptions before building?",
              "score": 1,
              "created_utc": "2025-12-26 18:52:22",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw2ddry",
              "author": "kook5454",
              "text": "That confusion between momentum and validation really hits. I think I’ve been mistaking progress for motion more than I’d like to admit.",
              "score": 1,
              "created_utc": "2025-12-26 18:54:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw356c0",
          "author": "Old-Albatross-6351",
          "text": "Did you have a user survey, a mock up or an MVP before building the whole thing? That’s usually how ppl catch it.",
          "score": 1,
          "created_utc": "2025-12-26 21:25:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw3d2c0",
          "author": "Coz131",
          "text": "What is your product? Did you ask potential users first?",
          "score": 1,
          "created_utc": "2025-12-26 22:08:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw3kfuo",
          "author": "Busy-Escape-9977",
          "text": "A pattern I see in a lot of these stories (and in my own past ones) is that the failure is putting construction before clarity.\n\n\n\nPolishing, shipping, even launching can feel like progress … but none of it answers the only question that matters in validation: Do people actually care enough about this problem to justify building anything, even an MVP?\n\n\n\nIndifference is brutal, but it’s also the cleanest signal you can get. \n\nIt sounds like you’re learning. Keep going 👊🏽",
          "score": 1,
          "created_utc": "2025-12-26 22:50:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw3po3e",
          "author": "luke-build-at50",
          "text": "Indifference is the scariest feedback because it doesn’t give you anything to fight against.\n\nAnger means pain. Confusion means curiosity. Indifference means you’re not in their mental budget at all.\n\nThe signal I wish I’d noticed sooner was behavior, not words. People saying “cool” but not asking follow-up questions. No one trying to use it in their own workflow. No hacks, no workarounds, no urgency.\n\nActivity feels productive because it’s controllable. Progress usually shows up as discomfort. The moment users stop being polite and start being demanding, you’re finally close.",
          "score": 1,
          "created_utc": "2025-12-26 23:21:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw417rb",
          "author": "Snoo-74562",
          "text": "Try and sell it on pre order. If nobody is interested even after you're selling a finished best it can be product you know not to bother.",
          "score": 1,
          "created_utc": "2025-12-27 00:30:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw4f4va",
          "author": "rainmkr65",
          "text": "I'm reading all of these comments and digesting the experiences as I venture into my third start up. I'm currently 1 for 2 on the success scale. My experience is many fold however I would still go with instinct over \"validation\" (I know!?). In my case, each venture was not building a better mouse trap, it was building an idea into an industry that didn't exist. For anyone doing something that hasn't been done, make sure you explore the value of the idea because it may not be what you think it is.\nImagine what you could do, if you did what you imagined.\nOnward.",
          "score": 1,
          "created_utc": "2025-12-27 01:57:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw53q4e",
          "author": "storysherpa",
          "text": "I think people often want “answers” when they are doing research and validation. Which makes sense, but can take you off track. Validating often isn’t about definitive answers. It can give you info to help decide if you really have an accurate intuition about what people would buy, or you just have a cool idea not enough people see as valuable. First you have to decide what you’re validating. \n\nIf it is a genuine innovation (which, let’s be honest, is not what most people are really doing), you have to validate that people care about the core problem/issue/process/concern that your idea addresses. When Lyft started people didn’t know there was an alternative to taxis, because ride share was a brand new thing. So they had to validate that people would use something other than a taxi plus that people would actually become drivers and give the rides. So they had to validate the overall concept. Once they did that they could work on refining, improvement and scale. Not before.\n\nIf it’s a new/improved/updated/cheaper/faster version of something that exists already then you are validating the specific niche customer and what specific features are meaningful enough to them to switch and pay you, not the overall concept. You don’t have to validate ride share now, we know people want it. But if you want to test pet ride share you’re validating if enough pet owners are willing to pay to have you cart their pets to the vet, etc. You’re testing a refinement of an existing concept in the market (the niche).\n\nBy nature you approach each a little differently. Same basic steps and processes/tools, just emphasizing different things that match your ultimate customers situation and preferences. In the first example they don’t know ride share is an option at all. So if you ask “what do you want” they’re likely to say “better taxi”, cause that’s what they know. In the second example they know what ride share is and you ask if they would like it for their dog. That works because they already know what ride share is. So the validation can focus more on features and benefits since they already have a frame of reference for it.\n\nSadly, I believe folks get bogged down thinking they need to do the first kind of validation (which takes longer and usually moves slower) when they could actually modify it to go faster. But people don’t like the effort and want info right now. Even going faster you need to plan and execute the validation well. Otherwise you get bad data (false positives). \n\nAnd of course people just want to build it cause that’s more fun for many and feels like progress (as many have already stated).\n\nI keep thinking that a cohort that walks people through the process step by step, specifically for the second scenario could be helpful. That’s often what incubator programs do for startups, help with that process. Not sure if people would sign up for a cohort. Given the “build it now” attitude most seem to have.",
          "score": 1,
          "created_utc": "2025-12-27 04:42:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw5k4yg",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-27 06:54:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw5k4zu",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pwbkw5/i_spent_weeks_building_something_nobody_asked_for/nw5k4yg/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2025-12-27 06:54:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nw5paad",
          "author": "Your-Startup-Advisor",
          "text": "Two words: customer discovery.",
          "score": 1,
          "created_utc": "2025-12-27 07:42:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw5tzil",
          "author": "OneHunt5428",
          "text": "Been there. For me the early signal was people being polite but non committal, no follow up questions, no urgency. Now I try to sell or pre sell way earlier, even if it’s uncomfortable.",
          "score": 1,
          "created_utc": "2025-12-27 08:27:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw5u455",
          "author": "Obvela",
          "text": "That's what I'm scared of... I think I'm at the same stage (for now)... On the other hand, it's Christmas and New Year, so I'll try to get some feedback after companies start working again.",
          "score": 1,
          "created_utc": "2025-12-27 08:29:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw5x22k",
          "author": "Important_Cap6955",
          "text": "did the same thing with a client portal for my photo business. spent months on it. zero clients used it, they all just kept emailing me like before\n\n\n\nthe signal i missed was that nobody complained about the current process. i invented a problem to solve because building felt productive",
          "score": 1,
          "created_utc": "2025-12-27 08:57:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw634jn",
          "author": "BigBaboonas",
          "text": "I don't build products and then try to sell them. I ask people what they want and build that, or usually something better.",
          "score": 1,
          "created_utc": "2025-12-27 09:57:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw7f2wp",
          "author": "Tricky_Trifle_994",
          "text": "100% feel you on this. i used to think that if i was coding, and kept busy throughout the day, then that's a good thing because i'm doing work. but if none of that results in user growth or revenue uplift, then actually there was 0 progress.\n\nwhat's helped is to do some market research. if there's a competitor that already exists, thats a good sign for me because it shows that there's demand for such a product. i used to think this is bad - that i only want to enter a new market where i'm the first, and there is no competitors but i realised that's a different ball game and a much harder approach.\n\nbeing 1st to market means that i will need to educate the market on the value proposition of the product... and i'm testing the market, unsure if this is even something people will use or find valuable.\n\nso seeing competitors exist in the market is sort of a super simple behind the napkin validation that there's demand for something like this.\n\nthen i move on to more deeper conversations with potential users. what are they currently using, and what do they wish was better about it.",
          "score": 1,
          "created_utc": "2025-12-27 15:50:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw7kzns",
          "author": "TangledRabbit",
          "text": "Your biggest indicator is having a simple pitch statement and then having decision makers reply with their own stories about their own pain points. Once you have that, you know you're on to something.",
          "score": 1,
          "created_utc": "2025-12-27 16:20:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw9owpe",
          "author": "ScradleyToronto",
          "text": "I teach entrepreneurship at a university. \nWe’ve been teaching lean startup for 20 years. We put customer discovery first, do serious research before building anything and only after validation of both the problem and the people who have it, do we think about building anything.",
          "score": 1,
          "created_utc": "2025-12-27 22:58:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwbn4un",
          "author": "Objective-Ferret-492",
          "text": "As a business coach since 06, everything here is valid—and none of it is.\n\nGroupon spent millions building a product nobody wanted. Users said \"we'd use it like *this*\" and Groupon was born from failure. Would that pivot have happened without the \"wrong\" first attempt?\n\nCampbell's Soup recently changed their label for the first time in history—after putting brain scan helmets on 256 people. Turns out customers couldn't even articulate why the old label wasn't working. We often don't know what we want until we see it.\n\nThere's research in education: reward only results and people attempt less (too afraid to fail). Reward effort and you get more attempts, more learning, more eventual success.\n\nSo should you validate carefully and try one business? Or try ten with nothing but a spark? I've seen both paths work. I've watched franchisees take a proven system and run it into the ground while someone with no playbook thrives.\n\nValidation isn't science. It's fear management—useful, but not gospel.\n\nThe most successful people fail the most and don't take it personally. Be the hot spark. Keep iterating. At minimum, you'll create a new you.",
          "score": 1,
          "created_utc": "2025-12-28 06:16:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwcjl6u",
          "author": "Both_Handle_8834",
          "text": "Weeks is nothing, some people spend years and millions building something no one cares about. Shipping an MVP in weeks is actually very good timing. The customer isn’t supposed to care first time round, but as long as you watch them for interacting with the product and rapidly iterate, after a couple months you may find yourself with a product that people actually want.",
          "score": 1,
          "created_utc": "2025-12-28 11:22:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrp1nc",
          "author": "pshah74",
          "text": "I am on the same boat. I am a technical founder and have no idea how to onboard users. \n\nWhat I am thinking is start with a waitlist and if I get users onboard, only then, I work on the idea. \n\nI do not know the right approach. I haven’t posted on channels where I know people I know will respond as it attracts bias.",
          "score": 1,
          "created_utc": "2025-12-30 18:02:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1u2hf",
          "author": "TechnicalSoup8578",
          "text": "This is a classic case of optimizing a solution before validating the underlying problem and demand loop. Did you have any measurable pull from users before you started polishing features? You sould share it in VibeCodersNest too",
          "score": 1,
          "created_utc": "2026-01-01 07:56:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwvnj9",
      "title": "Never undersell your services to get customers",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pwvnj9/never_undersell_your_services_to_get_customers/",
      "author": "nucleustt",
      "created_utc": "2025-12-27 11:26:21",
      "score": 7,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "It's probably been said many times, but this \"undersell\" was disguised.\n\nSo I formed a new LLC with my cousin, and we pivoted it several times as our understanding of the market evolved.\n\nEventually, we decided to offer websites because business owners are too busy to build one themselves, even with the ease of doing so.\n\nWe encountered one client who had a website she created herself, but wanted to switch to us because she wanted to sell her products/services online and didn't know how to handle payment integrations, etc.\n\nI told her the cost of doing so would be $1200.\n\nShe responded with:\n\n>**\"But I currently pay $70/year,\"** \n\nThat should have been the first red flag.\n\nThe second red flag was when she freaked out upon hearing that online credit card transactions had processing fees. (Really!? In hindsight, there's no way a business person actually thought that.)\n\nTo me, the value of this early client wasn't the money; I wanted a video testimonial from her to build my newly formed company's reputation.\n\nSo I agreed to do it for $70, and she said she would increase her prices to cover the processing fees.\n\nBig mistake! Obviously. She turned out to be an \"expensive customer\". She kept requesting more and more features, such as a custom online booking system that handles bookings for multiple employees, various custom reports, autoresponders, etc. Then she wanted to sell Spa services, e-commerce products, courses, travel tickets, hotel accommodations, boat cruises, etc., **on the same website** because she didn't want to pay for another website(s). \n\nBtw, she didn't pay to have these add-ons.\n\nWhat a nightmare. Eventually, I cut my losses and told her that I'd refund her if she'd agree to leave me alone.\n\nI wanted to \"do things that don't scale\" and have one-on-ones with my first customers, but I later realized she wasn't my ideal customer.\n\n\n\n",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pwvnj9/never_undersell_your_services_to_get_customers/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nw7dyk5",
          "author": "ToqenApp",
          "text": "This is a good example of a value mismatch rather than a pricing issue. When someone focuses on \"how much it costs\" instead of \"what it does for the business\", they often become the most expensive customer in terms of time and energy. Early customers matter, but learning early who is not your customer saves more resources than any testimonial.",
          "score": 2,
          "created_utc": "2025-12-27 15:44:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw7iprw",
              "author": "nucleustt",
              "text": ">. When someone focuses on \"how much it costs\" instead of \"what it does for the business\", they often become the most expensive customer in terms of time and energy.\n\nAgreed!",
              "score": 2,
              "created_utc": "2025-12-27 16:08:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw7jw7h",
                  "author": "ToqenApp",
                  "text": "Price sensitivity is often just a proxy for misaligned expectations.",
                  "score": 2,
                  "created_utc": "2025-12-27 16:14:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw7g6sb",
          "author": "CheekyScallywag",
          "text": "There’s a hundred lessons in that customer. And they are extremely common.",
          "score": 1,
          "created_utc": "2025-12-27 15:56:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw7iby9",
              "author": "nucleustt",
              "text": "Yikes, I'm considering making a blacklist for them",
              "score": 1,
              "created_utc": "2025-12-27 16:06:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwcq2jr",
          "author": "Hot-Spicy-Potato",
          "text": "\"But I currently pay $70 a year\" \nIt's not even a red flag, it's a declaration of budget. That's how much they have for a website. Politely withdraw from the conversation and move on to a client who actually has money.",
          "score": 1,
          "created_utc": "2025-12-28 12:20:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwcu900",
              "author": "nucleustt",
              "text": "That's the thing. She has a thriving business, so the availability of funds wasn't the issue. And the website is crucial to her business because it's how she gets and books clients. Her budget was $70 because that was her price anchor. Her mindset was also completely off, and she was constantly complaining about little things in her environment. I didn't like it.",
              "score": 1,
              "created_utc": "2025-12-28 12:54:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwcwng2",
                  "author": "Hot-Spicy-Potato",
                  "text": "It doesn't really matter how much money a client have in general, if they have no respect for the service, from the provider's pont of view, they have no money. One needs to be very aware of the reputation of a service on the market when communicating it. Webdesign/building have a traditionally low view due to the flood of diy tool (that is why I moved to UI/UX a decade ago, but now AI and design bootcamps are doing the same reputation damage there as well). There will be tons of clients who think they're paying for two clicks, because your tools do the rest. You can choose whether to battle with their dellusion, or get clients who already figured that it's much harder to do it right than the media claims. From the post it seemed that the current selling point is saving time for the clients, instead of adding expert knowlegde or increasing visibility or sales. That means the current messaging attracts cheapos with no undestanding what value a professional brings to their business. If you don't want to battle their dellusion, you might consider changeing the messaging.",
                  "score": 1,
                  "created_utc": "2025-12-28 13:11:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1q0zw12",
      "title": "2025 is done. I started the year at 40K INR/month and ended it making over 150K INR/month.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1q0zw12/2025_is_done_i_started_the_year_at_40k_inrmonth/",
      "author": "Beginning-Scholar105",
      "created_utc": "2026-01-01 08:58:29",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 0.74,
      "text": "I started the year at 40K INR/month and ended it making over 150K INR/month.Grateful to everyone who believed in me, mentored me, sent opportunities, or just checked in when things were tough — you’re all part of this. 🙏\n\nIn 2026, the goal is simple:\n• Grow beyond these numbers\n• Build better products\n• Help more devs & founders through my content\n\nLet’s make this year even bigger.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1q0zw12/2025_is_done_i_started_the_year_at_40k_inrmonth/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nx272nw",
          "author": "MostMarsupial3850",
          "text": "This is incredible—375% growth in a single year is massive. The fact that you're thanking people who believed in you and sent opportunities shows the right mindset too.\n\n\n\nCurious: what was the biggest bottleneck holding you back at 40K? Was it a product issue, marketing, sales execution, or something else? And how did you break through it?\n\n\n\nThe \"grow beyond these numbers, build better products, help more devs & founders\" goal for 2026 is exactly right—compounding comes from focusing on value, not just revenue.",
          "score": 3,
          "created_utc": "2026-01-01 10:15:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx285rd",
              "author": "Beginning-Scholar105",
              "text": "That’s a great question! The biggest bottleneck was **doing the same thing every day.** 📉\n\nAs a Data Science Team Lead, I was managing a team and doing repetitive tasks. I felt my growth had stopped because I wasn't learning anything new.\n\nTo break through, I took a risk and asked my founder to move me to the **Engineering/Dev team**. He gave me one task to prove myself—I did it perfectly, and that’s how I became a **Full Stack (Backend) Engineer**. 🚀\n\nMoving from managing others to building products myself was the key to my growth and my salary increase.",
              "score": 1,
              "created_utc": "2026-01-01 10:26:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx2xwqn",
          "author": "Mammoth-Power-3028",
          "text": "That’s great growth man! Did it change your perspective towards wealth or your work?",
          "score": 1,
          "created_utc": "2026-01-01 14:14:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx2yxwf",
              "author": "Beginning-Scholar105",
              "text": "Great question! The biggest change was how I value my time. I stopped thinking about 'working long hours' and started focusing on 'solving big problems.'\n\nOnce I made that shift, I realized that making more money is really just a result of providing more value to others. It made me much more confident in my skills rather than just feeling lucky.",
              "score": 2,
              "created_utc": "2026-01-01 14:21:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx2zo7h",
                  "author": "Mammoth-Power-3028",
                  "text": "Makes so much sense. But how did you actually shift from Woking for long hours to delivering quality results. What change would you say you made to make it work?",
                  "score": 1,
                  "created_utc": "2026-01-01 14:26:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1q1dv9r",
      "title": "Getting my baby to sleep turned into a business",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1q1dv9r/getting_my_baby_to_sleep_turned_into_a_business/",
      "author": "AIGoat_05",
      "created_utc": "2026-01-01 20:16:09",
      "score": 7,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I wanted to share the early stage of a project I’m building and document the journey as it evolves.\n\nThis didn’t start as a business idea. It started as frustration.\n\nWhen my son was born, I tried multiple sleep training methods and courses. Some were too rigid, others too generic, and most relied on “trust the process” without giving parents a real way to understand what was working.\n\nSo I decided to approach the problem differently.\n\nTogether with my sister (a midwife) and a small group of pediatricians and sleep consultants she collaborates with, I developed **PAT Sleep System** — a structured sleep training framework based on experimentation and measurement rather than a single fixed method.\n\nThe core principles:\n\t•\tno one-size-fits-all formula\n\t•\tparents test different approaches\n\t•\tresults are tracked with clear metrics\n\t•\tdecisions are driven by data\n\nThe program runs over 14 days and focuses on teaching babies how to fall asleep independently.\n\nEarly results\n\nWe launched recently, and the first outcomes are honestly very encouraging.\nBabies around 7–8 months are reaching 10–12 hours of uninterrupted night sleep.\n\nAt this stage, I’m less focused on scaling and more on refinement.\n\nWhat I’m working on now\n\t•\timproving the educational materials\n\t•\tsimplifying the framework without losing rigor\n\t•\tcollecting structured feedback from parents\n\t•\tvalidating messaging and positioning\n\nThis is the project if you’re curious it is called The Cozy Knights.\n\nI’m posting here to keep myself accountable and to learn from others who’ve built education or parenting-related businesses.\n\nIf you’ve launched:\n\t•\tdigital courses\n\t•\tevidence-based products\n\t•\tor anything in the parenting space\n\nI’d love to hear what worked (and what didn’t) in your early stages.\n\nI’ll update as things evolve.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1q1dv9r/getting_my_baby_to_sleep_turned_into_a_business/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nx6ukij",
          "author": "-M83",
          "text": "do u have a link for said business cheers",
          "score": 1,
          "created_utc": "2026-01-02 03:04:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwdq7m",
      "title": "First Sale",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pwdq7m/first_sale/",
      "author": "Available-Concern-77",
      "created_utc": "2025-12-26 20:11:41",
      "score": 6,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Been building a software product for the last 12+ months (I will not promote). Massive pivot in the middle. Finally got the Stripe notification this morning. 6:45am after my dog woke me up. Sale is from someone I met on Reddit, so not a long-time friend or family, which makes it sweeter. Makes all the sacrifice and time spent worth it. \n\n  \nHow did you get your first sale? How did you get your second sale? \n\nLove this community to spread good news. ",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pwdq7m/first_sale/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nw3f50j",
          "author": "Twilight-Mystic432",
          "text": "congrats on landing that first sale. it's a big milestone but don't stop there. immediately follow up with the customer for feedback and to ask about upsells or referrals. that turns one sale into ongoing revenue. next set up a simple system to track leads and automate follow-ups, like email sequences, so you can focus on closing more deals. scale by testing what worked in this sale and replicating it with similar prospects. keep metrics on everything, conversion rates and customer lifetime value, to know what's scaling worth it.",
          "score": 2,
          "created_utc": "2025-12-26 22:19:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw4fnth",
              "author": "Available-Concern-77",
              "text": "The world appreciates you putting the full names of things to track instead of acronyms!\n\nI have an email tool but it's mostly me sending product announcements to people who have signed up (free trial stuff). Definitely room to expand that!",
              "score": 1,
              "created_utc": "2025-12-27 02:00:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw5xxgu",
                  "author": "Twilight-Mystic432",
                  "text": "there are plenty of great options out there for lead pipelines:\n- hubspot.com is helpful but sometimes it feels like it is not meant for small businesses \n- aileads.now is a fair option for small businesses\n- i think hootsuite is good too but i never used it\nI'll let you know if i hear about any other tool you could start using.",
                  "score": 2,
                  "created_utc": "2025-12-27 09:06:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw3lnaq",
          "author": "HatOnRabbit",
          "text": "Congrats on the first one. That moment hits different when it's a real stranger who paid you.\n\nGot my first sale through cold outreach on LinkedIn. Second came from a referral from that first customer about a month later. The gap between 1 and 2 was rough but that referral made me realize I was onto something.",
          "score": 2,
          "created_utc": "2025-12-26 22:57:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw4fdiu",
              "author": "Available-Concern-77",
              "text": "I've tried cold outreach on LinkedIn so many times and I just have never been able to get it right. Referrals make a lot of sense. Thanks for sharing",
              "score": 1,
              "created_utc": "2025-12-27 01:58:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw4qd70",
          "author": "Asterix_Optimum",
          "text": "Congratulations man 💫💫💫",
          "score": 2,
          "created_utc": "2025-12-27 03:09:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw7g55z",
          "author": "Tricky_Trifle_994",
          "text": "congrats on your first sale! 1 year of grinding it out is remarkable.\n\ni built my product in public, sharing my progress along the way, because i knew that if i didn't share anything about what i was building until launch day, i'd end up with 0 sale. nobody would know about what i had built, and nobody would even care about it.\n\nmy 1st and 2nd sale ended up coming from my network who had seen me build the product from the beginning. they didn't convert immediately at launch though. it took a 1-2 weeks before they decided to become a paying customer.\n\nhow about you? what's the plan to continue getting more customers?",
          "score": 2,
          "created_utc": "2025-12-27 15:55:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw8fgtn",
              "author": "Available-Concern-77",
              "text": "I'm fairly public with what I'm building. My biggest issue has been audience. Building in public for people who won't be customers doesn't work. But I feel like I have the right audience now. \n\nI have 60 people on my email list who are at various stages of evaluation. So the next wave of customers will almost certainly be from them + referrals. After that I'm not sure. It's a high enough price point that it could justify a decent amount of ad spend to convert. I just need to get the conversion mechanics before wasting tons of money there.",
              "score": 1,
              "created_utc": "2025-12-27 18:53:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwci3vb",
                  "author": "Tricky_Trifle_994",
                  "text": "having a higher cost that can accommodate  ads as a user acquisition is such a blessing. but yeah, as you mentioned, you don't want to be burning money with ads before you even know what's converting and how to do it consistently.",
                  "score": 2,
                  "created_utc": "2025-12-28 11:08:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwcm8of",
          "author": "newsunshine909",
          "text": "That’s such a good feeling, congrats. My first sale came out of nowhere too and I remember staring at the screen for a while just to make sure it was real. The second sale came once I stopped tweaking things and focused on having more conversations. Talking to people on GrowthMentor helped me realize the first sale is emotion, the second is just execution.",
          "score": 2,
          "created_utc": "2025-12-28 11:46:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pz3gal",
      "title": "What I Learned From Managing Email Marketing for 40+ Brands in 2025",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pz3gal/what_i_learned_from_managing_email_marketing_for/",
      "author": "MidnightM247",
      "created_utc": "2025-12-30 00:40:41",
      "score": 6,
      "num_comments": 1,
      "upvote_ratio": 0.8,
      "text": "I've been running email and SMS campaigns for ecommerce brands for about a decade now, and 2025 was one of the most interesting years yet.\n\nI worked with about 40 brands this year doing anywhere from $50k to $3M+ annually. Some crushed it. Some struggled. A few went out of business.\n\nHere's what I learned from being inside the backend of all these stores. And what I'm changing in 2026 because of it.\n\nThe Brands That Won Owned Their Audience\n\nThe stores that scaled in 2025 weren't the ones with the best ads. They were the ones that built communities and owned their traffic.\n\nI had a pet brand do $2.5 million in a year after they stopped running ads entirely. How? We built a subreddit, grew it to 20k members, and turned that community into an email list that did 60% of their revenue.\n\nAnother client was a personal trainer who went from $10k to $40k per month by building a Reddit community in his niche. He now books 5 to 10 discovery calls per week just from the engagement in his subreddit.\n\nThe pattern is clear. Brands that rely on rented attention (Meta ads, TikTok, Google) are getting squeezed. CPMs are up. Conversions are down. The ones winning are building owned channels like email lists, SMS lists, Discord servers, Facebook groups, and Reddit communities.\n\nIf your entire business depends on paid ads, 2026 is going to hurt. Start building something you own.\n\n2. Personalization Actually Matters Now\n\nEveryone talks about personalization, but most brands are still sending the same email to everyone.\n\nThis year I started segmenting lists harder than ever. We split buyers by purchase frequency, location, product category, and engagement level.\n\nHere's one example. For a free shipping campaign, instead of sending one email to everyone, we sent three versions:\n\nOne to first time buyers: \"Thanks for your last order. Here's free shipping to try something new.\"\n\nOne to VIPs (2+ purchases): \"Exclusive sale just for you\" with a slightly better offer.\n\nOne to non buyers: \"Now's the best time to try us. No shipping fees.\"\n\nThe result? Open rates went up. Revenue went up. Unsubscribes went down.\n\nEven small things like using the customer's city in the subject line made a difference. \"We're doing free shipping for customers in {{Customers\\_City}}\" consistently doubled open rates compared to generic subject lines.\n\nMost brands have the data to do this. They just don't use it. In 2026, I'm pushing every client to segment harder and personalize more.\n\n3. AI Made Things Faster But Not Better\n\nEvery brand I worked with this year asked me about AI tools for email marketing.\n\nI tested a bunch of them. AI can write decent subject lines, generate email copy, and automate some workflows. It saves time. But it also makes everything sound the same.\n\nThe brands that performed best weren't the ones using AI for everything. They were the ones using AI to speed up grunt work but keeping the human touch in their messaging.\n\nAI can draft an email. But it can't write a founder's personal story. It can't capture the tone of a brand that actually connects with people. And it definitely can't build community.\n\nIn 2026, I'm using AI more for research, data analysis, and automations. But I'm keeping humans in charge of the actual writing and strategy.\n\n4. BFCM Proved That Preparation Beats Discounts\n\nBlack Friday this year separated the prepared from the desperate.\n\nThe brands that planned ahead, segmented their lists, and built anticipation for weeks crushed it. The brands that just sent \"30% off\" emails got mediocre results.\n\nOne thing that worked really well this year was adding a persistent offer banner to every email during BFCM. Even automated flows like welcome sequences and post purchase emails had the sale at the top.\n\nAnother tactic that always works: resending high performing campaigns with new subject lines. Same email. Same list. Different hook. It added 25 to 50% more revenue every time.\n\nThe brands that treated BFCM like a one day event lost. The brands that treated it like a two week campaign with multiple touchpoints won.\n\nIn 2026, I'm starting BFCM planning in September. Not November.\n\n5. Most Brands Are Ignoring Their Best Customers\n\nThis one surprised me. A lot of brands are so focused on new customer acquisition that they forget about the people who already bought from them.\n\nYour best customers are the ones who already trust you. They convert faster. They spend more. They refer people. And most brands barely talk to them.\n\nThis year I started building VIP segments for every client. People who've purchased 2+ times get different treatment. Early access to sales. Exclusive offers. Personal thank you emails.\n\nOne brand sent a plain text thank you email after BFCM with no pitch, no sale, just gratitude. It was the highest revenue email they sent all year. People responded saying they appreciated being treated like a person, not a wallet.\n\nIn 2026, I'm pushing every brand to build better retention systems for existing customers. New customers are expensive. Repeat customers are profit.\n\n6. Community Beats Content Every Time\n\nI spent years telling brands to create more content. Post more on Instagram. Make more TikToks. Send more emails.\n\nBut 2024 taught me something different. Community beats content.\n\nA brand with 500 engaged community members in a Discord or Reddit group will outperform a brand with 50k Instagram followers who don't care.\n\nThe reason? Community creates loyalty. It turns customers into advocates. It gives you direct feedback. It makes people feel like they're part of something.\n\nOne of my clients built a Facebook group for their niche. It's now 10k members. Those members generate user content, answer each other's questions, and defend the brand when someone complains. That's worth more than any ad campaign.\n\nIn 2026, I'm helping every client build or grow a community. Reddit, Discord, Facebook groups, whatever fits. But community first, content second.\n\n7. The Backend Is Where the Real Money Is\n\nMost brands obsess over their homepage, their product pages, and their ads. And yeah, those matter.\n\nBut the brands that made the most money this year were the ones that optimized their backend. Email flows, post purchase sequences, win back campaigns, and retention systems.\n\nI've seen brands flip from 20% email revenue to 60% email revenue just by building proper welcome flows, abandoned cart sequences, and post purchase nurtures.\n\nOne client was doing $100k per month with 80% of sales coming from ads. After we rebuilt their email system, they're now doing $150k per month with 60% coming from email and retention. Their ad spend went down. Their profit went up.\n\nThe lesson? Your backend is your profit center. Optimize it first.\n\nIn 2026, I'm spending less time on growth hacks and more time on backend systems that compound.\n\nWhat I'm Changing in 2026\n\nBased on everything I learned this year, here's what I'm doing differently:\n\nBuilding communities first, ads second. Every client is getting a Reddit or Discord strategy.\n\nSegmenting harder. No more one size fits all emails.\n\nUsing AI for speed, not strategy. Humans write. AI assists.\n\nPlanning BFCM in September. Not scrambling in October.\n\nTreating VIP customers like VIPs. Retention over acquisition.\n\nOptimizing backends first. Growth comes after systems are solid.\n\nIf you're running an ecommerce brand or thinking about starting one, don't chase the shiny stuff in 2026. Build systems that compound. Own your audience. Treat your customers like people.\n\nThat's what worked in 2025. And that's what's going to work even better in 2026.",
      "is_original_content": false,
      "link_flair_text": "Resources & Tools",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pz3gal/what_i_learned_from_managing_email_marketing_for/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwneegr",
          "author": "Wide_Brief3025",
          "text": "You nailed how building and owning a community is the real growth lever now, especially on platforms like Reddit. If you want to keep tabs on key conversations in your space and spot potential leads as they happen, ParseStream can help automate that outreach so you stay ahead without missing genuine engagement opportunities.",
          "score": -1,
          "created_utc": "2025-12-30 01:15:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q0lrbs",
      "title": "The compliance gap: Why are we not teaching entrepreneurs what happens AFTER formation?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1q0lrbs/the_compliance_gap_why_are_we_not_teaching/",
      "author": "Classic-Reserve-3595",
      "created_utc": "2025-12-31 19:49:02",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 0.88,
      "text": "I've been thinking about this a lot lately after watching three colleagues nearly lose their businesses to administrative issues that had nothing to do with their actual business performance.\n\nWe've made business formation incredibly accessible - and that's great. You can file an LLC online in under an hour for less than $200 in most states. Every guru on YouTube and TikTok is selling courses on \"how to start your business TODAY\" and it's never been easier to become official.\n\nBut formation is maybe 5% of the actual administrative work.\n\nWhat comes after is this ongoing maze of compliance requirements that most first-time business owners have zero awareness of. Annual reports. Biennial statements. Franchise taxes. BOI filings. Business licenses at city, county, and state levels. Registered agent requirements. Good standing certificates.\n\nAnd here's the kicker - the penalties for missing these aren't proportional to the complexity. A $50 annual report you didn't know existed can result in dissolution of your business. Your LLC status can go from \"active\" to \"delinquent\" while you're busy actually running the company and generating revenue.\n\nI've seen people lose contracts because they couldn't produce a certificate of good standing on demand. I know someone who had their business involuntarily dissolved because compliance notices went to an old address.\n\nThe infrastructure exists to help with this - registered agents handle the ongoing compliance tracking - but most new business owners don't even know this is something they should be budgeting for until they've already missed something critical.\n\nWhy isn't this part of the conversation? Why do we celebrate making formation easy but completely ignore the fact that we're setting people up to fail on the backend?\n\nThoughts?",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1q0lrbs/the_compliance_gap_why_are_we_not_teaching/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwywupp",
          "author": "Vedant7781",
          "text": "100% agreed brother!",
          "score": 1,
          "created_utc": "2025-12-31 20:05:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwz97pa",
          "author": "TrollPro9000",
          "text": "Compliance is bundled alongside LLC formation but separate from it (i.e. it's made optional). What you described will continue to occur absent a legal requirement to utilize a registered agent **provided by the vendor when forming in 5 minutes for $200 online**. It's a distribution problem, similar to states that require you to opt in to become an organ donor versus those that require you to opt out, with vastly different participation rates.",
          "score": 1,
          "created_utc": "2025-12-31 21:12:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx0mqwu",
          "author": "_Joff",
          "text": "This is giving me the same vibes as how we teach sex ed - here's how babies are made, good luck! No mention of what happens after.\n\n\n\nI watched my sister go through this when she started her photography business. She did everything \"right\" - filed her LLC, got excited, started booking clients. Then got blindsided by a franchise tax bill she didn't know existed, missed a filing deadline because she didn't know there WAS a filing deadline, and spent months stressed about whether her business was even legitimate anymore.\n\n\n\nThere's a whole industry built around \"oops you messed up, pay us to fix it.\" Not saying all registered agents or compliance services are predatory, but there's definitely less money in educated business owners than panicked ones.",
          "score": 1,
          "created_utc": "2026-01-01 02:09:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx0msq6",
          "author": "BigBoiSupreme111",
          "text": "This hits hard. I had no idea about half this stuff until I got a nasty letter about missing some filing I'd never even heard of.\n\nThe YouTube crowd definitely glosses over this part because it's not sexy content. Nobody's clicking on \"Here's How to File Your Biennial Statement\" videos.\n\nI think part of it is that the registered agent companies aren't exactly shouting from the rooftops either. Most people just pick the cheapest option during formation without understanding what ongoing compliance actually means.\n\nWould've saved myself a lot of headaches if someone had just laid out a simple yearly checklist when I started.",
          "score": 1,
          "created_utc": "2026-01-01 02:10:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1kckc",
          "author": "Mesmoiron",
          "text": "Of course it isn't part of the conversation because habits were made about the shiny good parts. Low hanging fruits and easiness is being promoted. Not the boring, necessary part. Even more so, it is scarred or ridiculously expensive when bought as a service. Even if you're aware of it; the costs make it difficult to maintain a healthy ecosystem. That said, regulations come after big money has set fire to the ecosystem first. Many rules aren't even necessary with real business ethics. Thus bureaucracy will eventually kill many sectors because, with easy low hanging efforts promoted; many won't start at all. Both the startup scene and the job market are completely derailed.",
          "score": 1,
          "created_utc": "2026-01-01 06:21:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1z2t3",
          "author": "k_rocker",
          "text": "America?\n\nYou guys seem to love licences and permits for everything eh?\n\nDidn’t happen in the UK, super simple. Set up, do business. Once a year ownership updates and once a year filing small financial returns.",
          "score": 1,
          "created_utc": "2026-01-01 08:49:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx3tae9",
          "author": "smarkman19",
          "text": "The main point is we treat formation like the finish line when it’s actually the starting paperwork. Formation YouTube makes you feel “done,” but the real game is: map every recurring filing on day one and make it boringly automatic.\nWhat’s helped me: build a simple “entity profile” doc the week you form. One page with: exact legal name, state ID number, registered agent, tax year, deadlines for annual report/franchise tax/BOI, plus links to the state SOS search and local licensing portals. Then:\n1) Put every deadline in a shared calendar with 60/30/7-day reminders.\n2) Use a service that actually explains your obligations in plain English (Northwest for RA, Stripe Atlas for Delaware + early-stage, and doola for non-US founders who need EIN/banking/compliance guardrails instead of just one-off filings).\n3) Once a quarter, spend 30 minutes doing a “good standing” check: state site, RA messages, IRS letters.\nThe main point is compliance should be treated like payroll: invisible, scheduled, and never a surprise.",
          "score": 1,
          "created_utc": "2026-01-01 17:14:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx3xbxl",
          "author": "SeaBurnsBiz",
          "text": "Worst case for nearly all that non compliance is you pay a late fee and maybe a penalty to the gov't. \nAnd if you call in and are a small biz and it'syour first time...they will probably waive the fee and help you get it straightened out. \n\nThis isn't anything to worry about. \n\nSource: me who didn't know, forgot to file, or otherwise has failed \"admin\" tasks. Every state, city, business type is different so good luck trying to be compliant on your first shot!\n\nNote: plenty of scam mail telling you they will fix or file things for $100s of dollars. Ignore. Go to official websites, do it yourself. This is usually how I figured out I didn't file something.",
          "score": 1,
          "created_utc": "2026-01-01 17:35:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pz5ybz",
      "title": "I'm making small, offline webapps instead of SaaS",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pz5ybz/im_making_small_offline_webapps_instead_of_saas/",
      "author": "verytiredspiderman",
      "created_utc": "2025-12-30 02:31:17",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 0.86,
      "text": "I’m doing a short ride-along experiment and wanted to document it here.\n\nInstead of spending months on a single SaaS idea, I’m testing a different approach: shipping very small, focused digital tools on Gumroad as fast as possible.\n\nMy constraints:\n\n* Static, single-file HTML tools\n* No accounts, no backend, no subscriptions\n* Built for myself first, then shared\n* Ship in hours, not weeks\n\nWhy I’m doing this:  \nI’ve built “serious” projects before and burned out before they ever saw users. This time I want fast feedback, low pressure, and proof of demand before I invest more time.\n\nCurrent status (Day 1):\n\n* Product: a minimalist productivity tool (offline, no sync)\n* Price: free for now (testing interest > revenue)\n* Time to build: under a day\n* Time spent marketing so far: a few Reddit posts + X\n\nWhat I’m watching:\n\n* Page views vs. downloads\n* Comments / feedback quality\n* Whether people actually *use* it, not just upvote it",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pz5ybz/im_making_small_offline_webapps_instead_of_saas/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwnyox0",
          "author": "ArtemLocal",
          "text": "This is actually a smart reset, not a downgrade you’re removing ego, sunk-cost bias, and burnout from the equation. A few high-leverage thoughts that might help you get real signal faster with this approach: First, free is fine only if you’re testing the right thing. Page views vs downloads tells you interest, but it doesn’t tell you value. One simple tweak that keeps things lightweight: ask for a tiny commitment before download. Even something like “enter an email to get updates / next version” or a “pay what you want (including $0)” option. People who bother are already a different class of signal. Second, static/offline tools are perfect for sharp, single-pain use cases. The ones that tend to spread are not “productivity tools” but “I built this because I was annoyed by X.” When you post, lead with the irritation, not the tool. People don’t share tools, they share relief. Third, usage more important then downloads is the real boss metric, but it’s invisible unless you design for it. Since you’re offline/no backend, consider baking in something like: a visible “session count” the user sees themselves or a very obvious “did this help?” prompt with a one-click feedback link. It sounds small, but it turns passive users into active signal. Fourth, Gumroad is not just a checkout, it’s a filter. Even when you switch to paid, pricing at $3–$7 will tell you more than free ever will. If someone won’t pay the price of a coffee to remove a real annoyance, the problem probably isn’t strong enough. Two questions that’ll help sharpen the next iteration: What specific moment or frustration made you build this tool for yourself? If this tool disappeared tomorrow, what would you personally be most annoyed to lose? Those answers usually point directly to the version people will actually use and pay for.",
          "score": 4,
          "created_utc": "2025-12-30 03:07:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwns79q",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-30 02:31:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwns7bp",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pz5ybz/im_making_small_offline_webapps_instead_of_saas/nwns79q/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2025-12-30 02:31:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwp0ffl",
          "author": "Senior_Duck_5929",
          "text": "Sticking to tiny offline webapps is smart because it forces you to ship before your brain drifts into “platform” mode.\n\n\n\nOne thing that helped me with similar micro-tools: define a “minimum usage win” for each product before launch (e.g., “someone opens this 3+ times in a week” or “keeps it pinned on their dock”). Then design the feature set only around hitting that. Anything that doesn’t move that usage metric goes into a “next iteration” pile.\n\n\n\nAlso, don’t be afraid to bundle once you’ve got 3–5 tools. A single “offline toolkit” landing page often converts better than scattered Gumroad links, especially if the tools solve one theme like focus, planning, or tracking.\n\n\n\nFor marketing, I’d lean into posts showing your build process and actual screenshots, then search for people complaining about bloated productivity apps and reply with your lightweight alternative. I use things like X keyword alerts and, more recently, Pulse alongside manual Reddit searches to catch those pain-point threads.\n\n\n\nKeeping the products tiny and usage-obsessed is the whole game here.",
          "score": 1,
          "created_utc": "2025-12-30 07:32:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwp31kp",
          "author": "Mesmoiron",
          "text": "What's the point for the reader. I read it; but is there a link that goes somewhere or a hint to find it. If I find something interesting I bookmark it. That's the first value. Will I use it that depends on how the overall goal can be reached. Tools don't live in a vacuum; they are tight to complex processes. Inputs and outputs, phases. Testing is not the same as integration into a workflow. I think too many products miss this important point.  Sometimes the bottle neck is not in the tool; but in the process or system itself. The invisible hand produces friction and noise such that interesting tools never go beyond interest, testing and bookmarking.",
          "score": 1,
          "created_utc": "2025-12-30 07:56:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q0jukv",
      "title": "Advice?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1q0jukv/advice/",
      "author": "Specialist_Web7056",
      "created_utc": "2025-12-31 18:25:56",
      "score": 5,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "21 part time job in school but want to open a business just not sure what? I mean I like the idea of being my own boss and I know that profit/revenue can be unpredictable but I’d really like to start doing my own thing just lost on where to begin. Do all of you guys have your own unique idea that made you money or were you riding trends and getting better at it than most around you? Idk just would like some insight from somebody with experience who’s failed before.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1q0jukv/advice/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwzjt9x",
          "author": "Express_Answer_9800",
          "text": "Your location determine everything If you are in a developed country, story is different for you.",
          "score": 3,
          "created_utc": "2025-12-31 22:11:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwyjobw",
          "author": "dRubixCage",
          "text": "Study about marketing  strategies and channels!  If possible pick some skills like running google or bing ads . You'll never fail irrespective of niche, failing  scenario iff you can't deliver it",
          "score": 2,
          "created_utc": "2025-12-31 18:56:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwynfb0",
          "author": "MathewGeorghiou",
          "text": "First, consider how much time and money you have to invest in the business.  This may help narrow down your options.  Then work through a few ideas using something like the Business Model Canvas, which is a quick way to determine if an idea is worth pursuing or not.  I have some guides I can share with you if you DM me.",
          "score": 2,
          "created_utc": "2025-12-31 19:15:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx4l16y",
              "author": "Lowe-me-you",
              "text": "It’s a good idea to start with a clear understanding of your resources. A business model canvas canhelp clarify your thoughts before diving in. if you can, try to also talk to someone who’s been in the game for a while; real-world insights can be invaluable",
              "score": 2,
              "created_utc": "2026-01-01 19:32:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwys0vp",
          "author": "BikeCurrent9438",
          "text": "I’m an expert in failure! Look no further. Three main things to understand: 1) “Being your own boss” is not a good thing at all — for me, I personally have no choice but to be my own boss because I am so incompetent that I cannot rely on being employed elsewhere. 2) ideas do NOT matter, execution does. 3) Digital spaces are saturated, awful places to start if you have no experience — get into a physical, labor based business like a trade if you want quick, reliable cash while learning a skill. \n\nWith that said, the most important thing is to not overthink, but also to not spend money ever if you can. Don’t “overinvest” in yourself, you should have the mentality that most expenses are based on scams unless they are returnable tools or things that produce immediate, safe turnaround. Don’t buy courses — if you do this, you probably have way too much to learn about real life first before starting a business and should hyperfocus on getting some street smarts. Last, never work with partners unless you take the time to understand how a corporate structure works — ie. how taxes, private loans, payouts, and salaries are different than ownership % and dividends. If you don’t understand this concept, you have NO business trying to run a business with someone else who owns even 1%",
          "score": 2,
          "created_utc": "2025-12-31 19:39:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwyst7e",
              "author": "k_rocker",
              "text": "“Being your own boss” still makes me laugh. \n\nYou go from having one boss in employment to having 20+ self employed/business - ALL of your customers, employees etc…!",
              "score": 3,
              "created_utc": "2025-12-31 19:43:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwyx02v",
          "author": "Vedant7781",
          "text": "Study marketing brother, you have the age and time!",
          "score": 2,
          "created_utc": "2025-12-31 20:06:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx0gmzp",
          "author": "New-Employment-6975",
          "text": "Start SOMETHING right now. Any type of business, anything with clients and revenue and deliverable.  Reply below if you agree or disagree as I believe that is where you will learn.  Even just an online freelancer is the first step",
          "score": 2,
          "created_utc": "2026-01-01 01:29:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx13dqi",
          "author": "Alternative-Lime7814",
          "text": "It often comes from applying aptitude and experience to a niche in the market. Find out what you're good at and take it from there",
          "score": 1,
          "created_utc": "2026-01-01 04:02:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1fjid",
          "author": "OneHunt5428",
          "text": "Start small and focus on learning, not the perfect idea. Most people don’t win with a unique idea at first they copy something proven, then do it better. Try a simple service business, learn sales and consistency, fail fast, adjust, repeat. That experience matters more than the idea itself.",
          "score": 1,
          "created_utc": "2026-01-01 05:38:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwb6x2",
      "title": "Building a team of 20 to start something from the ground up.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pwb6x2/building_a_team_of_20_to_start_something_from_the/",
      "author": "Wahbata",
      "created_utc": "2025-12-26 18:27:07",
      "score": 5,
      "num_comments": 20,
      "upvote_ratio": 0.78,
      "text": "Following my last post, I had the opportunity to speak with many talented individuals. And chose 8 people for our 20-person group. \n\nThe plan is simple: make a 20-person group, brainstorm ideas, and choose 3 or 4 ideas. Make a small group of 3 to 5 people and have them work on an idea to their liking.\n\nWhichever idea worked best, we will double down on that one and work together, as you know, with more people we have more talent. Everyone is good at something, and we can use that. \n\nSo if you also wanna join us, just ask me, tell me what you are good at, and why you wanna join the group. Your name, country, and age. Well, it's not a requirement, any age and country is good. I just wanna know who I am talking with. \n\nBecause once a group is created, we all have to meet and chat every day, giving reports, and there we have to be productive and work together. \n\n\nAs for me my name is Ankit, I am from India \n\nI have created an MVP before, and I am good at web development, coding (Python) and have 5 years of experience in trading. \n\n\nDon't worry, any skill and any experience are welcome. We just want to create a 20-person circle with talented individuals who can work together to make something from scratch. \n\n",
      "is_original_content": false,
      "link_flair_text": "Idea Validation",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pwb6x2/building_a_team_of_20_to_start_something_from_the/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nw2fhkf",
          "author": "dRubixCage",
          "text": "Let's connect",
          "score": 1,
          "created_utc": "2025-12-26 19:05:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw2gim9",
              "author": "Wahbata",
              "text": "Sure.",
              "score": 1,
              "created_utc": "2025-12-26 19:11:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw6l84t",
          "author": "Weary_Opportunity_81",
          "text": "Let’s connect",
          "score": 1,
          "created_utc": "2025-12-27 12:44:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw6lcvx",
              "author": "Wahbata",
              "text": "Hit me up",
              "score": 1,
              "created_utc": "2025-12-27 12:45:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw6q83g",
          "author": "faultyvoicebox",
          "text": "I'm in!",
          "score": 1,
          "created_utc": "2025-12-27 13:21:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw6qavl",
              "author": "Wahbata",
              "text": "Hit me up",
              "score": 1,
              "created_utc": "2025-12-27 13:22:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw7dmls",
          "author": "keepitsinple",
          "text": "I'm in !! I've failed at a brand , so I can give you what not to do in retail",
          "score": 1,
          "created_utc": "2025-12-27 15:43:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwef98z",
              "author": "Wahbata",
              "text": "Sure, come. join the team",
              "score": 2,
              "created_utc": "2025-12-28 18:10:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwbkhpu",
          "author": "PopularSubs",
          "text": "Sent",
          "score": 1,
          "created_utc": "2025-12-28 05:54:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwd3n5x",
          "author": "Competitive_Radio787",
          "text": "this is a really great idea!\n\nif i wasn't working on something already, i'd totally be down",
          "score": 1,
          "created_utc": "2025-12-28 13:58:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgfl7k",
          "author": "risingup555",
          "text": "msg me - i got some ppl",
          "score": 1,
          "created_utc": "2025-12-29 00:08:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwi1hmx",
          "author": "rt2828",
          "text": "Why do you need so many people?",
          "score": 1,
          "created_utc": "2025-12-29 05:58:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwiwiq8",
              "author": "Wahbata",
              "text": "It's simple to make a team to test many different ideas fast. It's much faster. when there are experienced personnel on the team.",
              "score": 1,
              "created_utc": "2025-12-29 10:38:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwjt2do",
          "author": "anti_performative",
          "text": "Hi. I'm in. Got everything you need except the trading part. DM to connect",
          "score": 1,
          "created_utc": "2025-12-29 14:32:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmj5l7",
          "author": "Straight-Switch-4610",
          "text": "Interested, drop me a DM! Based in UK",
          "score": 1,
          "created_utc": "2025-12-29 22:26:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwoj96j",
          "author": "Different_Guy1",
          "text": "Let's chat",
          "score": 1,
          "created_utc": "2025-12-30 05:13:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpgaor",
          "author": "Mountain_Can8065",
          "text": "Im in",
          "score": 1,
          "created_utc": "2025-12-30 10:00:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1u3u3",
          "author": "TechnicalSoup8578",
          "text": "What you’re describing is essentially a lightweight internal accelerator with short feedback loops and fast kill signals. How will you handle ownership and alignment once one idea gets doubled down on? You sould share it in VibeCodersNest too",
          "score": 1,
          "created_utc": "2026-01-01 07:56:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx1ua89",
              "author": "Wahbata",
              "text": "I mentioned all these details in my next post. Already checked that.",
              "score": 1,
              "created_utc": "2026-01-01 07:58:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1py2n8x",
      "title": "What’s the most annoying “small task” you deal with daily?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1py2n8x/whats_the_most_annoying_small_task_you_deal_with/",
      "author": "coff_au",
      "created_utc": "2025-12-28 21:12:24",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Not talking about big strategic stuff — more like inbox, reminders, follow-ups, internal notes, etc.  \nWhat’s one small recurring thing that quietly wastes your time every day?",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1py2n8x/whats_the_most_annoying_small_task_you_deal_with/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwk0u1r",
          "author": "Sudden-Context-4719",
          "text": "For me it’s always chasing down replies and following up on leads that go cold.",
          "score": 2,
          "created_utc": "2025-12-29 15:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgs9v9",
          "author": "Nate-p-1",
          "text": "I'd love to know as well. I'd like to offer my services",
          "score": 1,
          "created_utc": "2025-12-29 01:17:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqd5de",
          "author": "No-Swimmer-2777",
          "text": "Expense report approvals. Everything's automated except this one thing that somehow still needs human sign-off. Total time sink for literally no value.",
          "score": 1,
          "created_utc": "2025-12-30 14:07:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pymmp9",
      "title": "How to find the right business 2 do?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pymmp9/how_to_find_the_right_business_2_do/",
      "author": "Dry_Application_4169",
      "created_utc": "2025-12-29 13:43:35",
      "score": 5,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "I’m 18, living in Germany, still in school for 2 more years. I work a retail job next to school and make around 600–700€ a month.\n\nSince I was like 13–14 I’ve been obsessed with the idea of building something on my own. Not just money, but having a project, something I can work on every day and slowly grow over time.\n\nThe problem is: I have no idea what that should be.\n\nI tried some stuff. Clothing reselling, different jobs since I was 15. I even had phases where I made decent money. But when I look back now, I feel stupid seeing that only around 300€ are left. I did pay my driver’s license, vacations, daily stuff etc., so it’s not like I wasted everything — still feels bad for the amount of work.\n\nEverything I look at now feels oversaturated. Social media, ecom, agencies, all that. Nothing really clicks. I don’t even know my real strengths. I’m pretty insecure about that tbh.\n\nI try to improve myself, read, work, think long term. My biggest problem is probably phone addiction and distraction. I’m working on it, but yeah.\n\nI also compare myself a lot to people online who seem to “have it figured out”, which doesn’t help.\n\nI don’t want to jump from hype to hype or waste the next years trying random things with no direction.\n\nSo my question is:\n\nHow did you find the right business or direction for yourself? Especially when you’re young, unsure about your strengths and everything feels saturated.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pymmp9/how_to_find_the_right_business_2_do/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwmx9vd",
          "author": "Fit_Yogurtcloset_495",
          "text": "It feels like you’re the future Philippe plein",
          "score": 2,
          "created_utc": "2025-12-29 23:41:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjm476",
          "author": "k_rocker",
          "text": "Sometimes entrepreneurship finds you. \n\nYou are very early in this journey, and you probably don’t know about half of the options available to you. \n\nI’d suggest it might be a good idea to try to get a job in a marketing agency, or accountants. You’ll get lots of exposure to thinking, solving problems but importantly, entrepreneurs. \n\nThis sort of experience will show you ideas coming from lots of different industries and businesses in lots of different areas. You’ll learn valuable skills and you’ll see a lot of the business world. \n\nSomething might strike you as your next step, an interesting business. And you’ve already had experience of seeing it from the inside, you might even have the opportunity to jump to client side and work with ones you like.",
          "score": 1,
          "created_utc": "2025-12-29 13:52:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjrngm",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-29 14:24:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjrnis",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pymmp9/how_to_find_the_right_business_2_do/nwjrngm/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2025-12-29 14:24:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwjrs3k",
          "author": "Enwy94",
          "text": "Haha , i personally had this problem before haha. I tried many things, and finally able to find something sustainable for me.\n\nI dont wanna sound salesy here. But i used a tool to find some points and ideas, and then start developing from there.\n\nAnyway, i build a networking business, then another 2 micro software business that gives me around 12-15k USD monthly.",
          "score": 1,
          "created_utc": "2025-12-29 14:25:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjss62",
              "author": "Dry_Application_4169",
              "text": "Which tool if you dont mind me asking",
              "score": 1,
              "created_utc": "2025-12-29 14:30:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwjsu6x",
                  "author": "Enwy94",
                  "text": "I’ll dm you.",
                  "score": 0,
                  "created_utc": "2025-12-29 14:31:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwqg9tv",
          "author": "Alive_Fudge_3515",
          "text": "Can you please share with me as well. Thank You",
          "score": 1,
          "created_utc": "2025-12-30 14:25:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwthan8",
          "author": "erickrealz",
          "text": "Everything looks saturated from the outside. Agencies, ecom, social media, all of it seems crowded until you actually get into a specific niche and realize there's plenty of room for someone who executes well. The \"saturated\" feeling is usually fear disguised as market analysis.\n\nAt 18 with two years of school left, the best investment is building skills that make future businesses easier. Learn to sell, learn to write, learn basic design or coding. These compound regardless of what direction you eventually pick. With our clients the founders who succeed fastest usually spent years getting good at something specific before they started a business around it.\n\nThe comparing yourself to people online thing is poison. Most of those \"I made six figures at 19\" stories are either fake, exaggerated, or leave out the part where they had wealthy parents funding their experiments. Stop consuming that content entirely for a few months and see how your thinking changes.\n\nThe €300 remaining after paying for a license, vacations, and life isn't failure. You're 18 and net positive after years of trying things. Most people your age have tried nothing.\n\nThe \"right business\" usually reveals itself through experience and skills, not through sitting and thinking about what market to enter.",
          "score": 1,
          "created_utc": "2025-12-30 23:10:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pufosy",
      "title": "What’s the biggest lesson entrepreneurship taught you this year?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pufosy/whats_the_biggest_lesson_entrepreneurship_taught/",
      "author": "SignPsychological728",
      "created_utc": "2025-12-24 05:38:25",
      "score": 5,
      "num_comments": 10,
      "upvote_ratio": 0.79,
      "text": "As this year comes to an end, I’ve been reflecting on what I’ve learned from trying to build things, make decisions, and figure things out as an entrepreneur.\n\nNot talking about generic advice more about real lessons that only show up when you’re actually in it.\n\nCurious to hear from others here:\n\n* What’s one lesson entrepreneurship taught you this year?\n* Something you wish you had known earlier?\n* Or a belief you had at the start of the year that completely changed?\n\nWhether you’re early-stage or have been doing this for years, would love to learn from your experience.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pufosy/whats_the_biggest_lesson_entrepreneurship_taught/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nvo9vxh",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-24 05:42:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvqng31",
              "author": "Standard_Duck6082",
              "text": "It definitely does, and there is always something new to learn along the way. Always ask for outside advice, step back a moment and try to view it from an outsiders eyes. Progress does not happen overnight, but gradually. My main one is there is nothing wrong in asking for help if you feel overwhelmed, if it's book keeping, shipping, anything.",
              "score": 1,
              "created_utc": "2025-12-24 16:40:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvonq1d",
          "author": "KevinKings",
          "text": "Work with people you can trust. \n\nNever stop focusing on GTM",
          "score": 1,
          "created_utc": "2025-12-24 07:45:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvtunbn",
          "author": "ElectronicReview9525",
          "text": "Biggest lesson for me this year: effort doesn’t equal progress.\n\nI used to feel productive just by working long hours, planning, tweaking, learning. But most of that didn’t move the business at all. The only things that actually mattered were uncomfortable actions like shipping before I felt ready, asking for feedback, following up, and talking to real customers.\n\nAlso learned that clarity comes after action, not before. I spent too much time waiting to feel confident. Confidence only showed up once I did the thing a few times and survived messing it up.\n\nWish I knew earlier that consistency beats intensity every time. Doing small boring things daily worked way better than occasional bursts of motivation.",
          "score": 1,
          "created_utc": "2025-12-25 05:10:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvueb22",
          "author": "Rise_and_Grind_Pro",
          "text": "The better your processes the more effective your business. Do not sleep on tools and assume that they will magically work for you. When I adopted my CRM vcita for example, that changed my life, and had I just kept sticking with HubSpot, even for how unintuitive it is, I would never have been able to grow my businesses this year.",
          "score": 1,
          "created_utc": "2025-12-25 08:20:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvxagg3",
          "author": "Ok_Employ_5453",
          "text": "Nice to see you’re reflecting—one key lesson I’ve seen is that user friction often starts before signup, right in the landing‑page copy. Short, clear headlines and stronger value props can cut that confusion. I’m building a lightweight tool called Crovise that does just that. How have you tightened your copy for onboarding?",
          "score": 1,
          "created_utc": "2025-12-25 21:09:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvz8ono",
          "author": "Familiar_Tip_7336",
          "text": "My experience is: Destiny. If it’s written it will happen if not it simply won’t. I’ve failed in so many",
          "score": 1,
          "created_utc": "2025-12-26 04:58:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw0lxjg",
          "author": "sushiwit420",
          "text": "Don’t trust people so easily. Even close friends, when doing business. Always have contracts in place.",
          "score": 1,
          "created_utc": "2025-12-26 12:48:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw17igk",
          "author": "LopezProductions",
          "text": "To pick 3 ideas max and give it everything you got.  As a person who likes to start multiple projects at once my only regret this year is spending too much time task switching. I get bored or something would get hard so i would move on to the next thing.  To make a real product you need give it consistent effort. The days you don't touch it are days missed to move the needle forward.",
          "score": 1,
          "created_utc": "2025-12-26 15:12:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw5uenh",
          "author": "Obvela",
          "text": "This year, I learned an important lesson: progress comes from user feedback, not from thinking hard about constant updates. Some users don't even need all the upgrades that are being shoved onto them.",
          "score": 1,
          "created_utc": "2025-12-27 08:32:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwp4w4",
      "title": "Anyone else tired of playing detective every time a chargeback hits?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pwp4w4/anyone_else_tired_of_playing_detective_every_time/",
      "author": "DevilKnight03",
      "created_utc": "2025-12-27 04:52:15",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 0.78,
      "text": "I run a small but steadily growing online store, and lately chargebacks have become the most draining part of the business. Not even because of the money, but because of everything that comes after. Every time a dispute comes in, I end up switching out of actual work and into detective mode, pulling order details, delivery confirmations, IP data, support conversations, and emails just to piece together a timeline that might or might not matter.\n\nWhat makes it worse is that even when a customer clearly received the product or actively used it, the outcome still feels like a coin flip. It often feels like the bank has already decided before anyone actually looks at the context. Losing a dispute after spending hours gathering evidence is incredibly demoralizing.\n\nI’m starting to wonder if this is just the reality of ecommerce once you hit a certain scale, or if there are smarter ways people are handling this now. Do you still fight disputes manually, or did you change your process at some point? Did you accept chargebacks as a cost of doing business, or find a way to reduce how much time and energy they take?\n\nWould really appreciate hearing how others deal with this, because right now it feels like a lot of effort for something that’s mostly out of my control.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pwp4w4/anyone_else_tired_of_playing_detective_every_time/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nw5mghz",
          "author": "thedamnedd",
          "text": "Yeah this is very real. I remember feeling like one random issue could wipe out a good week. What helped me was slowly removing the stuff that caused constant stress. Chargebacks were a big one. I stopped trying to fight every dispute and used nofraud so approved orders were covered, it made the whole thing feel way less fragile.",
          "score": 1,
          "created_utc": "2025-12-27 07:15:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw7hork",
              "author": "Few_Response_7028",
              "text": "Ad for nofraud?",
              "score": 2,
              "created_utc": "2025-12-27 16:03:39",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwe9tvw",
              "author": "jessicalacy10",
              "text": "The one issue can ruin the week feeling is way too real. Chargebacks especially have a way of hanging over your head and killing focus. cutting down those stressors makes everything feel a lot more sustainable.",
              "score": 1,
              "created_utc": "2025-12-28 17:44:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pzgogp",
      "title": "should we even apply to YC or is it too early?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pzgogp/should_we_even_apply_to_yc_or_is_it_too_early/",
      "author": "Sea-Plum-134",
      "created_utc": "2025-12-30 12:17:44",
      "score": 5,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "honest question. we are a small team of students, doing ug at tetr college rn, and building in the ai agent space. we’ve built a Chrome extension that replaces enrichment workflows (so you don’t need tools like Clay, etc.).\nnothing fancy: we have a few paying users and doing ~$500 in monthly revenue (launched in beta) and still figuring things out. we keep hearing “apply to YC anyway, worst case you get rejected.” but also wondering if this is too early and we’ll just burn our shot.\nfor folks who’ve applied / know the process, is there any downside to applying early as students? or should we wait till traction is bigger?\nPls be brutal and honest. Thanks.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pzgogp/should_we_even_apply_to_yc_or_is_it_too_early/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwqhqi5",
          "author": "Marcelo_NMLS1851997",
          "text": "Why raise capital when you can double down on client revenue? \n\nDoes focusing on investor relations take the foot off the gas of client acquisition?   \nWhy YC? With Gust you can apply to multiple groups all at once instead of one at a time. So if it is a time sink issue that could be a different route.\n\nI say don't apply unless you \"need\" to otherwise you are just giving yourself a boss.",
          "score": 2,
          "created_utc": "2025-12-30 14:33:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwq51qo",
          "author": "Ok-Construction-3544",
          "text": "lol u can’t burn a YC shot - just apply , nothing to lose",
          "score": 1,
          "created_utc": "2025-12-30 13:19:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqxzsu",
          "author": "KeithLeague",
          "text": "You can apply to YC in just a little more time than it took you to write this post. They encourage repeat applications.",
          "score": 1,
          "created_utc": "2025-12-30 15:56:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwr1ov1",
          "author": "DesertedSnark",
          "text": "Brutally honest take: you’re probably early, but not too early to apply.\n\nYC sees a lot of teams at this stage, especially students. What usually gets people rejected this early isn’t age or timing, it’s lack of clarity. If the story is “we built something cool in AI agents,” that’s weak. If the story is “we’re replacing a painful, expensive workflow people currently solve with tools like Clay or custom enrichment, and here’s why users are switching,” that’s much stronger. $500 MRR and a few paying users is actually a positive signal for a student team. It shows you can ship and convince someone to pay. But YC will care way more about:\n\n* who the user is, very specifically\n* what job they were doing before your product\n* why your approach is meaningfully better, not just cheaper\n\nApplying now doesn’t really hurt you. A rejection isn’t permanent, and many teams get in on a later batch once the narrative tightens or traction jumps. The downside of applying too early is mostly opportunity cost and maybe burning one “data point,” but YC doesn’t blacklist people for early attempts. If you do apply now, treat it like a forcing function. Be extremely clear on why enrichment as it exists today is broken, what you’re replacing, and why your agent approach wins long term. If that feels fuzzy, waiting a few months to sharpen traction and positioning might help more than grinding MRR alone. Either way, don’t over-optimize fear of rejection. Almost everyone who gets in was rejected somewhere first.",
          "score": 1,
          "created_utc": "2025-12-30 16:13:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwr6iax",
          "author": "Longjumping_Ant_6991",
          "text": "Most founders that get accepted have applied 3+ times (source: YC partners telling us this after our interview)",
          "score": 1,
          "created_utc": "2025-12-30 16:35:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nws2mlo",
          "author": "Your-Startup-Advisor",
          "text": "It's never too early to apply to YC!",
          "score": 1,
          "created_utc": "2025-12-30 19:04:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtfjjw",
          "author": "erickrealz",
          "text": "Apply now. YC explicitly loves students because you have low burn, high energy, and years of runway ahead of you. $500 MRR with paying customers in beta is more traction than plenty of accepted companies had at application.\n\nThe \"burning your shot\" fear is overblown. Tons of successful YC companies applied multiple times before getting in. Rejection isn't a black mark, it's just a \"not yet.\" The partners have short memories and care way more about your current traction than whether you applied too early two batches ago.\n\nThe Chrome extension replacing Clay workflows is a legitimately interesting wedge. With our clients doing enrichment work, the pain of juggling multiple tools is real. If you can show that users are actually replacing paid Clay subscriptions with your extension, that's a compelling story.\n\nWhat matters for your application is demonstrating growth rate and founder-market fit. Week over week revenue growth, even at small numbers, matters more than the absolute number. Why are you three specifically the team to build this?\n\nThe downside of waiting is that the AI agent space is crowded and moving fast. Six months from now your window might look different.",
          "score": 1,
          "created_utc": "2025-12-30 23:01:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtmgm3",
          "author": "Particular_Film_8308",
          "text": "I don’t think this is really about YC timing. It sounds more like committing too early to a narrative you are still figuring out. applying isn’t just sending a form. It’s freezing a snapshot of your thinking, your positioning, your conviction and letting other people react to it. Being judged on something that’s still forming hits different even if everyone says just apply.",
          "score": 1,
          "created_utc": "2025-12-30 23:38:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx4660n",
          "author": "pshah74",
          "text": "I guess it trims the question to whether you and your team are really really committed to solving this problem? If so, how big do you think the problem is that YC will its ROI?\n\nNote: I haven’t applied to YC before and don’t know how they think",
          "score": 1,
          "created_utc": "2026-01-01 18:19:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q0g403",
      "title": "Tech background, want to go solo",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1q0g403/tech_background_want_to_go_solo/",
      "author": "Party-Log-1084",
      "created_utc": "2025-12-31 15:49:44",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Have a great New Year’s Eve and a fantastic year ahead!\n\nI’ve been working as an employed IT specialist for years (system integration). I’m technically solid: servers, hosting, networking. As a hobby i started web development (Frontend + Backend), built a lot of pages and apps (more fun than business). \n\nBuilding and running things isn’t the issue for me. I want to get out of employment and move toward self-employment. Not because I’m chasing some magic business model or overnight success. I know that doesn’t exist.\n\nBoth of my parents were entrepreneurs as well (different industry, not for me), so I grew up around that mindset. I’m not afraid of hard work, long hours, or slow progress. I just want to build something of my own that actually makes sense.\n\nWhat I’m really after is learning how to identify real niches and real customer problems, and then build products or services that solve those problems and people are willing to pay for. Not once, but repeatedly.\n\nMy current thinking: Focus first on marketing and understanding demand\n\n→ learn how people think, decide, and buy\n→ then build the right product on top of that\n\nNot the other way around.\n\nI’m starting to seriously study marketing and neuromarketing because I want to understand the mechanics, not just copy tactics. I genuinely enjoy these topics and want to develop the skillset to independently find problems, validate them, and build solutions.\n\nSo my questions:\nDoes this order of learning and execution make sense?\nWhat parts of marketing matter most early on for solo founders?\nWhere do technical people like me usually mess this up?\n\nI’m not looking for shortcuts or hype. I’m looking for honest experiences and lessons learned.\n\nAppreciate any input. 🙏",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1q0g403/tech_background_want_to_go_solo/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwxq18b",
          "author": "Tall-Locksmith7263",
          "text": "I dont have the time to write much so my one advice would be: \"dont overthink, just start, try things and iterate\"",
          "score": 1,
          "created_utc": "2025-12-31 16:28:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q08lwp",
      "title": "Would you rather own a tiny business or a big brand’s franchise?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1q08lwp/would_you_rather_own_a_tiny_business_or_a_big/",
      "author": "YogurtIll4336",
      "created_utc": "2025-12-31 09:04:49",
      "score": 5,
      "num_comments": 7,
      "upvote_ratio": 0.86,
      "text": "thinking out loud.\n\noption A: small, boring business. low capex. full control. slow but steady.\n\n\n\noption B: known franchise. big capex. brand pull. thinner margins.\n\n\n\nOkay so we had a session with a food founder he mentioned that ppl investing in the unit had better ROI then owning a franchise, i think it works in his case, wdyt?\n\nfor people who’ve done either, what would you choose again and why?\n\n",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1q08lwp/would_you_rather_own_a_tiny_business_or_a_big/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwwtn2m",
          "author": "Vaibhav_codes",
          "text": "Tiny business = full control, slower growth, less pressure.  \nFranchise = brand recognition, faster traction, but higher costs and limited freedom.  \nIf ROI mattered most, small independent units can outperform if run smart  depends on your appetite for control vs. risk.",
          "score": 5,
          "created_utc": "2025-12-31 13:34:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvydmu",
          "author": "OneHunt5428",
          "text": "I'd go small biz for full control and freedom, franchises can pull in revenue, but you’re always tied to someone else’s rules.",
          "score": 3,
          "created_utc": "2025-12-31 09:12:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwwm2mg",
          "author": "No-Swimmer-2777",
          "text": "Small business if you can prove the unit economics work first. Franchises are just borrowed credibility—you still have to execute. Validate before scale.",
          "score": 5,
          "created_utc": "2025-12-31 12:43:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx3zxeb",
              "author": "Legitimate-Economy63",
              "text": "Totally agree",
              "score": 1,
              "created_utc": "2026-01-01 17:48:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwxhb0r",
          "author": "DeviantHistorian",
          "text": "Small business I want full control",
          "score": 1,
          "created_utc": "2025-12-31 15:45:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwz5zbi",
          "author": "OKcomputer1996",
          "text": "This completely depends on the industry and the product in question.",
          "score": 1,
          "created_utc": "2025-12-31 20:55:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1m6yg",
          "author": "[deleted]",
          "text": "Personally, I’d lean toward a small, boring business especially early on. Low capex, full control, and fewer fixed obligations give you room to learn and adapt. Growth is slower, but margins are usually healthier and mistakes are survivable. You’re building an asset, not just operating someone else’s system.\n\nFranchises make sense if you value brand pull and predictability over flexibility. But high upfront costs, royalties, and thinner margins mean you’re often buying stability, not upside. For most first-time founders, owning the unit beats owning the logo.",
          "score": 1,
          "created_utc": "2026-01-01 06:38:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwukw8",
      "title": "Freelancing income is chaotic. I built something after tax season burned me.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pwukw8/freelancing_income_is_chaotic_i_built_something/",
      "author": "Ok-Childhood-5005",
      "created_utc": "2025-12-27 10:19:07",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.84,
      "text": "I freelance full time. Income swings month to month. Some months feel rich, others feel broke. The worst part is not knowing what is actually safe to spend or how much is already owed to future taxes.\n\nI tried spreadsheets for years. They track numbers but they do not reduce stress. Everything still feels like guessing.\n\nLast tax season was the breaking point. I realized the real problem was visibility, not discipline. I never had a clear picture of irregular income in one place.\n\nSo I built a small internal tool for myself. It shows freelance income as it comes in, expenses as they happen, and a running tax set aside so surprises do not pile up. No automation magic. Just clarity.\n\nI put up a waitlist to see if this is only my problem or if other freelancers deal with the same chaos. Not selling anything yet. Still validating.\n\nBuilding it has already helped me sleep better. Even if it never ships, it solved a real problem for me.",
      "is_original_content": false,
      "link_flair_text": "Idea Validation",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pwukw8/freelancing_income_is_chaotic_i_built_something/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwz4rm4",
          "author": "stealthagents",
          "text": "That sounds super helpful! Just having a clear view of your income and expenses can really take a load off. I've been in that chaotic freelance cycle too, and anything that helps make those financial swings feel less scary is a win in my book. Keep us posted on how the waitlist goes!",
          "score": 1,
          "created_utc": "2025-12-31 20:48:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxqcxc",
      "title": "What was your first “this hire was a mistake” moment, and what did it teach you?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pxqcxc/what_was_your_first_this_hire_was_a_mistake/",
      "author": "thedamnedd",
      "created_utc": "2025-12-28 12:35:49",
      "score": 4,
      "num_comments": 9,
      "upvote_ratio": 0.84,
      "text": "Hiring advice sounds clean in theory, but real life isn’t. For those who’ve hired early, what’s something you learned the hard way about hiring, fit, or timing? Would love to hear honest stories, not perfect ones.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pxqcxc/what_was_your_first_this_hire_was_a_mistake/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwepzp9",
          "author": "xasdfxx",
          "text": "Don't hire out of big companies when you're small.  The skills and work at a 5k+ person company are simply not the same vs a 2-person company trying to hire their first engineer.  You should demand someone has worked at a less than 20 person company for that hire.\n\nBe ruthless about demanding experience.  Backchannel references are probably higher signal than the interview itself.",
          "score": 3,
          "created_utc": "2025-12-28 18:59:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwoxufz",
              "author": "Inevitable-Earth1288",
              "text": "I totally agree. In a startup, you really need people who are comfortable with the startup pace. I once worked with an engineer who came from a big enterprise company. He was solid technically, but the processes and speed just didn’t match how we worked, so we decided to stop working together.",
              "score": 2,
              "created_utc": "2025-12-30 07:09:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwflo38",
          "author": "BuiltFromQuestions",
          "text": "Ive had hundreds of people come in and out of my company at this point. What I learned came over many different hires & mistakes. Not sure I can narrow to a single one.\n\nSome lessons I've learned over several years (above and beyond standard advice/due diligence/common sense) :\n\n1. Trust your gut. It will still be wrong sometimes, but it will be right more. \n\n2. Actively search for talent. 90% of the hires that stick are the ones I recruit vs ones responding to a job ad.\n\n3. Interviewing is everything. Real success with hiring came after I started doing practical assessments (vs just asking questions and trusting the answer). Make them do in front of you whatever you're hiring them for. \n\n4. Don't sell the position. Remember its the candidates job to sell you on why you should let them work there. Not your job to convince them why they should. \n\n5. Master onboarding processes. I know the post is about bad hires, but worth noting that losing good ones is just as bad. And usually its because of shitty onboarding procedures. \n\nAnd lets face it, sometimes someone can check all the boxes and then just turn out to be a complete asshole. Cost of doing business.",
          "score": 3,
          "created_utc": "2025-12-28 21:33:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwcvmpi",
          "author": "DueEffort1964",
          "text": "My first hire taught me more than any book ever could, mostly by showing me what not to do. Timing, expectations, and communication mattered way more than skills. Talking to founders on growth mentor who’d made hiring mistakes helped me avoid repeating some very expensive lessons.",
          "score": 2,
          "created_utc": "2025-12-28 13:04:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwexj21",
          "author": "MathewGeorghiou",
          "text": "Through mulitiple hires:\n\nPositive attitude is not enough — Skills and getting things done is equally important.\n\nSkills are not enough — Positive attitude is important.",
          "score": 2,
          "created_utc": "2025-12-28 19:35:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwdknmy",
          "author": "rainmkr65",
          "text": "Long ago, started an independent investment brokerage company. Today it's called private equity. Hired a Warton grad, came in very confident left very humble after losing $500k in 20 days. Never again was general education based on where someone graduated a driver for hiring. Also in those 20 days convinced me (although I was ultimately responsible) not to invest in this guy who wanted to make a documentary TV show about police officers. Yep that's the one! \"Who would sit home on a Saturday night watching people get arrested\" I think was his exact words. Lol f@#$!",
          "score": 1,
          "created_utc": "2025-12-28 15:37:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwex96o",
          "author": "Old_Discount_2213",
          "text": "the best hiring advice I ever got was, “don’t hire anyone to do something you don’t already know how to do”. Get an advisory board if you need to learn something; don’t pay a salary or give equity if you don’t know how exactly to get value out of the hire. also consider hiring on probation/vesting.\n\nmy first hire was an AI engineer (of many years) who couldn’t do any better than me. my second hire what a product designer who spent months designing but couldn’t use the product he was designing.",
          "score": 1,
          "created_utc": "2025-12-28 19:33:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfbd9g",
          "author": "GvMello1",
          "text": "Started an electrical company and this may sound crazy but I hired someone with clean hands. No callouses, no sandpaper feel on the hand shake and it showed to be a good observation. The guy learn “everything” from his grandpa and had mostly a sales background and was not efficient and took hours to get a simple task done because he had the gift of gab. Sometimes you can judge a book by its cover.",
          "score": 1,
          "created_utc": "2025-12-28 20:42:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwleiss",
          "author": "PracticalStoicUS",
          "text": "More of a general hiring mistake that took me a decade to learn better. The obvious truth is someone looking for a job is dissatisfied with their current position or unemployed / unemployable. Employers run ads. Everyone is trained to interview. Both parties hedge what they want to reveal.\n\nHere's what I learned from a man who understood and played a different game. No hiring. Only recruiting. He didn't want the person who was looking. He wanted to be the first thought of the best candidates when things went wrong in their current position. The day their supervisor says the wrong thing for the third time. The day someone in authority tries to scapegoat them. There are hundreds of examples but they all amount to the same thing: a day when someone thinks \"I wonder if there's a better employer for me?\"\n\nHe put himself in the path of that inevitable outcome to great success. Quote attributed to the same man: \"The guy with the best dudes wins.\"",
          "score": 1,
          "created_utc": "2025-12-29 19:07:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyvw0v",
      "title": "Reduced bounce rate from 83% to 50% with 2 simple changes",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pyvw0v/reduced_bounce_rate_from_83_to_50_with_2_simple/",
      "author": "Enwy94",
      "created_utc": "2025-12-29 19:38:56",
      "score": 4,
      "num_comments": 2,
      "upvote_ratio": 0.84,
      "text": "Couldn’t share screenshots but wanted to share what worked.\n\nMy app had a crazy 83% bounce rate. Made two changes:\n\n\t\n\n1. Simplified the landing page , removed jargon, theories, fancy terms. Just basic words a 3 year old could understand.\n\n2. Frictionless signup , added Google OAuth. That’s it.\n\nSame traffic, bounce rate dropped to 50%.\n\nNext up: more users and hopefully conversions. Good luck to everyone building!",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pyvw0v/reduced_bounce_rate_from_83_to_50_with_2_simple/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwlw2dj",
          "author": "quietstepsdaily",
          "text": "Great tip. Thanks for sharing.",
          "score": 1,
          "created_utc": "2025-12-29 20:33:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwok3ng",
              "author": "Enwy94",
              "text": "Welcome. Trying to help as much as i can.",
              "score": 1,
              "created_utc": "2025-12-30 05:19:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1py0g4w",
      "title": "Any decent contextual AI support bot for large CS teams?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1py0g4w/any_decent_contextual_ai_support_bot_for_large_cs/",
      "author": "bomerwrong",
      "created_utc": "2025-12-28 19:43:53",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 0.81,
      "text": "We recently hit the scaling wall. Our ticket volume is crushing our small support team, so we want to implement 24/7 self-service. We tried a couple of generic AI tools, but they just generate stuff that sounds plausible but is often factually wrong or completely misses the customer's context (e.g., they ask about a ref⁤und status, and the bot gives them a link to the general ret⁤urn policy).\n\nI'm looking for tools or strategies that specifically use AI-powered assistants that observe context - meaning they connect the current conversation to the customer's history, their specific product settings, and only use our official knowledge base for answers. How do you scale resolution without sacrificing accuracy and burning customer trust?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1py0g4w/any_decent_contextual_ai_support_bot_for_large_cs/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwgj60h",
          "author": "DFSautomations",
          "text": "What you are running into is not a tooling problem, it is a context boundary problem.\n\nMost “AI support bots” fail because they answer in isolation. The moment you let them respond without grounding in customer state, order data, entitlement, and a tightly scoped knowledge base, accuracy collapses.\n\nWhat has worked better is treating AI as a triage and resolution assistant, not a replacement. Let it classify intent, pull the right context, draft the response, and escalate anything it is not confident about. Accuracy beats coverage every time in CS.",
          "score": 1,
          "created_utc": "2025-12-29 00:27:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgvj9l",
          "author": "Vuk_Djuraskovic2107",
          "text": "Been there. The hallucination problem with generic AI bots killed us too.\n\nWe ended up going with a mix... Intercom has decent context awareness if you feed it your knowledge base properly, and Zendesk's AI agent can pull customer history. The key was being really strict about what sources it could reference. We literally turned off the \"creative\" responses and made it say \"I don't know, let me get a human\" if it wasn't 100% confident.\n\nAlso worth checking out Ada or Kustomer if you need something more enterprise-level. They're built specifically for this problem.\n\nFair warning though... you'll spend way more time than you think curating your knowledge base and tweaking the prompts. It's not plug-and-play, but once dialed in it actually works.",
          "score": 1,
          "created_utc": "2025-12-29 01:35:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwja72j",
          "author": "Writer1007",
          "text": "Hi, I am Kaushal Doshi and I am Non-Executive Director at UncoreDigital. I would like you to visit our website and try out online chat feature. This tool has been built by us. If you are satisfied with the output you can reach out to us and we can provide you the same.",
          "score": 1,
          "created_utc": "2025-12-29 12:33:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjtbix",
          "author": "qqqqqaa",
          "text": "Acc⁤uracy is everything with AI support, and most of the issues people see come from giving an assistant too much freedom and not enough context.\n\nWhat wor⁤ked for us was treating the AI more like a sup⁤port assistant than a general chatbot. Tools like Cr⁤isp let you strictly scope what the AI knows your help center, docs, internal PDFs instead of expecting a generic LLM to magically understand your product, pricing, or API quirks. When a user asks something specific, the AI is pulling from approved, up-to-date sources, not guessing. That's the difference between helpful answers and hallucinations.",
          "score": 1,
          "created_utc": "2025-12-29 14:33:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwk23t4",
          "author": "imbest99",
          "text": "The real difference between a basic chatbot and a modern AI setup is autonomy. Once we scaled, our biggest pain point wasn't ticket volume it was nights, weekends, and Monday backlogs.\n\n\nI saw this firsthand with a fintech team that moved to Crisp's AI Agent. They trained it heavily on mobile app FAQs and internal workflows, and it ended up handling essentially all weekend conversations on its own. No extra hires, no burnout just the simple \"how-to\" and troubleshooting stuff handled automatically, so humans could focus on complex cases.",
          "score": 1,
          "created_utc": "2025-12-29 15:20:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtgnsu",
          "author": "erickrealz",
          "text": "The \"plausible but wrong\" problem is the core issue with generic AI tools bolted onto support. They're trained to sound helpful, not to actually be accurate for your specific business. What you need is something that's constrained to only your documentation and connected to your actual customer data.\n\nIntercom's Fin and Zendesk's AI agents both connect to customer history and can pull account-specific context before responding. They're not cheap but they're built for exactly this use case. The accuracy comes from restricting the AI to your knowledge base only rather than letting it generate answers from general training data.\n\nAda is worth looking at if you want more customization. You can build flows that check customer status, order history, and account details before the AI responds. With our clients the support bots that actually work have explicit logic for common scenarios like refund status checks rather than relying on AI to figure it out.\n\nThe strategy that matters more than the tool is aggressive fallback to humans. Set confidence thresholds tight so the bot hands off quickly when it's not certain. A bot that says \"let me connect you with someone who can help\" is way better than one that confidently gives wrong answers.\n\nStart by identifying your top 10 ticket types by volume and build specific handling for those before trying to automate everything.",
          "score": 1,
          "created_utc": "2025-12-30 23:07:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1u6gr",
          "author": "TechnicalSoup8578",
          "text": "The key is making your assistant use a vector search over your official knowledge base and user context so responses aren’t just plausible language but are explicitly backed by your own documents and customer history. You sould share it in VibeCodersNest too",
          "score": 1,
          "created_utc": "2026-01-01 07:57:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pz5mml",
      "title": "Trying to stay consistent with competitor research as a solo founder",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pz5mml/trying_to_stay_consistent_with_competitor/",
      "author": "Happy-Fruit-8628",
      "created_utc": "2025-12-30 02:16:56",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 0.8,
      "text": "I am building a small product and trying to learn faster by watching what similar companies are doing. The problem is consistency.\n\nAt the start, I check competitors across a few places, skim updates, look at who is engaging, and take rough notes. After a week or two, real work takes over and this habit quietly disappears.\n\nRecently I tried simplifying this by using a lightweight tool called Followerli just to passively track who follows competitor companies and review patterns later. Not for outreach or lead gen, just awareness. It helped reduce the urge to constantly check things manually.\n\nI still do some manual checks, but having something running quietly in the background made it easier to stay consistent.\n\nFor other founders building in public or working solo, how do you handle competitor or market awareness without it becoming another thing you drop after two weeks?",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pz5mml/trying_to_stay_consistent_with_competitor/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwnv6xu",
          "author": "Radiant-Anteater-418",
          "text": "Competitor tracking always sounds simple until it turns into random scrolling and forgotten notes. Having a calmer way to review trends over time makes a big difference.",
          "score": 1,
          "created_utc": "2025-12-30 02:47:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwwa9gc",
          "author": "WitnessEcstatic9697",
          "text": "for the content/messaging side of competitor research, I built something that scrapes what's performing on YouTube and TikTok in any niche, shows hooks, formats, angles that are working\n\ndifferent from follower tracking but helps with \"what are competitors saying that's resonating\"\n\nhappy to share if useful",
          "score": 1,
          "created_utc": "2025-12-31 11:04:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwnyjho",
          "author": "Odd-Literature-5302",
          "text": "It’s great that you’re using a tool like Followerli to make competitor tracking more sustainable. How are you finding the signal quality so far? Does it surface insights you wouldn’t have noticed manually, or is it mainly helping with consistency?",
          "score": 1,
          "created_utc": "2025-12-30 03:06:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwzjua",
      "title": "If taking a week off for Christmas would break your business, you don’t own a company(you own a job)",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pwzjua/if_taking_a_week_off_for_christmas_would_break/",
      "author": "damonflowers",
      "created_utc": "2025-12-27 14:49:12",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 0.71,
      "text": "This took me longer to accept than I’d like to admit.\n\nLast Christmas, I told myself I was “taking time off,” but I was still checking Slack, skimming emails, and mentally tracking everything that could go wrong if I stepped away for too long. I never fully disconnected, even when I wasn’t officially working.\n\nI work with founders on their ops now, and trust me I see this pattern a lot.\n\nOn paper, I was the founder. In reality, the business depended on me for every decision that mattered. Approvals, context, and problem-solving all flowed back to me whether I wanted them to or not.\n\nIt wasn’t because the team was bad or careless. They were capable and committed. The real issue was that I had built a system that only worked when I was present.\n\nAt the time, I justified it as responsibility. I told myself this was what serious founders did, specially if they cared about growth and quality. Stepping away felt irresponsible rather than necessary.\n\nBut the truth was simple. If I couldn’t leave for a week without things slowing down, I hadn’t built a company. I’d built a demanding job with my name on it.\n\nThe hardest shift wasn’t delegation itself. It was letting go of the belief that being involved everywhere was good leadership. Once we clarified ownership, removed decision bottlenecks, and built systems that didn’t rely on my constant context, something unexpected happened.\n\nThe business kept moving without me. Decisions were made, work progressed, and problems were solved without escalation. That’s when it finally felt real.\n\nI think of this as the “one-week test.” If everything slows down the moment you step away, the business isn’t fragile, it’s over-dependent.\n\nAs the year wraps up, I’m curious how others experienced this. Did you have real peace of mind over Christmas, or were you still checking Slack?",
      "is_original_content": false,
      "link_flair_text": "Resources & Tools",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pwzjua/if_taking_a_week_off_for_christmas_would_break/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nw7rjh5",
          "author": "lmaccaro",
          "text": "Yeah my business can work without me. \n\nBut at maybe 75% efficiency. In other words we only close 3/4th as many deals. We spend 25% more than we should on procurement. We goof around 1-2 hrs a day more than if I were there keeping everyone on task. Etc. \n\nAnd that’s OK for a little bit.",
          "score": 1,
          "created_utc": "2025-12-27 16:53:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw9bq4v",
          "author": "amhumanz",
          "text": "Is this just more AI slop? Why do 90% of text posts have the same voice and structure these days?",
          "score": 1,
          "created_utc": "2025-12-27 21:46:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1putq33",
      "title": "What was the smallest signal you ignored that later turned out to matter the most?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1putq33/what_was_the_smallest_signal_you_ignored_that/",
      "author": "Oliver19234",
      "created_utc": "2025-12-24 18:17:44",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 0.71,
      "text": "I keep realizing that the biggest mistakes rarely start as big red flags.  \n  \nThey usually begin as small signals you notice, then explain away.  \n  \nA user hesitates.  \n  \nA pattern doesn’t repeat.  \n  \nSomething feels slightly off, but not enough to stop momentum.\n\nLooking back, what was the smallest signal you ignored that later became obvious?  \n  \nAnd why do you think you dismissed it at the time?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1putq33/what_was_the_smallest_signal_you_ignored_that/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nvr9u60",
          "author": "sam5-8",
          "text": "For me it was hesitation during onboarding. People didn’t quit, but they slowed down. I told myself it was normal friction. It wasn’t.",
          "score": 3,
          "created_utc": "2025-12-24 18:41:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvrbysf",
              "author": "Oliver19234",
              "text": "That’s a good way to describe it. Hesitation is subtle, but once you see it, it’s hard to ignore",
              "score": 1,
              "created_utc": "2025-12-24 18:52:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvraa5m",
          "author": "Walsh_Tracy",
          "text": "I ran into this exact pattern before. What helped me notice those “small signals” earlier was reading Starting A StartUp: Build Something People Want by James Sinclair. It pushed me to stop dismissing hesitation and silence as normal and start treating them as data, not noise.",
          "score": 1,
          "created_utc": "2025-12-24 18:43:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvt8fvr",
              "author": "aVarangian",
              "text": "all these comments read like typical youtube bot scripted \"conversations\"",
              "score": 1,
              "created_utc": "2025-12-25 02:15:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvrbenl",
              "author": "fatmax5",
              "text": "That slowdown is a great catch. Hesitation usually shows up long before churn does.",
              "score": 1,
              "created_utc": "2025-12-24 18:49:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvrc3i8",
              "author": "Oliver19234",
              "text": "Treating silence as data instead of absence of feedback is something I’m still learning",
              "score": 0,
              "created_utc": "2025-12-24 18:53:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pyfh65",
      "title": "How are you handling out-of-office schedules messing up your lead response times?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pyfh65/how_are_you_handling_outofoffice_schedules/",
      "author": "k5survives",
      "created_utc": "2025-12-29 07:00:38",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "We're coming to the end of the year when leads just sit there getting cold. Our response times go from hours to days and conversion rates tank.\n\nWhat's your workflow for this? Do you have backup systems, auto-routing or just accept that some leads will slip through the cracks?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pyfh65/how_are_you_handling_outofoffice_schedules/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwibnxu",
          "author": "Wide_Brief3025",
          "text": "Having a shared inbox with clear tagging helps, but honestly the biggest win has been getting instant alerts for key lead mentions and auto prioritizing high intent messages. I started using ParseStream for this and it really cuts down on leads slipping through when team members are out. Makes juggling coverage way easier.",
          "score": 1,
          "created_utc": "2025-12-29 07:24:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwk17f8",
          "author": "Sudden-Context-4719",
          "text": "I usually set up auto-routing to a backup team when someone’s out so leads don’t just sit there. If that’s not possible, using tools like SocListener can help catch new leads on Reddit and engage them fast even when your main team is offline. Otherwise, yeah, some leads will slip but having a backup plan cuts down lost chances a lot.",
          "score": 1,
          "created_utc": "2025-12-29 15:15:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwk4663",
          "author": "euro-data-nerd",
          "text": "We route leads to whoever is actually available and pause campaigns when no one can respond, because automating bad follow-ups just scales the problem.",
          "score": 1,
          "created_utc": "2025-12-29 15:30:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwos1zt",
          "author": "PrimarySelfCoaching",
          "text": "Year-end OOO stalls are brutal—what we coach clients on is designing for “golden hour” response even with skeleton crews. Use calendar-aware round‑robin so OOO reps are skipped, pair it with a value‑forward 5‑minute auto‑reply (SMS/email with a clear CTA to book or reply “urgent”), and set an on‑call rotation that does two daily lead sweeps with SLAs surfaced in a shared dashboard. When coverage is thin, throttle or reroute low‑intent channels so you’re not creating a backlog you can’t touch. Where’s the breakdown for you right now—routing, first touch, or day‑of coverage?",
          "score": 1,
          "created_utc": "2025-12-30 06:20:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqpzf3",
          "author": "bleudude",
          "text": "My 2 cents, set up auto-routing to whoever's in office. Most crms can do this based on availability status. We use monday CRM and it automatically redistributes leads when someone's ooo. \n\nAlso set expectations with an autoresponder saying you'll get back within X business days instead of pretending you're available. Better to underpromise than have leads think you're ignoring them.",
          "score": 1,
          "created_utc": "2025-12-30 15:17:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtg35r",
          "author": "erickrealz",
          "text": "Auto-response that sets expectations is the bare minimum. Something like \"Thanks for reaching out, we're running limited hours through Jan 2nd but will respond within 24-48 hours\" at least acknowledges they're not being ignored. Most people understand holiday delays if you're upfront about it.\n\nThe real fix is having someone actually working the hot leads even when the office is technically closed. With our clients we push them to identify who's covering during the gap and have leads route specifically to that person rather than sitting in a shared inbox nobody's watching. Even checking twice daily for 30 minutes beats the \"we'll deal with it in January\" approach.\n\nCalendar-based auto-routing through your CRM can push leads to whoever's actually available based on their OOO settings. HubSpot and Salesforce both support this. Takes some setup but means leads don't pile up waiting for someone who's at their in-laws for a week.\n\nThe honest truth is that holiday lead quality is often lower anyway. People browsing between Christmas and New Year's are frequently not serious buyers, they're killing time. The really hot opportunities either closed before the holidays or will still be hot in January.",
          "score": 1,
          "created_utc": "2025-12-30 23:03:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxre5o",
      "title": "Is launching on 30+ directories worth it for SEO and first users as a solo founder?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pxre5o/is_launching_on_30_directories_worth_it_for_seo/",
      "author": "Hefty-Airport2454",
      "created_utc": "2025-12-28 13:30:19",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I’ve been testing 30+ launch directories this last 2 weeks as a solo founder and they helped my domain rating and visibility, but not in a “1000 users overnight” way.​\n\nWhat I actually did:\n\n* TrustMRR to showcase live MRR, and TrustViews to showcase views. These listing becomes a small “proof page” that can rank. + backlink\n* Higher-DR places like Product Hunt and Hacker News / YC-related newsletters for a few strong backlinks.​\n* Product Hunt alternatives like Uneed, Microlaunch, TinyLaunch, RankInPublic, Shipyard, Fazier, Twelve Tools for niche, contextual backlinks.​\n\nThe results:\n\n* Helped my DR from 0 to 25 and search impressions grew faster than content alone, thanks to a limited number of quality dofollow links.​\n* Brought small but steady “drip traffic” instead of big spikes; I’m at 9 paid users and 3k website visits so far from this whole experiment.​\n* Content so share with trustmrr and trustviews on the socials. Not about the product but it's a good fit for the build in public.\n\nWhat I've learned from this:\n\n* Directories are a **starting** move: proof + backlinks + a bit of luck, not a growth engine on their own.​\n* Long term, it still comes down to product, positioning, and showing up consistently with content and updates.​\n\nTL;DL : 30+ directories = 3k views, 9 paid users, 0 to 2 DR SEO\n\nIf you have done your project launch differently, curious to know how.",
      "is_original_content": false,
      "link_flair_text": "Idea Validation",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pxre5o/is_launching_on_30_directories_worth_it_for_seo/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwd52cf",
          "author": "Useful-guy-007",
          "text": "tried doing it,\n\n* uneed doesnt work . submit button doesnt takes me anywhere.  \n* microlaunch has no free plan.\n* tinylaunch is what worked for me.\n* shiyardhq worked for me too\n* rankin public. xyz felt like a scamming site, asking me to choose which is best form 2 websites. #lol\n* fazier want to dd their embed badge (i can do it though)\n* Twelve tool also wanted a backlink.",
          "score": 2,
          "created_utc": "2025-12-28 14:07:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwfcnni",
              "author": "Hefty-Airport2454",
              "text": "rank in public is fun but I agree\n\n  \nI basically agree on the list haha",
              "score": 1,
              "created_utc": "2025-12-28 20:49:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwqe2u4",
          "author": "No-Swimmer-2777",
          "text": "30 directories = 3k views is solid for a starting move. Real win is the backlinks. Quality over quantity—focus on high-DR sites, not spray-and-pray.",
          "score": 2,
          "created_utc": "2025-12-30 14:13:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwqir70",
              "author": "Hefty-Airport2454",
              "text": "Yes, that was kind of my point : list on quality directories not all crappy ones",
              "score": 1,
              "created_utc": "2025-12-30 14:39:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwhte1p",
          "author": "gallantfarhan",
          "text": "You've built a great foundation with those directory listings. The key now is to shift from broad awareness to targeted attraction. Focus on creating content that solves the specific problems your ideal customers are searching for, as that's what will bring in qualified users who are ready to convert.",
          "score": 1,
          "created_utc": "2025-12-29 04:58:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxkysg",
      "title": "AI GTM Tools exp shares needed",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pxkysg/ai_gtm_tools_exp_shares_needed/",
      "author": "NxtLevelRecruiting",
      "created_utc": "2025-12-28 07:01:50",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "What are your favorite AI GTM SaaS Tools. I’m evaluating our tech stack for 2026. We have B2B Sales Reps. They’re inside and outside sales.\n\nOur recruiters are mostly inside B2C style sales reps. \n\nI appreciate all the recommendations in advance. \n\nI’d love to hear: \n1. What tools had the highest ROI. \n2. How did you evaluate the impact directly using this new tool over previous tools?\n3. What were some of the major learning curves for you and the team? \n4. If you were starting from 0 with the tool today, what would you have done differently to maximize your usage of the tool? ",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pxkysg/ai_gtm_tools_exp_shares_needed/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwipj61",
          "author": "muabaca",
          "text": "Apollo for lead gen impact measured on conversion lifts over old CRM. Learning curve team resisted at first mandatory demos helped. Pilot with one rep group for quicker buy-in. For capturing sales knowledge, Sensay's an option that might streamline onboarding. What's your biggest hurdle?",
          "score": 1,
          "created_utc": "2025-12-29 09:33:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwk02jl",
          "author": "Sudden-Context-4719",
          "text": "If you’re looking to tap into Reddit for B2B sales, SocListener helped me find relevant posts fast and even auto-generated comments that felt natural. The biggest ROI was saving time on prospecting and getting replies quicker than before. Biggest learning curve was tweaking the comment style so it didn’t sound spammy.",
          "score": 1,
          "created_utc": "2025-12-29 15:09:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqeh1u",
          "author": "No-Swimmer-2777",
          "text": "Apollo + Outreach for most. The ROI depends entirely on your data quality and follow-up discipline. Tool picks winners only if your ops are solid.",
          "score": 1,
          "created_utc": "2025-12-30 14:15:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pvynyw",
      "title": "What was your DR after 6 months?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pvynyw/what_was_your_dr_after_6_months/",
      "author": "VictoryWide1495",
      "created_utc": "2025-12-26 07:37:18",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Just curious because, some people I see on X claiming to have DR of above 20 in a week, and some say anything below 1 is normal for first 6 months as Google takes time....so I wonder what was your duration? \n\nAlso, for new startups its important to know because many sell claiming it will boost quicker or faster, so any experience/strategy would really help. ",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pvynyw/what_was_your_dr_after_6_months/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nw04xyr",
          "author": "vhwebdesign",
          "text": "For the non-SEO people here, DR stands for [Domain Rating](https://ahrefs.com/seo/glossary/domain-rating).",
          "score": 5,
          "created_utc": "2025-12-26 10:06:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvzxopx",
          "author": "euro-data-nerd",
          "text": "Everything else is SEO theater. DR moves when the product stops thrashing, not when someone sells you a shortcut.",
          "score": 1,
          "created_utc": "2025-12-26 08:50:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw049ye",
          "author": "Hakuna-Matattaa",
          "text": "Well every tool’s algorithm calculates it differently. Some may have DR in 40s in SEMRush, but it’s in 60s in Ahrefs. Tool doesn’t matter as long as you use the same tool to see progress, but when asking in a public forum, it does matter.\n\nIf you’re very consistent with content writing (and distribution is even more critical), updating content that has impressions, but not in page 1 (use Claude to suggest with GSC performance report), sharing/engaging on socials, you should see a good consistent uptick every few weeks.",
          "score": 1,
          "created_utc": "2025-12-26 10:00:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw0ised",
          "author": "aVarangian",
          "text": "DR? I got 32Gb of DDR, so I'm basically rich",
          "score": 1,
          "created_utc": "2025-12-26 12:21:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw14h2d",
          "author": "gapingweasel",
          "text": "DR 20 in a week is almost always aged domains or paid links.....not real SEO results.",
          "score": 1,
          "created_utc": "2025-12-26 14:54:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqngtj",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-30 15:04:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwqnito",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pvynyw/what_was_your_dr_after_6_months/nwqngtj/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2025-12-30 15:04:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pyxe0z",
      "title": "Building a tool to help small businesses audit CAM invoices — what I’ve learned so far",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pyxe0z/building_a_tool_to_help_small_businesses_audit/",
      "author": "jekistler",
      "created_utc": "2025-12-29 20:36:10",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I run a micro-SaaS called **Tenant Shield** that audits commercial leases against CAM invoices to catch overcharges. I built it after watching a couple of small local tenants get hit with costs that didn’t match their lease, and realizing very few people ever check the math.\n\nA couple of lessons from actually putting this in front of real tenants:\n\n* People need **proof of upside before they’ll buy anything** → I now show estimated refund totals *before* unlocking the full audit. That was a turning point — tenants want to know there’s real money on the table first.\n* “AI audit” alone isn’t enough → Models are good at extraction, but the *truth* has to live in code (caps, exclusions, base year logic). The product got way more trustworthy once I stopped asking the model to “decide things.”\n* Presentation matters → A single screenshot showing a potential refund of $5k–$30k says more than 100 lines of feature text.\n\nIf anyone here has dealt with lease/CAM reconciliation stuff in your business, I’d love to hear what the biggest pain points were.\n\nNot trying to sell anything — just sharing the journey and things I wish I knew earlier as I keep refining it.\n\nPM for link  \n(you can see potential refund ranges without paying or signing up)",
      "is_original_content": false,
      "link_flair_text": "Idea Validation",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pyxe0z/building_a_tool_to_help_small_businesses_audit/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwnws97",
          "author": "Middle_Flounder_9429",
          "text": "WIIFM (Whats In It For Me) is always paramount. We should never forget it",
          "score": 1,
          "created_utc": "2025-12-30 02:56:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzon43",
      "title": "What daily habit do you have to build your fortune ?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pzon43/what_daily_habit_do_you_have_to_build_your_fortune/",
      "author": "Soniki007",
      "created_utc": "2025-12-30 17:49:06",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "What daily habit do you have to build your fortune ?  \nsomething that you do daily, could take 10-15m a day and help you grow mentally and finanacllly - let's share  ",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pzon43/what_daily_habit_do_you_have_to_build_your_fortune/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwrrj9x",
          "author": "OneHunt5428",
          "text": "Reading or learning something new every day and taking one small action that actually moves money or skills forward, even if it’s just 10 minutes.",
          "score": 2,
          "created_utc": "2025-12-30 18:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtipbp",
          "author": "manifestla8",
          "text": "It all starts in the subconscious mind. Every wealthy person will tell you that. Start with the affirmations on the Humanreprogram website.",
          "score": 2,
          "created_utc": "2025-12-30 23:18:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvyf3z",
          "author": "MORPHOICES",
          "text": "It is a “alignment check” that occurs daily. \\~\n\nNo greater than 15 minutes.\n\nI ponder on three things.\n\nWhat was responsible for yesterday’s move?\n\nWhat took away your energy?\n\nWhat little thing will add up today?\n\nAs time went by, I observed that making less progress was not equivalent to doing more. The purpose was to minimize friction and repeat the right action. The most mundane ones.\n\nFor instance, If I scanned yesterday and circled one that led to leverage (learning, outreach, writing, relationships).  I ensure that today has at least one of them again. I feel it if there is no day passes.\n\nIt helps in maintaining equilibrium. In terms of money, stay honest for where results come from.\n\nWhen you look back at your last week, do you notice any daily actions that compounded? Which ones felt productive but weren’t actually helpful?",
          "score": 1,
          "created_utc": "2025-12-31 09:12:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nww7lkg",
          "author": "luke-build-at50",
          "text": "Honestly? Doing one small, boring thing every day that compounds and not switching strategies every week.\n\nFor me it’s 10–15 minutes of either learning something specific that actually applies to what I’m building, or nudging one thing forward that can make money later. No motivation porn, no grand plans.\n\nFortunes usually come from consistency with unsexy habits, not from heroic bursts. The hard part isn’t knowing what to do, it’s not getting bored and stopping.",
          "score": 1,
          "created_utc": "2025-12-31 10:39:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pvy0j2",
      "title": "My journey finding the best b2b lead gen agency for my service biz.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pvy0j2/my_journey_finding_the_best_b2b_lead_gen_agency/",
      "author": "_magvin",
      "created_utc": "2025-12-26 06:55:44",
      "score": 3,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "I’ve been documenting my growth and the next step is outsourcing outbound completely. I’m currently interviewing three candidates for the best b2b lead gen agency title. One is focused on cold calling, one on email, and one on LinkedIn. I want to find an agency that is deals with the data and constantly optimizing our campaigns. Any advice from someone who has been through this?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pvy0j2/my_journey_finding_the_best_b2b_lead_gen_agency/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nvzry84",
          "author": "OrganicGuarantee1221",
          "text": "dm me",
          "score": 1,
          "created_utc": "2025-12-26 07:50:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw08cvn",
          "author": "Monkeyboogaloo",
          "text": "Imho don't use an agency that relies on a single channel. To the man with a hammer everything looks like a nail as the saying goes.\nB2B lead gen shoukd be an omni channel approach.\nI have run a B2B agency for nearly a decade. I don't do it anymore so not pitching! \nBut happy to talk about the frame work I would use.",
          "score": 1,
          "created_utc": "2025-12-26 10:41:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwc2qlr",
              "author": "_magvin",
              "text": "I'd genuinely like to hear the framework you'd use and an omni channel system just makes more sense on real world B2B.",
              "score": 1,
              "created_utc": "2025-12-28 08:40:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwd1zd2",
                  "author": "Monkeyboogaloo",
                  "text": "whats the product/service value of your product/service, i can put together what I typically would have built for that",
                  "score": 1,
                  "created_utc": "2025-12-28 13:47:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw4hnut",
          "author": "BusinessStrategist",
          "text": "Do you understand the basics of B2B marketing?",
          "score": 1,
          "created_utc": "2025-12-27 02:13:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwc3acm",
              "author": "_magvin",
              "text": "Of course I understand the basics of B2B marketing. Things like demand gen, multi-stakeholder decision-making and the long buying cycle among other basics of B2B.",
              "score": 1,
              "created_utc": "2025-12-28 08:45:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwb9inm",
          "author": "Infinite_Sunda",
          "text": "To avoid the 'one-hit wonder' agency, ask to see a case study where a campaign failed initially and how they fixed it. Agencies like OutreachBloom tend to be much more transparent about that optimization process.",
          "score": 1,
          "created_utc": "2025-12-28 04:33:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwc3hld",
              "author": "_magvin",
              "text": "How an agency looks for possible leaks and works on them before the situation becomes unbearable says more than a single success story.",
              "score": 1,
              "created_utc": "2025-12-28 08:47:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwfrw4x",
          "author": "BusinessStrategist",
          "text": "It’s the « people » dimension that appears to be lacking.",
          "score": 1,
          "created_utc": "2025-12-28 22:03:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlcri1",
          "author": "sh4ddai",
          "text": "Hey, happy to help here. I run OutreachBloom and we specialize in cold email outreach for our clients.\n\n\n\nIt's 100% done-for-you. We handle everything, including ICP/audience segmenting, list building, infrastructure setup & optimization, messaging + dynamic personalization, sends, deliverability monitoring/remediation, and we even handle replies for you.\n\n\n\nAll you gotta do is close the deals when we hand-off interested leads.\n\n\n\nAs a starting point, I like to get on a Meet/screenshare to learn about your target audience and your goals. Then we can build a segment of your ideal target audience together.\n\n\n\nI'll shoot you a DM!",
          "score": 1,
          "created_utc": "2025-12-29 18:59:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwyuqjs",
          "author": "stealthagents",
          "text": "Sounds like you're on the right track! I've worked with a couple of agencies and found that one which prioritized data analytics made a huge difference in ROI. Make sure to ask them how they measure success and their process for tweaking campaigns in real time.",
          "score": 1,
          "created_utc": "2025-12-31 19:53:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q0f8pv",
      "title": "I suck at sales/marketing but can build products I need help",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1q0f8pv/i_suck_at_salesmarketing_but_can_build_products_i/",
      "author": "PaleContribution6199",
      "created_utc": "2025-12-31 15:12:32",
      "score": 3,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "I run a small software company building **privacy-first products**, including Cipher Chats (encrypted messaging), Cipher Memories (private encrypted gallery), Cipher Cloud (client-side encrypted cloud storage so providers can’t access data), and **TestFlow**, a developer tool for managing test flows and workflows. Across everything I have about **2.1k downloads**, users don’t immediately churn, and feedback is generally positive around privacy and UX — but I’m generating **no real revenue**. I’m a strong builder but not great at marketing or sales, and I’m starting to think that’s the real bottleneck, not the tech. I’m trying to understand whether privacy alone is a weak value prop without a clear compliance or business pain, whether my positioning is too broad, or whether I should kill most things and focus on one. I’m also open to bringing in someone who understands growth, go-to-market, or B2B sales and is willing to work for **equity**, not just advisory fees. If you’ve built privacy or dev tools before, where did revenue actually come from, and where do people usually find early partners who want real ownership? I’m not attached to being right — I just want to understand why this isn’t working and fix it.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1q0f8pv/i_suck_at_salesmarketing_but_can_build_products_i/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwxbq31",
          "author": "Unique-Painting-9364",
          "text": "This is super common for builder led products. Privacy by itself usually isn’t a buying trigger unless it’s tied to a clear pain. I’d probably pause new builds, pick the one product with the clearest buyer, and tighten it around who urgently needs it and why now. Revenue usually shows up once the positioning gets narrow, not when the tech gets better.",
          "score": 3,
          "created_utc": "2025-12-31 15:17:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwxtl6p",
          "author": "WashConsistent6355",
          "text": "Think about what problem you are solving. Market your solution around that problem. Maybe reading one or two marketing books might already help before splitting equity:) Good luck.",
          "score": 2,
          "created_utc": "2025-12-31 16:46:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwzg5iw",
          "author": "BusinessStrategist",
          "text": "Don’t you think that your « dense » block of text might motivate surfers to move on?",
          "score": 2,
          "created_utc": "2025-12-31 21:50:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1e93i",
          "author": "More-Information4422",
          "text": "I would seriously consider leveraging short form content as your sales funnel. This removes the need for you to be directly marketing your product. Also, sales is a skill, like any other it can be learned (probably faster than you think). You sound like a skilled guy, I would leverage platforms to get your product out there, and practice your sales skills. After all, sales is just interpersonal skills and these can be learned! Id love to chat with you more about partnership/ownership, feel free to reach out.",
          "score": 2,
          "created_utc": "2026-01-01 05:27:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx350ub",
          "author": "AilaInnovate",
          "text": "What you’re missing isn’t a cofounder, it’s go-to-market judgment. Those are very different things. Equity partnerships make sense when someone is going to own a long-term surface area of risk. Most early “growth cofounder” setups fail because what’s actually needed is sequencing, positioning, and sales logic, not another person steering the product.\n\nPrivacy-first tools almost always stall where you are. Users like them, respect them, even praise them — but don’t buy unless privacy is tied to a concrete business consequence. Compliance, liability, workflow friction, or revenue protection. Without that anchor, privacy reads as a principle, not a budget line.\nThe fact that you have 2.1k downloads with low churn tells me the product isn’t broken. It tells me the value story isn’t narrowed yet. That’s a positioning and sales problem, not a build problem, and it’s usually solvable without giving up equity.\n\nI’ve seen this pattern a lot working with early teams, and once the problem is framed in economic terms, revenue starts showing up fast, and suddenly “finding a cofounder” stops being urgent.\n\nThe question I’d push on is this: which user segment would lose money, time, or sleep if your product disappeared tomorrow?\n\nIf you want a second opinion from someone who’s worked with founders at this exact inflection point, happy to continue the conversation.",
          "score": 2,
          "created_utc": "2026-01-01 15:01:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx376iv",
              "author": "Busy-Escape-9977",
              "text": "I 100% agree. Similar to your question, I ask founders to think about, \"Who gets a bad performance review or gets fired if this problem isn't solved?\" That's your customer LOL.",
              "score": 1,
              "created_utc": "2026-01-01 15:14:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx3q57w",
                  "author": "AilaInnovate",
                  "text": "Exactly. That answer reveals $millions worth of potential problems",
                  "score": 1,
                  "created_utc": "2026-01-01 16:57:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwy3slu",
          "author": "pshah74",
          "text": "I am on the same boat. I never thought marketing and sales would be so tough.\n\nI have realized that if you are bringing a cofounder, you would be willing to give half of your equity at this stage so they can also work hard and stay equally motivated.",
          "score": 1,
          "created_utc": "2025-12-31 17:37:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx35iim",
              "author": "AilaInnovate",
              "text": "Having watched a lot of founders give away equity too early, this usually isn’t a “sales is hard” problem. It’s a “who exactly hurts enough to buy” problem.\n\nBefore bringing in a cofounder, I’d push on this: can you name one specific person who feels the pain strongly enough that they’d be annoyed if your product disappeared tomorrow?\n\nThat question usually reveals whether the issue is motivation, messaging, or market.",
              "score": 2,
              "created_utc": "2026-01-01 15:04:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwyx82q",
          "author": "Vedant7781",
          "text": "Don't worry mate, you will get better with time, just don't leave it, be consistent",
          "score": 1,
          "created_utc": "2025-12-31 20:07:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1ezhu",
          "author": "InternetSalt4880",
          "text": "I’m a successful multi time founder and I’m highly technical and have also led sales and marketing (GTM) at my last 3 companies. You might want a cofounder, you might not. Feel free to send me a DM, happy to have a discussion and provide some guidance from my experience.",
          "score": 1,
          "created_utc": "2026-01-01 05:34:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx117m1",
          "author": "Alternative-Lime7814",
          "text": "Very tricky to find a co-founder, normally network. Open to have a call DM me",
          "score": 0,
          "created_utc": "2026-01-01 03:47:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1px4a1y",
      "title": "Most people can’t see their own value. Built a tool for that gap",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1px4a1y/most_people_cant_see_their_own_value_built_a_tool/",
      "author": "Edmond_Dantes6547",
      "created_utc": "2025-12-27 18:06:09",
      "score": 2,
      "num_comments": 3,
      "upvote_ratio": 0.67,
      "text": "First gen. Low income. Worked service jobs for years just wandering, an itinerant. Jack of all trades never knowing my purpose. Drawn to problem solving, I learned to code. Worked my way to engineering lead.\n\nThe thing that surprised me wasn’t how hard the technical part was. It was how hard it was to see my own value. I kept apologizing for my background instead of translating it.\n\nMost people from non traditional paths have the same blind spot. Service workers who can’t see they understand people under pressure. First gen kids who don’t realize navigating two worlds is a skill. Don’t know how the real world works. Or have mentors to guide you. People who think their experience doesn’t count because no one told them it does.\n\nI built RebornCareer.AI to help people close that gap. Extract value from experiences they’re underselling. Turn it into resumes, LinkedIn profiles, interview prep. The tool I wish existed when I was trying to figure out what I was worth. To build themselves and understand their authentic self. To see their value that they always had but didn’t know how to put into words.\n\nIf you’re out there wondering if you can make it, you can. It’s a long road. But consistency always wins\n",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1px4a1y/most_people_cant_see_their_own_value_built_a_tool/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nw8uz9r",
          "author": "PleasantConfection14",
          "text": "Is it just professional values? What you can bring to a corporation.",
          "score": 1,
          "created_utc": "2025-12-27 20:15:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw92lqr",
              "author": "Edmond_Dantes6547",
              "text": "Both. But you can’t really separate them.\n\nPeople undersell their professional value because they don’t see what they’re naturally good at or what they care about\n\nReborn helps you see both. The resume is just where it shows up",
              "score": 1,
              "created_utc": "2025-12-27 20:57:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwam62f",
          "author": "FL4kez",
          "text": "Pretty solid concept. Definitely a market for this kind of tool. Lots of first generation immigrants could definitely benefit. I’m curious do you plan to monetize it at all or are you just trying to garner maximum amount of users with no friction?",
          "score": 1,
          "created_utc": "2025-12-28 02:09:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pvbqjd",
      "title": "Watching AI MVPs Stall Right Before the Finish Line",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pvbqjd/watching_ai_mvps_stall_right_before_the_finish/",
      "author": "Akram_ba",
      "created_utc": "2025-12-25 11:45:50",
      "score": 1,
      "num_comments": 4,
      "upvote_ratio": 0.57,
      "text": "Lately I’ve been seeing a lot of AI-built MVPs reach the same strange point. The demo works. The UI looks solid. Everyone feels like they’re “basically done.” Then progress just… stops.  \n  \nWhat seems to trip people up isn’t adding features, but realizing the app wasn’t designed to survive real usage. Things like unclear ownership of logic, assumptions baked into early prompts, and no plan for handling failure states start piling up. Each quick fix makes the system more fragile.  \n  \nIt’s interesting how AI speeds up the first 80%, but exposes the gap between something that runs and something you can actually maintain. Curious if others are noticing similar stalls right before launch.",
      "is_original_content": false,
      "link_flair_text": "Idea Validation",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pvbqjd/watching_ai_mvps_stall_right_before_the_finish/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nvv412h",
          "author": "StationImmediate530",
          "text": "Can you recount a concrete scenario where you saw this happening? Curious to hear",
          "score": 1,
          "created_utc": "2025-12-25 12:51:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvv7hme",
              "author": "Akram_ba",
              "text": "Yeah ,one example was a small AI support chatbot MVP that worked great in demos, but all the business logic lived inside long, evolving prompts. Once real users started asking edge-case questions, fixes meant patching prompts instead of code, and no one was sure which change broke what. After a few weeks, adding anything new felt risky, so momentum just faded instead of turning into a launch.",
              "score": 2,
              "created_utc": "2025-12-25 13:20:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvzdr2v",
                  "author": "LouQuacious",
                  "text": "Speed running enshittification is at least one thing AI can help with apparently.",
                  "score": 1,
                  "created_utc": "2025-12-26 05:39:44",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nw0ij48",
                  "author": "nyd_det_nu",
                  "text": "Is the post about MVPs built with AI or MVPs of AI apps? Both have their problems I think, but for the one example here it seems to be an issue with building an app on LLM-tech moreso than building an app _with_ LLM-tech, right?",
                  "score": 1,
                  "created_utc": "2025-12-26 12:19:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pyvcnl",
      "title": "How can people run entire companies but can’t seem to get their health under control?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1pyvcnl/how_can_people_run_entire_companies_but_cant_seem/",
      "author": "Fitvetcoach",
      "created_utc": "2025-12-29 19:19:07",
      "score": 1,
      "num_comments": 6,
      "upvote_ratio": 0.55,
      "text": "I apologize in advance because this is going to be a rant/admonishment.\n\nThere’s a pattern I keep noticing that frustrates me.\n\nThese are people who are insanely locked in with their careers. Calendars planned out. Goals written down. Systems for everything. They’ll invest in coaches, courses, software, masterminds, whatever they think gives them an edge.\n\nAnd yet, when it comes to their body, it’s just chaos.\n\nI had a conversation with real estate broker that trains five, six days a week but he’s still stuck. Eating random meals, inconsistent workouts, sleeping poorly. No plan, no guidance, nothing that really sticks. It’s like all the discipline he has at work vanishes when it comes to his health. He had to learn to treat his body the same way he treats his business. \n\nWhat I can’t figure out is why this happens. Do people not realize that this is the one asset that keeps everything else running. You can rebuild a business. You can make more money. You can switch careers. You can’t swap bodies when this one starts pushing back.\n\nAnd it’s not even that they don’t care. They’re just heedless. As if the discipline in their workspace will automatically transfer to health. Like it should just click.\n\nI understand that most that struggle  aren’t just lazy. They’re overwhelmed and can be busy with high stakes deals for weeks. But that’s not excuse to not have a basic plan and do the bare minimum.\n\nCan someone please explain the thought process behind this? ",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1pyvcnl/how_can_people_run_entire_companies_but_cant_seem/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nwluhct",
          "author": "JackGierlich",
          "text": "Boils down to bandwidth.  \nIf you're giving work + family your entire attention (or as much as you can squeeze in a human week while accounting for basic sleep and sustenance) there's very little time for anything else.  \nHealth falls behind because it takes time.   \nTime you don't have. Time to schedule doctors visits and lose 3 hours. Time to get tests. Time.  \n\n\nAnd that time goes very fast. You can lose weeks in a blur in business- if not entire quarters.   \nSo to consciously find the time, and force yourself to go get that routine checkup...often doesn't happen.",
          "score": 5,
          "created_utc": "2025-12-29 20:25:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwmtii2",
              "author": "ms-roundhill",
              "text": "And priorities. I don't like working out so it is too easy to deprioritizs",
              "score": 1,
              "created_utc": "2025-12-29 23:21:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwo141p",
              "author": "P-Dog-1976",
              "text": "Yes but speaking from someone who’s ran a couple companies over the years one with a team of over 100 at one point, with a family and very busy work schedule, I’ve always made time for consistent workouts 3 days a week for an intense hour of weights and some aerobics few days a week be it walking with wife, fast walking around the track while my son has soccer practice or around the neighborhood; whatever time and scenario allows.  \n\nAnd eat well every day; once you get used to it, it’s pretty damn easy and you do one or two cheat meals on weekends for variety but then back to your regular scheduled program. \n\nThe key? You make it a habit. You make it a requirement. I call it my therapy and treat it as such as if I’m required to no matter what unless I’m sick.  Miss a day? You reschedule and go the next day but you sure as hell stick to a consistent schedule. Been doing it for over two decades and counting. \n\nEveryone has 3-4 hours in a week to watch TV or chill or read, etc..",
              "score": 1,
              "created_utc": "2025-12-30 03:20:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwo1nrv",
                  "author": "JackGierlich",
                  "text": "I don't have this issue. Was just answering OP.",
                  "score": 1,
                  "created_utc": "2025-12-30 03:24:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwmtqqg",
          "author": "HappyTort",
          "text": "This is me. I’m so stressed out about getting work stuff done that I sacrifice looking after myself.\n\nSounds like a simple fix but it’s so hard to choose 1-2 hours for me vs pushing the business forward \n\nEven though I’m fully aware I’m much happier and more productive when I’m eating, exercising, and sleeping well\n\nSounds simple but it’s a hard cycle to break!",
          "score": 1,
          "created_utc": "2025-12-29 23:22:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwq66cn",
          "author": "OneHunt5428",
          "text": "Honestly, I think it’s just easier to outsource discipline at work than for your own body. Running a biz has clear metrics and deadlines, health doesn’t, so it slips even for disciplined people.",
          "score": 1,
          "created_utc": "2025-12-30 13:26:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}