{
  "metadata": {
    "last_updated": "2026-01-20 08:59:57",
    "time_filter": "week",
    "subreddit": "EntrepreneurRideAlong",
    "total_items": 20,
    "total_comments": 210,
    "file_size_bytes": 237540
  },
  "items": [
    {
      "id": "1qc3jtd",
      "title": "I got \"rich\" by \"accident\" (coded apps, they blew up, made money). Now AI made them useless and I am lost.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qc3jtd/i_got_rich_by_accident_coded_apps_they_blew_up/",
      "author": "dpwdpw",
      "created_utc": "2026-01-13 21:13:43",
      "score": 364,
      "num_comments": 139,
      "upvote_ratio": 0.89,
      "text": "Hi everyone,\n\nI'm a fullstack software engineer. (htm, css, js, react js, node js). I graduated in computer science and did a few coding bootcamps.  \n  \nI landed a job in 2016 as a dev, I quit in 2018 to try the entrepreneur life. I tried many different businesses ideas, more than 5, everything failed. I'd make ends meet by freelancing Shopify projects and fixing small bugs. I met a lot of nice (and rich) people through this and learned a lot.\n\nWith everything I was learning, I'd always code Shopify apps/chrome extensions with the genuine intent of helping people out. My customers would complain about X, I'd make an app to fix X. I wasn't thinking too much about money, my goal was to make bank by selling products, not apps. \n\nFast forward to 2020. One of the apps blew up almost overnight. I coded a few others based on popular complaints and, in a matter of months, I was profiting $200\\~ USD daily, passively. Some days more, some days less. I could still work on projects and had this nice cushion to support me. \n\nFast-forward to 2026, now I make $0 and I'm going to close my business.\n\nPardon my arrogance, but I'm an excellent programmer. The thing is that there is no market looking for what was once valuable, and I don't really know what to do. Nowadays, being someone with good network/connections is way more valuable than being a top notch programmer.\n\nI invested and saved a lot, so I'm not in a dangerous position (yet), but honestly it's a weird time.\n\nAnyone in a similar position?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qc3jtd/i_got_rich_by_accident_coded_apps_they_blew_up/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzf9imf",
          "author": "Rough-Kaleidoscope67",
          "text": "Similar-ish position here, now building in the AI space, it's sort of adapt or die and I think connections have always been more important than raw talent tbch",
          "score": 134,
          "created_utc": "2026-01-13 21:20:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfpr2m",
              "author": "Fuzzy-Valuable-1774",
              "text": "What are you building in the AI space?",
              "score": 4,
              "created_utc": "2026-01-13 22:36:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzfrbg3",
                  "author": "Rough-Kaleidoscope67",
                  "text": "Trying to build an AI website builder specifically for small business owners, where the sites don't look like AI slop.  There is a lot of imo \"good handholding\" so the information that should be on the site is there (basically info wizard (as much prefilled as possible -> use AI to generate brand styles based on analysis -> generate one pager with all important info in the chosen brand style). Well, that's it in a nutshell, hard to fuck up for small business owners and still unique-ish and on brand.",
                  "score": 16,
                  "created_utc": "2026-01-13 22:44:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzo4gnz",
              "author": "GuiltyImportance4763",
              "text": "They compliment each other... connections alone is not enough.",
              "score": 1,
              "created_utc": "2026-01-15 03:56:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzzhjei",
              "author": "Tight-Preference-823",
              "text": "I completely agree that connections are key. I've found that attending industry events and joining online communities has helped me stay up-to-date with the latest trends and technologies. Have you found any particular resources or networks that have been helpful in your transition to the AI space?",
              "score": 1,
              "created_utc": "2026-01-16 20:20:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfw51c",
          "author": "SIGNANDSELFIEFRAMES",
          "text": "Ya, AI is taking a lot away\n\nI will give one example. when I had something go wrong on my Shopify website, I would go pay a coder up to $150 for a 1 day fix.\n\nThe last 3 problems I had, ChatGPT went into detail, looked at the code, and solved them for me. I saved a lot of $$. I went into the code and fixed the issue.",
          "score": 56,
          "created_utc": "2026-01-13 23:08:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfyxsh",
              "author": "phatdoof",
              "text": "How did you upload your whole site to ChatPT or did you just give them the link?",
              "score": 7,
              "created_utc": "2026-01-13 23:23:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzgbsbg",
                  "author": "SIGNANDSELFIEFRAMES",
                  "text": "When I described the issue and told it my theme (Impulse), it told me where to go in my liquid code. I then went to the section and copied and pasted my entire code of that section into Chat GPT. It told me step by step what to do.\n\nIt just writes me code and tells me to copy and paste it.\n\n  \nIt will also accept a screenshot of the issue. My last issue was that I had variants and it kept defaulting to the first variant when people would go to their cart.\n\nI have even used Chat GPT to code me add ons and stuff to throw into code to use with my theme. I love it lol.\n\nI use Chatgpt for this and I use it to make photoshop scripts for me to speed the sh\\*\\* out of my process for my small business where I do repetitive tasks.\n\nI actually learned a lot about Shopify Liquid. Instead of just doing what it tells me, I then ask it what sections of the code means and does. I just learn at the same time for fun.",
                  "score": 30,
                  "created_utc": "2026-01-14 00:33:02",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzkxadk",
                  "author": "enqvistx",
                  "text": "You use cursor.com ideally.",
                  "score": 1,
                  "created_utc": "2026-01-14 18:12:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzgsdqd",
              "author": "Zestyclose-Sink6770",
              "text": "I used to pay 5$ for a 3 line CSS fix 😂",
              "score": 3,
              "created_utc": "2026-01-14 02:06:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzg2mzt",
          "author": "k_rocker",
          "text": "Being an excellent programmer is great if you work for someone who needs an excellent programmer. \n\nYou need to switch that mindset to fixer, doer, entrepreneur. \n\nFixing problems gets you paid - even if that problem is taking away someone’s boredom for 10 minutes on a train journey. \n\nFind a problem, find a solution. But at least we won’t see you in the subs saying “I’ve got a great idea but need a technical co-founder”. \n\nGood luck on the next one 👌🏻",
          "score": 16,
          "created_utc": "2026-01-13 23:43:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfilkx",
          "author": "ahgoodday",
          "text": "Did you invest your money?\n\nIf you kept working while earning $6k/mo, I hope you did invest at least $3k/mo \n\nBy the way, it was \"easier\" back then but in a different way. Today is still easy, but the world is evolving fast and our brains must keep track of these changes : maybe you don't see anything valuable because you're still wired the same way you were before 2020?\n\nPeople dumber than you are managing to make a lot of money.\n\nJust a hint : we feel like everything's been invented already and it's not worth the effort to build anything because a bigger company already did it. But don't underestimate the number of people that get lost in these big tools. Quite often, they just want a simple tool that fulfills a simple task : ask people IRL working in different industries what their problems are, see if a giant already does it in his 360-AI-powered-all-in-one SaaS, and just code a simple tool based on this single feature (or a couple of features)",
          "score": 26,
          "created_utc": "2026-01-13 22:01:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfswea",
              "author": "dpwdpw",
              "text": "Yes.\n\nPeople smarter or dumber may be making  more or less money, but in the end, I don't see how it's pragmatically relevant. If they are, unless we meet and they teach me something, it's pointless.\n\nI appreciate your tips",
              "score": 7,
              "created_utc": "2026-01-13 22:52:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzfuaf4",
                  "author": "Big_Insurance_2509",
                  "text": "Where are you from buddy?",
                  "score": 1,
                  "created_utc": "2026-01-13 22:59:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzfxm9k",
          "author": "LayyyedBack",
          "text": "If you think about what you did, you were solving real problems businesses were having when no one else was solving them. A company (Shopify) was providing a product to customers, but it was not exactly meeting their needs. So you solved a real problem.\n\nYou say you were developing apps, and I say you were solving problems.\n\nSo... what are the new problems people are having? Maybe start by reaching out to these customers you were contracting for in the past and asking them, what is your biggest problem right now? Or what problem are you having that will help you make more money if it's solved?\n\nI say start by asking.",
          "score": 7,
          "created_utc": "2026-01-13 23:16:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhr8dk",
              "author": "adamb0mbNZ",
              "text": "100% this. At the end of the day, the guy is solving a problem that people will pay for. AI didn't kill it, it just made problem solving more democratized for non-coders. There are still a ton of problems out there that people will pay to have fixed. It's a case of talking to people and finding out what they are, then build the solution",
              "score": 3,
              "created_utc": "2026-01-14 05:48:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfh21w",
          "author": "Old-Scarcity7777",
          "text": "What about joining someone as technical help to learn new skills and grow?",
          "score": 5,
          "created_utc": "2026-01-13 21:54:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzh7sgw",
          "author": "elemist",
          "text": "If you stop putting in the effort then naturally things will taper off. You'll never be able to build something once and live off it in perpetuity. \n\nThink about similar things - an artist records some songs. They may blow up and earn them a lot of money for a few months, but then it tapers off and will continue on a downward trajectory.\n\nIf you're constantly pumping out new stuff, that will likely slow the trajectory as the older songs still will get listens.\n\nThe thing is to use success in one thing to launch into the next big thing and hopefully find success there. Sure Shopify apps/extensions may no longer be a money maker, but think laterally - is there another platform that is crying out for the same thing?\n\nIf your programming skills are as good as you say, then you should easily be able to pivot to another marketplace. It's just a matter of identifying the gap in the market.",
          "score": 4,
          "created_utc": "2026-01-14 03:34:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfpgj0",
          "author": "Sketaverse",
          "text": "Was chatting to someone earlier today and we concluded that 80% of SaaS will soon be dead. That’s actually terrifying. Everything is getting wrecked. \n\nI think there will be a financial tidal wave hitting society in 2026 that people are just not at all ready for.\n\nClaude CoWork alone is gonna fucking rip. \n\nThe only option as I see it is just go all in on this new stack / workflow and get on the right side of the fence (98:2)",
          "score": 5,
          "created_utc": "2026-01-13 22:34:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfqmv5",
              "author": "dpwdpw",
              "text": "what do you mean by Claude cowork ripping?",
              "score": 1,
              "created_utc": "2026-01-13 22:40:35",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o06o2n1",
              "author": "dhgdgewsuysshh",
              "text": "Yeah cos everyone will stop doing their business and will start building and maintaining 100 internal saas, and it will be cheaper than a guy who does the same saas and has exooof scale. Bro what are you talking about",
              "score": 1,
              "created_utc": "2026-01-17 22:23:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfq83j",
          "author": "Free_Tennis7754",
          "text": "Create a blue ocean in a non-ai space with a unique offer. ",
          "score": 6,
          "created_utc": "2026-01-13 22:38:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfxyth",
              "author": "[deleted]",
              "text": "[deleted]",
              "score": 1,
              "created_utc": "2026-01-13 23:18:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzfz7du",
                  "author": "Free_Tennis7754",
                  "text": "Pick a boring niche that does not need AI and niche down.\n\nBlue ocean = Niche down \n\nThink keywords. \n\nExample:\n\n**expense splitter** \\- broad kw - red sea of blood (tons of competitors, easy to vibe code)\n\nvs\n\n**expense splitter for touring musicians splitting gas, hotels, and merch costs mid-tour** = long tail kw - blue ocean (because no one else is selling in that sub-niche and no one will be vibe coding it. And if they do - you pivot)",
                  "score": 8,
                  "created_utc": "2026-01-13 23:25:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzfqrvf",
          "author": "Relative-Tourist8475",
          "text": "6k a month is not « rich ». You made some money, congrats. Now time to get back in the race. Can you replicate anything you did for your initial success? And scale it to let’s say 10x what you did? Can you identify any pattern at all?",
          "score": 6,
          "created_utc": "2026-01-13 22:41:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzft6ag",
              "author": "mizmaclean",
              "text": "Clearly that’s why he put it in quotation marks. To many outside of the US, it’s in fact quite rich.",
              "score": 10,
              "created_utc": "2026-01-13 22:53:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzgddzq",
              "author": "redcoatwright",
              "text": "I think depends where they are? 6k a month passively in some countries would be awesome.\n\nIn the US they could have made at least double if not 2.5x that as a mid level and 3x as a senior/principle",
              "score": 2,
              "created_utc": "2026-01-14 00:41:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzgk47q",
          "author": "Nimora9",
          "text": "I know that it feels bad, but that is the basics of all business.  \n\nEven major companies have their income drop to 0 and every company and entrepreneur is trying to find new ideas and new ways to keep the income coming in.  \n\nThe most important thing to remember is that you figured it out once before and you will figure out again. Just trust yourself!",
          "score": 2,
          "created_utc": "2026-01-14 01:19:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhud6k",
          "author": "Reaper73",
          "text": "Do you have any type of customer list?\n\n\nIf yes, organize them by total order value. Then email the top 10(?) people saying you're the author of x, y and z apps. Thank them for their patronage and then ask them if there is any other software they're looking for. ",
          "score": 2,
          "created_utc": "2026-01-14 06:14:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxbc6e",
          "author": "Negative-Ad-7993",
          "text": "Best of luck to you.  You did nothing wrong, but the world beneath you has shifted.  Absolutely certain you will find firm footing again.\n\nYou already did what most cannot do.  You found a need in the market and you created an app to satisfy that need,  this places you in top 10% of very talented developers who can code but cannot solve real world problems.\n\nThe advantage for your going forward is that you can replicate what you did, using AI and do it much faster.  You can build 5 apps in the same time it took you to build one.  Even if 4 fail, you still have one new winner in the race.\n\nAnd yes, even this winner will expire in short timeframe, AI is going too fast.  But your core skill - being a strong developer who can understand a real world problem and solve it... that skill is what will carry you into the long future.",
          "score": 2,
          "created_utc": "2026-01-16 14:27:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06xwgp",
          "author": "joefife",
          "text": "Hey. Been there before mate - I used to run a very popular niche dating website, turning over about £600k a year.\n\nIt died in the advent of grindr.\n\nI now run a property maintenance company. I'm basically a handyman that knows how to do admin 😂\n\nHappy to chat - know what it's like to have this kind of shift. For me it happened in less than a year, had to make several people redundant, nearly went bust as I was used to spending a decent income.",
          "score": 2,
          "created_utc": "2026-01-17 23:12:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfmvwj",
          "author": "LateNightCommits",
          "text": "Recently cancelled, I didn't mind because I felt certain I'd be able to start some kind of modest SaaS. Not crappy AI wrapper, a genuine business. Well, turns out, there's nothing. Somehow I was worth a six figure salary to a bloated corporation that achieved very little, but on my own, all my skills are worth zero. Time to become an electrician. ",
          "score": 4,
          "created_utc": "2026-01-13 22:22:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfo6g0",
              "author": "dpwdpw",
              "text": "I may end up doing the same, lol. I still want to work online but I don't see many options.",
              "score": 3,
              "created_utc": "2026-01-13 22:28:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzffn0l",
          "author": "kuvvaci-tux",
          "text": "Im sorry to hear that mate, Im developing an app for fun (not sure if it is gonna work and honestly don't care if it wont) if u would like to earn me as a network and friend, u can join me lol 😂",
          "score": 1,
          "created_utc": "2026-01-13 21:47:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzffot2",
          "author": "passivevigilante",
          "text": "Did you invest the money you made or blow it all on random stuff",
          "score": 1,
          "created_utc": "2026-01-13 21:48:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfh218",
              "author": "Boboshady",
              "text": "He spent a lot of money on women, booze and fast cars. The rest he just squandered.",
              "score": 2,
              "created_utc": "2026-01-13 21:54:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzfpwhs",
                  "author": "Sketaverse",
                  "text": "Georgie Best 🫡",
                  "score": 1,
                  "created_utc": "2026-01-13 22:36:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzfh1ti",
          "author": "AdorablePandaBaby",
          "text": "Want to work together on something?",
          "score": 1,
          "created_utc": "2026-01-13 21:54:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfrc1z",
              "author": "Beneficial-Library27",
              "text": "Yeah , i do",
              "score": 1,
              "created_utc": "2026-01-13 22:44:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfmagc",
          "author": "PrivilPrime",
          "text": "did you saved up?",
          "score": 1,
          "created_utc": "2026-01-13 22:19:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfnxdp",
              "author": "dpwdpw",
              "text": "Yes",
              "score": 1,
              "created_utc": "2026-01-13 22:27:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfw1y6",
          "author": "PNW_Uncle_Iroh",
          "text": "There will be lots of opportunities to fix the bugs that AI is creating right now. Start to build a reputation in that space. When the startups who used an AI tool to build their app realize that it won’t scale, you come in and clean up the mess.",
          "score": 1,
          "created_utc": "2026-01-13 23:08:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfwami",
              "author": "dpwdpw",
              "text": "AI will improve to the point of fixing its own bugs in matter of 2 years at most.\n\nI've been using AI since 2024 to code. The progress it's made in months is absurd. It will keep improving. Sooner than later, programmers won't be needed.",
              "score": 3,
              "created_utc": "2026-01-13 23:09:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzfyqeh",
                  "author": "phatdoof",
                  "text": "I heard that AI works fine on new stuff from scratch but has problems fixing existing coded stuff and will need constant hand holding. Do you see this as a case?",
                  "score": 1,
                  "created_utc": "2026-01-13 23:22:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzgjlim",
          "author": "PeanutBAndJealous",
          "text": "is $200 a day a lot?",
          "score": 1,
          "created_utc": "2026-01-14 01:16:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzgpfew",
              "author": "Free-Walrus-7492",
              "text": "In most countries outside the US, yes. I encourage you to travel more.",
              "score": 0,
              "created_utc": "2026-01-14 01:49:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzgsg93",
          "author": "Healthy_Reply_7007",
          "text": "It sounds like you got caught up in the hype of coding apps that became too popular and lost value once they were replaced by AI. How's your network looking now - are those connections still valuable or have they soured?",
          "score": 1,
          "created_utc": "2026-01-14 02:07:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgybz3",
          "author": "Meth_taboo",
          "text": "Are you in the us? Do you want a full time job as a developer ?",
          "score": 1,
          "created_utc": "2026-01-14 02:40:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzh4q1j",
          "author": "elsalvadork",
          "text": "Got a great fintech idea in Europe if you’re up for it",
          "score": 1,
          "created_utc": "2026-01-14 03:16:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhipd6",
          "author": "changework",
          "text": "Check DM",
          "score": 1,
          "created_utc": "2026-01-14 04:46:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhmwe4",
          "author": "Substantial-Suit-597",
          "text": "   I feel your pain, but at the same time I don’t understand why you don’t change your perspective. So I’m part of your Ai problem. I’m a vibe coder, but I would LOVE to have someone with your knowledge on my team and be PART of the Ai revolution - not a victim of it. Your experience can be a massive advantage to help newbies like me. You can create an agency that checks vibe coded apps, fixes them, adds security measures, tests for bugs, and more. You already know what weaknesses can be exploited. \n   I’ve vibe coded a few projects. I have a couple people practically begging me to release one of them and all I shared were screenshots. (It’s honestly a better product than what’s available today!) But I’d love to have a seasoned pro review everything and suggest security fixes, edits or improvements before I officially launch. There’s a need for people with your knowledge!!! But I think you have to be willing to work WITH Ai, decide your unique niche, then grab that bull by the horns and GO!",
          "score": 1,
          "created_utc": "2026-01-14 05:15:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhuqt6",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-14 06:17:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhuqu1",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qc3jtd/i_got_rich_by_accident_coded_apps_they_blew_up/nzhuqt6/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-14 06:17:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzhx9d6",
          "author": "SilencedObserver",
          "text": "Talent and persistence can overcome connections. Timing and luck help, but it’s doable if you persist.  Applying for jobs becomes your new job.  If you’re that great at programming, it should be easy, and maybe you can solve more application complaints.",
          "score": 1,
          "created_utc": "2026-01-14 06:38:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi6z08",
          "author": "mehdi42087",
          "text": "U have found something important Entrepreneurship \n\nNow u could make the Next step and find AI based failures in Code or so and fix them",
          "score": 1,
          "created_utc": "2026-01-14 08:06:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi8qml",
          "author": "Bulky_Wind_4356",
          "text": "Well, I feel the problem lies in not adapting. \n\nIf you run a business, and a new technology comes out, and you don't stop to think how this could affect your business, you're doing it wrong.\n\nOther than that, connections were always far more valuable than having any sort of skill.",
          "score": 1,
          "created_utc": "2026-01-14 08:23:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziiz8t",
          "author": "srodrigoDev",
          "text": "I think that B2C might be messed up as people would rather faff with ChatGPT for 2h than pay a $5 monthly subscription\n\nBut B2B should still be there. I can't see companies replacing all tools with AI.\n\nBTW what do you think about entertainment? If making SaaS/apps were to die, what about making, say, video games? *Wants* will still be there when *needs* are covered by AI.",
          "score": 1,
          "created_utc": "2026-01-14 10:02:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzisyzq",
          "author": "poroo0",
          "text": "I'm someone that needs good devs to join my team. Maybe we can help each other?",
          "score": 1,
          "created_utc": "2026-01-14 11:30:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkd9ah",
          "author": "ugtsmkd",
          "text": "You just need to find problems business owners are dealing with and solve them. There will always be problems and ai doesn't do context well.  For instance Intuit has alienated a bunch of it's users.\n\nIf your comfortable with big data and migration there's definitely an opportunity in creating a tool to migrate people + historical info from intuit QuickBooks desktop/online to alternatives like zoho etc.",
          "score": 1,
          "created_utc": "2026-01-14 16:41:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkgd2x",
          "author": "Bgmchan15",
          "text": "The market for “UI interfaces” is kind of over I believe but there will be a massive market for outcomes. Kind of like from deterministic (rule based form filling) to non deterministic work (eg, filling a form via an AI agent after calculating what to fill for each field by checking additional submitted docs). Think of it like an evolution, and its chaotic. I think boring operational inefficiencies in mid-sized companies -20-30 employees is a good area - not too big (long sales cycle and enterprise is expensive), or too small (cannot afford). Logistics, staffing, manufacturing. These guys are drowning in manual work which maybe was not possible earlier but parts of it can now be handled by AI agents. People are not even aware what is possible and if you can truly understand their business overheads and low value work and demonstrate via a POC a satisfactory outcome  (eg saved X hours of manual work), small businesses will be happy to avail your services (agents). \n\nFor eg, I worked with a large marketplace in India recently where we deployed a voice ai agent - they needed Indian english accent - to speak with freelancers to verify and do a level 2 screening. Earlier, this was a huge time suck. Once they tested it (paid POC) and ran it, they were happy to deploy it - currently happening in phases - especially after we established benchmarks on cost, accuracy, false negatives, etc. It’s a bit of process - like building trust in the outcome. And having ways to override the AI outcome if needed.\n\nPS - Saying this from experience as an engineer turned product manager turned AI consultant (yeah pivots).",
          "score": 1,
          "created_utc": "2026-01-14 16:55:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzn5clm",
          "author": "palvaran",
          "text": "I think it really comes down to your network. As you are helping others hopefully you are staying connected somehow via something like LinkedIn so that others can see what you are doing and you can showcase your portfolio over time.\n\nIt’s hard out there, but keep going and don’t give up.",
          "score": 1,
          "created_utc": "2026-01-15 00:31:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznd4ke",
          "author": "Rustyshackilford",
          "text": "Like other guy said. Learn to code AI apps. With your knowledge, integrating AI isnt a softball pitch. \n\nAnything that can interpret user intent and cut down on man hours is appreciated.",
          "score": 1,
          "created_utc": "2026-01-15 01:14:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nznn201",
              "author": "dpwdpw",
              "text": "It's much more complex than that.\n\nIf you do make an amazing app that does solve people's problems, you still need to make your way through 8273 other similar vibecoded apps and build trust. Coding a good solution isn't the only issue.",
              "score": 1,
              "created_utc": "2026-01-15 02:12:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzqjk1s",
                  "author": "Rustyshackilford",
                  "text": "Sounds like youve defeated yourself then",
                  "score": 2,
                  "created_utc": "2026-01-15 14:54:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nznph6j",
          "author": "distortd6",
          "text": "How did you acquire clients? I have a degree in SE but never put it to use. I haven't coded a full project since school 10 years ago but I work in technical integrations and AI can handle the majority of my code now.\nI think I'd be a similar asset to local small businesses and could provide a large amount of value to them, just dint know how to approach them.",
          "score": 1,
          "created_utc": "2026-01-15 02:26:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzny47l",
              "author": "dpwdpw",
              "text": "posting daily on Instagram/YouTube, after a few months they started coming in.",
              "score": 2,
              "created_utc": "2026-01-15 03:17:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzoc2uu",
          "author": "Every-Lake-1787",
          "text": "Being someone with good network/connections is way more valuable than anything else and always has been. \n\nFTFY",
          "score": 1,
          "created_utc": "2026-01-15 04:48:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzojytk",
          "author": "SaunaApprentice",
          "text": "Back to figuring shit out and getting it done. It’s not more complicated than that.",
          "score": 1,
          "created_utc": "2026-01-15 05:46:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpjyye",
          "author": "dragonflyinvest",
          "text": "Are you rich enough not to trade time for money, but to instead let your money do the work for you?",
          "score": 1,
          "created_utc": "2026-01-15 11:13:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqgfn6",
              "author": "dpwdpw",
              "text": "realistically speaking, I don't see how that's possible. On the internet everything is possible (invest x in stocks y and you'll have passive income), in reality it's not like that. I have worked with many people trying a lot of things, ive seen up close what does and does not work.\n\ninvesting is good for your future, but it won't make you Rich",
              "score": 1,
              "created_utc": "2026-01-15 14:39:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzqxu5j",
                  "author": "dragonflyinvest",
                  "text": "I asked because you posted that you “got rich by accident”. But cool.",
                  "score": 1,
                  "created_utc": "2026-01-15 16:01:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzppqkd",
          "author": "dontknowme99",
          "text": "Would you be interested in giving me your input on an idea I have? If so, DM me… I’d appreciate it.",
          "score": 1,
          "created_utc": "2026-01-15 12:00:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt0jvj",
          "author": "weeluc",
          "text": "Hey man, I have an awesome project pretty much ready to go, all back end is done we just need the front end (design is ready on figma). Its marketing/shopify related. If you would like to connect hit me up. I have been a bootstrapped founder for 15 years with a couple of good exits",
          "score": 1,
          "created_utc": "2026-01-15 21:40:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyddja",
          "author": "znv142",
          "text": "Can you guys build an extension that lets you get rid of AI slop on Linkedin, YouTube, etc? I'd pay top dollar as a user! : )",
          "score": 1,
          "created_utc": "2026-01-16 17:20:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzh41f",
          "author": "Big-Watercress-9943",
          "text": "Many also sell fragments of solutions instead of solving whole problems and we need to slowly start shifting from “model‑centric” to problem‑centric thinking, otherwise we will all miserably fail.\n\nWe are happy to collaborate or create a working group if needed",
          "score": 1,
          "created_utc": "2026-01-16 20:18:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05h31x",
          "author": "Crazy_Signal4298",
          "text": "Your value is not all coding.   You can spot a problem and produce a solution.    That is basic value in a business.",
          "score": 1,
          "created_utc": "2026-01-17 18:49:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06lxif",
          "author": "todays_dumbest",
          "text": "How did you find about about your customers complaining when you started off?",
          "score": 1,
          "created_utc": "2026-01-17 22:12:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ea7iw",
          "author": "mehmetreddit",
          "text": "I hope you invested the money that you made in the mean time. That should have given you some cushion.\n\nI feel like you could do a lot better than new vibe coders with your experience. I think vibe coders should be concerned haha",
          "score": 1,
          "created_utc": "2026-01-19 01:22:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzflk5o",
          "author": "achintyabhavaraju",
          "text": "AI is ruining alot! I'm secretly anticipating for the bubble to burst. Just tired of all the uncertainty",
          "score": 1,
          "created_utc": "2026-01-13 22:15:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfqyay",
              "author": "Relative-Tourist8475",
              "text": "AI can’t burst. It’s a paradigm shift. It is there, will remain there, and keep being used more and more.",
              "score": 11,
              "created_utc": "2026-01-13 22:42:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzfszra",
                  "author": "mizmaclean",
                  "text": "Yes. It’s like the internet. The internet can’t burst. There was the dot com bubble, and there is definitely something to be gleaned there.",
                  "score": 5,
                  "created_utc": "2026-01-13 22:52:30",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzg0wzc",
                  "author": "Low-Ad-8828",
                  "text": "This is correct. The bubble that will burst is the market. the paradigm shift has happened already (until the next one). AI is not going away.",
                  "score": 4,
                  "created_utc": "2026-01-13 23:34:27",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzgdm2z",
                  "author": "redcoatwright",
                  "text": "Yeah the AI bubble bursting does not mean AI \"goes away\" it means the insane valuations some of these AI companies are commanding will deflate rapidly and a ton.",
                  "score": 2,
                  "created_utc": "2026-01-14 00:42:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzfoc88",
              "author": "dpwdpw",
              "text": "How exactly would the burst look like and how would it positively impact us, ordinary citizens?",
              "score": 1,
              "created_utc": "2026-01-13 22:29:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzhyrf7",
                  "author": "BiscottiBusiness9308",
                  "text": "Probably not positively - at least from an access lens. Currently we get access for almost free to frontier tools that are incredibly expensive to develop and need huge infra to run. If the big labs stop their race, i imagine that rather prices go up due to consolidation and/or development stagnates. What do you think?",
                  "score": 1,
                  "created_utc": "2026-01-14 06:51:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzfpk1o",
          "author": "RealAnthonyCamp",
          "text": "I’m confused by the rich part. Isn’t $200/day equal to $73K per year?",
          "score": 0,
          "created_utc": "2026-01-13 22:35:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfur61",
              "author": "Ryuma666",
              "text": "There are countless cities in the world (outside world?) where people can easily retire with 2-300k.",
              "score": 3,
              "created_utc": "2026-01-13 23:01:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzgu5od",
                  "author": "[deleted]",
                  "text": "that doesnt make them rich",
                  "score": -2,
                  "created_utc": "2026-01-14 02:16:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzfptne",
              "author": "dpwdpw",
              "text": "that wasn't my only source of income, I was doing coding projects as well.\n\npeople would use my apps, get to know me and then hire. It only brought pros",
              "score": 1,
              "created_utc": "2026-01-13 22:36:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfsteq",
          "author": "swealteringleague",
          "text": "You’re still valuable because AI coding sucks right now and you need talented programmers to use it correctly. It’s just instead of needing 100 you can do the same work with 10. So supply/demand has shifted heavily over the last few years.\n\nHit up these smaller projects that are in need like Hyros etc, or use your skills to make your own apps like Base44 Stacker etc.",
          "score": -2,
          "created_utc": "2026-01-13 22:51:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzftasw",
              "author": "dpwdpw",
              "text": "Realistically I don't think so. I sent over 3000 emails (some to previous customers, some very well crafted cold emails - I landed many clients through cold email in the past, so I'm somewhat \"skilled\" at it), with no positive responses.\n\nThere's just no need for a dev right now, with the exception of big companies with very specific needs.",
              "score": 1,
              "created_utc": "2026-01-13 22:54:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qha3pc",
      "title": "Faceseek helps brands get noticed without loud ads",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qha3pc/faceseek_helps_brands_get_noticed_without_loud_ads/",
      "author": "AccountEngineer",
      "created_utc": "2026-01-19 17:12:00",
      "score": 53,
      "num_comments": 2,
      "upvote_ratio": 0.83,
      "text": "Finding attention online is hard when everyone is shouting. \n\nFaceseek feels different because it focuses on discovery instead of forcing ads everywhere.\n\nI tried it while testing a small project and noticed more genuine interest compared to normal promo posts. The setup is simple and doesn’t waste time. It’s useful for founders who want visibility but still want things to feel natural. \n\nFaceseek works well if you prefer slow, real growth instead of fake hype.",
      "is_original_content": false,
      "link_flair_text": "Resources & Tools",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qha3pc/faceseek_helps_brands_get_noticed_without_loud_ads/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0kd3lx",
          "author": "aVarangian",
          "text": "This is literally written like an ad. And is AI-written slop. 50 upvotes but 0 comments. Eff off.",
          "score": 1,
          "created_utc": "2026-01-19 23:01:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m2tt4",
          "author": "Rustyshackilford",
          "text": "Tell us, what is it? How does it work?",
          "score": 1,
          "created_utc": "2026-01-20 04:44:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfkjip",
      "title": "I studied 47 SaaS products that went from $0 to $10k MRR last year. Here's what they all did right.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qfkjip/i_studied_47_saas_products_that_went_from_0_to/",
      "author": "whyismail",
      "created_utc": "2026-01-17 18:17:45",
      "score": 31,
      "num_comments": 8,
      "upvote_ratio": 0.9,
      "text": "Hey, I went into SaaS last year with my tool Brandled (helps founders grow on X & LinkedIn) in a pretty competitive space with $0 and 0 audience and ended up wasting six months straight on the wrong things.\n\nSpent half a year stuck at $0 MRR.\n\nThen I became obsessed with one question: what separates SaaS products that make it from those that die at zero.\n\nSo I went down a rabbit hole. Studied 47 founders who went from $0 to $10k+ MRR in the last year. Watched their podcasts, red their tweets, and everything i could get my hands on.\n\nHere's what I learned from all of them, and what I was doing catastrophically wrong.\n\n**1. Frictionless signup isn't optional**\n\nEvery successful product had one-click social login. Google OAuth mostly.\n\nThe ones that died had email verification flows, password requirements, multi-step forms asking questions before showing any value.\n\nThe math is brutal. If you lose 30% of people at signup and you're getting 1000 visitors a month, that's 300 potential customers gone. At a 10% trial-to-paid conversion, that's 30 paying customers per month lost to signup friction alone.\n\nI started with magic link only. Completion rate was 45%. Added Google login. Jumped to 78% the next day.\n\nEvery percentage point of friction at signup costs you real revenue. Most founders don't even measure this.\n\n**2. They launched in weeks, not months**\n\nNone of them spent 6 months building in secret.\n\nAverage time from idea to first paying customer: 3-6 weeks. They launched with ONE core feature. Then spent most of their time marketing it.\n\nI did the opposite. Spent 3 months building features before launching. Content generation, analytics, scheduling, competitor tracking, everything. Got 12 signups. Zero paying customers.\n\nConvinced myself the product wasn't good enough. Spent another month adding features. Still nothing.\n\nThe problem wasn't my product. Nobody knew it existed.\n\nAfter I stopped building and started marketing, posting on Reddit, doing LinkedIn outreach, documenting on X, I hit $126 MRR in 4 days.\n\nSame product. Different approach.\n\nPost-launch is 90% marketing, 10% product.\n\n**3. They were shameless about promotion**\n\nThe successful ones talked about their product everywhere. Not spammy. Just never hiding it.\n\nReddit threads. Twitter replies. Forum comments. Anywhere their audience hung out.\n\nThey'd give genuinely helpful advice first, then naturally mention their tool when relevant.\n\nStarted being shameless. Every relevant conversation where someone complained about the problem I solved, I'd help them first, then mention I built something for this.\n\nA few people definitely get mad but I feel the upside is worth it.\n\nYour product won't discover itself.\n\n**4. They asked churned users what went wrong**\n\nEvery successful product had a system for this. Automated email going out when someone cancels asking what didn't work.\n\nI was doing none of this. Saw cancellations in Stripe, felt rejected, moved on. Never asked why. Never learned anything.\n\nNow every cancelled user gets emails through and automated email sequence and the replies are done by me personally.\n\nResponse rate is 40%. The feedback is literally gold.\n\nEvery single one is fixable. But I only learned because I asked.\n\nChurned users tell you the real truth about your product.\n\n**5. They used their own product religiously**\n\nNot one successful founder was building something they didn't use daily. They were their own heaviest users.\n\nI wasn't doing this. Used my tool occasionally to \"test\" but wasn't relying on it daily.\n\nForced myself to create all my content through my own product for a week. Found 7 bugs in 30 minutes that never showed up in testing.\n\nGenerate button didn't work on mobile. Analytics took 8 seconds to load. Onboarding skipped steps if you refreshed.\n\nMy users were experiencing this and not telling me. They were just leaving.\n\nIf you're not using your product daily as a real user, you're building blind.\n\n**6. They fixed retention before scaling acquisition**\n\nBiggest strategic difference.\n\nFailed products: 30-50% monthly churn, constantly chasing new users to replace ones leaving.\n\nSuccessful products: Fixed retention first, got churn to 10-20%, then scaled acquisition.\n\nThe math: At 40% churn, you acquire 40 customers to net 24. At 15% churn, you acquire 40 and net 34. Same effort, 42% better results.\n\nI was obsessed with new signups. Ignored my 40% churn rate. Got 10 new customers, lost 4. Net: 6.\n\nStopped all acquisition. Fixed onboarding from 8 steps to 3. Added email sequences. Built features retained users asked for. Churn dropped to 15%.\n\nSame acquisition effort, now net 8-9 customers instead of 6.\n\nRetention is the foundation. Acquisition is the multiplier.\n\n**7. They shipped MVPs with one feature**\n\nEvery successful product launched stupidly lean. One core feature done exceptionally well.\n\nI launched with 7 features: content generation, analytics, scheduling, competitor tracking, SWOT, comments, hashtags.\n\nCodebase was a nightmare. Users were confused. I was maintaining features 3% of users touched.\n\nShould've launched with one thing: AI content that sounds human. Made that 10x better. Everything else later based on what paying customers asked for.\n\nYour MVP should make people say \"this solves my exact problem\" even if ugly and missing features.\n\nNot \"wow, so many features\" while solving nothing particularly well.\n\n**8. They priced based on value, not competition**\n\nNone of them raced to the bottom on pricing.\n\nThey looked at the value delivered. Hours saved. Revenue generated. Pain eliminated.\n\nThen priced a fraction of that value.\n\nI priced at $19/month because competitors were at $29-39. Thought I'd win on price. Just looked cheap and inferior.\n\nNeeded 263 customers to hit $5k MRR at $19 versus only 128 at $39.\n\nRaised price to $29-39. Conversions didn't drop. They improved slightly.\n\nHigher price signaled solving a valuable problem.\n\nPeople who care about $10 differences aren't your best customers. They'll churn for anything $3 cheaper.\n\n**9. They automated relationship building**\n\nEvery successful product had email sequences from day one. Not promotional. Actual value and engagement.\n\nWelcome emails. Feature education. Check-ins. Re-engagement for quiet users. Win-back for churned users.\n\nI was sending nothing after signup. Users signed up, got busy, forgot, churned.\n\nEngagement doesn't happen by accident. You engineer it.\n\n**10. They validated with money, not words**\n\nThe problem with feedback: it's free. People say nice things because it costs them nothing.\n\nI built features based on \"that would be helpful\" comments from users who weren't even paying. Wasted weeks on features nobody used.\n\nNow I only build what paying customers explicitly request.\n\nMoney is the only validation that matters. Words are cheap. Credit card numbers are truth.\n\n**The one thing they all had**\n\nThey didn't quit when it felt hopeless.\n\nThey all hit $0 for months. Got depressed. Questioned everything. Wanted to shut it down.\n\nBut didn't.\n\nThe difference between $0 and success wasn't talent or luck. It was not quitting before they figured out what works.\n\n90% of SaaS products die not because they couldn't work. Because the founder quit too early.\n\nIf you're stuck at $0, study the people who've made it. Not the outliers. The normal founders who went from $0 to $10k.\n\nThey're not special. They just did specific things that compound and didn't quit when it got hard.\n\nThe playbook is right there. You just have to execute it.\n\nHappy to answer questions or go deeper on any of this.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qfkjip/i_studied_47_saas_products_that_went_from_0_to/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0a5d34",
          "author": "GnirobSW",
          "text": "7. Can you give some examples of the one feature SaaS that were successful?",
          "score": 1,
          "created_utc": "2026-01-18 12:39:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fkv4e",
              "author": "Local-Employ9800",
              "text": "The one-feature hits I’ve seen: Fathom (simple privacy analytics), Tally (dead-easy forms), Bannerbear (auto image/video generation), and Cron back in the day (calendar). I use Fathom and Tally, and Pulse alongside Ahrefs and SparkToro just for Reddit discovery and copy ideas.",
              "score": 2,
              "created_utc": "2026-01-19 06:11:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0cyc8c",
          "author": "viclnnk",
          "text": "Also feedback gathering inside a product. Users are willing to share, but it’s difficult to find an email, write one, etc. Just a simple “Send feedback” and a pop-up after clicking.",
          "score": 1,
          "created_utc": "2026-01-18 21:16:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0i5nx3",
          "author": "Frequent-Tennis-6914",
          "text": "The retention point is the real game. I’d push it one step earlier though.\n\nSignup is not the goal. Activation is. Retention is the result.\n\nA lot of people have decent traffic but their activation is weak, so churn looks like the problem when onboarding is actually the problem.\n\nWhat change made the biggest difference for your churn drop? Shorter onboarding, better first result, or better reminders?",
          "score": 1,
          "created_utc": "2026-01-19 16:51:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mn3ek",
          "author": "MORPHOICES",
          "text": "I, too, have seen something that corroborates this painfully. \\~\n\nThe biggest thing I’d underline from your list is that most founders over-index on “building more” when the real leverage is “removing friction + talking to users”.\n\nSpecifically before. \n\nTwo things that I gleaned from my experience.\n\n1. Friction develops quicker than you may expect.\n\nPeople can stress really little details but don’t \\*feel\\* how brutal a small friction is until they see real users.\n\nEvery added click, delay, or decision quietly disqualifies people who would have paid.\n\n2. Users that quit are the best sources of feedback.\n\nActive users is a good host. Churned users are frank.\n\nWhen I overlooked churn feedback due to “not my ICP,” it came back to bite me every time.\n\nI'm also fully on board with retention. I've seen teams throw money at growth only to discover they were just leaking the bucket faster.\n\nDid you notice 47 products curious?\n\n\\* A common retention metric founders obsessed over early?\n\n\\* Was it the case that it was more qualitative than numeric?\n\nNice analysis. First-time founders should ensure reading this.",
          "score": 1,
          "created_utc": "2026-01-20 07:20:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05qnfr",
          "author": "AnonJian",
          "text": "Certainly sounds good, but you assume those who fail had a choice. Build It And They Will Come is a blind launch. And yeah, when you are trying to hit a user market-blind, you will be flinging features right and left in desperation.\n\nMinimalism doesn't mean crippleware, it means building from a definitive key insight about the target customer. You can't do that if you consider launch the perfect time to go looking for the user. People don't post asking where to find the first hundred users because they understand the user, quite the opposite.\n\nPeople are using features just like shotgun pellets are used by a poor marksman. Where the analogy breaks down is a marksman doesn't tightly and deliberately shut his eyes before pulling the trigger, shotgun or sniper rifle. \n\nThis happened to you because you flatly rejected the advice. This happens to everyone else because they turn their back on Lean Startup methodology and, yes, Minimum Viable Product. Post anything, everyday, nothing ever changes.",
          "score": 1,
          "created_utc": "2026-01-17 19:34:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08kefn",
          "author": "dafuqherby",
          "text": "Thank you so much for sharing! I took note of a lot of what you said. I am pretty sure that every topic you talked about will be worth paying attention to.\nMay I ask you where do you usually find content about those founders? I fell like following some of them for inspiration.",
          "score": 0,
          "created_utc": "2026-01-18 04:34:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09hxii",
          "author": "Training-Dinner1660",
          "text": "Muy buen análisis. El único matiz que añadiría es el **sesgo del superviviente**: muchos hicieron exactamente esto y aun así no llegaron (👆🏼 el primero)\n\nLo valioso aquí no es la checklist, sino normalizar lo largo y mentalmente duro que es quedarse en $0 durante meses antes de que algo empiece a moverse 😅",
          "score": 0,
          "created_utc": "2026-01-18 09:11:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcb5wj",
      "title": "Competitor raised $81M, I’ve raised $81. Am I wasting my time?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qcb5wj/competitor_raised_81m_ive_raised_81_am_i_wasting/",
      "author": "Vanilla-Green",
      "created_utc": "2026-01-14 02:26:27",
      "score": 29,
      "num_comments": 56,
      "upvote_ratio": 0.81,
      "text": "I built a tiny Android voice keyboard in a week with the same functionality as my competitor. Unlike basic voice typing that simply transcribes what you say, my app understands you. It filters out filler words (like “um” and “uh”), fixes grammar, and formats your sentences instantly in every app. Super early.\n\nCurrent stats:\n\t•\tapp is live\n\t•\t~25 installs\n\t•\tzero real users\n\t•\ttotal spend: about $81\n\nMeanwhile a competitor in this space (Wispr Flow) raised $81M. Not a typo.\n\nTrying to figure out what this actually is:\n- a real startup worth grinding on or just a neat feature that I’ll never be VC-backed\n\nCouple quick questions:\n- would you invest in something like this? yes or no\n- is it obviously way too early to think about raising?\n- what would need to happen before this is even “fundable”?\n\nNot promoting, genuinely deciding whether to double down or move on.\n\nBrutal honesty welcome.\n",
      "is_original_content": false,
      "link_flair_text": "Idea Validation",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qcb5wj/competitor_raised_81m_ive_raised_81_am_i_wasting/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzh1zjz",
          "author": "SenorTeddy",
          "text": "Don't think in terms of product/features, think in terms of business, logistics, partnerships, etc. $81M wouldn't go to an app that could be built in a week and there are gaps in what you know about your competitor. From their site:\n\n    SOC 2 Type II and ISO 27001 compliance\n    Enforced HIPAA compliance\n    Enforced Privacy Mode (Zero Data Retention)\n    SSO / SAML\n    Advanced usage dashboards\n\nHave a plan on how to make money with your app, and then prove it with examples(I did this ad, spent this much, got this many installs, this is my convert %).",
          "score": 19,
          "created_utc": "2026-01-14 03:00:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhkzr1",
              "author": "el_pezz",
              "text": "Investors know OP used Claude 😅",
              "score": 3,
              "created_utc": "2026-01-14 05:02:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzpbzbu",
              "author": "OfficiallyThePeter",
              "text": "100% ... what biz pitch to investors are 5\\~10 year plan to 10x investments. \n\nSo - how are you going to make that revenue? Its not about your hackathon results, its about growth, performance, conversions and revenue!",
              "score": 1,
              "created_utc": "2026-01-15 10:01:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzvd2mi",
              "author": "Substantial-Suit-597",
              "text": "That HIPAA compliance and zero data retention is GOLD! That’s likely what closed the investment.",
              "score": 1,
              "created_utc": "2026-01-16 05:33:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzh2he2",
              "author": "Vanilla-Green",
              "text": "That’s true, I don’t know how to target enterprise tho never marketed to them not sure how to",
              "score": -5,
              "created_utc": "2026-01-14 03:03:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzher8k",
                  "author": "candleinthewind1997",
                  "text": "If they're HIPAA compliant, that's huge and that's something you can't do on your own. Medical privacy laws are very strict and one mistake can be a $$$ lawsuit. I can see why the competitor app would raise so much. A lot of medical apps/programs are buggy trash and we can't just like...text patient info.",
                  "score": 9,
                  "created_utc": "2026-01-14 04:19:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzh8k7h",
                  "author": "SenorTeddy",
                  "text": "If you want to go that route try researching it",
                  "score": 1,
                  "created_utc": "2026-01-14 03:39:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzhpree",
                  "author": "Difficult_Ad2864",
                  "text": "Do they have a deck or any information that might clue you in on crunchbase or any other tech sites? Study their tech and their sites, and try to see if you can figure companies that they’re selling to. \n\nIf they’re selling for a price, undercut them for example. If you have to, try to hire someone with experience specific to what you’re doing in B2B tech sales.",
                  "score": 1,
                  "created_utc": "2026-01-14 05:37:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzh1a0e",
          "author": "ConsciousLeader9448",
          "text": "You’re not gonna outmarket or out-quality a competitor that huge. And if your product is too similar, you’re just gonna live in their shadow. But if it has a defining feature that Wispr Flow doesn’t, you should be laser focused on marketing and exploiting that. And if you see enough interest, you can start thinking about raising more money",
          "score": 7,
          "created_utc": "2026-01-14 02:56:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzh1v3t",
              "author": "Vanilla-Green",
              "text": "Yes I was thinking of one, but they can copy the feature easily",
              "score": 2,
              "created_utc": "2026-01-14 02:59:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzh52m9",
                  "author": "Character-Role-600",
                  "text": "You need to get that out in the market. This massive company is probably not following your every move",
                  "score": 6,
                  "created_utc": "2026-01-14 03:18:40",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o086wt0",
                  "author": "NeedleworkerNo4900",
                  "text": "Then you don’t have a product.",
                  "score": 1,
                  "created_utc": "2026-01-18 03:12:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzhjf2x",
          "author": "Sketaverse",
          "text": "Go get a billion TikTok views and you’ll be there too",
          "score": 6,
          "created_utc": "2026-01-14 04:50:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhjhib",
              "author": "Vanilla-Green",
              "text": "But what content to post to get billion views",
              "score": 0,
              "created_utc": "2026-01-14 04:51:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzhxb91",
                  "author": "Sketaverse",
                  "text": "There’s a massive write up of it with a full breakdown",
                  "score": 2,
                  "created_utc": "2026-01-14 06:39:06",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzhnzkk",
                  "author": "SmartSasshole",
                  "text": "You can hire contract social media/ marketing managers to get you started. If you can't invest in outsourcing, watch how your competitors are reaching your target audience. \n\nYou don't want to copy them. You want to be inspired and observe how your market feels about the problem you're solving. Emotions drive a lot of purchases.",
                  "score": 1,
                  "created_utc": "2026-01-14 05:23:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzhn91e",
          "author": "kubrador",
          "text": "the $81M competitor thing is irrelevant. they raised that money to figure out if this market exists. you get to watch them spend it and learn for free.\n\nreal question: do your 25 installs include anyone who opened it twice? that's your answer. not \"is this fundable\" but \"does anyone actually want this\"\n\nyou built it in a week which means the app isn't your moat anyway. if this works, you win on distribution or some niche they're ignoring (accessibility? specific language? enterprise compliance?)\n\ndon't raise money. get 50 people using it daily first. that's like 2 months of work max to know if you're onto something.",
          "score": 5,
          "created_utc": "2026-01-14 05:18:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhq1pa",
              "author": "Difficult_Ad2864",
              "text": "They also set the market price",
              "score": 2,
              "created_utc": "2026-01-14 05:39:48",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzhol7p",
              "author": "Vanilla-Green",
              "text": "True agreed thank you trying out find out way to reach and sell to actual users",
              "score": 1,
              "created_utc": "2026-01-14 05:28:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzjoo1d",
          "author": "chibstelford",
          "text": "As a daily user of Wispr Flow, I downloaded your app and gave it a shot. It's not bad and the speech to text recognition is pretty good. Not 100% of what Wispr Flow offers, but somewhat close.\n\nThe biggest downside for me is I very much like my existing keyboard, and don't want to replace it with the very lo-fi one that your app contains. Your app would be much more adoptable if I could keep my existing keyboard and your transcription button was just an add-on to that.\n\nJust my 2c",
          "score": 4,
          "created_utc": "2026-01-14 14:46:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzjt33t",
              "author": "Vanilla-Green",
              "text": "Makes sense but our goal is for you to replace the keyboard permanently but I get where you are coming from",
              "score": 1,
              "created_utc": "2026-01-14 15:09:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nznf7iy",
                  "author": "chibstelford",
                  "text": "Sure... Best of luck!",
                  "score": 3,
                  "created_utc": "2026-01-15 01:26:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzhp1pb",
          "author": "Difficult_Ad2864",
          "text": "Happens a ton in my industry for my startup. On average, founders raise something like $30m+ off the bat. I couldn’t raise $1. I ended up investing myself. Without spending money I don’t have, I spent a year ingraining myself to become an industry expert. I realized that my COGS, with everything, was “only” $13,700 not including $200k manufacturing costs. I used my own money instead. \n\nThe same investors who rejected me are now confused as to how I managed to get everything up and running. Two of them have had to write off their investments. \n\nI know that, once I start scaling nationwide, I can go back to them, or possibly not even need external investors. I still haven’t paid myself anything in two years. It’s definitely a grind. Based on my experience, I wouldn’t invest this soon. Invest your own funds first, but you need to find a way to bootstrap and be efficient. It’s too early for external partners unless you have a product that is just THAT special and industry-changing. Invest in yourself instead for now. To be “fundable,” you need to show a good value proposition. What makes you stand out from the competition? Why should consumers buy your product? What’s your profit margin? There are also other factors that could be industry specific. For example, one investor that’s interested in my company right now told me yesterday that, “I want to see your product sold at this specific place that I like”",
          "score": 3,
          "created_utc": "2026-01-14 05:32:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzn5pby",
          "author": "Crowley-Barns",
          "text": "Did you check out Willow’s recent funding round?! $150m I think. \n\n(Willow do the same thing as Whisprflow and presumably OP.)\n\nIt’s nuts.",
          "score": 2,
          "created_utc": "2026-01-15 00:33:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzno8h2",
              "author": "Vanilla-Green",
              "text": "Crazy you know why",
              "score": 1,
              "created_utc": "2026-01-15 02:18:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nznohws",
                  "author": "Vanilla-Green",
                  "text": "Says 4.2 m tho",
                  "score": 1,
                  "created_utc": "2026-01-15 02:20:29",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzon3s7",
          "author": "mindpuzzleintern",
          "text": "What is the name of the app? And are you interested in growing that \nLet's jam onto that",
          "score": 2,
          "created_utc": "2026-01-15 06:11:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzonjnf",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-15 06:15:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzonjoj",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qcb5wj/competitor_raised_81m_ive_raised_81_am_i_wasting/nzonjnf/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-15 06:15:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzonkx1",
              "author": "Vanilla-Green",
              "text": "Yes it’s called Zavi",
              "score": 1,
              "created_utc": "2026-01-15 06:15:35",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nzoobuh",
              "author": "Vanilla-Green",
              "text": "You can check my profile it’s Zavi",
              "score": 1,
              "created_utc": "2026-01-15 06:21:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzoxeqz",
          "author": "HeadLingonberry7881",
          "text": "The competitor isn't on Android. What is your playstore link to test the app anf give you a feedback?",
          "score": 2,
          "created_utc": "2026-01-15 07:41:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzoxs3i",
              "author": "Vanilla-Green",
              "text": "It’s called Zavi, link is there on my profile",
              "score": 1,
              "created_utc": "2026-01-15 07:44:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nztaw8n",
          "author": "PanderBaby80085",
          "text": "I have a bit of experience that is relevant to your situation. I can’t say too much on here but I will DM you.",
          "score": 2,
          "created_utc": "2026-01-15 22:29:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzum2k7",
              "author": "Vanilla-Green",
              "text": "Great thanks",
              "score": 1,
              "created_utc": "2026-01-16 02:45:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o009x7h",
          "author": "snowboardlasers",
          "text": "It's not what you know or what you can do, it's who you know.",
          "score": 2,
          "created_utc": "2026-01-16 22:36:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01uaj3",
          "author": "OrganizationOne8338",
          "text": "You would have used an existing model while your competitor might have built a model , it’s the IP they own which is giving it such high valuation.",
          "score": 2,
          "created_utc": "2026-01-17 04:17:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07dpbc",
          "author": "GaryARefuge",
          "text": "There is so much wrong with how you are going about this and thinking about this.\n\nThere is so much horrible advice in here.\n\nYou are skipping about 1,000 critical steps and making erroneous comparisons to far more established and mature companies.  You're worried about things that you can't even begin to answer at the stage you are at currently.\n\n>a real startup worth grinding on or just a neat feature that I’ll never be VC-backed\n\nDon't be an idiot. Don't grind. Be patient. Be calculated. Be controlled. Work on this slowly and steadily within healthy boundaries that prioritize other aspects of your life and well-being. Don't fall into toxic bullshit that people in these communities push endlessly about going all in and rushing.\n\nYou need to focus on basic validation tests to see if what you built is something people want, enjoy using, benefit from, and find value in.\n\nYOU HAVE NO USERS. You have no revenue. YOU HAVE NO VALIDATION. You are still sitting on a huge mountain of assumptions.\n\nLearn *Lean Methodology*. Read the book, *Traction*.  \n\nYou clearly have no idea what you are doing, and you need to spend more time learning the basics.\n\nYou need to get your first customer. Then, enough customers to have a viable, sustainable business. Then, you can start to explore whether or not this could qualify as a VC-backed startup business. \n\n>would you invest in something like this? yes or no\n\nHell no. \n\nNo product validation. No operational validation.\n\n**There are three core types of validation that you need to achieve:**\n\n**Market Validation:** Validating that a market for your product/service exists and it is large enough to sustain your success \n\n**Product Validation:** Validating that the market wants your product, that they are willing to pay for it, that they enjoy it enough to continue using it, and that they enjoy it enough to tell others to use it \n\n**Operational Validation:** Validating that you and your team are capable of growing and running a successful company\n\nYou have no users. No customers. No revenue. No traction. Nothing. Only assumptions.",
          "score": 2,
          "created_utc": "2026-01-18 00:35:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07e25y",
          "author": "GaryARefuge",
          "text": ">is it obviously way too early to think about raising?\n\nYes. Obviously.  Why would any legitimate investor give you money? This is an insanely risky deal with no demonstrated upside at all.  You have nothing to demonstrate that you know what you are doing, know how to build a product people want, pay for, and love, know how to operate a successful business, know how to scale a business with investment capital, or anything else.\n\n>what would need to happen before this is even “fundable”?\n\n• Past successes (of any size) outside of this current startup\n\n• Existing Relationships\n\n• Experience (relevant most of all)\n\n• Expertise (relevant most of all)\n\n• Demonstrable Aptitude\n\n• Demonstrable Perseverance\n\n• Demonstrable Leadership\n\n• Demonstrable Strategic Decision Making\n\n• Demonstrable Fluidity\n\n• Demonstrable Communication Skills\n\n• Traction with this current startup\n\n• Product Performance and Scalability\n\n• Existing Patents, Copyrights, Trademarks\n\n• Product Validation with this current startup\n\n• Revenue from this current startup and the rest of your financials\n\n• Your cap table\n\n• Potential Scalability and Market Opportunity\n\n• Synergies with the investor's expertise, interests, experience, other portfolio companies\n\n• The Relationship you have with the investor\n\n• Likelihood of you being able to achieve success\n\nThis essentially equates to your Quality of Character & the Quality of the Deal. What exactly do you have to persuade an investor that you are worth taking a gamble on?  Not much from what you've shared.\n\nSo, focus on changing that before you try raising capital from investors.\n\nBut don't rush to do that either. You don't need to raise capital from investors to build a successful company.   In fact, far too many founders rush to raise, and it is a huge mistake for a variety of reasons.",
          "score": 2,
          "created_utc": "2026-01-18 00:37:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09fhcl",
          "author": "melchisiade",
          "text": "They got investor's Money because they probably have a business Plan, a structure, a marketed product and pitches to show around.",
          "score": 2,
          "created_utc": "2026-01-18 08:49:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dpzka",
          "author": "Ok_Tank_1421",
          "text": "I've been wanting wispr flow for android please dm me a link hahah",
          "score": 2,
          "created_utc": "2026-01-18 23:33:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0e5zxd",
              "author": "Vanilla-Green",
              "text": "Sent you",
              "score": 1,
              "created_utc": "2026-01-19 00:58:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzhewpt",
          "author": "xatey93152",
          "text": "What is the name of your app?",
          "score": 1,
          "created_utc": "2026-01-14 04:20:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhf16z",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-14 04:20:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzhf190",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qcb5wj/competitor_raised_81m_ive_raised_81_am_i_wasting/nzhf16z/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-14 04:20:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzhf4e3",
              "author": "Vanilla-Green",
              "text": "You can check on my profile it’s Zavi",
              "score": 1,
              "created_utc": "2026-01-14 04:21:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzhvuja",
          "author": "alp82",
          "text": "Didn't see the M and was utterly confused",
          "score": 1,
          "created_utc": "2026-01-14 06:26:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhw85k",
          "author": "Vanilla-Green",
          "text": "Ahaha",
          "score": 1,
          "created_utc": "2026-01-14 06:29:46",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o07sgow",
          "author": "gujuvenile",
          "text": "I use whispr flow. It's magical",
          "score": 1,
          "created_utc": "2026-01-18 01:53:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o086rgm",
              "author": "Vanilla-Green",
              "text": "Do try us",
              "score": 1,
              "created_utc": "2026-01-18 03:12:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qga9gm",
      "title": "What tools are genuinely helpful for your business?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/",
      "author": "OddInititi",
      "created_utc": "2026-01-18 14:40:47",
      "score": 26,
      "num_comments": 66,
      "upvote_ratio": 1.0,
      "text": "Would like to pick your brain on what actually worked. There are many hype out there so would like to hear the true stories - whether it's popular or not. Thank you\n\nFor context, here's what I'm already using frequently:\n\n\\- Google Sheets for tracking, CRM; Canva for marketing assets\n\n\\- ChatGPT for general topics (looking at Gemini now, hope it will have folders soon) ; Grammarly: just to fix my writing; Saner: to manage my tasks\n\n\\- Fireflies, Lovable, Manus, Lemlist: Not daily yet but I use these quite often on a weekly basis",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0aqtva",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 4,
          "created_utc": "2026-01-18 14:52:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0caawu",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0aqtva/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-18 19:16:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0b1ls0",
          "author": "Any_Spell_5716",
          "text": "This is a pretty comprehensive list. Recently though I’ve found myself moving more towards Claude than ChatGPT, maybe I’m imagining it but it seems better for keeping context in long detailed conversations?",
          "score": 5,
          "created_utc": "2026-01-18 15:46:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0bb4kl",
              "author": "mercyroofing",
              "text": "Yeah Claude is the go-to for me for 6 weeks (planning, triage, sound boarding) switched over from Grok",
              "score": 1,
              "created_utc": "2026-01-18 16:31:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0cxla0",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxld3",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxla0/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:12:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0fsdb4",
              "author": "LowpolyApe",
              "text": "Claude is absolutely the way to go. I have a feeling GPT is moving backward with each new update, and Claude is just great all around, from problem-solving to planning.",
              "score": 1,
              "created_utc": "2026-01-19 07:13:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0llz78",
                  "author": "Any_Spell_5716",
                  "text": "The only problem is the much lower limits on messaging in free tier, specially when trying to use it for building. Have you committed to the paid tier yet? Is it worth it?",
                  "score": 1,
                  "created_utc": "2026-01-20 03:05:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0at4po",
          "author": "InterYuG1oCard",
          "text": "Solid stack, I use the tools above and clay to find my leads info",
          "score": 1,
          "created_utc": "2026-01-18 15:04:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0busq3",
              "author": "chikanlegbees",
              "text": "Clay is pretty solid, have you looked into VentureRadar for leads on Reddit? What’s the pricing for clay?",
              "score": 1,
              "created_utc": "2026-01-18 18:04:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0cxmac",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxmcm",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxmac/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:12:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0avo4z",
          "author": "Oldguy3494",
          "text": "Canva",
          "score": 1,
          "created_utc": "2026-01-18 15:17:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bew87",
          "author": "allbl4ackeverything",
          "text": "Canva has been helpful. Excel helps me track and see everything. I love it. Maybe considered old school but works.",
          "score": 1,
          "created_utc": "2026-01-18 16:49:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxn6r",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxn8x",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxn6r/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:12:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0bqf7g",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-18 17:44:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0bqfd0",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0bqf7g/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-18 17:44:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0br5sp",
          "author": "Any-Airline7226",
          "text": "Claude",
          "score": 1,
          "created_utc": "2026-01-18 17:48:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bun5u",
          "author": "chikanlegbees",
          "text": "I use all of the above and VentureRadar for my leads so I can do outreach on Reddit",
          "score": 1,
          "created_utc": "2026-01-18 18:04:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxo35",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxo49",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxo35/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:12:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0bvynh",
          "author": "NoCloutTy",
          "text": "chatgpt for ideas, emails with sendflow, supabase for database, loom and youtube for videos walkthrough",
          "score": 1,
          "created_utc": "2026-01-18 18:10:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0c3blf",
          "author": "iNavin",
          "text": "Canva for design,\nTeams for communications \nSharepoint for files etc. \nGemini Pro and Perplexity for everything AI. \nOutlook for email. - looking at some AI tools\nTo help me there. \nMicrosoft Excel for most of my day to day work. \nHostinger for hosting \nWordpress with Elementor Pro for websites. \nHired a full time SEO person to help me with improving content for my website. \nLinkedin Sqles Navigator\nApollo / zoominfo for leads",
          "score": 1,
          "created_utc": "2026-01-18 18:43:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxr5i",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxr7p",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxr5i/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:13:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0c7gt1",
          "author": "rogeromanager",
          "text": "I don't know what your business is about but you must be marketing it and the best tool for it is gohighlevel. It has everything you need, website builder, funnels, forms, email sequences, reputation management, ai voice agent, power dialer and more. If you want I can give you an overview of the tool. \nPs. Not trying to sell it just doing some intentional networking.",
          "score": 1,
          "created_utc": "2026-01-18 19:02:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxt58",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:13:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxt6z",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxt58/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:13:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0cb038",
          "author": "Significant-Dust2460",
          "text": "Nice stack! I'm similar on Claude, n8n, ChatGPT + Google Sheets for the core stuff.\n\nOne thing that's been surprisingly useful: mining competitor reviews for customer language.\n\nI was spending hours manually reading Google reviews of competitors to understand what customers actually want. Turned it into a bit of an obsession - you find patterns like \"every 1-star review mentions slow service during lunch\" or \"customers keep asking for X feature that nobody offers.\"\n\nThe language customers use is gold for copy, positioning, and finding gaps. But doing it manually for 500+ reviews takes forever.\n\nBuilt a tool (Kairo) to automate this, it pulls all the reviews, opportunities, common complaints, exact phrases customers use. Testing it out right now to validate if it's actually useful.\n\nReal question for you: Do you ever analyze competitor reviews/feedback as part of your research? Or is that just my weird obsession? 😅\n\nIf you ever want to see what it finds for your space, happy to run one for free in exchange for honest feedback on whether it's actually valuable or just another shiny object.",
          "score": 1,
          "created_utc": "2026-01-18 19:19:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxtzw",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:13:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxu1s",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxtzw/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:13:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0ckfeh",
          "author": "Adventurous-Date9971",
          "text": "The best tools are the ones you actually open every day, not the shiny ones on Twitter. For me, the big unlock was tightening the stack around a few things: lead capture, follow-up, and decision-making.\n\nFor leads, I pair Webflow forms + Tally for quick landing pages, then pipe everything into Airtable as a lightweight CRM. From there, I trigger simple Make/Zapier automations to send intro emails and tag people based on source so I actually know what’s working.\n\nFor outreach, Lemlist is solid, but adding something like Apollo or Clay to clean/enrich leads before campaigns made a bigger difference than any copy tweak. On the “figuring out where to show up” side, I’ve used Ahrefs and SparkToro to see what channels my audience actually hangs out on, then doubled down there.\n\nI’ve tried things like Hypefury and Typefully for socials, and more recently Pulse alongside those and Pipedrive to systematically show up in Reddit threads that match my ICP instead of doomscrolling. The main point: fewer tools, wired together well, beat a huge stack every time.",
          "score": 1,
          "created_utc": "2026-01-18 20:05:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxul0",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:13:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxung",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxul0/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:13:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0cxk2a",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-18 21:11:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxk3t",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxk2a/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-18 21:11:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0cy4jb",
          "author": "Necessary_Proof_514",
          "text": "I started using some tools to help me write faster and it made things easier. It reduced the mental load a lot.",
          "score": 1,
          "created_utc": "2026-01-18 21:15:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0d6q4e",
          "author": "jnglsct",
          "text": "Jungle Scout has been a game-changer for me in e-commerce. product research, keyword volume, real margins in minutes before I commit. No hype, just data that actually helps avoid bad buys.\n\nMore tools that worked for me in bio 🐸. What’s your top one so far?",
          "score": 1,
          "created_utc": "2026-01-18 22:00:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dgwue",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-18 22:48:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0dgww7",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0dgwue/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-18 22:48:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0e801n",
          "author": "Euphoric-View-9876",
          "text": "Honestly the tools that stuck for me weren’t the flashy ones, they were the ones that reduced decision friction. Sheets + a lightweight CRM beat fancy dashboards, Claude/ChatGPT for thinking not writing, and Lemlist only mattered once the inputs were good. Biggest hidden win for me was spending time understanding where my audience actually shows intent (comments, competitor followers, discussions) before doing any outreach that saved way more time than swapping tools. Fewer tools, clearer signal, better outcomes.",
          "score": 1,
          "created_utc": "2026-01-19 01:09:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ea95y",
          "author": "Chicken_Brai",
          "text": "I use wonprompt for a virtual team.\n\nIll create a scene of my business overall goals and mission, company ideology, business plan, etc\n\nThen I create personalities based on my virtual personalities of ideal employees\n\nI keep it open on split screen and the left side of the screen I have my work im doing then ask the ai team opinions and such as I go\n\nhttps://preview.redd.it/mpnfpwd6k7eg1.jpeg?width=1080&format=pjpg&auto=webp&s=9801ed7a1e5744a78b6dab5be195e03c1dfce045",
          "score": 1,
          "created_utc": "2026-01-19 01:22:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ed7hp",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-19 01:39:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ed7jz",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0ed7hp/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-19 01:39:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0et0i2",
          "author": "ApprehensiveCrab96",
          "text": "Claude for coding and Saner for day planning",
          "score": 1,
          "created_utc": "2026-01-19 03:04:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0et75i",
          "author": "TwoBitFoundry",
          "text": "I recommend Wave for online invoice handling. Free to use, free to brand, automatic reminders, and has a really great api for automations. I actually use it as my converted client directory as well. Cause I have to add my client info to onboard them, so it’s worked out!",
          "score": 1,
          "created_utc": "2026-01-19 03:05:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ey4vu",
          "author": "Kudos_812",
          "text": "A hammer.",
          "score": 1,
          "created_utc": "2026-01-19 03:33:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f3h9x",
          "author": "Sudden_Breakfast_358",
          "text": "For us, the tools that actually free up time are the ones that handle repetitive tasks. Sensay has been a game-changer, it manages FAQs, customer follow-ups, and basic internal knowledge so we’re not stuck in the inbox. ChatGPT is great for drafting content, and Zapier/Make keeps workflows automated. Together, they cut down on busywork and let the team focus on real business tasks.",
          "score": 1,
          "created_utc": "2026-01-19 04:06:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fd2w8",
          "author": "SchniederDanes",
          "text": "what’s helped me most isn’t adding more tools, but building a simple acquisition engine where each tool has a clear job... ads bring in demand, but the real win is what happens after the click... we route inbound calls to an ai voice agent using a tool like dialnote.com.. so no lead is missed, calls are handled or logged automatically, and intent is captured even when no one is available... then for outbound and followups, smartreach.io.. runs email and linkdn sequences in parallel, with replies, calls, and tasks all tracked in one place... we plug in a lightweight enrichment tool only where needed, instead of overdoing it. once everything talks to each other, acquisition stops feeling manual and starts feeling predictable... that shift mattered way more than any single shiny tool.",
          "score": 1,
          "created_utc": "2026-01-19 05:11:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0frgap",
          "author": "trainmindfully",
          "text": "most tools people swear by only worked because they matched how that person already thinks and works. the hype ones usually fail because they add a new system on top of existing chaos. the genuinely helpful stuff tends to be boring. anything that reduces handoffs, duplication, or decision friction usually sticks. for me that has meant fewer tools doing more, not more tools doing narrow things. spreadsheets survive every cycle for a reason. also worth saying that tools feel productive early, but process clarity matters more. if a tool requires constant upkeep or manual discipline to stay useful, it usually gets abandoned once things get busy. the best ones disappear into the background and quietly save time without asking for attention.",
          "score": 1,
          "created_utc": "2026-01-19 07:05:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fw5bx",
          "author": "Training-Dinner1660",
          "text": "En mi caso y muchas personas que conozco, utilizamos **Notion + LLM** (ChatGPT o Gemini). Y ya las herramientas de operación para prestar tu servicio va a depender de tu área de actividad. Por ejemplo:\n\n|Marketing|HubSpot, GA4 + GTM, Meta/Google Ads|\n|:-|:-|\n\n\n|Desarrollo|GitHub, Jira, Vercel/AWS|\n|:-|:-|\n\n\n|Consultoría/Formación|Notion, Zoom, Miro|\n|:-|:-|",
          "score": 1,
          "created_utc": "2026-01-19 07:47:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g2g2f",
          "author": "Useful_Grape9953",
          "text": "For actual impact, I’d add Sensay, it helps discover AI tools and workflows that other small businesses are actively using, so you skip the hype. Beyond that, simple automation stacks (like Zapier or Make) plus ChatGPT for structured tasks usually save the most time.",
          "score": 1,
          "created_utc": "2026-01-19 08:45:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gg58o",
          "author": "Unique-Painting-9364",
          "text": "Honestly boring tools have helped me the most. A solid CRM setup good email automation, and simple dashboards beat shiny tools I barely use. If it saves time every week it’s worth it hype fades fast.",
          "score": 1,
          "created_utc": "2026-01-19 10:53:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ghpb4",
          "author": "StillLoadingit",
          "text": "I lean on tools like HubSpot or ActiveCampaign for CRM and automations, Trello or Asana for project and task management, and Google Analytics for tracking traffic and engagement. For making client access and onboarding way smoother, I’m using Connexify to cut down setup friction.",
          "score": 1,
          "created_utc": "2026-01-19 11:07:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gmh95",
          "author": "MintedRiddle",
          "text": "I mostly live in Canva and Sheets, also Claude for ideas and Ramp for finances/expenses",
          "score": 1,
          "created_utc": "2026-01-19 11:48:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gqp7i",
          "author": "Vaibhav_codes",
          "text": "Tools that actually stick are the ones that cut repetitive work or give clear insights automation, analytics, and AI helpers for content or docs.",
          "score": 1,
          "created_utc": "2026-01-19 12:22:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h4rh3",
          "author": "Sudden-Context-4719",
          "text": "If you’re looking to tap into Reddit for sales, SocListener actually helps by finding posts that matter and even suggests comments and DMs you can use to connect. It saved me time digging through threads and made outreach less random. Worth trying if Reddit fits your sales strategy.",
          "score": 1,
          "created_utc": "2026-01-19 13:52:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h9v6r",
          "author": "One-Cardiologist4433",
          "text": "One thing I rarely see talked about is workload visibility. A lot of stacks help with tasks or notes, but not with knowing who’s overloaded before things slip. Have you found anything that helped with that specifically?",
          "score": 1,
          "created_utc": "2026-01-19 14:21:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hdkae",
          "author": "daydarce",
          "text": "nice list, i've been hearing a lot about how AI search is changing the game for discovery lately. If you're thinking about how customers find you through ChatGPT or Perplexity answers, I've heard great things about Brandlight for monitoring and improving how your brand shows up in those AI responses. From what I understand it helps you see what AI tools are actually saying about your products and gives you ways to influence those mentions, which seems pretty important now that people are skipping Google for AI chatbots when researching purchases.",
          "score": 1,
          "created_utc": "2026-01-19 14:40:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hozoi",
          "author": "NefariousnessFit9855",
          "text": "For my business, I’ve tried a bunch of tools, but honestly only a few stick. I used to rely heavily on Chatgpt for brainstorming and writing but I’ve recently shifted to Qwen, it feels more reliable for organizing complex info and research. Everything else like canva for visuals still saves a ton of time too.",
          "score": 1,
          "created_utc": "2026-01-19 15:36:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0iv8py",
          "author": "fixingprocesses",
          "text": "The tools that help most are the ones that support thinking and follow through, not just output. Simple tracking, somewhere to write clearly and something that reduces context switching usually do more than advanced automation.\n\nAI is useful when it helps you organise decisions, clarify messages or review work rather than generate more things to manage. I see people get more value by narrowing how they use it instead of adding another model.",
          "score": 1,
          "created_utc": "2026-01-19 18:45:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0j0ajb",
          "author": "muabaca",
          "text": "slack for quick team syncs airtable for flexible crm upgrades automate repetitive stuff with make ((cheaper zapier alt) audit workflows quarterly to cut waste. sensays useful for capturing team knowledge as one option whats your main pain point scaling?",
          "score": 1,
          "created_utc": "2026-01-19 19:07:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mndub",
          "author": "MORPHOICES",
          "text": "I have tried everything over the years. What I’ve found most useful are the tools that… reduce thinking. Not features. \\~\n\nThe two things that really stuck for me. \\* Google Sheets – unsexy but unbeatable. I use it for lighter-weight CRM, tracking of experiments, and sanity checking. A tool must outperform a spreadsheet in order to be adopted.\n\n\\* A single source of truth like Notion only works if ruthless about it. I maintain a single \"operating page\" for each project which contains goals, ICP, offers, and ongoing experiments. No second brain, no mess.\n\n\\* Using email is under-rated. Use Gmail and labels.  Most transactions and genuine opportunities still occur here. CRMs with bells and whistles arrived later.\n\n\\* Calendly and short calls is the tool giving me the most ROI by far. Interacting with users is better than any dashboard.\n\n\\* Use ChatGPT to compress and rewrite careless words into neat insights or notes like during calls or meetings.\n\nTools I gave up.\n\n\\* Anything that promised “automation” before I had repeatable behavior.\n\n\\* Before I had visitors worth analyzing, I got analytics tools.\n\nIt's my order now.\n\nIf a tool is not saving you time this week, it’s friction.\n\nI wonder what you removed recently that simplified things.",
          "score": 1,
          "created_utc": "2026-01-20 07:22:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgz6fx",
      "title": "4months. 5clients. £12k/mo.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qgz6fx/4months_5clients_12kmo/",
      "author": "wastededucation",
      "created_utc": "2026-01-19 08:57:37",
      "score": 24,
      "num_comments": 5,
      "upvote_ratio": 0.88,
      "text": "Sharing here the steps I went through from launching my service in September last year as i think theyre pretty repeatable to speed-run.\n\nThis is by no means a success story and i definitely don’t feel secure yet, but might help as a zero-to-something example.\n\nI left my job end of 2024 - ads/marketing consultant for the big blue professional network.\n\nNaked quit when i hit my savings goal. Just had enough of big corp and logging my farts in salesforce.\n\nDidn’t really have a plan other than to build some stuff solo, learn new tech, and eventually start selling something.\n\n\\- looked for the easiest route to cash based on my skills. In my case, “do b2b ads better”. That’s where my credentials/background were so just kept it simple.\n\n\\- looked for point of difference in service. Too difficult. Loads of ads agencies out there. \n\n\\- turned to looking for point of difference in distribution. On LinkedIn that’s personal video.\n\n\\- Started talking to the camera and posting opinions on ads/marketing. Summarised opinions into a micro-brand and imagery to supplement the videos.\n\n\\- - sidenote - - i had never turned the camera on myself before. Ever. And i hated it. Saw Shaan Puri talk about climbing Cringe Mountain. Posted about that and got some attention. Main point is noticing how hard it was, and realising that 0.001% of people are ever going to do this selfie video thing.\n\n\\- this was the lightbulb moment for a more scalable service than just consulting on ads.\n\n\\- researched current remote podcasting software. Found riverside and descript. Played around and got ‘ok’ on them in a few hours.\n\n\\- invited some ex colleagues to come and chat for half an hour in return for me creating them some non-cringe videos to use on their linkedin. Also posted to offer it out to my extended network.\n\n\\- got a few bites, including a couple of nice CEO intros from contacts who believed in the ‘founder video’ concept\n\n\\- interviewed that half a dozen people and created videos and linkedin ads for them, for free. Emphasis on free. I was simply looking for momentum and a chance to show something i could at this stage.\n\n\\- used those content packs as case studies to show what i was offering, whilst simultaneously building a brand and website to make it feel more legit\n\n\\- built a launch offer and packaged it up. Announced it on my linkedin. Limited spaces (5). \n\n\\- had 2 people directly say they wanted in, and then i reached out to anyone that engaged with my post to see if i could bring them in - closed 2 of those over video chat and voicenotes.\n\n\\- Interestingly, none of my free beta users converted into paying customers, but hopefully someday (i’m keeping then warm)\n\n\\- - sidenote - - i had simultaneously been adding people on linkedin that i thought were in my target demographic (leaders of business lines eg CMO, CRO etc). This gradually built my network and helped with the reach of my posts, not directly selling to them.\n\n\\- i had packaged it to be £1k/mo per person, on 3-month deals.\n\n\\- by the end of month 2 and now 4 paying clients at £1k/mo, i had a lot more work to shout about and it was so much easier to generate interest and meetings through my profile.\n\n\\- i called myself the 5th spot and dogfooded my own product to get me out there more. Worked pretty well.\n\n\\- this brought in a few more leads, including some ex colleagues that had moved on, and an old uni friend that was now leading a startup. They in turn made some intros\n\n\\- increased my pricing once the 3-month ‘launch’ packages expired to £1.5k p/mo\n\n\\- also offered layered, related services to have more things to sell beyond just content e.g. podcast facilitation&editing, social page management, ad campaign setup&run, corporate email newsletter, content strategy etc.\n\n\\- brings me to Jan with 5 clients totalling at £12k/mo over different packages (some like more video, some prefer carousels/articles), including one £4k full-service social management.\n\nnext steps\n\n  \\- bring in systems and freelancers to help me with the delivery bottleneck. Everything is produced by me currently so that needs to change to be able to grow. I’m avoiding any promotion as i cant take on more clients, which is painful.\n\n  \\- lock in more 6m+ contracts\n\n  \\- rebrand to something better than my microsoft paint (canva) logo to be more legit\n\n  \\- Reinvest into more personal content and ads to increase lead flow\n\n  \\- get much better at the pitch/close cycle (I’m not a salesman and want the product to sell itself)\n\nHonestly when I look back at the last few months it’s pure uncertainty, guesswork, trying to follow guru advice, really trying to learn what people want, and then how to deliver it.\n\nI’m not sure I have a single/simple takeaway here but hopefully these steps i’ve gone through help someone see that the progress does happen if you just think logically and put one foot in front of the other.\n\nOh, and get a whiteboard. And take a walk.\n\nTldr - try new stuff, do free projects, use as case studies, build a micro brand, promote it on your personals, hawk core/launch offer, upsell related services",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qgz6fx/4months_5clients_12kmo/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0i4r9m",
          "author": "Frequent-Tennis-6914",
          "text": "The most real line here is “I’m avoiding promotion because I can’t take more clients.”\nThat is the exact point where systems matter. Not big strategy, just a simple weekly process that tells you: what’s coming in, what’s going out, and what can be safely spent on help without creating a tight week.\nWhat part of delivery is eating the most time right now?",
          "score": 3,
          "created_utc": "2026-01-19 16:46:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0homlg",
          "author": "NefariousnessFit9855",
          "text": "This is a really solid, honest breakdown the execution and momentum. I appreciate how much of this was about distribution and doing uncomfortable things rather than some magic tactic.",
          "score": 3,
          "created_utc": "2026-01-19 15:34:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l54x5",
          "author": "Extreme_Log5264",
          "text": "This is very inspirational for us trying to be our own entrepreneur. Thanks for being so honest.",
          "score": 1,
          "created_utc": "2026-01-20 01:33:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gae0u",
          "author": "nzmi",
          "text": "What's the name of your business brother, I am soon to start the same journey and would love more info on what worked and what didn't, and what you do differently if you had to do it all again.",
          "score": 1,
          "created_utc": "2026-01-19 10:00:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gkpco",
              "author": "wastededucation",
              "text": "Yeh course mate happy to chat. Add me On LinkedIn it’s in my profile",
              "score": 1,
              "created_utc": "2026-01-19 11:33:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qbzves",
      "title": "I built my business to $15k MRR with content creation without paid ads, here's howI built my business to $15k MRR with content creation without paid ads, here's how",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qbzves/i_built_my_business_to_15k_mrr_with_content/",
      "author": "simple_pimple50",
      "created_utc": "2026-01-13 18:57:50",
      "score": 22,
      "num_comments": 3,
      "upvote_ratio": 0.77,
      "text": "\n\nI hit $15k MRR last month and haven't spent a dollar on paid ads. Everything has been organic content, here's the approach and lessons\n\nThe Strategy: I focus on one platform first until you really understand it. I went all in on linkedn for 8 months before expanding. Got to 12k followers and consistent engagement then expanded to twitter and instagram using similar content but adapted for each platform\n\nCreate one good piece of content per week and multiply it across formats. One detailed post becomes a thread, carousel, newsletter and short video. Im using blotato to handle platform specific formatting which saves hours\n\nEngage genuinely with your audience. I spend 30 min daily responding to comments and dm’s. Thats where real relationships and customers come from, not just posting and disappearing.\n\nLessons: Consistency beats perfection. I posted 5 times per week even when I thought the content wasnt great. Showing up regularly matters more than occasional perfect posts\n\nAuthenticity wins, people can tell when you're being real vs trying too hard. Share actual experiences, wins and losses because that's what resonates\n\nLong form content > short form for trust building. My detailed posts get way more client inquiries than quick tips\n\nContent roi takes time. First 4 months I got basically nothing, month 5-6 things started picking up, month 7+ it really accelerated. You need patience\n\nCurrent stats:\n\n- 18k followers on linkedn\n- 6k on twitter\n- 4k on Instagram\n- $15k MRR\n- Zero ad spend\n\nIf you're bootstrapping, content is your best bet. Takes time but it works.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qbzves/i_built_my_business_to_15k_mrr_with_content/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzqe7fx",
          "author": "AdPlastic5148",
          "text": "If you could talk more about what kind of content really stands out for you?",
          "score": 1,
          "created_utc": "2026-01-15 14:28:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o019vrx",
          "author": "Willing_Builder4289",
          "text": "Solid breakdown. Most people don’t have the consistency to last 8 months on one platform that alone explains the MRR.\nCurious though: at $15k MRR, what % of your audience actually converts without you being personally involved with the lead?",
          "score": 1,
          "created_utc": "2026-01-17 02:05:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdbyl2",
      "title": "What security do small retail shops in Italy usually need?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qdbyl2/what_security_do_small_retail_shops_in_italy/",
      "author": "Sorry-Orchid-9821",
      "created_utc": "2026-01-15 06:18:15",
      "score": 18,
      "num_comments": 2,
      "upvote_ratio": 0.96,
      "text": "I'm getting ready to open a little retail store in Italy and want to keep things safe for my team and customers without overspending. Shoplifting happens, especially in busier areas, so I'm trying to figure out the practical approach. \n\nA lot of small shops seem to rely on good cameras, motion-sensor alarms, bright lighting, and clear signage. But in some spots (city centers, higher-value items), people also bring in private security guards.\n\nIf hiring a private agency makes sense, what should I check to pick a reliable one, proper licensing (TULPS), retail-specific experience, GDPR compliant camera setup, and realistic pricing?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qdbyl2/what_security_do_small_retail_shops_in_italy/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzqju7c",
          "author": "Adventurous_Mail9055",
          "text": "For retail stores, I’d recommend going with a professional security agency that specializes in commercial spaces. Slyservice helped me set up a comprehensive security solution for my store, including both physical guards and video surveillance. It made a huge difference in preventing theft and ensuring safety.",
          "score": 4,
          "created_utc": "2026-01-15 14:56:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzmb4u",
          "author": "Tight-Preference-823",
          "text": "Hi u/Sorry-Orchid-9821, that's a great question! I've done some research on this topic. For small retail shops in Italy, it's common to use a combination of cameras, motion-sensor alarms, and clear signage to deter shoplifting. Additionally, some shops opt for private security guards, especially in high-risk areas. It's also essential to train staff on how to handle shoplifting incidents and to have a good relationship with local law enforcement.",
          "score": 0,
          "created_utc": "2026-01-16 20:43:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcelq8",
      "title": "Why travel agents find booking tours and experiences the most time consuming task",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qcelq8/why_travel_agents_find_booking_tours_and/",
      "author": "Potential_Force_4136",
      "created_utc": "2026-01-14 05:11:04",
      "score": 13,
      "num_comments": 13,
      "upvote_ratio": 0.94,
      "text": "I love planning trips, but booking tours and activities has always been the most frustrating part of my workflow, half the time i m chasing confirmations, double checking details, or following up instead of actually advising my clients. It turns something that should be simple into a whole project. I just want one place where i can search experiences, book them, and move on with my day without adding more admin or mental load.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qcelq8/why_travel_agents_find_booking_tours_and/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzhmqqo",
          "author": "These_Run_7070",
          "text": "having a single search and book platform would save so much time, but i always notice there are gaps with inventory or service in every tool i have tried.",
          "score": 4,
          "created_utc": "2026-01-14 05:14:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhn08q",
          "author": "kubrador",
          "text": "honestly this reads like you're about to pitch your own tool lol\n\nbut yeah tour booking is a mess because the industry is fragmented af. you've got viator, GetYourGuide, local operators with websites from 2006, some guy named Paolo who only responds on WhatsApp\n\nthe \"one place\" thing doesn't really exist because operators don't want to be commoditized and aggregators take fat commissions",
          "score": 3,
          "created_utc": "2026-01-14 05:16:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzi1nb2",
              "author": "Potential_Force_4136",
              "text": "I am not pitching anything. I am genuinely just trying to figure out how other people handle the fragmentation and admin load",
              "score": 1,
              "created_utc": "2026-01-14 07:16:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzhnf08",
          "author": "Appropriate-Plan5664",
          "text": "Yup booking tours always feels like spinning plates, especially when every platform has its own quirks and confirmation delays.",
          "score": 2,
          "created_utc": "2026-01-14 05:19:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhr1tq",
          "author": "Secret-Boot-8924",
          "text": "The weirdest thing is that flights and hotels got so much easier over the years but tours seem stuck in the past, almost like the systems are held together with tape.",
          "score": 2,
          "created_utc": "2026-01-14 05:47:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhzvvy",
          "author": "Curious-Session4119",
          "text": "From a workflow optimization perspective, the core problem is fragmented data and manual reconciliation. Most booking platforms aren’t designed for multi-client visibility or bulk tracking, which leads to repeated follow-ups and cognitive overhead.  \nA more scalable approach is to centralize booking data into a single system",
          "score": 2,
          "created_utc": "2026-01-14 07:01:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhzye5",
              "author": "Curious-Session4119",
              "text": "ideally one that supports:\n\n* API integrations with major experience providers for automatic confirmations\n* Client specific dashboards showing booked vs. pending activities\n* Automated reminders for both agents and clients\n* Reporting on revenue and commissions",
              "score": 2,
              "created_utc": "2026-01-14 07:02:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzhz50h",
          "author": "SpecialistAd7913",
          "text": "part of the challenge is that tours and experiences are inherently fragmented. One approach that works for me is batching all booking related tasks into dedicated time blocks instead of handling them piecemeal. It makes the admin feel less chaotic and keeps the mental load from spilling into client interactions",
          "score": 1,
          "created_utc": "2026-01-14 06:54:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziqnb7",
          "author": "samexplorer69",
          "text": "what if we can create an ai agent that just surf around the web collect the data along with availability, pricing, etc and also with other social platforms along with rating and review photos video and link and evaluate the whole data on its own  \nand give us the best experience by matching our trip plans",
          "score": 1,
          "created_utc": "2026-01-14 11:11:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzk7kb6",
          "author": "Rich-Editor-8165",
          "text": "Because most tours and activities still rely on manual processes. Different vendors use different systems, confirmations are slow, details change last minute, and there’s rarely one clean place to manage everything. What should be a quick booking turns into a lot of chasing and double checking, which adds up fast.",
          "score": 1,
          "created_utc": "2026-01-14 16:16:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbupew",
      "title": "Where do you find likeminded entrepreneurs?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qbupew/where_do_you_find_likeminded_entrepreneurs/",
      "author": "snoozebuttonn",
      "created_utc": "2026-01-13 15:44:41",
      "score": 12,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "Hey everyone 😁 I’m a young software engineer based out of Atlanta and I’ve been actively working on my own software company for a bit. I’m curious where are some of the best places or ways to meet other entrepreneurs? I’m more so interested in networking with other entrepreneurs, not even just tech alone.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qbupew/where_do_you_find_likeminded_entrepreneurs/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzdncz3",
          "author": "Sudden-Context-4719",
          "text": "Check out local startup meetups or coworking spaces in Atlanta, they usually have events where entrepreneurs hang out. Also try Reddit subs to connect online.",
          "score": 3,
          "created_utc": "2026-01-13 16:42:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzf5ule",
              "author": "snoozebuttonn",
              "text": "Yeah i’m gonna give this a shot!",
              "score": 1,
              "created_utc": "2026-01-13 21:02:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzejg0l",
          "author": "Nightcoon3",
          "text": "Honestly, try join some hobby/activities in your area, I've made some really great connections with people from all backgrounds and surprisingly a lot of founders of startups and other entrepreneurs.",
          "score": 2,
          "created_utc": "2026-01-13 19:18:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzezwez",
          "author": "Lucky-Back-5239",
          "text": "I feel like local events and social media, would love to contact if you want!",
          "score": 2,
          "created_utc": "2026-01-13 20:34:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzec0uh",
          "author": "HucciBucci",
          "text": "Im a business broker! So I’m in the business of sticking my nose in other people’s business ;)\n\nIndustry events if you’re in the city, follow up with contact details. Finding opportunities for public speaking works well too. Online spaces (like here!), and engaging locally on linkedin with questions/comments. Finding a network through your work is great too- past customers for focus groups, subcontractors, that kind of thing. Just a couple of ideas!\n\nAlso in GA, but not Atlanta. Feel free to DM sometime.",
          "score": 1,
          "created_utc": "2026-01-13 18:45:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzf63kn",
              "author": "snoozebuttonn",
              "text": "Okay thanks for your insight this is pretty solid!",
              "score": 2,
              "created_utc": "2026-01-13 21:03:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfhgou",
          "author": "MingleMinds",
          "text": "I'm in the same boat here in Dallas. I can link up with founder in are all AI focused or SaaS but can't find groups that are consumer focused.",
          "score": 1,
          "created_utc": "2026-01-13 21:56:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzj41ur",
          "author": "MixSad3421",
          "text": "Hello everyone, i would also like to network but im kinda isolated n brasil in a small city. im French and would like to network with french or english speaking person, in person here its impossible to meet anyone with those criterias, any ideas on how to network online, or online entrepreneurs communities?",
          "score": 1,
          "created_utc": "2026-01-14 12:51:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzl41q1",
          "author": "uepodcast2021",
          "text": "Your doing it right now! Reaching out here is an amazing first step so good for you! Also many Facebook and LinkedIn groups are super helpful. \n\nIs there a specific reason you want to reach out to entrepreneurs? What are you hoping to accomplish? \n\nJuat curious 😁",
          "score": 1,
          "created_utc": "2026-01-14 18:41:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzlrwg4",
              "author": "snoozebuttonn",
              "text": "Honestly just for the exposure. I’m only 23 but have lots of technical experience building software and have had this constant feeling to build my own thing. I also have found out that not everyone runs a business the same so it’s interesting to learn from other people’s perspective.",
              "score": 1,
              "created_utc": "2026-01-14 20:29:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0gg83k",
                  "author": "uepodcast2021",
                  "text": "Keep doing what your doing. Check out groups on Facebook and especially LinkedIn. This will put you directly in touch with some of the biggest entrepreneurs if you do it right. Ask for a 1 on 1 call. There are generous entrepreneurs that will give you 15 or 20 minutes of their time to answer questions.  Just like me lol.\n\nIf there is any way I can serve you please let me know 😁",
                  "score": 1,
                  "created_utc": "2026-01-19 10:54:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o078imh",
          "author": "Alarmed-Cattle-2728",
          "text": "I am also a software engineer based out of Atlanta have some idea and currently working on a hobby project, maybe we can collaborate…",
          "score": 1,
          "created_utc": "2026-01-18 00:08:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qca5z8",
      "title": "Selling concert and event packages. Curious what you guys think and how I could improve",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qca5z8/selling_concert_and_event_packages_curious_what/",
      "author": "Scalar_Shift",
      "created_utc": "2026-01-14 01:42:12",
      "score": 11,
      "num_comments": 10,
      "upvote_ratio": 0.87,
      "text": "I originally posted this in on the flipping subreddit but got told it belonged here so hopefully this is the right place for this. I also want to add a disclaimer that, while I do make money off of events like concerts, plays, sports, etc. I do everything in my power to add value and I never just straight up resell tickets on their own. Ultimately I sell total event packages but I’m a big music lover so concerts are my bread and butter and on the rare occasions I can’t fill the bookings I give the tickets away for free. \n\r\nI live in a very touristy area that always has some sort of events going on and a couple of years ago I had to travel for months at a time for work. I listed my place on AirBnB and my buddy helped run it while I was away. It did fine. Nothing crazy but it was certainly nice extra cash. \n\r\nAs you’d expect, bookings often correlated with big events. So we eventually started experimenting with offering full trip packages instead of just lodging. I’d post in fan forums, Facebook groups, and occasionally relevant subreddits when a show is announced and offer a bundled option that includes:\n\r\n●\tConcert tickets\n\r\n●\tLodging at the AirBnB\n\r\n●\tTransport to/from the venue\n\r\n●\tA band T-shirt + poster\n\r\nIt ended up doing so well that when I stopped traveling I invested in a bigger place to keep it going and land larger groups. The response was significantly better than I expected, especially for weeknight shows that the Airbnb would normally be empty.\n\r\nWhat really made this work long-term is the repeat customers. People who love concerts REALLY love concerts. Once someone has a great experience, they’ll come back for another show, sometimes multiple times a year. I also keep an email list of past guests, so a lot of events sell out fast without much effort.\n\r\nOn top of that, I quietly include a few extras that I don’t advertise, just to exceed expectations:\n\r\nA framed photo from the weekend (I set up a small photo station near the entrance with an event-themed backdrop and everyone takes photos before heading out while they’re all dressed up). A welcome basket with water, ponchos, snacks, and a printed guide with venue tips + best local food and drinks. And everyone’s favorite… while guests are at the show, I prep a pile of grilled cheese sandwiches so there’s a drunk midnight snack waiting when they get back. People go absolutely nuts for it and the word of mouth has been massive.\n\r\nFrom an ops side, the biggest challenge for me was landing the actual tickets without paying insane resale markups. I organized around early access and planning. Knowing which shows were coming, when presales dropped, and which ones were actually worth building packages around. I get all of my info from venues email lists and presale sites. I used to use presalecodefinder but got sick of the ads so I switched to presale.codes. I prefer it because you can set alerts and search by location instead of just artists like most other sites.\n\r\nLike I said, I love concerts and love being able to monetize that passion while sharing it with others. While the money isn’t enough to replace my actual job, it’s been significant enough for me to rapidly increase my savings and put me on track to FIRE in the next few years… hopefully. \r\nI mainly want to know how can I expand this beyond myself? I’d love to do it full time but I feel like I’ve plateaued and I probably couldn’t run two by myself. Any advice?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qca5z8/selling_concert_and_event_packages_curious_what/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzhvh52",
          "author": "Inevitable_Tree_2296",
          "text": "How difficult is it to consistently get tickets for groups? I'd assume you're housing like 6-8 people if you upsized your airbnb.",
          "score": 9,
          "created_utc": "2026-01-14 06:23:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhydrx",
              "author": "Scalar_Shift",
              "text": "Yeah its a 4 bedroom and sleeps 2 per room. For the tickets, it's not as bad as people make it out to be. Not every show is Taylor Swift levels of demand. As long as I get the presale code, which is nearly every time with the aggregators and venue emails, then it's not really a problem",
              "score": 1,
              "created_utc": "2026-01-14 06:48:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nziax8d",
                  "author": "Strong_Pool_4000",
                  "text": "But why use an aggregator instead of just signing up for the artists email lists and such? I feel like that'd be more consistent.",
                  "score": 1,
                  "created_utc": "2026-01-14 08:44:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzgw1ox",
          "author": "ImpulseTravel",
          "text": "I love that you’re adding value vs just scalping tickets.",
          "score": 2,
          "created_utc": "2026-01-14 02:27:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhdbny",
          "author": "Late_Extent_1463",
          "text": "This is sick. Its like being a travel agent except specifically for concerts.",
          "score": 2,
          "created_utc": "2026-01-14 04:09:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhhvsg",
              "author": "Scalar_Shift",
              "text": "Yeah that's a great way to put it! The value comes from the ease of having everything taken care of and not having to worry about booking it all separately and managing ubers (which is an absolute nightmare when leaving a venue btw). I know the space very well now so I always know the best routes and times to avoid severe traffic but also not have everyone there so early that they may as well be camping out lol.",
              "score": 1,
              "created_utc": "2026-01-14 04:40:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzgvc1u",
          "author": "honestfyi",
          "text": "This sounds like a ton of work but really innovative. Write a how to guide and sell it to Airbnb hosts? Or offer to run the back end for existing hosts in relevant markets? Could work well if you focus on some specific bands with an enthusiastic fan base. \n\nAlso you could reach out to band managers maybe. I have a friend who tours nationally and they always tack on some weeknight shows in the markets they’re traveling to. I’ve toured with them, those shows tend to be less well attended. They might appreciate what you’re doing to help get fans to these shows.",
          "score": 1,
          "created_utc": "2026-01-14 02:23:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qeptp1",
      "title": "How to do proper investor outreach for seed funding without a network (raised $4M doing this)",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qeptp1/how_to_do_proper_investor_outreach_for_seed/",
      "author": "dolm09",
      "created_utc": "2026-01-16 19:34:52",
      "score": 8,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Most advice about investor outreach assumes you already know the right people. Alumni networks, warm friends of friends, early angels who open doors. That was not my situation.\n\nI started fundraising as a first-time founder based in Europe, with zero VC relationships and no built-in credibility. No one was waiting for my deck. No one was forwarding my intro. If I wanted investor meetings, I had to create them from scratch.\n\nHowever, I managed to make it predictable by treating it as another sales funnel.\n\nAcross multiple rounds, I ended up having well over a hundred investor conversations. Most of them said no. That was expected. What mattered was that the process eventually produced momentum, and more importantly, it produced a small number of yeses.\n\nThe turning point came when I rebuilt my investor outreach around warm introductions that I could generate systematically, even without knowing a single investor personally.\n\nHere is what fundraising actually looked like in practice for me.\n\n* Pre-seed: around 70 investor conversations\n* Seed: around 175 investor conversations\n* Total passes: 166\n\nYou should expect at least 99 no’s before the first yes. That is normal and not a signal that you are doing something wrong.\n\nEarly on, I made every mistake possible.\n\n* Pitches were too long\n* I reached out to the wrong investors\n* There was no urgency\n* I let investors control timing\n\nNothing worked consistently until I reframed fundraising as a numbers game with strict process discipline. The biggest improvement did not come from a better deck or a tighter pitch. It came from changing who I contacted first.\n\nI stopped messaging investors directly and focused on **portfolio founders instead.**\n\nFor every VC fund I wanted to speak with, I followed the same steps.\n\n1. Go to the VC website\n2. Open the portfolio page\n3. Identify founders in or near my sector\n4. Connect with them on LinkedIn\n5. Ask for a quick video call to know about their experience with X investor\n\nFor each VC, I would reach out to about 15 portfolio founders, around 3 founders agreed to a short 15-minute chat, and one or two almost always offered a warm intro to their investor.\n\nThis made investor outreach repeatable and predictable.\n\nWhy this works?\n\nWhen an investor hears about your company from one of their own founders, you are no longer a random inbound.\n\nAnd you can pitch with a total different energy because the investor assumes there is existing momentum. You can play a game where they can start thinking that if they wait, the round might fill without them.\n\nThat shift in perception does more than traction alone ever did for me.\n\nOne of the biggest misconceptions about fundraising is that investors are purely driven by traction and numbers.\n\nUrgency beats raw traction more often than founders want to admit. If not, look at all the TechCrunch & LinkedIn cringe-posts where founders with a powerpoint slide raise a gazillion dollars.\n\nAlso, if you spread investor calls over months, nothing compounds. One call per week creates no momentum. Investors forget you.\n\nIf you compress conversations into a tight window, momentum builds naturally. Conversations reference each other. Interest compounds.\n\nThat is how rounds close.\n\nNow building something specifically to automate all this in case anyone is interested.\n\nHappy to answer questions!",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qeptp1/how_to_do_proper_investor_outreach_for_seed/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o02r1qc",
          "author": "Due-Philosopher-1426",
          "text": "Thanks for sharing. This seems helpful",
          "score": 2,
          "created_utc": "2026-01-17 08:49:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o03kt1r",
              "author": "dolm09",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-01-17 13:08:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o037oe5",
          "author": "wtstm",
          "text": "Thanks for sharing! Interesting perspective on compressing the conversations into a tight window. How do you achieve to schedule all these calls with founders and investors into a tight window? When do you start to prepare the founder introductions? That sounds like a lot of work",
          "score": 2,
          "created_utc": "2026-01-17 11:25:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o03jbtq",
              "author": "dolm09",
              "text": "It starts getting momentum after a couple of weeks. Think of it this way:\n\n1st week you reach out to a batch of founders.\n\n2nd week you start getting a decent amount of positive responses, so you start scheduling calls.\n\nSince founders are always busy, you don't probably jump on a call until 3rd week. Then you get some yeses.\n\n4th week you start getting intros.\n\nAfter the 4th week the batches start to overlap, so after that you are always getting a relevant volume of meetings with investors.\n\nIt's a lot of work, but knowing that only 1% of startups end up raising a round, seems like a reasonable effort.",
              "score": 2,
              "created_utc": "2026-01-17 12:58:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o086499",
          "author": "rt2828",
          "text": "Great idea!",
          "score": 2,
          "created_utc": "2026-01-18 03:08:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0a8e2t",
              "author": "dolm09",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-01-18 13:02:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o040e5j",
          "author": "KoumKoumBE",
          "text": "Very interesting! Thanks for sharing! I also assume that by choosing your founders well, you can automatically restrict your efforts to investors who are used to your niche?\n\nDid the founders feel proud of being contacted by you? (I mean: feeling important and successful enough that someone asks them for advice). When they were saying no, what was their reason, if you can tell?",
          "score": 1,
          "created_utc": "2026-01-17 14:38:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04h6mg",
              "author": "dolm09",
              "text": "Totally right on everything you said. Your goal when getting the call with the founder is to feed their ego since raising capital is super hard but at the same time very lonely. Your goal is also to build authority by sharing you achievements (capital raised in the past, your PHD, the product you've built, deals, user feedback, whatever works for you), so they feel they are sharing great dealflow with their investors.\n\nWhen they were saying no to make the intro, most of the time they were insecure stuck-ups that raised recently. It's okay, life happens, you just move on and keep reaching out to others.",
              "score": 2,
              "created_utc": "2026-01-17 16:02:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gqc2f",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-19 12:19:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gqc3y",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qeptp1/how_to_do_proper_investor_outreach_for_seed/o0gqc2f/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-19 12:19:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gqi1o",
          "author": "dolm09",
          "text": "In case anyone is interested the tool I'm building is EasyVC ai",
          "score": 1,
          "created_utc": "2026-01-19 12:20:32",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcabe2",
      "title": "Ce qui a vraiment aidé un petit studio B2B à structurer son outbound",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qcabe2/ce_qui_a_vraiment_aidé_un_petit_studio_b2b_à/",
      "author": "ashcobra",
      "created_utc": "2026-01-14 01:49:02",
      "score": 8,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Je partage un retour d’expérience avec un petit studio français orienté growth B2B, UCLIC.\n\nComme beaucoup d’équipes au début, leur outbound était assez chaotique. Prospection manuelle, relances mal suivies, peu de visibilité sur ce qui fonctionnait réellement. Plutôt que d’augmenter le volume, on a d’abord travaillé sur la structure.\n\nOn a combiné quelques outils simples comme Lemlist pour les séquences, PhantomBuster pour l’extraction de données, et HubSpot comme CRM léger. Rien de très sophistiqué. L’impact est surtout venu d’un meilleur ciblage, de données plus propres et de responsabilités claires sur les relances.\n\nLes résultats n’ont pas été spectaculaires, mais surtout plus stables. Des taux de réponse plus réguliers, moins de leads perdus, et plus de temps pour améliorer les messages plutôt que faire du répétitif.\n\nConclusion perso: les outils aident, mais seulement quand le process est clair. Automatiser trop tôt, ça amplifie juste le désordre.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qcabe2/ce_qui_a_vraiment_aidé_un_petit_studio_b2b_à/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzl1o44",
          "author": "Delicious-One-5129",
          "text": "Même constat ici. Le vrai changement pour nous a été de définir un ICP précis, simplifier les séquences et instaurer une routine de nettoyage de la data. Une fois ces bases en place, tout le reste devient beaucoup plus efficace.",
          "score": 2,
          "created_utc": "2026-01-14 18:31:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzo9zjr",
          "author": "MindlessGurl-55",
          "text": "On a traversé la même phase. Travailler avec UCLIC nous a surtout aidés à poser des règles claires sur les relances et la qualité des listes. Concrètement on a combiné Lemlist, PhantomBuster et HubSpot, mais le vrai levier a été le process instauré.",
          "score": 1,
          "created_utc": "2026-01-15 04:33:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qea9li",
      "title": "Month 8 update: From idea to $30K MRR - the full breakdown",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qea9li/month_8_update_from_idea_to_30k_mrr_the_full/",
      "author": "Delecch",
      "created_utc": "2026-01-16 08:09:09",
      "score": 8,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Been a while since I posted here, wanted to share where things are at. This community has been super helpful, so hopefully this gives something back.\n\n\n\n\\*\\*Quick background:\\*\\*\n\nStarted a social media management SaaS 8 months ago. First-time founder, no VC funding, just me and eventually one part-time contractor.\n\n\n\n\\---\n\n\n\n\\*\\*THE NUMBERS (Month 8):\\*\\*\n\n\n\n| Metric | Value |\n\n|--------|-------|\n\n| MRR | $30,400 |\n\n| Customers | 342 |\n\n| Churn | 5.8% monthly |\n\n| CAC | \\~$0 (organic only) |\n\n| LTV | \\~$520 |\n\n| Runway | Infinite (profitable) |\n\n\n\n\\---\n\n\n\n\\*\\*THE TIMELINE:\\*\\*\n\n\n\n\\*\\*Months 1-2:\\*\\* Building in isolation (mistake)\n\n\\- Built MVP in 8 weeks\n\n\\- Talked to exactly 0 customers\n\n\\- Assumed I knew what people wanted\n\n\n\n\\*\\*Month 3:\\*\\* Soft launch (reality check)\n\n\\- Posted on Product Hunt - 30 upvotes, 2 customers\n\n\\- Realized my assumptions were 60% wrong\n\n\\- Had to pivot core features\n\n\n\n\\*\\*Month 4:\\*\\* Started building in public\n\n\\- Began sharing everything on Twitter/X\n\n\\- Weekly revenue updates, failures, learnings\n\n\\- First signs of organic traction\n\n\n\n\\*\\*Months 5-6:\\*\\* Growth phase\n\n\\- Hit $10K MRR\n\n\\- Started engaging in communities (Reddit, indie hackers)\n\n\\- Word of mouth kicked in\n\n\n\n\\*\\*Months 7-8:\\*\\* Optimization\n\n\\- Reduced churn from 12% to 5.8%\n\n\\- Hired part-time support person\n\n\\- Hit $30K MRR\n\n\n\n\\---\n\n\n\n\\*\\*WHAT ACTUALLY WORKED:\\*\\*\n\n\n\n1. \\*\\*Building in public\\*\\* - People trust transparency. Sharing failures built more trust than highlighting wins.\n\n\n\n2. \\*\\*Community engagement\\*\\* - Not spamming links. Actually helping people. The conversions came naturally.\n\n\n\n3. \\*\\*Obsessing over churn\\*\\* - Spent 2 months just on retention. Onboarding, support, feature requests.\n\n\n\n4. \\*\\*Simple tech stack\\*\\* - Next.js, Supabase, Stripe, Vercel, Crescitaly for analytics. Nothing fancy.\n\n\n\n\\---\n\n\n\n\\*\\*WHAT FAILED:\\*\\*\n\n\n\n\\- Cold email (2% reply rate)\n\n\\- LinkedIn content (maybe wrong audience)\n\n\\- Paid ads (tried $500, terrible ROAS)\n\n\\- Product Hunt launch (timing was wrong)\n\n\n\n\\---\n\n\n\n\\*\\*BIGGEST LESSONS:\\*\\*\n\n\n\n1. Talk to users before building anything\n\n2. Distribution is as important as product\n\n3. Churn kills faster than slow growth\n\n4. You don't need funding to build something real\n\n\n\n\\---\n\n\n\n\\*\\*WHAT'S NEXT:\\*\\*\n\n\n\n\\- Hiring first full-time employee\n\n\\- Launching v2 with new features\n\n\\- Maybe exploring YouTube content\n\n\n\nHappy to answer any questions. What's your ride along story?",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qea9li/month_8_update_from_idea_to_30k_mrr_the_full/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzw6sek",
          "author": "Prestigious_Head6566",
          "text": "Can anyone explain what churn means in this context, im not a native english speaker",
          "score": 2,
          "created_utc": "2026-01-16 09:48:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzw7wgy",
              "author": "GrrasssTastesBad",
              "text": "That would be someone paying or using the product one month, then not staying with it after that.",
              "score": 2,
              "created_utc": "2026-01-16 09:58:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzw8bgm",
                  "author": "Prestigious_Head6566",
                  "text": "Thanks for the clarification",
                  "score": 1,
                  "created_utc": "2026-01-16 10:02:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzymuc4",
          "author": "NoCloutTy",
          "text": "Really cool breakdown. Currently in the \"actually talk to users before building anything\" lol. Thought I knew exactly what people wanted but turns out you never actually do. Tough pill to swallow but its been really cool connecting with people and creating something that you know will be useful before actually putting the work in. Its easy to get caught up just building building building, and not thinking about if there will actually be payoff. Excited to keep moving after hearing success like this. Thanks for sharing",
          "score": 2,
          "created_utc": "2026-01-16 18:01:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwk2xw",
          "author": "davis_untrapd",
          "text": "The jump from 12% to 5.8% churn in 2 months is honestly the most impressive part of this breakdown. Most founders I've talked to treat churn as a \"we'll fix it later\" problem and keep chasing new signups.\n\nCurious about your approach to that - was it mostly:\n- Onboarding improvements (getting people to the \"aha moment\" faster)?\n- Product changes based on why people were leaving?\n- Or proactive support reaching out before cancellation?\n\nAlso really resonated with the \"building in isolation\" mistake in months 1-2. I did the same thing - spent 6 weeks heads-down building before talking to anyone. Realized about 40% of what I built wasn't what anyone actually wanted.\n\nThe $0 CAC with 342 customers through pure organic is a strong case study for the \"distribution is as important as product\" lesson. Thanks for sharing the real numbers.",
          "score": 1,
          "created_utc": "2026-01-16 11:42:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxcl54",
          "author": "Local-Employ9800",
          "text": "Focusing this hard on churn that early is the real unlock here. Most people chase MRR screenshots and ignore the bucket leaking underneath, but your 2-month sprint on onboarding, support, and feature requests is exactly why the rest of the numbers make sense.\n\n\n\nYour path mirrors what worked for me: building in public on X, then doubling down on communities. For my SaaS, answering niche questions in subs and on Indie Hackers drove more signups than any cold email campaign. I pair that with tools like Hypefury for scheduling and Zapier for routing leads into my CRM, and lately Pulse for Reddit has been useful to track and jump into the right Reddit threads without spamming.\n\n\n\nIf you keep your “infinite runway” mindset and keep shipping in public while obsessing over retention, that $30K will feel like the small early chapter sooner than you think. Focusing on churn and distribution over flashy launches is the right move.",
          "score": 1,
          "created_utc": "2026-01-16 14:33:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzchu3",
          "author": "EmploymentProud3436",
          "text": "Really solid post. The churn reduction is the most impressive part here — a lot of founders keep chasing signups while the bucket’s leaking.\n\n\nAlso appreciate you calling out what didn’t work PH, ads, cold email. Way more useful than another “here’s my growth hack” thread. Thanks for sharing the numbers.",
          "score": 1,
          "created_utc": "2026-01-16 19:56:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01as7p",
          "author": "Willing_Builder4289",
          "text": "Solid execution. Getting churn from 12% to 5.8% in 2 months is no joke.Your focus and consistency is def rare. \n\nIf you don't mind what % of churn right now is silent churn vs explicit cancellations? That’s usually where SaaS at this stage bleeds without realizing",
          "score": 1,
          "created_utc": "2026-01-17 02:10:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qezl7m",
      "title": "Building a mobile app is easy. Getting users is not.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qezl7m/building_a_mobile_app_is_easy_getting_users_is_not/",
      "author": "Vanilla-Green",
      "created_utc": "2026-01-17 01:43:50",
      "score": 6,
      "num_comments": 17,
      "upvote_ratio": 0.81,
      "text": "I am building Zavi, an Android voice keyboard app that turns raw voice to polished text in every app and trying to figure out what actually works for early growth.\n\nWhat got you your first 100 users\n\nWhat looked promising but was a complete waste of time\n\nNot interested in theory or growth hacks.\n\nOnly things you would do again if starting from zero today.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qezl7m/building_a_mobile_app_is_easy_getting_users_is_not/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o02dgrh",
          "author": "OneHunt5428",
          "text": "best way is to find a small specific online community where people are already complaining about the problem you solve. just jump in offer genuine help and share your thing naturally when it fits",
          "score": 4,
          "created_utc": "2026-01-17 06:45:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02noeq",
          "author": "rdpl_",
          "text": "already your description is weak, do not just tell what it is but why is it better than the current solutions and why tf did you develop it if there dozen other solutions which are good enough\n\nfwiw, getting user is only hard for an app that nobody needs",
          "score": 3,
          "created_utc": "2026-01-17 08:17:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02ovzi",
              "author": "Vanilla-Green",
              "text": "But this solution people do need",
              "score": -1,
              "created_utc": "2026-01-17 08:29:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o02pk2w",
                  "author": "rdpl_",
                  "text": "no, bc, even after having you asked you are not able to answer why your solution is better than existing solutions\n\nif you are not able to articulate the most basic things how would you be able to build an app with the right feature set? \n\nthis is a waste of time of everyone, sry",
                  "score": 1,
                  "created_utc": "2026-01-17 08:35:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o03dvgk",
          "author": "AnonJian",
          "text": "You get first users in the research phase everybody jettisons to crap something out market-blind. That is not a secret or growth hack, it is supply and demand. Only supply does not obligate demand to manifest automagically.\n\nPeople post to ask how to find complete strangers they don't understand so never could have developed a product for. Abusing the word \"user\" only serves to confuse them. You are not owed users, zero is an option.",
          "score": 2,
          "created_utc": "2026-01-17 12:17:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o073ys4",
          "author": "AtmosphereNo9845",
          "text": "Personally posted videos of myself on TikTok. Looked up videos that were easy to copy and had already gone viral on Peerwatch, and just replicated them. Had like 8 accounts on 1 device and kept posting 1 time on each account a day.",
          "score": 2,
          "created_utc": "2026-01-17 23:44:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08kxgq",
          "author": "kubrador",
          "text": "the first 100 came from me spamming it in relevant discord servers and one reddit comment that blew up. literally nothing else moved the needle.\n\nspent 3 months on seo and content marketing thinking it'd be passive gold. wrote like 15 articles. got maybe 5 users total. complete ghost town.\n\nif i started over i'd just cold dm people in communities actually using voice-to-text apps (transcription discord servers, reddit threads about accessibility, youtube comment sections of similar products). sounds cringe but it converts way better than anything automated.\n\nthe real thing that finally worked was getting one youtuber to demo it casually and just... asking their audience for feedback in the replies. that's it.",
          "score": 2,
          "created_utc": "2026-01-18 04:37:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o08lwjw",
              "author": "Vanilla-Green",
              "text": "Great can you share the the relevant discords please",
              "score": 1,
              "created_utc": "2026-01-18 04:44:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o02tgk5",
          "author": "trainmindfully",
          "text": "getting the first users usually comes from one narrow use case, not the app’s full vision. early on, what works is finding people who already feel the pain badly enough to tolerate rough edges and reaching them where they already complain about it. what wastes time is broad launch posts, generic communities, or anything that assumes people want to try a new app without a strong trigger. i would do direct problem driven outreach again, even if it feels unscalable at first, because it teaches you who actually cares. once you know that, growth channels become clearer instead of theoretical.",
          "score": 1,
          "created_utc": "2026-01-17 09:12:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcapjc",
      "title": "Month 6 of my startup: Working product, zero customers. Here's what I'm learning.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qcapjc/month_6_of_my_startup_working_product_zero/",
      "author": "Healthy_Reply_7007",
      "created_utc": "2026-01-14 02:06:05",
      "score": 6,
      "num_comments": 9,
      "upvote_ratio": 0.88,
      "text": "Building in public because I need accountability.\n\n**What I'm building:**\n\nAn all-in-one workspace for engineering teams. Think Jira + Notion + meeting notes, but actually connected with AI.\n\n**The problem:**\n\nEngineers waste hours searching for context across scattered tools. When people leave, knowledge disappears. Onboarding takes forever.\n\n**Where I am:**\n\n\\- Product: Built ✓\n\n\\- Users: 0\n\n\\- Revenue: $0\n\n\\- Runway: Running out of savings\n\n**What I've tried:**\n\n\\- Cold outreach on LinkedIn (low response rate)\n\n\\- Twitter/X content (slow growth)\n\n\\- \"Subtle\" Reddit posts asking questions (no conversions)\n\n\\- Product Hunt (haven't launched yet)\n\n**What I'm trying this month:**\n\n\\- Direct Reddit posts in communities that allow it\n\n\\- Email campaign to YC founders (got a list of 5000)\n\n\\- More aggressive positioning\n\n**Lessons so far:**\n\n1. Building without users = building blind\n2. \"If you build it, they will come\" is a lie\n3. Distribution is harder than building\n4. Should have done customer discovery first\n\n**The ask:**\n\nIf you've been through this phase, what worked for you? What finally got you from 0 to 10 users?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qcapjc/month_6_of_my_startup_working_product_zero/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzhrjmn",
          "author": "kubrador",
          "text": "you built something nobody asked for and now you're trying to market your way out of a product problem\n\n\"jira + notion + AI\" is a feature list. every eng team already has tools they hate but know how to use. switching cost is massive and \"actually connected\" isn't compelling enough to overcome it\n\nyour distribution tactics are fine but they won't fix this. cold outreach, content, reddit posts - none of that matters if the value prop doesn't make someone go \"holy shit i need this today\"\n\n find 5 eng managers, hop on calls, ask what's actually painful right now. not \"would you use this\" but \"what did you waste time on this week.\" then build that specific thing for those specific people\n\nyou're 6 months in with zero users and running out of money. that's the market telling you something",
          "score": 4,
          "created_utc": "2026-01-14 05:51:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpc8ky",
              "author": "Healthy_Reply_7007",
              "text": "I appreciate your words and time you took to wrote this. 6 months I was building without talking anyone. I know I'm wrong but that doesn't mean that market is telling me about this product (market doesn't know yet).   \n  \nAnd If I make it less complicated then I would say syncally is glean. com but specifically for engineering teams and at lower cost so that early stage startups can use it. \n\nAnd there is complete market for all in one tool like clickup, linear, or any other project management tool.",
              "score": 2,
              "created_utc": "2026-01-15 10:03:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzh4f3j",
          "author": "ConsciousLeader9448",
          "text": "It’s definitely difficult marketing these all in one platforms because it seems much more intimidating to pay for than some niche saas, even if it has more value. I faced the same problem with my platform which helps people make money online. What got me users was a mix of content on TikTok, reels, X, YouTube. You just wanna speak authentically and hook people’s attention",
          "score": 1,
          "created_utc": "2026-01-14 03:14:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpcbl3",
              "author": "Healthy_Reply_7007",
              "text": "I get your concernt there is complete market for all in one tool like clickup, linear, or any other project management tool. I feel all project management tools are already all-in-one platform.",
              "score": 1,
              "created_utc": "2026-01-15 10:04:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzmqksp",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-14 23:12:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpchw8",
              "author": "Healthy_Reply_7007",
              "text": "Wait when did I said I spend 5k$? Looks like this comment is also generated by SignalSCouter lol.",
              "score": 1,
              "created_utc": "2026-01-15 10:06:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o07fsl4",
          "author": "HalastersCompass",
          "text": "Don't think you thought this one through",
          "score": 1,
          "created_utc": "2026-01-18 00:47:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o09hlw7",
              "author": "Healthy_Reply_7007",
              "text": "what do you mean?",
              "score": 1,
              "created_utc": "2026-01-18 09:08:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qfk1em",
      "title": "Is anyone else nostalgic for the joy of random physical rewards?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qfk1em/is_anyone_else_nostalgic_for_the_joy_of_random/",
      "author": "sirdangc8k",
      "created_utc": "2026-01-17 17:59:15",
      "score": 6,
      "num_comments": 9,
      "upvote_ratio": 0.88,
      "text": "Some of my best childhood memories came from opening treasure chests in RPGs, pulling collectible cards, or getting a surprise toy in a kids' meal. That element of surprise and tangible reward left a lasting impression.\n\nI’ve been thinking about how apps today are all digital points, badges, streaks; but rarely offer anything physical. What if an app could mail you a surprise gift after hitting a milestone, like earning points, gaining subscribers, or completing a challenge?\n\nHas anyone seen something like this done well? Do you think people would value a physical token for digital achievements? I’m exploring the idea and would love to hear your thoughts or creative use cases!\n\n*I’m working on a project related to this that ties software and a bunch of expensive manufacturing machines to do it all in house. And will be sharing the ride along journey with ya'll!*\n\n*I share a little more in this video* on my reddit profile\n\nLmk what you think 🙏",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qfk1em/is_anyone_else_nostalgic_for_the_joy_of_random/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o05tfiw",
          "author": "simon_mo",
          "text": "Oh my god, like 10000 percent. They still do it in Japan and they do it really well!",
          "score": 1,
          "created_utc": "2026-01-17 19:48:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05uaov",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-17 19:52:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05uar7",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qfk1em/is_anyone_else_nostalgic_for_the_joy_of_random/o05uaov/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-17 19:52:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o06137m",
          "author": "lkbngwtchd",
          "text": "Like youtube?",
          "score": 1,
          "created_utc": "2026-01-17 20:26:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o06hif5",
              "author": "SpottedOutpost",
              "text": "Yes like YouTube badges but for normal people / customer accounts",
              "score": 1,
              "created_utc": "2026-01-17 21:50:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o070bbb",
          "author": "NoCloutTy",
          "text": "This is cool, what kind of items do you have in mind?",
          "score": 1,
          "created_utc": "2026-01-17 23:25:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07x7fi",
          "author": "kubrador",
          "text": "only thing that'll kill you is logistics and unit economics until you scale, so you better nail the manufacturing side hard or you're just paying to ship people $2 trinkets. but if you've got the machines in-house and figured out the math, you're already ten steps ahead of every other app trying this. go absolutely bonkers with it.",
          "score": 1,
          "created_utc": "2026-01-18 02:19:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0851hi",
          "author": "trainmindfully",
          "text": "the nostalgia is real, but the hard part isn’t the idea, it’s the economics and logistics once novelty fades. physical rewards feel magical at first, then users start anchoring on cost, delays, and consistency. most attempts i’ve seen die when shipping friction eats margins or expectations spike. i’d be curious how you think this stays special past the first few milestones without turning into a fulfillment business.",
          "score": 1,
          "created_utc": "2026-01-18 03:02:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09z3b4",
          "author": "MASTERV10",
          "text": "I miss it so much.",
          "score": 1,
          "created_utc": "2026-01-18 11:48:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qf2odo",
      "title": "I can't find good leads.. even with a good amount of skill and expereince",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qf2odo/i_cant_find_good_leads_even_with_a_good_amount_of/",
      "author": "hail596",
      "created_utc": "2026-01-17 03:49:10",
      "score": 6,
      "num_comments": 21,
      "upvote_ratio": 0.87,
      "text": "A bit of context on what I do - I run an Operations Management Service Agency, and what we specialize in is finding solutions to backend problems that can be done remotely. On the surface level, it can be Customer Support, Virtual Assistant, etc.  We go deeper into CRM's, Project Management. My team creates SOPs around the role to train the team and solidify the process. \n\nHowever, after Three Employees, I have realized that I charge way less than what I should, but I can't let go of the current business since I have to meet payrolls and living expenses. The only way I see out of this is by getting good leads. Yet, I see these freelancing platforms being oversaturated, and one-time projects don't work for me. I like to build relationships with the client and work on retainer. \n\nAll the Seasoned Entrepenuers help this newbie out please. ",
      "is_original_content": false,
      "link_flair_text": "Collaboration Requests",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qf2odo/i_cant_find_good_leads_even_with_a_good_amount_of/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o02028y",
          "author": "Genflos",
          "text": "What is your existing marketing channels? Current pitch? Current lead qualification requirements? \n\nSince your title states “skilled & experienced”whilst in the text you seek seasoned people to help a newbie out, what is the skills and exp which you’re actually referring to?",
          "score": 1,
          "created_utc": "2026-01-17 04:58:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o021yil",
              "author": "hail596",
              "text": "I have none, you can say I got lucky to have found my clients through discord and Reddict took me almost a year to convert them by constant follow ups. My skills and experinence lies in what I do. Creating SOPs, systems, and executing on them. \n\nFor the past few months I had been focusing on the work itself, now I have realized that I need to grow atleast to a point where 1 - 2 clients leaving doesn't hurt me",
              "score": 1,
              "created_utc": "2026-01-17 05:12:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o023p8b",
          "author": "ExpressAdvisor3692",
          "text": "I’m guessing this post is just trying to promote your services. Probably won’t work very well since it barely makes any sense. \n\nWhat do your employees do? You need to figure out your lead gen strategy and the someone needs to be doing sales while others do the work to fulfill the service. \n\nThat’s how agencies work. If you don’t know this, you don’t have an agency.",
          "score": 1,
          "created_utc": "2026-01-17 05:24:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o024a6d",
              "author": "hail596",
              "text": "My employees work on providing the service, but I am too heavily involved. I know how lead gen works. The thing I am looking for is crafting a strategy for it",
              "score": 1,
              "created_utc": "2026-01-17 05:29:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0341tx",
          "author": "kubrador",
          "text": "you're charging too little because you haven't found clients who actually value the work, which is a lead problem disguised as a pricing problem. freelance platforms are dead for retainer work anyway.\n\nstop fishing in the saturated pond. go find where your ideal clients actually hang out. if you're solving backend ops for growing businesses, they're probably in slack communities, facebook groups for \\[their industry\\], linkedin where they're posting about scaling, maybe in cohorts for business owners. you need to network directly with people who already understand why ops systems matter, not convince randos on upwork that your sop-building is worth something.\n\nyour best lead right now is probably asking your three current clients \"who else do you know that complains about this exact problem\" and actually following up on it. referrals from people who've seen the work beat cold outreach 100 times over.",
          "score": 1,
          "created_utc": "2026-01-17 10:51:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03auig",
          "author": "wildgrass56",
          "text": "sounds like you need a better lead gen system rather than relying on freelance platforms. I've heard people have good results with for finding higher quality B2B leads, might be worth checking out since you're looking for retainer clients not one-off projects.\n\nalso just a thought, but if you're undercharging you could gradually raise rates for new clients while keeping existing ones at thier current rate until you build up enough revenue to transition away from the lower paying work.",
          "score": 1,
          "created_utc": "2026-01-17 11:52:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05knyu",
          "author": "RoundRockBusiness",
          "text": "You’re definitely not alone in this a lot of service businesses hit this exact wall once payroll becomes real.\nUnderpricing early makes sense when you’re just trying to get traction, but it gets painful fast when the business depends on volume instead of margin.\n\nOne thing I’ve noticed (and struggled with myself) is that the issue usually isn’t the work or even demand it’s that the offer ends up being framed like “extra help” instead of “core operations.” When clients see it as optional, pricing pressure never goes away.\nI’m curious when you’re talking to prospects now, what do they usually say yes to first? Is it support tasks, systems cleanup, or something else? That answer usually points to where pricing power actually lives.",
          "score": 1,
          "created_utc": "2026-01-17 19:06:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07moof",
          "author": "Remarkable_Guava942",
          "text": "Most people stuck at zero clients usually have one of three problems:\n\t1.\tThe offer is unclear\n\t2.\tThe outreach message has no hook\n\t3.\tThey’re talking to the wrong audience\n\nIf you want, tell me what you’re selling and how you’ve tried getting clients — I’ll point out the exact issue.",
          "score": 1,
          "created_utc": "2026-01-18 01:22:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o07ulsr",
              "author": "hail596",
              "text": "I did explain in private dms",
              "score": 1,
              "created_utc": "2026-01-18 02:04:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o08phh2",
                  "author": "Remarkable_Guava942",
                  "text": "yes dm me",
                  "score": 1,
                  "created_utc": "2026-01-18 05:09:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o08zjzt",
              "author": "Dizzy-Criticism-7836",
              "text": "Main thing: you’re probably selling “operations help” instead of a specific business outcome. Reframe your offer as “we cut refund tickets 30%” or “we ship every order in 24h without extra headcount,” then only target businesses clearly feeling that pain. I use Apollo and Clay to find those signals and scrape language from Reddit/Quora via Pulse alongside LinkedIn posts so my outreach copy mirrors how those buyers actually talk.",
              "score": 1,
              "created_utc": "2026-01-18 06:26:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0963ae",
                  "author": "Wide_Brief3025",
                  "text": "Focusing on outcome based messaging definitely works better, especially if you reflect the exact phrases your audience uses. To speed up surfacing those buyer signals, you might want to try tools like ParseStream that send instant alerts for keywords and filter for high intent posts. It can save a lot of time so you do not have to manually watch every Reddit thread.",
                  "score": 1,
                  "created_utc": "2026-01-18 07:23:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0aaylg",
          "author": "UseApart2127",
          "text": "The lead problem usually isn’t skill. It’s positioning.\n\n“Ops management / backend / CRM / SOPs” is too broad to be memorable or referable. Buyers can’t picture *when* to call you.\n\nPick one painful moment you solve better than anyone (ex: “we clean up broken HubSpot after fast growth” or “we turn chaotic support teams into SOP-driven ops in 30 days”).\n\nOnce the use-case is sharp, leads get easier and retainers make sense.\n\nPlatforms aren’t oversaturated. Generic offers are.",
          "score": 1,
          "created_utc": "2026-01-18 13:19:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0acexy",
              "author": "hail596",
              "text": "Thank you so much that makes a lot of sense. I appreciate the feedback",
              "score": 1,
              "created_utc": "2026-01-18 13:29:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0bt144",
          "author": "Freelance_Ai",
          "text": "This is actually very common, even with skilled agencies.\n\nFrom what I’ve seen, the issue is rarely the service quality — it’s usually:\n- unclear ICP\n- weak positioning\n- or chasing leads in the wrong channels\n\nI’ve been helping founders test alternative lead channels (Reddit, outbound targeting, tighter niches) instead of generic cold outreach.\n\nIf you’re open, I’d be happy to look at your current approach and share a few concrete ideas. No pitch.",
          "score": 1,
          "created_utc": "2026-01-18 17:56:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bzff2",
          "author": "medazizln",
          "text": "Freelance platforms are basically a trap for ops agencies because clients go there looking for cheap labor, not actual systems. If you want retainers, you have to stop waiting for inbound and start picking the exact companies you want to work with. The pricing problem solves itself when you target founders who are actively drowning in chaos rather than people looking for a $5/hour VA. You need to control the channel.",
          "score": 1,
          "created_utc": "2026-01-18 18:26:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0diyzj",
          "author": "shazej",
          "text": "You’re not struggling because you lack skill. You’re stuck in the hardest phase most service agencies hit underpriced retainers plus payroll pressure.\n\nIn my experience the issue usually isn’t “finding leads” but who you’re talking to. Ops services sell best when the pain is already obvious founders who feel buried scaling teams or businesses post-hire where things are breaking.\n\nFreelance platforms push you into price competition and one-off work which fights your retainer model. Relationships tend to come more from referrals partnerships or being visible where operators already complain about ops problems.\n\nIt’s slow at first but one aligned client can be worth more than ten random leads.",
          "score": 1,
          "created_utc": "2026-01-18 22:58:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhefgc",
      "title": "Ask me any marketing questions!",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qhefgc/ask_me_any_marketing_questions/",
      "author": "adrian-gonzal3z",
      "created_utc": "2026-01-19 19:42:35",
      "score": 6,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "Did this a while back and thought it was fun so I'm doing it again.\n\nAsk me any marketing questions. My expertise is in SEO, email marketing, and social media.\n\nI'm not going to PM you or pitch you on anything after you comment. No strings attached, all I get out of this is some insight to use on pitching in the future.",
      "is_original_content": false,
      "link_flair_text": "Resources & Tools",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qhefgc/ask_me_any_marketing_questions/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0jcl2b",
          "author": "Spirited_Manager_831",
          "text": "What is the best way to start doing marketing for my fiction book? \n\nI create content on a regular basis and have a newsletter, but it's mostly education on how to write a book. \n\nHowever, my first book is almost ready for publication, and if I go down the independent route, I’ll have to market it myself.\n\nI know email marketing and social media are important, but do you have any advice for this industry in particular?",
          "score": 2,
          "created_utc": "2026-01-19 20:04:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0jj924",
              "author": "adrian-gonzal3z",
              "text": "Be super nice to smaller influencers and see if they're willing to promote it.\n\nYou could talk about the writing process itself on TikTok and see if people are interested in the story you're telling. Makes you and the story seem so much more relatable",
              "score": 1,
              "created_utc": "2026-01-19 20:35:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0jq8h3",
          "author": "PersonalEcho9244",
          "text": "If you were running both a service business and a local lead gen site at the same time, how would you prioritize marketing so one feeds the other?",
          "score": 2,
          "created_utc": "2026-01-19 21:08:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mgd4d",
          "author": "Loud_Piece_8212",
          "text": "What marketing tools do you use? How does your day-to-day usually look like?",
          "score": 2,
          "created_utc": "2026-01-20 06:23:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mgv1i",
              "author": "adrian-gonzal3z",
              "text": "Semrush, Canva, Adobe Suite, Screaming Frog are my main ones right now. I don't particularly like social media scheduling tools.\n\nday to day includes seeing my different clients emails and working on their deliverables",
              "score": 1,
              "created_utc": "2026-01-20 06:27:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0jkjg0",
          "author": "DecisionOperator",
          "text": "what’s the fastest way to prove your marketing isn’t just “activity”?\n\n\ngive me one metric you trust, one action that moves it, and the earliest point you’d admit it’s not working and cut it.",
          "score": 1,
          "created_utc": "2026-01-19 20:41:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l01n7",
          "author": "SneezerEclipse",
          "text": "There is this TCG that totally flopped on their tech side (Altered TCG).  It had massive momentum from its Kickstarter campaign, but then they overpromised on delivering the product.  There aren’t any stores selling singles (where you buy one card at a time.  The game is dead, is the mantra on their subreddit.\n\nAnyways, they finally released the marketplace.  They allow print on demand for any card that a player owns.  So what did I do?  Degenerate gambling per usual.  \n\nI bought up all the first edition meta, collectible, and favorite cards I like, to a guess of 2-3% of their total print for these cards.  I didn’t want to hinder the game, but I wanted to take advantage of a low market.  \n\nThe company hasn’t given up yet and is in set 5, but the digital cards they offer don’t move in price much in the digital market because only a relative few cards are being bought while the other are being dumped.\n\nMy question is, how can I inspire a market bounce?  The Kickstarter cards seem to have created a precedent that digital cards “should be worthless.”  I believe that all the cards should be subject to “investors” and that the pricing of the cards should be both the cards that are doing well in tournaments and the cards that people love to collect.  \n\nAny ideas for online advertising for a worthy but struggling TCG?\n\nSorry, this is long.",
          "score": 1,
          "created_utc": "2026-01-20 01:05:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l4c8g",
          "author": "Extreme_Log5264",
          "text": "What's your advice to someone trying to get their foot in the door for an entry level career job? Especially with today's job market.",
          "score": 1,
          "created_utc": "2026-01-20 01:28:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mmrlb",
          "author": "MORPHOICES",
          "text": "If today you had nothing but a scrappy solo project, for example, what would your first 30 days of marketing actually look like? \\~\n\nThe realistic plan, with limited time, no audience and no budget, is the one we create.",
          "score": 1,
          "created_utc": "2026-01-20 07:17:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mnndo",
          "author": "Training-Dinner1660",
          "text": "Se agradece tu predisposición. Ahí va mi pregunta. ¿Cuál puede ser un Stack de Apps adecuado para lanzar un SideHustle, y para qué utilizarías cada herramienta?\n\n¡Mil gracias!",
          "score": 1,
          "created_utc": "2026-01-20 07:25:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0msrko",
          "author": "cryptic_epoch",
          "text": "Which tools or platforms do you use to generate customer leads for your business  ?",
          "score": 1,
          "created_utc": "2026-01-20 08:11:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mvkp4",
              "author": "Wide_Brief3025",
              "text": "Focusing on where your audience already hangs out is huge for lead generation. Reddit and Quora are goldmines if you know how to listen for the right conversations. If you want to track high intent mentions instantly without digging through posts manually, ParseStream is worth a look since it alerts you about relevant leads with AI filtering.",
              "score": 2,
              "created_utc": "2026-01-20 08:37:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0mwu7v",
                  "author": "cryptic_epoch",
                  "text": "Fascinating! Let me have a look..",
                  "score": 1,
                  "created_utc": "2026-01-20 08:49:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qe0cko",
      "title": "Finding the best b2b lead gen agency for a seed-stage startup.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qe0cko/finding_the_best_b2b_lead_gen_agency_for_a/",
      "author": "im04p",
      "created_utc": "2026-01-16 00:02:56",
      "score": 6,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": " We have a very limited burn rate, so we need to be incredibly efficient with our sales spend. I’m looking for the best b2b lead gen agency that specializes in zero to one growth. Most of the agencies I see want to work with established companies that already have 10+ sales reps. We just need someone to help us book our first 20-30 discovery calls so we can validate our messaging. Are there any startup-friendly agencies that offer flexible pricing or smaller pilot programs? I’d love to find a partner that is as scrappy as we are.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qe0cko/finding_the_best_b2b_lead_gen_agency_for_a/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzy23zn",
          "author": "Sudden-Context-4719",
          "text": "If you’re tight on budget and need quick validation, try using SocListener to find relevant sales posts on Reddit and engage directly with prospects. It’s good for booking discovery calls without a big agency or team. That way you can test your messaging before spending on pricey lead gen firms.",
          "score": 2,
          "created_utc": "2026-01-16 16:30:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztwapj",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-16 00:22:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nztwarx",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qe0cko/finding_the_best_b2b_lead_gen_agency_for_a/nztwapj/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-16 00:22:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzubr0i",
          "author": "Monkeyboogaloo",
          "text": "As an ex agency owner I totally understand why they all wqw would want to work with bigger clients. \n\nIf you want to have a chat about ways to do it scrappy and in budget I can give you some ideas.\n\nWhats the product/servicc and who is your icp?",
          "score": 1,
          "created_utc": "2026-01-16 01:47:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzujm67",
          "author": "Nightlow21",
          "text": "Setting up lead gen ads is relatively simple. When you have lower spend you need to be very niche and specific. Costs will be higher but that’s how you’ll get traction. All the best practices out there are to go broad and do ROS to figure out what works and that’s great and all of you have the budget, time and analysis to do so. \n\nIf you are trying to gain clients organically that will be tougher but also doable.",
          "score": 1,
          "created_utc": "2026-01-16 02:31:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvh5cr",
          "author": "bravelogitex",
          "text": "you should be doing this yourself. just use linked helper + clay + maybe openphone if cold calling works.",
          "score": 1,
          "created_utc": "2026-01-16 06:03:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzz54io",
          "author": "KoumKoumBE",
          "text": "Sorry for the maybe naive answer, but why not LinkedIn Ads with its Lead Gen form?\n\nI used LinkedIn ads to recruit testers for my product (in-person). I'm very happy with how it went, and it turns out that it also attracted secondary attention. 2 investors visited my company page, and a news agency contacted me because they saw the ad.\n\nThe weird thing is that the ad was very generic, such as not to \"pre-seed\" the testers with information on the product. It was a simple \"Test a new \\[product family\\] in \\[city\\]\".\n\nFor LinkedIn ads, again from my limited experience, it seems that images and carousel images work better than videos. If you are tight on budget, vision LLMs (ChatGPT does it) are quite useful to review ads that you make yourself. Just upload your ad as a not-too-large file, tell the LLM what person it should be (\"A LinkedIn user, junior to manager in \\[city\\], working in an office\"), then ask it to describe all the feelings it has by looking at the image.\n\nExpect a cost per lead of about $30 if the targetting is correct and the ad looks nice.",
          "score": 1,
          "created_utc": "2026-01-16 19:22:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzz5jnk",
          "author": "Futuristic-D",
          "text": "What kind of solution do you offer?",
          "score": 1,
          "created_utc": "2026-01-16 19:24:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o004c58",
          "author": "erickrealz",
          "text": "The honest advice you probably don't want to hear: at seed stage trying to validate messaging, you shouldn't outsource this. The discovery calls are where you learn what resonates, what objections come up, and how to position your product. Handing that to an agency means they learn instead of you.\n\nOur clients who outsourced outbound before finding product-market fit usually wasted money and time. The agency books calls but the messaging is wrong, so the calls don't convert, so you don't know if it's bad leads or bad positioning or bad product. The feedback loop breaks when there's a middleman.\n\nThe 20-30 discovery calls for messaging validation is maybe two weeks of focused founder outbound. LinkedIn outreach to your ICP, personalized emails, maybe some warm intros from investors. It's uncomfortable if you're not a natural salesperson but the learning is irreplaceable.\n\nIf you absolutely need agency help, look for freelancers or tiny shops rather than agencies. A solo operator who does cold email setup and sends on your behalf for $1-2k monthly is more startup-appropriate than an agency with minimums designed for funded companies. The \"pilot program\" agencies advertise is often just a shorter commitment at the same monthly rate.\n\nThe scrappy partner you're looking for is probably a fractional SDR or a freelancer, not an agency with a sales team to feed.",
          "score": 1,
          "created_utc": "2026-01-16 22:08:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00cmmo",
          "author": "CoffeeAndWins",
          "text": "You should check out BOSS Assistants based out of Canada, they are start up friendly with low monthly costs and they are super targeted/intentional about who they reach out to so they don't fill your calendar with wrong fit leads",
          "score": 1,
          "created_utc": "2026-01-16 22:49:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00v17v",
          "author": "AcanthisittaNo6174",
          "text": "Happy to help. I’ve been in tech sales as a VP for years. Can offer guidance and advice bc I love seeing growing companies succeed. If you need recruitment help I strongly believe this is the most important moment to have the best sellers otherwise meetings booked are pointless dm me if interested",
          "score": 1,
          "created_utc": "2026-01-17 00:32:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09r54h",
          "author": "selfyze_co",
          "text": "Most agencies want established companies because it’s easier. But seed-stage is actually where good outbound makes the biggest difference - you can validate your messaging fast and get to 20-30 calls in a few weeks.\nThe key is finding someone who’ll set it up properly from day 1 (infrastructure, targeting, sequences) rather than just throwing emails at a wall. Happy to share what’s working if useful.",
          "score": 1,
          "created_utc": "2026-01-18 10:37:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09s433",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-18 10:46:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o09s448",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qe0cko/finding_the_best_b2b_lead_gen_agency_for_a/o09s433/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-18 10:46:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0fymp6",
          "author": "Alone-Arm-7630",
          "text": "I’d definitely look into OutreachBloom. They are specifically geared toward early-stage B2B growth and offer the kind of smaller, flexible pilot programs you're looking for. It’s a solid way to get those initial meetings without blowing your entire budget.",
          "score": 1,
          "created_utc": "2026-01-19 08:09:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kjieq",
          "author": "cole-interteam",
          "text": "I totally get the burn rate concern. For a seed-stage startup, I’d look for a B2B paid search agency with case studies in your deal size, senior people actually running the account, a clear testing/reporting cadence, and a short pilot instead of a long contract.\n\nThat’s how we run things at my agency, and  I even put together a short checklist for vetting agencies on those points. If you want, I’m happy to DM the criteria I use.",
          "score": 1,
          "created_utc": "2026-01-19 23:36:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}