{
  "metadata": {
    "last_updated": "2026-02-03 17:18:12",
    "time_filter": "week",
    "subreddit": "EntrepreneurRideAlong",
    "total_items": 20,
    "total_comments": 217,
    "file_size_bytes": 210735
  },
  "items": [
    {
      "id": "1qqvfmg",
      "title": "Update: I’m the 16yo who posted about making my first $500. Thanks to you, I just hit $1,500. I want to pay it forward with the strategy that worked.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qqvfmg/update_im_the_16yo_who_posted_about_making_my/",
      "author": "Safe_Thought4368",
      "created_utc": "2026-01-30 04:24:01",
      "score": 182,
      "num_comments": 26,
      "upvote_ratio": 0.89,
      "text": "I honestly owe this community a massive thank you.\n\nA few weeks ago, i posted my story here just a 16-year-old kid sharing a small win of making my first $500. i was terrified of being judged or ignored. Instead, the advice, DMs, and encouragement i received literally changed my trajectory.\n\nBecause of the doors that opened and the confidence i gained from your comments, I’ve managed to scale that initial win to around $1.500 in revenue this month. I’ve even locked in deals with national and international brands.\n\nI’m not saying this to brag. I’m saying this because i want to give back. i don't have a course to sell, but I do have a process that works for me. If this helps even one person get their first client, I’ll be happy.\n\nHere is the exact blend of high tech and  old school hustle I used to fill my pipeline:\n\n1) The AI approach or lead Gen\n\nI realized that spamming people with generic IA templates is a waste of time. Instead, I use AI to be more human, not less.\n\nI use AI agents to scrape leads, but I filter strictly by pain points. I don't look for successful businesses. I look for businesses with great products but terrible websites, or active Instagrams with no link in bio, or some kind of problem that i can fix.\n\nI feed the business's data into an LLM to draft a cold email, but i force it to focus on their problem, not my service.\n\nI never send the raw AI output. i rewrite the opening line manually to prove i actually looked at their brand. High personalization == High response rate.\n\n2. Networking\n\nThis was a game-changer advice I got from a user here.\n\nI stopped trying to act like a corporate agency and started owning my age.\n\nI reach out to potential leads on LinkedIn or email saying I'm a 16 years old student building a business, and I'd love your feedback on X.\n\nPeople are incredibly kind when they see you are young and trying to build something. They lower their guard, they give advice, and often, that advice turns into a contract because they want to support the hustle.\n\n3. Boots on the ground \n\nThis is the one most people skip because it's uncomfortable, but it brought me my best clients.\n\nI physically walk into local businesses.\n\nI don't pitch. i listen. i ask, what is the most annoying thing about your marketing /tech right now?\n\nI offer to lend a hand with something small for free first. Fix a glitch, edit a photo, update a setting.\n\nThat small act of kindness builds trust faster than any cold email ever could.\n\nTo the community ❤️\n\nThank you for not dismissing me because of my age. You guys gave me the push i needed to take this seriously.\n\nA question for those ahead of me:\n\nI’m starting to get to the point where i have more leads than time. For those who scaled past this point did you automate more first, or did you hire help immediately?",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qqvfmg/update_im_the_16yo_who_posted_about_making_my/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o2jrm7z",
          "author": "TwoBitFoundry",
          "text": "Hey, advice is free, it was you who took it and made it happen! Congrats on your recent success.\n\nIt's still important to finish school. Success isn't guaranteed, and it only serves you to broaden your skillsets and perspectives. I say ride the wave with your business, and let it fund the things you want to achieve in life, whether that is funding college, or bigger and more enterprising ventures that can scale beyond what time you personally have available.\n\nIn the meantime, you could look into only taking projects that are worth it to you. Not every project will be equal, and maybe your time is more valuable than $500, or later $1500, or later who knows?",
          "score": 17,
          "created_utc": "2026-01-30 04:54:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jt98c",
              "author": "Safe_Thought4368",
              "text": "Of course you're right, and besides, my school offers many opportunities that I won't hesitate to take advantage of.",
              "score": 6,
              "created_utc": "2026-01-30 05:05:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2krriq",
          "author": "that-dude_mike",
          "text": "This is an awesome story and really encouraging! Thanks for sharing",
          "score": 4,
          "created_utc": "2026-01-30 09:53:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k9dzm",
          "author": "No_Imagination97",
          "text": "This 16 y/o kid is already wiser than most adults I know",
          "score": 6,
          "created_utc": "2026-01-30 07:08:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yja6l",
              "author": "Palnubis",
              "text": "maybe a 36 y/o in disguise.",
              "score": 1,
              "created_utc": "2026-02-01 12:18:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2jq8aj",
          "author": "Previous_Shopping361",
          "text": "Gret stuff. Lot's of learning I see 🥰",
          "score": 2,
          "created_utc": "2026-01-30 04:45:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jrebm",
              "author": "Safe_Thought4368",
              "text": "Thanks a lot, friend. Another tip I forgot to add is to build your presence publicly. Help out in communities and get involved, and of course, receive help yourself. It's not focused on finding clients, but this way you get advice from people in your field who know their stuff, and much more!",
              "score": 1,
              "created_utc": "2026-01-30 04:52:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ky909",
          "author": "genius1soum",
          "text": "What's the business?",
          "score": 2,
          "created_utc": "2026-01-30 10:50:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l3oi6",
          "author": "Any_Interest_3509",
          "text": "Happy to see a pt2. Keep at it man",
          "score": 2,
          "created_utc": "2026-01-30 11:35:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mwfnb",
          "author": "Corgi-Ancient",
          "text": "If you’re drowning in leads, I’d suggest automating first to keep things manageable. Tools like SocLeads can help you quickly sort and validate leads so you don’t waste time chasing bad contacts. \n\nHiring help is great but can get expensive fast if your lead quality isn’t solid yet.",
          "score": 2,
          "created_utc": "2026-01-30 17:13:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jtgvg",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-30 05:06:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jtgx6",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qqvfmg/update_im_the_16yo_who_posted_about_making_my/o2jtgvg/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-30 05:06:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2mqqle",
          "author": "Jealous_Laugh4546",
          "text": "Great going. What are you building.",
          "score": 1,
          "created_utc": "2026-01-30 16:48:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2naj4t",
          "author": "phtmadv",
          "text": "Well done!",
          "score": 1,
          "created_utc": "2026-01-30 18:15:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2nh0ku",
          "author": "EducationalBit6761",
          "text": "Well done!",
          "score": 1,
          "created_utc": "2026-01-30 18:44:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2q1z6n",
          "author": "Xtrmist78",
          "text": "Legit",
          "score": 1,
          "created_utc": "2026-01-31 02:40:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sarb6",
          "author": "goodnewspixels",
          "text": "Great job on building on your success! Your growing lead pipeline shows you’re in high demand for your skills. Now’s the time to start increasing your rates gradually, as you’re consistently delivering results that demonstrate the value of your service. If your pipeline remains busy even after raising your rates, it might be that you’re undercharging. Keep raising your rates until you start seeing resistance from clients. 🙏",
          "score": 1,
          "created_utc": "2026-01-31 13:28:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2t4659",
          "author": "footmumo",
          "text": "This is Wwesome do you mind sharing which AI platforms you’re using?",
          "score": 1,
          "created_utc": "2026-01-31 16:07:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2w95cw",
          "author": "StreetEngineering872",
          "text": "Thank you for sharing",
          "score": 1,
          "created_utc": "2026-02-01 01:39:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xl0m3",
          "author": "victorious02",
          "text": "Keep it up young man you will reach high peaks",
          "score": 1,
          "created_utc": "2026-02-01 07:09:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o343vqk",
          "author": "Sad-University-3766",
          "text": "Thanks for sharing, this was inspirational to read. Looking forward to hearing to the next step in your journey",
          "score": 1,
          "created_utc": "2026-02-02 06:31:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bo3hz",
          "author": "Tricky_Tax_2125",
          "text": "If you want to hire someone, i can work for you. I have a lot of time on my hands. lmk",
          "score": 1,
          "created_utc": "2026-02-03 11:19:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2nxam9",
          "author": "Freedom_1110",
          "text": "This is honestly one of the cleaner early-stage writeups I’ve seen here — especially the part about using AI to be *more* human. From what we’ve seen, the real bottleneck you’re about to hit isn’t automation vs hiring — it’s **decision drag**. When everything still “kind of works,” scaling the wrong piece actually slows you down. Curious: what’s currently eating most of your time — lead qualification, delivery, or context switching?",
          "score": 0,
          "created_utc": "2026-01-30 19:57:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2o2825",
              "author": "Freedom_1110",
              "text": "To clarify what I meant by decision drag — it’s when everything is “working enough” so nothing feels urgent, but you’re paying for it in mental load. Usually shows up as constant context switching before anything actually breaks.",
              "score": 1,
              "created_utc": "2026-01-30 20:20:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2laaj3",
          "author": "Legitimate-Owl-3385",
          "text": "Hey man, Im 17 years old need a startup idea and guidance could you help me startup cuz I dont know how to do lead gen or anything, need your help man reach out to me please",
          "score": -2,
          "created_utc": "2026-01-30 12:23:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp4gvy",
      "title": "I tested buying Instagram followers in 2026 - Here's my thoughts",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qp4gvy/i_tested_buying_instagram_followers_in_2026_heres/",
      "author": "No-Professional2832",
      "created_utc": "2026-01-28 07:10:14",
      "score": 98,
      "num_comments": 54,
      "upvote_ratio": 0.97,
      "text": "I actually went ahead and tested a service recently because I needed a push, but the results were pretty mixed. I am now back to searching for a reliable alternative that actually delivers what they promise, since the last site I used didn't really meet my expectations.\n\nI have been creating content on Instagram for a while, and I really enjoy it, but my engagement has slowed down. My posts get views, but likes, comments, and shares are not growing the way I hoped. I decided to buy Instagram followers because even though I post regularly and use hashtags, it still feels like some of my videos go unnoticed.\n\nI spent time reading discussions on Reddit and other platforms to understand how creators improve engagement. A friend also told me that it helped them get more visibility, but the specific site I tried just didn't deliver the quality I needed.\n\nMy goal is to find services that offer real, active profiles that help content get noticed without putting an account at risk. If anyone has experience with buying Instagram followers from a better source that improved engagement, I would really appreciate your advice.\n",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qp4gvy/i_tested_buying_instagram_followers_in_2026_heres/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o26qc9g",
          "author": "therealawesomeroy",
          "text": "I fell for this about a year ago when I was desperate to hit a milestone, I went to a site that promised premium accounts and paid good money to buy followers on Instagram. Within two weeks Instagram wiped them all out and my reach hit rock bottom, it took me months of posting every single day just to get my views back to normal so I really regret doing it.",
          "score": 16,
          "created_utc": "2026-01-28 09:38:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2m8cop",
              "author": "Far_Run_1328",
              "text": "Oof yeah, that wipe is brutal. If someone’s still going to do it, the only way I’ve seen it not tank reach is super slow drip with better quality accounts so it doesn’t look like a bot dump. SocialDawn was the most consistent for that in my experience.",
              "score": 4,
              "created_utc": "2026-01-30 15:25:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2rfo36",
              "author": "AcceptableShock8691",
              "text": "We got like 10k followers in Storeffame helped us good with algorithm",
              "score": -8,
              "created_utc": "2026-01-31 09:04:26",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2rfmme",
              "author": "AcceptableShock8691",
              "text": "Only Storeffame got real folowers that influencers use. Only site with real followers",
              "score": -9,
              "created_utc": "2026-01-31 09:04:04",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2oaaf9",
              "author": "Plastic_Ad_3273",
              "text": "I’ve tested a lot of follower/like services over the years. Most cheap ones don’t work or cause drops. The only consistent results I’ve seen come from engagement-based packages (likes, saves, profile visits) delivered gradually. They cost more but are much safer long-term.",
              "score": -11,
              "created_utc": "2026-01-30 20:59:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o27rfli",
          "author": "Pretend-Raspberry-87",
          "text": "\nIf you have 1k real fans that is worth way more than 10k bots, focus on the people who are already there",
          "score": 23,
          "created_utc": "2026-01-28 14:01:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rfqr6",
              "author": "AcceptableShock8691",
              "text": "Influencers only use Storeffame for real followers however 5k-10k followers is better becuz algorithm notice you more",
              "score": -9,
              "created_utc": "2026-01-31 09:05:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o27mraa",
          "author": "Ready_Evidence3859",
          "text": "I tried a service once that claimed to use AI to target real people, it worked for like a week and then everything disappeared.",
          "score": 13,
          "created_utc": "2026-01-28 13:37:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2r4bw6",
              "author": "rajpootgonnarock",
              "text": "How it’s works in the first week ? Was it real accounts or bots, i have tried similar site few got disappeared but i contact them and they fix it immediately.",
              "score": -8,
              "created_utc": "2026-01-31 07:18:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2rfssy",
              "author": "AcceptableShock8691",
              "text": "Thats because you bought bots.\n\nOnly few sites have real followers. And only one that is legit is STOREFAMEE.",
              "score": -8,
              "created_utc": "2026-01-31 09:05:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o27gek9",
          "author": "PsychologicalMud3900",
          "text": "\n\nHas anyone here actually found a safe way to buy IG followers without triggering a ban, I see big influencers do it all the time and they seem fine.",
          "score": 11,
          "created_utc": "2026-01-28 13:01:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27up4x",
              "author": "Separate_Ad_4781",
              "text": "\nThey probably use expensive agencies that run giveaways rather than bot farms, it costs way more than the cheap sites.",
              "score": 6,
              "created_utc": "2026-01-28 14:18:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2910ki",
                  "author": "AcceptableShock8691",
                  "text": "Yea, Storefamee is what they use now",
                  "score": -17,
                  "created_utc": "2026-01-28 17:29:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o286q82",
              "author": "trailtwist",
              "text": "Personally when I see a bunch of followers and no interaction I think someone is sketchy and untrustworthy",
              "score": -3,
              "created_utc": "2026-01-28 15:17:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o290yjl",
              "author": "AcceptableShock8691",
              "text": "Lookup Storeffame. Only real platform that has real followers. Influencers use it only",
              "score": -11,
              "created_utc": "2026-01-28 17:29:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o26kb7d",
          "author": "litle_princess",
          "text": "It is honestly crazy that people still try to buy instagram followers thinking it will solve anything, the algorithm is way too advanced now and it usually just tanks your reach because the accounts look fake. You might see the number go up for a day, but your engagement rate goes straight down immediately.",
          "score": 17,
          "created_utc": "2026-01-28 08:41:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dfpsa",
              "author": "Apprehensive_Gap6476",
              "text": "i get the concern but not all follower services are the same. Social Crow helped me boost engagement with real looking growth so it felt organic and added quick credibility.",
              "score": 1,
              "created_utc": "2026-01-29 07:34:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o26nqjg",
          "author": "pancake_1106",
          "text": "I totally understand the frustration of staring at the same number for months, it feels like you are putting in so much work while others just cheat the system.\n\nBut deciding to buy Instagram followers is just burning cash, you are better off spending that money on better lighting or editing tools because fake accounts do not buy products",
          "score": 13,
          "created_utc": "2026-01-28 09:13:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27bp1b",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 6,
          "created_utc": "2026-01-28 12:31:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27q3zt",
              "author": "garvit__dua",
              "text": "\nDoes that actually convert to sales or real fans though, I doubt it.",
              "score": 5,
              "created_utc": "2026-01-28 13:54:59",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o286zqj",
              "author": "trailtwist",
              "text": "Idk when I see someone with thousands of followers and no interacting I think they are sketchy",
              "score": -11,
              "created_utc": "2026-01-28 15:18:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o26s1yi",
          "author": "Designer-Nobody7830",
          "text": "honestly buying instagram followers is sketchy,just keep posting reels man.",
          "score": 2,
          "created_utc": "2026-01-28 09:53:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27jthk",
          "author": "Plus_Chard_7194",
          "text": "\nMarketing is all smoke and mirrors anyway so who cares if the numbers are padded.",
          "score": 5,
          "created_utc": "2026-01-28 13:21:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28v67u",
              "author": "garvit__dua",
              "text": "\nThe brands paying for ads care man, they have tools to spot this stuff instantly now.",
              "score": 3,
              "created_utc": "2026-01-28 17:04:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o28w8cb",
                  "author": "GeorgeHarter",
                  "text": "Ha.",
                  "score": 1,
                  "created_utc": "2026-01-28 17:08:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o290xvc",
              "author": "HistoricalSundae3567",
              "text": "We re using Storeffame to grow followers",
              "score": -5,
              "created_utc": "2026-01-28 17:29:22",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o291hsn",
              "author": "Icy-Tear-7121",
              "text": "Works great tbh we grew with store-fame",
              "score": -5,
              "created_utc": "2026-01-28 17:31:45",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o290vqi",
              "author": "AcceptableShock8691",
              "text": "Almost all influencers use Storeffame to grow now. It has real followers it helped us",
              "score": -10,
              "created_utc": "2026-01-28 17:29:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2932u1",
              "author": "HourTune9282",
              "text": "To go viral they useStoreffame and ads",
              "score": -10,
              "created_utc": "2026-01-28 17:38:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2920l1",
              "author": "Human_Difference7877",
              "text": "Yeah Storeffame real followers plattform",
              "score": -10,
              "created_utc": "2026-01-28 17:34:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2hhydp",
          "author": "Latter_Daikon6574",
          "text": "My friend, hate to tell you but buying followers usually kills an account",
          "score": 1,
          "created_utc": "2026-01-29 21:27:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29gzhe",
          "author": "Previous-Style-6616",
          "text": "Mixed results is pretty much the norm. The only time it’s not a mess is when it’s slow delivery, decent quality, and you keep posting like normal so your ratios don’t get weird. I’ve had the most consistent experience with SocialDawn for that kind of gradual drip, and it didn’t feel sketchy compared to the random sites.",
          "score": 2,
          "created_utc": "2026-01-28 18:38:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m8i0x",
          "author": "Intelligent_Being870",
          "text": "Mixed results is super common. The only time it didn’t mess up my engagement was when it was slow drip delivery and I kept posting like normal. SocialDawn has been the most consistent for that in my experience.",
          "score": 1,
          "created_utc": "2026-01-30 15:26:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28mg5p",
          "author": "MeikoChii",
          "text": "You can get banned for this",
          "score": 0,
          "created_utc": "2026-01-28 16:26:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2aa9od",
          "author": "StunningDust3297",
          "text": "Where is the pay off, if you end up buying followers who are not interested in what ever you are marketing, don't engage with you post. Is this not a waste of money?",
          "score": -1,
          "created_utc": "2026-01-28 20:47:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2djqjs",
          "author": "Junior-Doughnut-284",
          "text": "The main issue with buying followers isn’t just quality, it’s how Instagram treats the account afterward. Even “real-looking” followers usually don’t engage meaningfully, so your engagement rate drops. \n\nOnce that happens, the algorithm quietly stops pushing your content as hard, which makes the slowdown feel even worse.\n\nOut of curiosity, what kind of content are you posting and who is it meant for?  \nThe fix usually depends more on that than the platform mechanics.",
          "score": -1,
          "created_utc": "2026-01-29 08:10:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ek3vk",
          "author": "Xtrmist78",
          "text": "I don’t know this as a thing",
          "score": -1,
          "created_utc": "2026-01-29 13:07:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26kdkd",
          "author": "gurtjit",
          "text": "I tested SocialFuelofficial and it was actually better than I expected. They drip-fed the followers instead of dumping them, and the profiles didn't look like obvious bots. I didn't rely on it for growth, just used it as social proof while still posting reels and engaging manually.",
          "score": -6,
          "created_utc": "2026-01-28 08:42:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27cty7",
              "author": "IamNotYourBF",
              "text": "And here is the sales pitch. Create a fake post of a fake problem. Solve it under a different user in hopes to drive searches.",
              "score": 3,
              "created_utc": "2026-01-28 12:38:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o295ne6",
                  "author": "gurtjit",
                  "text": "Uh I didn’t make the post",
                  "score": 1,
                  "created_utc": "2026-01-28 17:49:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o28u3ma",
          "author": "IndieBeautyBuilder",
          "text": "Buying followers hurts organic growth long-term.  \nIt lowers engagement rate, confuses the algorithm about your niche, and stops Instagram from pushing your content to new audiences.  \nFollower count doesn’t unlock reach — engagement from real users does.",
          "score": -3,
          "created_utc": "2026-01-28 16:59:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o297194",
          "author": "PNW_Uncle_Iroh",
          "text": "This reads like an ad for storeffame",
          "score": -4,
          "created_utc": "2026-01-28 17:55:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29ehzk",
          "author": "Interesting-Bath2074",
          "text": "I tried Path Social once after some research and kept it very gradual while continuing to post and engage normally. It didn’t dramatically change engagement, but it helped with visibility without causing any obvious issues. I’d still treat any service like this as a support tool, not a fix on its own.",
          "score": -4,
          "created_utc": "2026-01-28 18:27:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26cicf",
          "author": "Sufficient_Matter170",
          "text": "I recommend you try Famety.",
          "score": -4,
          "created_utc": "2026-01-28 07:32:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26e0i9",
              "author": "RichRaichu5",
              "text": "up",
              "score": 0,
              "created_utc": "2026-01-28 07:45:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2bkcpf",
          "author": "pro_pete",
          "text": "I did something similar last year — bought a small package as a credibility boost before a product launch and then doubled down on organic outreach. The paid boost came from my fame com and honestly it helped get a few more eyeballs on launch-day posts; I noticed slightly higher reach and a couple of real users started following and commenting. It felt higher-quality than services I’d tried before (I had worse luck with Buzzoid, Twicsy and Stormlikes), but it wasn’t a magic bullet — the followers alone didn’t sustain engagement.\n\n\n\nWhat helped afterward: stagger buys (small, timed boosts), buy likes/comments not just raw follower numbers, laser-target your niche, respond to every comment fast, collab with one microcreator, and run a couple of cheap Reels or story ads to convert visibility into real followers. Also avoid huge overnight spikes — slow and steady looks more organic and lowers risk.",
          "score": -8,
          "created_utc": "2026-01-29 00:25:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2r50l2",
          "author": "rajpootgonnarock",
          "text": "Don’t waste your money simply trying every other site to buy, because this is the mistake i did in the past, but now simple i contact the site i like and tell them i need trial first, i check the quality and everything then i buy, don’t waste money simply by getting suggestions on reddit, do your research, i did some and eventually got some from IGinstant, first Dm them on instagram or email and ask for trial, buy only if you satisfied the quality.",
          "score": -10,
          "created_utc": "2026-01-31 07:24:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpm2jg",
      "title": "Conference leads 101",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qpm2jg/conference_leads_101/",
      "author": "No_Team_8919",
      "created_utc": "2026-01-28 19:55:11",
      "score": 43,
      "num_comments": 4,
      "upvote_ratio": 0.76,
      "text": "Compared to normal outbound conference lead gen always felt disordered. Who you talk to, when you talk to them, all felt like luck.\n\n  \nWhat changed things was pulling strings ahead of time. Knowing who might attend, deciding who mattered and starting conversations before the event. That meant manual research or sometimes using attendee list providers like Pullalist.\n\n  \nWhen you do that the event stops being the strategy and becomes the environment where the strategy plays out. Two different things \n\n  \nUse this tip for the next event and thank me later",
      "is_original_content": false,
      "link_flair_text": "Idea Validation",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qpm2jg/conference_leads_101/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o2dpgk4",
          "author": "East_Masterpiece_439",
          "text": "Controlling inputs starts with knowing who’s going. PulAList is one of the services people reference for getting that attendee info early.",
          "score": 3,
          "created_utc": "2026-01-29 09:04:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a0bqd",
          "author": "Best_Mouse_1767",
          "text": "That randomness feeling is real. Conferences only amplify chaos if you don’t control inputs.",
          "score": 1,
          "created_utc": "2026-01-28 20:03:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ath81",
          "author": "OkDependent6809",
          "text": "this makes sense but most conferences dont give attendee lists anymore and buying from third parties feels sketchy. people didnt opt in to get cold outreach.\n\ntiming is smart though, talking before the event beats competing for attention during it.\n\nhonestly best leads ive gotten were just good conversations at the event and following up after. no list needed.",
          "score": 1,
          "created_utc": "2026-01-28 22:11:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2buget",
          "author": "kubrador",
          "text": "pulling an attendee list then messaging people before the conference is just networking with extra steps and a higher credit card bill",
          "score": 1,
          "created_utc": "2026-01-29 01:19:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqkfv5",
      "title": "Amazon spoiled me and now Shopify disputes are killing me",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qqkfv5/amazon_spoiled_me_and_now_shopify_disputes_are/",
      "author": "ChrisKift96",
      "created_utc": "2026-01-29 20:42:54",
      "score": 41,
      "num_comments": 24,
      "upvote_ratio": 0.82,
      "text": "Off-Amazon sales seemed like a smart diversification move until post-holiday chargebacks hit. Amazon handles disputes automatically. Shopify? I'm manually fighting each one. Lost six disputes last week even with tracking, customer emails, and delivery photos. The heartwrenching part is being well aware I'll probably waste another 10+ hours this month on chargebacks that AI could probably handle better than me anyway.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qqkfv5/amazon_spoiled_me_and_now_shopify_disputes_are/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o2hw952",
          "author": "curatingcollectables",
          "text": "What the hell are you selling with such high charge backs?\n\nI haven't had 6 charge backs in the last 2m in gross sales.",
          "score": 26,
          "created_utc": "2026-01-29 22:37:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hziqr",
              "author": "deadstockings",
              "text": "Yeah.. Not sure why you’re dealing with so many disputes lol",
              "score": 13,
              "created_utc": "2026-01-29 22:53:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2i7xoi",
          "author": "weary_dreamer",
          "text": "I cant tell if the sudden amount of posts about chargebacks across subreddits are real because they’re truly a pain after xmas, or if this is intensive marketing for an app someone was pushing on a similar thread in a different sub (something about an IG influencer wearing an item on a post then disputing the charge). \n\nAre all the comments basically a scripted commercial Im wasting my time on?\n\nOr are we real people discussing a real frustration about chargebacks and how infuriating they can be.\n\nThis is the worst part about AI, I think. We lost the irl connections to exchanges on the internet, and now we’re losing our exchanges on the internet to a sea of bots, karma farmers, AI marketers, AI content creators…. we cant even connect on social media anymore. \n\nMaybe we’ll get back to craving in person interaction as a result. Perhaps we’ll see a resurgence for public spaces, and businesses that promote in person connection. \n\nSorry, was this a Wendy’s? ",
          "score": 11,
          "created_utc": "2026-01-29 23:38:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hkz1u",
          "author": "MathewGeorghiou",
          "text": "Chargebacks and returns drain the life out of small business. Increasingly, it seems customers immediately issue chargebacks when they don't recognize a charge without first contacting the company to ask about it — lose lose for everyone.\n\nI see people saying Amazon spoils you by handling disputes — part of the reason is because they seem to accept all of them.  Sellers rarely are given the benefit of the doubt with Amazon (from my experience anyway).  It seems this would be the same as you simply accepting all the disputes and saving your time (although a high loss rate could have future consequences with your payment processor).\n\nStripe has an option where you can buy chargeback insurance and they will handle it all — I think they may even guarantee your money (but I'm not sure about that part).  I'm also not sure if this offer is open to everyone or only sellers with a low chargeback history. I  almost bought it, might still in the future.",
          "score": 11,
          "created_utc": "2026-01-29 21:42:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hcxts",
          "author": "arrowheadman221",
          "text": "10+ hours a month is literally a part time job just to keep money you already earned. diversification is supposed to reduce risk not create new problems lol.",
          "score": 4,
          "created_utc": "2026-01-29 21:04:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hf6a4",
              "author": "ChrisKift96",
              "text": "yeah, thnx!",
              "score": 2,
              "created_utc": "2026-01-29 21:14:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ik380",
          "author": "quietcashsystems",
          "text": "This is one of the hidden costs of going off-Amazon that people underestimate. Amazon not only provides traffic, it absorbs a ton of operational friction.\n\nSome of the things I’ve seen that spike Shopify disputes are stuff like longer delivery windows or inconsistent tracking updates, customers not recognizing the charge descriptor, and selling higher-ticket or impulse-buy products without strong post-purchase comms.\n\nAt some point, it becomes cheaper to just change the system than dispute every charge. That can mean better descriptors, order confirmation emails, delivery notifications, and even preemptive refunds in some cases.\n\nYou're not wrong that the time drain is brutal. Disputes aren’t really about “proof.” They're about how card networks bias the outcome.",
          "score": 2,
          "created_utc": "2026-01-30 00:43:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ic47u",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-30 00:00:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ic4a6",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qqkfv5/amazon_spoiled_me_and_now_shopify_disputes_are/o2ic47u/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-30 00:00:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2icewn",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-30 00:02:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2icezf",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qqkfv5/amazon_spoiled_me_and_now_shopify_disputes_are/o2icewn/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-30 00:02:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ihg2u",
          "author": "besht2014",
          "text": "How long is the shipping process taking? How are the reviews for your product?",
          "score": 1,
          "created_utc": "2026-01-30 00:29:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kz566",
          "author": "Immediate-Syrup-1574",
          "text": "This is the part people underestimate when they talk about “diversifying off Amazon.”\n\nAmazon doesn’t just handle fulfillment — it absorbs a *ton* of operational friction. Once you’re on Shopify, you’re suddenly running payments, fraud detection, and customer behavior all at once.\n\nThe time tax is real.",
          "score": 1,
          "created_utc": "2026-01-30 10:58:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lj5o0",
          "author": "NoDay1628",
          "text": "oh wow yeah, that manual dispute loop on Shopify is a total energy zap. Chargeflow or even Midigator helps automate a pile of this, kinda hands off and lets you focus where it counts. you might still get some edge cases but less slogging, trust me, worth a peek.",
          "score": 1,
          "created_utc": "2026-01-30 13:19:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mmzlg",
          "author": "Intrepid_Boss9449",
          "text": "Shopify disputes suck because you have to do all the work yourself. Maybe try automating some customer follow-ups or proof collection before shipping to build stronger cases. ",
          "score": 1,
          "created_utc": "2026-01-30 16:31:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30z7v8",
          "author": "QuantumLeap1984",
          "text": "I've seen this exact situation a bunch lately.  \n  \nThere are tools that can help with chargebacks, probably worth looking into given the new regulations coming out. ",
          "score": 1,
          "created_utc": "2026-02-01 19:46:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hdnsw",
          "author": "gptbuilder_marc",
          "text": "That Amazon to Shopify contrast is rough. Amazon makes disputes feel like background noise, then Shopify hands you the whole thing and walks away. Feels like the real shock isn’t the chargebacks themselves, it’s suddenly owning the entire process. Is the bigger pain the time it eats up, or how unpredictable the outcomes feel?",
          "score": -1,
          "created_utc": "2026-01-29 21:07:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hfblz",
              "author": "ChrisKift96",
              "text": "honestly at this point? fucking EVERYTHING",
              "score": 3,
              "created_utc": "2026-01-29 21:15:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2hfmbb",
                  "author": "gptbuilder_marc",
                  "text": "Yeah, that reaction actually makes sense. \n\nWhat Amazon hides is the amount of operational machinery they run between the customer and the bank. \n\nWhen you move off platform, that burden doesn’t disappear, it just lands on you all at once.\n\nThe brutal part isn’t even losing disputes you should win, it’s that every case pulls you out of revenue work and forces you into a manual, adversarial process with inconsistent rules. \n\nThat cognitive tax adds up fast.\nOut of curiosity, are most of these disputes the same pattern over and over, or are they all different edge cases?",
                  "score": -8,
                  "created_utc": "2026-01-29 21:16:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2hb47q",
          "author": "crazyreaper12",
          "text": "Amazon really does spoil you with how they handle disputes. I didn't realize how good we had it until I started selling DTC and had to manually fight every single chargeback myself. ",
          "score": 0,
          "created_utc": "2026-01-29 20:55:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hf1vf",
              "author": "ChrisKift96",
              "text": "the good old days",
              "score": 0,
              "created_utc": "2026-01-29 21:14:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2hdv32",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": -6,
          "created_utc": "2026-01-29 21:08:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hfhuz",
              "author": "ChrisKift96",
              "text": "I see, this is helpful!",
              "score": -4,
              "created_utc": "2026-01-29 21:16:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2hq88n",
                  "author": "monkey-seat",
                  "text": "Is this your ad for Chargeflow. ",
                  "score": 15,
                  "created_utc": "2026-01-29 22:07:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qt6vai",
      "title": "7 months of \"vibe coding\" a SaaS and here's what nobody tells you",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qt6vai/7_months_of_vibe_coding_a_saas_and_heres_what/",
      "author": "whyismail",
      "created_utc": "2026-02-01 18:45:51",
      "score": 41,
      "num_comments": 31,
      "upvote_ratio": 0.77,
      "text": "Been building **Brandled** with AI and basically zero technical background. Everyone talks about how easy it is now with Claude Code, Antigravity etc.., but they leave out the part where you get completely fucked by production issues that AI can't solve.\n\nPure AI coding gets you maybe 60% there. You can build nice landing pages, set up login systems, even get a decent dashboard running. But then real subscribers start using your product and everything breaks in ways the AI never warned you about.\n\nLemonsqueezy integration that worked perfectly in test mode but randomly failed with real customers. I thought I was making money while actual payments were bouncing. AI couldn't explain webhook validation or why certain cards were getting declined without proper error handling.\n\nDatabase performance that was fine with 10 users but completely shit with 1,000+. Every query started timing out. AI kept suggesting caching fixes instead of telling me I was running garbage queries on unindexed tables. My dashboard was loading every single data point instead of paginating like a normal human would.\n\nUser sessions that just randomly logged people out. What happens when someone's subscription expires while they're using the app? How do you handle multiple browser tabs? AI could fix individual bugs but had no clue how to build proper session management.\n\nData isolation problems where customers could see each other's data. That's a fun support ticket to get. AI had zero understanding of how to debug multi-tenant architecture or why my database setup was fundamentally broken.\n\nBilling logic that looked perfect but created accounting chaos. Proration, failed payment retries, subscription changes - the AI code \"worked\" but had edge cases that destroyed my revenue tracking. One customer downgrading somehow triggered three billing events and I couldn't figure out what the hell happened.\n\nThe turning point was realizing I needed to be a better AI supervisor, not just blindly trust whatever code it spat out. Started setting up actual logging for critical actions, testing payment flows with real cards before launching, keeping a simple spreadsheet of what actually worked vs what looked good in dev.\n\nSpent a few weeks learning database basics, payment processing fundamentals, how web apps actually handle user data and security. Not trying to become a senior dev, just enough to read server logs and understand when something was genuinely broken vs a quick fix.\n\nMost success stories skip the part where they got stuck for weeks on subscription billing or had to hire actual developers to rebuild their payment system. The sweet spot is learning just enough SaaS fundamentals to not get completely destroyed by production, then using AI to move 10x faster on the stuff you actually understand.\n\nStill using AI for 90% of my development, but now I can tell when it's giving me code that'll explode in production vs code that'll actually work with real users and real money.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qt6vai/7_months_of_vibe_coding_a_saas_and_heres_what/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o31jnli",
          "author": "MathewGeorghiou",
          "text": "A nice experience-based assessment of the state of vide coding.  As soon as you want to build an app that goes past basic content-delivery — and expect to support paying customers — it all gets very hard, very fast.  AI can certainly provide an amazing productivity boost, but be aware.",
          "score": 14,
          "created_utc": "2026-02-01 21:26:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31r67y",
          "author": "nanojunior_ai",
          "text": "the \"better AI supervisor\" framing is so real. i'm in CS and we literally see the same thing with classmates who use copilot/claude for assignments — the ones who understand what the code is doing can catch when it hallucinates something plausible-looking but wrong. the ones who just copy-paste end up debugging for 10x longer because they don't even know where to look.\n\nyour point about database indexing is a perfect example. AI will happily generate working SQL that's technically correct but absolute garbage at scale. it doesn't think about n+1 queries or what happens when your users table hits 100k rows because it's never had to sit there watching a dashboard spin for 30 seconds.\n\nhonestly the most underrated skill for vibe coding is knowing what questions to ask. like if you'd prompted \"what are the common production gotchas with lemon squeezy webhooks\" before building, you probably would've caught the validation issues early. the AI knows this stuff, it just won't volunteer it unless you ask.",
          "score": 8,
          "created_utc": "2026-02-01 22:02:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31yzim",
          "author": "Mean_Kaleidoscope861",
          "text": "You’re trying to build everything from scratch instead of relying on tools, increasing complexity and wasting your time learning non central things  that deviate your focus from the core business. For logins, payment and CRM you can use Outseta for example, that alone will reduce your headaches and allow you to focus on what matters.",
          "score": 4,
          "created_utc": "2026-02-01 22:41:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31pphq",
          "author": "EngineeringSimple409",
          "text": "Not to mention the cost surprises you might get... Specially folks building AI wrappers. OpenAI for example has only soft limits, so any budget limit and credit balance you have there is just soft limit. If you don't protect yourself and get a bad query, it can explode in costs. (I had this issue and got 100USD+ charge in few requests in 3s.",
          "score": 3,
          "created_utc": "2026-02-01 21:55:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32sgx3",
              "author": "circuit_breaker",
              "text": "$100+ in 3s!?! And I thought surprise AWS billing could be bad",
              "score": 1,
              "created_utc": "2026-02-02 01:24:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o324gbw",
          "author": "ruibranco",
          "text": "The \"AI supervisor\" framing is spot on. The 60% number matches my experience too - AI is incredible for scaffolding but the moment real money touches the system, every edge case becomes your problem. Payment webhook validation alone is a masterclass in \"things AI won't warn you about.\" The fact that you invested a few weeks learning fundamentals instead of hiring someone to fix everything is what separates people who build lasting businesses from people who build demos. Most vibe coders quit at exactly the wall you described.",
          "score": 3,
          "created_utc": "2026-02-01 23:10:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32jcq6",
          "author": "loud-spider",
          "text": "Solid real world story with actual actionable advice. \n\n\"AI kept suggesting caching fixes instead of telling me I was running garbage queries on unindexed tables.\" - \n\nThere's a mode that AI sits in where this stuff lives that you don't get from real people because knowledge and conversation close the loop pretty quickly. \n\nHalf the battle is knowing that's actually the mode the AI is in.  Like, if you had literally asked it \"would indexing my tables have any success?\", it would probably go \"Absolutely, this will sort it immediately\", but it doesn't close the broader gap on it's own.",
          "score": 2,
          "created_utc": "2026-02-02 00:33:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o333yeg",
          "author": "Historical_Lawyer484",
          "text": "I’m a vibe coder as well and just finished phase 1 of my MVP and launching tomorrow.  Not gonna lie, I had to rebuild the entire platform at least 3 times so have learnt a ton. \n\nHowever, did you end-to-end test everything?  I’ve done a tone of A/B testing in many roles, and I wouldn’t let this roll out until it was bulletproof or at least as bulletproof as any SaaS  platform can be. \n\nCurious to understand what you did before going live. Cheers!",
          "score": 2,
          "created_utc": "2026-02-02 02:29:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31hsyc",
          "author": "Existing-Board5817",
          "text": "honestly I heavily use AI in all my workflows but everything works fine  \nI use Cursor and Claude Code for coding  \nI use Starnus for sales  \nI use custom built workflows for marketing",
          "score": 2,
          "created_utc": "2026-02-01 21:17:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31yk7k",
          "author": "theonetruelippy",
          "text": "Vibe coding as it is today will not (probably) make you a better programmer, only do stuff quicker (which is huge, no shade). If you haven't launched a performant saas before, you do have a learning curve ahead of you - one which experienced programmers can manage by guiding the AI, at least to an extent, but which lesser experienced programmers may get burned by. Keep at it - if you can identify where the issues are, that is half the battle. Use AI to help you \"instrument\" (valid tech term) the performance of your app and then work on the bottle necks. Writing test harnesses to simulate 10^x users is trivial-ish with AI, combine that with instrumentation and a knowledge of the code base and AI should be able to fix your issues.",
          "score": 1,
          "created_utc": "2026-02-01 22:39:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o323s9p",
          "author": "TheHealthlover101",
          "text": "a lot of these things can get easily sorted if you ask the AI ...",
          "score": 1,
          "created_utc": "2026-02-01 23:07:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32ybe5",
          "author": "Ecaglar",
          "text": "The billing edge cases hit home. Had the exact same experience - everything tested perfectly with test Stripe webhooks, then production happened and suddenly customers were getting charged twice because I didn't account for network timeouts causing retry attempts.\n\nOne thing that saved me later: before any payment-related action, I started logging the \"intent\" with a timestamp, then the \"result\" after. When something weird happens, you can trace exactly what the app thought was happening vs what actually happened. AI won't suggest this kind of defensive logging because it doesn't think about your app at 3am when a customer emails saying they got charged three times.\n\nThe 90% AI / 10% supervision ratio you landed on sounds about right. The 10% is just knowing where the landmines are - payments, auth, data isolation. Basically anywhere real money or real users can break things in ways that only show up in production.",
          "score": 1,
          "created_utc": "2026-02-02 01:58:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33l7du",
          "author": "thisonehereone",
          "text": "hows the security of your data?   \nare you protected from sql injection?  \none thing ive learned is the web is full of people and bots that seem to constantly attack your site, they dont care what data they are getting, they just relentlessly try to get it.",
          "score": 1,
          "created_utc": "2026-02-02 04:12:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33sitk",
          "author": "Consistent_Recipe_41",
          "text": "Spot on.",
          "score": 1,
          "created_utc": "2026-02-02 05:01:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34jb4j",
          "author": "Forsaken_Lie_8606",
          "text": "fwiw ive been in similar shoes, spending way too long on vibe coding and not enough time on actual customer validation - tbh its a huge mistake that can set you back months. i learned this the hard way with my last saas project, where i spent 3 months building out a feature that i thought was crucial, only to find out that none of my beta users actually cared about it. imo, its way more important to get a minimum viable product out the door and start getting real feedback from users, rather than trying to perfect everything beforehand.",
          "score": 1,
          "created_utc": "2026-02-02 08:52:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34k6zi",
          "author": "Lopsided_Pride_6165",
          "text": "How did you get it to production when you don't have an IT background?",
          "score": 1,
          "created_utc": "2026-02-02 09:01:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34k7rm",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-02-02 09:01:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o34k7sl",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qt6vai/7_months_of_vibe_coding_a_saas_and_heres_what/o34k7rm/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-02-02 09:01:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o34lx9y",
          "author": "Dyebbyangj",
          "text": "How can you tell? What makes you think the  codes bad?",
          "score": 1,
          "created_utc": "2026-02-02 09:18:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o350wti",
          "author": "Time_Stop_3645",
          "text": "Gz. You learned coding by sucking like everyone else, lol",
          "score": 1,
          "created_utc": "2026-02-02 11:36:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36ct4p",
          "author": "macdaddy0800",
          "text": "Are you considering Airtable and Softr to ship and MVP with perhaps some humans finishing the rest off?",
          "score": 1,
          "created_utc": "2026-02-02 16:11:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36fct2",
          "author": "TimeMachine1994",
          "text": "Sounds like an ID-10T error",
          "score": 1,
          "created_utc": "2026-02-02 16:23:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36fq7w",
          "author": "PrettyRadio2073",
          "text": "This post should be mandatory reading for everyone in the 'AI-wrapper' bubble.\n\nI’ve seen this movie before. In my 35 years in tech, starting back at **Digital Equipment Corporation (DEC)** and moving through the dot-com bubble to today, the tools change, but the traps stay the same. You just described what I call the **Circle of Feature Lust** in my e-book, **Startup Inferno**.\n\nAI is a world-class 'cosplayer.' It can act like a Senior Dev, but it has zero accountability for production-level architecture. As you found out, building a UI is easy; building a **robust system** that handles edge cases, race conditions, and multi-tenancy is where the real business lives.\n\n**Two things I want to highlight from your struggle:**\n\n1. **The 'Boring' Fundamentals:** you realized that you don't need to be a Senior Dev, but you DO need to understand the 'boring' stuff (webhooks, indexing, session states). In the Inferno, ignoring the 'boring' is a shortcut to a burn rate disaster.\n2. **AI as an Accelerator, not a Pilot:** using AI for 90% of the code is fine, but as soon as you stop being the 'Architect' and start being just a 'Prompt Engineer,' you've lost control of your company.\n\nI wrote Startup Inferno precisely to help founders like you bridge that gap—understanding the '9 Circles' of mistakes so you can stop the fire before it destroys your database (and your reputation).\n\nKudos to you for staying in the trenches and learning the hard way. That '2 months of hell' just gave you more business acumen than 10 years of 'vibe coding' ever could.",
          "score": 1,
          "created_utc": "2026-02-02 16:25:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39lvnx",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 01:46:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39lvp0",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qt6vai/7_months_of_vibe_coding_a_saas_and_heres_what/o39lvnx/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-03 01:46:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o39m0gt",
          "author": "Honest-Razzmatazz-15",
          "text": "Experiencing the same after building a lot with Claude Code.\n\nAlthough the quality keeps improving day by day. It is night and day from 7 months ago.\n\nMy last project is letterranks.com. Fully vibe coded and running smoothly until now.\n\nWith time and good context the AI agents get better and you get better a spotting bad patterns.",
          "score": 1,
          "created_utc": "2026-02-03 01:46:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3asy6f",
          "author": "TechnicalSoup8578",
          "text": "This nails the gap between demo-ready code and production reality once money and data are involved. Which production issue forced you to stop trusting AI output and learn the underlying system first? You sould share it in VibeCodersNest too",
          "score": 1,
          "created_utc": "2026-02-03 06:29:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cpnqx",
          "author": "AcceptableLeg4517",
          "text": "It is impressive you've dived into building even non-technical. You're quickly becoming technical! Congrats. What is the Bradled elevator pitch?",
          "score": 1,
          "created_utc": "2026-02-03 15:10:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3d7jux",
          "author": "Cyclr_Systems",
          "text": "That's a genuinely good assessment of where “vibe coding” is right now. Thanks for sharing the part that most stories gloss over. AI is a great tool and can help a lot, but you still have to have enough technical knowledge to be able to assess that the output is really what you wanted.\n\nThe multi-tenancy bit you called out is one of the nastiest because it only takes one missed scoping rule for data to leak across customers. On the integration side, we’ve found it helps a lot to have customer connections isolated by default (separate auth, separate tenants), which is a big part of why multi-tenancy is built into Cyclr. \n\nWhat's the elevator pitch for Brandled?",
          "score": 1,
          "created_utc": "2026-02-03 16:35:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31laxu",
          "author": "matarrwolfenstein",
          "text": "I think in your case it's a matter of bad prompting from the start and you're now trying to patch it up, plaster by plaster. Yes, Ai skips stages when vibe coding, which is why it'simportant for the user to have a proper understanding of whats needed at the very start based on their mid/long term expectations.",
          "score": 1,
          "created_utc": "2026-02-01 21:34:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33ehly",
          "author": "star_dust88",
          "text": "So refreshing to read non ai generated post. Getting tired of \"honestly?\" and \"3 things I learned\" 😂",
          "score": 1,
          "created_utc": "2026-02-02 03:30:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtt5jr",
      "title": "Way to own SaaS",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qtt5jr/way_to_own_saas/",
      "author": "Wild_Gold1045",
      "created_utc": "2026-02-02 12:00:31",
      "score": 25,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "I started my programming journey at 12 back in 2002. I remember bringing homework with sorting algorithms to class on floppy disks, sometimes even writing code on paper.\n\nBy the time I graduated university, I was juggling two software engineering jobs ($2.5k/mo). I eventually moved into a standard 9-5 and quickly jumped to lead positions (currently earning around $10k/mo).\n\nI’ve always had side projects. One I’m particularly proud of involves managing industrial labeling machines (Layer 2). It started in 2020 and has made about $50k so far. We’ve built 20 machines that are currently running inside meat processing plants.\n\nWhile working on the industrial machines, I hit a wall: I needed a way to access these remote machines behind firewalls and NATs. I looked for a reliable local tunneling service that supported both TCP and UDP, but existing solutions were either too expensive or didn't fit my specific technical needs.\n\nIn late 2025, the \"AI Agent\" era kicked off. Honestly? I was a huge skeptic. I thought they were good for landing pages or API wrappers, but not for complex network engineering.\n\nI decided to challenge that skepticism: Could I build my own tunneling service using AI agents?\n\nMy goal was to build a profitable SaaS (or at least save money on 3rd party tools). I spent 2 months building this in parallel with my 9-5 and the industrial project.\n\nThe Results:\n\nI am actually shocked by the power of these agents. The result exceeded my expectations. The code isn't perfect, but it works surprisingly well.\n\nI launched the project 3 weeks ago as open sourced. As of today:\n\n* 210 registered users\n* 3-5 active tunnels at any given time (people are actually using it!)\n* 497 stars on GitHub\n* $2 MRR 😆 (It’s not much, but it’s infinitely better than $0)\n\nIf you are skeptical about AI agents for backend work, I encourage you give it a try. It was a massive learning experience.\n\n\n\n",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qtt5jr/way_to_own_saas/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o39k7ya",
          "author": "Thehappylatif",
          "text": "The industrial project is the real foundation here.  \nBuilding software on top of a problem you’ve already lived through is such an underrated advantage. The early MRR is just validation.",
          "score": 3,
          "created_utc": "2026-02-03 01:36:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37ihwt",
          "author": "builderbycuriosity",
          "text": "Thanks for sharing this. Super motivating. This shows that AI agents aren’t about perfect code. They’re about speed and leverage. You used them the right way. And $2 MRR is just 3 weeks, that's a validation that the project works and that's a huge win.",
          "score": 2,
          "created_utc": "2026-02-02 19:22:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39g3db",
          "author": "ruibranco",
          "text": "The industrial labeling machine business is the underrated part of this story. $50k from 20 machines in meat processing plants is real, unglamorous revenue that most people on this sub would kill for. The tunneling SaaS is cool but building software to scratch your own itch from another business is honestly how most solid B2B tools get started - you already understand the problem deeply because you lived it.",
          "score": 2,
          "created_utc": "2026-02-03 01:12:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3548cj",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 12:02:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3548eb",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qtt5jr/way_to_own_saas/o3548cj/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-02 12:02:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o354z3e",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 12:08:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o354z4p",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qtt5jr/way_to_own_saas/o354z3e/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-02 12:08:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o357fby",
          "author": "WhatElseCanIPut",
          "text": "I'm currently attempting this with iot to build a hardware to compliment my saas!",
          "score": 1,
          "created_utc": "2026-02-02 12:26:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o357mr7",
              "author": "Wild_Gold1045",
              "text": "would you mind to share more details?",
              "score": 1,
              "created_utc": "2026-02-02 12:28:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35o8x6",
          "author": "Unhappy-Bunch-4594",
          "text": "the industrial labeling machine project is honestly the more impressive part of this story — $50k from 20 machines running inside meat processing plants is real revenue from a real problem. the tunneling service is cool too but that existing industrial business is a legit foundation most people would kill for.\n\nalso $2 MRR with 210 users and 500 github stars in 3 weeks means people are finding value in it, the monetization side just hasn't caught up yet. open source to paid conversion is always slow but the usage numbers look healthy.",
          "score": 1,
          "created_utc": "2026-02-02 14:09:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35u5kl",
              "author": "Wild_Gold1045",
              "text": "￼​Yeah, I love this industrial project. Here is how it looks like\n\nhttps://preview.redd.it/v0glwljef3hg1.jpeg?width=1179&format=pjpg&auto=webp&s=8cdde934ed31f08d5d4da73e7f95708446351fa7",
              "score": 1,
              "created_utc": "2026-02-02 14:41:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o35uqrv",
                  "author": "Wild_Gold1045",
                  "text": "One more pic\n\nhttps://preview.redd.it/fmydjr8yf3hg1.jpeg?width=1179&format=pjpg&auto=webp&s=ec02aed54631917ab34f908a1c0c90777a7ef766",
                  "score": 1,
                  "created_utc": "2026-02-02 14:44:14",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o37jkv7",
                  "author": "xasdfxx",
                  "text": "That's really cool.\n\nI just have to ask -- why not sell more of that thing?  Because it seems like way lower competition than ngrok / tailscale / cloudflare tunnel / pangolin?",
                  "score": 1,
                  "created_utc": "2026-02-02 19:27:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o35ueiz",
              "author": "Wild_Gold1045",
              "text": "Agree on monetization comment. I have to review it",
              "score": 1,
              "created_utc": "2026-02-02 14:42:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o36db18",
          "author": "PrettyRadio2073",
          "text": "From one 'old school' dev to another (I started back in the **DEC** days), your story is refreshing. Building for industrial labeling machines is the definition of solving a 'boring', high-value problem, that’s where the real money is.\n\nYou’ve hit a classic fork in the road. You have 500 stars on GitHub but only $2 MRR. In my e-book, **Startup Inferno**, I’ve seen many brilliant engineers get stuck in the **Circle of Craftsmanship**: you built a great tool, but you might be accidentally building a 'charity' instead of a SaaS.\n\n**My veteran advice for your next 3 months:**\n\n1. **The 'Open Source Trap':** 500 stars mean you solved a dev problem. 2$ MRR means you haven't solved the 'payment friction' yet. Don't let the dopamine of GitHub stars distract you from the brutal reality of unit economics.\n2. **AI Agents for Scale, not just Code:** use those agents now to automate the 'boring' business side (outreach, documentation, support) so you can keep your 9-5 while scaling.\n3. **Don't 'Cosplay' the Hobbyist:** if this is a business, treat the $2 MRR as a fire that needs oxygen.\n\nI wrote Startup Inferno precisely to help technical founders like you navigate the transition from 'cool project' to 'surviving business.'\n\nQuick question: Since you're in the meat processing industry, have you considered selling the 'tunneling' as a premium security feature for industrial IoT rather than a generic dev tool? The margins there are 100x higher.",
          "score": 1,
          "created_utc": "2026-02-02 16:14:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36kb9z",
              "author": "Wild_Gold1045",
              "text": "Thanks for so detailed advice! it definitely makes a lot of sense.   \n  \n100x margins industrial world - it's a really a good point. I haven't thought this way.",
              "score": 1,
              "created_utc": "2026-02-02 16:46:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37h46r",
          "author": "supes4life",
          "text": "I was thinking of this just last night. Using current AI, to build something for SaaS. \nWhat AI tools did you use?",
          "score": 1,
          "created_utc": "2026-02-02 19:15:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3aaiq2",
              "author": "Wild_Gold1045",
              "text": "I’m using Junie and Gemini at the bottom",
              "score": 1,
              "created_utc": "2026-02-03 04:11:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qp9i2g",
      "title": "Being introverted was the bottleneck in my business",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qp9i2g/being_introverted_was_the_bottleneck_in_my/",
      "author": "LilTiit",
      "created_utc": "2026-01-28 12:02:35",
      "score": 19,
      "num_comments": 14,
      "upvote_ratio": 0.92,
      "text": "’d spend months optimizing landing pages to get a 1% conversion increase. Or try to find some “secret winning” Meta ad campaign setup that would take my business to the next level.\n\nUntil my mentor told me business is a mirror of your personal self-improvement. The bottlenecks in your business are usually the things you’re lacking as a person.\n\nWhat I was actually avoiding was obvious. I didn’t like talking to people.\n\nI avoided sales calls. Tried to close deals over text. Then gradually went cold when someone wanted a call. I was literally letting go of opportunities.\n\nI was distracting myself with 1% improvements while avoiding what was probably a 400% business growth at that point.\n\n\nI didn’t magically fix it, but this is how I deal with it now:\n\n1. I only work with big high-ticket clients, so the earnings per talking ratio would be optimal.\n\n2. Brought on a sales rep.\n\n3. Reduced impostor syndrome by becoming more of an expert. So that people can’t corner me by asking something I don’t know.\n\n\nHope this helps a fellow introvert out there :)\n",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qp9i2g/being_introverted_was_the_bottleneck_in_my/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o278qyp",
          "author": "kubrador",
          "text": "the \"let me optimize this spreadsheet instead of calling this guy\" energy is so real it hurts. glad you figured out you were just procrastinating with landing pages instead of, you know, talking to humans like a normal person trying to make money.",
          "score": 12,
          "created_utc": "2026-01-28 12:11:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o279f4t",
              "author": "LilTiit",
              "text": "thanks, yeah i was able to realize it but still looking for tips to completely get used to it",
              "score": 1,
              "created_utc": "2026-01-28 12:15:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o293fv2",
                  "author": "Nightshade_Chronicle",
                  "text": "I'm glad you figured it out. I know for a lot of introverts talking on the phone and interacting with the sales portion of a business/job is sometimes the most difficult. I think the only way to truly get used to it is through practice. You probably won't ever be fully comfortable with speaking with others (not in the same way an extrovert lives for that interaction) but the repetition will eventually become more routine over time.",
                  "score": 1,
                  "created_utc": "2026-01-28 17:40:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2865u1",
          "author": "Odd_Brother_5635",
          "text": "This hit uncomfortably close.\n\nIt’s wild how easy it is to hide behind optimization when the real bottleneck is behavioral, not technical. Landing pages and ads feel safe — people don’t.\n\nRespect for calling that out honestly.",
          "score": 1,
          "created_utc": "2026-01-28 15:14:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28bqvt",
          "author": "LastWin6162",
          "text": "Yes that definitely sounds doable and I sometimes deal with the same pain.",
          "score": 1,
          "created_utc": "2026-01-28 15:39:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bvzsw",
          "author": "QuietArbitrage",
          "text": "that's exactly what I would like to do is just deal with the big ticket customers but since it is just me I handle everything including all the customer service for my used golf club business.",
          "score": 1,
          "created_utc": "2026-01-29 01:28:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bzapy",
          "author": "Sandy250795",
          "text": "I would like to connect with you",
          "score": 1,
          "created_utc": "2026-01-29 01:46:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c954f",
          "author": "Agreeable-Escape-852",
          "text": "Yes I felt the same ..",
          "score": 1,
          "created_utc": "2026-01-29 02:40:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cvfd3",
          "author": "Foreign_Tower_7735",
          "text": "Thanks I am a former introvert and I somehow doing the same thing. I started cold calling and emailing offers then stopped and I read I should be DM'ing and connecting in chats but I don't do it as much as I should and meanwhile I have things to sell but I prefer posting them on sites instead.  I clearly know that by reaching out I can increase sales but it is a real pain I have to work on.",
          "score": 1,
          "created_utc": "2026-01-29 04:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dvi77",
          "author": "trainmindfully",
          "text": "this hits hard because a lot of optimization is just socially acceptable avoidance. it is way easier to tweak pages than to put yourself in a slightly uncomfortable conversation. i like how you framed it as earnings per talking ratio, that feels like an honest way to work with your personality instead of pretending it will change overnight. also true that confidence goes up fast once you actually know your stuff deeply. good reminder that business bottlenecks are often personal ones first.",
          "score": 1,
          "created_utc": "2026-01-29 10:01:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ed9k2",
          "author": "Vaibhav_codes",
          "text": "This hits hard sometimes the biggest growth comes from personal challenges, not marketing tweaks Smart approach with high ticket clients and a sales rep",
          "score": 1,
          "created_utc": "2026-01-29 12:23:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a46yo",
          "author": "Hot-Spicy-Potato",
          "text": "Introversion is never the issue. The post would make more sense if talking about how to clear out sales cliches, or how to fix impostor syndrome... oh wait you wrote these... then the only issue is linking these to introversion while they both are completely different subjects with no relation to introversion.",
          "score": -1,
          "created_utc": "2026-01-28 20:20:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2a568g",
              "author": "LilTiit",
              "text": "I believe there is some connection to being introverted -> getting less social skills over the years -> avoiding sales calls and etc",
              "score": 1,
              "created_utc": "2026-01-28 20:24:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2dahax",
                  "author": "Hot-Spicy-Potato",
                  "text": "Absolutely nothing. Said with related studies. But I noticed this thread is about comfort thoughts, so I leave everyone with this.",
                  "score": 2,
                  "created_utc": "2026-01-29 06:49:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qr08b4",
      "title": "One of my faceless accounts blew up and the other ten didn't",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qr08b4/one_of_my_faceless_accounts_blew_up_and_the_other/",
      "author": "No-Fact-8828",
      "created_utc": "2026-01-30 08:50:33",
      "score": 19,
      "num_comments": 3,
      "upvote_ratio": 0.83,
      "text": "Started this in late November. Film myself once, use the footage for 11 different accounts with different faces. Seemed like a shortcut.\n\nI'd do the real movements and expressions, just change the face. So I wouldn't be on camera but the content would still feel authentic.\n\nHonestly just kept making more accounts. Started with 3, then made a few more when those didn't pop immediately. Ended up with 11.\n\nFirst few weeks were just setup. Created 11 different characters using reference photos. Made them look different enough that you wouldn't connect the accounts. Different ages, ethnicities, styles.\n\nFor the face swaps I'm using whatever works. Been rotating between APOB, Reface, and HeyGen depending on what I need. APOB I use most because I can process a few at a time. Reface is faster for single edits. HeyGen has better lip sync but costs more. None of them are perfect.\n\nThe workflow: film myself doing 5-6 exercises in one session, usually Sunday mornings in my apartment gym when no one's around. Feels weird doing burpees and talking to a camera by myself but whatever. Then I process them through whichever tool makes sense, export the versions, schedule them. Takes about 4-5 hours per week now. Setup took way longer though, probably 30-40 hours total in the first month.\n\nWeek 6 I was done. All accounts under 500 followers after putting in all that time. Sat there staring at the analytics thinking I'd wasted a month and a half on the dumbest idea ever. Almost deleted everything.\n\nThen account 1 randomly popped off. Woke up one morning to 50k views on a video I thought was mediocre. Checked my phone like five times thinking it was a glitch. Now it's at 8k followers and still growing. Some videos hit 10k views, some get 2k. No pattern I can figure out.\n\nAccounts 3, 5, and 7 are doing okay. Between 800-2k followers each. They grow but slow. Making around $200 total per month from affiliate stuff across these three.\n\nThe rest are basically dead. Highest one is under 500 followers after two months. Some videos barely get any views. I'm posting the same frequency, same hooks, same everything. Just different faces.\n\nStarted noticing weird patterns. The account with the older looking character does way better with strength training content. The younger looking one gets more engagement on HIIT stuff. Makes no sense because it's literally the same person doing the movements.\n\nAlso ran into issues I didn't expect. One account got flagged for \"inauthentic behavior\" on Instagram. Nothing happened but it spooked me. Another one, people started commenting that something looked off. One comment was like \"why does your face look different in every video lol\" and I panicked. Tried different tools to see if one looked more natural but they all have issues sometimes.\n\nThe successful account made $520 in December and is tracking around $450 so far this month from supplement links. So across all accounts I'm at maybe $650-700 monthly depending on the month.\n\nMy roommate thinks the whole thing is weird. Keeps asking why I'm filming myself then not posting my real face. Can't really explain it without sounding sketchy.\n\nBiggest problem is I can't figure out what made account 1 successful. I've tried copying everything about it to the dead accounts. Same posting times, same caption style, same hashtags. Nothing moves the needle.\n\nPart of me wants to kill the bottom 6 but I keep thinking what if they just need more time. I've already put in the work to set them up. Feels wasteful to delete them when posting is basically automated now anyway.\n\nAlso paranoid about the face swap thing. Haven't seen anyone else talk about getting flagged for it but I know platforms are cracking down on synthetic content. Don't know if I should mention in bios that it's not my real face or just keep quiet.\n\nAnyone running multiple accounts like this? Feels like I'm either onto something or wasting time on accounts that'll never work.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qr08b4/one_of_my_faceless_accounts_blew_up_and_the_other/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o2ktceo",
          "author": "DiverPrevious9999",
          "text": "This is where having access to analytics rocks. This is where I'd want to look at the user base and understand what niche I've hit, instead of analyzing the content on its own. \n\n\nWay to do that if you don't have access to analytics: create a fresh account, look up similar media, and doom scroll until you hit your video, trying different types of trends if you don't. Then see what the algorithm feeds you after you hit your content. You may be shocked, or it could just...make sense. Derive the population watching this and what content they are expecting to see from that experience. Easy-peasy. \n\n\nThe slowly growing userbase might be more valuable in the future than the almost viral post, but you can derive good information from both. The real value here is not the money, but the data. If you cannot at least infer it from using the app, then you're not the one who's gonna make the money off of your content. ",
          "score": 5,
          "created_utc": "2026-01-30 10:07:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ktev9",
          "author": "rsk01",
          "text": "nuke the majority of the accounts and invest in the standard of the consistent earner and most followed. use that cash to more into making the the videos more authentic, I'm sure if people can track and change multiple people into a cartoon story you can find the best instance for keeping your face consistent.\n\nyour numbers seem off, I don't know if you're talking shit for but January and most of February advertising budgets are slayed across the board, you'd maybe see a 4-6th of the revenue or worse.  so either that means your clicks are increasing on the account or you're not being truthful.  December is the Christmas month, revenue falls off a cliff in the 1st as there is no money for advertising so your conversion and ppc drop dramatically in January year on year. It's takes until mid March to recover for advertising and affiliate.",
          "score": 2,
          "created_utc": "2026-01-30 10:08:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kv0ug",
          "author": "trainmindfully",
          "text": "this sounds less random than it feels. platforms tend to lock onto one account as the test winner and then keep feeding it data, while the others never really get a fair second look. the face thing matters more than we like to admit, even if the movements are identical, because people subconsciously trust certain archetypes more for certain content. once viewers sense something off, even slightly, engagement drops fast and that can quietly cap an account. i would probably pause or kill the bottom ones and focus on learning why the top account works instead of keeping everything alive out of sunk cost. also worth being careful with synthetic faces long term, flags usually start soft before they get serious. you are not crazy, but this kind of setup usually concentrates wins rather than spreading them evenly.",
          "score": 2,
          "created_utc": "2026-01-30 10:22:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqzhr0",
      "title": "Almost gave an advisor 5% equity because I didn't understand cap table management",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qqzhr0/almost_gave_an_advisor_5_equity_because_i_didnt/",
      "author": "No-Pitch-7732",
      "created_utc": "2026-01-30 08:05:05",
      "score": 18,
      "num_comments": 5,
      "upvote_ratio": 0.8,
      "text": "\n\nSomeone at a networking event told me standard advisor grants are like 0.25% to 1% and I genuinely thought he was messing with me. We'd been talking to this BD guy who wanted 5% and I was about to say yes because... idk, he seemed confident about it and I had nothing to compare it to.\n\nThe whole equity thing is way more nuanced than I realized when we incorporated. Like there's fully diluted vs issued shares, how safes actually convert (not how I thought they did), what happens to the option pool when you raise. My cofounder and I spent an entire weekend just trying to figure out what we'd actually be giving away if we said yes to this advisor.\n\nAnyway we didn't give him the 5%. Moved our cap table into mantle after that whole mess because our spreadsheet was making me anxious every time I opened it, couldn't tell if the formulas were even right. But honestly the bigger lesson was just... ask other founders before you commit to anything equity related. Everyone I talked to had a story about some dumb thing they almost did or actually did in year one.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qqzhr0/almost_gave_an_advisor_5_equity_because_i_didnt/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o2khw3j",
          "author": "No_Boysenberry_6827",
          "text": "advisor equity is one of those things nobody explains to first time founders. 5% for an advisor is insane - most standard advisor agreements are like 0.25-1% with vesting. what made you almost agree to it before catching the issue?",
          "score": 9,
          "created_utc": "2026-01-30 08:23:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35tumx",
              "author": "rdpl_",
              "text": "idk, if an advisor helps you eg to raise you 3m from nothing with intros, advice, he deserved more than some 0.25% but yeah it is a case by case thing\n\nalso an advisor who gets in for 0.25% is mostly useless and just admin hassle",
              "score": 1,
              "created_utc": "2026-02-02 14:39:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2l5y4h",
          "author": "ScradleyToronto",
          "text": "You dodged a bullet for sure. \nI usually tell people to just pay and keep the cap table clean",
          "score": 3,
          "created_utc": "2026-01-30 11:52:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2minsj",
          "author": "amit_mantle",
          "text": "another thing re: advisors, most of the time your startup will outgrow their advice in 2 years or so. a standard way to structure their vest is on a 2-year plan. past that, you probably need a new set of advisors",
          "score": 1,
          "created_utc": "2026-01-30 16:12:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dd2ek",
          "author": "bkh_leung",
          "text": "That's like founding engineers type of equity... \n\nAny sales people should only get minimal equity and should get top line only...",
          "score": 1,
          "created_utc": "2026-02-03 17:00:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qs8753",
      "title": "What's the most professional, polite, and non apologetic way of saying \"I Quit\" ?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qs8753/whats_the_most_professional_polite_and_non/",
      "author": "pencilpo",
      "created_utc": "2026-01-31 17:19:06",
      "score": 15,
      "num_comments": 16,
      "upvote_ratio": 0.83,
      "text": "(Read this like Adam Sandler is Narrating)\n\nMy client is happy. Like… \"actually\" happy. He approved the final design two days ago after 22 days of revisions on his coffee shop’s logo.\nTwenty-two. Days.\nI’ve had shorter relationships.\n\nI’m a logo designer, and this project completely drained me. But I love my work. I really do. I work way harder than most people think, so I went above and beyond the contract. Instead of the originally agreed 4 to 6 revisions, I did 10.\nTen.\nBecause I’m emotionally weak and creatively optimistic.\n\nI know, I know , you can call me out.\nI just really loved the project and wanted to finish it right.\n\nSo anyway… I’m sitting there, feeling proud, feeling done, feeling like a responsible adult.\n\nAnd then, boom.\n\nMy client’s girlfriend shows up, bulldozes everything we’ve done for the last 22 days, hands me a hand-drawn doodle, and says she wants \"that\" as the logo instead.\n\nA doodle.\n\nThe client just stood there.\nNot confused. Not surprised.\nJust… accepting his fate.\nLike a man who knows this meeting is no longer his meeting.\n\nI’ve already received 60% of the payment, even though 100% of the work is done, and honestly, I think I’m done too.\nProfessionally.\nEmotionally.\nSpiritually.\n\nSo what’s the best way to politely refuse and terminate this contract…\nwithout you know, hurting their feelings. throw me your best text message grade refusals.\n",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qs8753/whats_the_most_professional_polite_and_non/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o2tjpea",
          "author": "useomnia",
          "text": "Simple: \n\nHey, we’ve reached the finish line on the approved logo so I’m closing the project here, and if you want to pivot to a new concept (like the doodle) that’s a separate project with a new quote, timeline, and deposit.",
          "score": 46,
          "created_utc": "2026-01-31 17:21:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2tjy2p",
              "author": "pencilpo",
              "text": "Pretty good. Just feeling bad that I won't be getting paid the remaining 40 percent.",
              "score": 6,
              "created_utc": "2026-01-31 17:23:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2tk8kd",
                  "author": "useomnia",
                  "text": "Totally get that, but don’t eat the cost of their pivot: if the logo was approved/delivered, invoice the remaining 40% as the completion balance, and treat the girlfriend doodle as a new project only if they want to fund a restart.",
                  "score": 24,
                  "created_utc": "2026-01-31 17:24:27",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2tvtm7",
                  "author": "AaronDoud",
                  "text": "Why?  I wouldn't even touch the new project till I got paid.  And depending on the contract they hopefully can't legally use it (if they want to) till you are fully paid.\n\nContracts make or break this kind of business.  As does knowing how to handle things when they go completely side ways.\n\n\"Mr. Client if this other logo idea is what you want I would be happy to work on that for you.  Before we can do that we need to finalize payment on this one that you approved.  You don't have to use it but once you have paid it is legally yours as per our contract.  You can do whatever you want with it once payment is finalized.\n\nSo would you like to write a check for the final amount for this project now?   Also what day would you like to schedule to go over this new project?\"  \n\nThey balk the balk.  It is what it is.   Maybe you try to collect the 40% or maybe you just figure it isn't worth wasting good chasing bad.   But what you don't do is touch this new project unless the old project is properly settled.  \n\nChasing the 40% by doing this essentially new project it foolish.  You would be giving him 40% off the first and 60% off the second and not even be sure you would get paid that final 40% even if you did the work.",
                  "score": 4,
                  "created_utc": "2026-01-31 18:19:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2v0em1",
          "author": "BeauNerday",
          "text": "Ahh the ol no contract gig. You’ll learn.",
          "score": 2,
          "created_utc": "2026-01-31 21:36:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2w4ldk",
          "author": "Pup2u",
          "text": "Well. I’ve done handstand attempting to get my logo designed. I’ve hired and fired several as I have given them almost exact copies of what I want, I just wanted the colors tweaked and my info cleaned up. Deadlines passed. They got second chances. Then they got fired.",
          "score": 2,
          "created_utc": "2026-02-01 01:12:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2wce6m",
              "author": "pencilpo",
              "text": "Just a color change and info tweak ? That's like a day's job, max.",
              "score": 1,
              "created_utc": "2026-02-01 01:59:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2wk5hs",
                  "author": "Pup2u",
                  "text": "Yes, I agree.  And yet 3 weeks past the agreed upon date she would have the mock up to me I was getting \"I'm just starting to work on it now\". One excuse is fine, but twice, without me hearing it from you first without me asking and  I fire you.  People make errors and mistakes.  As a customer, they have the golden rule on their side- Them that;s got the gold, makes the rules.  As a vendor, it can get frustrating.  But they pay the bills. If the GF turns the art work on it's head.  Bill for the hours spent to date.  Smile and start fresh with a new quote. Call it job security.",
                  "score": 1,
                  "created_utc": "2026-02-01 02:46:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2vxf4m",
          "author": "Any-Entrepreneur2644",
          "text": "Man, that sounds brutal! It's wild how some clients just don't get the time and effort we put in. I've had a similar situation where I poured my heart into a project, only to have someone come in and change everything last minute. It's tough, but sometimes stepping away is the best call for your sanity. Good luck with the next project, and remember, it’s okay to set boundaries!",
          "score": 1,
          "created_utc": "2026-02-01 00:31:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xnn2t",
          "author": "NewSpace2",
          "text": "You used Chat BLT to make this sandwich",
          "score": 1,
          "created_utc": "2026-02-01 07:33:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o309l7l",
          "author": "organizedmind_",
          "text": "This isn’t really about quitting, it’s about drawing a clean boundary after you’ve already gone above and beyond.\n\nThe cleanest exits usually aren’t dramatic or emotional. They’re calm, factual, and anchored to what was originally agreed, without defending or over-explaining.\n\nWhen you’re clear and neutral about the scope being complete, it tends to land better than trying to soften it with extra justification.",
          "score": 1,
          "created_utc": "2026-02-01 17:49:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30p6lz",
          "author": "Drygrej",
          "text": "Change your contract to this specifically: \n\n‘Project completion averages 4.8 revisions per project and 14 days. This project includes a maximum of 4 major revisions and 4 minor revisions. “Major revision” means moving any part of the design that requires rearranging design elements. “Minor revision” means changes to color or [make your own decision]. Additional revisions are charged by the half hour at $250/hr and payable upon delivery of the revision. Major revisions require at least 2 hours. No ‘extra’ revisions will be accepted unless 90% of the contract is paid; the final 10% is due with final approval of the design prior to delivery of the final product. If the project extends beyond 21 days, the full amount of the contract is due even if the final design has not been approved and the final design formatting will be billed as a final revision. \n\nThe initial consultation leads to x number of designs. After deciding to pursue a design, changing to a different concept will require a new project contract. This contract will be considered complete and a credit applied to the new contract prorated to account for work already complete. This does not matter if the new concept is one of the presented designs or a completely different concept.’\n\nWhen you are sending revisions back, the subject of the email or somewhere very obvious on the deliverable needs to have MAJOR REVISION #2/3 or something similar. When they ask for the first “extra” revision, you send the invoice for the amount due and then wait until it’s paid per your contract terms. It’s scary, but when you hold the line, most people will pay and not even question it. Don’t ever apologize for holding to your agreement. It’s not negotiable until you signal to the client that it is negotiable. Don’t do that.\n\nIn this situation, you dug yourself in. Stop the bleeding and say the project is done and send the bill. If the girlfriend freaks out, move on, send the bill, and be pleasantly surprised when the client pays and apologizes.",
          "score": 1,
          "created_utc": "2026-02-01 18:59:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37ekwg",
          "author": "Wooden_Dragonfly_608",
          "text": "I must go, there is time to waste in less fruitful endeavors.",
          "score": 1,
          "created_utc": "2026-02-02 19:04:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2whyqw",
          "author": "kubrador",
          "text": "here's the move: \"i've delivered everything in our agreement plus extra revisions in good faith. the direction you're moving in requires a fresh perspective and designer. happy to refer someone who'd be perfect for this next phase.\"\n\n\n\nthat's it. you're not quitting, you're just professionally incompatible now. and you keep 60% of their money for the entertainment value alone.",
          "score": 0,
          "created_utc": "2026-02-01 02:33:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wpo5i",
          "author": "Maleficent-Lime5614",
          "text": "Definitely bill the remaining 40% whether or not you agree to work on the new design. If the client squeaks you can decide to walk away with the 60% definitely don’t do anymore work for the client.",
          "score": 0,
          "created_utc": "2026-02-01 03:19:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtsfa0",
      "title": "Should I continue with my degree or drop it to go the entrepreneurial route?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qtsfa0/should_i_continue_with_my_degree_or_drop_it_to_go/",
      "author": "Pikachu856",
      "created_utc": "2026-02-02 11:21:44",
      "score": 14,
      "num_comments": 34,
      "upvote_ratio": 0.9,
      "text": "Hello, \n\nI’m 21 (in Canada) and a university student, doing computer science. I’m pretty much in my last year. I know the logical thing to do is just finish the degree since I’m almost done, I only have like 9 courses left to do including this current semester. I don’t know whether it’s because I’m juggling too many things at once and I’m burnt out which is why I feel like quitting everything and running away to some island or what.\n\nAbout my work situation. I am taking 3 courses. I’m working on 5 paid projects currently which are related to software development. I’m also working part time on the side remotely as a full stack dev intern. This has given me confidence to build stuff on my own and try to sell it. I contacted one of my old workplaces where I worked as an admin assistant and I remembered a specific problem they had and I was able to provide them a solution for a small price. I’m also good at social skills, so maybe that’s why they remembered me and trusted me?\n\nBefore I had any tech work to do, I was working retail and as a technical instructor to children, and like different summer jobs basically to earn some money. \n\nWhat university has done for me in the past 4 years. The student status helped me get into a program/networking that led to all this current paid work I’m doing and really padded my resume. I also got some paid TAing experience. But what it hasn’t done for me is actually teach me anything…. It probably is my fault since I don’t go to class at all. I don’t remember a single course over the years where I actually went to class regularly. Usually I just go for a few days then stop and work on assignments online and show up before the exam days. I literally only study the night before and cram everything. I get Bs and Cs somehow. My friends tell me I’m crazy for spending so much money doing a degree and I’m not even “making an effort” towards my education, but like they don’t know what I do on the side or how much I’m always working and sacrificing my sleep and I don’t feel like explaining it to them either cuz it doesn’t matter. \n\nBut it does make me wonder whether I’m doing the right thing? Before when I was working simpler jobs where I didn’t have to use my brain as much, university didn’t really bother me. But since the past year, it’s been really bothering me. Last winter semester, I withdrew from classes halfway cuz I just couldn’t take it and only got half tuition refunded. Fall was okay, but now I’m feeling it again, especially since it’s more work than before. \n\nI don’t know if this matters but I’m Asian and I was brought up in a strict abusive household and I learned pretty quickly that unless I earn money I’m pretty useless to everyone, so yea that’s been carved in my brain to “make money” And they probably would have a big problem with me quitting (not that they pay for any of my school, but I live with them)\n\nI literally have an exam in like 6 hours and I can’t bring myself to study, usually I would be cramming, but I just hate it so much. It’s not even that hard. \n\nThe reason I can even think about dropping out and going the entrepreneur route is because of the experience I have gained so far. I am also not romanticizing the idea of entrepreneurship, I know it may be years of grinding and not achieving anything in the end. it’s just something I feel like I must try or I would regret it for the rest of my life. I also don’t have an exact plan in mind of what I would do if I were to drop out today, but the problem is I don’t have the time to THINK about it or explore it since there’s always one thing after another due. I have bunch of ideas listed, but no time to try any of it or validate the market for it. \n\nI feel like I’m shooting a shot in the dark. Idk I’m lost. Any advice is appreciated, thanks. \n\nTLDR; Did you quit uni/college to go the entrepreneur route or did you stick to doing both? How do you even keep going?  ",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qtsfa0/should_i_continue_with_my_degree_or_drop_it_to_go/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o34zpe0",
          "author": "Zealousideal-Cod-924",
          "text": "Get your degree.",
          "score": 23,
          "created_utc": "2026-02-02 11:26:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o352m2t",
          "author": "TommyBonnomi",
          "text": "As someone who never did their thesis to finish their masters in CS, just finish it.\n\nI'd also recommend you get a real job then, but if you're anything like me, that that will probably fall on deaf ears at your age. There's a lot you don't know yet, which is fine, but you don't even know what you don't know yet. The only way to fix that is experience.",
          "score": 7,
          "created_utc": "2026-02-02 11:50:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35c6ck",
              "author": "RiseAdvisoryCFO",
              "text": "I always say there’s a few mindsets people can have:\n1) you know, and you know that you know\n2) you don’t know, and you know that you don’t know\n3) you know, but you think that you don’t know\n4) you don’t know, but you think that you know\n\nThat fourth category is the worst - you don’t want to be in that one. It’s very difficult to interact with such people as well.\n\nComing back to the question, with only about a year / 9 courses left, there won’t ever come a time in the future where you’ll regret completing your degree, because you’re so close. However, if you decide to drop out, the opposite might be true.",
              "score": 2,
              "created_utc": "2026-02-02 12:59:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o35c0xs",
          "author": "bkk_startups",
          "text": "As someone who dropped out, don't do it. The reason is, you don't know what you want to do and you have too much self doubt.\n\nYou gotta be tough as shit if you dropout. Everyone is going to doubt you and hate your decision. You have to be like an athlete showing up to an away arena, you gotta be fired up by the hate.\n\nYou don't even know what you'll be doing if you dropout. Just finish.\n\nI dropped out and I knew what I wanted to do and still failed for 4 years before finally hitting my stride. But my mindset was unbreakable, I loved the hate I received.",
          "score": 4,
          "created_utc": "2026-02-02 12:58:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o358s38",
          "author": "ZealousidealForm88",
          "text": "That sounds incredibly overwhelming, and it's completely understandable to feel burnt out. You're juggling so much more than just school. The fact that you've built a solid freelance career while still in school is seriously impressive. It's a tough call, but since you're so close to finishing, could taking a lighter course load next semester give you the breathing room to explore your business ideas without the pressure of dropping out entirely?",
          "score": 3,
          "created_utc": "2026-02-02 12:36:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3544yd",
          "author": "losrain",
          "text": "Just finish the degree its only 9 credits then do your own thing",
          "score": 2,
          "created_utc": "2026-02-02 12:02:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35f079",
          "author": "1Gladiator1",
          "text": "Get your degree. Get off reddit now and study for your exam",
          "score": 2,
          "created_utc": "2026-02-02 13:17:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35gmk6",
          "author": "IcyInstruction2690",
          "text": "9 courses is nothing. youre already doing the hardest part - the work itself. the degree is just paperwork at this point\n\nthe burnout youre feeling isnt from school, its from doing too much at once. once you graduate you can drop a project or two and actually have time to think about what you want to build\n\nalso fwiw the cs degree opens doors for things like work visas, enterprise clients who care about credentials, certain government contracts. you dont need it to succeed but its nice to have as a fallback",
          "score": 2,
          "created_utc": "2026-02-02 13:26:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o351bx2",
          "author": "TankSubject6469",
          "text": "Drop when your side income makes you per year more money than 5 years of work with degree",
          "score": 1,
          "created_utc": "2026-02-02 11:40:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35h3zf",
          "author": "iadarshgowda",
          "text": "Get ur degrees for name sake and take a break after that may be",
          "score": 1,
          "created_utc": "2026-02-02 13:29:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35l7vw",
          "author": "Land_of_smiles",
          "text": "Finish school",
          "score": 1,
          "created_utc": "2026-02-02 13:52:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35o47x",
          "author": "Unhappy-Bunch-4594",
          "text": "9 courses is the finish line, not the starting line. the fact that you're already earning from dev work while in school puts you way ahead of most people who graduate with zero real experience.\n\nthe problem isn't school vs entrepreneurship — it's that you're running 5 paid projects + an internship + 3 courses simultaneously. that would burn out anyone. drop a couple of the paid projects for this last stretch, finish the degree, and then go all in. you'll have the credential as a safety net and the actual skills to back it up. nobody's gonna care about your GPA but that piece of paper opens doors you don't even know about yet — especially in canada with immigration and enterprise contracts.",
          "score": 1,
          "created_utc": "2026-02-02 14:08:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35oocm",
          "author": "MathewGeorghiou",
          "text": "No need to read the full story — if you are that close to graduating, graduate.  If you were further away, the conversation might be different.",
          "score": 1,
          "created_utc": "2026-02-02 14:11:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35p7fl",
          "author": "affilitebabra998",
          "text": "get your degree pls",
          "score": 1,
          "created_utc": "2026-02-02 14:14:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o366kxq",
          "author": "Pup2u",
          "text": "Do both. Get the degree.",
          "score": 1,
          "created_utc": "2026-02-02 15:42:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36ej3t",
          "author": "PrettyRadio2073",
          "text": "Listen to someone who has seen 35 years of tech cycles. You are currently in the **Circle of Burnout**, and you are making decisions based on exhaustion, not strategy.\n\nYou have 9 courses left. In the grand scheme of a 40-year career, that is a blink of an eye. If you drop out now, you aren't 'becoming an entrepreneur,' you are just escaping a pressure cooker.\n\n**Here is the reality check from my book, Startup Inferno:** Entrepreneurship is not an escape from hard work; it’s an intensification of it. If you can't manage the 'annoying' task of finishing 9 courses, the 'annoying' tasks of taxes, legal compliance, and failed pivots will crush you even harder.\n\n**My advice to save your sanity and your future:**\n\n1. **The 'Good Enough' Degree:** stop aiming for B's and C's if it costs you your sleep. Aim for the bare minimum to pass. A degree is a binary switch (Yes/No); nobody cares about your GPA once you've built your first SaaS.\n2. **Cut the Projects:** You are working 5 paid projects + an internship + university. That’s not entrepreneurship; that’s **Self-Exploitation**. Drop 2 projects. The money you lose now is cheaper than the therapy you'll need later.\n3. **Validate, Don't Guess:** You say you have ideas but no time to validate. That’s a trap. Most people who quit uni to 'build' end up doing **Startup Cosplay,** acting like founders without a market.\n\nI wrote Startup Inferno for people exactly in your position: high-achievers who are burning out because they don't have a map to navigate the fire.\n\n**Finish the degree.** Not for your parents, but for your 'Future Founder' self. It’s the ultimate test of finishing what you start, a trait every successful entrepreneur needs.\n\nTake a breath. Go to that exam in 6 hours. Don't study to master it; study to survive it.",
          "score": 1,
          "created_utc": "2026-02-02 16:19:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36kny2",
          "author": "freshWaterplant",
          "text": "Do NOT drop out. Try a side business, validate your assumptions, talk to your ideal customer profile. Don't know who they are? Figure that out while studying.",
          "score": 1,
          "created_utc": "2026-02-02 16:47:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36oits",
          "author": "Phanes7",
          "text": "As a college drop out who is fine with that choice my rec would be to finish the degree. \n\nYou have 1 year left, just lock in and get it done.\n\nYour time & money over the last few years will have an ROI, your parents will be happier, and yo will have a backup should you need it. (statistically you will need it). \n\nIf you really want to start a business you can do it in a year. If all your ideas will be defunct by then they were bad ideas anyways.",
          "score": 1,
          "created_utc": "2026-02-02 17:05:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36qhlm",
          "author": "softwareVagabond",
          "text": "As someone who hated university while in it, and wanted to do entrepreneurship, I’m so happy I got my degree. I’m in entrepreneurship now and it opens many doors if I were to fail out of my business. ",
          "score": 1,
          "created_utc": "2026-02-02 17:14:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36vbrr",
          "author": "OneHunt5428",
          "text": "Since you are so close I’d seriously consider finishing the degree while you keep building on the side. The degree is optional long term but it’s a cheap safety net once you already paid most of the cost. You can still go all in on entrepreneurship after with way less pressure.",
          "score": 1,
          "created_utc": "2026-02-02 17:37:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37o4cw",
          "author": "DarkIceLight",
          "text": "Finish it, make it your first priority. Everything else comes second now, you invested, now get the payout from it.",
          "score": 1,
          "created_utc": "2026-02-02 19:48:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37pw4u",
          "author": "duoexpresso",
          "text": "Just finish it",
          "score": 1,
          "created_utc": "2026-02-02 19:56:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o384glh",
          "author": "MousseFar1291",
          "text": "never ever drop out of college, you'll regret it in the long run. trust me.",
          "score": 1,
          "created_utc": "2026-02-02 21:05:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38eyhg",
          "author": "RoleHot6498",
          "text": "Hate to tell you this but despite all the wonderful advice you're getting on this post, nobody but YOU can answer that question. Nobody has a crystal ball to tell you what's the direction you \"should\" take. Forget that. \n\n\nFollow your strongest impulse, trust yourself. You've got this ",
          "score": 1,
          "created_utc": "2026-02-02 21:55:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38gejf",
          "author": "nanojunior_ai",
          "text": "ok so i literally just finished my CS degree last year and i was in a super similar headspace around your point — juggling freelance projects, barely going to class, questioning everything. so take this from someone on the other side of it.\n\nfinish it. but not for the reasons everyone else is saying.\n\nthe thing nobody told me is that the degree isn't really about the education (you clearly already know that, you're teaching yourself more from the paid work than any lecture). it's about the *optionality*. there are so many random situations where having the degree matters in ways you can't predict right now — visa applications, enterprise clients who need to check a box, investors who use it as a lazy filter, even just your own confidence when imposter syndrome hits at 3am.\n\nbut here's the part i think people are missing: your problem isn't school vs entrepreneurship. your problem is you're running like 7 things simultaneously and your brain is screaming for mercy. 5 paid projects + internship + 3 courses is genuinely insane. i tried doing something similar my senior year and i literally got shingles from the stress lol. at 22.\n\nwhat i'd actually do if i were you: drop 2-3 of the paid projects for your last stretch. yes you'll make less money for a few months. but you'll actually have bandwidth to breathe AND think about what you want to build after. right now you don't have time to think and that's why everything feels so suffocating — it's not the degree, it's the lack of any margin in your life.\n\nalso the fact that you went back to an old workplace, identified their pain point, and sold them a solution? that's literally entrepreneurship already happening. you don't need to drop out to \"go entrepreneur\" — you're already doing it. you just need to finish the last 9 courses so you have the safety net and then go all in.",
          "score": 1,
          "created_utc": "2026-02-02 22:02:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38wmk6",
          "author": "Necr0o0",
          "text": "Be patient and humble. As right know all looks good and perfect in entrepreneurship it really all can change in a blink of an eye. I would suggest having at least 1 year of runaway to start thinking on going on your own, but still have mindset to grind and learn from mentors.",
          "score": 1,
          "created_utc": "2026-02-02 23:25:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39hc67",
          "author": "le_pouding",
          "text": "Get your degree. Then start your business with real lige job experience",
          "score": 1,
          "created_utc": "2026-02-03 01:19:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39oy1x",
          "author": "Southern-Box-6008",
          "text": "If you already have very nice idea to start your own business or company, then you can drop out to work on your company, otherwise finish your university to get degree will be your best option. Study is boring sometimes, but you will be paid off in long run.",
          "score": 1,
          "created_utc": "2026-02-03 02:03:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39y2sm",
          "author": "_B_Little_me",
          "text": "Finish. You’ll need that piece of paper later.",
          "score": 1,
          "created_utc": "2026-02-03 02:55:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3at6i6",
          "author": "BusinessStrategist",
          "text": "Fear and the urge to escape is not a sign of good things to come.\n\nEntrepreneurs don’t give up. They go down with the ship!\n\nCan you sit down and make a list of all the “expectations” that will be shattered by your failures?\n\nWRITE THEM DOWN in your private journal. Or better yet, use a mind mapping app to capture them. This will allow your mind to figure out options. And identify YOUR priorities.\n\nAdd your personal thoughts about what it is that YOU value the most. You appear to be trying to appease outside influencers instead of charting YOUR course.\n\nEntrepreneurship is all about charting a course and getting to YOUR destination.\n\nMe thinks that maybe you don’t yet have a strong motivation for any destination.\n\n\nTake the time to capture as many ideas of the possible routes you can take from this point moving forward. Your mind map app lets you put as many thoughts as you can generate onto your map.\n\nFirst focus on getting as many options as you can in say 20 minutes onto your map. \n\nNO EVALUATION. Capture! Capture! Capture! Add those visions that you had growing up. \n\nOnce you’ve emptied your mind of ideas. Put the map away for a day or two.\n\nWhen you come back to it. You’ll have put on your “critical thinking hat.”\n\nYou”ll want to add the PROs and CONs to every idea, however foolish or stupid you now consider the thought to be. You’ll probably start to see glimpses of YOUR Visions of how your future could be.\n\nRemember, this exercise is meant FOR YOUR eyes only!",
          "score": 1,
          "created_utc": "2026-02-03 06:31:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3atib6",
          "author": "BusinessStrategist",
          "text": "And yes, dropping out for a year or too and exploring the world might be a beneficial option.",
          "score": 1,
          "created_utc": "2026-02-03 06:34:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3b25ng",
          "author": "cloudybrain07",
          "text": "9 courses left? just finish it. you're literally almost done. you already have paid clients and projects. the degree is just backup at this point. finish while doing your side work. looking at programs like tetr where you build businesses while studying. but honestly you're basically already doing that - just push through last 9 courses.\n\ndropping out 9 courses away is insane. you can explore entrepreneurship after graduation without burning the safety net.",
          "score": 1,
          "created_utc": "2026-02-03 07:51:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cwdqj",
          "author": "Competitive_Jello773",
          "text": "Unrelated to your field, I am fairly high and make good money in construction as a manager, I do CM/PM roles mostly, estimate etc. \n\nOne thing that is holding me back from growing further is letters behind my name. Now I am 39, I can’t just leave to go get an engineering degree, (4 years in person) and the get my stamp, I wish when I was younger, I took different steps. I now have a family etc. the path is def harder without those little letters",
          "score": 1,
          "created_utc": "2026-02-03 15:42:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o355nm4",
          "author": "Maleficent-Lime5614",
          "text": "Yeah… the work you’ve done so far is a sunk cost. You won’t see any benefit from it without the paper. It does sound like you are letting some early negative talk impact your current thinking. Depending on the school you go to, there are counsellors on site or usually access to a helpline and you could talk through some of the issues you are having with focus and self worth. You sound like a smart kid with lots to offer, I would get the degree mostly because of what it symbolizes but also because you do owe it to yourself to try. But maybe quit one of the paid gigs for the remainder of the degree, you don’t have to be pushing yourself this hard.",
          "score": 1,
          "created_utc": "2026-02-02 12:13:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq1xnk",
      "title": "Stopped asking \"would you use this?\" and started asking something way more uncomfortable. Everything changed.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qq1xnk/stopped_asking_would_you_use_this_and_started/",
      "author": "bishwasbhn",
      "created_utc": "2026-01-29 07:21:30",
      "score": 13,
      "num_comments": 5,
      "upvote_ratio": 0.74,
      "text": "There's this trap most founders fall into and I fell into it hard. You talk to people, they say \"yeah I'd use that,\" and you think you've validated something. You haven't. You've just collected polite rejections dressed up as interest.\n\nLast year I talked to maybe 50 people about something I was building. Most said some version of \"sounds useful\" or \"keep me posted.\" So I built it. Launched. And then... nothing. That weird purgatory where people sign up, poke around, and never come back.\n\nI've since watched this same pattern wreck other founders too. Someone comes into a thread excited, saying \"we talked to customers and built exactly what they asked for!\" and I already know what's coming. They built a Franken-product from scattered opinions. Solved nothing deeply. Pleased no one fully.\n\nWhat finally clicked for me: I was asking the wrong questions. \"Would you use this?\" is basically asking someone to be nice to you. And people are nice. Saying yes costs them nothing.\n\nThe thing that actually worked was getting uncomfortable. Asking \"what would you pay for this, right now, today?\" and then shutting up. Counting the seconds. If they hesitate more than 3 seconds, they're not thinking through logistics. They're searching for a polite way to say no.\n\nReal interest sounds like \"when can I start?\" or \"how much?\" Fake interest sounds like \"interesting, keep me posted.\" Totally different animals, and I couldn't tell them apart until I started asking harder questions.\n\nI ended up documenting the whole process I use now, the questions, the signals, how to tell if someone will actually pay before you build anything. Helps me not fall into the same trap twice.\n\nCurious if anyone else has been through something similar or sees it differently.",
      "is_original_content": false,
      "link_flair_text": "Idea Validation",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qq1xnk/stopped_asking_would_you_use_this_and_started/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o2derm9",
          "author": "Glittering-Ad-8609",
          "text": "The 3 second rule is real. I've started noticing it in my own validation calls. When someone actually wants the thing, they start asking logistics questions immediately. \"Does it work with X?\" \"What's the pricing?\" \"When can I try it?\"\n\n\n\nWhen they don't want it, they ask conceptual questions. \"So how does it work exactly?\" \"Interesting, what made you think of this?\" They're being curious, not buying.",
          "score": 10,
          "created_utc": "2026-01-29 07:26:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dua1u",
          "author": "trip42",
          "text": "There’s a book called “The Mom Test” that describes this problem. People want to be nice, so you have ti structure your validation in a way that your mom would be honest instead of supportive.\n\nSounds like you’re on the right track!",
          "score": 5,
          "created_utc": "2026-01-29 09:49:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fewze",
              "author": "Omissionsoftheomen",
              "text": "Clearly they’ve never met my mother.",
              "score": 2,
              "created_utc": "2026-01-29 15:42:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2dxxnf",
          "author": "Sea-Environment-5938",
          "text": "I’ve found even “would you pay for this?” can still be hypothetical. What changed things for me was asking how they’d buy it: budget owner, approval process, timing. Real buyers answer concretely.",
          "score": 1,
          "created_utc": "2026-01-29 10:22:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f4p1c",
          "author": "BeardedWiseMagician",
          "text": "Interest without urgency is just feedback, not demand. The moment someone talks money, timing, or switching costs, the conversation changes completely.\n\nSeeing that constantly...",
          "score": 1,
          "created_utc": "2026-01-29 14:55:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpaftt",
      "title": "I gave Gemini WhatsApp chats to analyze and users started fighting with their partners",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qpaftt/i_gave_gemini_whatsapp_chats_to_analyze_and_users/",
      "author": "Itchy_Assignment_970",
      "created_utc": "2026-01-28 12:48:14",
      "score": 11,
      "num_comments": 20,
      "upvote_ratio": 0.62,
      "text": "I was experimenting with Gemini and vibe coded a small tool called **Unsaid**. The input is simple: a WhatsApp chat export. The output is not advice or summaries. It just points out conversational patterns like a neutral third person reading the chat.\n\nI expected this to be a mildly interesting NLP side project.\n\nWhat I did not expect was how people reacted to the output.\n\nI shared it with a few friends as a joke. It went a bit viral in their circles and within days around 1500 reports were generated purely through word of mouth. People were not impressed by the tech. They were uncomfortable reading their own conversations like evidence. Some said it explained why they feel constantly confused in relationships. A few even argued with their partners because of things the report highlighted.\n\nThe real problem was not analysis. It was privacy. Nobody wants to upload personal chats anywhere, so I had to redesign that part from scratch in the safest way I could. I just put up a basic page for it at unsaid .buzz so I did not have to keep sending files manually.\n\nWhat is fascinating is this. People spend money on astrology apps like Astrotalk to understand their relationships. But when patterns are derived from their actual conversations, the reaction is far more intense.\n\nI am now considering monetising this for Indian users because WhatsApp is where most personal and even semi professional communication happens here.\n\nIs this a genuinely useful AI use case, or are we entering a weird territory where people start outsourcing emotional intelligence to LLMs?\n\nAnd if people are willing to pay for horoscopes, will they pay to see what they actually sound like in their own chats?",
      "is_original_content": false,
      "link_flair_text": "Idea Validation",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qpaftt/i_gave_gemini_whatsapp_chats_to_analyze_and_users/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o2bzl6w",
          "author": "Mathemodel",
          "text": "You should actually release this, I want to use it and I would pay (USA)",
          "score": 4,
          "created_utc": "2026-01-29 01:48:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2bznxr",
              "author": "Itchy_Assignment_970",
              "text": "It’s already up. You can use it right now at unsaid.buzz",
              "score": 3,
              "created_utc": "2026-01-29 01:48:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o281l4u",
          "author": "Sukanthabuffet",
          "text": "EQ market within LLMs is already massive. I occasionally use Claude as a third party observer to counsel me in situations, from romantic relationships to work politics. \n\nIt can be really useful, but it can also be disastrous without the proper context. \n\nAs someone who loves data, your results are very intriguing.",
          "score": 6,
          "created_utc": "2026-01-28 14:52:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31bgwi",
              "author": "OllieWillie",
              "text": "Oh God that's a disastrous idea. Talk to a person not ai for relationship advice",
              "score": 1,
              "created_utc": "2026-02-01 20:46:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o289l53",
              "author": "Itchy_Assignment_970",
              "text": "I got really great feedback. Do check the product and let me know what you think. Link: unsaid.buzz",
              "score": 1,
              "created_utc": "2026-01-28 15:30:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ru8zo",
                  "author": "PartiZAn18",
                  "text": "Can't upload a zip or txt",
                  "score": 2,
                  "created_utc": "2026-01-31 11:22:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o27zqqc",
          "author": "Careless-Leek-9164",
          "text": "Super duper cool - love this idea.\n\nI think what you’re running into is the difference between people getting hopeful and abstract “solutions” to their relationships vs what’s really under their own hoods and pointing out specific patterns they’d need to change based on their actual words.\n\nPeople fantasize about new or different lives all the time, but how many actually put in the real hard work to make the changes necessary to achieve those fantasies?\n\nFor example…if I was having relationship challenges and went to a horoscope, it’s going to give me things I can interpret in many ways to fit my narrative on what I think or want or believe about the relationship.\n\nOn the flip side, if Unsaid analyzed my relationship and gave me the patterns and issues and changes, it’s a direct reflection on ME, not some abstract astrological crap that’s there to make one feel somewhat understood and not judged. Also, astrology groups people into cohorts - this is straight up ME or my significant other.\n\nBeing an authentic person to a fault, I would love this as it may help me identify things my current brain overlooks, especially in relationship oriented things that may slip through the cracks or impact the other without me really getting the point. But…I’m also the type of person that says things as honestly and objectively as possible - not someone who is trying to control or keep others in a certain way.\n\nIn summary, I think the idea is great; however, I don’t think many people in today’s society are ready for truth like this. But we have to start somewhere.",
          "score": 4,
          "created_utc": "2026-01-28 14:44:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o288wx0",
              "author": "Itchy_Assignment_970",
              "text": "Thank you.",
              "score": 1,
              "created_utc": "2026-01-28 15:27:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o295uhj",
          "author": "Nightshade_Chronicle",
          "text": "I think this is fascinating, and yes there is a market out there for your app in one version or another. I think maybe pivoting slightly might work out better for you. The idea you mentioned of advertising this to Indian users who actually use WhatsApp in a professional manner, you can have your app extrapolate the data from their conversations and it then becomes a very useful business tool for them, summarizing conversations, presenting the data analytics in a way that they can apply it to further their businesses/work. The security and privacy might be an issue. If you currently have to manually create the reports, that doesn't scale sustainably. You need to figure out a way to automate that, and make sure you have security baked in so the users know their information is safe and secure.",
          "score": 2,
          "created_utc": "2026-01-28 17:50:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2amltz",
              "author": "Itchy_Assignment_970",
              "text": "It’s fully automated now. You can check it out at unsaid.buzz and give me your feedback. \n\nThanks for the insight",
              "score": 1,
              "created_utc": "2026-01-28 21:41:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2tbeu7",
          "author": "TrollPro9000",
          "text": "You can flip the privacy concerns upside down in your messaging. Zodiac has plausible deniability (\"I get how it works, but it doesn't apply to me\" can be said about it). Your personal WhatsApp conversations analyzed with prosecutorial accuracy do not. That's the difference. Perhaps, think about how to formulate that on your sales page before folks sign up, to psychologically prep them for what they may not be ready to experience? \n\n\n\"Most unsettling WhatsApp widget\" might be a curious headline / angle to pursue. Gets people to wonder, what's so unsettling about it? And that's half the battle right there.",
          "score": 2,
          "created_utc": "2026-01-31 16:41:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2x4y27",
              "author": "Itchy_Assignment_970",
              "text": "I like this angle. Thanks for the detailed insight",
              "score": 1,
              "created_utc": "2026-02-01 05:01:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27mq9e",
          "author": "notyoursoaplady",
          "text": "Super interesting",
          "score": 3,
          "created_utc": "2026-01-28 13:37:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2amdj1",
              "author": "Itchy_Assignment_970",
              "text": "Thanks bro",
              "score": 1,
              "created_utc": "2026-01-28 21:40:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2yok6h",
          "author": "CayoPerican",
          "text": "You should focus on B2B and Whatsapp Business usecases.",
          "score": 1,
          "created_utc": "2026-02-01 12:58:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3119oi",
          "author": "chiarazaaa",
          "text": "Heyy, would you mind if I make an Instagram video covering this?",
          "score": 1,
          "created_utc": "2026-02-01 19:56:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqmuh9",
      "title": "Been using AI to qualify leads for 6 months and I'm genuinely shocked how much I was missing",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qqmuh9/been_using_ai_to_qualify_leads_for_6_months_and/",
      "author": "bureaux",
      "created_utc": "2026-01-29 22:13:22",
      "score": 11,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "2 years in B2B lead gen (building my own lead gen agency). Last 6 months I've been experimenting with AI to speed up my workflow, and honestly? I'm finding qualified leads I would've never caught before. (I get it a waaaay tooo long post, but hear me out, it took about 25 minutes to write it by hand and about 3 hours to structure my thoughts).\n\nThe \"obvious\" stuff everyone knows: 1 ChatGPT for email personalization. 2Scraping LinkedIn with AI parsers. 3 Basic ICP matching\n\nMy approach:\n\n1. AI-generated \"lookalike\" ICPs. I took our 20 best customers, exported their LinkedIn + company data, and fed it to Chatgpt with this prompt: *\"Find hidden commonalities. Ignore obvious stuff like industry and company size. Look at hiring patterns, tech mentions, recent news, executive backgrounds.\"* And 14 of our 20 buyers had hired a \"Head of Revenue Operations\" 3-6 months before purchasing. Not in their title - buried in company announcements and team pages. We never targeted this because it's not a job title we could filter for.\n\nHow I use it now: I scrape \"recently funded\" lists from Crunchbase, then use gpt to identify which ones have RevOps hiring signals in their careers pages or exec LinkedIn profiles. I prioritize those. Conversion rate jumped from 2.1% to 6.8% on that segment alone.\n\n2. \"Negative ICP\" analysis. Exported 500 leads from last year that never converted (including 50 where we actually talked to them and they said no). Fed the data to Claude with context: *\"Pattern-match why these were bad fits. Look for combinations of signals.\"* Companies using Salesforce + HubSpot simultaneously had 80% no-show rate on demos. Also: companies that raised Series B 6+ months ago but hadn't posted any \"we're hiring\" content in 90 days were dead ends (likely hiring freezes, no budget).\n\nHow I use it now: I built a Clay enrichment table that flags these combinations before I even reach out. If I see \"Salesforce + HubSpot\" in their tech stack, I deprioritize or skip entirely. Saved \\~15 hours/month on dead leads.\n\n3. AI-suggested \"weird\" angles. Instead of generic personalization, I use this workflow: Take a prospect's company, feed GPT their recent news + LinkedIn activity + job openings, then ask: *\"What's a specific, non-obvious business problem they likely have right now that our \\[product category\\] solves? Give me 3 angles.\"* Real example: Target was VP Sales at a Series B fintech. GPT surfaced they just expanded to 3 EU countries from US-only. Angle: *\"Compliance with EU data residency for sales calls recorded in Gong - most US fintechs miss this until it's a legal issue.\"* Result: 67% reply rate on that campaign vs. our usual 12%. The specificity hit different.\n\nMy current stack:\n\n* WarpLeads as lead database (tested 12 ICP variations last month without burning credits which is nice for AI experimentation)\n* Clay for AI enrichment and research automation\n* Instantly for sequencing\n* ChatGPT/Claude (honestly I liked Claude more) for the creative qualification angles\n\nAI doesn't just speed up busywork. It lets you *test 10x more hypotheses* about who buys and why. I went from 2-3 ICP tests per month to 15-20. Some fail hard. But the winners? 40% higher reply rates.\n\nGuys, what non-obvious AI workflows are you using for lead qualification? Still feel like I'm barely scratching the surface.",
      "is_original_content": false,
      "link_flair_text": "Resources & Tools",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qqmuh9/been_using_ai_to_qualify_leads_for_6_months_and/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o2hvwv0",
          "author": "Wide_Brief3025",
          "text": "Love your approach with the negative ICPs and digging for hidden hiring signals. One extra thing you might try is auto monitoring industry forums like Reddit threads for real buying signals in conversations. A tool like ParseStream flags posts matching your criteria and filters out non serious leads which can help you catch people actually discussing pain points or looking for solutions right now.",
          "score": 1,
          "created_utc": "2026-01-29 22:35:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hwlvw",
          "author": "Ok_Revenue9041",
          "text": "Digging into nontraditional signals is huge. One thing worth testing is analyzing knowledge engine data to see which competitor brands or solutions pop up in AI recommendations. If you want your agency or clients to get more visibility in those answers, MentionDesk actually helps with optimizing how brands appear in AI driven search results. Could give you another edge in being discovered by the right leads.",
          "score": 1,
          "created_utc": "2026-01-29 22:38:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2i0oqq",
          "author": "Skullclownlol",
          "text": "I'm a data engineer, did this as well for local lead gen for bizdev as a fun test project, on +-100k companies per month for +-6 months. Tons of signals built over a few months. \"Hidden hiring signals\" too, built all the parts of the data pipeline myself to maximize info/context, even got company financials.\n\nAnalysis/statistics just showed me that correlation was very easy to get very high (because you're building insights aiming for high correlation, so you're skewing the outcome), and even at high correlations there was very little predictability in how future leads would go because social behavior / personal preferences were independent.\n\nGrouped/weighted indicators, what you call \"ICP tests\", did support more experimentation (more variety in the tests), but had no predictability for success. After a while it looked more like busywork than success - if you can test more but you're not more successful year-over-year than what you did before, then nothing changed.\n\nOne salesperson's individual strength of connection to the local market was a better indicator of success than anything else, because good personal relationships always trumped \"signals\".\n\nIt's easy to look interesting, it's hard to be statistically significant.",
          "score": 1,
          "created_utc": "2026-01-29 22:59:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2iqpdl",
          "author": "quietcashsystems",
          "text": "This is the first post I've seen that leverages AI to identify patterns, not copywriting.\n\nThe negative point of ICP is enormous. Most teams only focus on who will buy and not who won’t.\n\nHave you ever fed in closed lost deals after the price was shared to find the lift of budget, timing, and authority? Feels like another lift is hidden.",
          "score": 1,
          "created_utc": "2026-01-30 01:19:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2khznl",
          "author": "No_Boysenberry_6827",
          "text": "super curious about your setup. are you using it for initial qualification before a human touches the lead, or throughout the whole funnel? biggest hesitation ive heard is that ai might filter out good leads that dont fit the typical pattern",
          "score": 1,
          "created_utc": "2026-01-30 08:24:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2laqa9",
          "author": "Alternative-Cake3773",
          "text": "Your method of identifying hidden hiring signals is really interesting. I’m curious about how scalable you find this process. Do you think it can maintain its effectiveness as your agency grows and your client base expands?",
          "score": 1,
          "created_utc": "2026-01-30 12:26:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mu22h",
          "author": "Round_Obligation4217",
          "text": "Awesome stuff dude, pretty much using the same stack except your DB and Claude (I feel like chat does a better job even if it has a higher tendency to hallucinate).",
          "score": 1,
          "created_utc": "2026-01-30 17:02:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rr586",
          "author": "KafkaM131",
          "text": "Wow. I must say I am impressed. Ai can be used not just to be used in stupid things but also in some different angles. Because I am local seller you give me some good ideas how to transfer my online presence on bigger scale. A lot of products/services can reach untouched potential costumers. Good. I am starting now ... Thanks",
          "score": 1,
          "created_utc": "2026-01-31 10:54:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qok71w",
      "title": "I really want to start my own business… but I’m stuck between motivation and self-doubt.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qok71w/i_really_want_to_start_my_own_business_but_im/",
      "author": "MeatCrap",
      "created_utc": "2026-01-27 17:22:54",
      "score": 11,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "I’ve been thinking a lot about starting my own business. It’s something I genuinely want, not just a random idea or a phase. I like the idea of building something for myself, making my own decisions, and not always feeling like I’m working on someone else’s dream.\n\nAt the same time, I keep getting stuck in my own head. I have doubts about doing it alone. Not about the work itself, but about trusting myself enough to make the right calls, handle setbacks, and not freeze when things get hard. Some days I feel confident and motivated, other days I’m questioning if I’m even cut out for it or if I’m just romanticizing the idea.\n\nWhat messes with me is that I don’t know if this lack of confidence is just a normal part of the process or a sign that I’m not ready yet. I keep wondering if confidence is something you’re supposed to already have before starting, or if it’s something that only shows up once you’re actually in it.\n\nI guess I’m curious if anyone else has felt this way before starting their own thing. Did you push through the doubt, wait until you felt “ready,” or realize you needed a partner or some kind of safety net? Just trying to figure out if this feeling is part of the journey or something I should take seriously.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qok71w/i_really_want_to_start_my_own_business_but_im/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o2386zq",
          "author": "theADHDfounder",
          "text": "Most people think confidence comes first, but that's backwards. Confidence is the result of taking action, not the prerequisite for it. I remember sitting in my car after my first business failed completely, thinking I wasn't cut out for entrepreneurship because I didn't have that unwavering self belief everyone talks about. Turns out the doubt never really goes away, you just get better at moving forward despite it.\n\n\n\nThe mental load is the real skill nobody teaches you about business. You're not stuck between motivation and self doubt, you're experiencing what every entrepreneur goes through but most won't admit. The difference between people who start and people who don't isn't confidence levels, its tolerance for uncertainty. I built my current company ScatterMind while still questioning myself daily, but I created systems that let me execute even when my brain was telling me I wasn't ready. Start small, track your progress, and stop waiting for permission from your own mind because it'll never come.",
          "score": 3,
          "created_utc": "2026-01-27 21:01:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23ondl",
          "author": "YlmzCmlttn",
          "text": "You will question everything all the time. Even if you find a partner or a safety net, you will still think about different possibilities. I believe this is part of the journey of entrepreneurship. Start, and don’t lose momentum. Momentum is critical.",
          "score": 1,
          "created_utc": "2026-01-27 22:14:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25jeve",
          "author": "Pretty_Concert6932",
          "text": "Most people don’t start confident confidence usually comes after taking small steps and surviving a few mistakes. If you are thinking this deeply about it that’s already a good sign.",
          "score": 1,
          "created_utc": "2026-01-28 04:02:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25tk1z",
          "author": "trainmindfully",
          "text": "this feeling is way more normal than people admit. i do not think confidence comes before starting, it usually comes from surviving a few mistakes and realizing you did not die. most people who wait until they feel ready just end up waiting forever. what helped me was starting something small enough that failure was boring, not catastrophic. self doubt never fully goes away, but it gets quieter once you have real data instead of just thoughts in your head.",
          "score": 1,
          "created_utc": "2026-01-28 05:06:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2609c2",
          "author": "kubrador",
          "text": "everyone feels this way and literally nobody has figured it out beforehand. you either start and learn or stay comfortable wondering. the confidence thing is real though, it comes from doing the thing, not before, so if you're waiting to feel ready you're just procrastinating with extra steps.",
          "score": 1,
          "created_utc": "2026-01-28 05:53:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26azjz",
          "author": "Drumroll-PH",
          "text": "I felt the same before starting. Confidence didn’t come first, it showed up after small wins and surviving mistakes. Doubt is normal, action is what clarifies if this path is really yours.",
          "score": 1,
          "created_utc": "2026-01-28 07:19:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26df1r",
          "author": "sfreville",
          "text": "I feel the same way sometimes, to counteract it, i have joined communities with pairs, and it helps, you can share your experience and grow together. It's really helpful to avoid staying stuck on your side",
          "score": 1,
          "created_utc": "2026-01-28 07:40:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26hmpk",
          "author": "Glittering-Ad-8609",
          "text": "The confidence doesn't come first. It comes after you survive a few things you didn't think you could handle.\n\n\n\nI waited way too long to start because I thought I needed to feel ready. Turns out \"ready\" isn't a feeling, it's just a story you tell yourself after you already did the thing.\n\n\n\nStart smaller than you think you need to. The doubt doesn't go away but it gets quieter once you have evidence that you can figure stuff out.",
          "score": 1,
          "created_utc": "2026-01-28 08:17:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27a03e",
          "author": "ElectronicReview9525",
          "text": "Hot take: confidence doesn’t come before starting, it’s a byproduct of surviving small wins and screwups. If you wait to feel “ready,” you’ll just keep waiting.\n\nThe doubt isn’t a red flag, it’s feedback. It means you care and you’re actually thinking about consequences. The real risk is not testing yourself at all. Start stupid small, something you can’t fail catastrophically at. If you freeze, you learn. If you mess up, you adapt. That’s the job.\n\nAlso, you don’t need a partner or a safety net to begin, you need constraints. Timebox it. Budget cap it. Give yourself a 90-day experiment. If you still feel paralyzed after doing real work, then reassess. But don’t confuse fear with lack of capability.",
          "score": 1,
          "created_utc": "2026-01-28 12:19:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2995tc",
          "author": "Nightshade_Chronicle",
          "text": "You gain confidence through the experience. You have to actually start, and along the way as you are learning, your confidence will grow. You will question things, which is actually a good thing, within reason. Question things so you can improve and always keep learning, but don't question things to the point you completely stagnate. And having a partner would give you a safety net in some areas, but cause more frictions and hurdles to jump in others. So one way or the other isn't better, they are both different. You need to decide what things are the most important to you, what you really want from a business and the control level in running it and making decisions, then pick what is the best option for you.",
          "score": 1,
          "created_utc": "2026-01-28 18:04:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e59i3",
          "author": "nico101523",
          "text": "Just start. The rest is just excuses. You'll solve any problems that come up thanks to the pressure... Trust me.",
          "score": 1,
          "created_utc": "2026-01-29 11:25:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fbek5",
          "author": "RevolutionaryLie2168",
          "text": "Let me save you time:\n\nThis isn’t a get-rich-quick thing.\n\nIt’s not “AI automation.”\n\nIt’s not a course.\n\nIt’s closer to buying a tiny online business that already runs and then deciding what to do with it.\n\nMost people won’t like it because it’s not exciting.\n\nBut a few people specifically want *unexciting*.\n\nThose are the only people I even bother explaining it to.\n\nHonest question: Would you rather\n\nA) Spend months learning + testing an idea  \nB) Start with something already built and improve it\n\nGenuinely curious how people here think about this.\n\n(No selling — just interested in the answers.)\n\nThen you reply",
          "score": 1,
          "created_utc": "2026-01-29 15:27:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xuayj",
          "author": "Tricky_Trifle_994",
          "text": "motivation is what gets you started\n\ndiscipline is what keeps you going\n\nand self-doubt is a feature, not bug of this journey.\n\nhaving doubts, lacking confidence, learning to trust yourself to make the right calls, handling set backs - these are things that you can only really know and learn from experience. and the only way to get that experience, is to just do it.\n\nif you choose to work on your own thing, this is going to be a norm:  \n1. wake up some days feeling confident and motivated  \n2. wake up on other days feeling down and in the rut. \n\nit's going to be a rollercoaster that you can't escape, so the best thing you can do is to learn to embrace and enjoy the ride.\n\nconfidence comes with time and wins. as you get through more things, as you make more wins (big or small), you build your trust in yourself to make right calls, you build your confidence. think of it like jenga. each win, each time you celebrate or achieve something that just make you go \"YES\" and throw your first in the air, is akin to stacking a new jenga piece. this taller structure is your confidnece.\n\nbut each time you hit a roadblock, or get an L, you remove 1 piece. it hurts your confidence. you'll likely feel lously and low for the next 1-2 days, but just get over it, and get your next W and continue stacking your confidence and momentum.\n\nthe only advise i have is to \"just do it\" as nike says. \n\nyou'll figure things out along the way. if you wait until you feel you're ready, you'll never start. AKA you won't ever feel full ready. ever.",
          "score": 1,
          "created_utc": "2026-02-01 08:34:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpifhy",
      "title": "$700 Beauty Blog → $1.8B Brand",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qpifhy/700_beauty_blog_18b_brand/",
      "author": "4PFmel",
      "created_utc": "2026-01-28 17:49:00",
      "score": 11,
      "num_comments": 9,
      "upvote_ratio": 0.69,
      "text": "I spend about an hour every day reading the marketing strategies of successful companies, and yesterday, I bounced on one that I fell in love with.  \nIf you've ever heard about the beauty brand \"Glossier,\" that's who I'm talking about.\n\nBack in 2010, Emily Weiss (the founder) started a beauty blog called **Into the Gloss**(it still runs to this day), and the idea was simple: interview women about the beauty products they actually use.\n\nWithin two years, the blog hit 200,000 monthly readers. By 2016, it was pulling 10 million page views a month.  \nAnd by starting this blog, she \"accidentally\" built a focus group.\n\nReaders were constantly asking where to find the products from her interviews, but Emily noticed she didn't like most of the brands herself. So she decided to build one she would.\n\nIn 2014, Glossier launched with just four products. That's it. No giant catalog. Her readers asked for a better face wash.  \nGlossier turned those comments into Milky Jelly Cleanser, which is now a bestseller.  \nInstead of celebrities, she went all-in on UGC. Customers would post photos, and Glossier would repost them. They picked real customers with small but loyal followings, which resulted in 70% of online sales coming from referrals.\n\nThey grew so fast, but their profit didn't. So they partnered with Sephora and sold their products in Sephora stores. It got them lower margins and a bigger reach. By 2018, four years later, Glossier hit $400 million. By 2021, $1.8 billion.\n\nI didn’t expect a simple blog to turn into a billion-dollar brand, but here we are lol\n\nEDIT: People are dming me about a \"link\" to these case studies.  \nIm not sure i can post a link here but its marketingcrafted(dot)come",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qpifhy/700_beauty_blog_18b_brand/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o2e8dp4",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-29 11:49:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ea9qo",
              "author": "4PFmel",
              "text": "YEP...the case studies can be found on marketingcrafted(dot)com\n\nnot sure i can post a link here",
              "score": 1,
              "created_utc": "2026-01-29 12:02:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kfwpx",
          "author": "Hot-Clothes7316",
          "text": "it was a good old blogging days.  \nback then, in asia there was also a startup Luxola.\n\n\"Luxola was launched in Singapore in 2011 and has quickly grown into the destination for beauty in Southeast Asia; carrying over 4000 products...\"\n\ncontext. Sephora back then was just a physical store. no online shop presence.  \nand Luxola started off not just an e-commerce store but with a focus on their \"blog\" and reviews too.\n\nafter 4 years, Luxola was then bought over by LVMH for 8 figure deal. and then became the now e-Sephora.",
          "score": 1,
          "created_utc": "2026-01-30 08:05:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o297wgz",
          "author": "Grandma_cheese",
          "text": "where are you reading these marketing strategies from? Any website in particular?",
          "score": 0,
          "created_utc": "2026-01-28 17:59:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29a193",
              "author": "4PFmel",
              "text": "https://preview.redd.it/e1lr6dmrr4gg1.png?width=2780&format=png&auto=webp&s=23c734e28d48edcf19cdcad3c80c85fcdeb532b7\n\nyep  \nthis is it (marketing crafted)  \nThey specifically post marketing strategies of successful companies.",
              "score": 4,
              "created_utc": "2026-01-28 18:08:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2d5cvg",
                  "author": "maxlegendedm",
                  "text": "Link ?",
                  "score": 1,
                  "created_utc": "2026-01-29 06:08:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2cp93z",
          "author": "that-dude_mike",
          "text": "Thanks for sharing!",
          "score": 0,
          "created_utc": "2026-01-29 04:14:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qopdc6",
      "title": "Getting verbal buy-in but struggling to move from proposal to signed agreement",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qopdc6/getting_verbal_buyin_but_struggling_to_move_from/",
      "author": "DrainPipeDisposal",
      "created_utc": "2026-01-27 20:21:57",
      "score": 11,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I’ve been looking at tools like Trumpet to improve how I handle proposals and follow-up, because I keep running into the same issue. Calls go well, scope and pricing are aligned, and once the proposal is shared, everything slows down.\n\nI’ve got one deal sitting with a proposal from before the holidays and another where I’ve been told to reconnect after the new year. There’s interest, but no clear movement toward a signed agreement or payment.\n\nIt feels like the gap isn’t selling, but guiding the buyer from agreement to action. I’m testing keeping proposals, timelines, and next steps in one place so buyers don’t lose context.\n\nWhat’s helped you move deals from proposal to contract without being pushy?\n\n",
      "is_original_content": false,
      "link_flair_text": "Resources & Tools",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qopdc6/getting_verbal_buyin_but_struggling_to_move_from/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qt8dfl",
      "title": "The reason most MVPs never ship isn't the idea. It's the scope.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qt8dfl/the_reason_most_mvps_never_ship_isnt_the_idea_its/",
      "author": "sakerbd",
      "created_utc": "2026-02-01 19:38:30",
      "score": 10,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "I've been working with early stage founders for a while now and there's a pattern I kept seeing over and over. They'd come in with a solid idea, spend months building, and then just... stall. Not because the tech was hard. Because they kept adding things.\n\nFeature after feature, \"oh we also need this,\" and suddenly what was supposed to be a simple product turned into a massive project with no clear finish line.\n\nSo at some point I started forcing a framework on every project I touched. I call it the 3-3-5 rule and honestly it's pretty simple once you see it.\n\nThe idea is you cap everything. No exceptions.\n\n3 database entities. That's your max. Like Users, Listings, and Bookings or whatever makes sense for your product. You want to add a fourth? Cool, that's a V2 conversation.\n\n3 external APIs. Stripe, an email service, maybe an AI API. Pick three. Every single integration you add is another thing that can slow you down or break.\n\n5 core user flows. Just map out the actual path a user takes. Something like sign up, create a listing, browse, book, pay. That's it. If something doesn't fit into one of those five flows, it's not going in.\n\nWe've been shipping MVPs inside this box in about 30 days using Supabase and React. The budget usually lands around $4k. And the reason it works isn't because we're doing anything crazy technically. It's just that the constraints force you to actually decide what matters before you start coding.\n\nAnyway, curious if anyone else has run into this. The hardest part honestly is just getting founders to agree to cut stuff. Happy to talk through how we actually figure out which flows make the cut if anyone's interested.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qt8dfl/the_reason_most_mvps_never_ship_isnt_the_idea_its/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o32sph1",
          "author": "kubrador",
          "text": "the 3-3-5 rule is just \"scope creep bad\" with a spreadsheet attached but yeah most founders need someone to physically stop them from building a crm inside their crm",
          "score": 2,
          "created_utc": "2026-02-02 01:26:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34g7nn",
              "author": "sakerbd",
              "text": "Haha yeah that's basically it. Most founders know what they should cut, they just need someone else to actually enforce it. The 3-3-5 box is just the external forcing function that makes the hard decisions happen.",
              "score": 1,
              "created_utc": "2026-02-02 08:23:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o31g9t6",
          "author": "krishna404",
          "text": "Super interesting framework 👌",
          "score": 1,
          "created_utc": "2026-02-01 21:09:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31go1j",
              "author": "sakerbd",
              "text": "Indeed.",
              "score": 2,
              "created_utc": "2026-02-01 21:11:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o340saw",
          "author": "Charming-Chair9116",
          "text": "Really spot on. When building MVP, we are unsure and rely on hypohtesis, so we add couple of extra features/flows/etc to be tested. But, the focus is lost and users are lost, and we’ll receive mixed and unfocused feedback. Then there is no other option than cut features off and rebuild it.",
          "score": 1,
          "created_utc": "2026-02-02 06:05:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34g8n6",
              "author": "sakerbd",
              "text": "This is exactly the trap. You add features thinking you're testing different angles but really you're just adding noise. The focus gets lost and the feedback becomes useless because users don't even know what the product is supposed to do anymore.",
              "score": 1,
              "created_utc": "2026-02-02 08:23:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o340uz4",
          "author": "Embarrassed-Try-5617",
          "text": "This is good. I guess the problem starts when founders start building in vacuum and dont collaborate with users or have early design partners. THey think the more features we add, better it will be, but it backfires.",
          "score": 1,
          "created_utc": "2026-02-02 06:05:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34g9kk",
              "author": "sakerbd",
              "text": "Yeah the vacuum building thing is real. The 3-3-5 rule doesn't solve that but it does force you to at least define what you're testing before you build it. If you're building with no user input the constraints at least keep the scope small enough that pivoting doesn't cost you months.",
              "score": 1,
              "created_utc": "2026-02-02 08:23:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1quj573",
      "title": "Am I micromanaging my co-founder or just being realistic?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1quj573/am_i_micromanaging_my_cofounder_or_just_being/",
      "author": "YogurtIll4336",
      "created_utc": "2026-02-03 05:12:26",
      "score": 9,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "Building a D2C startup with a friend and I’m stuck. If I don’t push timelines and follow up, things stall, so I end up micromanaging. At the same time, he does add value: good with socials, put in some money, helped with influencer partnerships. I can’t tell if I should:\n\n– give him more space and time to grow\n\n– or accept that this might not work long-term\n\nDon’t want to hurt a friendship, but also don’t want to carry everything. What would you do?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1quj573/am_i_micromanaging_my_cofounder_or_just_being/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o3amite",
          "author": "TommyBonnomi",
          "text": "> If I don’t push timelines and follow up, things stall, so I end up micromanaging.\n\nIt's hard to know what you're \"pushing\" entails, but if you're simply setting timelines and they're not being met, following up on them isn't micromanaging.\n\nCommunicate your plan, set timelines for milestones, make sure they confirm it's attainable, and let them cook.  If they aren't meeting milestones, then have a conversation to understand why and adjust accordingly.  If they continue to fall short, then you need to have a tougher conversation.\n\nMicromanaging would be overseeing exactly how they're completing tasks within a milestone.  You need to either trust their expertise or document your expectations.\n\nYou're partners now, not friends.  Step up and lead.",
          "score": 4,
          "created_utc": "2026-02-03 05:36:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c6576",
          "author": "hrishi_comet",
          "text": "The rule is simple here: I have worked closely in a situation where my father was the CTO and I the CEO, and another situation with a close friend on the Tech Front. The rule is simple: have deadlines for each task. Make a simple excel, or use trello or asana \\[any kanban tool\\] and track each other there. The goal is not micromanaging. You know there is a deadline for something - just wait till the time's up. 3 strikes and there is a discussion. This gives you the upper hand since you've waited for a deadline that was mutually agreed. This is a common situation in partners who are friends. We let our friendship thoughts come into the picture. You should treat the work as the ultimate thing since it's for a company you guys are building. \n\nPlan micro tasks with deadlines\n\nSee how thigns are flowing \n\nIf the person is not accounable for tasks agreed - its time to say bye bye, or invite frustration as the company starts growing.",
          "score": 1,
          "created_utc": "2026-02-03 13:25:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cd6r8",
          "author": "Vaibhav_codes",
          "text": "You’re not micromanaging you’re filling a gap. If things only move when you push, that’s misaligned ownership, not control.",
          "score": 1,
          "created_utc": "2026-02-03 14:05:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ckkep",
          "author": "One-Original-9664",
          "text": "give him time and space, if still doesnt work then take a call, but once you let him go, you can't undo",
          "score": 1,
          "created_utc": "2026-02-03 14:44:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cqetg",
          "author": "Willing-Training1020",
          "text": "Honestly this is one of the hardest parts of building with a friend. I'd try defining clear ownership areas first, like he fully owns socials and influencer stuff, you own product and ops. Then judge based on outcomes in his lane rather than how he works. If he delivers when he owns it, you're micromanaging. If things still stall even with full ownership, that's a different conversation. Better to figure that out now than a year in.",
          "score": 1,
          "created_utc": "2026-02-03 15:13:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3d15a3",
          "author": "Your-Startup-Advisor",
          "text": "So, co-founders are partners. If only one side of the partnership, if only one of the co-founders is pushing timelines and doing the follow-ups and staying on top of things, then the other person is not really a co-founder and they are just behaving as an employee, waiting for instructions, waiting for pressure, right?\n\nIn a real co-founder partnership everyone is on top of things. Everyone is pushing for timelines, is setting deadlines, is following up. Is on top of everything that needs to be done and is moving as fast as they can. Everyone, not just one member.",
          "score": 1,
          "created_utc": "2026-02-03 16:05:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrbtgy",
      "title": "I want to be entrepreneur please help but...",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qrbtgy/i_want_to_be_entrepreneur_please_help_but/",
      "author": "pankaj662",
      "created_utc": "2026-01-30 17:24:59",
      "score": 8,
      "num_comments": 18,
      "upvote_ratio": 0.84,
      "text": "I want to be a entrepreneur. But I have no money at all. I wanted to be a indie hacker but that needs money. So i thought i should start frelancing but platforms are all mess . Please help me what should I do to make fast cash to invest in indie hacking ",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qrbtgy/i_want_to_be_entrepreneur_please_help_but/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o2ohfo6",
          "author": "luke-build-at50",
          "text": "you don’t need money, you need leverage.\n\nDon’t start with indie hacking or platforms. Start by selling one small, boring skill people will pay for fast. Fix bugs, set up Stripe, build landing pages, automate something simple. Sell outcomes, not hours.\n\nDM small businesses or indie founders with a concrete offer. Get paid. Repeat.\n\nOnce you’ve solved the same problem a few times, *then* you build a product. Indie hacking comes from paid pain, not ideas.",
          "score": 7,
          "created_utc": "2026-01-30 21:32:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t86u2",
              "author": "DramaticAd5956",
              "text": "It’s negotiating skills as he has no leverage.\n\nHe can’t call the card processing to be interchange + 20 basis points or pull your business from someone when you’re not even a 7 figure gain.\n\nYou can still reach agreement’s and rarely is it your capital / liquidity demand",
              "score": 1,
              "created_utc": "2026-01-31 16:26:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2n2c8p",
          "author": "Educational-Lab9874",
          "text": "Something very common among entrepreneurs (or maybe it's just me) is that we overthink things before acting. Generally, people who have fewer skills than us make money faster because they don't tend to think so much; they just act... even if they don't fully understand the whole picture and even if that may seem reckless. In reality, it helps them test things faster and more cheaply. Recommendation: find a “pain point” in a particular industry or community and simply try to solve it. It doesn't have to be beautiful, detailed, or scalable. You just need a rudimentary way to solve the problem and publish it. That way, you test the product and find out what your audience thinks.  \nThen you decide whether it is worth dedicating time and effort to making it grow.",
          "score": 3,
          "created_utc": "2026-01-30 17:40:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2shagw",
              "author": "One_Caterpillar3396",
              "text": "Agree 1000% \nYou can’t know what to do when you aren’t doing anything, you need to do something, even if it’s the wrong thing.\nOnly this way you can figure out the path for you.",
              "score": 1,
              "created_utc": "2026-01-31 14:07:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2t8h0l",
              "author": "DramaticAd5956",
              "text": "The entire goal is execution :)",
              "score": 1,
              "created_utc": "2026-01-31 16:27:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2n1a8e",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-30 17:35:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2n3stu",
              "author": "pankaj662",
              "text": "Please explain",
              "score": 1,
              "created_utc": "2026-01-30 17:46:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2p5v4d",
          "author": "Pitiful_Deal1413",
          "text": "Go ship anything that you can! Try to learn and be consistent",
          "score": 1,
          "created_utc": "2026-01-30 23:37:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pd0as",
          "author": "kubrador",
          "text": "you could start with freelancing on those \"mess\" platforms since you literally have no other options, or you could just accept that fast cash and indie hacking don't really go together and pick one",
          "score": 1,
          "created_utc": "2026-01-31 00:16:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pd7zs",
          "author": "DramaticAd5956",
          "text": "Have you not heard of bootstrapping?\nI sold my stuff to help fund.\n\nI negotiated a factory to build thousands of the item.\n\n\nYou can do this with grace and the ability to be disciplined",
          "score": 1,
          "created_utc": "2026-01-31 00:17:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2q3e4w",
          "author": "psyduckpikachu",
          "text": "having money is great but not having money makes you resourceful. A big part of being an entrepreneur is to problem solve. If you have no money, how would you achieve what you want to achieve?",
          "score": 1,
          "created_utc": "2026-01-31 02:49:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qynqi",
          "author": "Cute-Needleworker115",
          "text": "Let me be very clear. You don’t need money to start. You need income first.\n\nIndie hacking is not the first step. Freelancing is. Not on messy platforms, but by directly helping people.\n\nDo this Buddy:  \nPick one skill you already have. Just one. Web fixes, JavaScript bugs, landing pages, speed issues.  \nSell a clear result, not “services”. Say “I’ll fix your website speed in 2 days” instead of “I’m a developer”.  \nFind clients on LinkedIn, Twitter, Reddit, and Discord. Talk to real people. Platforms are optional.  \nCharge for small tasks. Get paid fast. $50k to $250k per job is enough to start.\n\nUse freelancing only to generate cash. Don’t get stuck there.  \nTake that money and invest it in your indie projects.\n\nFirst earn. Then build....... Have a great journey ahead",
          "score": 1,
          "created_utc": "2026-01-31 06:28:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sai9w",
          "author": "Plastic_Ad_3273",
          "text": "Take action, whatever it is. Look into different fields and niches. There’s no such thing as fast money, you have to pick something and execute. Don’t get stuck overthinking ideas, just start. Could start with affiliate marketing for example.",
          "score": 1,
          "created_utc": "2026-01-31 13:26:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sc280",
          "author": "dragonflyinvest",
          "text": "Why don’t you fed a job?",
          "score": 1,
          "created_utc": "2026-01-31 13:36:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2szh5a",
          "author": "Popular-Button7387",
          "text": "As far as I'm concerned the only things that could really help are either an audience or a skill. \nBuilding an audience is free (but actually pretty slow) and it allows you to make good money in the long-term. In the short-term, try to monetize a skill you already have in your skillset (something you're really good at). \nHope you'll do well!",
          "score": 1,
          "created_utc": "2026-01-31 15:44:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ndonj",
          "author": "swimdownstream",
          "text": "Develop a useful skill that won't be replaced by AI agents in the near future. \n\nIdk where to even tell you to start but hacking or software or coding of any type will be outpaced by AI agents within a year.",
          "score": 0,
          "created_utc": "2026-01-30 18:29:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}