{
  "metadata": {
    "last_updated": "2026-01-22 16:59:57",
    "time_filter": "week",
    "subreddit": "EntrepreneurRideAlong",
    "total_items": 20,
    "total_comments": 195,
    "file_size_bytes": 198160
  },
  "items": [
    {
      "id": "1qha3pc",
      "title": "Faceseek helps brands get noticed without loud ads",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qha3pc/faceseek_helps_brands_get_noticed_without_loud_ads/",
      "author": "AccountEngineer",
      "created_utc": "2026-01-19 17:12:00",
      "score": 53,
      "num_comments": 2,
      "upvote_ratio": 0.81,
      "text": "Finding attention online is hard when everyone is shouting. \n\nFaceseek feels different because it focuses on discovery instead of forcing ads everywhere.\n\nI tried it while testing a small project and noticed more genuine interest compared to normal promo posts. The setup is simple and doesn’t waste time. It’s useful for founders who want visibility but still want things to feel natural. \n\nFaceseek works well if you prefer slow, real growth instead of fake hype.",
      "is_original_content": false,
      "link_flair_text": "Resources & Tools",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qha3pc/faceseek_helps_brands_get_noticed_without_loud_ads/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0kd3lx",
          "author": "aVarangian",
          "text": "This is literally written like an ad. And is AI-written slop. 50 upvotes but 0 comments. Eff off.",
          "score": 3,
          "created_utc": "2026-01-19 23:01:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m2tt4",
          "author": "Rustyshackilford",
          "text": "Tell us, what is it? How does it work?",
          "score": 1,
          "created_utc": "2026-01-20 04:44:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhu4ud",
      "title": "Here's my insight on how to validate your startup idea!",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qhu4ud/heres_my_insight_on_how_to_validate_your_startup/",
      "author": "Ok_Pollution3165",
      "created_utc": "2026-01-20 06:59:31",
      "score": 40,
      "num_comments": 7,
      "upvote_ratio": 0.94,
      "text": "Had 3 ideas sitting in my notes for months. Kept going back and forth on which one to actually build.\n\nInstead of just picking one and hoping, I ran Google Ads for 2 weeks to see which one people actually wanted.\n\n* AI quote generator for roofing companies\n* Job scheduling tool for HVAC contractors\n* Customer follow-up system for plumbers\n\nThrew together a basic landing page for each using Lovable. Just a headline, a few bullets, and an email signup. No actual product. Used Tally for forms, Ryze AI to handle the ad setup, and Microsoft Clarity to watch where people clicked and bounced.\n\nResults:\n\n* Roofing: 31 signups (3.1% conversion)\n* HVAC: 9 signups (1.1% conversion)\n* Plumbing: 14 signups (1.6% conversion)\n\nRoofing won by a lot. Did not see that coming.\n\nWhat I learned:\n\nThe \"AI\" angle bombed. Keywords like \"AI estimating software\" and \"automated quoting tool\" got almost zero clicks. But \"roofing estimate software\" and \"how to price roofing jobs\" actually brought people in. Turns out people search for solutions they already know exist.\n\nCopy matters more than I thought. First landing page was all about automation and AI features. Converted at like 0.3%. Rewrote it to \"stop leaving money on the table with bad estimates\" and it jumped to 1.4%. Nobody cares how it works.\n\nHVAC might just be a smaller market. Or maybe my targeting was off. Hard to know for sure.\n\nSignups aren't customers. Started doing calls this week. 4 done so far. Every single roofer mentioned the same thing - they hate doing estimates on-site because it takes forever and half the time they lowball themselves. Would've never known that without actually talking to them.\n\nWe almost went with HVAC because my cofounder knew someone in that space. Really glad we tested first.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qhu4ud/heres_my_insight_on_how_to_validate_your_startup/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0nbim8",
          "author": "Temporary-Vacation26",
          "text": "This is the kind of post I needed to read. I spent months building before testing anything and now I'm in the \"hope people want this\" phase.\n\nThe insight about AI keywords bombing is interesting. People search for what they already understand, not the technology behind it. Makes sense but easy to forget when you're the one building.\n\nTwo questions if you don't mind:\n\n1. How much did you spend total on the Google Ads test across all three?\n\n2. Those 4 calls you did - how did you get them to actually show up? Cold email to the signups?\n\nGood luck with the roofing tool. Sounds like you found a real pain point.",
          "score": 3,
          "created_utc": "2026-01-20 11:05:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pvnel",
          "author": "AdBusy7153",
          "text": "This is fantastic validation work. The lesson on language is key, they dont buy AI, they buy a solution to a specific, painful job",
          "score": 3,
          "created_utc": "2026-01-20 19:13:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p41g3",
          "author": "Longjumping-Check-76",
          "text": "Roofing estimates can be a total time sink. Tools like roofing estimate software can help streamline the process, letting you quickly generate professional proposals and avoid manual calculations. ThreadCatch might be worth checking out to see how some contractors are automating their workflow and reducing back-and-forth time.",
          "score": 2,
          "created_utc": "2026-01-20 17:08:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0w3hrk",
          "author": "siiftai",
          "text": "great insights! it's super important to take that extra time to validate like you did instead of just guessing. i also found that talking to potential customers gives you info you wouldn't get otherwise, but its hard to get enough data and even analyze it in a way that is objective. We often here what we want to hear... for organizing, validating and refining ideas based on more objective feedback, i use siift, helps a lot with figuring out the next steps like a stratetgy sounding board. Hope that helps!",
          "score": 1,
          "created_utc": "2026-01-21 17:36:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0myaww",
          "author": "AnonJian",
          "text": "Your post has the obvious assumption the people screwing themselves over with phony validation have any money to advertise. Just about every snafu out there can be traced back to the wantrepreneur myth you don't need *any money* to start. Zero. Zip. *Nada*.\n\n>The \"AI\" angle bombed. Keywords like \"AI estimating software\" and \"automated quoting tool\" got almost zero clicks.\n\nWhat I learned is we seem to be nearing the *trough of disillusionment* on Gartner's Hype Cycle chart.\n\n>Copy matters more than I thought.\n\nSo when people wrote a million times building wasn't the hard part, marketing and sales was the hard part ...That Was True? I am shocked. SHOCKED. If you can't write copy, then writing code is wasted effort? Mind ... Blown.\n\n>Nobody cares how it works.\n\nYou just sent forty thousand Build In Public stakeholders to depression clinics. I hope you're happy. We can save the questionable value of signups for further discussion.",
          "score": -1,
          "created_utc": "2026-01-20 09:03:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfkjip",
      "title": "I studied 47 SaaS products that went from $0 to $10k MRR last year. Here's what they all did right.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qfkjip/i_studied_47_saas_products_that_went_from_0_to/",
      "author": "whyismail",
      "created_utc": "2026-01-17 18:17:45",
      "score": 31,
      "num_comments": 9,
      "upvote_ratio": 0.9,
      "text": "Hey, I went into SaaS last year with my tool Brandled (helps founders grow on X & LinkedIn) in a pretty competitive space with $0 and 0 audience and ended up wasting six months straight on the wrong things.\n\nSpent half a year stuck at $0 MRR.\n\nThen I became obsessed with one question: what separates SaaS products that make it from those that die at zero.\n\nSo I went down a rabbit hole. Studied 47 founders who went from $0 to $10k+ MRR in the last year. Watched their podcasts, red their tweets, and everything i could get my hands on.\n\nHere's what I learned from all of them, and what I was doing catastrophically wrong.\n\n**1. Frictionless signup isn't optional**\n\nEvery successful product had one-click social login. Google OAuth mostly.\n\nThe ones that died had email verification flows, password requirements, multi-step forms asking questions before showing any value.\n\nThe math is brutal. If you lose 30% of people at signup and you're getting 1000 visitors a month, that's 300 potential customers gone. At a 10% trial-to-paid conversion, that's 30 paying customers per month lost to signup friction alone.\n\nI started with magic link only. Completion rate was 45%. Added Google login. Jumped to 78% the next day.\n\nEvery percentage point of friction at signup costs you real revenue. Most founders don't even measure this.\n\n**2. They launched in weeks, not months**\n\nNone of them spent 6 months building in secret.\n\nAverage time from idea to first paying customer: 3-6 weeks. They launched with ONE core feature. Then spent most of their time marketing it.\n\nI did the opposite. Spent 3 months building features before launching. Content generation, analytics, scheduling, competitor tracking, everything. Got 12 signups. Zero paying customers.\n\nConvinced myself the product wasn't good enough. Spent another month adding features. Still nothing.\n\nThe problem wasn't my product. Nobody knew it existed.\n\nAfter I stopped building and started marketing, posting on Reddit, doing LinkedIn outreach, documenting on X, I hit $126 MRR in 4 days.\n\nSame product. Different approach.\n\nPost-launch is 90% marketing, 10% product.\n\n**3. They were shameless about promotion**\n\nThe successful ones talked about their product everywhere. Not spammy. Just never hiding it.\n\nReddit threads. Twitter replies. Forum comments. Anywhere their audience hung out.\n\nThey'd give genuinely helpful advice first, then naturally mention their tool when relevant.\n\nStarted being shameless. Every relevant conversation where someone complained about the problem I solved, I'd help them first, then mention I built something for this.\n\nA few people definitely get mad but I feel the upside is worth it.\n\nYour product won't discover itself.\n\n**4. They asked churned users what went wrong**\n\nEvery successful product had a system for this. Automated email going out when someone cancels asking what didn't work.\n\nI was doing none of this. Saw cancellations in Stripe, felt rejected, moved on. Never asked why. Never learned anything.\n\nNow every cancelled user gets emails through and automated email sequence and the replies are done by me personally.\n\nResponse rate is 40%. The feedback is literally gold.\n\nEvery single one is fixable. But I only learned because I asked.\n\nChurned users tell you the real truth about your product.\n\n**5. They used their own product religiously**\n\nNot one successful founder was building something they didn't use daily. They were their own heaviest users.\n\nI wasn't doing this. Used my tool occasionally to \"test\" but wasn't relying on it daily.\n\nForced myself to create all my content through my own product for a week. Found 7 bugs in 30 minutes that never showed up in testing.\n\nGenerate button didn't work on mobile. Analytics took 8 seconds to load. Onboarding skipped steps if you refreshed.\n\nMy users were experiencing this and not telling me. They were just leaving.\n\nIf you're not using your product daily as a real user, you're building blind.\n\n**6. They fixed retention before scaling acquisition**\n\nBiggest strategic difference.\n\nFailed products: 30-50% monthly churn, constantly chasing new users to replace ones leaving.\n\nSuccessful products: Fixed retention first, got churn to 10-20%, then scaled acquisition.\n\nThe math: At 40% churn, you acquire 40 customers to net 24. At 15% churn, you acquire 40 and net 34. Same effort, 42% better results.\n\nI was obsessed with new signups. Ignored my 40% churn rate. Got 10 new customers, lost 4. Net: 6.\n\nStopped all acquisition. Fixed onboarding from 8 steps to 3. Added email sequences. Built features retained users asked for. Churn dropped to 15%.\n\nSame acquisition effort, now net 8-9 customers instead of 6.\n\nRetention is the foundation. Acquisition is the multiplier.\n\n**7. They shipped MVPs with one feature**\n\nEvery successful product launched stupidly lean. One core feature done exceptionally well.\n\nI launched with 7 features: content generation, analytics, scheduling, competitor tracking, SWOT, comments, hashtags.\n\nCodebase was a nightmare. Users were confused. I was maintaining features 3% of users touched.\n\nShould've launched with one thing: AI content that sounds human. Made that 10x better. Everything else later based on what paying customers asked for.\n\nYour MVP should make people say \"this solves my exact problem\" even if ugly and missing features.\n\nNot \"wow, so many features\" while solving nothing particularly well.\n\n**8. They priced based on value, not competition**\n\nNone of them raced to the bottom on pricing.\n\nThey looked at the value delivered. Hours saved. Revenue generated. Pain eliminated.\n\nThen priced a fraction of that value.\n\nI priced at $19/month because competitors were at $29-39. Thought I'd win on price. Just looked cheap and inferior.\n\nNeeded 263 customers to hit $5k MRR at $19 versus only 128 at $39.\n\nRaised price to $29-39. Conversions didn't drop. They improved slightly.\n\nHigher price signaled solving a valuable problem.\n\nPeople who care about $10 differences aren't your best customers. They'll churn for anything $3 cheaper.\n\n**9. They automated relationship building**\n\nEvery successful product had email sequences from day one. Not promotional. Actual value and engagement.\n\nWelcome emails. Feature education. Check-ins. Re-engagement for quiet users. Win-back for churned users.\n\nI was sending nothing after signup. Users signed up, got busy, forgot, churned.\n\nEngagement doesn't happen by accident. You engineer it.\n\n**10. They validated with money, not words**\n\nThe problem with feedback: it's free. People say nice things because it costs them nothing.\n\nI built features based on \"that would be helpful\" comments from users who weren't even paying. Wasted weeks on features nobody used.\n\nNow I only build what paying customers explicitly request.\n\nMoney is the only validation that matters. Words are cheap. Credit card numbers are truth.\n\n**The one thing they all had**\n\nThey didn't quit when it felt hopeless.\n\nThey all hit $0 for months. Got depressed. Questioned everything. Wanted to shut it down.\n\nBut didn't.\n\nThe difference between $0 and success wasn't talent or luck. It was not quitting before they figured out what works.\n\n90% of SaaS products die not because they couldn't work. Because the founder quit too early.\n\nIf you're stuck at $0, study the people who've made it. Not the outliers. The normal founders who went from $0 to $10k.\n\nThey're not special. They just did specific things that compound and didn't quit when it got hard.\n\nThe playbook is right there. You just have to execute it.\n\nHappy to answer questions or go deeper on any of this.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qfkjip/i_studied_47_saas_products_that_went_from_0_to/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0a5d34",
          "author": "GnirobSW",
          "text": "7. Can you give some examples of the one feature SaaS that were successful?",
          "score": 1,
          "created_utc": "2026-01-18 12:39:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fkv4e",
              "author": "Local-Employ9800",
              "text": "The one-feature hits I’ve seen: Fathom (simple privacy analytics), Tally (dead-easy forms), Bannerbear (auto image/video generation), and Cron back in the day (calendar). I use Fathom and Tally, and Pulse alongside Ahrefs and SparkToro just for Reddit discovery and copy ideas.",
              "score": 2,
              "created_utc": "2026-01-19 06:11:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0cyc8c",
          "author": "viclnnk",
          "text": "Also feedback gathering inside a product. Users are willing to share, but it’s difficult to find an email, write one, etc. Just a simple “Send feedback” and a pop-up after clicking.",
          "score": 1,
          "created_utc": "2026-01-18 21:16:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0i5nx3",
          "author": "Frequent-Tennis-6914",
          "text": "The retention point is the real game. I’d push it one step earlier though.\n\nSignup is not the goal. Activation is. Retention is the result.\n\nA lot of people have decent traffic but their activation is weak, so churn looks like the problem when onboarding is actually the problem.\n\nWhat change made the biggest difference for your churn drop? Shorter onboarding, better first result, or better reminders?",
          "score": 1,
          "created_utc": "2026-01-19 16:51:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mn3ek",
          "author": "MORPHOICES",
          "text": "I, too, have seen something that corroborates this painfully. \\~\n\nThe biggest thing I’d underline from your list is that most founders over-index on “building more” when the real leverage is “removing friction + talking to users”.\n\nSpecifically before. \n\nTwo things that I gleaned from my experience.\n\n1. Friction develops quicker than you may expect.\n\nPeople can stress really little details but don’t \\*feel\\* how brutal a small friction is until they see real users.\n\nEvery added click, delay, or decision quietly disqualifies people who would have paid.\n\n2. Users that quit are the best sources of feedback.\n\nActive users is a good host. Churned users are frank.\n\nWhen I overlooked churn feedback due to “not my ICP,” it came back to bite me every time.\n\nI'm also fully on board with retention. I've seen teams throw money at growth only to discover they were just leaking the bucket faster.\n\nDid you notice 47 products curious?\n\n\\* A common retention metric founders obsessed over early?\n\n\\* Was it the case that it was more qualitative than numeric?\n\nNice analysis. First-time founders should ensure reading this.",
          "score": 1,
          "created_utc": "2026-01-20 07:20:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10o1fh",
          "author": "Whaaat_AI",
          "text": "Thanks for sharing! The pricing point was especially interesting: \"conversion rate slightly increased with price increase\".   \nSo your take is that even starting off, you should be bold with your price calculating not from a users point (\"xxx $ won't hurt\") but more from \"with my tool they saved xx hours of work per week and this adds up to xx $\".   \nKind of this?",
          "score": 1,
          "created_utc": "2026-01-22 09:23:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05qnfr",
          "author": "AnonJian",
          "text": "Certainly sounds good, but you assume those who fail had a choice. Build It And They Will Come is a blind launch. And yeah, when you are trying to hit a user market-blind, you will be flinging features right and left in desperation.\n\nMinimalism doesn't mean crippleware, it means building from a definitive key insight about the target customer. You can't do that if you consider launch the perfect time to go looking for the user. People don't post asking where to find the first hundred users because they understand the user, quite the opposite.\n\nPeople are using features just like shotgun pellets are used by a poor marksman. Where the analogy breaks down is a marksman doesn't tightly and deliberately shut his eyes before pulling the trigger, shotgun or sniper rifle. \n\nThis happened to you because you flatly rejected the advice. This happens to everyone else because they turn their back on Lean Startup methodology and, yes, Minimum Viable Product. Post anything, everyday, nothing ever changes.",
          "score": 1,
          "created_utc": "2026-01-17 19:34:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08kefn",
          "author": "dafuqherby",
          "text": "Thank you so much for sharing! I took note of a lot of what you said. I am pretty sure that every topic you talked about will be worth paying attention to.\nMay I ask you where do you usually find content about those founders? I fell like following some of them for inspiration.",
          "score": 0,
          "created_utc": "2026-01-18 04:34:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09hxii",
          "author": "Training-Dinner1660",
          "text": "Muy buen análisis. El único matiz que añadiría es el **sesgo del superviviente**: muchos hicieron exactamente esto y aun así no llegaron (👆🏼 el primero)\n\nLo valioso aquí no es la checklist, sino normalizar lo largo y mentalmente duro que es quedarse en $0 durante meses antes de que algo empiece a moverse 😅",
          "score": 0,
          "created_utc": "2026-01-18 09:11:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgz6fx",
      "title": "4months. 5clients. £12k/mo.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qgz6fx/4months_5clients_12kmo/",
      "author": "wastededucation",
      "created_utc": "2026-01-19 08:57:37",
      "score": 29,
      "num_comments": 6,
      "upvote_ratio": 0.89,
      "text": "Sharing here the steps I went through from launching my service in September last year as i think theyre pretty repeatable to speed-run.\n\nThis is by no means a success story and i definitely don’t feel secure yet, but might help as a zero-to-something example.\n\nI left my job end of 2024 - ads/marketing consultant for the big blue professional network.\n\nNaked quit when i hit my savings goal. Just had enough of big corp and logging my farts in salesforce.\n\nDidn’t really have a plan other than to build some stuff solo, learn new tech, and eventually start selling something.\n\n\\- looked for the easiest route to cash based on my skills. In my case, “do b2b ads better”. That’s where my credentials/background were so just kept it simple.\n\n\\- looked for point of difference in service. Too difficult. Loads of ads agencies out there. \n\n\\- turned to looking for point of difference in distribution. On LinkedIn that’s personal video.\n\n\\- Started talking to the camera and posting opinions on ads/marketing. Summarised opinions into a micro-brand and imagery to supplement the videos.\n\n\\- - sidenote - - i had never turned the camera on myself before. Ever. And i hated it. Saw Shaan Puri talk about climbing Cringe Mountain. Posted about that and got some attention. Main point is noticing how hard it was, and realising that 0.001% of people are ever going to do this selfie video thing.\n\n\\- this was the lightbulb moment for a more scalable service than just consulting on ads.\n\n\\- researched current remote podcasting software. Found riverside and descript. Played around and got ‘ok’ on them in a few hours.\n\n\\- invited some ex colleagues to come and chat for half an hour in return for me creating them some non-cringe videos to use on their linkedin. Also posted to offer it out to my extended network.\n\n\\- got a few bites, including a couple of nice CEO intros from contacts who believed in the ‘founder video’ concept\n\n\\- interviewed that half a dozen people and created videos and linkedin ads for them, for free. Emphasis on free. I was simply looking for momentum and a chance to show something i could at this stage.\n\n\\- used those content packs as case studies to show what i was offering, whilst simultaneously building a brand and website to make it feel more legit\n\n\\- built a launch offer and packaged it up. Announced it on my linkedin. Limited spaces (5). \n\n\\- had 2 people directly say they wanted in, and then i reached out to anyone that engaged with my post to see if i could bring them in - closed 2 of those over video chat and voicenotes.\n\n\\- Interestingly, none of my free beta users converted into paying customers, but hopefully someday (i’m keeping then warm)\n\n\\- - sidenote - - i had simultaneously been adding people on linkedin that i thought were in my target demographic (leaders of business lines eg CMO, CRO etc). This gradually built my network and helped with the reach of my posts, not directly selling to them.\n\n\\- i had packaged it to be £1k/mo per person, on 3-month deals.\n\n\\- by the end of month 2 and now 4 paying clients at £1k/mo, i had a lot more work to shout about and it was so much easier to generate interest and meetings through my profile.\n\n\\- i called myself the 5th spot and dogfooded my own product to get me out there more. Worked pretty well.\n\n\\- this brought in a few more leads, including some ex colleagues that had moved on, and an old uni friend that was now leading a startup. They in turn made some intros\n\n\\- increased my pricing once the 3-month ‘launch’ packages expired to £1.5k p/mo\n\n\\- also offered layered, related services to have more things to sell beyond just content e.g. podcast facilitation&editing, social page management, ad campaign setup&run, corporate email newsletter, content strategy etc.\n\n\\- brings me to Jan with 5 clients totalling at £12k/mo over different packages (some like more video, some prefer carousels/articles), including one £4k full-service social management.\n\nnext steps\n\n  \\- bring in systems and freelancers to help me with the delivery bottleneck. Everything is produced by me currently so that needs to change to be able to grow. I’m avoiding any promotion as i cant take on more clients, which is painful.\n\n  \\- lock in more 6m+ contracts\n\n  \\- rebrand to something better than my microsoft paint (canva) logo to be more legit\n\n  \\- Reinvest into more personal content and ads to increase lead flow\n\n  \\- get much better at the pitch/close cycle (I’m not a salesman and want the product to sell itself)\n\nHonestly when I look back at the last few months it’s pure uncertainty, guesswork, trying to follow guru advice, really trying to learn what people want, and then how to deliver it.\n\nI’m not sure I have a single/simple takeaway here but hopefully these steps i’ve gone through help someone see that the progress does happen if you just think logically and put one foot in front of the other.\n\nOh, and get a whiteboard. And take a walk.\n\nTldr - try new stuff, do free projects, use as case studies, build a micro brand, promote it on your personals, hawk core/launch offer, upsell related services",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qgz6fx/4months_5clients_12kmo/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0i4r9m",
          "author": "Frequent-Tennis-6914",
          "text": "The most real line here is “I’m avoiding promotion because I can’t take more clients.”\nThat is the exact point where systems matter. Not big strategy, just a simple weekly process that tells you: what’s coming in, what’s going out, and what can be safely spent on help without creating a tight week.\nWhat part of delivery is eating the most time right now?",
          "score": 4,
          "created_utc": "2026-01-19 16:46:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l54x5",
          "author": "Extreme_Log5264",
          "text": "This is very inspirational for us trying to be our own entrepreneur. Thanks for being so honest.",
          "score": 2,
          "created_utc": "2026-01-20 01:33:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gae0u",
          "author": "nzmi",
          "text": "What's the name of your business brother, I am soon to start the same journey and would love more info on what worked and what didn't, and what you do differently if you had to do it all again.",
          "score": 1,
          "created_utc": "2026-01-19 10:00:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gkpco",
              "author": "wastededucation",
              "text": "Yeh course mate happy to chat. Add me On LinkedIn it’s in my profile",
              "score": 1,
              "created_utc": "2026-01-19 11:33:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qga9gm",
      "title": "What tools are genuinely helpful for your business?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/",
      "author": "OddInititi",
      "created_utc": "2026-01-18 14:40:47",
      "score": 28,
      "num_comments": 73,
      "upvote_ratio": 0.95,
      "text": "Would like to pick your brain on what actually worked. There are many hype out there so would like to hear the true stories - whether it's popular or not. Thank you\n\nFor context, here's what I'm already using frequently:\n\n\\- Google Sheets for tracking, CRM; Canva for marketing assets\n\n\\- ChatGPT for general topics (looking at Gemini now, hope it will have folders soon) ; Grammarly: just to fix my writing; Saner: to manage my tasks\n\n\\- Fireflies, Lovable, Manus, Lemlist: Not daily yet but I use these quite often on a weekly basis",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0aqtva",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 5,
          "created_utc": "2026-01-18 14:52:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0caawu",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0aqtva/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-18 19:16:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0b1ls0",
          "author": "Any_Spell_5716",
          "text": "This is a pretty comprehensive list. Recently though I’ve found myself moving more towards Claude than ChatGPT, maybe I’m imagining it but it seems better for keeping context in long detailed conversations?",
          "score": 4,
          "created_utc": "2026-01-18 15:46:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0bb4kl",
              "author": "mercyroofing",
              "text": "Yeah Claude is the go-to for me for 6 weeks (planning, triage, sound boarding) switched over from Grok",
              "score": 1,
              "created_utc": "2026-01-18 16:31:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0cxla0",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxld3",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxla0/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:12:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0fsdb4",
              "author": "LowpolyApe",
              "text": "Claude is absolutely the way to go. I have a feeling GPT is moving backward with each new update, and Claude is just great all around, from problem-solving to planning.",
              "score": 1,
              "created_utc": "2026-01-19 07:13:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0llz78",
                  "author": "Any_Spell_5716",
                  "text": "The only problem is the much lower limits on messaging in free tier, specially when trying to use it for building. Have you committed to the paid tier yet? Is it worth it?",
                  "score": 1,
                  "created_utc": "2026-01-20 03:05:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0z24e1",
              "author": "OddInititi",
              "text": "gonna test out claude",
              "score": 1,
              "created_utc": "2026-01-22 02:16:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0at4po",
          "author": "InterYuG1oCard",
          "text": "Solid stack, I use the tools above and clay to find my leads info",
          "score": 1,
          "created_utc": "2026-01-18 15:04:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0busq3",
              "author": "chikanlegbees",
              "text": "Clay is pretty solid, have you looked into VentureRadar for leads on Reddit? What’s the pricing for clay?",
              "score": 1,
              "created_utc": "2026-01-18 18:04:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0cxmac",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxmcm",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxmac/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:12:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0avo4z",
          "author": "Oldguy3494",
          "text": "Canva",
          "score": 1,
          "created_utc": "2026-01-18 15:17:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bew87",
          "author": "allbl4ackeverything",
          "text": "Canva has been helpful. Excel helps me track and see everything. I love it. Maybe considered old school but works.",
          "score": 1,
          "created_utc": "2026-01-18 16:49:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxn6r",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxn8x",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxn6r/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:12:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0peki2",
              "author": "matthewfinchz",
              "text": "agree",
              "score": 1,
              "created_utc": "2026-01-20 17:56:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0bqf7g",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-18 17:44:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0bqfd0",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0bqf7g/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-18 17:44:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0br5sp",
          "author": "Any-Airline7226",
          "text": "Claude",
          "score": 1,
          "created_utc": "2026-01-18 17:48:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bun5u",
          "author": "chikanlegbees",
          "text": "I use all of the above and VentureRadar for my leads so I can do outreach on Reddit",
          "score": 1,
          "created_utc": "2026-01-18 18:04:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxo35",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxo49",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxo35/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:12:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0bvynh",
          "author": "NoCloutTy",
          "text": "chatgpt for ideas, emails with sendflow, supabase for database, loom and youtube for videos walkthrough",
          "score": 1,
          "created_utc": "2026-01-18 18:10:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0c3blf",
          "author": "iNavin",
          "text": "Canva for design,\nTeams for communications \nSharepoint for files etc. \nGemini Pro and Perplexity for everything AI. \nOutlook for email. - looking at some AI tools\nTo help me there. \nMicrosoft Excel for most of my day to day work. \nHostinger for hosting \nWordpress with Elementor Pro for websites. \nHired a full time SEO person to help me with improving content for my website. \nLinkedin Sqles Navigator\nApollo / zoominfo for leads",
          "score": 1,
          "created_utc": "2026-01-18 18:43:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxr5i",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxr7p",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxr5i/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:13:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0c7gt1",
          "author": "rogeromanager",
          "text": "I don't know what your business is about but you must be marketing it and the best tool for it is gohighlevel. It has everything you need, website builder, funnels, forms, email sequences, reputation management, ai voice agent, power dialer and more. If you want I can give you an overview of the tool. \nPs. Not trying to sell it just doing some intentional networking.",
          "score": 1,
          "created_utc": "2026-01-18 19:02:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxt58",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:13:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxt6z",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxt58/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:13:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0cb038",
          "author": "Significant-Dust2460",
          "text": "Nice stack! I'm similar on Claude, n8n, ChatGPT + Google Sheets for the core stuff.\n\nOne thing that's been surprisingly useful: mining competitor reviews for customer language.\n\nI was spending hours manually reading Google reviews of competitors to understand what customers actually want. Turned it into a bit of an obsession - you find patterns like \"every 1-star review mentions slow service during lunch\" or \"customers keep asking for X feature that nobody offers.\"\n\nThe language customers use is gold for copy, positioning, and finding gaps. But doing it manually for 500+ reviews takes forever.\n\nBuilt a tool (Kairo) to automate this, it pulls all the reviews, opportunities, common complaints, exact phrases customers use. Testing it out right now to validate if it's actually useful.\n\nReal question for you: Do you ever analyze competitor reviews/feedback as part of your research? Or is that just my weird obsession? 😅\n\nIf you ever want to see what it finds for your space, happy to run one for free in exchange for honest feedback on whether it's actually valuable or just another shiny object.",
          "score": 1,
          "created_utc": "2026-01-18 19:19:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxtzw",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:13:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxu1s",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxtzw/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:13:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0ckfeh",
          "author": "Adventurous-Date9971",
          "text": "The best tools are the ones you actually open every day, not the shiny ones on Twitter. For me, the big unlock was tightening the stack around a few things: lead capture, follow-up, and decision-making.\n\nFor leads, I pair Webflow forms + Tally for quick landing pages, then pipe everything into Airtable as a lightweight CRM. From there, I trigger simple Make/Zapier automations to send intro emails and tag people based on source so I actually know what’s working.\n\nFor outreach, Lemlist is solid, but adding something like Apollo or Clay to clean/enrich leads before campaigns made a bigger difference than any copy tweak. On the “figuring out where to show up” side, I’ve used Ahrefs and SparkToro to see what channels my audience actually hangs out on, then doubled down there.\n\nI’ve tried things like Hypefury and Typefully for socials, and more recently Pulse alongside those and Pipedrive to systematically show up in Reddit threads that match my ICP instead of doomscrolling. The main point: fewer tools, wired together well, beat a huge stack every time.",
          "score": 1,
          "created_utc": "2026-01-18 20:05:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxul0",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:13:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxung",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxul0/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:13:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0cxk2a",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-18 21:11:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxk3t",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxk2a/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-18 21:11:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0cy4jb",
          "author": "Necessary_Proof_514",
          "text": "I started using some tools to help me write faster and it made things easier. It reduced the mental load a lot.",
          "score": 1,
          "created_utc": "2026-01-18 21:15:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0d6q4e",
          "author": "jnglsct",
          "text": "Jungle Scout has been a game-changer for me in e-commerce. product research, keyword volume, real margins in minutes before I commit. No hype, just data that actually helps avoid bad buys.\n\nMore tools that worked for me in bio 🐸. What’s your top one so far?",
          "score": 1,
          "created_utc": "2026-01-18 22:00:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dgwue",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-18 22:48:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0dgww7",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0dgwue/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-18 22:48:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0e801n",
          "author": "Euphoric-View-9876",
          "text": "Honestly the tools that stuck for me weren’t the flashy ones, they were the ones that reduced decision friction. Sheets + a lightweight CRM beat fancy dashboards, Claude/ChatGPT for thinking not writing, and Lemlist only mattered once the inputs were good. Biggest hidden win for me was spending time understanding where my audience actually shows intent (comments, competitor followers, discussions) before doing any outreach that saved way more time than swapping tools. Fewer tools, clearer signal, better outcomes.",
          "score": 1,
          "created_utc": "2026-01-19 01:09:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ea95y",
          "author": "Chicken_Brai",
          "text": "I use wonprompt for a virtual team.\n\nIll create a scene of my business overall goals and mission, company ideology, business plan, etc\n\nThen I create personalities based on my virtual personalities of ideal employees\n\nI keep it open on split screen and the left side of the screen I have my work im doing then ask the ai team opinions and such as I go\n\nhttps://preview.redd.it/mpnfpwd6k7eg1.jpeg?width=1080&format=pjpg&auto=webp&s=9801ed7a1e5744a78b6dab5be195e03c1dfce045",
          "score": 1,
          "created_utc": "2026-01-19 01:22:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ed7hp",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-19 01:39:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ed7jz",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0ed7hp/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-19 01:39:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0et0i2",
          "author": "ApprehensiveCrab96",
          "text": "Claude for coding and Saner for day planning",
          "score": 1,
          "created_utc": "2026-01-19 03:04:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0et75i",
          "author": "TwoBitFoundry",
          "text": "I recommend Wave for online invoice handling. Free to use, free to brand, automatic reminders, and has a really great api for automations. I actually use it as my converted client directory as well. Cause I have to add my client info to onboard them, so it’s worked out!",
          "score": 1,
          "created_utc": "2026-01-19 03:05:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ey4vu",
          "author": "Kudos_812",
          "text": "A hammer.",
          "score": 1,
          "created_utc": "2026-01-19 03:33:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f3h9x",
          "author": "Sudden_Breakfast_358",
          "text": "For us, the tools that actually free up time are the ones that handle repetitive tasks. Sensay has been a game-changer, it manages FAQs, customer follow-ups, and basic internal knowledge so we’re not stuck in the inbox. ChatGPT is great for drafting content, and Zapier/Make keeps workflows automated. Together, they cut down on busywork and let the team focus on real business tasks.",
          "score": 1,
          "created_utc": "2026-01-19 04:06:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fd2w8",
          "author": "SchniederDanes",
          "text": "what’s helped me most isn’t adding more tools, but building a simple acquisition engine where each tool has a clear job... ads bring in demand, but the real win is what happens after the click... we route inbound calls to an ai voice agent using a tool like dialnote.com.. so no lead is missed, calls are handled or logged automatically, and intent is captured even when no one is available... then for outbound and followups, smartreach.io.. runs email and linkdn sequences in parallel, with replies, calls, and tasks all tracked in one place... we plug in a lightweight enrichment tool only where needed, instead of overdoing it. once everything talks to each other, acquisition stops feeling manual and starts feeling predictable... that shift mattered way more than any single shiny tool.",
          "score": 1,
          "created_utc": "2026-01-19 05:11:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0frgap",
          "author": "trainmindfully",
          "text": "most tools people swear by only worked because they matched how that person already thinks and works. the hype ones usually fail because they add a new system on top of existing chaos. the genuinely helpful stuff tends to be boring. anything that reduces handoffs, duplication, or decision friction usually sticks. for me that has meant fewer tools doing more, not more tools doing narrow things. spreadsheets survive every cycle for a reason. also worth saying that tools feel productive early, but process clarity matters more. if a tool requires constant upkeep or manual discipline to stay useful, it usually gets abandoned once things get busy. the best ones disappear into the background and quietly save time without asking for attention.",
          "score": 1,
          "created_utc": "2026-01-19 07:05:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fw5bx",
          "author": "Training-Dinner1660",
          "text": "En mi caso y muchas personas que conozco, utilizamos **Notion + LLM** (ChatGPT o Gemini). Y ya las herramientas de operación para prestar tu servicio va a depender de tu área de actividad. Por ejemplo:\n\n|Marketing|HubSpot, GA4 + GTM, Meta/Google Ads|\n|:-|:-|\n\n\n|Desarrollo|GitHub, Jira, Vercel/AWS|\n|:-|:-|\n\n\n|Consultoría/Formación|Notion, Zoom, Miro|\n|:-|:-|",
          "score": 1,
          "created_utc": "2026-01-19 07:47:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g2g2f",
          "author": "Useful_Grape9953",
          "text": "For actual impact, I’d add Sensay, it helps discover AI tools and workflows that other small businesses are actively using, so you skip the hype. Beyond that, simple automation stacks (like Zapier or Make) plus ChatGPT for structured tasks usually save the most time.",
          "score": 1,
          "created_utc": "2026-01-19 08:45:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gg58o",
          "author": "Unique-Painting-9364",
          "text": "Honestly boring tools have helped me the most. A solid CRM setup good email automation, and simple dashboards beat shiny tools I barely use. If it saves time every week it’s worth it hype fades fast.",
          "score": 1,
          "created_utc": "2026-01-19 10:53:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ghpb4",
          "author": "StillLoadingit",
          "text": "I lean on tools like HubSpot or ActiveCampaign for CRM and automations, Trello or Asana for project and task management, and Google Analytics for tracking traffic and engagement. For making client access and onboarding way smoother, I’m using Connexify to cut down setup friction.",
          "score": 1,
          "created_utc": "2026-01-19 11:07:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gmh95",
          "author": "MintedRiddle",
          "text": "I mostly live in Canva and Sheets, also Claude for ideas and Ramp for finances/expenses",
          "score": 1,
          "created_utc": "2026-01-19 11:48:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gqp7i",
          "author": "Vaibhav_codes",
          "text": "Tools that actually stick are the ones that cut repetitive work or give clear insights automation, analytics, and AI helpers for content or docs.",
          "score": 1,
          "created_utc": "2026-01-19 12:22:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h9v6r",
          "author": "One-Cardiologist4433",
          "text": "One thing I rarely see talked about is workload visibility. A lot of stacks help with tasks or notes, but not with knowing who’s overloaded before things slip. Have you found anything that helped with that specifically?",
          "score": 1,
          "created_utc": "2026-01-19 14:21:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hdkae",
          "author": "daydarce",
          "text": "nice list, i've been hearing a lot about how AI search is changing the game for discovery lately. If you're thinking about how customers find you through ChatGPT or Perplexity answers, I've heard great things about Brandlight for monitoring and improving how your brand shows up in those AI responses. From what I understand it helps you see what AI tools are actually saying about your products and gives you ways to influence those mentions, which seems pretty important now that people are skipping Google for AI chatbots when researching purchases.",
          "score": 1,
          "created_utc": "2026-01-19 14:40:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0iv8py",
          "author": "fixingprocesses",
          "text": "The tools that help most are the ones that support thinking and follow through, not just output. Simple tracking, somewhere to write clearly and something that reduces context switching usually do more than advanced automation.\n\nAI is useful when it helps you organise decisions, clarify messages or review work rather than generate more things to manage. I see people get more value by narrowing how they use it instead of adding another model.",
          "score": 1,
          "created_utc": "2026-01-19 18:45:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0j0ajb",
          "author": "muabaca",
          "text": "slack for quick team syncs airtable for flexible crm upgrades automate repetitive stuff with make ((cheaper zapier alt) audit workflows quarterly to cut waste. sensays useful for capturing team knowledge as one option whats your main pain point scaling?",
          "score": 1,
          "created_utc": "2026-01-19 19:07:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mndub",
          "author": "MORPHOICES",
          "text": "I have tried everything over the years. What I’ve found most useful are the tools that… reduce thinking. Not features. \\~\n\nThe two things that really stuck for me. \\* Google Sheets – unsexy but unbeatable. I use it for lighter-weight CRM, tracking of experiments, and sanity checking. A tool must outperform a spreadsheet in order to be adopted.\n\n\\* A single source of truth like Notion only works if ruthless about it. I maintain a single \"operating page\" for each project which contains goals, ICP, offers, and ongoing experiments. No second brain, no mess.\n\n\\* Using email is under-rated. Use Gmail and labels.  Most transactions and genuine opportunities still occur here. CRMs with bells and whistles arrived later.\n\n\\* Calendly and short calls is the tool giving me the most ROI by far. Interacting with users is better than any dashboard.\n\n\\* Use ChatGPT to compress and rewrite careless words into neat insights or notes like during calls or meetings.\n\nTools I gave up.\n\n\\* Anything that promised “automation” before I had repeatable behavior.\n\n\\* Before I had visitors worth analyzing, I got analytics tools.\n\nIt's my order now.\n\nIf a tool is not saving you time this week, it’s friction.\n\nI wonder what you removed recently that simplified things.",
          "score": 1,
          "created_utc": "2026-01-20 07:22:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pehmi",
          "author": "matthewfinchz",
          "text": "Automation saves you money and energy.",
          "score": 1,
          "created_utc": "2026-01-20 17:56:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tjka6",
          "author": "Minute-Newt-1439",
          "text": "I use Gemini for copywriting and Morelogin for managing my multiple social media accounts. Although they are paid services, they are very efficient.",
          "score": 1,
          "created_utc": "2026-01-21 08:02:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vrp5g",
          "author": "Weekly_Accident7552",
          "text": "For me the genuinely helpful stuff is the boring backbone, not the flashy AI tools. Google Workspace plus a real payment and accounting setup, then one place where work actually runs so you are not living in DMs. We use Manifestly for recurring ops like client onboarding, content production, and weekly reviews, because it is easy to keep the team aligned and you can see what is stuck. Most other tools were nice, but this was the one that reduced chaos week after week.",
          "score": 1,
          "created_utc": "2026-01-21 16:44:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yiei7",
          "author": "PersonalEcho9244",
          "text": "So many gems here. Taking notes!",
          "score": 1,
          "created_utc": "2026-01-22 00:26:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj1i94",
      "title": "What’s the clearest sign that a business idea is not worth pursuing?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qj1i94/whats_the_clearest_sign_that_a_business_idea_is/",
      "author": "One-Two-218",
      "created_utc": "2026-01-21 15:50:44",
      "score": 20,
      "num_comments": 30,
      "upvote_ratio": 0.92,
      "text": "I’m documenting my early thinking around a business idea, and I’m trying to be just as honest about when not to move forward.\n\nEveryone talks about green lights and validation, but I feel like the red flags matter just as much. I’ve had ideas that sounded good on paper and even got positive reactions, yet something still felt off.\n\nFor people who’ve been through this phase:  \nWhat was the moment or signal that told you an idea wasn’t worth continuing with even if it seemed promising at first?\n\nI’m more interested in lessons learned than success stories.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qj1i94/whats_the_clearest_sign_that_a_business_idea_is/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0virzz",
          "author": "Normal_Sun_8169",
          "text": "For me, it was when every conversation required heavy explanation. If I had to “educate” people just to make the problem sound relevant, that was usually a sign the pain wasn’t real enough.",
          "score": 27,
          "created_utc": "2026-01-21 16:03:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10fb8q",
              "author": "Medical_Fuel5472",
              "text": "Depends. If it’s a B2B, common folk would find it very hard to understand.",
              "score": 2,
              "created_utc": "2026-01-22 08:01:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o10py46",
                  "author": "Apprehensive_Dog5208",
                  "text": "I think what OC meant was that if they had to educate the people they're selling to to make the problem sound relevant then the pain wasn't real enough.\n\nI think of this like being on YouTube and hearing people educate you about data privacy and why you should get Incogni. While all of that may be true, to many regular people watching YouTube, their identity has never been stolen and they don't know of anyone's identity who has - so the education is meaningless and the pain isn't real (to them).\n\nBut Incogni has bucketloads to spend on advertising for their idea: many founders don't have this. So if you have to educate leads before getting them to buy, you lose all of the people who couldn't care to buy into a problem that hasn't affected them yet. This can be a lot, and as a startup, OC argues that the pain isn't real enough if you have to tell people they have a problem",
                  "score": 1,
                  "created_utc": "2026-01-22 09:42:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0vj37d",
          "author": "kook5454",
          "text": "I went through this exact thought process after reading Starting a Startup by James Sinclair. One idea that stuck with me was paying attention to ideas that create momentum on their own. If everything requires pushing, that resistance might be telling you something important.",
          "score": 8,
          "created_utc": "2026-01-21 16:05:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0vkygr",
              "author": "One-Two-218",
              "text": "That resonates. The idea of momentum being natural instead of manufactured makes a lot of sense. I might revisit how much I’m pushing versus how much is pulling me forward",
              "score": 2,
              "created_utc": "2026-01-21 16:13:44",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o0xsoem",
              "author": "CheyanneO3",
              "text": "From a marketing lens it’s all about tapping into latent demand. Trying to use persuasion to convince people to buy your offer is incredibly inefficient. \n\nConnecting to demand that currently exists (and is unmet) is always the goal.",
              "score": 1,
              "created_utc": "2026-01-21 22:12:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0vruh3",
          "author": "DecisionOperator",
          "text": "if you can’t name who pays, why they pay, and what they stop doing after they pay, it’s a hobby.\n\n“positive reactions” don’t matter. money, time, and repeat requests do.\n\ntake your idea and ask 10 target users for one specific pre-order or intro call this week, then drop it if you get excuses.",
          "score": 7,
          "created_utc": "2026-01-21 16:44:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wtdhr",
          "author": "barefamting",
          "text": "You can't find people willing to pay for what you're offering.",
          "score": 5,
          "created_utc": "2026-01-21 19:30:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0x0pmt",
              "author": "Plus-Professional-84",
              "text": "That is the only real test. You will always find beta users for an MVP, prospects who are “interested”, etc etc. At the end of the day, do they, or not, open their wallet is the only metric that matters",
              "score": 5,
              "created_utc": "2026-01-21 20:04:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0x205q",
                  "author": "barefamting",
                  "text": "That's basically it. There's a stark difference between those who say they would and those who do.",
                  "score": 2,
                  "created_utc": "2026-01-21 20:10:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0wjrss",
          "author": "alexfelice",
          "text": "Almost every idea sounds good on paper \n\nAll the things I've done that failed are because I spent too much on activities that didn't matter and not enough time on the only thing that really matters: revenue \n\nFeedback from paying customers will tell you almost everything you need to know",
          "score": 3,
          "created_utc": "2026-01-21 18:48:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wnm47",
          "author": "CayoPerican",
          "text": "Built an mvp and checked usage data from beta users. They weren’t coming back on their own.",
          "score": 3,
          "created_utc": "2026-01-21 19:05:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yjr4n",
          "author": "Competitive-Fox-1743",
          "text": "For me it always comes back to money.\n\nIf no one is willing to pay, that’s the clearest red flag. Not later, not after a few tweaks, not once it’s more polished. If people like the idea but won’t spend even a small amount, that tells you a lot.",
          "score": 2,
          "created_utc": "2026-01-22 00:33:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x7kl4",
          "author": "GeorgeHarter",
          "text": "During potential customer interviews (as opposed to user interviews). \n\nExample:\nI was throwing a beach party a Looong time ago. We rented a porta potty to minimize dragging sand into the house. \nA female friend suggested that “no woman will sit on a portapotty toilet seat, so they hover”. \nShe suggested a strap or bar to hold. \n\nI designed a “hover bar” attached to the door, so a person could balance themselves. \n\nWhen I spoke to local PP business owner, he said no vendor will want to add cost for that because it is agreeing with the idea that the seat is dirty. I confirmed with another dealer, then dropped the idea. \n25 years later, some have grab bars. Most still don’t.",
          "score": 1,
          "created_utc": "2026-01-21 20:35:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xj50l",
          "author": "Keep_Askin",
          "text": "No competition. ",
          "score": 1,
          "created_utc": "2026-01-21 21:28:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0y8enn",
          "author": "rt2828",
          "text": "No ICP",
          "score": 1,
          "created_utc": "2026-01-21 23:32:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ydtnl",
          "author": "Smyley12345",
          "text": "\"Is it appealing to customers that have money?\". I remember hearing about studio space marketed towards streamers and cringed so hard it was physically painful.",
          "score": 1,
          "created_utc": "2026-01-22 00:01:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ysjs1",
          "author": "CleanOpsGuide",
          "text": "For me, the clearest signal was when progress depended more on my enthusiasm than on external pull.\n\nIf I had to keep reframing, persuading, or “staying motivated” just to move the idea forward, instead of reacting to real constraints or feedback, that was usually a sign the market wasn’t actually asking for it.\n\nThe ideas worth continuing tended to create friction on their own. The wrong ones required constant internal energy just to stay alive.",
          "score": 1,
          "created_utc": "2026-01-22 01:22:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0z7la2",
          "author": "Perseverance_ac",
          "text": "Solving your own problem that nobody else has OR Liking the product so much you forget about sales : validate through customer interviews.\n\nOversaturation of the market and no clear differentiator of your idea.\n\nIdea is too big for you to make initial sales on your own: think anywhere you need a warm intro.\n\nIf you can make the product on your own, most red flags are related to sales: if you can't sell it on your own, who / what services do you need?\n\nNow if you can not make the product on your own, it opens way more red flags.",
          "score": 1,
          "created_utc": "2026-01-22 02:47:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10it1f",
          "author": "alexrada",
          "text": "no customers that pay.",
          "score": 1,
          "created_utc": "2026-01-22 08:34:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10jm82",
          "author": "Vaibhav_codes",
          "text": "The clearest sign is when people say they’d pay but don’t actually pay. Positive feedback is nice, but no real willingness to spend money usually means the idea isn’t solving a strong enough problem Other red flags: unclear target audience, constant pivoting, or you can’t explain the value in one sentence.",
          "score": 1,
          "created_utc": "2026-01-22 08:42:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10nyr2",
          "author": "AdBusy7153",
          "text": "The clearest sign for me is when I cant find the specific moment of pain. If a potential customer problem is vague or they are only mildly annoyed, they wont pay to solve it. True, fundable pain makes them wince when you describe it",
          "score": 1,
          "created_utc": "2026-01-22 09:23:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10p5fw",
          "author": "chucksd805",
          "text": "If chatgpt says it is a good idea lol. RUN",
          "score": 1,
          "created_utc": "2026-01-22 09:34:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11zlmv",
          "author": "AmbitiousJump5768",
          "text": "when we tried every single marketing or sales thing. social media, fb market place, google ads, fb ads, yt, cold calling, cold emails, etc we have a good website but nothing really clicked in any of that. We had to pause, think long and hard wheteher it was still worth pursuing or we're missing something else.",
          "score": 1,
          "created_utc": "2026-01-22 14:50:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vs8qm",
          "author": "PrettyRadio2073",
          "text": "Il segnale più chiaro? Quando ricevi solo 'reazioni positive' ma zero impegno reale. Nel mio libro, **'Startup Inferno'**, definisco questa fase come il **Limbo**.\n\nIl problema è che molti founder scambiano la cortesia delle persone per validazione. In realtà, il segnale definitivo che un'idea non vale la pena di essere perseguita è l'incontro con un **Fatal Flaw** che non può essere risolto senza tradire la natura stessa del progetto.\n\nEcco tre 'bandiere rosse' tratte dai gironi del mio manuale:\n\n1. **La Lussuria della complessità:** Se per spiegare il valore del tuo prodotto hai bisogno di dieci minuti e tre schemi, sei nel girone sbagliato. Se l'impatto non è immediato il mercato ti ignorerà.\n2. **L'Avarizia del margine:** Se l'idea sta in piedi solo se tutto va perfettamente e non c'è spazio per l'errore, sei destinato a bruciare capitali nello spreco.\n3. **Il Test del Grill:** Se metti l'idea sotto il **'Grill della validazione'** e chiedi un impegno economico (anche piccolo) o di tempo, e le persone spariscono, quella non è un'idea, è solo una bella storia da raccontare al bar.\n\nHo mappato i 9 gironi dell'imprenditoria proprio per aiutare a distinguere tra un'idea che scotta (buona) e una che ti brucia e basta (fallimentare). Se senti che qualcosa non ti convince, probabilmente hai intravisto un Fatal Flaw che la tua parte razionale sta cercando di ignorare.\n\nFidati del Grill, non dei complimenti.",
          "score": -2,
          "created_utc": "2026-01-21 16:46:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhefgc",
      "title": "Ask me any marketing questions!",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qhefgc/ask_me_any_marketing_questions/",
      "author": "adrian-gonzal3z",
      "created_utc": "2026-01-19 19:42:35",
      "score": 15,
      "num_comments": 28,
      "upvote_ratio": 1.0,
      "text": "Did this a while back and thought it was fun so I'm doing it again.\n\nAsk me any marketing questions. My expertise is in SEO, email marketing, and social media.\n\nI'm not going to PM you or pitch you on anything after you comment. No strings attached, all I get out of this is some insight to use on pitching in the future.",
      "is_original_content": false,
      "link_flair_text": "Resources & Tools",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qhefgc/ask_me_any_marketing_questions/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0jcl2b",
          "author": "Spirited_Manager_831",
          "text": "What is the best way to start doing marketing for my fiction book? \n\nI create content on a regular basis and have a newsletter, but it's mostly education on how to write a book. \n\nHowever, my first book is almost ready for publication, and if I go down the independent route, I’ll have to market it myself.\n\nI know email marketing and social media are important, but do you have any advice for this industry in particular?",
          "score": 3,
          "created_utc": "2026-01-19 20:04:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0jj924",
              "author": "adrian-gonzal3z",
              "text": "Be super nice to smaller influencers and see if they're willing to promote it.\n\nYou could talk about the writing process itself on TikTok and see if people are interested in the story you're telling. Makes you and the story seem so much more relatable",
              "score": 2,
              "created_utc": "2026-01-19 20:35:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0sc5nx",
                  "author": "Spirited_Manager_831",
                  "text": "Thankyou!!!!",
                  "score": 1,
                  "created_utc": "2026-01-21 02:45:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0yzxxa",
              "author": "eXprtly",
              "text": "Define your ideal reader and discover were they hang out...and you guessed it...that's were you hang out.",
              "score": 1,
              "created_utc": "2026-01-22 02:04:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0jq8h3",
          "author": "PersonalEcho9244",
          "text": "If you were running both a service business and a local lead gen site at the same time, how would you prioritize marketing so one feeds the other?",
          "score": 2,
          "created_utc": "2026-01-19 21:08:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mgd4d",
          "author": "Loud_Piece_8212",
          "text": "What marketing tools do you use? How does your day-to-day usually look like?",
          "score": 2,
          "created_utc": "2026-01-20 06:23:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mgv1i",
              "author": "adrian-gonzal3z",
              "text": "Semrush, Canva, Adobe Suite, Screaming Frog are my main ones right now. I don't particularly like social media scheduling tools.\n\nday to day includes seeing my different clients emails and working on their deliverables",
              "score": 1,
              "created_utc": "2026-01-20 06:27:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0mxd8l",
          "author": "Comfortable_Weird891",
          "text": "I’m starting a LinkedIn and X account from literally 0 followers (no audience, no email list) for my startup. Will posting still be useful when I have 0 followers, or is it better to focus on engagement first?\n\nIf posting is still worth it, what’s the best way to start in the first 30 days? How often should I post, what formats work best early on (short posts, threads, visuals) and what should I prioritize between posting, commenting, and outreach to get the first 100 followers?",
          "score": 2,
          "created_utc": "2026-01-20 08:54:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ooh80",
          "author": "BetaOfficeUK",
          "text": "For a niche B2B service (UK virtual office / compliance-adjacent),\n\nwhat have you seen work best early on to build trust and get the \\*first\\* paying customers?\n\n\n\nContent seems to get attention, but converting that attention into actual trust is the harder part.\n\nCurious where you’d focus first if you were starting from scratch.",
          "score": 2,
          "created_utc": "2026-01-20 15:56:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jkjg0",
          "author": "DecisionOperator",
          "text": "what’s the fastest way to prove your marketing isn’t just “activity”?\n\n\ngive me one metric you trust, one action that moves it, and the earliest point you’d admit it’s not working and cut it.",
          "score": 1,
          "created_utc": "2026-01-19 20:41:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l01n7",
          "author": "SneezerEclipse",
          "text": "There is this TCG that totally flopped on their tech side (Altered TCG).  It had massive momentum from its Kickstarter campaign, but then they overpromised on delivering the product.  There aren’t any stores selling singles (where you buy one card at a time.  The game is dead, is the mantra on their subreddit.\n\nAnyways, they finally released the marketplace.  They allow print on demand for any card that a player owns.  So what did I do?  Degenerate gambling per usual.  \n\nI bought up all the first edition meta, collectible, and favorite cards I like, to a guess of 2-3% of their total print for these cards.  I didn’t want to hinder the game, but I wanted to take advantage of a low market.  \n\nThe company hasn’t given up yet and is in set 5, but the digital cards they offer don’t move in price much in the digital market because only a relative few cards are being bought while the other are being dumped.\n\nMy question is, how can I inspire a market bounce?  The Kickstarter cards seem to have created a precedent that digital cards “should be worthless.”  I believe that all the cards should be subject to “investors” and that the pricing of the cards should be both the cards that are doing well in tournaments and the cards that people love to collect.  \n\nAny ideas for online advertising for a worthy but struggling TCG?\n\nSorry, this is long.",
          "score": 1,
          "created_utc": "2026-01-20 01:05:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l4c8g",
          "author": "Extreme_Log5264",
          "text": "What's your advice to someone trying to get their foot in the door for an entry level career job? Especially with today's job market.",
          "score": 1,
          "created_utc": "2026-01-20 01:28:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n4uyh",
              "author": "bersuku",
              "text": "Get results for a business. Do it for free to build up your street cred. Learn how to leverage AI.",
              "score": 1,
              "created_utc": "2026-01-20 10:05:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0mmrlb",
          "author": "MORPHOICES",
          "text": "If today you had nothing but a scrappy solo project, for example, what would your first 30 days of marketing actually look like? \\~\n\nThe realistic plan, with limited time, no audience and no budget, is the one we create.",
          "score": 1,
          "created_utc": "2026-01-20 07:17:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mnndo",
          "author": "Training-Dinner1660",
          "text": "Se agradece tu predisposición. Ahí va mi pregunta. ¿Cuál puede ser un Stack de Apps adecuado para lanzar un SideHustle, y para qué utilizarías cada herramienta?\n\n¡Mil gracias!",
          "score": 1,
          "created_utc": "2026-01-20 07:25:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0msrko",
          "author": "cryptic_epoch",
          "text": "Which tools or platforms do you use to generate customer leads for your business  ?",
          "score": 1,
          "created_utc": "2026-01-20 08:11:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mvkp4",
              "author": "Wide_Brief3025",
              "text": "Focusing on where your audience already hangs out is huge for lead generation. Reddit and Quora are goldmines if you know how to listen for the right conversations. If you want to track high intent mentions instantly without digging through posts manually, ParseStream is worth a look since it alerts you about relevant leads with AI filtering.",
              "score": 2,
              "created_utc": "2026-01-20 08:37:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0mwu7v",
                  "author": "cryptic_epoch",
                  "text": "Fascinating! Let me have a look..",
                  "score": 1,
                  "created_utc": "2026-01-20 08:49:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0n6fpb",
          "author": "Vaibhav_codes",
          "text": "Nice offer ! Curious from your experience: what’s actually working in SEO right now for early stage products with low authority content, programmatic pages, partnerships, or something else?",
          "score": 1,
          "created_utc": "2026-01-20 10:20:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n7w24",
          "author": "straight_forward13",
          "text": "I run a struggling general trading company in Dubai, started it 2 years ago. I have many suppliers for  most any goods that fall under the general trading category in Dubai. \n\nBut I can't get clients and I don't have funds for marketing or ads. It's mostly word of mouth but the clients I do get ask credit. I cannot afford to supply on credit, I can only do 80 to 100%  cash advance. \n\n\nPlus many customers already have established suppliers. So the competition is really heavy\n\nAnd now it's renewal is coming up in 2 months. Any advice would be appreciated",
          "score": 1,
          "created_utc": "2026-01-20 10:33:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o9ef3",
          "author": "RowTime8498",
          "text": "I'm making a productivity app that emphasizes consistency and doing less actually means achieving more using some psychology principles. How do I get people to know about the app? I've tried social media posts, but they usually don't get many views. I know consistency matters with the posts, and I am happy to keep posting, but in the meanwhile while the channels grow, what am I to do marketing wise? \n\n  \nThanks in advance!",
          "score": 1,
          "created_utc": "2026-01-20 14:42:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pil95",
          "author": "iNavin",
          "text": "How would you go about B2B Tech Services. If you could elaborate on at least one thing that is a must/foundational to anything else to build over?",
          "score": 1,
          "created_utc": "2026-01-20 18:14:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0sijlz",
          "author": "Flashy_Plate_5409",
          "text": "How do you drive traffic onto any online business physical/digital products",
          "score": 1,
          "created_utc": "2026-01-21 03:23:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0srthd",
          "author": "Historical_Toe_7929",
          "text": "\\#1 rule to be indexed in LLM?",
          "score": 1,
          "created_utc": "2026-01-21 04:21:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tsd4z",
          "author": "Optimal-Ad-1158",
          "text": "I have created a shopify app which allow customers to choose date and time slot for their products delivery and local pickup and allow merchants to configure these dates and slots.\nWhat will be the best way to market this app.\nThere are already multiple established apps in this space.",
          "score": 1,
          "created_utc": "2026-01-21 09:26:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhsuoe",
      "title": "What was the first thing you stopped doing that helped your business grow?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qhsuoe/what_was_the_first_thing_you_stopped_doing_that/",
      "author": "SignPsychological728",
      "created_utc": "2026-01-20 05:48:36",
      "score": 12,
      "num_comments": 9,
      "upvote_ratio": 0.93,
      "text": "Most advice for founders focuses on what to do more of more features, more marketing, more hustle.\n\nBut in my experience, progress often comes from removing things instead.\n\nI’m curious to hear from people building or running businesses:\n\n* What was the first habit, task, or assumption you *cut* that actually helped growth?\n* Was it saying no to certain customers?\n* Dropping features?\n* Stopping a marketing channel that wasn’t working?\n* Letting go of trying to do everything yourself?\n\nWould love to hear real examples of what you stopped doing and how that decision changed things.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qhsuoe/what_was_the_first_thing_you_stopped_doing_that/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0n55vc",
          "author": "bersuku",
          "text": "Stopped splitting my time across different projects. You can have more than one, but only one should be prioritized at a time.",
          "score": 2,
          "created_utc": "2026-01-20 10:08:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mgb9j",
          "author": "kubrador",
          "text": "stopped checking my email every 5 minutes and somehow the business didn't implode, turns out my anxiety was the only thing dying",
          "score": 1,
          "created_utc": "2026-01-20 06:23:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nb4pl",
          "author": "Big-Engineering-9365",
          "text": "Trying to post everywhere, pick one Platform and stick with it",
          "score": 1,
          "created_utc": "2026-01-20 11:01:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0od5mk",
          "author": "haseeb1431",
          "text": "Trying to do everything myself instead of trusting people. \n\n\"80% done by someone on team is better than 100% by myself'",
          "score": 1,
          "created_utc": "2026-01-20 15:01:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0oycid",
          "author": "StillLoadingit",
          "text": "The first thing I stopped doing was trying to manage every little piece myself and instead focused on the parts that actually move the business forward. Once I cut out the small admin tasks I could spend way more time improving onboarding and talking to users.",
          "score": 1,
          "created_utc": "2026-01-20 16:41:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qjtm3",
          "author": "LaFriedaSupports",
          "text": "Having ran several businesses, I was so focused on getting it out there everywhere I could. Years later, I am now realizing I don’t want to do all this extra work and get no results. I stopped listening to random SM advice and decided to concentrate on 2 channels for marketing. It will be a hard one for me. It may move slowly but knowing how to do multiple things halfway does not make you an expert or drive success in it unless you give 100% focus and are good at just 1 particular thing.",
          "score": 1,
          "created_utc": "2026-01-20 21:05:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qtnw7",
          "author": "EdisynAI",
          "text": "Stopping developing and just making it MVP to push into the market",
          "score": 1,
          "created_utc": "2026-01-20 21:50:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u4gme",
          "author": "ari_strauch",
          "text": "Stopped checking my Google rankings every 5 minutes. It was driving me crazy, wasn't a true indicator of success and was a perfect example of having my work priorities in the wrong place.",
          "score": 1,
          "created_utc": "2026-01-21 11:16:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qis98t",
      "title": "Month 8 update - hired first employee and the phone situation almost broke me",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qis98t/month_8_update_hired_first_employee_and_the_phone/",
      "author": "Dangerous-Guava-9232",
      "created_utc": "2026-01-21 08:14:44",
      "score": 11,
      "num_comments": 8,
      "upvote_ratio": 0.92,
      "text": "Quick update for anyone following along. Revenue hit $12k this month which is great, but I hired my first employee (finally) and realized my phone setup was completely inadequate for a two-person operation.\n\nI was still using my cell phone for everything. When I hired Sarah, I had to give her my personal number to use when customers called during her shifts. This obviously sucked for multiple reasons. Customers would text my personal phone at weird hours, Sarah did not have access to voicemail, and I had no way to track which calls she was taking versus which ones I was handling.\n\nSpent a few days this month getting a real business phone system sorted. Now we have a main business number, both of us can answer from our own phones, and there is proper voicemail that we can both access. Small thing but it made me feel like an actual business instead of a guy with a mop.\n\nLesson learned is you do not realize how janky your solo setup is until you try to bring someone else into it. Fix the infrastructure before you hire, not after.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qis98t/month_8_update_hired_first_employee_and_the_phone/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0v144w",
          "author": "Vodka-_-Vodka",
          "text": "Wait until you hire person number three and realize your scheduling system is also held together with duct tape and prayer. Every time you add people you find a new broken process. Welcome to the fun part of scaling.",
          "score": 2,
          "created_utc": "2026-01-21 14:41:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tukdg",
          "author": "kubrador",
          "text": "the fact that you handed your personal number to an employee is hilarious. sarah probably has your pizza order history mixed in with customer complaints about her service",
          "score": 1,
          "created_utc": "2026-01-21 09:48:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u2uee",
          "author": "ari_strauch",
          "text": "Following this as I'm always fascinated at the start and development of new businesses. Very curious how this plays out.",
          "score": 1,
          "created_utc": "2026-01-21 11:03:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uar6y",
          "author": "outdahooud",
          "text": "Congrats on the hire. The phone thing is so real, I ran into the exact same issue when I brought on my first person. You suddenly realize how many of your systems are just workarounds that only make sense in your own head",
          "score": 1,
          "created_utc": "2026-01-21 12:05:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ul6j1",
          "author": "BarberUnited7894",
          "text": "I went through this exact same thing with my lawn care business. Switched to nextiva when I hired employee number two and it made coordinating so much easier. We both have the app on our phones, can see who is calling, and can transfer calls between us if needed. Cost is like $30 a month for both of us.",
          "score": 1,
          "created_utc": "2026-01-21 13:14:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vgpdl",
          "author": "techside_notes",
          "text": "I ran into something similar when I started collaborating on even small projects. What felt fine solo suddenly became chaotic once another person needed access. For me, the biggest relief was standardizing where communications lived and which tools were “official” versus personal. It doesn’t feel flashy, but having a clear boundary for calls, messages, and tasks makes adding people far less stressful.\n\nI’ve found that building that little infrastructure first, even for just one collaborator, saves mental energy more than any growth hack or workflow tweak.",
          "score": 1,
          "created_utc": "2026-01-21 15:54:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ytdxy",
          "author": "CleanOpsGuide",
          "text": "This is such a real milestone. One thing I didn’t expect early on was how hiring exposes invisible dependencies, not just tools, but assumptions you didn’t realize you were carrying solo.\n\nEvery new person is basically a stress test for your infrastructure. Fixing things early doesn’t feel urgent… until it suddenly is.",
          "score": 1,
          "created_utc": "2026-01-22 01:27:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tz33b",
          "author": "rephrazo",
          "text": "Big congrats $12k month + first hire is a real “this is a business now” moment.\n\nAnd yep, the phone setup pain is so real: solo hacks work until the second person shows up, then everything breaks.\n\nWhat service did you switch to?",
          "score": 0,
          "created_utc": "2026-01-21 10:30:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qea9li",
      "title": "Month 8 update: From idea to $30K MRR - the full breakdown",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qea9li/month_8_update_from_idea_to_30k_mrr_the_full/",
      "author": "Delecch",
      "created_utc": "2026-01-16 08:09:09",
      "score": 8,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Been a while since I posted here, wanted to share where things are at. This community has been super helpful, so hopefully this gives something back.\n\n\n\n\\*\\*Quick background:\\*\\*\n\nStarted a social media management SaaS 8 months ago. First-time founder, no VC funding, just me and eventually one part-time contractor.\n\n\n\n\\---\n\n\n\n\\*\\*THE NUMBERS (Month 8):\\*\\*\n\n\n\n| Metric | Value |\n\n|--------|-------|\n\n| MRR | $30,400 |\n\n| Customers | 342 |\n\n| Churn | 5.8% monthly |\n\n| CAC | \\~$0 (organic only) |\n\n| LTV | \\~$520 |\n\n| Runway | Infinite (profitable) |\n\n\n\n\\---\n\n\n\n\\*\\*THE TIMELINE:\\*\\*\n\n\n\n\\*\\*Months 1-2:\\*\\* Building in isolation (mistake)\n\n\\- Built MVP in 8 weeks\n\n\\- Talked to exactly 0 customers\n\n\\- Assumed I knew what people wanted\n\n\n\n\\*\\*Month 3:\\*\\* Soft launch (reality check)\n\n\\- Posted on Product Hunt - 30 upvotes, 2 customers\n\n\\- Realized my assumptions were 60% wrong\n\n\\- Had to pivot core features\n\n\n\n\\*\\*Month 4:\\*\\* Started building in public\n\n\\- Began sharing everything on Twitter/X\n\n\\- Weekly revenue updates, failures, learnings\n\n\\- First signs of organic traction\n\n\n\n\\*\\*Months 5-6:\\*\\* Growth phase\n\n\\- Hit $10K MRR\n\n\\- Started engaging in communities (Reddit, indie hackers)\n\n\\- Word of mouth kicked in\n\n\n\n\\*\\*Months 7-8:\\*\\* Optimization\n\n\\- Reduced churn from 12% to 5.8%\n\n\\- Hired part-time support person\n\n\\- Hit $30K MRR\n\n\n\n\\---\n\n\n\n\\*\\*WHAT ACTUALLY WORKED:\\*\\*\n\n\n\n1. \\*\\*Building in public\\*\\* - People trust transparency. Sharing failures built more trust than highlighting wins.\n\n\n\n2. \\*\\*Community engagement\\*\\* - Not spamming links. Actually helping people. The conversions came naturally.\n\n\n\n3. \\*\\*Obsessing over churn\\*\\* - Spent 2 months just on retention. Onboarding, support, feature requests.\n\n\n\n4. \\*\\*Simple tech stack\\*\\* - Next.js, Supabase, Stripe, Vercel, Crescitaly for analytics. Nothing fancy.\n\n\n\n\\---\n\n\n\n\\*\\*WHAT FAILED:\\*\\*\n\n\n\n\\- Cold email (2% reply rate)\n\n\\- LinkedIn content (maybe wrong audience)\n\n\\- Paid ads (tried $500, terrible ROAS)\n\n\\- Product Hunt launch (timing was wrong)\n\n\n\n\\---\n\n\n\n\\*\\*BIGGEST LESSONS:\\*\\*\n\n\n\n1. Talk to users before building anything\n\n2. Distribution is as important as product\n\n3. Churn kills faster than slow growth\n\n4. You don't need funding to build something real\n\n\n\n\\---\n\n\n\n\\*\\*WHAT'S NEXT:\\*\\*\n\n\n\n\\- Hiring first full-time employee\n\n\\- Launching v2 with new features\n\n\\- Maybe exploring YouTube content\n\n\n\nHappy to answer any questions. What's your ride along story?",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qea9li/month_8_update_from_idea_to_30k_mrr_the_full/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzw6sek",
          "author": "Prestigious_Head6566",
          "text": "Can anyone explain what churn means in this context, im not a native english speaker",
          "score": 2,
          "created_utc": "2026-01-16 09:48:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzw7wgy",
              "author": "GrrasssTastesBad",
              "text": "That would be someone paying or using the product one month, then not staying with it after that.",
              "score": 2,
              "created_utc": "2026-01-16 09:58:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzw8bgm",
                  "author": "Prestigious_Head6566",
                  "text": "Thanks for the clarification",
                  "score": 1,
                  "created_utc": "2026-01-16 10:02:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzymuc4",
          "author": "NoCloutTy",
          "text": "Really cool breakdown. Currently in the \"actually talk to users before building anything\" lol. Thought I knew exactly what people wanted but turns out you never actually do. Tough pill to swallow but its been really cool connecting with people and creating something that you know will be useful before actually putting the work in. Its easy to get caught up just building building building, and not thinking about if there will actually be payoff. Excited to keep moving after hearing success like this. Thanks for sharing",
          "score": 2,
          "created_utc": "2026-01-16 18:01:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwk2xw",
          "author": "davis_untrapd",
          "text": "The jump from 12% to 5.8% churn in 2 months is honestly the most impressive part of this breakdown. Most founders I've talked to treat churn as a \"we'll fix it later\" problem and keep chasing new signups.\n\nCurious about your approach to that - was it mostly:\n- Onboarding improvements (getting people to the \"aha moment\" faster)?\n- Product changes based on why people were leaving?\n- Or proactive support reaching out before cancellation?\n\nAlso really resonated with the \"building in isolation\" mistake in months 1-2. I did the same thing - spent 6 weeks heads-down building before talking to anyone. Realized about 40% of what I built wasn't what anyone actually wanted.\n\nThe $0 CAC with 342 customers through pure organic is a strong case study for the \"distribution is as important as product\" lesson. Thanks for sharing the real numbers.",
          "score": 1,
          "created_utc": "2026-01-16 11:42:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxcl54",
          "author": "Local-Employ9800",
          "text": "Focusing this hard on churn that early is the real unlock here. Most people chase MRR screenshots and ignore the bucket leaking underneath, but your 2-month sprint on onboarding, support, and feature requests is exactly why the rest of the numbers make sense.\n\n\n\nYour path mirrors what worked for me: building in public on X, then doubling down on communities. For my SaaS, answering niche questions in subs and on Indie Hackers drove more signups than any cold email campaign. I pair that with tools like Hypefury for scheduling and Zapier for routing leads into my CRM, and lately Pulse for Reddit has been useful to track and jump into the right Reddit threads without spamming.\n\n\n\nIf you keep your “infinite runway” mindset and keep shipping in public while obsessing over retention, that $30K will feel like the small early chapter sooner than you think. Focusing on churn and distribution over flashy launches is the right move.",
          "score": 1,
          "created_utc": "2026-01-16 14:33:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzchu3",
          "author": "EmploymentProud3436",
          "text": "Really solid post. The churn reduction is the most impressive part here — a lot of founders keep chasing signups while the bucket’s leaking.\n\n\nAlso appreciate you calling out what didn’t work PH, ads, cold email. Way more useful than another “here’s my growth hack” thread. Thanks for sharing the numbers.",
          "score": 1,
          "created_utc": "2026-01-16 19:56:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01as7p",
          "author": "Willing_Builder4289",
          "text": "Solid execution. Getting churn from 12% to 5.8% in 2 months is no joke.Your focus and consistency is def rare. \n\nIf you don't mind what % of churn right now is silent churn vs explicit cancellations? That’s usually where SaaS at this stage bleeds without realizing",
          "score": 1,
          "created_utc": "2026-01-17 02:10:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qeptp1",
      "title": "How to do proper investor outreach for seed funding without a network (raised $4M doing this)",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qeptp1/how_to_do_proper_investor_outreach_for_seed/",
      "author": "dolm09",
      "created_utc": "2026-01-16 19:34:52",
      "score": 8,
      "num_comments": 10,
      "upvote_ratio": 0.91,
      "text": "Most advice about investor outreach assumes you already know the right people. Alumni networks, warm friends of friends, early angels who open doors. That was not my situation.\n\nI started fundraising as a first-time founder based in Europe, with zero VC relationships and no built-in credibility. No one was waiting for my deck. No one was forwarding my intro. If I wanted investor meetings, I had to create them from scratch.\n\nHowever, I managed to make it predictable by treating it as another sales funnel.\n\nAcross multiple rounds, I ended up having well over a hundred investor conversations. Most of them said no. That was expected. What mattered was that the process eventually produced momentum, and more importantly, it produced a small number of yeses.\n\nThe turning point came when I rebuilt my investor outreach around warm introductions that I could generate systematically, even without knowing a single investor personally.\n\nHere is what fundraising actually looked like in practice for me.\n\n* Pre-seed: around 70 investor conversations\n* Seed: around 175 investor conversations\n* Total passes: 166\n\nYou should expect at least 99 no’s before the first yes. That is normal and not a signal that you are doing something wrong.\n\nEarly on, I made every mistake possible.\n\n* Pitches were too long\n* I reached out to the wrong investors\n* There was no urgency\n* I let investors control timing\n\nNothing worked consistently until I reframed fundraising as a numbers game with strict process discipline. The biggest improvement did not come from a better deck or a tighter pitch. It came from changing who I contacted first.\n\nI stopped messaging investors directly and focused on **portfolio founders instead.**\n\nFor every VC fund I wanted to speak with, I followed the same steps.\n\n1. Go to the VC website\n2. Open the portfolio page\n3. Identify founders in or near my sector\n4. Connect with them on LinkedIn\n5. Ask for a quick video call to know about their experience with X investor\n\nFor each VC, I would reach out to about 15 portfolio founders, around 3 founders agreed to a short 15-minute chat, and one or two almost always offered a warm intro to their investor.\n\nThis made investor outreach repeatable and predictable.\n\nWhy this works?\n\nWhen an investor hears about your company from one of their own founders, you are no longer a random inbound.\n\nAnd you can pitch with a total different energy because the investor assumes there is existing momentum. You can play a game where they can start thinking that if they wait, the round might fill without them.\n\nThat shift in perception does more than traction alone ever did for me.\n\nOne of the biggest misconceptions about fundraising is that investors are purely driven by traction and numbers.\n\nUrgency beats raw traction more often than founders want to admit. If not, look at all the TechCrunch & LinkedIn cringe-posts where founders with a powerpoint slide raise a gazillion dollars.\n\nAlso, if you spread investor calls over months, nothing compounds. One call per week creates no momentum. Investors forget you.\n\nIf you compress conversations into a tight window, momentum builds naturally. Conversations reference each other. Interest compounds.\n\nThat is how rounds close.\n\nNow building something specifically to automate all this in case anyone is interested.\n\nHappy to answer questions!",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qeptp1/how_to_do_proper_investor_outreach_for_seed/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o02r1qc",
          "author": "Due-Philosopher-1426",
          "text": "Thanks for sharing. This seems helpful",
          "score": 2,
          "created_utc": "2026-01-17 08:49:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o03kt1r",
              "author": "dolm09",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-01-17 13:08:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o037oe5",
          "author": "wtstm",
          "text": "Thanks for sharing! Interesting perspective on compressing the conversations into a tight window. How do you achieve to schedule all these calls with founders and investors into a tight window? When do you start to prepare the founder introductions? That sounds like a lot of work",
          "score": 2,
          "created_utc": "2026-01-17 11:25:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o03jbtq",
              "author": "dolm09",
              "text": "It starts getting momentum after a couple of weeks. Think of it this way:\n\n1st week you reach out to a batch of founders.\n\n2nd week you start getting a decent amount of positive responses, so you start scheduling calls.\n\nSince founders are always busy, you don't probably jump on a call until 3rd week. Then you get some yeses.\n\n4th week you start getting intros.\n\nAfter the 4th week the batches start to overlap, so after that you are always getting a relevant volume of meetings with investors.\n\nIt's a lot of work, but knowing that only 1% of startups end up raising a round, seems like a reasonable effort.",
              "score": 2,
              "created_utc": "2026-01-17 12:58:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o086499",
          "author": "rt2828",
          "text": "Great idea!",
          "score": 2,
          "created_utc": "2026-01-18 03:08:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0a8e2t",
              "author": "dolm09",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-01-18 13:02:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o040e5j",
          "author": "KoumKoumBE",
          "text": "Very interesting! Thanks for sharing! I also assume that by choosing your founders well, you can automatically restrict your efforts to investors who are used to your niche?\n\nDid the founders feel proud of being contacted by you? (I mean: feeling important and successful enough that someone asks them for advice). When they were saying no, what was their reason, if you can tell?",
          "score": 1,
          "created_utc": "2026-01-17 14:38:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04h6mg",
              "author": "dolm09",
              "text": "Totally right on everything you said. Your goal when getting the call with the founder is to feed their ego since raising capital is super hard but at the same time very lonely. Your goal is also to build authority by sharing you achievements (capital raised in the past, your PHD, the product you've built, deals, user feedback, whatever works for you), so they feel they are sharing great dealflow with their investors.\n\nWhen they were saying no to make the intro, most of the time they were insecure stuck-ups that raised recently. It's okay, life happens, you just move on and keep reaching out to others.",
              "score": 2,
              "created_utc": "2026-01-17 16:02:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gqc2f",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-19 12:19:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gqc3y",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qeptp1/how_to_do_proper_investor_outreach_for_seed/o0gqc2f/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-19 12:19:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gqi1o",
          "author": "dolm09",
          "text": "In case anyone is interested the tool I'm building is EasyVC ai",
          "score": 1,
          "created_utc": "2026-01-19 12:20:32",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfk1em",
      "title": "Is anyone else nostalgic for the joy of random physical rewards?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qfk1em/is_anyone_else_nostalgic_for_the_joy_of_random/",
      "author": "sirdangc8k",
      "created_utc": "2026-01-17 17:59:15",
      "score": 7,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "Some of my best childhood memories came from opening treasure chests in RPGs, pulling collectible cards, or getting a surprise toy in a kids' meal. That element of surprise and tangible reward left a lasting impression.\n\nI’ve been thinking about how apps today are all digital points, badges, streaks; but rarely offer anything physical. What if an app could mail you a surprise gift after hitting a milestone, like earning points, gaining subscribers, or completing a challenge?\n\nHas anyone seen something like this done well? Do you think people would value a physical token for digital achievements? I’m exploring the idea and would love to hear your thoughts or creative use cases!\n\n*I’m working on a project related to this that ties software and a bunch of expensive manufacturing machines to do it all in house. And will be sharing the ride along journey with ya'll!*\n\n*I share a little more in this video* on my reddit profile\n\nLmk what you think 🙏",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qfk1em/is_anyone_else_nostalgic_for_the_joy_of_random/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o09z3b4",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 2,
          "created_utc": "2026-01-18 11:48:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p6f5b",
              "author": "sirdangc8k",
              "text": "I was talking to some friends the other day about getting physical copies of games that had a cool handbook and artwork insert; nowadays, you pay the same price but with none of that fun stuff.",
              "score": 1,
              "created_utc": "2026-01-20 17:19:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o05tfiw",
          "author": "simon_mo",
          "text": "Oh my god, like 10000 percent. They still do it in Japan and they do it really well!",
          "score": 1,
          "created_utc": "2026-01-17 19:48:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p6nra",
              "author": "sirdangc8k",
              "text": "Yes! We'll be in Japan to window shop for potential surprise gifts from independent artisans and artists.",
              "score": 1,
              "created_utc": "2026-01-20 17:20:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o05uaov",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-17 19:52:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05uar7",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qfk1em/is_anyone_else_nostalgic_for_the_joy_of_random/o05uaov/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-17 19:52:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o06137m",
          "author": "lkbngwtchd",
          "text": "Like youtube?",
          "score": 1,
          "created_utc": "2026-01-17 20:26:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o06hif5",
              "author": "SpottedOutpost",
              "text": "Yes like YouTube badges but for normal people / customer accounts",
              "score": 1,
              "created_utc": "2026-01-17 21:50:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0p63tp",
              "author": "sirdangc8k",
              "text": "Yes, this is a good example of what we can help streamline whether you want to reward your guests on a podcast or subscribers on your channel or app.\n\nhttps://preview.redd.it/g092b88cfjeg1.png?width=598&format=png&auto=webp&s=00bc9eb04abf9add6d23aafdf1875e6183de78c0",
              "score": 1,
              "created_utc": "2026-01-20 17:17:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o070bbb",
          "author": "NoCloutTy",
          "text": "This is cool, what kind of items do you have in mind?",
          "score": 1,
          "created_utc": "2026-01-17 23:25:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p5rop",
              "author": "sirdangc8k",
              "text": "My partner will be in Japan to shop for some fun gifts in a couple weeks. It'll be personalized and branded merch but always with some mystery items; for some recipients the products might be sourced from indie artisans.",
              "score": 2,
              "created_utc": "2026-01-20 17:16:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o07x7fi",
          "author": "kubrador",
          "text": "only thing that'll kill you is logistics and unit economics until you scale, so you better nail the manufacturing side hard or you're just paying to ship people $2 trinkets. but if you've got the machines in-house and figured out the math, you're already ten steps ahead of every other app trying this. go absolutely bonkers with it.",
          "score": 1,
          "created_utc": "2026-01-18 02:19:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p77ow",
              "author": "sirdangc8k",
              "text": "https://preview.redd.it/to10vmt3gjeg1.jpeg?width=680&format=pjpg&auto=webp&s=eaa953d6e54aab2d738817a50aade7e6cc556f6b\n\nThat was the initial headache! I've been shopping for used machines (and some new) to nail the logistics by building everything in-house, at least as much as we can. I figure when AI comes along, having manufacturing in-house might make us less replaceable? Knock on wood",
              "score": 1,
              "created_utc": "2026-01-20 17:22:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0851hi",
          "author": "trainmindfully",
          "text": "the nostalgia is real, but the hard part isn’t the idea, it’s the economics and logistics once novelty fades. physical rewards feel magical at first, then users start anchoring on cost, delays, and consistency. most attempts i’ve seen die when shipping friction eats margins or expectations spike. i’d be curious how you think this stays special past the first few milestones without turning into a fulfillment business.",
          "score": 1,
          "created_utc": "2026-01-18 03:02:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p8smb",
              "author": "sirdangc8k",
              "text": "Absolutely! We have some ideas but milestones shouldn't be easy to achieve. For example, YouTube has the Bronze, Gold, DIamond rewarded to channels with 100K, 1M, 10M subscribers; and each is a grind to get to. So the Milestone Rewards shouldn't be handed out freely; as we are not a gifting company for onboarding, etc; we can be, but our focus is on celebrating achievements when your user sells their startup  for $100,000+ (or total revenue of startups sold) on your platform or generates and closed their first X leads worth of $ amount. But at the end of the day, you pick the milestone, we provide the 1-line of code to automate the physical rewards.",
              "score": 2,
              "created_utc": "2026-01-20 17:30:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qh1c96",
      "title": "how to manage tours while keeping up with marketing?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qh1c96/how_to_manage_tours_while_keeping_up_with/",
      "author": "TurnoverEmergency352",
      "created_utc": "2026-01-19 11:06:19",
      "score": 7,
      "num_comments": 13,
      "upvote_ratio": 0.89,
      "text": "anyone else spending more time marketing than actually running their tours? i feel like i am constantly juggling social media posts, emails, ads, and trying to get new bookings, and its starting to take over my day to day.\n\ni love running my tours and meeting guests, but half my time is spent on instagram, facebook, email campaigns, updating listings, responding to inquiries… and it never seems to end. It’s like the marketing side is a full time job on top of the tours themselves.\n\nwould love to hear how other tour operators manage this balance. do you have any tips, tools, or hacks for keeping marketing under control while still enjoying running your tours?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qh1c96/how_to_manage_tours_while_keeping_up_with/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0gxvvc",
          "author": "DesignThinker_",
          "text": "This is a super common pain and honestly a sign that you are doing a lot right already. The trap most operators fall into is trying to market like a brand instead of like a tour business.   \n  \nWhat tends to work better is narrowing hard while identifying the 1–2 channels that actually drive bookings (for many it’s Google + Instagram or OTAs) and let the rest go without guilt.   \n  \nBatch everything and one short block a week to schedule posts, reply templates for DMs and inquiries, and reuse guest photos, reviews, and stories everywhere instead of creating new content each time.   \n  \nIf you can automate emails, confirmations and basic questions marketing stops feeling like a daily drain and becomes a background system which gives you your time and enjoyment back.",
          "score": 3,
          "created_utc": "2026-01-19 13:11:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0isyfx",
          "author": "AdBusy7153",
          "text": "batch create",
          "score": 2,
          "created_utc": "2026-01-19 18:35:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kqs22",
          "author": "ArtemLocal",
          "text": "This is very real for tour operators. Marketing quietly becomes a second job. What helps is narrowing channels instead of feeding everything. One primary acquisition source, usually Google listings or OTAs, then one retention channel like email. Social can be batched once a week or even biweekly. A lot of operators also separate always on assets like reviews, listings, and automated emails from active marketing so only one thing needs daily attention. Which channel actually brings most of your bookings right now?",
          "score": 2,
          "created_utc": "2026-01-20 00:15:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gkbqg",
          "author": "Puzzleheaded_Swim385",
          "text": "tourradar makes it look easy but behind the scenes its just emails and reels, feel like you losing touch with the fun part yet?",
          "score": 1,
          "created_utc": "2026-01-19 11:30:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gkbug",
          "author": "Wide_Brief3025",
          "text": "Batching your marketing tasks a few times a week instead of spreading them out daily can help a ton. Also, automating responses or using templates saves time with inquiries. For finding leads without getting sucked into every conversation, I’ve started using ParseStream which sends notifications only for high quality mentions so I stay focused on running tours. Balancing both gets much easier when you cut out the noise.",
          "score": 1,
          "created_utc": "2026-01-19 11:30:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gl097",
          "author": "Potential_Force_4136",
          "text": "yep, feels like the tours are the side job now.",
          "score": 1,
          "created_utc": "2026-01-19 11:36:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gm0be",
          "author": "Brilliant_Candle5450",
          "text": "its weird, i signed up for airbnb experiences thinking it would be all about sharing cool spots, but most days im just glued to my laptop trying to boost bookings.",
          "score": 1,
          "created_utc": "2026-01-19 11:44:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gn5kg",
          "author": "These_Run_7070",
          "text": "how do you keep your passion for the actual tours when your brain is just full of marketing tasks?",
          "score": 1,
          "created_utc": "2026-01-19 11:54:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kehgb",
          "author": "kubrador",
          "text": "hire someone part-time to handle social media before you burn out and start resenting the tours themselves. you're basically running two businesses and wondering why you're exhausted.",
          "score": 1,
          "created_utc": "2026-01-19 23:09:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pn3zp",
          "author": "Longjumping-Check-76",
          "text": "Marketing can easily eat up tour operators' time. Consider using automation tools like scheduling software and social media management platforms to streamline your workflow, and block specific hours for marketing tasks to maintain focus on tour operations.",
          "score": 1,
          "created_utc": "2026-01-20 18:35:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qxhq7",
          "author": "erickrealz",
          "text": "You're spreading yourself too thin trying to be everywhere at once. Most tour operators waste time on low-ROI channels like constant Instagram posts when email and review management would bring way more bookings.\n\nBatch your social content once a week using scheduling tools like Buffer or Later. Spend 2 hours on Sunday creating a week's worth of posts, schedule them all, then ignore social media the rest of the week unless someone DMs you directly. Our clients in similar local businesses see zero difference in bookings whether they post daily or 3 times weekly, so stop burning hours on it.\n\nFor emails, set up automated sequences for inquiry followups, post-tour review requests, and past customer re-engagement. Most booking platforms have this built in or you can use something cheap like Mailchimp. That handles 80% of your email marketing without daily effort.\n\nReal talk, if marketing is taking half your day, you're doing shit that doesn't matter. Focus on getting more reviews, optimizing your booking page for conversions, and maybe running targeted ads to your local area. Cut everything else until you've got capacity to hire someone part-time to handle the busy work.",
          "score": 1,
          "created_utc": "2026-01-20 22:08:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zstfo",
              "author": "jkbruhhehe",
              "text": "Yeah, I’ve been there. I started batching marketing tasks instead of doing them daily, and using Gmbapi to manage social, Google Business Profile, and emails made it way more manageable. Honestly, just seeing all the data in one dashboard saved so much mental load.",
              "score": 1,
              "created_utc": "2026-01-22 04:59:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qezl7m",
      "title": "Building a mobile app is easy. Getting users is not.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qezl7m/building_a_mobile_app_is_easy_getting_users_is_not/",
      "author": "Vanilla-Green",
      "created_utc": "2026-01-17 01:43:50",
      "score": 7,
      "num_comments": 17,
      "upvote_ratio": 0.89,
      "text": "I am building Zavi, an Android voice keyboard app that turns raw voice to polished text in every app and trying to figure out what actually works for early growth.\n\nWhat got you your first 100 users\n\nWhat looked promising but was a complete waste of time\n\nNot interested in theory or growth hacks.\n\nOnly things you would do again if starting from zero today.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qezl7m/building_a_mobile_app_is_easy_getting_users_is_not/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o02dgrh",
          "author": "OneHunt5428",
          "text": "best way is to find a small specific online community where people are already complaining about the problem you solve. just jump in offer genuine help and share your thing naturally when it fits",
          "score": 4,
          "created_utc": "2026-01-17 06:45:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02noeq",
          "author": "rdpl_",
          "text": "already your description is weak, do not just tell what it is but why is it better than the current solutions and why tf did you develop it if there dozen other solutions which are good enough\n\nfwiw, getting user is only hard for an app that nobody needs",
          "score": 3,
          "created_utc": "2026-01-17 08:17:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02ovzi",
              "author": "Vanilla-Green",
              "text": "But this solution people do need",
              "score": -1,
              "created_utc": "2026-01-17 08:29:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o02pk2w",
                  "author": "rdpl_",
                  "text": "no, bc, even after having you asked you are not able to answer why your solution is better than existing solutions\n\nif you are not able to articulate the most basic things how would you be able to build an app with the right feature set? \n\nthis is a waste of time of everyone, sry",
                  "score": 1,
                  "created_utc": "2026-01-17 08:35:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o03dvgk",
          "author": "AnonJian",
          "text": "You get first users in the research phase everybody jettisons to crap something out market-blind. That is not a secret or growth hack, it is supply and demand. Only supply does not obligate demand to manifest automagically.\n\nPeople post to ask how to find complete strangers they don't understand so never could have developed a product for. Abusing the word \"user\" only serves to confuse them. You are not owed users, zero is an option.",
          "score": 2,
          "created_utc": "2026-01-17 12:17:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o073ys4",
          "author": "AtmosphereNo9845",
          "text": "Personally posted videos of myself on TikTok. Looked up videos that were easy to copy and had already gone viral on Peerwatch, and just replicated them. Had like 8 accounts on 1 device and kept posting 1 time on each account a day.",
          "score": 2,
          "created_utc": "2026-01-17 23:44:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08kxgq",
          "author": "kubrador",
          "text": "the first 100 came from me spamming it in relevant discord servers and one reddit comment that blew up. literally nothing else moved the needle.\n\nspent 3 months on seo and content marketing thinking it'd be passive gold. wrote like 15 articles. got maybe 5 users total. complete ghost town.\n\nif i started over i'd just cold dm people in communities actually using voice-to-text apps (transcription discord servers, reddit threads about accessibility, youtube comment sections of similar products). sounds cringe but it converts way better than anything automated.\n\nthe real thing that finally worked was getting one youtuber to demo it casually and just... asking their audience for feedback in the replies. that's it.",
          "score": 2,
          "created_utc": "2026-01-18 04:37:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o08lwjw",
              "author": "Vanilla-Green",
              "text": "Great can you share the the relevant discords please",
              "score": 1,
              "created_utc": "2026-01-18 04:44:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o02tgk5",
          "author": "trainmindfully",
          "text": "getting the first users usually comes from one narrow use case, not the app’s full vision. early on, what works is finding people who already feel the pain badly enough to tolerate rough edges and reaching them where they already complain about it. what wastes time is broad launch posts, generic communities, or anything that assumes people want to try a new app without a strong trigger. i would do direct problem driven outreach again, even if it feels unscalable at first, because it teaches you who actually cares. once you know that, growth channels become clearer instead of theoretical.",
          "score": 1,
          "created_utc": "2026-01-17 09:12:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qf2odo",
      "title": "I can't find good leads.. even with a good amount of skill and expereince",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qf2odo/i_cant_find_good_leads_even_with_a_good_amount_of/",
      "author": "hail596",
      "created_utc": "2026-01-17 03:49:10",
      "score": 7,
      "num_comments": 24,
      "upvote_ratio": 0.89,
      "text": "A bit of context on what I do - I run an Operations Management Service Agency, and what we specialize in is finding solutions to backend problems that can be done remotely. On the surface level, it can be Customer Support, Virtual Assistant, etc.  We go deeper into CRM's, Project Management. My team creates SOPs around the role to train the team and solidify the process. \n\nHowever, after Three Employees, I have realized that I charge way less than what I should, but I can't let go of the current business since I have to meet payrolls and living expenses. The only way I see out of this is by getting good leads. Yet, I see these freelancing platforms being oversaturated, and one-time projects don't work for me. I like to build relationships with the client and work on retainer. \n\nAll the Seasoned Entrepenuers help this newbie out please. ",
      "is_original_content": false,
      "link_flair_text": "Collaboration Requests",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qf2odo/i_cant_find_good_leads_even_with_a_good_amount_of/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o02028y",
          "author": "Genflos",
          "text": "What is your existing marketing channels? Current pitch? Current lead qualification requirements? \n\nSince your title states “skilled & experienced”whilst in the text you seek seasoned people to help a newbie out, what is the skills and exp which you’re actually referring to?",
          "score": 1,
          "created_utc": "2026-01-17 04:58:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o021yil",
              "author": "hail596",
              "text": "I have none, you can say I got lucky to have found my clients through discord and Reddict took me almost a year to convert them by constant follow ups. My skills and experinence lies in what I do. Creating SOPs, systems, and executing on them. \n\nFor the past few months I had been focusing on the work itself, now I have realized that I need to grow atleast to a point where 1 - 2 clients leaving doesn't hurt me",
              "score": 1,
              "created_utc": "2026-01-17 05:12:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o023p8b",
          "author": "ExpressAdvisor3692",
          "text": "I’m guessing this post is just trying to promote your services. Probably won’t work very well since it barely makes any sense. \n\nWhat do your employees do? You need to figure out your lead gen strategy and the someone needs to be doing sales while others do the work to fulfill the service. \n\nThat’s how agencies work. If you don’t know this, you don’t have an agency.",
          "score": 1,
          "created_utc": "2026-01-17 05:24:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o024a6d",
              "author": "hail596",
              "text": "My employees work on providing the service, but I am too heavily involved. I know how lead gen works. The thing I am looking for is crafting a strategy for it",
              "score": 1,
              "created_utc": "2026-01-17 05:29:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0341tx",
          "author": "kubrador",
          "text": "you're charging too little because you haven't found clients who actually value the work, which is a lead problem disguised as a pricing problem. freelance platforms are dead for retainer work anyway.\n\nstop fishing in the saturated pond. go find where your ideal clients actually hang out. if you're solving backend ops for growing businesses, they're probably in slack communities, facebook groups for \\[their industry\\], linkedin where they're posting about scaling, maybe in cohorts for business owners. you need to network directly with people who already understand why ops systems matter, not convince randos on upwork that your sop-building is worth something.\n\nyour best lead right now is probably asking your three current clients \"who else do you know that complains about this exact problem\" and actually following up on it. referrals from people who've seen the work beat cold outreach 100 times over.",
          "score": 1,
          "created_utc": "2026-01-17 10:51:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03auig",
          "author": "wildgrass56",
          "text": "sounds like you need a better lead gen system rather than relying on freelance platforms. I've heard people have good results with for finding higher quality B2B leads, might be worth checking out since you're looking for retainer clients not one-off projects.\n\nalso just a thought, but if you're undercharging you could gradually raise rates for new clients while keeping existing ones at thier current rate until you build up enough revenue to transition away from the lower paying work.",
          "score": 1,
          "created_utc": "2026-01-17 11:52:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05knyu",
          "author": "RoundRockBusiness",
          "text": "You’re definitely not alone in this a lot of service businesses hit this exact wall once payroll becomes real.\nUnderpricing early makes sense when you’re just trying to get traction, but it gets painful fast when the business depends on volume instead of margin.\n\nOne thing I’ve noticed (and struggled with myself) is that the issue usually isn’t the work or even demand it’s that the offer ends up being framed like “extra help” instead of “core operations.” When clients see it as optional, pricing pressure never goes away.\nI’m curious when you’re talking to prospects now, what do they usually say yes to first? Is it support tasks, systems cleanup, or something else? That answer usually points to where pricing power actually lives.",
          "score": 1,
          "created_utc": "2026-01-17 19:06:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07moof",
          "author": "Remarkable_Guava942",
          "text": "Most people stuck at zero clients usually have one of three problems:\n\t1.\tThe offer is unclear\n\t2.\tThe outreach message has no hook\n\t3.\tThey’re talking to the wrong audience\n\nIf you want, tell me what you’re selling and how you’ve tried getting clients — I’ll point out the exact issue.",
          "score": 1,
          "created_utc": "2026-01-18 01:22:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o07ulsr",
              "author": "hail596",
              "text": "I did explain in private dms",
              "score": 1,
              "created_utc": "2026-01-18 02:04:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o08phh2",
                  "author": "Remarkable_Guava942",
                  "text": "yes dm me",
                  "score": 1,
                  "created_utc": "2026-01-18 05:09:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o08zjzt",
              "author": "Dizzy-Criticism-7836",
              "text": "Main thing: you’re probably selling “operations help” instead of a specific business outcome. Reframe your offer as “we cut refund tickets 30%” or “we ship every order in 24h without extra headcount,” then only target businesses clearly feeling that pain. I use Apollo and Clay to find those signals and scrape language from Reddit/Quora via Pulse alongside LinkedIn posts so my outreach copy mirrors how those buyers actually talk.",
              "score": 1,
              "created_utc": "2026-01-18 06:26:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0963ae",
                  "author": "Wide_Brief3025",
                  "text": "Focusing on outcome based messaging definitely works better, especially if you reflect the exact phrases your audience uses. To speed up surfacing those buyer signals, you might want to try tools like ParseStream that send instant alerts for keywords and filter for high intent posts. It can save a lot of time so you do not have to manually watch every Reddit thread.",
                  "score": 1,
                  "created_utc": "2026-01-18 07:23:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0aaylg",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-18 13:19:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0acexy",
              "author": "hail596",
              "text": "Thank you so much that makes a lot of sense. I appreciate the feedback",
              "score": 1,
              "created_utc": "2026-01-18 13:29:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0bt144",
          "author": "Freelance_Ai",
          "text": "This is actually very common, even with skilled agencies.\n\nFrom what I’ve seen, the issue is rarely the service quality — it’s usually:\n- unclear ICP\n- weak positioning\n- or chasing leads in the wrong channels\n\nI’ve been helping founders test alternative lead channels (Reddit, outbound targeting, tighter niches) instead of generic cold outreach.\n\nIf you’re open, I’d be happy to look at your current approach and share a few concrete ideas. No pitch.",
          "score": 1,
          "created_utc": "2026-01-18 17:56:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bzff2",
          "author": "medazizln",
          "text": "Freelance platforms are basically a trap for ops agencies because clients go there looking for cheap labor, not actual systems. If you want retainers, you have to stop waiting for inbound and start picking the exact companies you want to work with. The pricing problem solves itself when you target founders who are actively drowning in chaos rather than people looking for a $5/hour VA. You need to control the channel.",
          "score": 1,
          "created_utc": "2026-01-18 18:26:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0diyzj",
          "author": "shazej",
          "text": "You’re not struggling because you lack skill. You’re stuck in the hardest phase most service agencies hit underpriced retainers plus payroll pressure.\n\nIn my experience the issue usually isn’t “finding leads” but who you’re talking to. Ops services sell best when the pain is already obvious founders who feel buried scaling teams or businesses post-hire where things are breaking.\n\nFreelance platforms push you into price competition and one-off work which fights your retainer model. Relationships tend to come more from referrals partnerships or being visible where operators already complain about ops problems.\n\nIt’s slow at first but one aligned client can be worth more than ten random leads.",
          "score": 1,
          "created_utc": "2026-01-18 22:58:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0sz95f",
          "author": "Drumroll-PH",
          "text": "Recommend you google “how to create an evergreen cold email campaign“ and read a couple articles on this topic\n\nBest performing campaign type, so if you can’t get good leads, this will help",
          "score": 1,
          "created_utc": "2026-01-21 05:12:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yb4i9",
          "author": "PumpkinBudget4276",
          "text": "Finding quality leads on platforms like Reddit can be challenging manually. Using an AI tool that monitors relevant discussion for your services might be quite helpful.",
          "score": 1,
          "created_utc": "2026-01-21 23:47:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0yk3uv",
              "author": "Wide_Brief3025",
              "text": "Focusing on niche subreddits and setting up alerts for keywords can help you catch relevant conversations without getting overwhelmed. If you want something that automates the process and uses AI to filter out low quality leads, ParseStream is pretty solid for surfacing high value opportunities so you can spend more time engaging and less time sifting through endless threads.",
              "score": 1,
              "created_utc": "2026-01-22 00:35:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qjogpv",
      "title": "Considering outside financial help as the business grows",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qjogpv/considering_outside_financial_help_as_the/",
      "author": "Chirag_koshti",
      "created_utc": "2026-01-22 07:46:31",
      "score": 7,
      "num_comments": 5,
      "upvote_ratio": 0.9,
      "text": "I am running a growing business and financial tasks are taking more time than before. Managing cash flow, budgeting, and tracking numbers is becoming harder to handle alone.\n\nI am thinking about getting outside help instead of managing everything myself. I want to understand how this worked for others at a similar stage.\n\nIf you have been through this phase, what worked for you and what would you do differently?",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qjogpv/considering_outside_financial_help_as_the/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o10j40i",
          "author": "Eastern-Lock-4109",
          "text": "Hiring a qualified person for this will definitely help more than going to an agency, and that is what we did too. But if costs are a big factor, then maybe try outsourcing all the management. There are a lot of financial management businesses and agencies that are just a quick google search away, you just have to choose which of these two options is for you.",
          "score": 1,
          "created_utc": "2026-01-22 08:37:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10n5uv",
          "author": "kubrador",
          "text": "hiring a bookkeeper is like finally admitting you're too busy being successful to stay broke, which is objectively a win.\n\nmost people wait until their finances look like a crime scene before getting help, so you're already ahead. start with a part-time bookkeeper or fractional cfo and don't overthink it. if you're asking this question you probably need it yesterday.",
          "score": 1,
          "created_utc": "2026-01-22 09:15:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11blvl",
          "author": "Willing-Training1020",
          "text": "yeah this is super common once you hit a certain growth stage — financial stuff just compounds and suddenly you're spending hours on things that aren't actually moving the business forward. what worked for me was hiring a remote ops/finance person to handle the day-to-day stuff (bookkeeping, cash flow tracking, invoicing, basic reporting) while i focused on higher-level decisions. ended up going with someone from the philippines through a recruiting firm — way more affordable than a local hire and honestly the quality was great. freed up a ton of mental bandwidth. if i could do it differently, i'd have done it sooner tbh. the longer you wait, the messier the books get lol. are you thinking fractional cfo type help or more like a bookkeeper/ops assistant?",
          "score": 1,
          "created_utc": "2026-01-22 12:38:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11fuef",
          "author": "Vaibhav_codes",
          "text": "Bringing in an accountant or part time CFO early was a game changer for us  It freed up my time, improved cash flow visibility, and helped avoid costly mistakes Definitely worth it",
          "score": 1,
          "created_utc": "2026-01-22 13:04:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11may5",
          "author": "Possible_Adagio_3074",
          "text": "Whats your current annual revenue, industry and financial challenges?",
          "score": 1,
          "created_utc": "2026-01-22 13:41:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qe0cko",
      "title": "Finding the best b2b lead gen agency for a seed-stage startup.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qe0cko/finding_the_best_b2b_lead_gen_agency_for_a/",
      "author": "im04p",
      "created_utc": "2026-01-16 00:02:56",
      "score": 6,
      "num_comments": 19,
      "upvote_ratio": 0.88,
      "text": " We have a very limited burn rate, so we need to be incredibly efficient with our sales spend. I’m looking for the best b2b lead gen agency that specializes in zero to one growth. Most of the agencies I see want to work with established companies that already have 10+ sales reps. We just need someone to help us book our first 20-30 discovery calls so we can validate our messaging. Are there any startup-friendly agencies that offer flexible pricing or smaller pilot programs? I’d love to find a partner that is as scrappy as we are.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qe0cko/finding_the_best_b2b_lead_gen_agency_for_a/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nztwapj",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-16 00:22:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nztwarx",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qe0cko/finding_the_best_b2b_lead_gen_agency_for_a/nztwapj/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-16 00:22:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzubr0i",
          "author": "Monkeyboogaloo",
          "text": "As an ex agency owner I totally understand why they all wqw would want to work with bigger clients. \n\nIf you want to have a chat about ways to do it scrappy and in budget I can give you some ideas.\n\nWhats the product/servicc and who is your icp?",
          "score": 1,
          "created_utc": "2026-01-16 01:47:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzujm67",
          "author": "Nightlow21",
          "text": "Setting up lead gen ads is relatively simple. When you have lower spend you need to be very niche and specific. Costs will be higher but that’s how you’ll get traction. All the best practices out there are to go broad and do ROS to figure out what works and that’s great and all of you have the budget, time and analysis to do so. \n\nIf you are trying to gain clients organically that will be tougher but also doable.",
          "score": 1,
          "created_utc": "2026-01-16 02:31:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvh5cr",
          "author": "bravelogitex",
          "text": "you should be doing this yourself. just use linked helper + clay + maybe openphone if cold calling works.",
          "score": 1,
          "created_utc": "2026-01-16 06:03:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzz54io",
          "author": "KoumKoumBE",
          "text": "Sorry for the maybe naive answer, but why not LinkedIn Ads with its Lead Gen form?\n\nI used LinkedIn ads to recruit testers for my product (in-person). I'm very happy with how it went, and it turns out that it also attracted secondary attention. 2 investors visited my company page, and a news agency contacted me because they saw the ad.\n\nThe weird thing is that the ad was very generic, such as not to \"pre-seed\" the testers with information on the product. It was a simple \"Test a new \\[product family\\] in \\[city\\]\".\n\nFor LinkedIn ads, again from my limited experience, it seems that images and carousel images work better than videos. If you are tight on budget, vision LLMs (ChatGPT does it) are quite useful to review ads that you make yourself. Just upload your ad as a not-too-large file, tell the LLM what person it should be (\"A LinkedIn user, junior to manager in \\[city\\], working in an office\"), then ask it to describe all the feelings it has by looking at the image.\n\nExpect a cost per lead of about $30 if the targetting is correct and the ad looks nice.",
          "score": 1,
          "created_utc": "2026-01-16 19:22:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzz5jnk",
          "author": "Futuristic-D",
          "text": "What kind of solution do you offer?",
          "score": 1,
          "created_utc": "2026-01-16 19:24:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o004c58",
          "author": "erickrealz",
          "text": "The honest advice you probably don't want to hear: at seed stage trying to validate messaging, you shouldn't outsource this. The discovery calls are where you learn what resonates, what objections come up, and how to position your product. Handing that to an agency means they learn instead of you.\n\nOur clients who outsourced outbound before finding product-market fit usually wasted money and time. The agency books calls but the messaging is wrong, so the calls don't convert, so you don't know if it's bad leads or bad positioning or bad product. The feedback loop breaks when there's a middleman.\n\nThe 20-30 discovery calls for messaging validation is maybe two weeks of focused founder outbound. LinkedIn outreach to your ICP, personalized emails, maybe some warm intros from investors. It's uncomfortable if you're not a natural salesperson but the learning is irreplaceable.\n\nIf you absolutely need agency help, look for freelancers or tiny shops rather than agencies. A solo operator who does cold email setup and sends on your behalf for $1-2k monthly is more startup-appropriate than an agency with minimums designed for funded companies. The \"pilot program\" agencies advertise is often just a shorter commitment at the same monthly rate.\n\nThe scrappy partner you're looking for is probably a fractional SDR or a freelancer, not an agency with a sales team to feed.",
          "score": 1,
          "created_utc": "2026-01-16 22:08:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00cmmo",
          "author": "CoffeeAndWins",
          "text": "You should check out BOSS Assistants based out of Canada, they are start up friendly with low monthly costs and they are super targeted/intentional about who they reach out to so they don't fill your calendar with wrong fit leads",
          "score": 1,
          "created_utc": "2026-01-16 22:49:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00v17v",
          "author": "AcanthisittaNo6174",
          "text": "Happy to help. I’ve been in tech sales as a VP for years. Can offer guidance and advice bc I love seeing growing companies succeed. If you need recruitment help I strongly believe this is the most important moment to have the best sellers otherwise meetings booked are pointless dm me if interested",
          "score": 1,
          "created_utc": "2026-01-17 00:32:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09r54h",
          "author": "selfyze_co",
          "text": "Most agencies want established companies because it’s easier. But seed-stage is actually where good outbound makes the biggest difference - you can validate your messaging fast and get to 20-30 calls in a few weeks.\nThe key is finding someone who’ll set it up properly from day 1 (infrastructure, targeting, sequences) rather than just throwing emails at a wall. Happy to share what’s working if useful.",
          "score": 1,
          "created_utc": "2026-01-18 10:37:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09s433",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-18 10:46:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o09s448",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qe0cko/finding_the_best_b2b_lead_gen_agency_for_a/o09s433/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-18 10:46:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0fymp6",
          "author": "Alone-Arm-7630",
          "text": "I’d definitely look into OutreachBloom. They are specifically geared toward early-stage B2B growth and offer the kind of smaller, flexible pilot programs you're looking for. It’s a solid way to get those initial meetings without blowing your entire budget.",
          "score": 1,
          "created_utc": "2026-01-19 08:09:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kjieq",
          "author": "cole-interteam",
          "text": "I totally get the burn rate concern. For a seed-stage startup, I’d look for a B2B paid search agency with case studies in your deal size, senior people actually running the account, a clear testing/reporting cadence, and a short pilot instead of a long contract.\n\nThat’s how we run things at my agency, and  I even put together a short checklist for vetting agencies on those points. If you want, I’m happy to DM the criteria I use.",
          "score": 1,
          "created_utc": "2026-01-19 23:36:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ng1h7",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-20 11:42:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ng1ih",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qe0cko/finding_the_best_b2b_lead_gen_agency_for_a/o0ng1h7/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-20 11:42:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ni5a3",
          "author": "Clear_Dig_9503",
          "text": "Hi, I’m a product marketer with 11+ years of experience working with Seed to Series A startups. I help founders nail positioning and messaging to connect with the right audience and book those crucial early discovery calls. I run Kyndrev, a product marketing agency for seed to Series A startups.\n\nHappy to chat!",
          "score": 1,
          "created_utc": "2026-01-20 11:58:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgicbk",
      "title": "From time to time, a few people would say my app is cool, but growth of the app is also slow. What should I do?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qgicbk/from_time_to_time_a_few_people_would_say_my_app/",
      "author": "Content_Complex_8080",
      "created_utc": "2026-01-18 19:47:24",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I have developed an app that : let users set a goal, then AI automatically generates an action plan, fetch the most relevant videos and books as support resources and evaluate how much a user's action can contribute to their goals. Even though there are people say they are interested and believe this is cool, the growth of my app is also very slow too. It seems like I don't have product market fit yet. Does anyone have suggestions? How do I know what to do next? Thank you!",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qgicbk/from_time_to_time_a_few_people_would_say_my_app/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0cnibq",
          "author": "Fine-Leader391",
          "text": "Running small experiments with messaging and channels can help reveal where your potential customers are. Lastly, validating the problem and solution hypothesis directly through conversations can save time before scaling efforts.\n\nI created a free tool to scan suitable Reddit subreddits to see where my potential customers are hanging out.",
          "score": 1,
          "created_utc": "2026-01-18 20:19:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gbi80",
          "author": "AnonJian",
          "text": "Sounds like you never used it on your own venture in a situation it was designed for. You so belong here. \n\nRead \"The Mom Test: How to talk to customers & learn if your business is a good idea when everyone is lying to you.\" Because everyone is lying to you, especially you.",
          "score": 1,
          "created_utc": "2026-01-19 10:11:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ivm8l",
              "author": "Content_Complex_8080",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-01-19 18:47:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gpmyk",
          "author": "2kdarki",
          "text": "Maybe it's because nobody knows about it. What's it even called? Where do I find it",
          "score": 1,
          "created_utc": "2026-01-19 12:13:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdxuhq",
      "title": "At what point does 'just hire a freelancer' stop making sense?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qdxuhq/at_what_point_does_just_hire_a_freelancer_stop/",
      "author": "MousseFar1291",
      "created_utc": "2026-01-15 22:23:23",
      "score": 6,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "We started lean like everyone else - one freelancer for design, one for paid ads, another for SE⁤O. It worked... until it didn't. Suddenly I was managing five people, aligning timelines, reviewing work, and still doing my actual job.\n\nHiring in-house feels expensive and risky if you're not 100% sure about long-term needs. Agencies feel heavy and overkill for certain projects. Freelancers are flexible, but coordination becomes a full-time job once things grow.\n\nFor those who've been through this: where did you draw the line? What made you switch from freelancers to agency or freelancers to in-house? And how did you avoid overcorrecting?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qdxuhq/at_what_point_does_just_hire_a_freelancer_stop/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzu9p56",
          "author": "NoCloutTy",
          "text": "More structure is what you need. Not sure what your size is but I know and have been involved with multi million dollar brands doing the following. Central place to keep things flowing, so even if a freelancer isn't on a project now - they can see whats going on. Most have whatsapp group with everyone. Then you can keep them moving with work when needed. If it's understood that they are freelance only, its easy enough to keep in contact and keep them in the loop even if thats some sort of a base retainer (something small) just to keep them on board. Then pay out projects on top of that. Keep costs to only as needed, but still have the people you know do good work on board.",
          "score": 3,
          "created_utc": "2026-01-16 01:36:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzuk9t9",
          "author": "Nightlow21",
          "text": "Are you micromanaging them or letting them do what they were hired to do?",
          "score": 1,
          "created_utc": "2026-01-16 02:35:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvlsfi",
          "author": "Due-Difficulty-4339",
          "text": "The line is when “managing the helpers” starts stealing more energy than the work itself. If your calendar is full of sync calls, fixing inconsistent brand voice, and chasing deadlines, you’re already past it.\n\n\n\nWhat worked for me was mapping work into two buckets: core (brand, strategy, funnels, analytics) and modular (landing pages, ad creatives, blog posts). Core goes in-house or to a long-term part‑timer; modular stays with tightly scoped freelancers. Then I added a fractional CMO / marketing lead for 5–10 hours a week to own the brief, QA, and coordination so I wasn’t the bottleneck.\n\n\n\nFor bigger pushes (product launch, rebrand), I’ll spin up a small specialist agency like Growth Machine for SEO or a Meta/Google ads shop, then back down to freelancers for maintenance. Tools like Notion and Asana help keep everyone honest, and I’ve used things like Hootsuite and Ahrefs alongside Pulse for Reddit to spot key threads, test offers, and feed insights back into the briefs.\n\n\n\nBottom line: once coordination is its own job, you need either a lead or a core team, not more freelancers.",
          "score": 1,
          "created_utc": "2026-01-16 06:40:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwowen",
          "author": "Classic-Bat-2920",
          "text": "For us, it wasnt the cost that became the breaking point - it was cognitive load. Managing multiple freelancers sounds cheap until you realize you've become a part-time project manager. Context switching, re-explaining strategy, chasing deadlines... it adds up fast.\n\n\nWe eventually moved some work to an agency not because they were \"better,\" but because they owned coordination. One point of contact, shared accountability, and clearer delivery. Tools like So⁤rtlist helped shortlist agencies that were used to stepping into that role, rather than just doing tasks.",
          "score": 1,
          "created_utc": "2026-01-16 12:17:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwp0xv",
          "author": "calimakikyle",
          "text": "We've been us⁤ing agency marketplaces like Sortlist to help with this. Since freelancers can be short-term, us⁤ing an agency marketplace can help you seek agencies that are built for long-term partnerships vs short project bursts. That helped us avoid hiring a 10-person agency when we really needed a 2-3 person pod.\n\nIn-house only made sense for us once the work became predictable. Before that, we kept hiring specialists for spikes of work and then wondering why utilization dropped. Agencies absorb that variability much better - especially when you're still experimenting with channels.",
          "score": 1,
          "created_utc": "2026-01-16 12:18:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06lgew",
          "author": "normie_raushan",
          "text": "There's also an emotional side to this. Founders often default to freelancers because it feels lighter and reversible. But once growth kicks in, that setup quietly creates bottlenecks.\n\nOur rule of thumb now, Freelancers are for execution-heavy, well-defined tasks. Agencies for strategy + coordination when scope gets messy. And in-house talent for once the channel is proven and stable. \n\nUsing Sort⁤list didn't make the decision for us, but it helped us see which option we were actually evaluating - instead of lumping everyone into the same bucket.",
          "score": 1,
          "created_utc": "2026-01-17 22:10:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06u4aa",
          "author": "KaleidoscopeFar6955",
          "text": "When you’re spending more time managing freelancers than doing the work, “just hire a freelancer” stops being the cheap option.",
          "score": 1,
          "created_utc": "2026-01-17 22:53:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06u58x",
          "author": "Rough-Dragonfly-1898",
          "text": "For me the tipping point was when I had 3+ freelancers + overlapping deadlines. Suddenly I was basically the PM, QA, and strategist… and paying for all of it twice (once in money, once in brainpower).",
          "score": 1,
          "created_utc": "2026-01-17 22:53:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qic16m",
      "title": "Multi location expansion taught me standardization isn't optional.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qic16m/multi_location_expansion_taught_me/",
      "author": "Electrical-Loss8035",
      "created_utc": "2026-01-20 20:11:16",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 0.86,
      "text": "Running a service business with three locations right now and fourth closing next quarter. The first year of managing multiple offices was a mess because I made the mistake of letting each location develop their own processes thinking local autonomy would keep managers engaged and accountable to their own systems.\n\nWhat actually happened was I ended up with three different ways of tracking leads, three different follow up cadences, and client experience that varied wildly depending on which location picked up the phone. One office was logging everything meticulously in our crm while another was using spreadsheets on the side and the third had half their notes in a group chat. When Q3 numbers came in soft I had no way of knowing if it was a market problem or a process problem or just one location dragging down the average because I wasn't comparing the same data points across offices.\n\nThe fix took about two months of painful meetings but we standardized on one crm configuration with mandatory fields, created a single intake workflow that every location follows for new clients, set up weekly reporting with the same metrics pulled the same way, and documented everything in a shared ops manual that new hires train from regardless of location.\n\nNow I can actually see that location B has a 23% longer time to close than the others and dig into why instead of just feeling like something is off. The managers pushed back initially but once they saw how much easier it made their jobs when they could compare notes and borrow solutions from each other the resistance disappeared.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qic16m/multi_location_expansion_taught_me/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0q9jmi",
          "author": "CertainHospital652",
          "text": "We use sonant for intake across all our locations and it helped a lot with the consistency piece since the first client contact is handled the same way regardless of which office they reach, took one variable out of the equation.",
          "score": 3,
          "created_utc": "2026-01-20 20:18:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q8vzs",
          "author": "Away-Egg-2977",
          "text": "The standardization pain is real but worth it, we went through the same thing when we opened our second location and it took us way too long to figure out that autonomy without structure just creates chaos.",
          "score": 1,
          "created_utc": "2026-01-20 20:14:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q9iw7",
          "author": "Upbeat_Owl_3383",
          "text": "Letting each location do their own thing feels like trust but really just creates blind spots where problems hide until they're expensive to fix.",
          "score": 1,
          "created_utc": "2026-01-20 20:17:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0sytce",
          "author": "kubrador",
          "text": "turns out \"let them cook\" only works if everyone's using the same recipe and you can actually taste the difference.",
          "score": 1,
          "created_utc": "2026-01-21 05:09:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}