{
  "metadata": {
    "last_updated": "2026-01-24 16:49:57",
    "time_filter": "week",
    "subreddit": "EntrepreneurRideAlong",
    "total_items": 20,
    "total_comments": 230,
    "file_size_bytes": 231453
  },
  "items": [
    {
      "id": "1qha3pc",
      "title": "Faceseek helps brands get noticed without loud ads",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qha3pc/faceseek_helps_brands_get_noticed_without_loud_ads/",
      "author": "AccountEngineer",
      "created_utc": "2026-01-19 17:12:00",
      "score": 53,
      "num_comments": 2,
      "upvote_ratio": 0.81,
      "text": "Finding attention online is hard when everyone is shouting. \n\nFaceseek feels different because it focuses on discovery instead of forcing ads everywhere.\n\nI tried it while testing a small project and noticed more genuine interest compared to normal promo posts. The setup is simple and doesn’t waste time. It’s useful for founders who want visibility but still want things to feel natural. \n\nFaceseek works well if you prefer slow, real growth instead of fake hype.",
      "is_original_content": false,
      "link_flair_text": "Resources & Tools",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qha3pc/faceseek_helps_brands_get_noticed_without_loud_ads/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0kd3lx",
          "author": "aVarangian",
          "text": "This is literally written like an ad. And is AI-written slop. 50 upvotes but 0 comments. Eff off.",
          "score": 3,
          "created_utc": "2026-01-19 23:01:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m2tt4",
          "author": "Rustyshackilford",
          "text": "Tell us, what is it? How does it work?",
          "score": 1,
          "created_utc": "2026-01-20 04:44:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhu4ud",
      "title": "Here's my insight on how to validate your startup idea!",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qhu4ud/heres_my_insight_on_how_to_validate_your_startup/",
      "author": "Ok_Pollution3165",
      "created_utc": "2026-01-20 06:59:31",
      "score": 42,
      "num_comments": 9,
      "upvote_ratio": 0.96,
      "text": "Had 3 ideas sitting in my notes for months. Kept going back and forth on which one to actually build.\n\nInstead of just picking one and hoping, I ran Google Ads for 2 weeks to see which one people actually wanted.\n\n* AI quote generator for roofing companies\n* Job scheduling tool for HVAC contractors\n* Customer follow-up system for plumbers\n\nThrew together a basic landing page for each using Lovable. Just a headline, a few bullets, and an email signup. No actual product. Used Tally for forms, Ryze AI to handle the ad setup, and Microsoft Clarity to watch where people clicked and bounced.\n\nResults:\n\n* Roofing: 31 signups (3.1% conversion)\n* HVAC: 9 signups (1.1% conversion)\n* Plumbing: 14 signups (1.6% conversion)\n\nRoofing won by a lot. Did not see that coming.\n\nWhat I learned:\n\nThe \"AI\" angle bombed. Keywords like \"AI estimating software\" and \"automated quoting tool\" got almost zero clicks. But \"roofing estimate software\" and \"how to price roofing jobs\" actually brought people in. Turns out people search for solutions they already know exist.\n\nCopy matters more than I thought. First landing page was all about automation and AI features. Converted at like 0.3%. Rewrote it to \"stop leaving money on the table with bad estimates\" and it jumped to 1.4%. Nobody cares how it works.\n\nHVAC might just be a smaller market. Or maybe my targeting was off. Hard to know for sure.\n\nSignups aren't customers. Started doing calls this week. 4 done so far. Every single roofer mentioned the same thing - they hate doing estimates on-site because it takes forever and half the time they lowball themselves. Would've never known that without actually talking to them.\n\nWe almost went with HVAC because my cofounder knew someone in that space. Really glad we tested first.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qhu4ud/heres_my_insight_on_how_to_validate_your_startup/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0nbim8",
          "author": "[deleted]",
          "text": "This is the kind of post I needed to read. I spent months building before testing anything and now I'm in the \"hope people want this\" phase.\n\nThe insight about AI keywords bombing is interesting. People search for what they already understand, not the technology behind it. Makes sense but easy to forget when you're the one building.\n\nTwo questions if you don't mind:\n\n1. How much did you spend total on the Google Ads test across all three?\n\n2. Those 4 calls you did - how did you get them to actually show up? Cold email to the signups?\n\nGood luck with the roofing tool. Sounds like you found a real pain point.",
          "score": 4,
          "created_utc": "2026-01-20 11:05:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1g811z",
              "author": "Careless-Attempt-471",
              "text": "I am also curious about the cost of the Google Ads",
              "score": 1,
              "created_utc": "2026-01-24 16:36:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0pvnel",
          "author": "AdBusy7153",
          "text": "This is fantastic validation work. The lesson on language is key, they dont buy AI, they buy a solution to a specific, painful job",
          "score": 3,
          "created_utc": "2026-01-20 19:13:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p41g3",
          "author": "Longjumping-Check-76",
          "text": "Roofing estimates can be a total time sink. Tools like roofing estimate software can help streamline the process, letting you quickly generate professional proposals and avoid manual calculations. ThreadCatch might be worth checking out to see how some contractors are automating their workflow and reducing back-and-forth time.",
          "score": 2,
          "created_utc": "2026-01-20 17:08:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0w3hrk",
          "author": "siiftai",
          "text": "great insights! it's super important to take that extra time to validate like you did instead of just guessing. i also found that talking to potential customers gives you info you wouldn't get otherwise, but its hard to get enough data and even analyze it in a way that is objective. We often here what we want to hear... for organizing, validating and refining ideas based on more objective feedback, i use siift, helps a lot with figuring out the next steps like a stratetgy sounding board. Hope that helps!",
          "score": 1,
          "created_utc": "2026-01-21 17:36:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19dny1",
          "author": "renis1235",
          "text": "Wish I had read this before I finished my product.   \nGood luck with your tool!",
          "score": 1,
          "created_utc": "2026-01-23 16:12:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0myaww",
          "author": "AnonJian",
          "text": "Your post has the obvious assumption the people screwing themselves over with phony validation have any money to advertise. Just about every snafu out there can be traced back to the wantrepreneur myth you don't need *any money* to start. Zero. Zip. *Nada*.\n\n>The \"AI\" angle bombed. Keywords like \"AI estimating software\" and \"automated quoting tool\" got almost zero clicks.\n\nWhat I learned is we seem to be nearing the *trough of disillusionment* on Gartner's Hype Cycle chart.\n\n>Copy matters more than I thought.\n\nSo when people wrote a million times building wasn't the hard part, marketing and sales was the hard part ...That Was True? I am shocked. SHOCKED. If you can't write copy, then writing code is wasted effort? Mind ... Blown.\n\n>Nobody cares how it works.\n\nYou just sent forty thousand Build In Public stakeholders to depression clinics. I hope you're happy. We can save the questionable value of signups for further discussion.",
          "score": -1,
          "created_utc": "2026-01-20 09:03:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfkjip",
      "title": "I studied 47 SaaS products that went from $0 to $10k MRR last year. Here's what they all did right.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qfkjip/i_studied_47_saas_products_that_went_from_0_to/",
      "author": "whyismail",
      "created_utc": "2026-01-17 18:17:45",
      "score": 32,
      "num_comments": 11,
      "upvote_ratio": 0.88,
      "text": "Hey, I went into SaaS last year with my tool Brandled (helps founders grow on X & LinkedIn) in a pretty competitive space with $0 and 0 audience and ended up wasting six months straight on the wrong things.\n\nSpent half a year stuck at $0 MRR.\n\nThen I became obsessed with one question: what separates SaaS products that make it from those that die at zero.\n\nSo I went down a rabbit hole. Studied 47 founders who went from $0 to $10k+ MRR in the last year. Watched their podcasts, red their tweets, and everything i could get my hands on.\n\nHere's what I learned from all of them, and what I was doing catastrophically wrong.\n\n**1. Frictionless signup isn't optional**\n\nEvery successful product had one-click social login. Google OAuth mostly.\n\nThe ones that died had email verification flows, password requirements, multi-step forms asking questions before showing any value.\n\nThe math is brutal. If you lose 30% of people at signup and you're getting 1000 visitors a month, that's 300 potential customers gone. At a 10% trial-to-paid conversion, that's 30 paying customers per month lost to signup friction alone.\n\nI started with magic link only. Completion rate was 45%. Added Google login. Jumped to 78% the next day.\n\nEvery percentage point of friction at signup costs you real revenue. Most founders don't even measure this.\n\n**2. They launched in weeks, not months**\n\nNone of them spent 6 months building in secret.\n\nAverage time from idea to first paying customer: 3-6 weeks. They launched with ONE core feature. Then spent most of their time marketing it.\n\nI did the opposite. Spent 3 months building features before launching. Content generation, analytics, scheduling, competitor tracking, everything. Got 12 signups. Zero paying customers.\n\nConvinced myself the product wasn't good enough. Spent another month adding features. Still nothing.\n\nThe problem wasn't my product. Nobody knew it existed.\n\nAfter I stopped building and started marketing, posting on Reddit, doing LinkedIn outreach, documenting on X, I hit $126 MRR in 4 days.\n\nSame product. Different approach.\n\nPost-launch is 90% marketing, 10% product.\n\n**3. They were shameless about promotion**\n\nThe successful ones talked about their product everywhere. Not spammy. Just never hiding it.\n\nReddit threads. Twitter replies. Forum comments. Anywhere their audience hung out.\n\nThey'd give genuinely helpful advice first, then naturally mention their tool when relevant.\n\nStarted being shameless. Every relevant conversation where someone complained about the problem I solved, I'd help them first, then mention I built something for this.\n\nA few people definitely get mad but I feel the upside is worth it.\n\nYour product won't discover itself.\n\n**4. They asked churned users what went wrong**\n\nEvery successful product had a system for this. Automated email going out when someone cancels asking what didn't work.\n\nI was doing none of this. Saw cancellations in Stripe, felt rejected, moved on. Never asked why. Never learned anything.\n\nNow every cancelled user gets emails through and automated email sequence and the replies are done by me personally.\n\nResponse rate is 40%. The feedback is literally gold.\n\nEvery single one is fixable. But I only learned because I asked.\n\nChurned users tell you the real truth about your product.\n\n**5. They used their own product religiously**\n\nNot one successful founder was building something they didn't use daily. They were their own heaviest users.\n\nI wasn't doing this. Used my tool occasionally to \"test\" but wasn't relying on it daily.\n\nForced myself to create all my content through my own product for a week. Found 7 bugs in 30 minutes that never showed up in testing.\n\nGenerate button didn't work on mobile. Analytics took 8 seconds to load. Onboarding skipped steps if you refreshed.\n\nMy users were experiencing this and not telling me. They were just leaving.\n\nIf you're not using your product daily as a real user, you're building blind.\n\n**6. They fixed retention before scaling acquisition**\n\nBiggest strategic difference.\n\nFailed products: 30-50% monthly churn, constantly chasing new users to replace ones leaving.\n\nSuccessful products: Fixed retention first, got churn to 10-20%, then scaled acquisition.\n\nThe math: At 40% churn, you acquire 40 customers to net 24. At 15% churn, you acquire 40 and net 34. Same effort, 42% better results.\n\nI was obsessed with new signups. Ignored my 40% churn rate. Got 10 new customers, lost 4. Net: 6.\n\nStopped all acquisition. Fixed onboarding from 8 steps to 3. Added email sequences. Built features retained users asked for. Churn dropped to 15%.\n\nSame acquisition effort, now net 8-9 customers instead of 6.\n\nRetention is the foundation. Acquisition is the multiplier.\n\n**7. They shipped MVPs with one feature**\n\nEvery successful product launched stupidly lean. One core feature done exceptionally well.\n\nI launched with 7 features: content generation, analytics, scheduling, competitor tracking, SWOT, comments, hashtags.\n\nCodebase was a nightmare. Users were confused. I was maintaining features 3% of users touched.\n\nShould've launched with one thing: AI content that sounds human. Made that 10x better. Everything else later based on what paying customers asked for.\n\nYour MVP should make people say \"this solves my exact problem\" even if ugly and missing features.\n\nNot \"wow, so many features\" while solving nothing particularly well.\n\n**8. They priced based on value, not competition**\n\nNone of them raced to the bottom on pricing.\n\nThey looked at the value delivered. Hours saved. Revenue generated. Pain eliminated.\n\nThen priced a fraction of that value.\n\nI priced at $19/month because competitors were at $29-39. Thought I'd win on price. Just looked cheap and inferior.\n\nNeeded 263 customers to hit $5k MRR at $19 versus only 128 at $39.\n\nRaised price to $29-39. Conversions didn't drop. They improved slightly.\n\nHigher price signaled solving a valuable problem.\n\nPeople who care about $10 differences aren't your best customers. They'll churn for anything $3 cheaper.\n\n**9. They automated relationship building**\n\nEvery successful product had email sequences from day one. Not promotional. Actual value and engagement.\n\nWelcome emails. Feature education. Check-ins. Re-engagement for quiet users. Win-back for churned users.\n\nI was sending nothing after signup. Users signed up, got busy, forgot, churned.\n\nEngagement doesn't happen by accident. You engineer it.\n\n**10. They validated with money, not words**\n\nThe problem with feedback: it's free. People say nice things because it costs them nothing.\n\nI built features based on \"that would be helpful\" comments from users who weren't even paying. Wasted weeks on features nobody used.\n\nNow I only build what paying customers explicitly request.\n\nMoney is the only validation that matters. Words are cheap. Credit card numbers are truth.\n\n**The one thing they all had**\n\nThey didn't quit when it felt hopeless.\n\nThey all hit $0 for months. Got depressed. Questioned everything. Wanted to shut it down.\n\nBut didn't.\n\nThe difference between $0 and success wasn't talent or luck. It was not quitting before they figured out what works.\n\n90% of SaaS products die not because they couldn't work. Because the founder quit too early.\n\nIf you're stuck at $0, study the people who've made it. Not the outliers. The normal founders who went from $0 to $10k.\n\nThey're not special. They just did specific things that compound and didn't quit when it got hard.\n\nThe playbook is right there. You just have to execute it.\n\nHappy to answer questions or go deeper on any of this.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qfkjip/i_studied_47_saas_products_that_went_from_0_to/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0a5d34",
          "author": "GnirobSW",
          "text": "7. Can you give some examples of the one feature SaaS that were successful?",
          "score": 1,
          "created_utc": "2026-01-18 12:39:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fkv4e",
              "author": "Local-Employ9800",
              "text": "The one-feature hits I’ve seen: Fathom (simple privacy analytics), Tally (dead-easy forms), Bannerbear (auto image/video generation), and Cron back in the day (calendar). I use Fathom and Tally, and Pulse alongside Ahrefs and SparkToro just for Reddit discovery and copy ideas.",
              "score": 2,
              "created_utc": "2026-01-19 06:11:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0cyc8c",
          "author": "viclnnk",
          "text": "Also feedback gathering inside a product. Users are willing to share, but it’s difficult to find an email, write one, etc. Just a simple “Send feedback” and a pop-up after clicking.",
          "score": 1,
          "created_utc": "2026-01-18 21:16:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0i5nx3",
          "author": "Frequent-Tennis-6914",
          "text": "The retention point is the real game. I’d push it one step earlier though.\n\nSignup is not the goal. Activation is. Retention is the result.\n\nA lot of people have decent traffic but their activation is weak, so churn looks like the problem when onboarding is actually the problem.\n\nWhat change made the biggest difference for your churn drop? Shorter onboarding, better first result, or better reminders?",
          "score": 1,
          "created_utc": "2026-01-19 16:51:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mn3ek",
          "author": "MORPHOICES",
          "text": "I, too, have seen something that corroborates this painfully. \\~\n\nThe biggest thing I’d underline from your list is that most founders over-index on “building more” when the real leverage is “removing friction + talking to users”.\n\nSpecifically before. \n\nTwo things that I gleaned from my experience.\n\n1. Friction develops quicker than you may expect.\n\nPeople can stress really little details but don’t \\*feel\\* how brutal a small friction is until they see real users.\n\nEvery added click, delay, or decision quietly disqualifies people who would have paid.\n\n2. Users that quit are the best sources of feedback.\n\nActive users is a good host. Churned users are frank.\n\nWhen I overlooked churn feedback due to “not my ICP,” it came back to bite me every time.\n\nI'm also fully on board with retention. I've seen teams throw money at growth only to discover they were just leaking the bucket faster.\n\nDid you notice 47 products curious?\n\n\\* A common retention metric founders obsessed over early?\n\n\\* Was it the case that it was more qualitative than numeric?\n\nNice analysis. First-time founders should ensure reading this.",
          "score": 1,
          "created_utc": "2026-01-20 07:20:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10o1fh",
          "author": "Whaaat_AI",
          "text": "Thanks for sharing! The pricing point was especially interesting: \"conversion rate slightly increased with price increase\".   \nSo your take is that even starting off, you should be bold with your price calculating not from a users point (\"xxx $ won't hurt\") but more from \"with my tool they saved xx hours of work per week and this adds up to xx $\".   \nKind of this?",
          "score": 1,
          "created_utc": "2026-01-22 09:23:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19fqmd",
          "author": "renis1235",
          "text": "This is gold right here.  \nThe point about retention is the one that makes a big difference for me.\n\nThanks!",
          "score": 1,
          "created_utc": "2026-01-23 16:21:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1aqmpw",
          "author": "Old-Routine1926",
          "text": "I like this breakdown because it highlights how many founders actually treat *launch and learn* as the core of their first traction phase. In my experience the gains come when you focus on a crisp value proposition and measure real user reactions quickly rather than trying to build out every feature first.",
          "score": 1,
          "created_utc": "2026-01-23 19:55:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05qnfr",
          "author": "AnonJian",
          "text": "Certainly sounds good, but you assume those who fail had a choice. Build It And They Will Come is a blind launch. And yeah, when you are trying to hit a user market-blind, you will be flinging features right and left in desperation.\n\nMinimalism doesn't mean crippleware, it means building from a definitive key insight about the target customer. You can't do that if you consider launch the perfect time to go looking for the user. People don't post asking where to find the first hundred users because they understand the user, quite the opposite.\n\nPeople are using features just like shotgun pellets are used by a poor marksman. Where the analogy breaks down is a marksman doesn't tightly and deliberately shut his eyes before pulling the trigger, shotgun or sniper rifle. \n\nThis happened to you because you flatly rejected the advice. This happens to everyone else because they turn their back on Lean Startup methodology and, yes, Minimum Viable Product. Post anything, everyday, nothing ever changes.",
          "score": 1,
          "created_utc": "2026-01-17 19:34:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08kefn",
          "author": "dafuqherby",
          "text": "Thank you so much for sharing! I took note of a lot of what you said. I am pretty sure that every topic you talked about will be worth paying attention to.\nMay I ask you where do you usually find content about those founders? I fell like following some of them for inspiration.",
          "score": 0,
          "created_utc": "2026-01-18 04:34:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09hxii",
          "author": "Training-Dinner1660",
          "text": "Muy buen análisis. El único matiz que añadiría es el **sesgo del superviviente**: muchos hicieron exactamente esto y aun así no llegaron (👆🏼 el primero)\n\nLo valioso aquí no es la checklist, sino normalizar lo largo y mentalmente duro que es quedarse en $0 durante meses antes de que algo empiece a moverse 😅",
          "score": 0,
          "created_utc": "2026-01-18 09:11:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qga9gm",
      "title": "What tools are genuinely helpful for your business?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/",
      "author": "OddInititi",
      "created_utc": "2026-01-18 14:40:47",
      "score": 32,
      "num_comments": 74,
      "upvote_ratio": 1.0,
      "text": "Would like to pick your brain on what actually worked. There are many hype out there so would like to hear the true stories - whether it's popular or not. Thank you\n\nFor context, here's what I'm already using frequently:\n\n\\- Google Sheets for tracking, CRM; Canva for marketing assets\n\n\\- ChatGPT for general topics (looking at Gemini now, hope it will have folders soon) ; Grammarly: just to fix my writing; Saner: to manage my tasks\n\n\\- Fireflies, Lovable, Manus, Lemlist: Not daily yet but I use these quite often on a weekly basis",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0aqtva",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 4,
          "created_utc": "2026-01-18 14:52:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0caawu",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0aqtva/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-18 19:16:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0b1ls0",
          "author": "Any_Spell_5716",
          "text": "This is a pretty comprehensive list. Recently though I’ve found myself moving more towards Claude than ChatGPT, maybe I’m imagining it but it seems better for keeping context in long detailed conversations?",
          "score": 4,
          "created_utc": "2026-01-18 15:46:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0bb4kl",
              "author": "mercyroofing",
              "text": "Yeah Claude is the go-to for me for 6 weeks (planning, triage, sound boarding) switched over from Grok",
              "score": 1,
              "created_utc": "2026-01-18 16:31:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0cxla0",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxld3",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxla0/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:12:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0fsdb4",
              "author": "LowpolyApe",
              "text": "Claude is absolutely the way to go. I have a feeling GPT is moving backward with each new update, and Claude is just great all around, from problem-solving to planning.",
              "score": 1,
              "created_utc": "2026-01-19 07:13:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0llz78",
                  "author": "Any_Spell_5716",
                  "text": "The only problem is the much lower limits on messaging in free tier, specially when trying to use it for building. Have you committed to the paid tier yet? Is it worth it?",
                  "score": 1,
                  "created_utc": "2026-01-20 03:05:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0z24e1",
              "author": "OddInititi",
              "text": "gonna test out claude",
              "score": 1,
              "created_utc": "2026-01-22 02:16:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0at4po",
          "author": "InterYuG1oCard",
          "text": "Solid stack, I use the tools above and clay to find my leads info",
          "score": 1,
          "created_utc": "2026-01-18 15:04:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0busq3",
              "author": "chikanlegbees",
              "text": "Clay is pretty solid, have you looked into VentureRadar for leads on Reddit? What’s the pricing for clay?",
              "score": 1,
              "created_utc": "2026-01-18 18:04:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0cxmac",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxmcm",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxmac/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:12:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0avo4z",
          "author": "Oldguy3494",
          "text": "Canva",
          "score": 1,
          "created_utc": "2026-01-18 15:17:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bew87",
          "author": "allbl4ackeverything",
          "text": "Canva has been helpful. Excel helps me track and see everything. I love it. Maybe considered old school but works.",
          "score": 1,
          "created_utc": "2026-01-18 16:49:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxn6r",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxn8x",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxn6r/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:12:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0peki2",
              "author": "matthewfinchz",
              "text": "agree",
              "score": 1,
              "created_utc": "2026-01-20 17:56:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0bqf7g",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-18 17:44:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0bqfd0",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0bqf7g/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-18 17:44:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0br5sp",
          "author": "Any-Airline7226",
          "text": "Claude",
          "score": 1,
          "created_utc": "2026-01-18 17:48:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bun5u",
          "author": "chikanlegbees",
          "text": "I use all of the above and VentureRadar for my leads so I can do outreach on Reddit",
          "score": 1,
          "created_utc": "2026-01-18 18:04:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxo35",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxo49",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxo35/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:12:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0bvynh",
          "author": "NoCloutTy",
          "text": "chatgpt for ideas, emails with sendflow, supabase for database, loom and youtube for videos walkthrough",
          "score": 1,
          "created_utc": "2026-01-18 18:10:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0c3blf",
          "author": "iNavin",
          "text": "Canva for design,\nTeams for communications \nSharepoint for files etc. \nGemini Pro and Perplexity for everything AI. \nOutlook for email. - looking at some AI tools\nTo help me there. \nMicrosoft Excel for most of my day to day work. \nHostinger for hosting \nWordpress with Elementor Pro for websites. \nHired a full time SEO person to help me with improving content for my website. \nLinkedin Sqles Navigator\nApollo / zoominfo for leads",
          "score": 1,
          "created_utc": "2026-01-18 18:43:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxr5i",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:12:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxr7p",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxr5i/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:13:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0c7gt1",
          "author": "rogeromanager",
          "text": "I don't know what your business is about but you must be marketing it and the best tool for it is gohighlevel. It has everything you need, website builder, funnels, forms, email sequences, reputation management, ai voice agent, power dialer and more. If you want I can give you an overview of the tool. \nPs. Not trying to sell it just doing some intentional networking.",
          "score": 1,
          "created_utc": "2026-01-18 19:02:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxt58",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:13:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxt6z",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxt58/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:13:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0cb038",
          "author": "Significant-Dust2460",
          "text": "Nice stack! I'm similar on Claude, n8n, ChatGPT + Google Sheets for the core stuff.\n\nOne thing that's been surprisingly useful: mining competitor reviews for customer language.\n\nI was spending hours manually reading Google reviews of competitors to understand what customers actually want. Turned it into a bit of an obsession - you find patterns like \"every 1-star review mentions slow service during lunch\" or \"customers keep asking for X feature that nobody offers.\"\n\nThe language customers use is gold for copy, positioning, and finding gaps. But doing it manually for 500+ reviews takes forever.\n\nBuilt a tool (Kairo) to automate this, it pulls all the reviews, opportunities, common complaints, exact phrases customers use. Testing it out right now to validate if it's actually useful.\n\nReal question for you: Do you ever analyze competitor reviews/feedback as part of your research? Or is that just my weird obsession? 😅\n\nIf you ever want to see what it finds for your space, happy to run one for free in exchange for honest feedback on whether it's actually valuable or just another shiny object.",
          "score": 1,
          "created_utc": "2026-01-18 19:19:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxtzw",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:13:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxu1s",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxtzw/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:13:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0ckfeh",
          "author": "Adventurous-Date9971",
          "text": "The best tools are the ones you actually open every day, not the shiny ones on Twitter. For me, the big unlock was tightening the stack around a few things: lead capture, follow-up, and decision-making.\n\nFor leads, I pair Webflow forms + Tally for quick landing pages, then pipe everything into Airtable as a lightweight CRM. From there, I trigger simple Make/Zapier automations to send intro emails and tag people based on source so I actually know what’s working.\n\nFor outreach, Lemlist is solid, but adding something like Apollo or Clay to clean/enrich leads before campaigns made a bigger difference than any copy tweak. On the “figuring out where to show up” side, I’ve used Ahrefs and SparkToro to see what channels my audience actually hangs out on, then doubled down there.\n\nI’ve tried things like Hypefury and Typefully for socials, and more recently Pulse alongside those and Pipedrive to systematically show up in Reddit threads that match my ICP instead of doomscrolling. The main point: fewer tools, wired together well, beat a huge stack every time.",
          "score": 1,
          "created_utc": "2026-01-18 20:05:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxul0",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 21:13:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cxung",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxul0/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 21:13:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0cxk2a",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-18 21:11:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cxk3t",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0cxk2a/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-18 21:11:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0cy4jb",
          "author": "Necessary_Proof_514",
          "text": "I started using some tools to help me write faster and it made things easier. It reduced the mental load a lot.",
          "score": 1,
          "created_utc": "2026-01-18 21:15:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dgwue",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-18 22:48:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0dgww7",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0dgwue/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-18 22:48:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0e801n",
          "author": "Euphoric-View-9876",
          "text": "Honestly the tools that stuck for me weren’t the flashy ones, they were the ones that reduced decision friction. Sheets + a lightweight CRM beat fancy dashboards, Claude/ChatGPT for thinking not writing, and Lemlist only mattered once the inputs were good. Biggest hidden win for me was spending time understanding where my audience actually shows intent (comments, competitor followers, discussions) before doing any outreach that saved way more time than swapping tools. Fewer tools, clearer signal, better outcomes.",
          "score": 1,
          "created_utc": "2026-01-19 01:09:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ea95y",
          "author": "Chicken_Brai",
          "text": "I use wonprompt for a virtual team.\n\nIll create a scene of my business overall goals and mission, company ideology, business plan, etc\n\nThen I create personalities based on my virtual personalities of ideal employees\n\nI keep it open on split screen and the left side of the screen I have my work im doing then ask the ai team opinions and such as I go\n\nhttps://preview.redd.it/mpnfpwd6k7eg1.jpeg?width=1080&format=pjpg&auto=webp&s=9801ed7a1e5744a78b6dab5be195e03c1dfce045",
          "score": 1,
          "created_utc": "2026-01-19 01:22:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ed7hp",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-19 01:39:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ed7jz",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qga9gm/what_tools_are_genuinely_helpful_for_your_business/o0ed7hp/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-19 01:39:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0et0i2",
          "author": "ApprehensiveCrab96",
          "text": "Claude for coding and Saner for day planning",
          "score": 1,
          "created_utc": "2026-01-19 03:04:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0et75i",
          "author": "TwoBitFoundry",
          "text": "I recommend Wave for online invoice handling. Free to use, free to brand, automatic reminders, and has a really great api for automations. I actually use it as my converted client directory as well. Cause I have to add my client info to onboard them, so it’s worked out!",
          "score": 1,
          "created_utc": "2026-01-19 03:05:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ey4vu",
          "author": "Kudos_812",
          "text": "A hammer.",
          "score": 1,
          "created_utc": "2026-01-19 03:33:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f3h9x",
          "author": "Sudden_Breakfast_358",
          "text": "For us, the tools that actually free up time are the ones that handle repetitive tasks. Sensay has been a game-changer, it manages FAQs, customer follow-ups, and basic internal knowledge so we’re not stuck in the inbox. ChatGPT is great for drafting content, and Zapier/Make keeps workflows automated. Together, they cut down on busywork and let the team focus on real business tasks.",
          "score": 1,
          "created_utc": "2026-01-19 04:06:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fd2w8",
          "author": "SchniederDanes",
          "text": "what’s helped me most isn’t adding more tools, but building a simple acquisition engine where each tool has a clear job... ads bring in demand, but the real win is what happens after the click... we route inbound calls to an ai voice agent using a tool like dialnote.com.. so no lead is missed, calls are handled or logged automatically, and intent is captured even when no one is available... then for outbound and followups, smartreach.io.. runs email and linkdn sequences in parallel, with replies, calls, and tasks all tracked in one place... we plug in a lightweight enrichment tool only where needed, instead of overdoing it. once everything talks to each other, acquisition stops feeling manual and starts feeling predictable... that shift mattered way more than any single shiny tool.",
          "score": 1,
          "created_utc": "2026-01-19 05:11:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0frgap",
          "author": "trainmindfully",
          "text": "most tools people swear by only worked because they matched how that person already thinks and works. the hype ones usually fail because they add a new system on top of existing chaos. the genuinely helpful stuff tends to be boring. anything that reduces handoffs, duplication, or decision friction usually sticks. for me that has meant fewer tools doing more, not more tools doing narrow things. spreadsheets survive every cycle for a reason. also worth saying that tools feel productive early, but process clarity matters more. if a tool requires constant upkeep or manual discipline to stay useful, it usually gets abandoned once things get busy. the best ones disappear into the background and quietly save time without asking for attention.",
          "score": 1,
          "created_utc": "2026-01-19 07:05:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fw5bx",
          "author": "Training-Dinner1660",
          "text": "En mi caso y muchas personas que conozco, utilizamos **Notion + LLM** (ChatGPT o Gemini). Y ya las herramientas de operación para prestar tu servicio va a depender de tu área de actividad. Por ejemplo:\n\n|Marketing|HubSpot, GA4 + GTM, Meta/Google Ads|\n|:-|:-|\n\n\n|Desarrollo|GitHub, Jira, Vercel/AWS|\n|:-|:-|\n\n\n|Consultoría/Formación|Notion, Zoom, Miro|\n|:-|:-|",
          "score": 1,
          "created_utc": "2026-01-19 07:47:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g2g2f",
          "author": "Useful_Grape9953",
          "text": "For actual impact, I’d add Sensay, it helps discover AI tools and workflows that other small businesses are actively using, so you skip the hype. Beyond that, simple automation stacks (like Zapier or Make) plus ChatGPT for structured tasks usually save the most time.",
          "score": 1,
          "created_utc": "2026-01-19 08:45:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gg58o",
          "author": "Unique-Painting-9364",
          "text": "Honestly boring tools have helped me the most. A solid CRM setup good email automation, and simple dashboards beat shiny tools I barely use. If it saves time every week it’s worth it hype fades fast.",
          "score": 1,
          "created_utc": "2026-01-19 10:53:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ghpb4",
          "author": "StillLoadingit",
          "text": "I lean on tools like HubSpot or ActiveCampaign for CRM and automations, Trello or Asana for project and task management, and Google Analytics for tracking traffic and engagement. For making client access and onboarding way smoother, I’m using Connexify to cut down setup friction.",
          "score": 1,
          "created_utc": "2026-01-19 11:07:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gmh95",
          "author": "MintedRiddle",
          "text": "I mostly live in Canva and Sheets, also Claude for ideas and Ramp for finances/expenses",
          "score": 1,
          "created_utc": "2026-01-19 11:48:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gqp7i",
          "author": "Vaibhav_codes",
          "text": "Tools that actually stick are the ones that cut repetitive work or give clear insights automation, analytics, and AI helpers for content or docs.",
          "score": 1,
          "created_utc": "2026-01-19 12:22:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h9v6r",
          "author": "One-Cardiologist4433",
          "text": "One thing I rarely see talked about is workload visibility. A lot of stacks help with tasks or notes, but not with knowing who’s overloaded before things slip. Have you found anything that helped with that specifically?",
          "score": 1,
          "created_utc": "2026-01-19 14:21:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hdkae",
          "author": "daydarce",
          "text": "nice list, i've been hearing a lot about how AI search is changing the game for discovery lately. If you're thinking about how customers find you through ChatGPT or Perplexity answers, I've heard great things about Brandlight for monitoring and improving how your brand shows up in those AI responses. From what I understand it helps you see what AI tools are actually saying about your products and gives you ways to influence those mentions, which seems pretty important now that people are skipping Google for AI chatbots when researching purchases.",
          "score": 1,
          "created_utc": "2026-01-19 14:40:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0iv8py",
          "author": "fixingprocesses",
          "text": "The tools that help most are the ones that support thinking and follow through, not just output. Simple tracking, somewhere to write clearly and something that reduces context switching usually do more than advanced automation.\n\nAI is useful when it helps you organise decisions, clarify messages or review work rather than generate more things to manage. I see people get more value by narrowing how they use it instead of adding another model.",
          "score": 1,
          "created_utc": "2026-01-19 18:45:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0j0ajb",
          "author": "muabaca",
          "text": "slack for quick team syncs airtable for flexible crm upgrades automate repetitive stuff with make ((cheaper zapier alt) audit workflows quarterly to cut waste. sensays useful for capturing team knowledge as one option whats your main pain point scaling?",
          "score": 1,
          "created_utc": "2026-01-19 19:07:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mndub",
          "author": "MORPHOICES",
          "text": "I have tried everything over the years. What I’ve found most useful are the tools that… reduce thinking. Not features. \\~\n\nThe two things that really stuck for me. \\* Google Sheets – unsexy but unbeatable. I use it for lighter-weight CRM, tracking of experiments, and sanity checking. A tool must outperform a spreadsheet in order to be adopted.\n\n\\* A single source of truth like Notion only works if ruthless about it. I maintain a single \"operating page\" for each project which contains goals, ICP, offers, and ongoing experiments. No second brain, no mess.\n\n\\* Using email is under-rated. Use Gmail and labels.  Most transactions and genuine opportunities still occur here. CRMs with bells and whistles arrived later.\n\n\\* Calendly and short calls is the tool giving me the most ROI by far. Interacting with users is better than any dashboard.\n\n\\* Use ChatGPT to compress and rewrite careless words into neat insights or notes like during calls or meetings.\n\nTools I gave up.\n\n\\* Anything that promised “automation” before I had repeatable behavior.\n\n\\* Before I had visitors worth analyzing, I got analytics tools.\n\nIt's my order now.\n\nIf a tool is not saving you time this week, it’s friction.\n\nI wonder what you removed recently that simplified things.",
          "score": 1,
          "created_utc": "2026-01-20 07:22:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pehmi",
          "author": "matthewfinchz",
          "text": "Automation saves you money and energy.",
          "score": 1,
          "created_utc": "2026-01-20 17:56:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tjka6",
          "author": "Minute-Newt-1439",
          "text": "I use Gemini for copywriting and Morelogin for managing my multiple social media accounts. Although they are paid services, they are very efficient.",
          "score": 1,
          "created_utc": "2026-01-21 08:02:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vrp5g",
          "author": "Weekly_Accident7552",
          "text": "For me the genuinely helpful stuff is the boring backbone, not the flashy AI tools. Google Workspace plus a real payment and accounting setup, then one place where work actually runs so you are not living in DMs. We use Manifestly for recurring ops like client onboarding, content production, and weekly reviews, because it is easy to keep the team aligned and you can see what is stuck. Most other tools were nice, but this was the one that reduced chaos week after week.",
          "score": 1,
          "created_utc": "2026-01-21 16:44:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yiei7",
          "author": "PersonalEcho9244",
          "text": "So many gems here. Taking notes!",
          "score": 1,
          "created_utc": "2026-01-22 00:26:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17j4sz",
          "author": "Soft_Emotion_9794",
          "text": "We test a lot of tools and cut most of them. 11x stayed because Alice consistently did work that otherwise fell on founders. Outreach kept running even during busy weeks. That made it genuinely helpful.",
          "score": 1,
          "created_utc": "2026-01-23 09:13:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgz6fx",
      "title": "4months. 5clients. £12k/mo.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qgz6fx/4months_5clients_12kmo/",
      "author": "wastededucation",
      "created_utc": "2026-01-19 08:57:37",
      "score": 31,
      "num_comments": 8,
      "upvote_ratio": 0.9,
      "text": "Sharing here the steps I went through from launching my service in September last year as i think theyre pretty repeatable to speed-run.\n\nThis is by no means a success story and i definitely don’t feel secure yet, but might help as a zero-to-something example.\n\nI left my job end of 2024 - ads/marketing consultant for the big blue professional network.\n\nNaked quit when i hit my savings goal. Just had enough of big corp and logging my farts in salesforce.\n\nDidn’t really have a plan other than to build some stuff solo, learn new tech, and eventually start selling something.\n\n\\- looked for the easiest route to cash based on my skills. In my case, “do b2b ads better”. That’s where my credentials/background were so just kept it simple.\n\n\\- looked for point of difference in service. Too difficult. Loads of ads agencies out there. \n\n\\- turned to looking for point of difference in distribution. On LinkedIn that’s personal video.\n\n\\- Started talking to the camera and posting opinions on ads/marketing. Summarised opinions into a micro-brand and imagery to supplement the videos.\n\n\\- - sidenote - - i had never turned the camera on myself before. Ever. And i hated it. Saw Shaan Puri talk about climbing Cringe Mountain. Posted about that and got some attention. Main point is noticing how hard it was, and realising that 0.001% of people are ever going to do this selfie video thing.\n\n\\- this was the lightbulb moment for a more scalable service than just consulting on ads.\n\n\\- researched current remote podcasting software. Found riverside and descript. Played around and got ‘ok’ on them in a few hours.\n\n\\- invited some ex colleagues to come and chat for half an hour in return for me creating them some non-cringe videos to use on their linkedin. Also posted to offer it out to my extended network.\n\n\\- got a few bites, including a couple of nice CEO intros from contacts who believed in the ‘founder video’ concept\n\n\\- interviewed that half a dozen people and created videos and linkedin ads for them, for free. Emphasis on free. I was simply looking for momentum and a chance to show something i could at this stage.\n\n\\- used those content packs as case studies to show what i was offering, whilst simultaneously building a brand and website to make it feel more legit\n\n\\- built a launch offer and packaged it up. Announced it on my linkedin. Limited spaces (5). \n\n\\- had 2 people directly say they wanted in, and then i reached out to anyone that engaged with my post to see if i could bring them in - closed 2 of those over video chat and voicenotes.\n\n\\- Interestingly, none of my free beta users converted into paying customers, but hopefully someday (i’m keeping then warm)\n\n\\- - sidenote - - i had simultaneously been adding people on linkedin that i thought were in my target demographic (leaders of business lines eg CMO, CRO etc). This gradually built my network and helped with the reach of my posts, not directly selling to them.\n\n\\- i had packaged it to be £1k/mo per person, on 3-month deals.\n\n\\- by the end of month 2 and now 4 paying clients at £1k/mo, i had a lot more work to shout about and it was so much easier to generate interest and meetings through my profile.\n\n\\- i called myself the 5th spot and dogfooded my own product to get me out there more. Worked pretty well.\n\n\\- this brought in a few more leads, including some ex colleagues that had moved on, and an old uni friend that was now leading a startup. They in turn made some intros\n\n\\- increased my pricing once the 3-month ‘launch’ packages expired to £1.5k p/mo\n\n\\- also offered layered, related services to have more things to sell beyond just content e.g. podcast facilitation&editing, social page management, ad campaign setup&run, corporate email newsletter, content strategy etc.\n\n\\- brings me to Jan with 5 clients totalling at £12k/mo over different packages (some like more video, some prefer carousels/articles), including one £4k full-service social management.\n\nnext steps\n\n  \\- bring in systems and freelancers to help me with the delivery bottleneck. Everything is produced by me currently so that needs to change to be able to grow. I’m avoiding any promotion as i cant take on more clients, which is painful.\n\n  \\- lock in more 6m+ contracts\n\n  \\- rebrand to something better than my microsoft paint (canva) logo to be more legit\n\n  \\- Reinvest into more personal content and ads to increase lead flow\n\n  \\- get much better at the pitch/close cycle (I’m not a salesman and want the product to sell itself)\n\nHonestly when I look back at the last few months it’s pure uncertainty, guesswork, trying to follow guru advice, really trying to learn what people want, and then how to deliver it.\n\nI’m not sure I have a single/simple takeaway here but hopefully these steps i’ve gone through help someone see that the progress does happen if you just think logically and put one foot in front of the other.\n\nOh, and get a whiteboard. And take a walk.\n\nTldr - try new stuff, do free projects, use as case studies, build a micro brand, promote it on your personals, hawk core/launch offer, upsell related services",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qgz6fx/4months_5clients_12kmo/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0i4r9m",
          "author": "Frequent-Tennis-6914",
          "text": "The most real line here is “I’m avoiding promotion because I can’t take more clients.”\nThat is the exact point where systems matter. Not big strategy, just a simple weekly process that tells you: what’s coming in, what’s going out, and what can be safely spent on help without creating a tight week.\nWhat part of delivery is eating the most time right now?",
          "score": 3,
          "created_utc": "2026-01-19 16:46:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l54x5",
          "author": "Extreme_Log5264",
          "text": "This is very inspirational for us trying to be our own entrepreneur. Thanks for being so honest.",
          "score": 2,
          "created_utc": "2026-01-20 01:33:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o139la1",
          "author": "Guac-this-way",
          "text": "This is really inspiring, thanks for sharing. \n\nWondering if you hit any objections like “I’ll just have AI do this” or “this guy in a developing county will do it for 1/10 the price.” \n\nI’m always avoiding pitching this kind of work because I feel like that’s what I’ll run into.",
          "score": 2,
          "created_utc": "2026-01-22 18:20:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1f9wep",
              "author": "wastededucation",
              "text": "Yeh i get those exact two objections, i handle the first one by being really open about my workflow. Usually people are impressed by how i’m being resourceful with AI, and that even the lift that its doing takes a lot of organising. Thankfully i have a good history and experience behind me to show that the remaining 20/50/80% (whatever someone thinks i carry) is of a very good level so quite easy to pitch my “human brain” element.\n\nThe second one, similar chat, it’s just horses for courses. My clients so far all have a “get what you pay for” mentality and perceived my service as the higher quality option, but i’ve definitely lost a couple of pitches to clients that have a quote that is half the price. \nTemu has its place. So does Harrods. I’m probably somewhere in the middle.",
              "score": 2,
              "created_utc": "2026-01-24 13:42:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gae0u",
          "author": "nzmi",
          "text": "What's the name of your business brother, I am soon to start the same journey and would love more info on what worked and what didn't, and what you do differently if you had to do it all again.",
          "score": 1,
          "created_utc": "2026-01-19 10:00:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gkpco",
              "author": "wastededucation",
              "text": "Yeh course mate happy to chat. Add me On LinkedIn it’s in my profile",
              "score": 1,
              "created_utc": "2026-01-19 11:33:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qkyze2",
      "title": "i scraped 500k comments to find the best side hustles. here is the data (and why 90% of them are traps).",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qkyze2/i_scraped_500k_comments_to_find_the_best_side/",
      "author": "Sensitive-Rub256",
      "created_utc": "2026-01-23 18:37:30",
      "score": 29,
      "num_comments": 25,
      "upvote_ratio": 0.56,
      "text": "i scraped 500k comments to find the best side hustles. here is the data (and why 90% of them are traps).\n\n\n\ngot ripped off by too many \"guru\" courses so i took matters into my own hands.\n\n\n\ni scraped 500k total comments from specific finance subreddits, facebook groups, and x threads to find what is actually working in 2026.\n\n\n\ni used a custom n8n workflow + gemini 1.5 to filter the results. i didn't look for \"passion.\" i looked for margin and leverage.\n\n\n\nhere is the raw breakdown, sorted by \"labor trap\" (offline) vs \"scalable systems\" (online).\n\n\n\ntier 1: the labor traps (offline) good for quick cash, bad for wealth. you are trading time for money.\n\n\n\ntaskrabbit/manual labor: assembling furniture or pressure washing. consistent leads, but you cap out physically. if you break your leg, your income stops.\n\n\n\nrover/dog sitting: high demand, but low leverage. unless you hire staff (which kills margins), you are just buying yourself a job cleaning up after pets.\n\n\n\nsenior companionship: surprisingly lucrative according to the data (care/nextdoor). people pay well for trust. but again it requires your physical presence. unscalable.\n\n\n\ntier 2: the digital grind (online) better, but still requires constant input.\n\n\n\nugc (user generated content): filming videos for brands (billo/collabstr). the data shows high burnout. you are essentially a freelance actor.\n\n\n\nkdp / print on demand: the \"passive\" myth. the comments show you need to publish 100+ designs/books to see real returns. it’s a volume game, not a smart game.\n\n\n\ntier 3: the \"infrastructure\" plays (high leverage) this is where the top 1% of comments were focused. zero human fulfillment.\n\n\n\nprogrammatic newsletters: using automated scrapers to curate local news for a specific city (using beehiiv), then running ads. once the workflow is set, it runs itself.\n\n\n\nthe \"automated drop-service\" agency: this was the outlier. people are finding high-ticket clients on reddit/linkedin using \"hunter\" scripts, then fulfilling the work (seo blogs, data scraping) using ai agents.\n\n\n\nthe math: traditional agencies run at 20% margin. these \"zero-employee\" setups run at 95% margin because the \"staff\" is just code.\n\n\n\nthe consensus: the only way to win in 2026 is to own the system, not do the work.\n\n\n\nthe conclusion the data is clear: if your side hustle requires your hands, it's just a second job. the only people making \"quit your job\" money are the ones building automated infrastructure.\n\n\n\nusually get lot of dms asking about the scraper and the \"automated agency\" workflow i used to process this. i actually packaged the entire n8n automation stack and my notion dashboard into a template for myself. i pinned the access link to my profile if you want to clone the infrastructure.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qkyze2/i_scraped_500k_comments_to_find_the_best_side/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o1bsuns",
          "author": "jurasikk",
          "text": "It’s always the super confidence and the consistent block 2-3 paragraphs that give it away for me honestly. Atleast they didn’t keep in the stupid emoji associated with every paragraph output that I’m pretty sure AI only creates on EVERY SINGLE OUTPUT typically.",
          "score": 19,
          "created_utc": "2026-01-23 22:58:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ctafw",
              "author": "Sukanthabuffet",
              "text": "Yes! Thank you! I hate that emoji use.",
              "score": 2,
              "created_utc": "2026-01-24 02:21:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1bkhj7",
          "author": "Gladi_ator009",
          "text": "This is just AI slop",
          "score": 85,
          "created_utc": "2026-01-23 22:16:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1cczax",
              "author": "Convergecult15",
              "text": "This entire sub has been AI slop for months now and people don’t seem to notice.",
              "score": 27,
              "created_utc": "2026-01-24 00:46:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1dex89",
                  "author": "Gladi_ator009",
                  "text": "True, whole reddit is filled with these shit.",
                  "score": 6,
                  "created_utc": "2026-01-24 04:34:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1dsza7",
              "author": "cantfigureitatall",
              "text": "I think it's funny that we standardized ai content as \"slop\". Like collectively that's the word we settled on, but it was never a discussion or anything. Slop. \n\nt's kind of a weird word, didn't ever think about how it sounded until all the people were calling out the ai posts.",
              "score": 4,
              "created_utc": "2026-01-24 06:17:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1bzbry",
          "author": "BLIZZARDWIZARDSS",
          "text": "You will not make money doing AI slop businesses",
          "score": 8,
          "created_utc": "2026-01-23 23:32:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1dl3mp",
          "author": "the_unconditioned",
          "text": "Goddamn the internet is dead man",
          "score": 4,
          "created_utc": "2026-01-24 05:17:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1egjeg",
              "author": "skywalkersdream",
              "text": "“Dead Internet Theory” is a real thing actually",
              "score": 1,
              "created_utc": "2026-01-24 09:48:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1bix6b",
          "author": "DeadpuII",
          "text": "And no capital letters were supposed to make this less AI or what was the reason for that? I am genuinely wondering, as I've seen posts written like this multiple times.",
          "score": 9,
          "created_utc": "2026-01-23 22:08:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ahu3u",
          "author": "1Gladiator1",
          "text": "Results sound intuitively correct. Nice work.",
          "score": 2,
          "created_utc": "2026-01-23 19:14:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cex4h",
          "author": "Effective_Injury",
          "text": "..",
          "score": 1,
          "created_utc": "2026-01-24 00:57:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1e53jr",
          "author": "mentalFee420",
          "text": "Who is reading newsletters? Email inboxes are already overwhelming filled with all kinds of random stuff",
          "score": 1,
          "created_utc": "2026-01-24 08:03:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1eaq56",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-24 08:54:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1eaq67",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qkyze2/i_scraped_500k_comments_to_find_the_best_side/o1eaq56/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-24 08:54:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1akzie",
          "author": "Latter-Sink7496",
          "text": "What will you do with these findings?",
          "score": 2,
          "created_utc": "2026-01-23 19:29:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1c94at",
          "author": "trainmindfully",
          "text": "interesting data pull, but i think the framing is doing a lot of work here. calling everything that involves humans a trap feels clean on paper and messy in reality. most of the automated setups i’ve seen still hide a ton of human judgment, maintenance, and edge-case cleanup that just doesn’t show up in comment scraping. the leverage is real, but the stability often isn’t. curious if your data showed how many of those infra plays quietly died after a few months once the inputs changed or the platform rules shifted.",
          "score": 1,
          "created_utc": "2026-01-24 00:25:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1cdm64",
              "author": "mmmfritz",
              "text": "Automation exists irl too",
              "score": 1,
              "created_utc": "2026-01-24 00:50:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1d8axx",
          "author": "whyyoudidit",
          "text": "show me how I can scrape 500k reddit comments without my IP getting banned?",
          "score": 1,
          "created_utc": "2026-01-24 03:50:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fqm6r",
              "author": "Either_Pound1986",
              "text": "With residential proxies + curl_cffi + proper rate limiting you can pull 500k comments in a few days without getting IP-banned",
              "score": 1,
              "created_utc": "2026-01-24 15:15:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1an1su",
          "author": "PatientEmpath",
          "text": "Really interesting,  thanks for the general reminder!",
          "score": -1,
          "created_utc": "2026-01-23 19:39:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cii0t",
          "author": "SuchArtichoke1966",
          "text": "Owning the system instead of grinding inside it is the real unlock here, and your breakdown nails that distinction. The interesting pattern is that every “tier 3” play you mentioned has two common pieces: repeatable data flow + a predictable distribution channel. If someone wants to copy this, I’d do it backwards: pick a narrow buyer first (ecom brand owner, local lawyer, SaaS founder), then map one painful recurring task they already pay for (content, lead lists, reporting). After that, prototype the fulfillment in a weekend using Gemini/Claude + no-code (n8n, Make, etc.), and only once it works manually, wire up your hunter scripts and outreach on Reddit/LinkedIn. I’ve used PhantomBuster and Clay for that, but Pulse for Reddit plus Apollo-style email has been way more useful when I want to find real demand signals and plug into live conversations instead of cold pitching in a vacuum. Owning a boring, automated pipeline for one niche wins every time over chasing “high-income skills.",
          "score": 0,
          "created_utc": "2026-01-24 01:18:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1d8om8",
          "author": "Strong_Spite7794",
          "text": "Nice",
          "score": -1,
          "created_utc": "2026-01-24 03:53:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1bf1r1",
          "author": "CaspianBlue",
          "text": "do you have examples?",
          "score": -2,
          "created_utc": "2026-01-23 21:50:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj1i94",
      "title": "What’s the clearest sign that a business idea is not worth pursuing?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qj1i94/whats_the_clearest_sign_that_a_business_idea_is/",
      "author": "One-Two-218",
      "created_utc": "2026-01-21 15:50:44",
      "score": 23,
      "num_comments": 34,
      "upvote_ratio": 0.96,
      "text": "I’m documenting my early thinking around a business idea, and I’m trying to be just as honest about when not to move forward.\n\nEveryone talks about green lights and validation, but I feel like the red flags matter just as much. I’ve had ideas that sounded good on paper and even got positive reactions, yet something still felt off.\n\nFor people who’ve been through this phase:  \nWhat was the moment or signal that told you an idea wasn’t worth continuing with even if it seemed promising at first?\n\nI’m more interested in lessons learned than success stories.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qj1i94/whats_the_clearest_sign_that_a_business_idea_is/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0virzz",
          "author": "Normal_Sun_8169",
          "text": "For me, it was when every conversation required heavy explanation. If I had to “educate” people just to make the problem sound relevant, that was usually a sign the pain wasn’t real enough.",
          "score": 31,
          "created_utc": "2026-01-21 16:03:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10fb8q",
              "author": "Medical_Fuel5472",
              "text": "Depends. If it’s a B2B, common folk would find it very hard to understand.",
              "score": 2,
              "created_utc": "2026-01-22 08:01:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o10py46",
                  "author": "Apprehensive_Dog5208",
                  "text": "I think what OC meant was that if they had to educate the people they're selling to to make the problem sound relevant then the pain wasn't real enough.\n\nI think of this like being on YouTube and hearing people educate you about data privacy and why you should get Incogni. While all of that may be true, to many regular people watching YouTube, their identity has never been stolen and they don't know of anyone's identity who has - so the education is meaningless and the pain isn't real (to them).\n\nBut Incogni has bucketloads to spend on advertising for their idea: many founders don't have this. So if you have to educate leads before getting them to buy, you lose all of the people who couldn't care to buy into a problem that hasn't affected them yet. This can be a lot, and as a startup, OC argues that the pain isn't real enough if you have to tell people they have a problem",
                  "score": 1,
                  "created_utc": "2026-01-22 09:42:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0vruh3",
          "author": "DecisionOperator",
          "text": "if you can’t name who pays, why they pay, and what they stop doing after they pay, it’s a hobby.\n\n“positive reactions” don’t matter. money, time, and repeat requests do.\n\ntake your idea and ask 10 target users for one specific pre-order or intro call this week, then drop it if you get excuses.",
          "score": 9,
          "created_utc": "2026-01-21 16:44:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1bcnbe",
              "author": "ActiveShipyard",
              "text": "... and then iterate if you get excuses, try again with the next 10",
              "score": 1,
              "created_utc": "2026-01-23 21:39:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0vj37d",
          "author": "kook5454",
          "text": "I went through this exact thought process after reading Starting a Startup by James Sinclair. One idea that stuck with me was paying attention to ideas that create momentum on their own. If everything requires pushing, that resistance might be telling you something important.",
          "score": 8,
          "created_utc": "2026-01-21 16:05:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0vkygr",
              "author": "One-Two-218",
              "text": "That resonates. The idea of momentum being natural instead of manufactured makes a lot of sense. I might revisit how much I’m pushing versus how much is pulling me forward",
              "score": 3,
              "created_utc": "2026-01-21 16:13:44",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o0xsoem",
              "author": "CheyanneO3",
              "text": "From a marketing lens it’s all about tapping into latent demand. Trying to use persuasion to convince people to buy your offer is incredibly inefficient. \n\nConnecting to demand that currently exists (and is unmet) is always the goal.",
              "score": 2,
              "created_utc": "2026-01-21 22:12:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0wtdhr",
          "author": "barefamting",
          "text": "You can't find people willing to pay for what you're offering.",
          "score": 5,
          "created_utc": "2026-01-21 19:30:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0x0pmt",
              "author": "Plus-Professional-84",
              "text": "That is the only real test. You will always find beta users for an MVP, prospects who are “interested”, etc etc. At the end of the day, do they, or not, open their wallet is the only metric that matters",
              "score": 5,
              "created_utc": "2026-01-21 20:04:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0x205q",
                  "author": "barefamting",
                  "text": "That's basically it. There's a stark difference between those who say they would and those who do.",
                  "score": 2,
                  "created_utc": "2026-01-21 20:10:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0wjrss",
          "author": "alexfelice",
          "text": "Almost every idea sounds good on paper \n\nAll the things I've done that failed are because I spent too much on activities that didn't matter and not enough time on the only thing that really matters: revenue \n\nFeedback from paying customers will tell you almost everything you need to know",
          "score": 3,
          "created_utc": "2026-01-21 18:48:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wnm47",
          "author": "CayoPerican",
          "text": "Built an mvp and checked usage data from beta users. They weren’t coming back on their own.",
          "score": 3,
          "created_utc": "2026-01-21 19:05:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yjr4n",
          "author": "Competitive-Fox-1743",
          "text": "For me it always comes back to money.\n\nIf no one is willing to pay, that’s the clearest red flag. Not later, not after a few tweaks, not once it’s more polished. If people like the idea but won’t spend even a small amount, that tells you a lot.",
          "score": 2,
          "created_utc": "2026-01-22 00:33:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o144vwf",
          "author": "the_aiaddict01",
          "text": "Some people will say \"when you don't make x amount of money after x amount of time\", but I think it comes down to volume. Search \"rule of 100 Alex Hormozi\" online, and you'll see what I mean. \n\nFrom my point of view, and this is just my personal opinion, almost anything works if you apply the rule of 100, so say, 100 outreach attempts a day, for 100 days. 100 minutes a day making content for 100 days, etc, etc. It comes down to volume. There's so many people out there making ridiculous amounts of money that you really can make money with anything. Just the main problem people have when starting a business is that no one knows they exist. And how are they going to sell and make money if no one knows you exist.",
          "score": 2,
          "created_utc": "2026-01-22 20:41:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x7kl4",
          "author": "GeorgeHarter",
          "text": "During potential customer interviews (as opposed to user interviews). \n\nExample:\nI was throwing a beach party a Looong time ago. We rented a porta potty to minimize dragging sand into the house. \nA female friend suggested that “no woman will sit on a portapotty toilet seat, so they hover”. \nShe suggested a strap or bar to hold. \n\nI designed a “hover bar” attached to the door, so a person could balance themselves. \n\nWhen I spoke to local PP business owner, he said no vendor will want to add cost for that because it is agreeing with the idea that the seat is dirty. I confirmed with another dealer, then dropped the idea. \n25 years later, some have grab bars. Most still don’t.",
          "score": 1,
          "created_utc": "2026-01-21 20:35:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xj50l",
          "author": "Keep_Askin",
          "text": "No competition. ",
          "score": 1,
          "created_utc": "2026-01-21 21:28:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0y8enn",
          "author": "rt2828",
          "text": "No ICP",
          "score": 1,
          "created_utc": "2026-01-21 23:32:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ydtnl",
          "author": "Smyley12345",
          "text": "\"Is it appealing to customers that have money?\". I remember hearing about studio space marketed towards streamers and cringed so hard it was physically painful.",
          "score": 1,
          "created_utc": "2026-01-22 00:01:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ysjs1",
          "author": "CleanOpsGuide",
          "text": "For me, the clearest signal was when progress depended more on my enthusiasm than on external pull.\n\nIf I had to keep reframing, persuading, or “staying motivated” just to move the idea forward, instead of reacting to real constraints or feedback, that was usually a sign the market wasn’t actually asking for it.\n\nThe ideas worth continuing tended to create friction on their own. The wrong ones required constant internal energy just to stay alive.",
          "score": 1,
          "created_utc": "2026-01-22 01:22:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0z7la2",
          "author": "Perseverance_ac",
          "text": "Solving your own problem that nobody else has OR Liking the product so much you forget about sales : validate through customer interviews.\n\nOversaturation of the market and no clear differentiator of your idea.\n\nIdea is too big for you to make initial sales on your own: think anywhere you need a warm intro.\n\nIf you can make the product on your own, most red flags are related to sales: if you can't sell it on your own, who / what services do you need?\n\nNow if you can not make the product on your own, it opens way more red flags.",
          "score": 1,
          "created_utc": "2026-01-22 02:47:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10it1f",
          "author": "alexrada",
          "text": "no customers that pay.",
          "score": 1,
          "created_utc": "2026-01-22 08:34:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10jm82",
          "author": "Vaibhav_codes",
          "text": "The clearest sign is when people say they’d pay but don’t actually pay. Positive feedback is nice, but no real willingness to spend money usually means the idea isn’t solving a strong enough problem Other red flags: unclear target audience, constant pivoting, or you can’t explain the value in one sentence.",
          "score": 1,
          "created_utc": "2026-01-22 08:42:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10nyr2",
          "author": "AdBusy7153",
          "text": "The clearest sign for me is when I cant find the specific moment of pain. If a potential customer problem is vague or they are only mildly annoyed, they wont pay to solve it. True, fundable pain makes them wince when you describe it",
          "score": 1,
          "created_utc": "2026-01-22 09:23:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10p5fw",
          "author": "chucksd805",
          "text": "If chatgpt says it is a good idea lol. RUN",
          "score": 1,
          "created_utc": "2026-01-22 09:34:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11zlmv",
          "author": "AmbitiousJump5768",
          "text": "when we tried every single marketing or sales thing. social media, fb market place, google ads, fb ads, yt, cold calling, cold emails, etc we have a good website but nothing really clicked in any of that. We had to pause, think long and hard wheteher it was still worth pursuing or we're missing something else.",
          "score": 1,
          "created_utc": "2026-01-22 14:50:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13diaz",
          "author": "misterhubbard44",
          "text": "No one else seems to be pursuing the idea. Or other companies stopped pursuing the idea.  Take the time to identify why they stopped or why no one else sees it.",
          "score": 1,
          "created_utc": "2026-01-22 18:37:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o14lh26",
          "author": "Emotional_Witness233",
          "text": "I think that it’s better to ask for money only if you’re willing to give to the poor and needy. Otherwise, just do good things. You will never be satisfied by money unless the government satisfies you. So, do good anyway, and then you will find that people may give you money. \n\nRemember, your works will show people how they know you. If there’s no love, no human kindness, etc. there’s no true happiness in your work.",
          "score": 1,
          "created_utc": "2026-01-22 22:01:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vs8qm",
          "author": "PrettyRadio2073",
          "text": "Il segnale più chiaro? Quando ricevi solo 'reazioni positive' ma zero impegno reale. Nel mio libro, **'Startup Inferno'**, definisco questa fase come il **Limbo**.\n\nIl problema è che molti founder scambiano la cortesia delle persone per validazione. In realtà, il segnale definitivo che un'idea non vale la pena di essere perseguita è l'incontro con un **Fatal Flaw** che non può essere risolto senza tradire la natura stessa del progetto.\n\nEcco tre 'bandiere rosse' tratte dai gironi del mio manuale:\n\n1. **La Lussuria della complessità:** Se per spiegare il valore del tuo prodotto hai bisogno di dieci minuti e tre schemi, sei nel girone sbagliato. Se l'impatto non è immediato il mercato ti ignorerà.\n2. **L'Avarizia del margine:** Se l'idea sta in piedi solo se tutto va perfettamente e non c'è spazio per l'errore, sei destinato a bruciare capitali nello spreco.\n3. **Il Test del Grill:** Se metti l'idea sotto il **'Grill della validazione'** e chiedi un impegno economico (anche piccolo) o di tempo, e le persone spariscono, quella non è un'idea, è solo una bella storia da raccontare al bar.\n\nHo mappato i 9 gironi dell'imprenditoria proprio per aiutare a distinguere tra un'idea che scotta (buona) e una che ti brucia e basta (fallimentare). Se senti che qualcosa non ti convince, probabilmente hai intravisto un Fatal Flaw che la tua parte razionale sta cercando di ignorare.\n\nFidati del Grill, non dei complimenti.",
          "score": -3,
          "created_utc": "2026-01-21 16:46:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qljl63",
      "title": "i tracked $200k in side hustle income. here is the tier list of what is actually worth your time (and what is a trap).",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qljl63/i_tracked_200k_in_side_hustle_income_here_is_the/",
      "author": "Sensitive-Rub256",
      "created_utc": "2026-01-24 10:24:40",
      "score": 23,
      "num_comments": 27,
      "upvote_ratio": 0.63,
      "text": "i tracked $200k in side hustle income. here is the tier list of what is actually worth your time (and what is a trap\n\nBody: after my last few comments brought in a lot of questions, i decided to break down the data.\n\n\n\ni test side hustles to determine the actual hourly roi. my goal was to save for a house. i have about $200k in the slush fund now\n\n\n\nbut here is the reality: most side hustles are just low-paying second jobs. if you want \"beer money,\" read the low tiers. if you want \"freedom,\" skip to the god tier.\n\n\n\ntier 1: the shit tier (negative roi) do not do these. you are the product.\n\n\n\ndropshipping aliexpress: the only people making money here are the ones selling you the course. margin is zero.\n\n\n\nai art / pod: oversaturated. you are competing with bots.\n\n\n\nsurveys: i made $30 in a month. unless you are literally starving, your time is worth more than $2/hour.\n\n\n\ntier 2: the \"manual grind\" tier (linear income) good for quick cash, but you are trading your body/time for money.\n\n\n\nplasma donation: sold my blood for 3 years. it’s consistent ($400/mo), but it drains you. literally. good for emergencies, bad for wealth.\n\n\n\nfocus groups: (user interviews/hivemind). best \"low barrier\" option. i’ve made \\~$3k over 2 years giving feedback on products. pays well ($100/hr) but invites are inconsistent.\n\n\n\ndumpster diving (scrap metal): strictly for the desperate. copper/brass pays, but you are physically digging in trash at construction sites. i averaged $30/dive.\n\n\n\ntier 3: the \"math arbitrage\" tier (smart money) better, because it doesn't require physical labor.\n\n\n\nbank/broker churning: banks pay for customer acquisition. deposit $5k, get $400. i cycle through pnc, chase, and webull. made \\~$1.9k this year just moving money around.\n\ncounter-gambling (social casinos): exploiting \"sweepstakes\" loopholes on sites like stake/chumba. log in, collect the daily dollar, play the minimum blackjack hand with 99.5% rtp, withdraw. made \\~$10k, but it requires strict discipline. if you have an addictive personality, do not touch this.\n\ntier 4: the god tier (automated infrastructure) this is the only one that scales. i stopped selling my blood and started selling code.\n\nautomated \"drop-servicing\" agency: this is where the bulk of my new income comes from.\n\nthe concept: i realized businesses pay $2k/mo for lead gen and content.\n\nthe hack: instead of doing the work, i built \"agents\" (using n8n + openai) to do it.\n\nagent 1 (the hunter): scrapes reddit/linkedin for leads and drafts dms.\n\nagent 2 (the creator): turns youtube links into blog posts/tweets.\n\nthe roi: costs \\~$15/mo in api fees. generates \\~$2k/mo per client.\n\nwhy it wins: it’s the only hustle where i don't trade hours for dollars. i build the machine once, and it prints forever.\n\nthe conclusion plasma and churning got me the first $10k. automation is getting me the house. stop looking for \"gigs\" and start looking for \"leverage.\"\n\nedit: usual get flooded with dms asking how i built the \"n8n agents\" in tier 4. i can't reply to everyone, so i packaged the json source code and my dashboard into a instant installer, you can see it on my pinned post.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qljl63/i_tracked_200k_in_side_hustle_income_here_is_the/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o1es2hr",
          "author": "Black_hole8000",
          "text": "How is lead gen a side hustle? And fully automated at that? Seems like just an ad for your automation/lead gen service",
          "score": 38,
          "created_utc": "2026-01-24 11:33:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1evj23",
              "author": "AmountExotic2870",
              "text": "often, it is exactly what it seems like 😂😂😂",
              "score": 13,
              "created_utc": "2026-01-24 12:02:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1f5rac",
                  "author": "Black_hole8000",
                  "text": "Fr 😂 this trend of putting something valuable in a list with other things that don't even compare just to make it stand out is getting really annoying tbh.",
                  "score": 3,
                  "created_utc": "2026-01-24 13:17:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1fccfi",
              "author": "Efficient-Ant-2011",
              "text": "He also made $4m in real estate.",
              "score": 1,
              "created_utc": "2026-01-24 13:57:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1etab5",
              "author": "Sensitive-Rub256",
              "text": "lead gen is a 'job' if you are the one manually sending dms. it becomes a 'side hustle' when you script the labor. it’s just data arbitrage: i pay $0.05 for raw scraping + ai filtering, and the output is a qualified lead worth $50+. the 'hustle' isn't the outreach; it's building the machine that does it while i sleep. re: 'ad'  i shared the tool because  people in the comments asked 'how?'. feel free to build your own from scratch. i did.",
              "score": 0,
              "created_utc": "2026-01-24 11:43:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1f5jtl",
                  "author": "Black_hole8000",
                  "text": "Bro half the people here are professionals who can recognize a marketing strategy just by looking at it.\n\nPeople are asking you how because that's the objective of your post, just look at how you spoke of other hustles and how elaborate your explanation for the lead gen automation is (pain point ->  clear explanation -> ROI).\n\nAlso even if your post is purely educational, putting an automated lead gen and outreach system in the same list (even if not in the same tier) as metal scraping and blood donation is insane.\n\nIt's okay to promote your service, but respect other people's intelligence while you're at it.",
                  "score": 11,
                  "created_utc": "2026-01-24 13:15:51",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1fw4q8",
                  "author": "Icy-Inc",
                  "text": "You have the speech patterns and vocabulary of a well taught ChatGPT…. Hmmm",
                  "score": 2,
                  "created_utc": "2026-01-24 15:42:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1evtg3",
          "author": "Bumpy2017",
          "text": "This trend of making AI output lower case to not look like AI is super fun",
          "score": 16,
          "created_utc": "2026-01-24 12:04:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ft3y6",
              "author": "Rasputinnn",
              "text": "Right? Pretty much any modern device/software is going to auto capitalize. This just shows me that they took extra steps to try and look like an idiot.",
              "score": 2,
              "created_utc": "2026-01-24 15:27:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ffnan",
          "author": "why_chasing_Star",
          "text": "Nice ad bro",
          "score": 8,
          "created_utc": "2026-01-24 14:16:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ffdda",
          "author": "GeorgeHarter",
          "text": "OP’s probably not technically lying. \nHe says “agent 1… scrapes reddit…”\nHere he is on reddit, looking for business. \nMaybe the post is automated, referring curious people to his pinned post, which offers a follow-on pitch. \n\nHas he really been able to sell any leads to other companies? Who knows. But he’s selling something here on r/Entrepreneur.",
          "score": 3,
          "created_utc": "2026-01-24 14:14:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1g3k7o",
          "author": "GradeStrange2306",
          "text": "this is great. thanks",
          "score": 1,
          "created_utc": "2026-01-24 16:16:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ergt6",
          "author": "north0",
          "text": "To whom do you sell the reddit leads? Do you charge per lead? Or do you provide the lead generation function as a service?",
          "score": 1,
          "created_utc": "2026-01-24 11:27:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1es73l",
              "author": "Wide_Brief3025",
              "text": "It really depends on your model. Some folks sell leads directly, others charge for access or provide ongoing lead gen as a managed service. Pricing can be per lead or as a subscription. To save time finding valuable Reddit leads, tools like ParseStream help filter out noise and highlight quality opportunities so you can focus on the good stuff.",
              "score": 1,
              "created_utc": "2026-01-24 11:34:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1esl01",
                  "author": "north0",
                  "text": "So what value are you adding on top of ParseStream? If I'm selling windshield wipers and I want to know when to DM a reddit user a good deal on windshield wipers, can't I just use ParseStream to get alerted whenever someone mentions that they need wipers?",
                  "score": 1,
                  "created_utc": "2026-01-24 11:37:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1etotv",
              "author": "Sensitive-Rub256",
              "text": "I dont who the other guy is  but\n\ngood question. i don't sell the raw leads (selling data is a race to the bottom). i run it as **service arbitrage**.\n\n1. **the offer:** i find a b2b agency owner who needs more clients.\n2. **the deal:** they pay me a $2k/mo retainer to 'handle their outreach.'\n3. **the fulfillment:** i plug their niche into my **n8n agent**. the agent scrapes reddit/linkedin and sends the dms automatically.\n\ni charge for the *function*, not per lead. it’s basically running a marketing agency, but the 'employees' are just scripts running on a server. i actually packaged the agent code i use for this into a template (pinned to my profile) if you want to see how the arbitrage works",
              "score": -6,
              "created_utc": "2026-01-24 11:47:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1eks3p",
          "author": "Critical_Study5286",
          "text": "High ticket dfy systems are my favs 🤩",
          "score": 0,
          "created_utc": "2026-01-24 10:27:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1elkpc",
              "author": "Sensitive-Rub256",
              "text": "agreed. but only if the 'dfy' part is actually done by code, not your own sweat. otherwise you just bought yourself a high-paying job. automate the fulfillment, keep the high ticket.",
              "score": 0,
              "created_utc": "2026-01-24 10:34:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1enjgx",
                  "author": "Critical_Study5286",
                  "text": "Created by someone else, I just invite people and earn commissions 🤷‍♀️",
                  "score": 1,
                  "created_utc": "2026-01-24 10:52:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1el0u4",
          "author": "Wide_Brief3025",
          "text": "Building automated systems for lead generation on Reddit and LinkedIn is a huge leverage play, especially if you want to move beyond trading time for money. If you want to skip building agents from scratch, you could try out ParseStream since it alerts you in real time when the right keywords come up and filters the noise with AI. It saves a lot of manual work.",
          "score": -4,
          "created_utc": "2026-01-24 10:29:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1elqyd",
              "author": "Sensitive-Rub256",
              "text": "solid tool for beginners who want to rent the capability. personally? i refuse to pay a monthly subscription for a wrapper i can build myself. renting your leverage is a trap. owning the source code (n8n workflows) is the only way to keep margins at 95%. why pay a middleman tax when you can run the raw api yourself?",
              "score": -3,
              "created_utc": "2026-01-24 10:36:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1eniyc",
          "author": "Infamous-Crew1710",
          "text": "Nice.",
          "score": -2,
          "created_utc": "2026-01-24 10:52:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1enuqp",
              "author": "Sensitive-Rub256",
              "text": "very nice , I'm a professional",
              "score": -7,
              "created_utc": "2026-01-24 10:55:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qk1k8f",
      "title": "How do investors evaluate early-stage AI startups?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qk1k8f/how_do_investors_evaluate_earlystage_ai_startups/",
      "author": "NickyK01",
      "created_utc": "2026-01-22 17:56:20",
      "score": 18,
      "num_comments": 7,
      "upvote_ratio": 0.93,
      "text": "I’m trying to understand what makes early AI startups attractive from an investor perspective. Is it proprietary data, strong models, the team, or early traction?\n\nAI feels hype-driven right now, so I’m curious how real diligence works at the early stage.",
      "is_original_content": false,
      "link_flair_text": "Idea Validation",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qk1k8f/how_do_investors_evaluate_earlystage_ai_startups/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o13mdlj",
          "author": "OneHunt5428",
          "text": "They are looking for your unfair advantage usually a unique dataset a founding team with deep AI and domain expertise or a clearly defensible technical approach. The why you, why now story has to be incredibly strong to cut through the noise.",
          "score": 3,
          "created_utc": "2026-01-22 19:16:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17tl3q",
              "author": "0x33CCFF",
              "text": "This. I worked at an AI startup, left after 9 months. All they had was a good AI team from Google. But nothing to show for it internally no direction, and competitors way smaller were passing us by.. Yet they got over$10M in funding. \n\nStill to this day they have no product I can see. \n\nGood at a technology doesn't mean good in leading a business. Unfortunately this company is finding that out the hard way.",
              "score": 1,
              "created_utc": "2026-01-23 10:49:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1523n7",
          "author": "TommyBonnomi",
          "text": "    // if (presentation.contains('blockchain')) {\n    if (presentation.contains('AI')) {\n      fund = true;\n    }",
          "score": 2,
          "created_utc": "2026-01-22 23:28:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13yu8w",
          "author": "peretski",
          "text": "With a bubble warning, I would get out of AI right now…. It will be uninvestible for the next 5 years.  \n\nThe ai ship has sailed.",
          "score": 1,
          "created_utc": "2026-01-22 20:13:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16nygb",
          "author": "Seedpound",
          "text": "the  2 letters  a.i.",
          "score": 1,
          "created_utc": "2026-01-23 04:56:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a2417",
          "author": "b_an_angel",
          "text": "For AI startups specifically, I see investors looking at team background way more than usual - like do they have actual ML research experience or are they just riding the wave? The technical founders who can explain their approach without buzzwords tend to get further.\n\nWhat's interesting is how many AI companies are basically wrappers around OpenAI right now. I've seen some that differentiate with unique data pipelines or vertical-specific training, but a lot are just... ChatGPT with a nice UI. Those don't get far.\n\nEarly traction matters but it's weird with AI - sometimes a waitlist of 10k means nothing if your retention is garbage after the novelty wears off. The startups getting funded have either insane user engagement metrics or they're solving a really specific workflow problem that enterprises will pay for.",
          "score": 1,
          "created_utc": "2026-01-23 18:03:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhefgc",
      "title": "Ask me any marketing questions!",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qhefgc/ask_me_any_marketing_questions/",
      "author": "adrian-gonzal3z",
      "created_utc": "2026-01-19 19:42:35",
      "score": 15,
      "num_comments": 30,
      "upvote_ratio": 1.0,
      "text": "Did this a while back and thought it was fun so I'm doing it again.\n\nAsk me any marketing questions. My expertise is in SEO, email marketing, and social media.\n\nI'm not going to PM you or pitch you on anything after you comment. No strings attached, all I get out of this is some insight to use on pitching in the future.",
      "is_original_content": false,
      "link_flair_text": "Resources & Tools",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qhefgc/ask_me_any_marketing_questions/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0jcl2b",
          "author": "Spirited_Manager_831",
          "text": "What is the best way to start doing marketing for my fiction book? \n\nI create content on a regular basis and have a newsletter, but it's mostly education on how to write a book. \n\nHowever, my first book is almost ready for publication, and if I go down the independent route, I’ll have to market it myself.\n\nI know email marketing and social media are important, but do you have any advice for this industry in particular?",
          "score": 3,
          "created_utc": "2026-01-19 20:04:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0jj924",
              "author": "adrian-gonzal3z",
              "text": "Be super nice to smaller influencers and see if they're willing to promote it.\n\nYou could talk about the writing process itself on TikTok and see if people are interested in the story you're telling. Makes you and the story seem so much more relatable",
              "score": 2,
              "created_utc": "2026-01-19 20:35:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0sc5nx",
                  "author": "Spirited_Manager_831",
                  "text": "Thankyou!!!!",
                  "score": 1,
                  "created_utc": "2026-01-21 02:45:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0yzxxa",
              "author": "eXprtly",
              "text": "Define your ideal reader and discover were they hang out...and you guessed it...that's were you hang out.",
              "score": 1,
              "created_utc": "2026-01-22 02:04:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0jq8h3",
          "author": "PersonalEcho9244",
          "text": "If you were running both a service business and a local lead gen site at the same time, how would you prioritize marketing so one feeds the other?",
          "score": 2,
          "created_utc": "2026-01-19 21:08:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mgd4d",
          "author": "Loud_Piece_8212",
          "text": "What marketing tools do you use? How does your day-to-day usually look like?",
          "score": 2,
          "created_utc": "2026-01-20 06:23:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mgv1i",
              "author": "adrian-gonzal3z",
              "text": "Semrush, Canva, Adobe Suite, Screaming Frog are my main ones right now. I don't particularly like social media scheduling tools.\n\nday to day includes seeing my different clients emails and working on their deliverables",
              "score": 1,
              "created_utc": "2026-01-20 06:27:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0mxd8l",
          "author": "Comfortable_Weird891",
          "text": "I’m starting a LinkedIn and X account from literally 0 followers (no audience, no email list) for my startup. Will posting still be useful when I have 0 followers, or is it better to focus on engagement first?\n\nIf posting is still worth it, what’s the best way to start in the first 30 days? How often should I post, what formats work best early on (short posts, threads, visuals) and what should I prioritize between posting, commenting, and outreach to get the first 100 followers?",
          "score": 2,
          "created_utc": "2026-01-20 08:54:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ooh80",
          "author": "BetaOfficeUK",
          "text": "For a niche B2B service (UK virtual office / compliance-adjacent),\n\nwhat have you seen work best early on to build trust and get the \\*first\\* paying customers?\n\n\n\nContent seems to get attention, but converting that attention into actual trust is the harder part.\n\nCurious where you’d focus first if you were starting from scratch.",
          "score": 2,
          "created_utc": "2026-01-20 15:56:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jkjg0",
          "author": "DecisionOperator",
          "text": "what’s the fastest way to prove your marketing isn’t just “activity”?\n\n\ngive me one metric you trust, one action that moves it, and the earliest point you’d admit it’s not working and cut it.",
          "score": 1,
          "created_utc": "2026-01-19 20:41:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l01n7",
          "author": "SneezerEclipse",
          "text": "There is this TCG that totally flopped on their tech side (Altered TCG).  It had massive momentum from its Kickstarter campaign, but then they overpromised on delivering the product.  There aren’t any stores selling singles (where you buy one card at a time.  The game is dead, is the mantra on their subreddit.\n\nAnyways, they finally released the marketplace.  They allow print on demand for any card that a player owns.  So what did I do?  Degenerate gambling per usual.  \n\nI bought up all the first edition meta, collectible, and favorite cards I like, to a guess of 2-3% of their total print for these cards.  I didn’t want to hinder the game, but I wanted to take advantage of a low market.  \n\nThe company hasn’t given up yet and is in set 5, but the digital cards they offer don’t move in price much in the digital market because only a relative few cards are being bought while the other are being dumped.\n\nMy question is, how can I inspire a market bounce?  The Kickstarter cards seem to have created a precedent that digital cards “should be worthless.”  I believe that all the cards should be subject to “investors” and that the pricing of the cards should be both the cards that are doing well in tournaments and the cards that people love to collect.  \n\nAny ideas for online advertising for a worthy but struggling TCG?\n\nSorry, this is long.",
          "score": 1,
          "created_utc": "2026-01-20 01:05:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l4c8g",
          "author": "Extreme_Log5264",
          "text": "What's your advice to someone trying to get their foot in the door for an entry level career job? Especially with today's job market.",
          "score": 1,
          "created_utc": "2026-01-20 01:28:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n4uyh",
              "author": "bersuku",
              "text": "Get results for a business. Do it for free to build up your street cred. Learn how to leverage AI.",
              "score": 1,
              "created_utc": "2026-01-20 10:05:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0mmrlb",
          "author": "MORPHOICES",
          "text": "If today you had nothing but a scrappy solo project, for example, what would your first 30 days of marketing actually look like? \\~\n\nThe realistic plan, with limited time, no audience and no budget, is the one we create.",
          "score": 1,
          "created_utc": "2026-01-20 07:17:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mnndo",
          "author": "Training-Dinner1660",
          "text": "Se agradece tu predisposición. Ahí va mi pregunta. ¿Cuál puede ser un Stack de Apps adecuado para lanzar un SideHustle, y para qué utilizarías cada herramienta?\n\n¡Mil gracias!",
          "score": 1,
          "created_utc": "2026-01-20 07:25:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0msrko",
          "author": "cryptic_epoch",
          "text": "Which tools or platforms do you use to generate customer leads for your business  ?",
          "score": 1,
          "created_utc": "2026-01-20 08:11:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mvkp4",
              "author": "Wide_Brief3025",
              "text": "Focusing on where your audience already hangs out is huge for lead generation. Reddit and Quora are goldmines if you know how to listen for the right conversations. If you want to track high intent mentions instantly without digging through posts manually, ParseStream is worth a look since it alerts you about relevant leads with AI filtering.",
              "score": 2,
              "created_utc": "2026-01-20 08:37:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0mwu7v",
                  "author": "cryptic_epoch",
                  "text": "Fascinating! Let me have a look..",
                  "score": 1,
                  "created_utc": "2026-01-20 08:49:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0n6fpb",
          "author": "Vaibhav_codes",
          "text": "Nice offer ! Curious from your experience: what’s actually working in SEO right now for early stage products with low authority content, programmatic pages, partnerships, or something else?",
          "score": 1,
          "created_utc": "2026-01-20 10:20:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n7w24",
          "author": "straight_forward13",
          "text": "I run a struggling general trading company in Dubai, started it 2 years ago. I have many suppliers for  most any goods that fall under the general trading category in Dubai. \n\nBut I can't get clients and I don't have funds for marketing or ads. It's mostly word of mouth but the clients I do get ask credit. I cannot afford to supply on credit, I can only do 80 to 100%  cash advance. \n\n\nPlus many customers already have established suppliers. So the competition is really heavy\n\nAnd now it's renewal is coming up in 2 months. Any advice would be appreciated",
          "score": 1,
          "created_utc": "2026-01-20 10:33:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o9ef3",
          "author": "RowTime8498",
          "text": "I'm making a productivity app that emphasizes consistency and doing less actually means achieving more using some psychology principles. How do I get people to know about the app? I've tried social media posts, but they usually don't get many views. I know consistency matters with the posts, and I am happy to keep posting, but in the meanwhile while the channels grow, what am I to do marketing wise? \n\n  \nThanks in advance!",
          "score": 1,
          "created_utc": "2026-01-20 14:42:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pil95",
          "author": "iNavin",
          "text": "How would you go about B2B Tech Services. If you could elaborate on at least one thing that is a must/foundational to anything else to build over?",
          "score": 1,
          "created_utc": "2026-01-20 18:14:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0sijlz",
          "author": "Flashy_Plate_5409",
          "text": "How do you drive traffic onto any online business physical/digital products",
          "score": 1,
          "created_utc": "2026-01-21 03:23:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0srthd",
          "author": "Historical_Toe_7929",
          "text": "\\#1 rule to be indexed in LLM?",
          "score": 1,
          "created_utc": "2026-01-21 04:21:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tsd4z",
          "author": "Optimal-Ad-1158",
          "text": "I have created a shopify app which allow customers to choose date and time slot for their products delivery and local pickup and allow merchants to configure these dates and slots.\nWhat will be the best way to market this app.\nThere are already multiple established apps in this space.",
          "score": 1,
          "created_utc": "2026-01-21 09:26:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15i710",
          "author": "Sea-Veterinarian2461",
          "text": "How would you market a financial app like Yumo that’s available on App Store and Playstore! I would really appreciate if you could help the marketing of it!",
          "score": 1,
          "created_utc": "2026-01-23 00:53:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1akm8v",
          "author": "Miserable_Way_9308",
          "text": "I'm launching a newsletter from scratch, and so far, the engagement numbers are very good (high open rate, zero unsubscribes), but the subscriber base is small.\n\nMy biggest question right now isn't the content, but how to scale without sacrificing that initial quality:\n– Which channels would you prioritize initially?\n– What mistakes would you avoid in this early stage?\n– And when would you start to really push for growth?\nDo you have any frameworks or experiences that have worked for you to scale newsletters without diluting them?",
          "score": 1,
          "created_utc": "2026-01-23 19:27:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhsuoe",
      "title": "What was the first thing you stopped doing that helped your business grow?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qhsuoe/what_was_the_first_thing_you_stopped_doing_that/",
      "author": "SignPsychological728",
      "created_utc": "2026-01-20 05:48:36",
      "score": 13,
      "num_comments": 10,
      "upvote_ratio": 0.93,
      "text": "Most advice for founders focuses on what to do more of more features, more marketing, more hustle.\n\nBut in my experience, progress often comes from removing things instead.\n\nI’m curious to hear from people building or running businesses:\n\n* What was the first habit, task, or assumption you *cut* that actually helped growth?\n* Was it saying no to certain customers?\n* Dropping features?\n* Stopping a marketing channel that wasn’t working?\n* Letting go of trying to do everything yourself?\n\nWould love to hear real examples of what you stopped doing and how that decision changed things.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qhsuoe/what_was_the_first_thing_you_stopped_doing_that/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0n55vc",
          "author": "bersuku",
          "text": "Stopped splitting my time across different projects. You can have more than one, but only one should be prioritized at a time.",
          "score": 2,
          "created_utc": "2026-01-20 10:08:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mgb9j",
          "author": "kubrador",
          "text": "stopped checking my email every 5 minutes and somehow the business didn't implode, turns out my anxiety was the only thing dying",
          "score": 1,
          "created_utc": "2026-01-20 06:23:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nb4pl",
          "author": "Big-Engineering-9365",
          "text": "Trying to post everywhere, pick one Platform and stick with it",
          "score": 1,
          "created_utc": "2026-01-20 11:01:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0od5mk",
          "author": "haseeb1431",
          "text": "Trying to do everything myself instead of trusting people. \n\n\"80% done by someone on team is better than 100% by myself'",
          "score": 1,
          "created_utc": "2026-01-20 15:01:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0oycid",
          "author": "StillLoadingit",
          "text": "The first thing I stopped doing was trying to manage every little piece myself and instead focused on the parts that actually move the business forward. Once I cut out the small admin tasks I could spend way more time improving onboarding and talking to users.",
          "score": 1,
          "created_utc": "2026-01-20 16:41:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qjtm3",
          "author": "LaFriedaSupports",
          "text": "Having ran several businesses, I was so focused on getting it out there everywhere I could. Years later, I am now realizing I don’t want to do all this extra work and get no results. I stopped listening to random SM advice and decided to concentrate on 2 channels for marketing. It will be a hard one for me. It may move slowly but knowing how to do multiple things halfway does not make you an expert or drive success in it unless you give 100% focus and are good at just 1 particular thing.",
          "score": 1,
          "created_utc": "2026-01-20 21:05:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qtnw7",
          "author": "EdisynAI",
          "text": "Stopping developing and just making it MVP to push into the market",
          "score": 1,
          "created_utc": "2026-01-20 21:50:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u4gme",
          "author": "ari_strauch",
          "text": "Stopped checking my Google rankings every 5 minutes. It was driving me crazy, wasn't a true indicator of success and was a perfect example of having my work priorities in the wrong place.",
          "score": 1,
          "created_utc": "2026-01-21 11:16:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16c6z2",
          "author": "DependentNew4290",
          "text": "I stopped focusing on multiple features to add to the MVP, and just focused on one core feature that really solves a problem.",
          "score": 1,
          "created_utc": "2026-01-23 03:42:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjogpv",
      "title": "Considering outside financial help as the business grows",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qjogpv/considering_outside_financial_help_as_the/",
      "author": "Chirag_koshti",
      "created_utc": "2026-01-22 07:46:31",
      "score": 12,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "I am running a growing business and financial tasks are taking more time than before. Managing cash flow, budgeting, and tracking numbers is becoming harder to handle alone.\n\nI am thinking about getting outside help instead of managing everything myself. I want to understand how this worked for others at a similar stage.\n\nIf you have been through this phase, what worked for you and what would you do differently?",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qjogpv/considering_outside_financial_help_as_the/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o10j40i",
          "author": "Eastern-Lock-4109",
          "text": "Hiring a qualified person for this will definitely help more than going to an agency, and that is what we did too. But if costs are a big factor, then maybe try outsourcing all the management. There are a lot of financial management businesses and agencies that are just a quick google search away, you just have to choose which of these two options is for you.",
          "score": 1,
          "created_utc": "2026-01-22 08:37:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10n5uv",
          "author": "kubrador",
          "text": "hiring a bookkeeper is like finally admitting you're too busy being successful to stay broke, which is objectively a win.\n\nmost people wait until their finances look like a crime scene before getting help, so you're already ahead. start with a part-time bookkeeper or fractional cfo and don't overthink it. if you're asking this question you probably need it yesterday.",
          "score": 1,
          "created_utc": "2026-01-22 09:15:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11blvl",
          "author": "Willing-Training1020",
          "text": "yeah this is super common once you hit a certain growth stage — financial stuff just compounds and suddenly you're spending hours on things that aren't actually moving the business forward. what worked for me was hiring a remote ops/finance person to handle the day-to-day stuff (bookkeeping, cash flow tracking, invoicing, basic reporting) while i focused on higher-level decisions. ended up going with someone from the philippines through a recruiting firm — way more affordable than a local hire and honestly the quality was great. freed up a ton of mental bandwidth. if i could do it differently, i'd have done it sooner tbh. the longer you wait, the messier the books get lol. are you thinking fractional cfo type help or more like a bookkeeper/ops assistant?",
          "score": 1,
          "created_utc": "2026-01-22 12:38:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11fuef",
          "author": "Vaibhav_codes",
          "text": "Bringing in an accountant or part time CFO early was a game changer for us  It freed up my time, improved cash flow visibility, and helped avoid costly mistakes Definitely worth it",
          "score": 1,
          "created_utc": "2026-01-22 13:04:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11may5",
          "author": "Possible_Adagio_3074",
          "text": "Whats your current annual revenue, industry and financial challenges?",
          "score": 1,
          "created_utc": "2026-01-22 13:41:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o170rqo",
              "author": "Chirag_koshti",
              "text": "Right now it’s still in the growth phase, so revenue isn’t very high yet. It’s a service-based business. The main challenges are cash flow planning, organizing financial reports, and keeping day-to-day finances on track while trying to scale. That’s why I’m looking at outside help early instead of waiting until things get messy.",
              "score": 1,
              "created_utc": "2026-01-23 06:30:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o133qtc",
          "author": "Drumroll-PH",
          "text": "I went through the same thing a couple years ago I brought in a part time accountant first just to handle bookkeeping and reports and it freed me to focus on growth Later I added a CFO type consultant a few hours a month for strategy Biggest lesson dont wait until numbers are overwhelming get help early so decisions are faster and less stressful",
          "score": 1,
          "created_utc": "2026-01-22 17:54:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qis98t",
      "title": "Month 8 update - hired first employee and the phone situation almost broke me",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qis98t/month_8_update_hired_first_employee_and_the_phone/",
      "author": "Dangerous-Guava-9232",
      "created_utc": "2026-01-21 08:14:44",
      "score": 11,
      "num_comments": 7,
      "upvote_ratio": 0.92,
      "text": "Quick update for anyone following along. Revenue hit $12k this month which is great, but I hired my first employee (finally) and realized my phone setup was completely inadequate for a two-person operation.\n\nI was still using my cell phone for everything. When I hired Sarah, I had to give her my personal number to use when customers called during her shifts. This obviously sucked for multiple reasons. Customers would text my personal phone at weird hours, Sarah did not have access to voicemail, and I had no way to track which calls she was taking versus which ones I was handling.\n\nSpent a few days this month getting a real business phone system sorted. Now we have a main business number, both of us can answer from our own phones, and there is proper voicemail that we can both access. Small thing but it made me feel like an actual business instead of a guy with a mop.\n\nLesson learned is you do not realize how janky your solo setup is until you try to bring someone else into it. Fix the infrastructure before you hire, not after.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qis98t/month_8_update_hired_first_employee_and_the_phone/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0tukdg",
          "author": "kubrador",
          "text": "the fact that you handed your personal number to an employee is hilarious. sarah probably has your pizza order history mixed in with customer complaints about her service",
          "score": 1,
          "created_utc": "2026-01-21 09:48:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u2uee",
          "author": "ari_strauch",
          "text": "Following this as I'm always fascinated at the start and development of new businesses. Very curious how this plays out.",
          "score": 1,
          "created_utc": "2026-01-21 11:03:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uar6y",
          "author": "outdahooud",
          "text": "Congrats on the hire. The phone thing is so real, I ran into the exact same issue when I brought on my first person. You suddenly realize how many of your systems are just workarounds that only make sense in your own head",
          "score": 1,
          "created_utc": "2026-01-21 12:05:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ul6j1",
          "author": "BarberUnited7894",
          "text": "I went through this exact same thing with my lawn care business. Switched to nextiva when I hired employee number two and it made coordinating so much easier. We both have the app on our phones, can see who is calling, and can transfer calls between us if needed. Cost is like $30 a month for both of us.",
          "score": 1,
          "created_utc": "2026-01-21 13:14:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vgpdl",
          "author": "techside_notes",
          "text": "I ran into something similar when I started collaborating on even small projects. What felt fine solo suddenly became chaotic once another person needed access. For me, the biggest relief was standardizing where communications lived and which tools were “official” versus personal. It doesn’t feel flashy, but having a clear boundary for calls, messages, and tasks makes adding people far less stressful.\n\nI’ve found that building that little infrastructure first, even for just one collaborator, saves mental energy more than any growth hack or workflow tweak.",
          "score": 1,
          "created_utc": "2026-01-21 15:54:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ytdxy",
          "author": "CleanOpsGuide",
          "text": "This is such a real milestone. One thing I didn’t expect early on was how hiring exposes invisible dependencies, not just tools, but assumptions you didn’t realize you were carrying solo.\n\nEvery new person is basically a stress test for your infrastructure. Fixing things early doesn’t feel urgent… until it suddenly is.",
          "score": 1,
          "created_utc": "2026-01-22 01:27:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tz33b",
          "author": "rephrazo",
          "text": "Big congrats $12k month + first hire is a real “this is a business now” moment.\n\nAnd yep, the phone setup pain is so real: solo hacks work until the second person shows up, then everything breaks.\n\nWhat service did you switch to?",
          "score": 0,
          "created_utc": "2026-01-21 10:30:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjpfm7",
      "title": "Do entrepreneurs sometimes have to sacrifice hobbies to truly succeed?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qjpfm7/do_entrepreneurs_sometimes_have_to_sacrifice/",
      "author": "cutecandy1",
      "created_utc": "2026-01-22 08:46:27",
      "score": 9,
      "num_comments": 31,
      "upvote_ratio": 0.72,
      "text": "I’m looking for advice from people who are building businesses, side hustles, or long-term financial independence—especially those who’ve had to make hard trade-offs.\n\n# My primary goal (top priority):\n\n**Building long-term financial independence through trading and entrepreneurship**\n\nI’m heavily focused on:\n\n* Researching financial markets (stocks & options)\n* Developing and testing trading strategies\n* Working toward becoming a consistently profitable trader\n* Long-term goal: starting my own trading firm once I’ve proven edge and consistency\n\nThis requires deep focus, long hours, and sustained mental energy. I don’t see this as a “side project” — it’s something I want to build my life around.\n\n# Other important (but supporting) goals:\n\n1. **Career stability to support entrepreneurship** \\- I have a job offer in Spain and plan to move and settle there. That means:\n   * Learning Spanish seriously\n   * Doing well at my job so that I have a good position within the firm.\n   * Being good at my job reduces the possibility of layoff in the future and being good at Spanish will help in case I lose my job and have to find a new one. It also helps with applying for the Permanent Residence (PR) and eventually for the Spanish passport.\n   * My point is - If my goal is to relocate to Spain, I am going to have to spend a considerable amount of time and effort into doing the things that are going to help me in achieving this goal.\n2. **Health, fitness, and longevity** \\- Regular gym, disciplined workouts, good diet. This is non-negotiable because poor health destroys long-term performance.\n3. **Relationships and social life** \\- Building a healthy relationship, socializing, meeting people, and eventually finding a life partner. Important, but also time- and energy-intensive.\n\n# The conflict:\n\nAlongside all of this, I have hobbies:\n\n* Badminton\n* Social dancing (salsa, bachata, kizomba)\n* Occasionally chess\n\nThe issue is that hobbies aren’t free. They require real time and effort, and sometimes money (classes, events, practice). Any time spent here is time *not* spent improving my trading edge, researching markets, or compounding skill.\n\nOne important clarification:  \nI actually enjoy the process of building my goals. I like researching markets, developing strategies, working out, and improving myself. This isn’t a misery vs pleasure trade-off.\n\nHobbies, on the other hand, are enjoyable but non-compounding. I’ll never be a professional dancer or athlete. They don’t create leverage, income, or long-term advantage—just short-term enjoyment.\n\n# The real question:\n\nAmong entrepreneurs, it’s often said that success requires obsession, focus, and sacrifice.\n\nSo I’m asking this directly:\n\n**Is completely cutting out hobbies a reasonable—or even necessary—cost of building something meaningful?**\n\nNot reducing them.  \nNot “balancing” them nicely.  \nBut intentionally eliminating them (at least temporarily) to maximize focus and execution.\n\nI’m worried that trying to balance too many things leads to being average at everything—especially in something as competitive as trading and entrepreneurship.\n\n# Questions for those further along:\n\n* Did you sacrifice hobbies while building your business or side hustle? If yes, was it temporary or long-term?\n* Did it materially speed up your progress?\n* At what point do hobbies become a distraction rather than recovery?\n* Is “work–life balance” overrated in the early stages of building something real?\n\n\n\nI understand the theoretical answer to this dilemma. As far as I know, the “correct” solution is to maintain some kind of balance—something like 70–30 or 80–20, where 70–80% of your time and effort goes toward goals and 20–30% goes toward hobbies. Even a 50–50 balance can make sense for some people. I understand that. I really do.\n\n\n\nBut what I’ve observed in real life is this:  \nPeople who try to balance too many things at once often don’t truly excel at the few things they actually want most. They stay average across the board. And that’s exactly what I don’t want.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qjpfm7/do_entrepreneurs_sometimes_have_to_sacrifice/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o11lgrl",
          "author": "Unique-Painting-9364",
          "text": "From my experience it’s less about cutting hobbies completely and more about using them intentionally. When hobbies support recovery and mental clarity they actually improve focus. The real danger isn’t hobbies, it’s unfocused effort and pretending everything is equally important",
          "score": 7,
          "created_utc": "2026-01-22 13:36:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o143nvh",
          "author": "the_aiaddict01",
          "text": "I like to view entrepreneurship as sort of a plane taking off so when it takes off it takes a tremendous amount of fuel. Specifically if you're starting from zero. It just takes so much work. But once you get going and once you figure out some of the quirks of the niche you're in, it takes off and it's more about maintenance. \n\nYou off course don't want to give up your whole life to start this, but yes, sometimes it does require sacrifice. It just depends on how bad you want it. If you start a business and dedicate 1-2 hours a day, yes it might work, but you have a substantially lower chance of it working than someone who lives and breathes that business and works 15 hours a day. \n\nIt just depends on your personal goal. Some people like living a balanced life, and there's nothing wrong with that. Other are just obsessed and will dedicate hundreds of hours to their work, those are usually the top performers (think Elon Musk), but yes, of course it comes with sacrifices.",
          "score": 3,
          "created_utc": "2026-01-22 20:36:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10y238",
          "author": "Previous_Shopping361",
          "text": "Yes",
          "score": 3,
          "created_utc": "2026-01-22 10:55:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o118x09",
          "author": "shitalimalviya",
          "text": "Very few people in this world are able to turn their hobby into success.  \nMost people end up making money by focusing on something entirely different and that’s exactly why not everyone is an entrepreneur.",
          "score": 2,
          "created_utc": "2026-01-22 12:19:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o128qt6",
          "author": "Embarrassed_Key_4539",
          "text": "Running a business leaves little room for anything else, but if you don’t make the time for yourself you will burn out",
          "score": 2,
          "created_utc": "2026-01-22 15:34:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10n3q7",
          "author": "kubrador",
          "text": "you're describing cutting hobbies to optimize for trading, which is hilarious because trading already requires the exact mental discipline that hobbies actually give you. you're about to burn out optimizing for something that demands you don't burn out.\n\nthe people who tell you they sacrificed everything usually sacrificed hobbies, not sleep or health and they mention health second for a reason. you've already figured out that fitness isn't negotiable, which means you know obsession without recovery is just a speedrun to mediocrity.\n\ncutting badminton won't make you a better trader. it'll just make you a trader with no outlet. do the 80/20 thing and stop trying to convince yourself that being miserable is the same as being focused.",
          "score": 1,
          "created_utc": "2026-01-22 09:14:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10naxe",
              "author": "cutecandy1",
              "text": "Thanks a lot for your words. Completely agree with you.I will do the 80/20 thing and balance out my goals with hobbies.",
              "score": 1,
              "created_utc": "2026-01-22 09:16:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o110alv",
          "author": "Auios",
          "text": "Yes",
          "score": 1,
          "created_utc": "2026-01-22 11:14:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11vy3c",
          "author": "ButterscotchAlive736",
          "text": "As someone who daytrades fulltime for the past 4 years, I’ll be happy to answer any questions you got 😁",
          "score": 1,
          "created_utc": "2026-01-22 14:31:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o13hg84",
              "author": "greyspurv",
              "text": "what do you trade? Fx, futures etc? what is your daily ROI on average?",
              "score": 1,
              "created_utc": "2026-01-22 18:54:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o13i99z",
                  "author": "ButterscotchAlive736",
                  "text": "Fx, there is no such thing as daily or monthly ROI average lol. I dont set targets. I take any setup I can catch. Some days I dont trade, some I take 1-3 trades, some 5-10. It depends on market conditions and if I manage to catch my setups. So it can be 0%, -3%, 2%, 5%, 8% 10%+ etc. \n\nWhoever tells you they have consistent average is probably lying lol. 10% a month is a sweet spot but even then, I wouldn’t say that’s average lol",
                  "score": 1,
                  "created_utc": "2026-01-22 18:58:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11yo60",
          "author": "AcanthaceaeNorth6189",
          "text": "I've been in business for almost two years, from the idealism at the beginning to the trough of front-end time, and then to today I understand a little truth. It's hard to get rich all at once, and it's similar to buying a lottery ticket. The real appearance of entrepreneurship is likely to be to cultivate a certain direction or constantly integrate resources, and entrepreneurship is a marathon race that tests endurance rather than a sprint.\n\nFrom the excitement at the beginning to the loss later, I had to reflect on whether there was a problem with relying on short-lived passions. I can easily get excited and then work hard for half a month to three months, sleeping only 4-5 hours a day for several weeks, but the results of these sprints were failures. The answer is obvious, this is not true, I try to cover up my ideological laziness with action efforts, and I devote all my passion to entrepreneurship in a very small part of what I am best at - technology research and development. I made a mistake; I made the mistake of comforting myself.\n\nMy current understanding is that the key to running a marathon is to be persistent, and persistence cannot rely on passion, and you cannot always force yourself and suppress yourself when it is not necessary. You need to find a balance, a balance with the highest efficiency, and balance relaxation and work. It doesn't sound right, and now I think it's far better to stick with it than to try to rush and then fail.\n\nSecondly, entrepreneurship is mental work, and it is not difficult to find an idea that excites you, but the difficult thing is how to constantly screen and verify the commercial viability of this idea. I need to keep learning and understanding relevant knowledge, and I need to really find people related to the problem to understand and communicate. I used to think that \"doing as you go\" and \"being willing to accept imperfection\" meant that you should act on your ideas immediately. But I was wrong, the real thing should be: study carefully first, then verify carefully, and then try and make mistakes quickly on a minimum scale. We often hear the last part, and the first part is not taken seriously. I think the idea of a great product must not be determined in 2 weeks, and we cannot ignore the channels mastered by experienced product managers and the time acceleration brought by experience.\n\nFinally, back to your question, I think your hobbies allow you to reach more good, different people, which can be perfectly integrated into your goals. I mean, we should look at issues from multiple perspectives, and the final decision should serve our long-term goals; that's all that matters.",
          "score": 1,
          "created_utc": "2026-01-22 14:45:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o123g4n",
          "author": "brian_rey_2023",
          "text": "You can design hobbies that help you get better? \n\nI wanted to learn analytical thinking/data analysis so I ended up learning about baseball. Wanted to think better a few steps ahead, started to play chess. Somehow over time you end up developing a new type of personality/taste.\n\nI enjoy watching documentaries, etc.\n\n> disclaimer: many times I question if I should take myself easier and enjoy more other things in life so.\n\nFor me it's been useful to think in terms of regret minimization later on (Jeff Bezos framework that pushed him to start Amazon).\n\nAnd many things that used to take a lot of time are consuming significantly less time now due to AI so if we have more time.\n\nAlways play for the long game!",
          "score": 1,
          "created_utc": "2026-01-22 15:09:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12k1m2",
          "author": "dragonflyinvest",
          "text": "Sure, but always find time to stay fit, eat well, and get your rest.",
          "score": 1,
          "created_utc": "2026-01-22 16:25:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13ctiu",
          "author": "sameer_somal",
          "text": "Honestly, it depends on what the hobbies are. I remember cutting out television completely while building a business because of some excellent advice I received. But my other hobbies (like working out or sports for you) became part of my routine because it helped clear my brain and actually be more productive.  You have to intentionally choose what you keep part of your routine that actually fuels your dreams and vision.",
          "score": 1,
          "created_utc": "2026-01-22 18:34:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13d087",
          "author": "Drumroll-PH",
          "text": "When I was building my 3D skills seriously I let most hobbies go for months no games no long strolls just work and small daily practice. It was intense but I definitely leveled up faster. You can always bring hobbies back later once your foundation is strong.",
          "score": 1,
          "created_utc": "2026-01-22 18:35:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13lsek",
          "author": "FatherOften",
          "text": "I read about half of your post.But as someone that has a lot of experience with a large family, a few hobbies, and a large business, as well as other assets....\n\nThere is no balance. There is seasons where things will be more balanced. It's not the beginning though. The first four or five years.You'll need to go hard if you're gonna make money. \n\nYou can jungle a relationship.But you need to make damn sure that that person understands the ride that they're about to join for the rest of their life with you. \n\nAs far as hobbies go, just cut that idea out same with social stuff. If you keep things as a side gig, then you might be able to juggle them. Working full time and building a business.You're not going to have time to do hobbies. I climbed and surfed professionally from a young teenager into my early twenties. I'm good and have a strong passion for the outdoors. \n\nI was not able to find any way to include hobbies on my journey. At 38 I started my current business. I achieved fuck you money a few years ago. I went out and I spent a few thousand dollars replacing all of my rock.Climbing and big wall climbing gear for myself, and some of my older children. I bought new kites surfing rigs.I bought new surfboards.I bought new wetsuits.I bought all the stuff.\n\nMy day usually ends in the late afternoon. And I go locally to some cliffs within thirty minutes, and I put up new routes with a buddy a couple times a month currently. I take at least two trips a year to climb remote big walls. Usually there's five or six surfing endeavours in different countries on trips that I take with my wife and children. If there's a significant event for occasion or for surfing a swell, I will jump on a small plain and fly to wherever it's at. I can afford these things because I control my time and money. They are not my primary focus, though.My family is, and then my business.\n\nI would not have gotten here if I had tried to balance and have the happy lifestyle.That everyone wants to achieve. If you read biographies of all the greatest people throughout history in any endeavor you will see that this is true.\n\nI spin all the plates as well as I can. And as I drop them, I lean down to pick them up. Whether it be family or spouse or focused time with one of my 10 children, or business.... I pieced the plate back together, and then I started spinning.But while I do this, other plates start to fall.\n\nI have an amazing wife that understood the hell that we were gonna go through for a while to get to where we are now. She was already retired as being a college professor and was rate or traveled the world and her three children were already grown. My youngest of the 6kids I brought to the marriage was 1 at the time. Not only did she have to be willing to eat the shit sandwiches for years and years, and possibly not ever reached the promised land. She had to be willing to start over in parenthood. After raising three kids successfully through college.\n\nShe is my ride or die. She travels a lot more than I do.Because she teaches our youngest homeschooling. World schooling is more apt because last year alone they took 19 trips with 9 of them being 3-4 weeks long each. She just got back from a month long trip.Studying the mayans in the yucatan, with my youngest daughter, and then she's in oklahoma with our adult son and visiting her grandkids.Before she comes home tonight. I think she has a trip to new mexico and washington state coming up before germany later in the spring. I go on some of the trips and other ones.I stay back to grow the company and I'll fly in to wherever they're at with our other children. Sometimes I fly out my adult children with the grandkids, and sometimes it's just the grandkids.\n\nYou gotta get to the point where you have the control to do all the things. In the beginning, the focus is building the skill sets and the knowledge. And the character and the experience to even get to the starting line. And then you have to get traction, and then you have to survive the first five years of scaling.\n\nIt's worth it.",
          "score": 1,
          "created_utc": "2026-01-22 19:13:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13tein",
          "author": "zenbusinesscommunity",
          "text": "Focus matters early on, but going scorched earth on everything else usually backfires. Hobbies like dancing or sports are more recovery than they are wasted time, especially when you’re doing mentally heavy work like trading. Most people who stick it out don’t cut hobbies completely, but just get more intentional with them.",
          "score": 1,
          "created_utc": "2026-01-22 19:48:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15fizh",
          "author": "funkyBH",
          "text": "You can’t have it all bro. You gotta sacrifice to win. If you want to compete. But if you wanna get by I’m giving the wrong advice.",
          "score": 1,
          "created_utc": "2026-01-23 00:39:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15qn6m",
          "author": "psyduckpikachu",
          "text": "I have been building saas for the last 2 years or so. not successful financially, still learning as I move forward. \n\nTo answer your questions:-  \n1. I didn't cut out my hobbies completely right from the start, but I genuinely love what I do, and I gradually carve out more time to focus on building saas, running a business and it's just natural for me to spend less time on other things, or find a replacement for them.\n\n2. Did I sacrifice my hobby? I wouldn't say I sacrificed my hobbies. I used to do powerlifting, but I am getting old and my mindset shifted. Instead of lifting heavy all the time, I want to be more flexible, have more endurance. my goal changed, so does my workout and how I fit it into my day\n\n3. Did it speed up my process? Yes, powerlifting takes up 2 hours per sesh. But if I just stretch and do bodyweight exercises, it takes considerably less time, but again, it was a natural progression for me to go from powerlifting to bodyweight exercises\n\n4. There's no work life balance. I have a young family, so it's just work, take care of family, try to eat healthy, try to do some exercise everyday, and hope that I can fall asleep at night. I don't sleep well. I think about my work a lot. It's rare for me to even go out with friends these days. \n\nI guess we are all just trying our best to make it, so best of luck to you, friend",
          "score": 1,
          "created_utc": "2026-01-23 01:41:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16pf9a",
          "author": "jared-mortensen",
          "text": "Business = Hobby when you are an entrepreneur",
          "score": 1,
          "created_utc": "2026-01-23 05:06:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17lz77",
          "author": "Intelectual_Goat",
          "text": "if your hobbies include sports or generally understood healthy activities and you sacrifice then to grind, for me you lost already",
          "score": 1,
          "created_utc": "2026-01-23 09:40:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1873x1",
          "author": "Historical_Toe_7929",
          "text": "In less than a year, we’ve built a $1M+ RMR business. It’s still a startup.\n\nThe reason we were able to do it:\n\n\t1.\tIt’s not our first rodeo. We know how to build businesses.\n\t2.\tWe had a roadmap, a step by step structure for what we do daily, weekly, and monthly.\n\t3.\tWe sacrificed everything. And I mean EVERYTHING: family time, travel, friends, shopping, weekends. Our first day off since November 2024 was Christmas Day 2025.\n\nBut today, we can have all of that back.\n\nAnd you can have it day one if you hire the right, expensive experts from day one and delegate this experience to them.\n\nIt’s all about trade-offs.\nYou sacrifice one way or another.",
          "score": 1,
          "created_utc": "2026-01-23 12:32:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o196sc2",
          "author": "rafbo",
          "text": "Misconception, doesn’t have to be all out and you can reach same amount of success. It’s a paradigm that you gotta eat ramen every day for years when in reality if they organized their finances and life a little better there was no need in the first place.  \n\n\nMost successful freelancers I’ve met who ended up making a living on it and more swear by the book…..\n\n -profit first by Mike Michalowicz.\n\nOther book I’d recommend is ‘don’t believe what you think’. Teaches how to filter thoughts.  Which ones are helpful and which ones not.  ",
          "score": 1,
          "created_utc": "2026-01-23 15:41:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a2omc",
          "author": "heavedistant",
          "text": "You can give up all your hobbies, health and relationships and still fail. People sacrifice to improve the odds by going faster but it’s still a gamble. \n\nMany people say don’t quit your day job and it’s prudent advice. Just be prepared for slower progress.\n\nThe thing is you learn from failing. How many times will you need to learn to succeed?\n\nSome people succeed on their first try. Some people never succeed no matter how many times they try or how much they sacrifice. Everyone has different circumstances.\n\nHealth and relationships usually should not be sacrificed because of their value. Hobbies are negotiable depending on your personal priorities.",
          "score": 1,
          "created_utc": "2026-01-23 18:06:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ahyod",
          "author": "Ann-Mama-Bear",
          "text": "Data shows your brain operates most efficiently when you take time to play.\n\nYour percentages are interesting. \nI take breaks when my body tells me to and get back to work after recharging. \n\n👍",
          "score": 1,
          "created_utc": "2026-01-23 19:15:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjwt81",
      "title": "The skill that actually matters shifted and not everyone noticed yet",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qjwt81/the_skill_that_actually_matters_shifted_and_not/",
      "author": "Karn2407",
      "created_utc": "2026-01-22 15:02:14",
      "score": 9,
      "num_comments": 6,
      "upvote_ratio": 0.8,
      "text": "Been thinking about this lately and wanted to see if anyone else is noticing it.\n\n\n\nAI basically made \"I can code\" meaningless. Like, anyone can prompt their way to a working feature now. That's just the reality. But I keep running into devs who can ship stuff but can't explain why they built it that way. Ask them what happens under load or why they picked one approach over another and there's just nothing there.\n\n\n\nAnd the thing is, on day one it all looks the same. Working code is working code. But a few months down the line when something breaks or a requirement changes, you start seeing who actually understood what they built vs who just got lucky with the output.\n\n\n\nI guess what I'm getting at is AI raised the floor massively but the ceiling is still the same. Everyone can build now. But building something that doesn't fall apart when reality hits? That's still hard. And I feel like the market hasn't fully caught up to this yet.\n\n\n\nJust feels like something shifted and it's not being talked about enough.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qjwt81/the_skill_that_actually_matters_shifted_and_not/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o12e6vu",
          "author": "KevinWaide",
          "text": "THAT's the difference between someone who uses AI to build an app for them vs. someone who uses AI to help them build a sustainable model. I've learned that you don't use AI to do the work for you, you use AI to help you understand how to do the work yourself. I was 100% against AI at first, but after working with ChatGPT for the last few months, I've found a workflow that works for me 100% of the time, but I'm still doing the work. I let AI keep up with \"busy\" work so I have more time to do the work I enjoy doing.",
          "score": 3,
          "created_utc": "2026-01-22 15:59:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o14nmgz",
          "author": "theredhype",
          "text": "Building something that anyone will actually buy is still the bigger challenge. \n\nIt’s wonderful that building is more accessible. \n\nIt’s unfortunate that most hopeful builders still have no idea how to discover and validate the problem/solution space with well designed experiments. \n\nFounders are being sold enhanced building power without enhanced market insights. And none of the AI based tools promising market insights are good. LLMs simply are not trained on human psychology or behavior. They’re disembodied textual prediction engines. \n\nUnless you have a big unfair advantage (unique key relationships, crazy money, etc), or you’re counting on luck and your own personal genius (/s), the differentiator between founders remains who can do the best r/CustomerDiscovery and validation experiments.",
          "score": 2,
          "created_utc": "2026-01-22 22:11:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18fo9m",
          "author": "indexintuition",
          "text": "this resonates even from the non-dev side. i use ai to move faster, but i still have to understand why something exists or it falls apart the moment real people use it. tools make building feel easy at first, but tradeoffs show up later when things scale or change. i think judgment and context are the real skill now, not just output. curious how you think people should actually learn that part without getting burned first.",
          "score": 1,
          "created_utc": "2026-01-23 13:25:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12ied6",
          "author": "Boring-Abroad-2067",
          "text": "that’s interesting ai is just a productivity booster",
          "score": 1,
          "created_utc": "2026-01-22 16:18:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o137mme",
          "author": "Dry_Community5749",
          "text": "I think you make a valid point. I was a manager managing a large team. I had couple of best employees, a large majority of  averages with varying degree of capability and then bottom of the barrel. \n\nAI hands down is better than the bottom of the barrel. Slowly AI is reaching the levels of an average employee. \n\nThe reason I had a large team was because my best employees would only do so much in a week. Now if I have AI work with my best employees, I can get X times their productivity. \n\n\nI keep hearing that AI causes so many issues that you have to spend weeks trying to undo it. That's only if you blindly have AI do everything and implement everything AI says. Instead if you AI for specific things and know your stuff, you can be lot more productive. \n\nIn my 1st job in a unionized manufacturing plant, I had a worker that no one gave any work to. He would always complain. One shift I give at work, he screws it up so much. Next shift no other worker would touch his work, I literally had to kneel to someone else to undo the sh*t he did, had someone redo it. What was one shift work turned into 3. I was the idiot in that situation and I blindly believed that guy will work. I learned my 1st big lesson",
          "score": 1,
          "created_utc": "2026-01-22 18:11:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o14bldy",
          "author": "NullVoidXNilMission",
          "text": "It's your little mirror mirror on the wall ,know it all. yet he's a tool",
          "score": 0,
          "created_utc": "2026-01-22 21:13:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh1c96",
      "title": "how to manage tours while keeping up with marketing?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qh1c96/how_to_manage_tours_while_keeping_up_with/",
      "author": "TurnoverEmergency352",
      "created_utc": "2026-01-19 11:06:19",
      "score": 7,
      "num_comments": 14,
      "upvote_ratio": 0.89,
      "text": "anyone else spending more time marketing than actually running their tours? i feel like i am constantly juggling social media posts, emails, ads, and trying to get new bookings, and its starting to take over my day to day.\n\ni love running my tours and meeting guests, but half my time is spent on instagram, facebook, email campaigns, updating listings, responding to inquiries… and it never seems to end. It’s like the marketing side is a full time job on top of the tours themselves.\n\nwould love to hear how other tour operators manage this balance. do you have any tips, tools, or hacks for keeping marketing under control while still enjoying running your tours?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qh1c96/how_to_manage_tours_while_keeping_up_with/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o0gxvvc",
          "author": "DesignThinker_",
          "text": "This is a super common pain and honestly a sign that you are doing a lot right already. The trap most operators fall into is trying to market like a brand instead of like a tour business.   \n  \nWhat tends to work better is narrowing hard while identifying the 1–2 channels that actually drive bookings (for many it’s Google + Instagram or OTAs) and let the rest go without guilt.   \n  \nBatch everything and one short block a week to schedule posts, reply templates for DMs and inquiries, and reuse guest photos, reviews, and stories everywhere instead of creating new content each time.   \n  \nIf you can automate emails, confirmations and basic questions marketing stops feeling like a daily drain and becomes a background system which gives you your time and enjoyment back.",
          "score": 3,
          "created_utc": "2026-01-19 13:11:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0isyfx",
          "author": "AdBusy7153",
          "text": "batch create",
          "score": 2,
          "created_utc": "2026-01-19 18:35:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kqs22",
          "author": "ArtemLocal",
          "text": "This is very real for tour operators. Marketing quietly becomes a second job. What helps is narrowing channels instead of feeding everything. One primary acquisition source, usually Google listings or OTAs, then one retention channel like email. Social can be batched once a week or even biweekly. A lot of operators also separate always on assets like reviews, listings, and automated emails from active marketing so only one thing needs daily attention. Which channel actually brings most of your bookings right now?",
          "score": 2,
          "created_utc": "2026-01-20 00:15:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gkbqg",
          "author": "Puzzleheaded_Swim385",
          "text": "tourradar makes it look easy but behind the scenes its just emails and reels, feel like you losing touch with the fun part yet?",
          "score": 1,
          "created_utc": "2026-01-19 11:30:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gkbug",
          "author": "Wide_Brief3025",
          "text": "Batching your marketing tasks a few times a week instead of spreading them out daily can help a ton. Also, automating responses or using templates saves time with inquiries. For finding leads without getting sucked into every conversation, I’ve started using ParseStream which sends notifications only for high quality mentions so I stay focused on running tours. Balancing both gets much easier when you cut out the noise.",
          "score": 1,
          "created_utc": "2026-01-19 11:30:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gl097",
          "author": "Potential_Force_4136",
          "text": "yep, feels like the tours are the side job now.",
          "score": 1,
          "created_utc": "2026-01-19 11:36:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gm0be",
          "author": "Brilliant_Candle5450",
          "text": "its weird, i signed up for airbnb experiences thinking it would be all about sharing cool spots, but most days im just glued to my laptop trying to boost bookings.",
          "score": 1,
          "created_utc": "2026-01-19 11:44:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gn5kg",
          "author": "These_Run_7070",
          "text": "how do you keep your passion for the actual tours when your brain is just full of marketing tasks?",
          "score": 1,
          "created_utc": "2026-01-19 11:54:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kehgb",
          "author": "kubrador",
          "text": "hire someone part-time to handle social media before you burn out and start resenting the tours themselves. you're basically running two businesses and wondering why you're exhausted.",
          "score": 1,
          "created_utc": "2026-01-19 23:09:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pn3zp",
          "author": "Longjumping-Check-76",
          "text": "Marketing can easily eat up tour operators' time. Consider using automation tools like scheduling software and social media management platforms to streamline your workflow, and block specific hours for marketing tasks to maintain focus on tour operations.",
          "score": 1,
          "created_utc": "2026-01-20 18:35:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qxhq7",
          "author": "erickrealz",
          "text": "You're spreading yourself too thin trying to be everywhere at once. Most tour operators waste time on low-ROI channels like constant Instagram posts when email and review management would bring way more bookings.\n\nBatch your social content once a week using scheduling tools like Buffer or Later. Spend 2 hours on Sunday creating a week's worth of posts, schedule them all, then ignore social media the rest of the week unless someone DMs you directly. Our clients in similar local businesses see zero difference in bookings whether they post daily or 3 times weekly, so stop burning hours on it.\n\nFor emails, set up automated sequences for inquiry followups, post-tour review requests, and past customer re-engagement. Most booking platforms have this built in or you can use something cheap like Mailchimp. That handles 80% of your email marketing without daily effort.\n\nReal talk, if marketing is taking half your day, you're doing shit that doesn't matter. Focus on getting more reviews, optimizing your booking page for conversions, and maybe running targeted ads to your local area. Cut everything else until you've got capacity to hire someone part-time to handle the busy work.",
          "score": 1,
          "created_utc": "2026-01-20 22:08:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zstfo",
              "author": "jkbruhhehe",
              "text": "Yeah, I’ve been there. I started batching marketing tasks instead of doing them daily, and using Gmbapi to manage social, Google Business Profile, and emails made it way more manageable. Honestly, just seeing all the data in one dashboard saved so much mental load.",
              "score": 1,
              "created_utc": "2026-01-22 04:59:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qfk1em",
      "title": "Is anyone else nostalgic for the joy of random physical rewards?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qfk1em/is_anyone_else_nostalgic_for_the_joy_of_random/",
      "author": "sirdangc8k",
      "created_utc": "2026-01-17 17:59:15",
      "score": 7,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "Some of my best childhood memories came from opening treasure chests in RPGs, pulling collectible cards, or getting a surprise toy in a kids' meal. That element of surprise and tangible reward left a lasting impression.\n\nI’ve been thinking about how apps today are all digital points, badges, streaks; but rarely offer anything physical. What if an app could mail you a surprise gift after hitting a milestone, like earning points, gaining subscribers, or completing a challenge?\n\nHas anyone seen something like this done well? Do you think people would value a physical token for digital achievements? I’m exploring the idea and would love to hear your thoughts or creative use cases!\n\n*I’m working on a project related to this that ties software and a bunch of expensive manufacturing machines to do it all in house. And will be sharing the ride along journey with ya'll!*\n\n*I share a little more in this video* on my reddit profile\n\nLmk what you think 🙏",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qfk1em/is_anyone_else_nostalgic_for_the_joy_of_random/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o09z3b4",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 2,
          "created_utc": "2026-01-18 11:48:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p6f5b",
              "author": "sirdangc8k",
              "text": "I was talking to some friends the other day about getting physical copies of games that had a cool handbook and artwork insert; nowadays, you pay the same price but with none of that fun stuff.",
              "score": 1,
              "created_utc": "2026-01-20 17:19:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o05tfiw",
          "author": "simon_mo",
          "text": "Oh my god, like 10000 percent. They still do it in Japan and they do it really well!",
          "score": 1,
          "created_utc": "2026-01-17 19:48:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p6nra",
              "author": "sirdangc8k",
              "text": "Yes! We'll be in Japan to window shop for potential surprise gifts from independent artisans and artists.",
              "score": 1,
              "created_utc": "2026-01-20 17:20:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o05uaov",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-17 19:52:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05uar7",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qfk1em/is_anyone_else_nostalgic_for_the_joy_of_random/o05uaov/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-17 19:52:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o06137m",
          "author": "lkbngwtchd",
          "text": "Like youtube?",
          "score": 1,
          "created_utc": "2026-01-17 20:26:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o06hif5",
              "author": "SpottedOutpost",
              "text": "Yes like YouTube badges but for normal people / customer accounts",
              "score": 1,
              "created_utc": "2026-01-17 21:50:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0p63tp",
              "author": "sirdangc8k",
              "text": "Yes, this is a good example of what we can help streamline whether you want to reward your guests on a podcast or subscribers on your channel or app.\n\nhttps://preview.redd.it/g092b88cfjeg1.png?width=598&format=png&auto=webp&s=00bc9eb04abf9add6d23aafdf1875e6183de78c0",
              "score": 1,
              "created_utc": "2026-01-20 17:17:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o070bbb",
          "author": "NoCloutTy",
          "text": "This is cool, what kind of items do you have in mind?",
          "score": 1,
          "created_utc": "2026-01-17 23:25:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p5rop",
              "author": "sirdangc8k",
              "text": "My partner will be in Japan to shop for some fun gifts in a couple weeks. It'll be personalized and branded merch but always with some mystery items; for some recipients the products might be sourced from indie artisans.",
              "score": 2,
              "created_utc": "2026-01-20 17:16:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o07x7fi",
          "author": "kubrador",
          "text": "only thing that'll kill you is logistics and unit economics until you scale, so you better nail the manufacturing side hard or you're just paying to ship people $2 trinkets. but if you've got the machines in-house and figured out the math, you're already ten steps ahead of every other app trying this. go absolutely bonkers with it.",
          "score": 1,
          "created_utc": "2026-01-18 02:19:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p77ow",
              "author": "sirdangc8k",
              "text": "https://preview.redd.it/to10vmt3gjeg1.jpeg?width=680&format=pjpg&auto=webp&s=eaa953d6e54aab2d738817a50aade7e6cc556f6b\n\nThat was the initial headache! I've been shopping for used machines (and some new) to nail the logistics by building everything in-house, at least as much as we can. I figure when AI comes along, having manufacturing in-house might make us less replaceable? Knock on wood",
              "score": 1,
              "created_utc": "2026-01-20 17:22:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0851hi",
          "author": "trainmindfully",
          "text": "the nostalgia is real, but the hard part isn’t the idea, it’s the economics and logistics once novelty fades. physical rewards feel magical at first, then users start anchoring on cost, delays, and consistency. most attempts i’ve seen die when shipping friction eats margins or expectations spike. i’d be curious how you think this stays special past the first few milestones without turning into a fulfillment business.",
          "score": 1,
          "created_utc": "2026-01-18 03:02:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p8smb",
              "author": "sirdangc8k",
              "text": "Absolutely! We have some ideas but milestones shouldn't be easy to achieve. For example, YouTube has the Bronze, Gold, DIamond rewarded to channels with 100K, 1M, 10M subscribers; and each is a grind to get to. So the Milestone Rewards shouldn't be handed out freely; as we are not a gifting company for onboarding, etc; we can be, but our focus is on celebrating achievements when your user sells their startup  for $100,000+ (or total revenue of startups sold) on your platform or generates and closed their first X leads worth of $ amount. But at the end of the day, you pick the milestone, we provide the 1-line of code to automate the physical rewards.",
              "score": 2,
              "created_utc": "2026-01-20 17:30:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qlge1j",
      "title": "I stopped trying to invent completely original startup ideas and started studying what is already working.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qlge1j/i_stopped_trying_to_invent_completely_original/",
      "author": "HomeworkHQ",
      "created_utc": "2026-01-24 07:13:36",
      "score": 7,
      "num_comments": 19,
      "upvote_ratio": 0.71,
      "text": "Earlier, whenever I thought I had found a clever or unique idea, it felt exciting but also uncertain. Most of these ideas sounded good in theory but felt fragile in reality. That made me rethink how I evaluate opportunities.\n\nRecently, while exploring StartupIdeas DB which I found on google, I decided to ignore trendy or flashy concepts and focus only on products that already exist and are already generating revenue. Real SaaS products with real customers.\n\nOne idea in their tech category stood out. It was a simple B2B SaaS solving a boring but painful operational problem. No hype, no complex positioning. Just a clear solution people were willing to pay for.\n\nI will not share the exact idea publicly, but there are many similar examples available.\n\nOnce a product is making money, the question of whether the idea is valid is mostly answered. The problem is real, customers are paying, and some form of distribution already exists, even if it is small.\n\nSaaS makes this approach practical. Today it is easier than ever to build, test, and improve products. This is not about copying a business, but about learning from existing validation and executing better for a specific niche through focus, experience, or distribution.\n\nI am seriously considering building something inspired by this approach, not because it is trendy, but because the proof already exists.\n\nCurious to hear thoughts from others here. Do you prefer starting with proven revenue or trying to build something completely new?",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qlge1j/i_stopped_trying_to_invent_completely_original/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o1e4ofw",
          "author": "airdroptrends",
          "text": "Makes sense, imo. I've found that tweaking existing successful models is way easier than trying to reinvent the wheel. What are some of the key factors you look for in those already successful products?",
          "score": 5,
          "created_utc": "2026-01-24 07:59:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1e79f0",
              "author": "HomeworkHQ",
              "text": "Good question. I mostly look for boring but frequent pain, clear willingness to pay (not just free users), and signs that the product grew through necessity rather than hype.   \n  \nI also pay attention to who the customer is, if there’s a niche with sharper pain or underserved workflows, that’s often where differentiation lives. Distribution and switching costs matter too.",
              "score": 1,
              "created_utc": "2026-01-24 08:22:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ehmaf",
          "author": "ParkingYak3381",
          "text": "Totally agree. I used to chase unique ideas thinking that’s what makes a startup special. But most of them never got past the idea stage. Looking at what’s already working and finding ways to improve o just makes more sense.",
          "score": 2,
          "created_utc": "2026-01-24 09:58:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fc1ui",
              "author": "HomeworkHQ",
              "text": "Exactly this.\n\n“Unique” felt exciting, but it often became an excuse to stay in idea mode. Once you look at things that already have users and revenue, the conversation shifts from is this a real problem? to how can this be done better, narrower, or with better distribution?\n\nMost successful products aren’t invented from scratch anyway, they’re refined versions of something that already proved demand. Curious what kinds of improvements you usually look for when you study existing products?",
              "score": 1,
              "created_utc": "2026-01-24 13:55:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1f33eg",
          "author": "TheBigCicero",
          "text": "This is a good idea",
          "score": 2,
          "created_utc": "2026-01-24 12:59:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fc32l",
              "author": "HomeworkHQ",
              "text": "Indeed it is",
              "score": 1,
              "created_utc": "2026-01-24 13:55:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1f4d7d",
          "author": "Typical_Pomelo_4400",
          "text": "yeah this is a smart aapproach but make sure you add your unique spin to it instead of copying exactly, then this would definitely work",
          "score": 2,
          "created_utc": "2026-01-24 13:08:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fc7iv",
              "author": "HomeworkHQ",
              "text": "true. you can copy the original idea and twist it a bit or add something new",
              "score": 1,
              "created_utc": "2026-01-24 13:56:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1fxea7",
          "author": "FatherOften",
          "text": "I always like to ask people.Have you ever met an inventor that pays their bills from inventing shit? It's more rare than meeting a superhero or something.\n\nSo with all the odds against you already in business.Why throw that one on top?",
          "score": 2,
          "created_utc": "2026-01-24 15:47:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fykrr",
              "author": "HomeworkHQ",
              "text": "That’s a fair point. Pure invention rarely pays the bills on its own.\n\nMost people who look like “inventors” in hindsight were really great at spotting existing demand and executing better. With the odds already stacked against startups, removing the “does anyone even want this?” risk feels like a rational move.",
              "score": 2,
              "created_utc": "2026-01-24 15:53:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1g2xfo",
          "author": "OneHunt5428",
          "text": "Focusing on proven revenue feels way less risky and lets you spend energy on execution instead of validating the idea from scratch. I tried both and copying, improving usually beats trying to reinvent the wheel.",
          "score": 2,
          "created_utc": "2026-01-24 16:13:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1dztxr",
          "author": "Exotic-Emu3111",
          "text": "Smart move. Validation beats novelty every time. Building on what already works shifts the game from guessing ideas to executing better, which is where real businesses are made.",
          "score": 1,
          "created_utc": "2026-01-24 07:16:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1e30sx",
              "author": "HomeworkHQ",
              "text": "Exactly. Novelty feels rewarding, but execution is what compounds. Once revenue exists, the risk shifts from “is this real?” to “can I do this better or narrower?” and that’s a much more solvable problem.",
              "score": 1,
              "created_utc": "2026-01-24 07:44:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1dzucb",
          "author": "Daisy_prime",
          "text": "Great perspective mate! Starting with proven revenue feels like de-risking the journey you already know the pain point is real and customers are willing to pay. The challenge then shifts from “is this valid?” to “can I execute better?” which is often where real differentiation happens.",
          "score": 1,
          "created_utc": "2026-01-24 07:16:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1e32x9",
              "author": "HomeworkHQ",
              "text": "Agreed. De-risking the idea actually raises the bar on execution. When the problem is obvious, differentiation comes from how well you understand a specific customer and deliver consistently.",
              "score": 1,
              "created_utc": "2026-01-24 07:45:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qki8oe",
      "title": "Is it true that great founders hire people smarter than themselves?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qki8oe/is_it_true_that_great_founders_hire_people/",
      "author": "Thick-Session7153",
      "created_utc": "2026-01-23 05:24:46",
      "score": 7,
      "num_comments": 12,
      "upvote_ratio": 0.82,
      "text": "There’s a popular saying that if you’re the smartest person in the room, you’re doing something wrong.\n\nIn practice though, how does that actually work?  \nIf you hire people who are better than you at engineering, marketing, or product what exactly is the founder’s role day to day?\n\nDo founders mostly set vision and priorities while letting experts decide *how* things get done?  \nOr is this idea a bit oversimplified?\n\nCurious what actually happens inside real startups.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qki8oe/is_it_true_that_great_founders_hire_people/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o16sut6",
          "author": "AdAdmirable433",
          "text": "Yes, always hire people smarter than you. Focus on vision, moving things forward, communicating, solving problems ",
          "score": 7,
          "created_utc": "2026-01-23 05:30:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o177ifd",
          "author": "BusinessStrategist",
          "text": "What criteria do you use for YOUR “smart scale?”",
          "score": 2,
          "created_utc": "2026-01-23 07:27:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o179hrk",
          "author": "Spraakijs",
          "text": "Being very smart says very little about more important qualities such as taking initiative.\n\n\nSmartness is somewhat important, but limited and to a degree. ",
          "score": 2,
          "created_utc": "2026-01-23 07:45:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17i7lf",
          "author": "arkofjoy",
          "text": "I'm really lazy. Being \"the smartest guy in the room\" sounds like hard work to me\n\nI prefer to hire people who are better at their job than me and then I take care of the annoying things (talking to the clients)\n\nSo that they can just focus on what they are good at.",
          "score": 2,
          "created_utc": "2026-01-23 09:04:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17e7rw",
          "author": "dragonflyinvest",
          "text": "Yes",
          "score": 1,
          "created_utc": "2026-01-23 08:27:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17v1zu",
          "author": "TheBigCicero",
          "text": "Yeah I think it’s a great question. The responses here so far, especially the ones dismissing your point, aren’t discussing power dynamics, which is what you’re describing. Basically, if you hire people better than you, why should they continue to work for you and not take over your job? \n\nThe answer is that you need to bring something to the table. You have to be more visionary, or be willing to work harder so you stay ahead of them, or be willing to do things they don’t want to do, or have so much charisma that you bring intangible value by charming your customers and stakeholders, or some other thing. \n\nA negative strategy you might employ would be to gatekeep information from those employees who are better than you in an effort to hold them down. This would just create a toxic environment. A positive strategy is to acknowledge people’s strengths and to give them more responsibility as the business grows, so they continue to feel heard and supported. Growth is a salve that heals many problems, especially power dynamics. \n\nAlso, it is definitely true that founders are replaced after the company grows if they can no longer add value. Not every founder is meant to be a CEO and that’s okay. Founders can be great visionaries and sales people but cant always scale after achieving initial success and product-market fit. Despite the harm to their ego, this can be good for the founder if they retain their share in the company because their financial wealth increases by promoting someone else into their role to run the company. \n\nI often wonder how Jeff Bezos and Jensen Huang retained their roles despite hiring a zillion brilliant people.",
          "score": 1,
          "created_utc": "2026-01-23 11:01:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19l03g",
          "author": "sameer_somal",
          "text": "I believe in this 100%. Hire people who are experts in their field and allow them to lead in their own right. A mastermind where everyone is always learning from each other is difficult to beat.",
          "score": 1,
          "created_utc": "2026-01-23 16:45:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1czduh",
          "author": "Ok_Tart5733",
          "text": "Absolutely !! You have to.",
          "score": 1,
          "created_utc": "2026-01-24 02:56:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1dvnw9",
          "author": "BetaOfficeUK",
          "text": "Hiring people “smarter than you” works only if the founder still owns context and priorities - experts solve *how*, founders decide *what’s worth solving*.",
          "score": 1,
          "created_utc": "2026-01-24 06:40:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fmg8c",
          "author": "kexy",
          "text": "I'm a long-time tech guy who works in a startup as an engineer now, and also help non-technical founders on the side avoiding costly mistakes with dev teams and code.\n\nFrom what I see:\n\nYou can't avoid hiring smarter people if you want to survive.\n\nMany underestimate the role of the founder/CEO in a business, saying that the actual work is done by the technical and operative staff.\n\nBut the vision, strategy, leadership, decisions making (and bearing their consequences), pushing through hardships are extremely valuable.\n\nNo wonder you can see many very smart and talented \"doers\".\n\nThey often have the technical skills to build up almost every part of the operations. But rarely see them actually running the business.",
          "score": 1,
          "created_utc": "2026-01-24 14:53:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjwpdf",
      "title": "I’m moving back home to keep chasing this dream",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qjwpdf/im_moving_back_home_to_keep_chasing_this_dream/",
      "author": "Hefty-Airport2454",
      "created_utc": "2026-01-22 14:58:13",
      "score": 7,
      "num_comments": 16,
      "upvote_ratio": 0.88,
      "text": "I walked away from the “safe” path right after my engineering degree, and it’s been a rough year.​\n\nI quit after my internship because big companies felt slow, political, and completely disconnected from AI and...​ corporate.\n\nFor the last 12 months I’ve tried to build products from scratch, burned through my savings, and made every single mistake you can imagine.​\n\nNo real traction, no income, and now I’m moving back in with my parents because I can’t afford to live alone anymore.​\n\nThe crazy thing is, this is the first time it feels like the journey is actually starting: clearer ideas, better systems, and a few tiny signals that what I’m building might work.​\n\nI’m scared but I’m not quitting. Sorry if this is too personal and you can't relate but this just a message I will re-read in a year. It brings the accountability feeling I need.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qjwpdf/im_moving_back_home_to_keep_chasing_this_dream/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o12ai2x",
          "author": "kubrador",
          "text": "moving back home to chase your startup dream is real entrepreneurship, not the linkedin version where you quit your job and immediately raise a seed round. respect the grind even if your mom's asking when you're getting a \"real job\" again.",
          "score": 3,
          "created_utc": "2026-01-22 15:42:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o12b9er",
              "author": "Hefty-Airport2454",
              "text": "ahah stop with linkedin and this corporate things ahah. Fortunatly she supports me",
              "score": 1,
              "created_utc": "2026-01-22 15:46:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o14kykv",
          "author": "Drumroll-PH",
          "text": "I get it. I moved back home too while chasing my 3D art dream. It’s humbling, but having space to focus and rebuild your systems can make all the difference. Keep going, the small signs are worth it.",
          "score": 3,
          "created_utc": "2026-01-22 21:58:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17rhe8",
              "author": "Hefty-Airport2454",
              "text": "December and January moved so much more than the 10 prior months. I start liking it.",
              "score": 1,
              "created_utc": "2026-01-23 10:30:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o124tgj",
          "author": "Own_Photo2773",
          "text": "just another chapter in your book in life.  It will be hard but also a blessing!  You got this!",
          "score": 2,
          "created_utc": "2026-01-22 15:15:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1262f4",
              "author": "Hefty-Airport2454",
              "text": "My parents are quite happy I come back for a few months. Will make the most of it!",
              "score": 1,
              "created_utc": "2026-01-22 15:21:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o12dw2m",
          "author": "[deleted]",
          "text": "Don’t apologise. This is actually what people can relate to. Take this advice from someone approaching 40. When you’re young you need to take risks. Just don’t waste time with nonsense like gaming, clubbing and chasing girls. Be a man not a child. Childhood is over.",
          "score": 2,
          "created_utc": "2026-01-22 15:57:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o12hxjm",
              "author": "Hefty-Airport2454",
              "text": "The only nonsense I still do is gaming, but slowly replacing it with outdoor activity",
              "score": 2,
              "created_utc": "2026-01-22 16:16:12",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o14zrdx",
              "author": "greyspurv",
              "text": "Just because you are an adult does not mean you can not have fun responsibly that is.",
              "score": 1,
              "created_utc": "2026-01-22 23:16:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o12ihcf",
          "author": "MORPHOICES",
          "text": "I the went through the identical reset a couple of years back. \\~\n\n The moment I left a “safe” path, I started burning through my savings faster than expected, and then the numbers stopped working so I had to move back home. At that time, it felt like a failure.\n\nThe segment you composed that stuck was \"clearer ideas, better systems, tiny signals\". That was true for me too   weirdly, only after I ran into that wall did things start to make sense. Previously, I was merely delivering noise and designating it learning.\n\nOne mistake I made in my early days was assuming momentum looked like revenue. When I look back, the true progress was when my thinking got smaller. Less idea but more restriction and less ego.\n\nUnacceptable takeaway (at least for me): moving back home was not giving up – it bought me time and offloaded pressure sufficiently to actually think straight. That was the turning point and not the set back.",
          "score": 2,
          "created_utc": "2026-01-22 16:18:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o12kie7",
              "author": "Hefty-Airport2454",
              "text": "Moving back home feels like a setback, but you made it clear it can be a smart reset instead of giving up.\n\nThe “clearer ideas, better systems, tiny signals” part is exactly where I’m at right now, less ego, more focus, and finally some signal in the noise. That framing is going to stick with me, so thanks for sharing it.",
              "score": 2,
              "created_utc": "2026-01-22 16:27:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o130p5t",
          "author": "Typical_Pomelo_4400",
          "text": "You are on the best path possible; it's tough, but it will be worth it one day. Till then its day one.",
          "score": 2,
          "created_utc": "2026-01-22 17:40:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o131yfv",
              "author": "Hefty-Airport2454",
              "text": "the best i don't know. but funny",
              "score": 1,
              "created_utc": "2026-01-22 17:46:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o18prhf",
          "author": "Rich-Editor-8165",
          "text": "This  honestly takes a lot of honesty to share, and it does not read like quitting at all. Moving back home can be a smart way to buy time and reduce pressure, not a step backward. Many people hit real clarity only after burning through the first version of their ideas. If you are seeing clearer signals now, that usually means the mistakes are starting to compound into judgment. Staying in the game with lower burn is often what makes the next phase possible.",
          "score": 2,
          "created_utc": "2026-01-23 14:18:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o197sh2",
              "author": "Hefty-Airport2454",
              "text": "I appreciate the comment ! thanks validating my move (sort of)",
              "score": 1,
              "created_utc": "2026-01-23 15:46:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o17lm0c",
          "author": "Training-Dinner1660",
          "text": "Cada historia tiene su camino, su ritmo, y no existe el \"perfecto\". No hay fórmula mágica. Así que te comparto mi receta: constancia, trabajo duro, y respeto a uno mismo. La vida es generosa, todo llega.",
          "score": 0,
          "created_utc": "2026-01-23 09:37:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}