{
  "metadata": {
    "last_updated": "2026-02-06 09:09:58",
    "time_filter": "week",
    "subreddit": "Entrepreneurship",
    "total_items": 14,
    "total_comments": 93,
    "file_size_bytes": 98460
  },
  "items": [
    {
      "id": "1quzow7",
      "title": "How do i get a team? Im a young entrepreneur.",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1quzow7/how_do_i_get_a_team_im_a_young_entrepreneur/",
      "author": "Soloturtle314",
      "created_utc": "2026-02-03 18:19:27",
      "score": 9,
      "num_comments": 24,
      "upvote_ratio": 0.91,
      "text": "Im trying to get a team but i have no idea how i know what i wanna do for the business but i don't think I'll be able to get anyone because of my age, experience and parental consent to everything ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1quzow7/how_do_i_get_a_team_im_a_young_entrepreneur/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o3dud0f",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 18:19:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dxqaw",
          "author": "BlaaBlaaBlaa",
          "text": "Learn by doing. Find a way to overcome obstacles",
          "score": 2,
          "created_utc": "2026-02-03 18:34:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g30zb",
          "author": "funnelforge",
          "text": "Start with contractors, freelancers, and then agencies. \n\nThen when you’re ready you can part time hire someone",
          "score": 2,
          "created_utc": "2026-02-04 00:54:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3huqjt",
          "author": "Overall-Lead-4044",
          "text": "Talk with your local university. You may be able to hire a student for anything from a few weeks park time to a full year's industry placement year",
          "score": 1,
          "created_utc": "2026-02-04 08:04:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3inpp2",
          "author": "Sunflower0913",
          "text": "hi im a social media manager i can help you🌸☺️",
          "score": 1,
          "created_utc": "2026-02-04 12:19:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lzxoe",
              "author": "Soloturtle314",
              "text": "That'd be good if i had the business started in the first place, i don't have the skills to make the product i want to sell",
              "score": 1,
              "created_utc": "2026-02-04 22:08:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3ozb33",
                  "author": "Sunflower0913",
                  "text": "What is your product☺️",
                  "score": 1,
                  "created_utc": "2026-02-05 10:17:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3jww0e",
          "author": "Hungry-Perception761",
          "text": "At the beginning, you don’t really “get a team.” You earn one.\n\nRight now, focus less on hiring and more on doing. When you’re clear on what the business is, what problem it solves, and you’re already taking action, people are much more willing to help or collaborate regardless of your age.\n\nA few realistic points:\n\n* Start solo or with one collaborator, not a full team\n* Look for people who want to learn or build together, not employees\n* Be honest about your situation and limits. Serious people respect clarity more than confidence\n* Your age matters less than whether you’re consistent and reliable\n\nTeams usually form around momentum, not ideas. Build something small first. Once others see progress, getting help becomes much easier.",
          "score": 1,
          "created_utc": "2026-02-04 16:19:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lywt9",
              "author": "Soloturtle314",
              "text": "That's what im trying to do but age wise i need the parents to make the licenses for it to be legal and starting without a team wise i don't have all the skills for the business idea, it has something to do with graduates level engineering",
              "score": 1,
              "created_utc": "2026-02-04 22:03:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3kr147",
          "author": "Certain-Ask6115",
          "text": "What’s the business? Easier to point you in the right direction if we know the people you are looking for",
          "score": 1,
          "created_utc": "2026-02-04 18:37:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lzawg",
              "author": "Soloturtle314",
              "text": "Look up protogen head and what the \"furry fandom\" calls protogens and you might find out.",
              "score": 1,
              "created_utc": "2026-02-04 22:05:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3kszyt",
          "author": "limitlesssolution",
          "text": "Search out a mentor. Volunteer for something you are interested in. Form a group-  post on social media. Could possibly already be such a group.",
          "score": 1,
          "created_utc": "2026-02-04 18:46:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mh7mk",
          "author": "Cool_Assistant_5660",
          "text": "Where are you based? \nI’m looking for partners for my bookkeeping business.",
          "score": 1,
          "created_utc": "2026-02-04 23:39:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3nbecu",
              "author": "Soloturtle314",
              "text": "Northern Alabama but i was trying to target my business to a completely different thing",
              "score": 1,
              "created_utc": "2026-02-05 02:30:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ndzlp",
          "author": "hexprepcenter",
          "text": "Social Media!",
          "score": 1,
          "created_utc": "2026-02-05 02:44:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ngq77",
              "author": "Soloturtle314",
              "text": "I need to be popular for that i barely get 100 views per video",
              "score": 1,
              "created_utc": "2026-02-05 03:00:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3o4iuf",
          "author": "Charming-Team-8923",
          "text": "Which skills are you looking for?",
          "score": 1,
          "created_utc": "2026-02-05 05:37:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3o5lcn",
              "author": "Soloturtle314",
              "text": "Engineering, advertising, software engineering for e-commerce and online stores, a artist for sketching the idea which i can try myself and someone else with similar skills to mine with thinking and problem solving when stuck",
              "score": 1,
              "created_utc": "2026-02-05 05:45:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ou5zm",
          "author": "jonathanbrnd",
          "text": "Humans are overrated. Create a team of AI agents instead.",
          "score": 1,
          "created_utc": "2026-02-05 09:28:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oxywq",
          "author": "Timely_Attorney_9622",
          "text": "Hi, Please get on to my page. You will definitely find an answer you are looking for. ",
          "score": 1,
          "created_utc": "2026-02-05 10:05:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3h6a4v",
          "author": "Mentor-Pak",
          "text": "Join nearby incubation centre from there you will have a team and guidance",
          "score": 0,
          "created_utc": "2026-02-04 04:46:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qt1uco",
      "title": "Struggling to Get My First Bookkeeping Clients – Looking for Honest Advice",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qt1uco/struggling_to_get_my_first_bookkeeping_clients/",
      "author": "Bumbaclaat27",
      "created_utc": "2026-02-01 15:45:24",
      "score": 8,
      "num_comments": 28,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,\n\nI’m looking for some realistic advice because I’ve been spinning my wheels a bit trying to get bookkeeping clients.\n\n**Background:**  \nI have a college diploma in accounting and about a year of combined experience (school + \\~9 months as a staff accountant/bookkeeper). I’m not a CPA, and I’m not trying to position myself as one. I’m aiming strictly at **basic bookkeeping** for small businesses (monthly books, reconciliations, cleanup, etc.).\n\n**What I’ve done so far:**\n\n* Set up a simple service offering (monthly bookkeeping, cleanup)\n* Reached out to small businesses locally (cold emails / DMs)\n* Posted in a few Facebook and Reddit groups (mostly ignored or very low response)\n* Talked to people I know personally (some interest, nothing converted)\n* Tried to keep pricing reasonable and transparent\n* I’m confident in my ability to do the work once I actually get a client\n\n**Where I’m struggling:**\n\n* Getting *any* traction or responses\n* People seem hesitant to trust someone without a CPA or years of solo experience\n* Competing with very cheap overseas bookkeepers and very established firms at the same time\n* Feeling like I’m stuck in the “need clients to get experience, need experience to get clients” loop\n\nI’m not expecting instant success or big money. I just want **my first few real clients** so I can build proof, testimonials, and momentum.\n\n**My questions:**\n\n* Is this just normal early-stage friction, or am I missing something obvious?\n* Where did your *first* bookkeeping clients actually come from?\n* Should I niche down harder (industry, software, cleanup only, etc.)?\n* Is it smarter to work under another firm first before trying solo?\n* Any mistakes you see beginners make that I might be making?\n\nI’m open to blunt feedback. If the answer is “this takes way longer than you think” or “you’re approaching it wrong,” I’d rather hear that now.\n\nThanks in advance to anyone willing to share real experiences.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qt1uco/struggling_to_get_my_first_bookkeeping_clients/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2zij2y",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 15:45:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zoe70",
          "author": "FatherOften",
          "text": "I have a GED, but taught myself Quickbooks 30 years ago by getting a torrent copy and playing business.\n\nI cold called every local business within 50 miles of my home. Plumbers, roofers, truck shops, electrical, hvac, cleaning services, truck driver.....\n\nYou are cold email and cold dm.\n\nThe secret you are looking for is hidden in the work you are avoiding.\n\nCold call in person and over the phone. Send an email right after you hangup or walk away. It should have your contact info, and your offer/pricing.\n\nIts not fun. It takes hundreds of cold calls.\n\nYou're gonna suck at it for awhile. It never gets fun.\n\nYou have to do it anyway and you have to get good at it.\n\nAim for 1000 cold calls to start with. Sounds like a lot, but its not at all. Its just a start.",
          "score": 3,
          "created_utc": "2026-02-01 16:12:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2zpagv",
              "author": "Bumbaclaat27",
              "text": "Thanks for the advice",
              "score": 2,
              "created_utc": "2026-02-01 16:17:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2zmgy8",
          "author": "Chris_StayStrategy",
          "text": "I am not an accountant, but I personally would not see value in your offer with such minimal experience. \n\nI think the big challenge you will have as a solo practitioner with this offer is that you can’t really handle escalations for serious issues. If I were to hire you and need a CPA to look at something, I would then have to source that separately and coordinate knowledge transfer, etc. I suspect many small businesses are either:\n\na) have some basic system they consider to be working well enough\n\nb) looking for legitimate support when their basic system from point a triggers an audit or something serious \n\nc) have growth aspirations and recognizes you won’t be able to grow with them \n\nI think ultimately you will have better success working with someone established for now and building towards a solo thing in a couple years.",
          "score": 2,
          "created_utc": "2026-02-01 16:03:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2zobdf",
              "author": "Bumbaclaat27",
              "text": "I have worked in a cpa firm for about a year and handled the books of large companies. The problem is far from the fact that I can't handle the volume because in my solo practice I would be scaling back from what I serviced while employed at my firm. This is the jump I'm taking to get smaller clients, I'm just not sure how to find them efficiently",
              "score": 1,
              "created_utc": "2026-02-01 16:12:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2zp7x7",
                  "author": "Chris_StayStrategy",
                  "text": "That makes sense, I don’t doubt you’re capable of the bookkeeping work. It’s moreso that when you were doing it at the firm, the clients knew it was being done with oversight of CPAs.",
                  "score": 1,
                  "created_utc": "2026-02-01 16:16:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2zr0mx",
              "author": "FatherOften",
              "text": "I agree that OP should definitely keep a full-time job under someone else.\n\nI did this type of work while working full-time full commission sales positions in other industries and in the early years of building my current commercial truck parts manufacturing and sales business.\n\nI have a ged, no formal education, and taught my self QB though downloading a torrented copy.\n\nI made $1k-$5k a month pretty consistently doing reconciliations, cleanup, and re categorizing for many small to medium business owners. \n\nA. Is a great point, but you have to assume they don't really have a good system and find the pain. The majority of the people I cold called hated reconciliations and stumbled through it. All of them really wanted to be assured that they had their chart of accouts setup correctly. \n\nThat's where I made my money. I just needed extra cash and would make a couple hundred bucks here or there, but it added up. It took awhile to get out of that side gig as my primary business grew larger. \n\nOP you need to be scrappy, lean on social engineering, and real talk people skills. You cannot compete face to face with accounting firms, but your target customer of family owned small businesses cannot justify the spend to use those firms until they have to.",
              "score": 1,
              "created_utc": "2026-02-01 16:25:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3da0j2",
          "author": "Hungry-Perception761",
          "text": "This is very normal early on, especially in bookkeeping where trust matters more than marketing.\n\nThe main issue isn’t your skills, it’s credibility. Small businesses rarely switch bookkeepers unless something is broken, so cold outreach usually falls flat. Not having a CPA isn’t the blocker either. “Basic bookkeeping” just sounds interchangeable, so people hesitate.\n\nMost first clients come from referrals, cleanup work, or subcontracting under another firm. Niching helps a lot, even something simple like a specific software or type of business. Competing on price usually hurts more than it helps.\n\nIf traction feels slow, that doesn’t mean you’re doing it wrong. Many people get their first momentum by working under another firm first, then going solo once they have proof and confidence.",
          "score": 2,
          "created_utc": "2026-02-03 16:46:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zm90c",
          "author": "ScradleyToronto",
          "text": "Try some paid ads on meta or Reddit.",
          "score": 1,
          "created_utc": "2026-02-01 16:02:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32zssv",
              "author": "Lopsided-Bag-5167",
              "text": "No don’t do it..Waste of money!",
              "score": 1,
              "created_utc": "2026-02-02 02:06:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2zvjlv",
          "author": "abbyy007",
          "text": "Totally normal to struggle at first. Narrow your niche, lean on your network and talk to local small businesses most people land their first clients through referrals not cold emails. Get a couple of clients and things start rolling.",
          "score": 1,
          "created_utc": "2026-02-01 16:45:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o302vn6",
          "author": "Affectionate_Gap2887",
          "text": "It's definitely a bit of work to get going in the beginning but just keep at it. We started off slow but growth eventually came. Started off as a single bookkeeper offering services to 2 clients and grew into full-time staff and servicing 30+ and doing adhoc \"project\" work often . I said in a previous post that what really helped us branch out is offering totadvi advisory services along with bookkeeping. It helped us upsell to already bookkeeping clients and individually sell totadvi. It's often an over looked product for bookkeepers and the best part is you only pay when your client agrees to accepting the service",
          "score": 1,
          "created_utc": "2026-02-01 17:19:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o309fau",
          "author": "MathewGeorghiou",
          "text": "I think it will be easier to win the first client locally.  Maybe put together an affordable package where you will help set up the accounting app for new businesses so they can take over their own bookkeeping.  The one-time expense may attract a few clients who know they need the help but don't want to commit to a recurring service. Some may then convert to have you do the bookkeeping once you have the relationship established.",
          "score": 1,
          "created_utc": "2026-02-01 17:49:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30g5w5",
          "author": "jesseaknight",
          "text": "how do you price a service like this?",
          "score": 1,
          "created_utc": "2026-02-01 18:19:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30phne",
          "author": "AwkwardRent5758",
          "text": "Can you motivate why I'd get you and then still paying for a CPA accountant? I think this is the key issue.\nIf I'm correct then you are approaching the wrong customers. Actually you'd approach the CPA accountants as potential clients of your service.",
          "score": 1,
          "created_utc": "2026-02-01 19:01:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32ct6a",
          "author": "Responsible-Brick881",
          "text": "For cold outreach - have you tried calling people? Or better still, go to every local business in person. Yes you'll get a lot of rejection, but I'd be shocked it you didn't fall into 1 or 2 clients. \nThe main problem i see for a of solopreneurs is they lack the desire to do the hardest thing - making sales calls on the phone and in person. Ring 100 business and knock at 100 businesses doors and if you don't find a single customer I guarantee you'll at least have a better understanding of what people want",
          "score": 1,
          "created_utc": "2026-02-01 23:57:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32q3v5",
          "author": "rt2828",
          "text": "What is the clear pain point you’re trying to solve which you can quickly talk about? If you even have one client, what do they appreciate about your service which you can advertise? For your outreach, start by refining your message specifically to one type of clients so that each rejection can help you get better faster.",
          "score": 1,
          "created_utc": "2026-02-02 01:10:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33gjgc",
          "author": "23cscott23",
          "text": "I kinda need someone to look over my books and make sure I’m doing it all right",
          "score": 1,
          "created_utc": "2026-02-02 03:43:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33omc8",
              "author": "TheOGGizmo",
              "text": "I can help with that. Dm?",
              "score": 1,
              "created_utc": "2026-02-02 04:35:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o33ox6b",
          "author": "TheOGGizmo",
          "text": "I’m sort of in the same boat spot as you. I’m trying to save up for my CPA exams. Maybe we can link up and try to land clients with each other for our firms?",
          "score": 1,
          "created_utc": "2026-02-02 04:37:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34d2pg",
          "author": "Overall-Lead-4044",
          "text": "I suggest you try networking groups, especially those focused on referral networking like BNI. It's not cheap, easy or quick, but over the years I've found that this has got me the most clients, who have stayed for many years.",
          "score": 1,
          "created_utc": "2026-02-02 07:53:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37i66m",
              "author": "Bumbaclaat27",
              "text": "I see a lot of people suggest networking groups. What does this even mean? Are you referring to local Facebook groups/organizations etc...?",
              "score": 1,
              "created_utc": "2026-02-02 19:20:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37s1pf",
                  "author": "Overall-Lead-4044",
                  "text": "No, this is face to face in person. Google networking groups near you",
                  "score": 1,
                  "created_utc": "2026-02-02 20:06:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o34jh6v",
          "author": "Cool_Assistant_5660",
          "text": "Anyone here who wants to partner up with me for an accounting and bookkeeping business? \nLooking for partners in US or UK.",
          "score": 1,
          "created_utc": "2026-02-02 08:54:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3o187f",
          "author": "Electronic-Fault-587",
          "text": "My first thought is get a job and work to gain experience and a network. Under a year of experience is nothing….you will struggle to land an entry-level position. \n\nSecond thought is: I admire your unearned confidence!",
          "score": 1,
          "created_utc": "2026-02-05 05:12:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr4yd2",
      "title": "How Do You Know the Best Way to Start a Business Today?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qr4yd2/how_do_you_know_the_best_way_to_start_a_business/",
      "author": "Policy_Boring",
      "created_utc": "2026-01-30 13:06:41",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "This is a question I hear all the time. With so many options out there. Starting from scratch, buying an existing business, or going the franchise route. It’s easy to feel stuck before you even begin. From my experience working with business owners and franchises, there’s no single “right” answer. It really comes down to your goals, your risk tolerance, and how much guidance you want along the way.\n\nSome people love building everything themselves, while others prefer a proven system with support already in place. Both paths can work, it’s about choosing the one that fits you. If you’re just starting to explore your options, don’t rush the decision. Ask questions, learn from people who’ve done it before, and be honest about what kind of business owner you want to be.\n\nCurious to hear how others here decided on their path. What helped you choose?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qr4yd2/how_do_you_know_the_best_way_to_start_a_business/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2lh0y6",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 13:06:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2na20a",
          "author": "DecisionOperator",
          "text": "This is an indecision buffer framed as exploration\n\nClarity will not arrive from comparing paths\n\nThe choice only materializes once commitment replaces analysis",
          "score": 2,
          "created_utc": "2026-01-30 18:13:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrxjnl",
      "title": "19 years old lost in life",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qrxjnl/19_years_old_lost_in_life/",
      "author": "927363729",
      "created_utc": "2026-01-31 09:05:17",
      "score": 5,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Just lost feel like i’m in a hole scratching the walls trying to climb myself back up to the surface tried multiple business models but haven’t had any luck with anything, I learned meta ads which I feel is a valuable skill but I have no motivation calling any business or haven’t started any successful business to use that skill on. i’m just here to see if someone can give me some advice, I feel hopeless i’ve been trying entrepreneurship for almost 3 years now i’ve made money but throughout that time always had issues with consistent income ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qrxjnl/19_years_old_lost_in_life/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2rfr8f",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-31 09:05:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2umjot",
          "author": "Tim-Sylvester",
          "text": "Buddy you've barely even got started. Keep going, you'll figure it out.",
          "score": 1,
          "created_utc": "2026-01-31 20:27:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wxdjh",
          "author": "zombiechickenhd",
          "text": "I am also 19 and the simple answer is that we are young and lost. Its a lame answer, and really doesn't solve the problem, but its true. \n\nMy .02, It may help to start \"finding yourself\" (whatever that means for you, for me it's meditation). For real just keep going and keep the gears turning.",
          "score": 1,
          "created_utc": "2026-02-01 04:09:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o303o0s",
          "author": "PersonoFly",
          "text": "Sit back for a moment and look at all those failures for a minute and think about what you actually learnt. \n\nDid you fail to understand the market ? Did you assume you could follow what was hot at the time and slot in with the money making? Did you gain any feedback from clients that helped you tune your service and proposition ?",
          "score": 1,
          "created_utc": "2026-02-01 17:22:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3425ul",
          "author": "MikeSimsTL",
          "text": "A few things here from my perspective: \n\n1) Everyone is lost at 19. Don't be so hard on yourself, but still be hard on yourself – if that makes sense.   \n2) The fact that you have experimented with even ONE business idea and failed is commendable. I know 50 year olds who are still talking about the same ideas they told me about 10 years ago and haven't even taken one step to progress it.   \n3) When you say, \"I learned Meta Ads\" – this isn't true. The top Meta advertisers in the world haven't \"learned\" Meta Ads. \"Learned\" means completion. What you learned is probably a very basic level of Meta Ads. In other words, if you want to make money here, you must KEEP learning, KEEP experimenting, KEEP iterating, until you almost become a master... and then you realize there's still 400 million things you don't know, so you go back in student mode and keep compounding knowledge and experience. A master of anything knows that you never actually master anything.   \n4) The one thing I don't like about your post is \"... I have no motivation calling any business or haven't started any successful business to use that skill on.\" followed by \"I'm feeling hopeless....\" If you're motivated to not be hopeless, you should be motivated to pick up that phone and call those business owners – if that's going to get you clients. Being a successful entrepreneur (or anything else) means doing the things that are uncomfortable or that you're not motivated to do. Trust me, when you pick up that phone the 300th time and that first person says \"Yes,\" you'll find your motivation. Until then, you need discipline. Discipline is 100x more powerful than motivation. \n\nJust my opinion though!",
          "score": 1,
          "created_utc": "2026-02-02 06:16:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3f6yop",
              "author": "PreparationSad5547",
              "text": "Gold.",
              "score": 1,
              "created_utc": "2026-02-03 22:04:39",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3oj7n8",
              "author": "Lead-with-compassion",
              "text": "This is an honest answer - take it to heart.\n\nStart with what you have and where you are at.  You do have skills.  Look at what you have and start being consistent.  You don't have to do what ever you start for ever.  You will find you passion and then will magic will happen - on the way you will grow, gain experience and become more.",
              "score": 1,
              "created_utc": "2026-02-05 07:43:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o397ycl",
          "author": "therealtricklowe",
          "text": "At 19 years old, nobody knows what they want to do. The fact thast you've even started multiple businesses is awesome. You just need to learn the difference between a good business, and a bad one, and find something that works.   \n  \nNobody knows what the fuck they're doing at your age. \n\nEven at 25-30, most people don't have their shit together, either. \n\nAt 15 I was an electrician.   \nAt 19 years old I was a pro skater.   \nBetween my 20's and 30's, I was. apro skater, worked also in sales, and had businesses.   \nAt 30 years old, I started an Airsoft park, and it blew up, I was a CEO from 30-40 years old.   \nThen, went back into sales.   \nnow, I'm running a marketing egency.   \n\n\nYou don't need to know what to do, you just need to do as many things as possible, and find something you like doing,. ",
          "score": 1,
          "created_utc": "2026-02-03 00:27:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3f72za",
              "author": "PreparationSad5547",
              "text": "Great! Can I DM?",
              "score": 2,
              "created_utc": "2026-02-03 22:05:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3g6h4i",
                  "author": "therealtricklowe",
                  "text": "sure",
                  "score": 1,
                  "created_utc": "2026-02-04 01:13:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qstf1v",
      "title": "How local businesses can get more customers without spending a lot on ads",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qstf1v/how_local_businesses_can_get_more_customers/",
      "author": "Critical_Charity1847",
      "created_utc": "2026-02-01 08:55:32",
      "score": 5,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Most small businesses do not have a traffic problem. They have a visibility and trust problem.\n\nWhen someone needs a gym, clinic, salon, repair service, or restaurant, they usually do three things. They search on Google, open a few websites, and check social media pages. The business that looks active, clear, and trustworthy gets the call.\n\nHere are simple things any local business can do to get more customers consistently.\n\nFirst, fix your Google Business Profile. This alone can bring steady leads. Add real photos of your shop, team, and work. Write a clear description of what you do and who you serve. Add all your services, not just one line. Ask happy customers for reviews and reply to every review. This helps you show up higher when people search in your area on Google.\n\nSecond, make sure your website answers basic questions fast. Many small business sites lose customers because they are slow, confusing, or outdated. Your homepage should clearly say what you do, where you are located, how to contact you, and why someone should trust you. Even a simple, clean site works if it is clear.\n\nThird, stay active on social media in a simple way. You do not need viral videos. Post before and after work, customer feedback, your team at work, offers, and common questions customers ask. This builds trust. People often check Instagram or Facebook before calling.\n\nFourth, keep everything updated every month. Many businesses set things up once and forget them. Profiles get outdated, numbers change, offers expire. Regular updates signal that your business is active and reliable.\n\nNone of this is complicated, but most owners do not have time to manage it properly while running daily operations.\n\nI work with local businesses to set up and manage these things on a monthly basis so they get a steady flow of calls and messages instead of depending only on walk ins.\n\nIf you want, comment with your type of business and city, and I will suggest what you should fix first, even if you do it yourself.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qstf1v/how_local_businesses_can_get_more_customers/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2xwkha",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 08:55:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o395y43",
          "author": "therealtricklowe",
          "text": "The best way to get more customers for a local business without ads, is through Local SEO. \n\nI guaranteed ranking on page one of Google Maps within 60 days, and typically get my clients also ranked within top 3 on Google SERP for local searches within 90 days. \n\nWhen they have both, they rank in multiple positions on page one of Google, and that's typically going to bring them quite a lot of business. ",
          "score": 2,
          "created_utc": "2026-02-03 00:16:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39lnw9",
              "author": "Muckraker2025",
              "text": "Nice. Definitely on my wish list.",
              "score": 1,
              "created_utc": "2026-02-03 01:44:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3emspi",
                  "author": "therealtricklowe",
                  "text": "What are you doing currently to find local business?",
                  "score": 1,
                  "created_utc": "2026-02-03 20:31:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o34idaj",
          "author": "AnonJian",
          "text": "Most businesses don't have a visibility problem or trust issues. A startup did an AMA about walking into a saturated local market with established competition then ...eating everyone's lunch. \n\nAnd their amazing secret? They didn't suck. \n\nWhat's the popular advice ladled out here daily? You should release something which embarrasses you ...the shittier the better. That explains the rightfully earned trust that the business lets customers down at every opportunity. \n\nIssue: Reputation preceded them. Word-of-mouth is killing them. Visibility is high but what the customer sees repulses them. So much for 'getting out there.'",
          "score": 1,
          "created_utc": "2026-02-02 08:43:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qt4k8c",
      "title": "Do I take the risk and violate my non-compete?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qt4k8c/do_i_take_the_risk_and_violate_my_noncompete/",
      "author": "BeachBum419",
      "created_utc": "2026-02-01 17:25:04",
      "score": 4,
      "num_comments": 34,
      "upvote_ratio": 0.84,
      "text": "I work in healthcare and will be opening my own small business this year. I'm in a non-compete is in effect until the fall.   \nI am VERY tempted to ignore it, open early, and offer services that were not available at my old job and be careful with my wording, limit advertising, and do more word of mouth. Keep it limited and small until the non-compete is up- then expand services.   \nBusiness is about risks- but I am worried I will get going, then they will send a cease and desist because they are petty like that. Then it could hurt my business in the long run if I have to shut down- then re-open.   \nI also worry that if I don't get on this now, other people may open up shop before I do and I'll loose this opportunity. \n\nI had an attorney review my non-compete. He doesn't think they could enforce it if I am careful with how I advertise and select the patients I see- as it would not cause them hardship. I just don't want to get tied up with a ton of legal costs. \n\nAny advice? Thoughts?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qt4k8c/do_i_take_the_risk_and_violate_my_noncompete/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o3044z4",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 17:25:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32n8qj",
          "author": "PersonOfInterest007",
          "text": "I am not an attorney.\n\n“Doesn’t think they could enforce it” doesn’t sound like very solid advice. If the business you start would violate the terms of the non-compete, wait for the non-compete to expire. \n\nHonor your legal commitments. It’s not only ethical; it’s the smart thing to do. And you won’t lose sleep at night worrying that the word will get out and your petty former employer will make your life an expensive legal hell.\n\nSo I suggest that you either play it safe and wait, or else get a solid second opinion from another attorney, and if they think you wouldn’t be violating the agreement for some reason, at least get their opinion in writing. It’s no guarantee, but it might (maybe, possibly) weigh in your favor with the court when you get sued.",
          "score": 3,
          "created_utc": "2026-02-02 00:54:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3gdrks",
              "author": "iamcuriousmarley",
              "text": "As someone who didn’t violate when opening my company, I also did not think mine was enforceable regardless.\n\nDealt with hell.  Multiple threats from former employer, sleepless nights worrying if I’d be sued for all I had, etc.\n\nYou are your business.  If you’re stressed you’re business is not running at 100%.  Taking care of YOU takes care of the business.\n\nDon’t do it.",
              "score": 2,
              "created_utc": "2026-02-04 01:54:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o309mq9",
          "author": "SimilarComfortable69",
          "text": "Trust your attorney. Is there some reason you don't feel comfortable with their advice?",
          "score": 1,
          "created_utc": "2026-02-01 17:50:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30d2aj",
              "author": "BeachBum419",
              "text": "Fear I suppose. I am worried IF I do this- and they IF come after me, I will get tied up with fees, or have to shut down which could hurt future business. They are a big mega corp and I am lil ole me and don't have money to fight them.",
              "score": 1,
              "created_utc": "2026-02-01 18:05:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o313vzg",
                  "author": "SimilarComfortable69",
                  "text": "Then no answer here should sway you anywhere else either.",
                  "score": 1,
                  "created_utc": "2026-02-01 20:08:53",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o36kw0l",
                  "author": "imapilotaz",
                  "text": "Thats the biggest deterrent for most individuals. They can cause tens of thousands of lawyer fees, digital forensic fees, etc. \n\nI have a friend who left one company for a competitor. He acrued nearly $30k in lawyer fees and fees associated with them going after him. \n\nBig companies have much deeper pockets. And in your cause they have a document you are threatening to ignore. Maybe rightly. Maybe wrongly. Itll be for courts to decide. And thats expensive",
                  "score": 1,
                  "created_utc": "2026-02-02 16:48:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o309mrh",
          "author": "EmbarrassedOne2329",
          "text": "Have thought to consult with a lawyer?",
          "score": 1,
          "created_utc": "2026-02-01 17:50:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30cpa9",
              "author": "BeachBum419",
              "text": "I did, mentioned that in my post :)",
              "score": 1,
              "created_utc": "2026-02-01 18:03:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o30dowm",
                  "author": "EmbarrassedOne2329",
                  "text": "Oh sorry now I read it, if your attorney told you “I don’t think” you better check out with another attorney. This is not a matter of “I think” this has to be a yes or no. It’s better to avoid these risks when you first start a business.",
                  "score": 1,
                  "created_utc": "2026-02-01 18:08:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o328cak",
          "author": "ScradleyToronto",
          "text": " Non-competes for sole proprietors are rarely enforced. I’m in canada where I could extend “rarely” to “virtual never”.  \nThe risk is negligible. \nAnd what’s the downside?\nThey can get an injunction (super unlikely) and sue you for the profits you cost them (super impractical for them). \n\nJust do it!",
          "score": 1,
          "created_utc": "2026-02-01 23:32:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32btb9",
              "author": "BeachBum419",
              "text": "I want to really bad. I’m 8 months out. I don’t know if I’m brave enough to do it now- but I am strongly considering minimum 2-3 months early.",
              "score": 1,
              "created_utc": "2026-02-01 23:51:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o32c9un",
                  "author": "ScradleyToronto",
                  "text": "Your lawyer has told you you’re fine. \n\nI’m telling you that as a practical matter, you have nothing to worry about because honestly, how much can they possibly sue you for?  They can only recoup damages.  The most they could possibly get is whatever profit you make during the period  \n\nHow much is that?",
                  "score": 1,
                  "created_utc": "2026-02-01 23:54:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o32av5l",
          "author": "ZTRADEZLLC",
          "text": "Create an off shore LLC they won't find out",
          "score": 1,
          "created_utc": "2026-02-01 23:46:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34cgb6",
          "author": "kovaxmasta",
          "text": "Pretty sure the Supreme Court struck down non-competes in the US",
          "score": 1,
          "created_utc": "2026-02-02 07:47:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35eg0r",
              "author": "BeachBum419",
              "text": "It didn’t pass",
              "score": 1,
              "created_utc": "2026-02-02 13:13:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34zbbp",
          "author": "LordOfTheMoans",
          "text": "I wouldn’t gamble on it. Even a weak non-compete can still mean lawyer letters, stress, and distraction right when you need momentum. If your attorney thinks waiting keeps you clean, use the time to prep ops, branding, and referrals so you can launch hard the day it expires.",
          "score": 1,
          "created_utc": "2026-02-02 11:23:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35tg35",
          "author": "mike8111",
          "text": "Don't let fear decide for you.\n\nI say, full send.",
          "score": 1,
          "created_utc": "2026-02-02 14:37:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36aymw",
          "author": "desultorySolitude",
          "text": "Since your attorney gave you ambivalent advice, and you feel that the previous employer could be petty, it might be best to defer starting your own operations until the Fall. in the meantime, you could do peripheral activities that are directly not covered by the non-compete but could aid in boosting your customer base when the time arrives to start your own outfit.",
          "score": 1,
          "created_utc": "2026-02-02 16:03:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o373lfb",
          "author": "TattooedCFO",
          "text": "Open offering services outside the scope of the non-compete and potentially advertise “additional services coming soon.”",
          "score": 1,
          "created_utc": "2026-02-02 18:14:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3okhk9",
              "author": "Lead-with-compassion",
              "text": "I was thinking the same thing.  If you started a business with a product or service that is closely related you can build traction and grow your audience, get all your ducks in a row and when the None Compete expires go full throttle with everything.",
              "score": 1,
              "created_utc": "2026-02-05 07:55:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o38qw75",
          "author": "GermantownTiger",
          "text": "Here're some additional questions to ask and answer yourself honestly:\n\nHow solid/cordial is the relationship with my current MegaCorp boss? Are they the type of person who'd string you up and hang you at the first opportunity?\n\nWill the services I offer in the new startup fully, partially or rarely compete directly with the previous business? If it's partially or rarely, what percentage range might the overlap be in terms of MegaCorp's perception?\n\nIf any of your current patients work with you in the new venture, does that cause them to not do any business with MegaCorp?\n\nI would answer these types of questions openly and honestly with yourself and get another legal opinion on your non-compete if the opportunity arises.\n\nEach state often treats non-competes differently...make sure your attorney is up to speed on yours.\n\nGodspeed and good luck.",
          "score": 1,
          "created_utc": "2026-02-02 22:54:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38yir3",
          "author": "flancafe",
          "text": "Personally I wouldn't risk it and would just wait. For one fall will be here before we know it and I wouldn't want to pay an attorney fee just for them to also tell me it's better to wait.  I would focus on getting a business plan done and preparing the back end of the business.",
          "score": 1,
          "created_utc": "2026-02-02 23:35:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39hs3l",
          "author": "Dope_Martian",
          "text": "You could spend time getting everything ready including building your network then you can hit the ground running in September.",
          "score": 1,
          "created_utc": "2026-02-03 01:22:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3abta6",
          "author": "TechnologyLittle9679",
          "text": "I mean, if they do decide to enforce it, it’s just a legal battle.",
          "score": 1,
          "created_utc": "2026-02-03 04:20:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3aijrc",
          "author": "plmarcus",
          "text": "your attorney should have advised you that enforceability isn't your issue, it's whether they sue you or not (which has nothing to do with who is right or wrong).  \n\nI'd worry more about if your employer is litigious (petty people are often litigious) or not, or whether it would be worth their time and money to stop you from having the business.  \n\nIf they sue you to get you to close (and you are scared enough to do it) they may only be out the filing fees and cost of drafting a complaint.\n\nYou could always ask them to waive the non-compete.  if it doesn't hurt their business they might say \"sure go for it\"  obvious you already said they are petty so it's likely a no go.",
          "score": 1,
          "created_utc": "2026-02-03 05:07:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3brw51",
          "author": "muchoqueso26",
          "text": "8 months will go by quick. Meanwhile get your business in order and hit the ground running when you are legal to open up.",
          "score": 1,
          "created_utc": "2026-02-03 11:50:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cdcqm",
          "author": "adamkru",
          "text": "Non compete is very hard to enforce and varies by state.  I can tell you for sure they do not hold up in IL.  You have the \"right to work\" in your profession.  But can you afford to burn bridges?  Is there a way everyone wins and helps your new business succeed?",
          "score": 1,
          "created_utc": "2026-02-03 14:06:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g44ha",
          "author": "Entire_Difference504",
          "text": "There are a lot of variables with contracts nowadays - and state has a big factor. For example, non competes in California don't really hold up nowadays (obviously some do, but majority are waved), whereas in Wisconsin they are still very enforceable. \n\nAdditionally, form of employment (w2 or 1099), and what the specified term is.\n\nHowever, at the end of the day it's risky - and if it's only fall 2026 that you need to wait until, it will likely save you a lot of headache in the future. Because yes, you can operate lowkey and they might not find out that it's you who owns the competition - however, in 3 years if they find out, they can still come at you.",
          "score": 1,
          "created_utc": "2026-02-04 01:00:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu5pjn",
      "title": "Question to successful developers",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qu5pjn/question_to_successful_developers/",
      "author": "dankusshh",
      "created_utc": "2026-02-02 19:55:45",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "To all of you developers who have actually managed to make money of your product/service:  \n\n\nI'm trying to figure out the correct strategy for building something that will actually create value for people, and which path to take.  \n\n\nWould you say it's smarter to build something innovative and new, as a \"shot in the dark\" and just hope that it succeeds, or rather build something that already exists and has a proven market?  \n\n\nI understand the obvious pros and cons of the two, but would like to hear perspectives nevertheless, since I don't really have the expertise.  \n\n\nThanks.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qu5pjn/question_to_successful_developers/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o37potb",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 19:55:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38n483",
          "author": "GeneralAyub",
          "text": "Most products don’t just become successful by “shooting in the dark” or cloning something that already exists.\n\nInnovation is not the solution always. Solving a problem with differentiators can be enough too.\n\nA survey can help gain insights about the market you’re trying to pitch your idea to.\n\nJust to discuss a use-case.\n\nUber started business in Pakistan. It was the first company to compete against local taxi service. So, it was a risk, it could fail or become successful. But people preferred Uber. It was successful.\n\nThen came Careem, direct competitor to Uber. Both companies fought for their share.\n\nStill there was room for growth.\n\nCame in-drive, but in-drive introduced a rate negotiations feature in their service, people liked this feature.\nThen other companies started with their own ideas(having bikes, deliveries, city-to-city, etc)\n\nThough both Uber and Careem merged, later shut down business due to competition and economic constraints.",
          "score": 1,
          "created_utc": "2026-02-02 22:35:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39tw6a",
          "author": "WebEaze",
          "text": "It’s good to build something that already exists - it’s about the value proposition - what makes you stand out from the competitors and what “touch” can you add to your business. If you can identify what makes you unique, you’re golden! Even in a very competitive market.",
          "score": 1,
          "created_utc": "2026-02-03 02:31:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3at014",
          "author": "AnonJian",
          "text": "Both of your options spit in the face of market demand research and  customer discovery. Build It And They Will Come is a bitch when you never solved for \"they.\" \n\nDeveloping the millionth \"me too\" without studying what customers dislike about the industry status quo isn't helpful. \n\nPeople post to ask if three, six, twelve responses to a survey -- nobody paid but a moment's attention to -- is enough 'market traction' to launch. They are ridiculous. And they've swallowed the wantrepreneur kool-aid. \n\nStrong market demand should almost pull the idea out of your startup. For that to happen you will have to get out of your own way.",
          "score": 1,
          "created_utc": "2026-02-03 06:29:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qry0o9",
      "title": "How do you screen candidates before interviews?",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qry0o9/how_do_you_screen_candidates_before_interviews/",
      "author": "JackfruitOwn3238",
      "created_utc": "2026-01-31 09:34:27",
      "score": 3,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Quick question for founders:\n\nBefore doing interviews, how do you usually screen candidates?\n\n* Forms feel too loose.\n* Calls feel too slow.\n* Tests feel too heavy.\n\nWe’re trying to find a middle ground that’s structured but fair.\n\n\n\nWould love to hear what’s working (or not) for you.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qry0o9/how_do_you_screen_candidates_before_interviews/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o2risf0",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-31 09:34:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rkvo7",
          "author": "Nervous_Brilliant441",
          "text": "A 15-30min video call is always our first round. Probably like 70% will not make it to the second round. \n\nFinding the right person for the job (especially for startups) is insanely important. Never take it lightly or think you don’t have the time.",
          "score": 1,
          "created_utc": "2026-01-31 09:54:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2t5ysg",
          "author": "StillLoadingit",
          "text": "I usually start with a simple screening task or questionnaire that’s directly tied to the work they’d be doing so I can see real thinking instead of just resumes. It cuts down pointless interviews and gives you something concrete to talk about when you do meet.",
          "score": 1,
          "created_utc": "2026-01-31 16:16:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vcaw9",
          "author": "therealtricklowe",
          "text": "Hire fast, fire faster, and keep the ones that work out. \n\nOver thinking, over planning, over estimating people, is all a waste of time.   \n  \nYou'll find out who they are 1-2 months after they start working there.   \n  \nWhat's written on their resume doesn't matter.\n\nTheir work ethic, ability to learn, creativity, loyalty, and reliability will never show on a resume, they show up in the workplace.\n\nResume's are lie sheets.   \nInterviews are lie presentations.  \nYou'll never know who the person is, until they start working for you. \n\nSo, interview those that look qualified on paper, nobody else.   \n  \nHire people that can hold the conversation in the interview. Those that are living, breathing, seem capable, and fit the culture. \n\nAnyone that doesn't work out, fire them quickly, and hire someone else. \n\nIn any growing business, hiring and recruitment never stops.\n\n",
          "score": 1,
          "created_utc": "2026-01-31 22:35:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34v50l",
              "author": "JackfruitOwn3238",
              "text": "Nicely put down! well said",
              "score": 2,
              "created_utc": "2026-02-02 10:46:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2yu4z9",
          "author": "Technical-Spend-9037",
          "text": "Use a short structured application 5–7 focused questions plus a quick async [task.It](http://task.It) filters for clarity and effort without taking too much time for the candidate.",
          "score": 1,
          "created_utc": "2026-02-01 13:34:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3e7njz",
          "author": "Right-Noise-6222",
          "text": "This is a very common problem / bottleneck! Candidly a lot of this has to do with the type of role you are hiring. In general though, you want to hire people who have direct experience doing the job you are hiring for. In other words, if you are hiring a salesman for a painting company you want to make sure they have success/experience doing just that in the past. It may make the screening process of resume's longer but it increases your odds of hiring an A candidate much higher.",
          "score": 1,
          "created_utc": "2026-02-03 19:19:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qud6p9",
      "title": "If you’re on a tight budget, you don’t need the “best” email verifier",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qud6p9/if_youre_on_a_tight_budget_you_dont_need_the_best/",
      "author": "coldemailalex",
      "created_utc": "2026-02-03 00:40:24",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Not every team needs the most expensive email verification tool.\n\nIf you’re a small to medium business and just need “good enough” validation to avoid obvious bounces, there are cheaper options that still work.\n\nI tested one that’s much cheaper, credits don’t expire, and it kept our bounce rates under control. Downsides were slower speed and fewer integrations, but for the price, it made sense.\n\nOverpaying for tooling early on is a mistake I’ve made before.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qud6p9/if_youre_on_a_tight_budget_you_dont_need_the_best/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o39abj2",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 00:40:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu61ns",
      "title": "Pitching startup to incubator and I'm freaking out a bit",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qu61ns/pitching_startup_to_incubator_and_im_freaking_out/",
      "author": "LazyInvestor92",
      "created_utc": "2026-02-02 20:07:31",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "So I have my meeting with incubator in this week to pitch my startup idea. If they accept us, the incorporation costs through in5 are way cheaper than going the traditional route. For someone bootstrapping this, that difference actually matters a lot.\n\nBut honestly, I can't sleep. I've rehearsed this maybe 20 times now. I know my market size, I've got my financial projections ready, I understand the competitive landscape. But there's such a huge gap between knowing your material and actually convincing experienced investors that your idea deserves their time. These people at in5 have seen hundreds of startups. They know immediately what's real and what's just wishful thinking.\n\nI keep imagining them asking why this doesn't exist already if it's such a good idea, or what happens when someone like Careem decides to enter this space, or how exactly I plan to acquire customers without burning through cash. And honestly, the scariest question is probably \"why you?\" I have investment banking experience, I understand this market, I've done months of research. But is that actually enough to build this thing?\n\nWhat do these meetings even focus on? Should I lead with the problem or jump straight to our solution? How deep should I go on the technical AI stuff versus keeping it high level? At this stage with no traction yet, are they looking more at the idea itself or trying to evaluate if I'm the right person to execute it?\n\nIf anyone here has pitched to incubators in GCC, what actually matters in that room? Should I just trust that I've prepared enough and be myself, or is there some specific thing these meetings look for that I might be completely missing? Any advice would really help right now.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qu61ns/pitching_startup_to_incubator_and_im_freaking_out/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o37s6dt",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 20:07:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37vy3q",
          "author": "hamzamabrook",
          "text": "I haven’t pitched in GCC, but I’ve worked with a few incubators in the region and pitched to investors outside MENA, and had investments for a gig about 2 years back. So hope the following helps!\n\nThe pitching game has definitely evolved, especially in the last 6-12 months. I’m not sure we can really value “code” the way we used to anymore, it’s easier, cheaper, and faster to build now. The real defensibility is in the person (or people) behind it, you! Like a lot of zero-day investors (Antler, etc.), I feel like the yes/no decision mostly comes down to founder-fit at this stage. \n\nSo have faith in yourself. Trust your vision and sell it. Make them believe you are the best person to solve this problem, not that you have the perfect solution. Founders should be in love with the problem, not the solution, because the solution will definitely pivot, change, and improve over time. \n\nAll the very best! Let me know how it goes :)",
          "score": 1,
          "created_utc": "2026-02-02 20:25:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3aid2i",
              "author": "Muckraker2025",
              "text": "Do you ever see pitches for non-tech businesses?",
              "score": 1,
              "created_utc": "2026-02-03 05:05:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o39lmrs",
          "author": "Dope_Martian",
          "text": "Sounds like you are really dialed in on how to present your vision. Wishing you well in this.",
          "score": 1,
          "created_utc": "2026-02-03 01:44:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39m22h",
          "author": "ScradleyToronto",
          "text": "You sound ready. \n\nLead with the problem that you’re solving not the product. They want to know two things mainly. What can you and your team realistically do and how big is the market you are chasing?\n\nHave you done a dry run in front of a knowledgeable person as part of your rehearsal?",
          "score": 1,
          "created_utc": "2026-02-03 01:47:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu02pa",
      "title": "The $2B sports streaming opportunity hiding in plain sight (World Cup 2026 analysis)",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qu02pa/the_2b_sports_streaming_opportunity_hiding_in/",
      "author": "Funny_Masterpiece_35",
      "created_utc": "2026-02-02 16:39:53",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I have been analyzing the sports streaming market for the past eighteen months, and there is a massive opportunity that most entrepreneurs are completely overlooking. With World Cup 2026 coming to North America and streaming rights fragmenting globally, the barriers to entry have dropped while demand is exploding.\n\nThe major platforms like ESPN+, DAZN, and Paramount+ are fighting over premium rights to tier-one leagues. Meanwhile, there are thousands of regional leagues, college sports networks, amateur competitions, and niche sports that cannot secure favorable distribution deals. These content owners are desperate for streaming solutions but lack the technical infrastructure to launch platforms independently.\n\nHere is what makes this opportunity compelling right now. The technology infrastructure that once required millions in investment and entire engineering teams can now be deployed in weeks rather than months. The core components include live streaming architecture, content delivery networks for global reach, ad insertion technology, mobile applications, and payment processing systems. What previously represented an insurmountable barrier to entry has become accessible through modern platform solutions.\n\nThe revenue model is remarkably straightforward and proven. Ad monetization through pre-roll and mid-roll advertising generates the primary revenue stream, particularly when you can offer local and regional advertisers direct access to engaged sports audiences. Subscription tiers provide recurring revenue, while pay-per-view options work exceptionally well for championship events and premium matchups. Sponsorship overlays and branded content create additional streams, and for those willing to navigate the regulatory complexity, fantasy sports and betting integration can dramatically increase user engagement and lifetime value.\n\nThe timing creates a perfect storm of opportunity. World Cup 2026 will drive unprecedented demand for streaming infrastructure across North America. Emerging markets in Southeast Asia, Africa, and Latin America are experiencing explosive growth in mobile-first streaming consumption. Regional advertisers want access to sports audiences but cannot afford the premium rates that major platforms command. Meanwhile, younger demographics have completely abandoned traditional cable and expect all content to be available on mobile devices.\n\nI have been working directly in this space, and the unit economics are stronger than most SaaS businesses if you can secure content partnerships. A regional streaming platform serving a single sport or league in a mid-sized market can achieve profitability within six to twelve months with proper execution. The customer acquisition cost remains relatively low because sports fans actively seek out content for their favorite teams and leagues.\n\nThe challenges are real but manageable. Content acquisition requires relationship building and often revenue-sharing arrangements rather than large upfront payments. The technical infrastructure, while more accessible than before, still requires expertise to implement properly. You need to navigate varying regulations across markets, particularly if you incorporate betting features. Competition exists, but the market remains fragmented enough that focused regional plays can succeed.\n\nFor anyone seriously considering this space, I recommend starting with a single sport or league in a defined geographic market rather than attempting to build a broad platform immediately. Establish partnerships with content owners who currently have no distribution or poor distribution deals. Focus on mobile-first development since that is where consumption is heading globally. Build ad monetization into your core platform from day one rather than treating it as an afterthought.\n\nI have been building solutions in this exact space through my work on sports streaming infrastructure. The technical barriers that once prevented entrepreneurs from entering this market have largely disappeared, which is why we are seeing an explosion of regional platforms globally. If you have relationships with sports content owners or understand a specific market well, this represents one of the most compelling opportunities I have analyzed in the streaming economy.\n\nI am happy to discuss the specifics with anyone exploring this space. What aspects of sports streaming or ad monetization would be most valuable to break down further?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qu02pa/the_2b_sports_streaming_opportunity_hiding_in/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o36iwri",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 16:39:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36jwlh",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 16:44:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36k8vp",
              "author": "Funny_Masterpiece_35",
              "text": "take a look of our service [buildyour.stream](http://buildyour.stream)",
              "score": 0,
              "created_utc": "2026-02-02 16:45:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37rv4b",
          "author": "SensitiveService5586",
          "text": "nice idea",
          "score": 1,
          "created_utc": "2026-02-02 20:06:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36jkzv",
          "author": "Funny_Masterpiece_35",
          "text": "Go to [buildyour.stream](http://buildyour.stream)",
          "score": 0,
          "created_utc": "2026-02-02 16:42:57",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1qw6h4t",
      "title": "My kids want to join the family business and I'm not sure that's a good thing",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qw6h4t/my_kids_want_to_join_the_family_business_and_im/",
      "author": "sychophantt",
      "created_utc": "2026-02-05 00:43:00",
      "score": 3,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "So my daughter wants to take over the brokerage eventually and part of me is thrilled because succession planning is a nightmare and having family interested solves a lot of problems, but there's this other part that wonders if she's only interested because it's comfortable and familiar rather than something she actually wants to build her life around.\n\nShe's got all these ideas about modernizing things and I don't have the energy to evaluate every new tool she finds online. Some of her suggestions have been good, others were complete duds, and I honestly can't always tell which is which until we're already knee deep in implementation. Anyone else navigated bringing the next generation into a family business without either person ending up resentful?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qw6h4t/my_kids_want_to_join_the_family_business_and_im/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o3mson7",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 00:43:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mu53c",
          "author": "Trevor519",
          "text": "Trial and error will be the best teacher, she's either gonna get it and thrive or drive it into the ground 50/50 chance",
          "score": 3,
          "created_utc": "2026-02-05 00:51:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nr74r",
          "author": "Justin_3486",
          "text": "My son picked phone handling as his thing to modernize and I made myself step back completely even though it was hard. He researched options for like two weeks, settled on sonant, handled the whole setup and training the system on how we do things. First month I kept wanting to check if calls were being handled right but forced myself not to interfere. Turned out he did a better job than I expected and now he actually owns that whole piece of operations, troubleshoots issues himself, pulls the reports. Gave him a real win that wasn't me handing him something easy, and now when he brings up other ideas I take them more seriously because he proved he can execute. The key for us was picking something contained enough that if it flopped it wouldn't sink the business, but meaningful enough that success actually mattered.",
          "score": 3,
          "created_utc": "2026-02-05 04:04:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nphkd",
          "author": "scrtweeb",
          "text": "Let them own specific projects completely, like full ownership with no hovering. If it works great, if it fails they learn something. Micromanaging kills their interest fast.",
          "score": 2,
          "created_utc": "2026-02-05 03:53:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3npczx",
          "author": "Relative-Coach-501",
          "text": "Going through this exact thing and had to accept that their way isn't wrong just because it's different from how I built things.",
          "score": 1,
          "created_utc": "2026-02-05 03:52:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ov6w9",
          "author": "Mentor-Pak",
          "text": "Working under your supervision is better until or unless you seen her getting matured decision and wise advices for the business. Everyone needs a mentor be her mentor in your business and let her journey start",
          "score": 1,
          "created_utc": "2026-02-05 09:38:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q6pdy",
          "author": "Forsaken_Lie_8606",
          "text": "the fact that you re hesitant is actually a good sign - means you re thinking about what s best for them not just the business. maybe have them work somewhere else first for 2-3 years so they bring fresh perspective and earn respect from the team",
          "score": 1,
          "created_utc": "2026-02-05 15:06:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qjlhy",
          "author": "aicreds",
          "text": "Access ≠ authority. Being the founder’s kid gives her a seat at the table, not the instincts that come from years of getting punched in the mouth by the business.\n\nThe urge to modernize is super common with the next generation. It’s a lot easier to swap software than to really understand the messy, relationship-driven dynamics that actually make a brokerage work. Tools feel like progress; judgment takes time.\n\nSend her to work for a competitor (or even a related but different firm) for a couple of years. No safety net, no family halo. If she thrives, she comes back with credibility and perspective. If she hates it or flames out, you’ve learned something before resentment or bad decisions set in.",
          "score": 1,
          "created_utc": "2026-02-05 16:07:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvmqqp",
      "title": "Pressure-testing my thinking on distribution problems",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qvmqqp/pressuretesting_my_thinking_on_distribution/",
      "author": "_Adityashukla_",
      "created_utc": "2026-02-04 12:03:15",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "I’ve been working around distribution for a couple of years and want to test how well I actually understand real problems, not theory.\n\nIf you’re building something and stuck on distribution, drop a *specific* problem you’re facing.  \nI’ll try to reason through it and would love others to poke holes or add context.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qvmqqp/pressuretesting_my_thinking_on_distribution/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o3ilfro",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-04 12:03:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3or75k",
          "author": "Substantial_Lynx4329",
          "text": "Hi Aditya, that’s a great chance to have. \n\nWe built Hatrio AI. It’s a content marketing SaaS. We tried distribution through Wix and Shopify plugins but that added more dependencies to manage. \n\nWe could use your help.",
          "score": 1,
          "created_utc": "2026-02-05 08:59:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ossrc",
              "author": "_Adityashukla_",
              "text": "Thanks for sharing. One thing that stands out immediately: Wix and Shopify plugins aren’t really *distribution* channels, they’re **activation accelerators** once demand already exists. If there’s no pull, they just add surface area and dependency, like you felt.\n\nA quick win you can try: instead of asking “how do we distribute Hatrio AI?”, narrow it to **one content moment** where a marketer already feels pain (e.g. I need to publish today but don’t know *what* or *why*). Build your messaging, demo, and even outreach around that single moment.\n\nMost content tools fail early because they market “AI content” instead of owning one stressful job.\n\nIf you want, share what *specific situation* users come to you for right now, and I can help pressure-test that angle.",
              "score": 1,
              "created_utc": "2026-02-05 09:14:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qu2zpw",
      "title": "Content Writing for Entreprenuers Who Have A Website...",
      "subreddit": "Entrepreneurship",
      "url": "https://www.reddit.com/r/Entrepreneurship/comments/1qu2zpw/content_writing_for_entreprenuers_who_have_a/",
      "author": "PalmerCorey",
      "created_utc": "2026-02-02 18:20:47",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Curious how other founders handle content these days. Writing blog posts, landing pages, or SEO content can be time-consuming, and I’m interested in how people are approaching it.\n\nAre you writing everything yourself, outsourcing, using templates, or relying on specific tools or workflows to speed things up? What’s worked (or hasn’t) for you?\n\nMy current content stack looks like this:\n\n1. [Zapier.com](http://Zapier.com) / [Make.com](http://Make.com) – automation between research, writing, and publishing\n2. [BlogAndPost.com](http://BlogAndPost.com) – automated, SEO-researched article writing tool\n3. Yoast – on-page SEO checks inside WordPress\n4. [SEMrush.com](http://SEMrush.com) – keyword research, gap analysis, and validation\n5. Google Search Console – performance + indexing feedback\n\nNothing fancy on its own, but together it removes most of the manual grind.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Entrepreneurship/comments/1qu2zpw/content_writing_for_entreprenuers_who_have_a/",
      "domain": "self.Entrepreneurship",
      "is_self": true,
      "comments": [
        {
          "id": "o374zlm",
          "author": "AutoModerator",
          "text": "This sub is **heavily and viciously** moderated, there is a zero tolerance policy for **any** kind of spam or promotion, you have been *kindly* warned. Please report anything you see that breaks the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneurship) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 18:20:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o394alz",
          "author": "therealtricklowe",
          "text": "Everything I write comes from an idea I had while hiking / walking.\n\nI write them all into a notes app, or voice notes, then transfer them over into Notion.\n\nMy notion content writing folder has thousands of ideas.\n\nKeyword research is not typically part of my stack anymore, especially since the end of organic SEO impact, and major drops in Google search traffic, and search impressions, as the no-click search takes over. \n\nIf you're writing about the same topic on the site, it's now more important for your site to have a much more similar content base across the site, than just a page or two. \n\nKeywords now tend to rank based on overall context of the site more now, so individual articles and blog posts are not as revelant in this strategy. Looking for gaps in the content market is completely irrelevant today.\n\nThink about this as writing more for citations, than for individual pages to rank, because organic searhc results do not result in site visits anymore.\n\nWhen researching keywords, I would use Google Ads platform, then export results via CSV file, combine the sheets in Google Docs, and filter to look for low-hanging fruit, then aim for long tail keyword with low competition. \n\nInstead now, I write more for social media content strategy to link back to, strategic SEO, content marketing, and optimize for AI Overview citations, and LLM citations. This relies on similar info being cited as the same patterns are seen across platforms, and they build credibility, and thought leadership. \n\nI typically use Claude for editing advice, not to actually write or edit, but for editorial commentary. I also ask Claude to recommend which phrases to add internal link strategies to, within the frame of my website.\n\nI use Grok for up-to-date research, Gemini for image generation, Chat GPT for ideation occasionally, then Photoshop and illustrator for images and vector work.\n\nWhen doing deep research, I combine GPT, Perplexity, Grok, GeminI and Dlaude results from the same prompt. Then, I ask Chat GPT to summarize all info, and put it into a useful reference doc. Or, use a metaprompt to create lifelike content posts around a topic.\n\nWordPress and Divi Theme for content production and website layouts, and web development.\n\nSimple YOAST or AIO for OTF adjustments on pre-post optimization.\n\nDifferent images for mobile and desktop for fastest mobile loading speeds.\n\nWithin my plugin structure, I use a lot of caching, cache clearing njinx helper, CDN assistants, etc., for further optimization on delivery, mostly provided by agency hosting provider.",
          "score": 1,
          "created_utc": "2026-02-03 00:07:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39m3wg",
          "author": "Dope_Martian",
          "text": "I have a great team and we get it done together.",
          "score": 1,
          "created_utc": "2026-02-03 01:47:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}