{
  "metadata": {
    "last_updated": "2026-02-13 09:09:58",
    "time_filter": "week",
    "subreddit": "EntrepreneurRideAlong",
    "total_items": 20,
    "total_comments": 248,
    "file_size_bytes": 247585
  },
  "items": [
    {
      "id": "1qzsu8l",
      "title": "Stopped buying leads. Started 'stealing' them. Here's what happened.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qzsu8l/stopped_buying_leads_started_stealing_them_heres/",
      "author": "TheHealthlover101",
      "created_utc": "2026-02-09 03:05:19",
      "score": 99,
      "num_comments": 10,
      "upvote_ratio": 0.93,
      "text": "I wasted like $2k on lead lists before I figured this out. Posting in case anyone else is burning money the same way I was.\n\nBackground: bootstrapped b2b saas, tiny budget, couldn't afford SDRs. Was doing all outbound myself.\n\nBought lists from apollo, clearbit, zoominfo trials, you name it. Response rates were embarrassing. Like 1-2%. Started thinking outbound just \"doesn't work for our space.\"\n\nThen I had a dumb realization that honestly should've been obvious way sooner.\n\n**The people I want to sell to are already telling me who they are.**\n\nThey're following my competitors on linkedin.\n\nThey're commenting on posts about the exact problem I solve.\n\nThey're engaging with content in my niche every single day.\n\nWhy am I paying for some scraped list of \"CMOs in the US\" when I can just... look at who's actively interested in my space?\n\n**What I started doing:**\n\n1) Found the 5 biggest competitors in my space. Looked at their linkedin company page followers. Filtered by job title. These people literally followed a company that does what I do. They're not cold.\n\n2) Found \\~10 people who post content about my problem space. Looked at who's commenting and engaging. These people are self-identifying as caring about this topic.\n\nThen I just reached out. Super simple message like \"saw you engage with \\[x\\]'s post about \\[topic\\], working on something related, thought you might have thoughts\"\n\n**What changed:**\n\nOld way (bought lists): \\~2% reply rate, most replies were \"not interested\" or \"remove me\"\n\nNew way: 35-40% reply rate, and these people actually want to talk because they're already thinking about this stuff\n\nWent from mass outreach to like 30-40 hyper targeted messages per week. Way less volume but 10x the results.\n\n**The boring logistics part:**\n\nYou can do this manually (I did for the first few weeks, it sucked). There's some tools that scrape linkedin engagers - I've tried a few, won't shill any specific ones here but just google \"linkedin engagement scraper\" and you'll find options. Some let you automate the outreach too which saves time.\n\nMain point isn't the tools though. It's the mindset shift.\n\nStop trying to find people who MIGHT be interested.\n\nStart finding people who already ARE interested.\n\nThey're right there. Engaging with your competitors. Commenting on relevant content. Following pages in your space.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qzsu8l/stopped_buying_leads_started_stealing_them_heres/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4diayx",
          "author": "UniqueStress778",
          "text": "Gold.",
          "score": 8,
          "created_utc": "2026-02-09 03:43:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4du1zw",
          "author": "maubis",
          "text": "A variation of you're describing also worked for me. \n\nI have a side business reselling in one particular category. I used to spend lots of time trying to figure out what to buy and sell that could leave a reasonable margin. \n\nI then realized I can just see what my biggest competitors are doing. And sure enough, many of the items they were selling was something I could manage to do as well. It massively increased the efficiency of time spent researching.\n\nPoint is when you don't know where to start, steal ideas from your competitors.",
          "score": 4,
          "created_utc": "2026-02-09 05:02:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dyop3",
          "author": "tenkaishy",
          "text": "How can you see the people that follows a page? I can not click on the followers number on the page! Thank you!",
          "score": 3,
          "created_utc": "2026-02-09 05:37:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ehdio",
              "author": "Nixisworld",
              "text": "I think because its locked, at least thats what ChatGPT says, especially the smaller companies.",
              "score": 1,
              "created_utc": "2026-02-09 08:24:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e7j5h",
          "author": "ContributionEast8976",
          "text": "> thought you might have thoughts \n\nOn what? \n\nYou cut your quote just before the most important part\n\nAre you just dumping your link on them? or are you collecting their thoughts on some info lead funnel thing?",
          "score": 1,
          "created_utc": "2026-02-09 06:51:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4egf3z",
          "author": "hubsell",
          "text": "It’s a good approach but definitely recommend to layer it with your persona criteria. Not all people that follow your competitor or like/comment on a post are relevant. \n\nSecond thing I can recommend is to lead with sharing content, invite to an event, or something. \n\nYou can also scrape \n- LinkedIn event attendees, \n- followers of Profiles (not just company pages)\n- any combination of LinkedIn classic or Sales Navigator search.\n\nLayer these on top of each to surface the most relevant hand-raising leads.",
          "score": 1,
          "created_utc": "2026-02-09 08:15:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ehoet",
              "author": "Wide_Brief3025",
              "text": "Totally agree that layering persona filters and focusing on real engagement works way better than just scraping random contacts. If you want to catch relevant discussions as they happen across multiple platforms, ParseStream makes it pretty easy to set keyword alerts and spot genuine leads right when they show interest.",
              "score": 1,
              "created_utc": "2026-02-09 08:27:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ehtp4",
          "author": "Willing-Training1020",
          "text": "Wow for that 35-40% reply rate. In my experience also, the engagement scraping approach works way better for early stage when you don't have budget for SDRs and need quality over volume. One thing I'd add is once you hit a ceiling on how many messages you can personally send, having a remote ops person handle the scraping and list building while you focus on the actual convos can stretch this approach further without losing the personal touch.",
          "score": 1,
          "created_utc": "2026-02-09 08:29:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ejfdi",
          "author": "space_cadett_kiwiora",
          "text": "THIS IS GREAT!\n\nAnyone know of scraping tools I can use?  I’ve been doing cold outreach and it’s been sooo deflating!",
          "score": 1,
          "created_utc": "2026-02-09 08:45:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r105ly",
      "title": "Does being an entrepreneur really mean working 24/7?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r105ly/does_being_an_entrepreneur_really_mean_working_247/",
      "author": "SignPsychological728",
      "created_utc": "2026-02-10 13:03:23",
      "score": 56,
      "num_comments": 71,
      "upvote_ratio": 0.94,
      "text": "A genuine question for founders and builders here.\n\nThere’s this popular idea that being an entrepreneur means working 24/7, sacrificing everything, and constantly hustling. Social media often makes it look like if you’re not grinding all the time, you’re doing it wrong.\n\nBut in real life, is that actually true?\n\nDo successful entrepreneurs really work non-stop, or is it more about working smart, prioritizing the right things, and building systems that reduce constant effort over time?\n\nFor those who are building businesses:\n\n* How many hours do you *actually* work?\n* Has your workload changed as your business grew?\n* What does a healthy work-life balance look like for you?\n\nCurious to hear real experiences instead of motivational quotes and hustle culture posts.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1r105ly/does_being_an_entrepreneur_really_mean_working_247/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4mavy4",
          "author": "Weddyt",
          "text": "It’s not 24/7 work but 24/7 on your mind because if you’re the only one working on your business you know that not working means not moving. You’ll develop guilt towards yourself and will likely have an u healthy balance. But that’s also what’s needed somehow. I’d say work enough where you can replace your salary then hire and train to get your time back and scale this way",
          "score": 16,
          "created_utc": "2026-02-10 14:26:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4nddpk",
              "author": "Secret-Rock-9040",
              "text": "Absolutely. I’m always trying to improve. We’re also transitioning to getting our business online vs just locals in the area. So that alone is a lot of work.",
              "score": 1,
              "created_utc": "2026-02-10 17:30:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4mdpvj",
          "author": "Ok-Fly-1022",
          "text": "to tell you the truth it is no one will ever work as hard as you for your own business ",
          "score": 49,
          "created_utc": "2026-02-10 14:41:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4o2o4r",
              "author": "RecognitionSignal425",
              "text": "\\*24/24 ",
              "score": 2,
              "created_utc": "2026-02-10 19:26:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lzigp",
          "author": "realkaydhako",
          "text": "I worked ~14h/day for 10yrs to aquire the skills and knowledge to be able to work ~1h/day.",
          "score": 40,
          "created_utc": "2026-02-10 13:23:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4qeub7",
              "author": "Fopopin",
              "text": "What skills did you find most useful after all these years? ",
              "score": 5,
              "created_utc": "2026-02-11 02:49:48",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4rn5i8",
              "author": "zeeahh",
              "text": "When did you start?",
              "score": 1,
              "created_utc": "2026-02-11 08:36:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4mabro",
          "author": "Hecker8778",
          "text": "to be frank the 24/7 grind is mostly just influencer noise. If u are actually building, burnout is the enemy, not the badge of honor.\n\nMy hours dropped significantly once I stopped trying to DIY everything. I used to stay up till 2am tweaking pixels on pitch decks or trying to design social posts, which is dumb cause I'm not a designer. Now I just focus on the core product and offload the visual grunt work to AI. I use Runable for decks and updates now, it does the heavy lifting so I don't have to spend my weekends fighting with formatting tools.\n\nIt’s not about working less, it’s about leverage. If u spend 4 hours doing something a tool could do in 5 mins, that’s not hustling, that’s just bad management.",
          "score": 29,
          "created_utc": "2026-02-10 14:23:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ly44f",
          "author": "OneHunt5428",
          "text": "Early on it felt like 24/7 because the business was me. But once you start building systems and delegating it changes. Now I work less than I did at my old corporate job. The hustle should be about creating leverage, not just burning hours. A sustainable pace is what lets you play the long game.",
          "score": 23,
          "created_utc": "2026-02-10 13:15:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lz5e8",
          "author": "Electronic-Donut-695",
          "text": "I am now working 24/7 but I believe when I scale and start to grow, it will be less than that and since I am learing now, I can build then systems and make the most of the work build itself.",
          "score": 3,
          "created_utc": "2026-02-10 13:21:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m560l",
          "author": "CKsenior",
          "text": "I think that really depends on whether you want to build a side hustle, whether you want to become a solopreneur, or whether you want to build a scaling team. Once you start hiring, once you take the risk on for other people's wellbeing and job security, and once you start serving customers at scale, things get very different.\n\nI am reachable 24/7, which doesn't necessarily mean that I work 24/7 but I certainly work 70-plus hours a week and I think that is what it takes to scale. Clearly this isn't what it takes to build a solopreneur business or a side hustle, which can still produce interesting cash for you.",
          "score": 3,
          "created_utc": "2026-02-10 13:55:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mby2b",
          "author": "Jegor_Krafte",
          "text": "The \"24/7 hustle\" is usually a mix of early-stage necessity and a lack of boundaries. Unless you have the capital to follow that Kiyosaki-style advice and hire a full team on day one, you’re basically a one-man band for a while.\n\nIt definitely gets easier once you scale and hire, but the real secret to staying sane as a solo founder is training your clients early. If you answer the phone at 10 PM, you’re telling them that’s your official office hour. You have to be the one to set the rules, or you'll just burn out before you even get to the point of hiring your first employee.",
          "score": 3,
          "created_utc": "2026-02-10 14:31:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ocu12",
          "author": "Rich_Direction_3891",
          "text": "I worked for way more hours in the beginning than i do now, mostly because i didn’t know what actually mattered. now it's like fewer hours but more mentally demanding decisions. and balance keeps changing tbh some days are chill some aren’t.",
          "score": 3,
          "created_utc": "2026-02-10 20:13:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4onwhs",
              "author": "MarcoMusings",
              "text": "Yeah, this. You learn how best to spend your time and ways to maximise that. We’re people, not machines, we’re supposed to do joyful things and recharge. You can build a successful business doing both.",
              "score": 2,
              "created_utc": "2026-02-10 21:05:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lxbj1",
          "author": "HarjjotSinghh",
          "text": "i quit my job for this hustle so i could sleep sometimes.",
          "score": 4,
          "created_utc": "2026-02-10 13:10:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tgexn",
          "author": "Ok-Leadership-9748",
          "text": "I think the serious ones do work like that. I've been in business 15+ years and every founder I respect has had a season where they went all in. But here's what nobody puts in their LinkedIn post - the ones who survived it had a partner. Not a motivational quote, an actual human sharing the weight. I'm a non-technical cofounder. My job isn't code - it's connections, testing our methodology on real people, pitching at events, building community around what we're making, and making sure my technical cofounder worries about exactly one thing: building. That's it. Everything else is my problem. The 24/7 grind is real but it's not supposed to be a solo sport. The hustle culture guys always show one person on a mountain. Nobody asks who carried the gear.",
          "score": 2,
          "created_utc": "2026-02-11 15:57:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lxa7e",
          "author": "dildoswaggins71069",
          "text": "I worked a lot more when I was employed and trying to get something on the side going. Now that my side thing is going and my income is tripled, let me put it this way: I’m halfway maxed on old school RuneScape. The whole point of being an entrepreneur is to NOT be a wage slave, at least to me",
          "score": 2,
          "created_utc": "2026-02-10 13:10:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m3r1v",
          "author": "Aldy_Wan",
          "text": "Yes.",
          "score": 1,
          "created_utc": "2026-02-10 13:47:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m97vi",
          "author": "Immediate-Syrup-1574",
          "text": "Really depends on what you do and what your end goal is.\n\nIn the beginning, most things require more work to get them running but some businesses (like Amazon FBA, which I've been doing now for over 10 years) can be a good hustle with 2 hours a day",
          "score": 1,
          "created_utc": "2026-02-10 14:17:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mb3eb",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-10 14:27:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4mb3lb",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r105ly/does_being_an_entrepreneur_really_mean_working_247/o4mb3eb/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-10 14:27:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4mco5q",
          "author": "MathewGeorghiou",
          "text": "Lots of good answers here that show you the real answer — it depends — and you won't know how it's going to work out for you until you are in it.",
          "score": 1,
          "created_utc": "2026-02-10 14:35:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4moxq0",
          "author": "worthycause",
          "text": "Only if you want to be successful.",
          "score": 1,
          "created_utc": "2026-02-10 15:37:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mppfz",
          "author": "FatherOften",
          "text": "Business is comprised of a bunch of seasons.Just like life.\n\nIn the early years, when juggling a job family and the business there were times when the hours were a little ridiculous. I wanted to make sure that my family didn't pay the price. So I worked my schedule around them. That meant once everyone was in bed asleep.I got up and I would work for a few hours every night. Then, I would get up very early in the morning to work.And prepare breakfast before leaving for work.\n\nEarly on I found the power list created by Andy Frisella.\n\nOnce the business had traction, and I was working it full time in late year 3 i started making my list of five action items to do every day. That list can be personal family or business. And usually as a combination of all three.\n\nWhen i've knocked out my five things for the day, then i've won the day and I can choose what to do with the rest of my time.\n\nIn year ten now, currently that's how I live. I sleep until I wake up. I have breakfast with my family every morning. Then I start my day. I'm usually home in the late afternoon.\n\nThere are seasons where things are busier. I have a huge inventory order arriving tomorrow. So today i'm preparing everything in the warehouse to receive it. Once it arrives, I will check everything in and stock it on the shelves. Then, I'll fill all the back orders that i've acquired. Ship out any new first orders for the day.And onboard any new customers. Then I'll go home. \n\nBut I understand that tomorrow might be a fifteen hour day or longer. I will work until the job is done. Because if not, it would make the next day harder.\n\nThe big thing is, if you have something that needs to get done, you finish it. If tomorrow is going to be a very long day. Then, I will probably have breakfast with the family and I will come home for dinner and play with my children.And hang out with my wife until they're all in bed.And then I'll come back up to the warehouse and work all night if I have to. My family won't know because I will be there cooking breakfast in the morning.",
          "score": 1,
          "created_utc": "2026-02-10 15:41:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mqid5",
          "author": "Slowmaha",
          "text": "I’m always kind of working.",
          "score": 1,
          "created_utc": "2026-02-10 15:45:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mr7a9",
          "author": "Inevitable-Earth1288",
          "text": "I believe you can work less, but this reduces your chances of success. Look at all the cool entrepreneurs, they live and breathe with their business. It takes time and effort to get things rolling and reach a point where your business can run even when you’re not hands-on all the time.",
          "score": 1,
          "created_utc": "2026-02-10 15:48:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mv5nf",
          "author": "kmm290859",
          "text": " I think when you first start you do everything you can whenever you can to make your business work but as you get a little bit longer in my tooth and hopefully a little bit wiser you realise it's all about working smart not working hard! 👍",
          "score": 1,
          "created_utc": "2026-02-10 16:06:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n2ij0",
          "author": "MoonLabsApp",
          "text": "For me it's more like whenever the business need I work. It's like available 24/7, but not really mean work 24 hours a day...",
          "score": 1,
          "created_utc": "2026-02-10 16:40:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n4nrx",
          "author": "JMALIK0702",
          "text": "Initially of course you have to be the hardest person in the room, but even while I say this, it's not worth it. I have a family and when I started my company 5 years ago, I made a promise to myself that I will not lose myself in the process. It is totally not worth losing hairs, take a deep breath sometimes, pause and look at the zoomed out picture. It's an conscious effort.",
          "score": 1,
          "created_utc": "2026-02-10 16:50:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nd116",
          "author": "jhopeh",
          "text": "Yes, but no. It really depends on what your business is and at what point in your business you are at. To begin with, a lot of times you are going all out to really build it up, and once you’re in a stable position, you can usually slow down a bit. \nBut also, I find it better because I’m able to make my own schedule and work when I want to work",
          "score": 1,
          "created_utc": "2026-02-10 17:29:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nq5s4",
          "author": "m424filmcast",
          "text": "It depends on the business. I have three that I have started in the past few years and continue to operate, one of which required way more attention and time, and the other two which basically take up mornings but not evenings. It also depends on how you run them. Two of mine now basically run without much effort from me, the other one requires much more attention. But my day generally ends around 2-3pm.",
          "score": 1,
          "created_utc": "2026-02-10 18:29:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nvuov",
          "author": "SnowmanRandom",
          "text": "It depends. Starting a successful business is a marathon, not a sprint. Sometimes you will be working all day, but you have to make sure you are sleeping enough and are emotionally balanced so you can make the right decisions and perform when it matters.",
          "score": 1,
          "created_utc": "2026-02-10 18:55:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nwhfp",
          "author": "terserterseness",
          "text": "No",
          "score": 1,
          "created_utc": "2026-02-10 18:57:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4o4ozf",
          "author": "coffeeebrain",
          "text": "early stage you work a lot but not because of hustle culture, because everything's on fire\n\nbut 24/7 is performative. nobody's actually productive like that\n\nwhat matters more is focus. spending time on things that actually move the needle vs looking busy\n\nas you grow it should get better if you delegate and build systems. if it doesn't you're doing something wrong",
          "score": 1,
          "created_utc": "2026-02-10 19:36:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4o4skb",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-10 19:36:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4o4sm6",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r105ly/does_being_an_entrepreneur_really_mean_working_247/o4o4skb/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-10 19:36:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ozq69",
          "author": "drewander123",
          "text": "In reality no.  The first few years might feel like it, but then once you’ve built the systems to take that work load off you and onto other people it gets easier \n\nThat being said it’s always on your mind 24/7 and when things go sideways as they always will it’s your job and responsibility to right the ship\n\nSo, no…. If your doing it right but yes, it’s your baby and she’s always on your mind if your being responsible\n\nThat said, I wouldn’t want to do anything other than run my own company and would have a hard time working for somebody else now",
          "score": 1,
          "created_utc": "2026-02-10 22:00:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p22hv",
          "author": "Alternative-Lime7814",
          "text": "996 🤘",
          "score": 1,
          "created_utc": "2026-02-10 22:11:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pc4xi",
          "author": "rsvistel",
          "text": "Comes in waves for me. Lately I've been losing sleep a lot\nSometimes it's much more mild than a 9-5",
          "score": 1,
          "created_utc": "2026-02-10 23:03:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pc6j2",
          "author": "AnActualBlob",
          "text": "My business is still in pretty early stages, but this is what I've learned so far. I work 7 days a week, but I'll take a few hours or a day off here and there when I need it. It's not really that it's a day-to-day grind, because if you're pushing hard through work that feels terrible, then the work you're creating is probably terrible too.\n\nI think the two big things I've learned about the software businesses are:\n\n1. That it's about education rather than 'hard work'. Building expertise is the part that takes a long time. Once you know how to do something, doing it is trivial, but if you don't know how to do something, no amount of hard work will help you until you do.\n\n2. That the difficult part is like an ultra-marathon, not like a sprint. It's really hard, but not in the sense that you're pushing yourself to the absolute max for a month - more like you have to sustain a good pace for years and not quit, even when some moments are hard. If you sprint, you just burn yourself out, and the whole thing ends up taking longer. Patience is more important than speed.\n\nThe more you can get to be great at what you do through really challenging real-world side projects or realistic experience before starting a business, the better. I probably should have done more of that before starting my business, but I guess learning the hard way is better than not learning at all.",
          "score": 1,
          "created_utc": "2026-02-10 23:04:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q0kh8",
          "author": "Diligent-Economy-801",
          "text": "Thee have been times when I was in the building phase of my SaaS app, although I have been an investment banker and created something for founders that help in decision making. I was sometimes going 29 hours straight in the chair with only natural breaks. I don’t even drink coffee. I did smoke shit loads of cigs though only to flare up my injuries. So if your limit is 24 hours and you’re passionate, I think you might have to drop the watch/clock here. \n\nIf you’re a solo founder with negligible marketing budget, you build, you ship, you distribute, you get on sales call, you do everything an enterprise does. Hence an Entrepreneur.",
          "score": 1,
          "created_utc": "2026-02-11 01:23:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q6sc1",
          "author": "lgjr87",
          "text": "Yes. Ran one with my dad 18yrs. If you really believe in your business you enter into a flow state. Next thing you know another 12-13 hours have passed. You get home and can’t sleep because your mind is already thinking on what the next day will bring/to do list/ project/ problem/ etc. Somtimes you will want to quit and ask yourself what are you doing. I enjoyed it but lost a lot of time with my family. I don’t think I can go back to a regular job.",
          "score": 1,
          "created_utc": "2026-02-11 02:01:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q8get",
          "author": "mrmalort69",
          "text": "I’m in year 3 now, just finished year two. Year one was both nuts and quiet at the same time. There was the original concern and rush to get out there, meet with everyone, and constantly learning new shit I needed to do. Year two I was able to hire a bookkeeping service which cut out 4 days of busywork a month. Every Friday was my catch up on books day and a bookkeeper could do it in a tenth that time, so hiring out was amazing. I also brought on a partner who needed support all the time at first, so that was a lot. I also was always bumpy on cash flow. It was stressful going from having 50K in the business checking to needing to hold off on paying ourselves because of cash flow. High growth does that. \n\nSince October though, I’ve really slowed down my sales grind and things keep coming my way, I have a reoccurring revenue so I’m really set so long as I don’t start suddenly losing business, and if I keep adding, I need to hire soon. I’m paying myself around 200K, so that’s nice, and my business checking has been in the lower 6 figures all year. \n\nI honestly thought it would take at least another 1-2 years to get to this point, definitely was not expecting by end of year 1 to be stable, end of year two to be making more, and looking ahead, I may need to hire this year.",
          "score": 1,
          "created_utc": "2026-02-11 02:11:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4r41b0",
              "author": "PickleRickle_1839",
              "text": "Great answer. Do you mind if I ask what sector you work?",
              "score": 1,
              "created_utc": "2026-02-11 05:44:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4too1x",
                  "author": "mrmalort69",
                  "text": "Industrial water treatment - super niche field of hvac preventative maintenance",
                  "score": 1,
                  "created_utc": "2026-02-11 16:36:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4qiqhi",
          "author": "Shama_lala",
          "text": "When I launched my startup, I fell for the hustle myth. I worked 80hour weeks, fueled by caffeine and panic, convinced every hour spent was a step closer to success. Fast forward a couple of years, and I burned out hard. Now, I keep it to about 30 hours a week. I prioritize efficiency over sheer time commitment. I built systems that let my business run while I sleep. My workload has dropped as I learned to delegate and automate. A healthy work-life balance? It’s knowing my worth doesn’t come from grinding. It comes from creating value, for both my customers and myself. So, let’s ditch the grind culture, success isn’t a badge of honor, it’s harmony.",
          "score": 1,
          "created_utc": "2026-02-11 03:13:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qolsj",
          "author": "modelwish",
          "text": "I think it’s easy to work “24/7” because if you don’t have another job, you’ll feel guilty doing anything that’s not working towards building the business. But burn out is real, by the time I finally launched a product I was too burnt out to properly sell it that’s a whole other beast that requires energy and perseverance. Respect your body and mind. The most successful entrepreneurs I know work hard, but they don’t work 24/7.",
          "score": 1,
          "created_utc": "2026-02-11 03:51:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4r1h9r",
          "author": "Maroontan",
          "text": "Yeah, I absolutely do work 24/7! Like, I wish it was a joke. I've made negative money so far. ",
          "score": 1,
          "created_utc": "2026-02-11 05:24:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rmpmc",
          "author": "PNW_Uncle_Iroh",
          "text": "Your business will take whatever you’re willing to give it. If you’re young and don’t have a family it’s wise to work long and hard to build a solid foundation. If you have a family, it’s important to set boundaries and learn to delegate through effective managers. Think of it as a marathon with occasional sprints thrown in.",
          "score": 1,
          "created_utc": "2026-02-11 08:31:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rqakd",
          "author": "Miserable_Rice3866",
          "text": "The 24/7 grind is overrated.\n\nIn the early stage, it can feel nonstop. But long term, if you’re still working all the time, it’s usually a systems issue.\n\nThe goal is to build something that doesn’t depend on you every hour of the day.",
          "score": 1,
          "created_utc": "2026-02-11 09:05:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rzej4",
          "author": "Land_of_smiles",
          "text": "More like 16-18/7",
          "score": 1,
          "created_utc": "2026-02-11 10:30:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4s7q3v",
          "author": "giadanicole",
          "text": "The burnout ones who walk away suddenly usually do work around the clock.\n\nThe ones who build up towards a healthy exit usually don’t.\n\nHours and free time will look different for everyone but what matters is how you feel and it sounds line you are feeling trapped?",
          "score": 1,
          "created_utc": "2026-02-11 11:42:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4s7tkj",
          "author": "indexintuition",
          "text": "i really hope it doesn’t mean 24/7, because i genuinely don’t have that in me. i’m a mom of two and i build my little online business in pockets of time. some weeks i probably do 10–15 focused hours, other weeks it’s way less. early on it felt heavier because everything was new and i overcomplicated it. now i care way more about simple systems and deciding what actually moves the needle. for me, “healthy” looks like being able to close my laptop at night and not feel resentful. i don’t want a business that replaces a boss with burnout. i think working smart is less about hacks and more about designing something that fits your actual life, not the other way around.",
          "score": 1,
          "created_utc": "2026-02-11 11:42:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4tqtq0",
              "author": "OverwatchMedia",
              "text": "24/7 would be impossible for almost all entrepreneurs. Depending in the day and business, its possible to work 24+ hours. But to literally work 24 hours for a whole week would be a rediculous idea and you would be very ineffective if you could succefully keep yourself up that long. Depending on the business, long hours can be expected. As others have said here, part of that is sometimes lack of control though. Not setting a closing time for the business, or setting up processes to limit the amount of calls if you did want the business open 24 hours. But at that rate, clients should be paying a higher subscription to get you available 24 hours, at which point with the extra cash you could hire someone else to answer the phones and do smaller tasks for clients when they can",
              "score": 1,
              "created_utc": "2026-02-11 16:46:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4sptw6",
          "author": "Ill_Control_4478",
          "text": "Yes everytime you hace to think about it",
          "score": 1,
          "created_utc": "2026-02-11 13:41:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4t0bfv",
          "author": "LeverageBlueprint",
          "text": "In the beginning, it often does feel close to 24/7, mostly because you’re building clarity, not just product.\n\nBut long term, nonstop hustle is usually a sign that systems haven’t been built yet.\n\nThe goal (at least in my experience) is to work intensely on designing leverage, so the business doesn’t require constant effort to survive.\n\nIf you’re still needed everywhere after a few years, something structural is probably off.",
          "score": 1,
          "created_utc": "2026-02-11 14:38:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tfkbm",
          "author": "HarjjotSinghh",
          "text": "that's the whole point of outsource?",
          "score": 1,
          "created_utc": "2026-02-11 15:53:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4trm9m",
              "author": "LeverageBlueprint",
              "text": "Totally agree. Outsourcing works best when there are clear systems, documented SOPs, defined roles, and one person accountable for making sure everything actually gets done.\n\nWithout structure, you’re just delegating chaos. With the right setup and a solid team, though, it becomes real leverage.",
              "score": 1,
              "created_utc": "2026-02-11 16:49:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4vyj0m",
          "author": "Icy-Pen3656",
          "text": "Yeah, I think what a lot of entrepreneurs mean when they say 24/7 isn’t that they’re literally at their desk every minute, it’s that the business never fully gets out of your head.  \n  \nThat said, nonstop grinding isn’t sustainable long term. In my experience, the only way it becomes manageable is when you start building systems or bringing in help. Otherwise it just keeps depending entirely on you.",
          "score": 1,
          "created_utc": "2026-02-11 23:08:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yevtb",
          "author": "mwitiderrick",
          "text": "i thinks sometimes you have work all the time to get some stuff done, but then after that take a break, like working in cycles ",
          "score": 1,
          "created_utc": "2026-02-12 09:47:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50o1yd",
          "author": "ElectronicBorder3100",
          "text": "You work when there's work. So I'd say all day. Especially if you're a start up",
          "score": 1,
          "created_utc": "2026-02-12 17:50:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53ot7k",
          "author": "Quiet_Historian_507",
          "text": "In the beginning yes.\n\nTo get remarkable results you need to put in remarkable work",
          "score": 1,
          "created_utc": "2026-02-13 03:24:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mg1pw",
          "author": "whooyeah",
          "text": "No 25/8 is more like it.",
          "score": 1,
          "created_utc": "2026-02-10 14:53:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rs509",
          "author": "NukeouT",
          "text": "I check my app for dick picks first thing in the morning, at noon and last thing before bed every day\n\nSo yeah 👍",
          "score": 0,
          "created_utc": "2026-02-11 09:23:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r03t4n",
      "title": "What's the best site to buy website traffic right now? Looking for suggestions",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r03t4n/whats_the_best_site_to_buy_website_traffic_right/",
      "author": "One_Perspective971",
      "created_utc": "2026-02-09 13:10:12",
      "score": 45,
      "num_comments": 30,
      "upvote_ratio": 0.77,
      "text": "\n\nHello guys,\n\nI’m looking for a reliable site to buy website traffic that actually works. I really don’t want fake clicks or bots that bounce immediately, so I want real website traffic. I’m hoping to find something that sends visitors who look natural, browse my website, and show up properly in analytics, since that is important for getting approved by ad networks.\n\nIt also matters to me that I can buy traffic and have an option to choose visitor locations, and that the traffic arrives gradually instead of flooding in all at once, so it keeps looking realistic. If anyone has tested a site that held up long term without causing penalties or strange ranking drops, I’d really appreciate any recommendations.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1r03t4n/whats_the_best_site_to_buy_website_traffic_right/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4gpbwz",
          "author": "aewolling",
          "text": "Let me tell you a story about a client I worked with last year who was obsessed with buying website traffic to inflate his numbers for a potential investor. He found this expensive vendor that guaranteed residential ips and lengthy session durations which sounded perfect on paper. We watched the real time analytics and sure enough the users were coming in from different cities and scrolling down the pages. But then we looked closer at the heatmaps and realized every single user moved their mouse in the exact same pattern before leaving. The investor pulled out after their tech team audited the logs, and my client lost the deal plus the 5k he spent on the package.",
          "score": 14,
          "created_utc": "2026-02-09 17:16:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ktil9",
              "author": "One_Perspective971",
              "text": "Wow that is crazy, I had no idea they could fake mouse movements like that.",
              "score": 1,
              "created_utc": "2026-02-10 07:28:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4l3eyq",
                  "author": "Vegetable-Feed-9305",
                  "text": "At least they found out before the deal closed I guess. Imagine if the investor sued him later for fraud.",
                  "score": 1,
                  "created_utc": "2026-02-10 09:04:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4fvrjb",
          "author": "Easy-Extension-6917",
          "text": "I have seen so many people try to buy website traffic thinking it is a shortcut to getting approved for ads, but it usually ends in disaster, honestly. You might see the numbers go up in your analytics for a few days and feel good about it, yet the ad networks have very sophisticated ways of spotting patterns that look unnatural. If you care about the long term health of your domain, you should probably stay away from purchasing visitors completely. It is much safer to focus on creating content that people actually search for, because once you get flagged for invalid activity, it is nearly impossible to get your reputation back with the big networks.",
          "score": 13,
          "created_utc": "2026-02-09 14:52:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kjzz1",
              "author": "One_Perspective971",
              "text": "Thanks for the warning man, I really want to avoid getting banned so I will be careful.",
              "score": 1,
              "created_utc": "2026-02-10 06:05:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4kwvc9",
                  "author": "palladinla",
                  "text": "I get what you are saying, but I think there is a difference between cheap bots and high quality paid visits. If you know what you are doing you can use paid campaigns to jumpstart a new site without getting banned, you just have to be careful about the source.",
                  "score": 1,
                  "created_utc": "2026-02-10 08:00:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4g5b9h",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 9,
          "created_utc": "2026-02-09 15:41:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kolq4",
              "author": "One_Perspective971",
              "text": "Damn that sounds terrible, did they give you any refund at all or just ghost you?",
              "score": 1,
              "created_utc": "2026-02-10 06:44:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4kzy7j",
                  "author": "lolfaceftw",
                  "text": "Yep same thing happened to me. They tell you it is safe for adsense, but they do not care once they have your money.",
                  "score": 1,
                  "created_utc": "2026-02-10 08:30:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4k1ozo",
          "author": "Nightcrawler_2000",
          "text": "I have been testing a few different sources for a tier two site I run. Some are definitely trash, but I found that if you throttle the speed it looks much more natural.",
          "score": 10,
          "created_utc": "2026-02-10 03:51:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gxi6m",
          "author": "myjeffreyjefferson",
          "text": "waste of time and money honestly just write better articles or pay for facebook ads if you have the budget for it",
          "score": 8,
          "created_utc": "2026-02-09 17:55:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l5jnj",
              "author": "One_Repeat_1363",
              "text": "Fb ads are getting way too expensive for the average guy starting out though. Sometimes you need a cheaper alternative to get some data flowing.",
              "score": 0,
              "created_utc": "2026-02-10 09:25:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4jnhsj",
          "author": "KumalalaProMax",
          "text": "Has anyone here actually found a vendor that works for more than a week? I feel like there has to be one decent option out there among all the scams.",
          "score": 6,
          "created_utc": "2026-02-10 02:25:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jil2v",
          "author": "Ready_Evidence3859",
          "text": "You need to understand how the backend of these services actually works before you hand over your credit card. They are not magically convincing thousands of people to visit your site for a fraction of a penny, they are using automated scripts running on hijacked devices or cheap cloud servers to load your url in the background. When you look at your server logs, you will notice that these visitors often do not load all the assets like images or javascript files because the bots are programmed to save bandwidth. This is a huge red flag to any ad network algorithm that is monitoring your traffic quality. If you are serious about buying traffic, you need to accept that you are likely paying for numbers that look nice on a dashboard but bring zero actual value or revenue. It is a vanity metric plain and simple, and valid businesses are built on real human engagement.",
          "score": 5,
          "created_utc": "2026-02-10 01:56:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k0axp",
          "author": "polygraph-net",
          "text": "I'm doing a doctorate in bot detection.\n\nWe've tested a bunch of cheap traffic sources and they're entirely bots.\n\nThe only way to get real traffic is through SEO or well configured ad campaigns.",
          "score": 2,
          "created_utc": "2026-02-10 03:43:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mb3i4",
          "author": "Exact-Schedule-2059",
          "text": "Rather spent that money on content writers or marketers and publish stuff on your site or social media that will get real traffic. ",
          "score": 2,
          "created_utc": "2026-02-10 14:27:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jtkv1",
          "author": "Sudden_Breakfast_358",
          "text": "Everyone is terrified of bot traffic but half the internet is bots anyway. If you are just trying to boost your alexa rank or something, who cares if they are real humans.",
          "score": 2,
          "created_utc": "2026-02-10 03:00:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4id5m7",
          "author": "greyzor7",
          "text": "As a rule of thumb, build a cross-channel mix relevant to where your target users/customer (called ICP) is.\n\nTry launching your app on a combo of social media: X/Twitter, Reddit + launch platforms: Product Hunt, Microlaunch.\n\nAnd any channel relevant to your ICP.\n\nRun campaigns, measure all ROIs, then simply double down on what worked.\n\nThen keep doing this until you get users & customers.\n\nFix conversions, channel selection, targeting when necessary.",
          "score": 1,
          "created_utc": "2026-02-09 22:07:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ja6me",
          "author": "TouchingWood",
          "text": "The type of expectations you have and the type of traffic you seem to be experimenting with a huge red flags. Don't do any of that bullshit because it's not real and the people you were purchasing are not real.\n\nIf you want actual traffic, then you're going to need to do a deep dive research in your niche about which website sell relevant visitors through their advertising programs and their email newsletters. Create a big spreadsheet and then compare all of the likely visitor numbers with the costs and see which ones have the lowest CPM then start testing. If you're lucky you will get a discount on the average but you may not it will really depends on how well you do the research..",
          "score": 1,
          "created_utc": "2026-02-10 01:07:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kyz7i",
          "author": "HarjjotSinghh",
          "text": "no ads? just humans w/ no 2nd graders at lunch.",
          "score": 1,
          "created_utc": "2026-02-10 08:20:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l33y1",
          "author": "Vaibhav_codes",
          "text": "Powerful lesson quitting too early can backfire. Building while employed is underrated but safer.",
          "score": 1,
          "created_utc": "2026-02-10 09:01:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4laroj",
          "author": "AskPractical9611",
          "text": "I’d be careful with buying traffic outright. Most platforms optimize for volume, not intent, which is why bounce rates and conversions usually disappoint. If the goal is clean analytics and ad network approval, smaller amounts of high intent traffic from communities or search usually perform way better than bulk traffic buys.",
          "score": 1,
          "created_utc": "2026-02-10 10:15:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4s6dy7",
          "author": "moa999",
          "text": "Good content.. simple stuff",
          "score": 1,
          "created_utc": "2026-02-11 11:31:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4htbrx",
          "author": "Aggravating-Ant-3077",
          "text": "nah man dont do it. bought a bunch of traffic back in the day and it tanked my ad revenue for months. real users come from content/seo or paid ads on actual platforms where they actually wanna be there. anything that sells \"real\" traffic is just bots with better makeup",
          "score": 1,
          "created_utc": "2026-02-09 20:28:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q8v6h",
          "author": "ApoplecticAndroid",
          "text": "So you’re looking for advice on scamming people?  Just go rob a convenience store.",
          "score": 0,
          "created_utc": "2026-02-11 02:13:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k4jer",
          "author": "whizzie",
          "text": "Google Adwords",
          "score": -2,
          "created_utc": "2026-02-10 04:10:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kh7gx",
          "author": "Ambitious-Pirate3620",
          "text": "Check out firstfixseo.com \nIts a seo optimization tool \nLike before giving any hate. Check in please",
          "score": -4,
          "created_utc": "2026-02-10 05:42:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kilc5",
              "author": "One_Perspective971",
              "text": "Thanks.",
              "score": 1,
              "created_utc": "2026-02-10 05:53:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4kiplz",
                  "author": "Ambitious-Pirate3620",
                  "text": "Is it good. ??",
                  "score": 1,
                  "created_utc": "2026-02-10 05:54:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r0ujib",
      "title": "I need generally liability insurance for my trampoline park",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r0ujib/i_need_generally_liability_insurance_for_my/",
      "author": "Minimum_Pear9193",
      "created_utc": "2026-02-10 07:37:54",
      "score": 31,
      "num_comments": 18,
      "upvote_ratio": 0.94,
      "text": "Alright, so I might've made a massive mistake.\n\nDropped $850K on a 12K sq ft entertainment center. Trampolines, ninja warrior course, foam pits - basically everything a lawyer dreams about when they go to sleep at night.\n\nAlright, so I might've made a massive mistake.\n\nDropped $850K on a 12K sq ft entertainment center. Trampolines, ninja warrior course, foam pits - basically everything a lawyer dreams about when they go to sleep at night.\n\nGrand opening is in 6 weeks. Equipment installed. Bookings rolling in.\n\nHere's the problem: I'm 6 weeks from opening a trampoline park and insurance companies are telling me to go f\\*ck myself. How screwed am I?\n\nContacted 15 agents:\n\n8 said \"we don't touch trampolines\" and hung up\n\n4 quoted me $85K-$140K/YEAR (that's 6-10% of revenue)\n\n3 ghosted me harder than my Tinder matches\n\nCalled one more broker today (Alliance Risk - they do entertainment venues) but I'm losing my mind.\n\n**Real talk:**\n\nWhat is an actual **NORMAL** amount for this industry?\n\nDo liability waivers actually mean sh\\*t legally?\n\nDo I really need a massive umbrella policy or is that fear-mongering?\n\nAnyone running trampoline parks: HOW did you solve this?\n\nI've got 6 weeks or this becomes the most expensive storage facility in town.\n\nPlease tell me someone survived this hell.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1r0ujib/i_need_generally_liability_insurance_for_my/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4l47xn",
          "author": "subjective-line",
          "text": "I don't think you made a unique mistake. What you’re running into is not pricing, it’s market refusal. I do have some third party experience of this (and was nosy enough to ask how they sorted it) so hope it helps.\n\nTrampoline parks sit in a small, specialist insurance category. Most retail agents literally cannot place the risk, so they either say no immediately or throw out a defensive quote hoping you go away. That’s why the numbers feel insane.\n\nAt this point, stop calling general insurance agents.\n\nYou want brokers who already place cover for high risk leisure venues. Trampoline parks, indoor climbing, zip lines, karting, adventure parks. When you speak to them, don’t frame the conversation as “can you insure my trampoline park?”. Instead, position it as “we are opening an indoor leisure venue, equipment installed, safety systems documented, waivers in place, and we are finalising our insurer”. That signals legitimacy and that you’re already past the idea stage.\n\nOn your questions, yes, £70K plus a year is unfortunately not unusual in year one for trampoline parks. It often comes down once you’ve operated safely for a period of time. Waivers help, but they don’t replace proper liability insurance. Extra cover on top of your main policy is common in this industry, but it should be there to protect against worst-case scenarios, not sold to you out of fear.\n\nThe fastest unlock is finding a broker who already has trampoline parks on their books. Ask them directly how many similar venues they insure. If the answer is zero, move on.\n\nA quick AI search gave me:\n\n* **RPS (Risk Placement Services)** Large wholesale broker with a dedicated entertainment and leisure practice. Many retail agents place trampoline risks through them.\n* **AmWINS** One of the biggest specialty wholesalers in the US. They regularly place coverage for indoor amusement, family entertainment centres, and extreme sports.\n* **CRC Group** Another major wholesale broker that places difficult liability risks, including trampoline parks and adventure venues\n\nHope that steadies things a bit, and good luck with the venture",
          "score": 94,
          "created_utc": "2026-02-10 09:12:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4mkezo",
              "author": "foxinHI",
              "text": "Hero comment, right here.",
              "score": 16,
              "created_utc": "2026-02-10 15:15:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lq9c2",
          "author": "OneConscious122",
          "text": "Trampoline park owner here (3 years in).\n\nBad news: $85K-$140K is normal. We're paying $92K for similar square footage. It's just a high-risk business.\n\nWe went through Alliance Risk, they specialize in entertainment venues and actually understood what we needed. Got a $5M umbrella on top of the primary policy.\n\n**Real talk:** Waivers help but don't eliminate liability. You also need rock-solid staff training and detailed incident logs or carriers won't even touch you.\n\nIt's expensive as hell but one serious injury lawsuit would cost way more than a year of premiums.",
          "score": 43,
          "created_utc": "2026-02-10 12:24:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lu9lb",
              "author": "buckster_007",
              "text": "I’m curious about this, what is your retention amount?  At what number does insurance kick in?  Could that be adjusted accordingly?  For instance, could you self ensure up to 500k, then have insurance kick in? In the meantime, you continue paying $92,000 a year but instead of $92,000 a year going to cover everything $50,000 a year goes to the catastrophic loss coverage and 42,000 a year goes into a separate account for settlements?\n\nI realize it’s probably naïve, but I have no background in this area.",
              "score": 7,
              "created_utc": "2026-02-10 12:51:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4l2mmn",
          "author": "LouQuacious",
          "text": "Ask Camp Woodward how they do it. Or just go commando and plan to declare bankruptcy and skip the country should anyone sue. ",
          "score": 6,
          "created_utc": "2026-02-10 08:56:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m72yr",
          "author": "CoffeeTable105",
          "text": "This is actually comical. Who TF drops $850K on a building/trampoline park without first doing research on arguably the most critical aspect deterring people from getting into said business, liability insurance? 🙄",
          "score": 22,
          "created_utc": "2026-02-10 14:05:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m82td",
              "author": "Jrmcgarry",
              "text": "The same kinda person who copies and pastes twice, so the first two paragraphs are repeated lol.",
              "score": 27,
              "created_utc": "2026-02-10 14:11:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lp5te",
          "author": "jstyles2000",
          "text": "If you have 4 quotes in a narrow... But very high... range - I think you just got your answer.   You said it - a lawyers dream, so what do you expect? If you thought this wasn't going to be at least a mid 5 digit number, that's unrealistic. \n\nPerhaps have a conversation with one about specifically how to make it come down.   Age restrictions on certain equipment, strong waivers, what about if no claims in a year or two.\n\nTry to find an owner of a similar place in state but far enough away that they aren't competition. You're only looking for a referral to their insurance agent, which might be very valuable for their relationship.",
          "score": 4,
          "created_utc": "2026-02-10 12:16:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mf192",
          "author": "MichaelUramMFT",
          "text": "I would look up how Skyzone does it. It doesn’t sound ethical, but they seem to be the only company that is still around in Socal after kids get injured at these places. They have a non disclosure agreement and arbitration agreement in addition to insurance.",
          "score": 4,
          "created_utc": "2026-02-10 14:48:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mx8af",
          "author": "BobSacramanto",
          "text": "I would call a few parks in a different state and just ask them who they use.",
          "score": 3,
          "created_utc": "2026-02-10 16:16:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ozv6r",
          "author": "BirdLawMD",
          "text": "Damn! My axe throwing business was under $6K/YR\n\nHere’s my old broker that was great: bpollak@axethrowinginsurance.com",
          "score": 3,
          "created_utc": "2026-02-10 22:01:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4np38j",
          "author": "Dry_Community5749",
          "text": "What do you mean you dropped 850K? You had all in cash or got a loan? If you got a loan, none of them required you to check insurance frost?",
          "score": 2,
          "created_utc": "2026-02-10 18:24:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mh8nn",
          "author": "OreoSoupIsBest",
          "text": "I’m honestly shocked you’d put close to a million dollars into a business like this without locking down insurance first. In high-risk operations like trampoline parks, insurance isn’t a box you check at the end, it’s the thing that determines whether the business is even viable. If you can’t get coverage at a price the numbers can support, the rest of the plan doesn’t really matter.\n\nThat said, the $85k–$140k quotes you’re getting unfortunately aren’t out of line, especially in year one. Trampolines, ninja courses, and kids are about as bad as it gets from an underwriting standpoint. I pay close to that just for liquor liability in one state with aggressive liability laws, and this risk profile scares carriers even more. Early on, 6–10% of gross going to insurance is very real in this space.\n\nAs for waivers, they do help, but nowhere near what people think. They don’t stop lawsuits, they don’t protect you from gross negligence claims, and they’re much weaker when minors are involved. Insurers know all of this, which is why premiums stay high even if your waiver language is solid.\n\nAt this point the question isn’t how you get cheaper insurance, it’s whether this business can survive its actual risk profile. If you can’t stomach year-one insurance costs at this level, there’s a real chance the model doesn’t work the way you think it does. Your only realistic path forward is a specialty broker and surviving long enough to build clean loss history. Otherwise this turns into a very expensive lesson.",
          "score": 4,
          "created_utc": "2026-02-10 14:59:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kuvau",
          "author": "Foreign_Artichoke_23",
          "text": "I have wondered this when I took my kids to one of these places.\n\nI don’t know the answer to the question and wish you the best of luck.",
          "score": 2,
          "created_utc": "2026-02-10 07:41:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m0062",
          "author": "drteq",
          "text": "How screwed you are is simply based on how viable the business is and how deep your pockets are.  $100k a year is a big surprise for a new business, if the numbers don’t work you already know what to do.  Look at the numbers and don’t fall for the sunk cost fallacy.",
          "score": 1,
          "created_utc": "2026-02-10 13:26:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4msc12",
          "author": "Few_Response_7028",
          "text": "I work in the legal industry and people still sue with waivers. You will need insurance sadly. I’ve seen trampoline park cases before and they always try to put blame on the park saying that they created an unsafe condition, but it’s always just the user just doing something dumb",
          "score": 1,
          "created_utc": "2026-02-10 15:53:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qcyxf",
          "author": "Apollo_K86",
          "text": "You’re a new operator with zero experience in the industry. \n\nYou are getting appropriate premiums for the risk. \n\nIf the underwriter reviewing your apps saw your post they would nope out so hard.\n\nYou’re lucky you are getting anything.\n\nSuck it up, and pay it. Update us with your Umbrella premium when you get those quotes lol. \n\nBtw for most companies industries, insurance is a top 3 expense, if not the largest expense line item. \n\nPs I got stitches from a trampoline when I was a kid and have over 10 years selling and underwriting commercial insurance. Never wrote a trampoline park. Maybe K&K Insurance, they insure weird shit like entertainment venues.",
          "score": 1,
          "created_utc": "2026-02-11 02:38:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tbwxy",
          "author": "HarjjotSinghh",
          "text": "this sounds like a dream until you sue and file all those forms",
          "score": 1,
          "created_utc": "2026-02-11 15:36:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyco98",
      "title": "We really are living in a strange golden age of technology",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qyco98/we_really_are_living_in_a_strange_golden_age_of/",
      "author": "AgentHomey",
      "created_utc": "2026-02-07 12:34:05",
      "score": 25,
      "num_comments": 9,
      "upvote_ratio": 0.85,
      "text": "I’m an indie dev and one of my small side projects (simple calorie + habit tracking mobile app) just crossed $850 MRR. That number isn’t impressive by startup-Twitter standards, but it covers my devops costs, AI tools, and about half of my car payment. More importantly, it’s stable and still growing month over month.   \n  \nWhat surprised me most is that none of this came from TikTok hype, Instagram reels, or viral launches. No big audience. No “growth hacks.” Just a boring combination of shipping consistently, fixing UX friction, listening to user complaints, and iterating for months.  \n  \nPeople keep saying the app market is dead, SaaS is saturated, hardware is impossible, etc. From what I’m seeing, that’s mostly noise. Revenue still compounds if you keep improving something real. Whether you’re building a mobile app, a SaaS, or even a physical product: if users are getting value and you keep showing up, the curve eventually bends upward. It’s not glamorous, but it works.\n\nI’m still iterating on my app daily, and I expect it to keep growing and not because of hype, but because people actually use it.\n\n**If you’re in a slump right now: don’t stop. This is probably the best time in history to keep building.**",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qyco98/we_really_are_living_in_a_strange_golden_age_of/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o42nln0",
          "author": "Unique-Painting-9364",
          "text": "This is super motivating. $850 MRR from boring, consistent execution is way more impressive than viral one offs. Proof that real value and patience still wins.",
          "score": 6,
          "created_utc": "2026-02-07 13:03:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42l5ad",
          "author": "Hot-Chemist1784",
          "text": "sounds like you’ve nailed the real secret: steady work > flashy hype.  \n  \nkeep building stuff people actually want, the growth will follow..",
          "score": 3,
          "created_utc": "2026-02-07 12:46:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o456jvj",
          "author": "that-dude_mike",
          "text": "Thanks for the encouragement!",
          "score": 2,
          "created_utc": "2026-02-07 20:59:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47v83x",
          "author": "WillingnessMedium404",
          "text": "Interesting! Curious to know how did you get your first few customers and scaled to $850 MRR without performance marketing/ social media?",
          "score": 1,
          "created_utc": "2026-02-08 07:40:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o49u8yi",
              "author": "Unhappy-Bunch-4594",
              "text": "not OP but scaled a vertical saas similarly:\n\nthe counterintuitive thing is that \"no marketing\" doesn't mean \"no distribution.\" it just means the distribution is organic and compounding.\n\nwhat worked for us: being genuinely helpful in the communities where our target customers already hang out. not \"here's my product\" posts -- just answering questions, sharing experience, being a known name. over months, people start recognizing you, checking your profile, and discovering what you've built.\n\nthe key metric nobody talks about: time-to-first-dollar matters way less than the trajectory of your month 3 vs month 6. if you're growing 15-20% month-over-month purely from organic word of mouth, that $850 compounds to $5K+ MRR within a year without spending a dime on ads.\n\nboring works. the founders who chase viral launches usually peak on day 1 and decline. the ones who show up every day compound.",
              "score": 2,
              "created_utc": "2026-02-08 16:20:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4anvya",
                  "author": "WillingnessMedium404",
                  "text": "Pretty insightful! Thanks for sharing this. When you say ‘communities’ in your experience, which social platform/ tool has been most effective to reach your target audience?",
                  "score": 1,
                  "created_utc": "2026-02-08 18:41:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4dfj81",
          "author": "HarjjotSinghh",
          "text": "i finally built something useful instead of memes.",
          "score": 1,
          "created_utc": "2026-02-09 03:27:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5059kl",
          "author": "Local_Pack_2105",
          "text": "The stability is the real signal here. When growth comes from incremental improvement instead of launch spikes, it tends to be far more durable.",
          "score": 1,
          "created_utc": "2026-02-12 16:22:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0biae",
      "title": "$10K MRR solo feels better than $2M seed and stress",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r0biae/10k_mrr_solo_feels_better_than_2m_seed_and_stress/",
      "author": "whyismail",
      "created_utc": "2026-02-09 18:04:55",
      "score": 18,
      "num_comments": 12,
      "upvote_ratio": 0.8,
      "text": "I’m a founder of a SaaS company, which I built solo, bootstrapped, no investors. It helps founders grow their personal brand on X & LinkedIn and drive inbound. Simple tool, solves a real problem and makes money from day one.\n\nAnd honestly, the more I build, the more I believe micro SaaS > venture-backed startups. I’ve seen too many stories like \"raised $700K pre-seed → burned through it → now stressed out trying to raise again.\" Meanwhile, I just fix bugs, ship small features, talk to customers and grow at my own pace.\n\nWith micro SaaS, you can get to $5K–$20K MRR with high margins, no pressure and total control over your time. You don’t need a team of 20 or a slide deck for every decision. Just a useful product, a few customers who pay and a feedback loop that actually works.\n\nWould love to hear from others building solo or small- how’s it going for you? And if you’re still debating startup vs micro SaaS, happy to share more behind the scenes if helpful",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1r0biae/10k_mrr_solo_feels_better_than_2m_seed_and_stress/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4ivwyp",
          "author": "SpadoCochi",
          "text": "My first company was with YC and I've bootstrapped or private funded ever since.",
          "score": 3,
          "created_utc": "2026-02-09 23:46:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4h3foc",
          "author": "Key-Boat-7519",
          "text": "Micro SaaS > venture-backed is the main unlock here, and you’re living the upside of it.\n\nI went through the “raised a chunk, hired too fast, now every decision is about runway” cycle once. The weird thing is you stop solving user problems and start solving investor anxiety. It’s wild how much sharper your thinking gets when the only metric that matters is: do customers keep paying and telling you what to fix next?\n\nOne thing that helped me was treating my micro SaaS like a portfolio asset, not my entire identity: keep it lean, build slow moats (distribution, relationships, workflow depth), and avoid any feature that adds support burden without lifting ARPU or retention.\n\nFor finding those customers, I lean on Hypefury and Taplio for X/LinkedIn, then Pulse for Reddit in the background to catch people describing the exact pain in real time. Micro SaaS wins when your stress is capped, your calendar is light, and the scoreboard is just recurring revenue and happy users.",
          "score": 4,
          "created_utc": "2026-02-09 18:23:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4vpl3f",
              "author": "Competitive-Arm-7846",
              "text": "I learned something new from you and I thank you.",
              "score": 1,
              "created_utc": "2026-02-11 22:22:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4h5tbk",
          "author": "Just-Personality-304",
          "text": "1000%",
          "score": 1,
          "created_utc": "2026-02-09 18:34:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ip4v4",
          "author": "Ecaglar",
          "text": "this. the venture path turns you into a professional fundraiser instead of a professional problem solver. $10k mrr with 80% margins beats $50k mrr at -40% every time",
          "score": 1,
          "created_utc": "2026-02-09 23:09:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kn5me",
          "author": "Environmental_Two581",
          "text": "Good job that’s always the best approach then you can decide to scale. Silicon Valley is about raising money not necessarily being profitable they chase the unicorn and that’s fine if that’s your dream but owning and controlling 100% and staying lean with huge margins is great wish you the best",
          "score": 1,
          "created_utc": "2026-02-10 06:31:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lyg9i",
          "author": "Annual_Mall_8990",
          "text": "Solo building here too. The freedom to move slow, talk to users, and not justify every move to investors is honestly the best part.",
          "score": 1,
          "created_utc": "2026-02-10 13:17:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q4hmm",
          "author": "ChanceArcher4485",
          "text": "But what if you got 1M no strings attached other than equity. You just have a war chest and everything can operationally be the same",
          "score": 1,
          "created_utc": "2026-02-11 01:47:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4h0gz8",
          "author": "Open_Bug_4196",
          "text": "I agree and I’m happy to hear about your success and fulfilment with it. What pricing do you offer to your customers? It would be also interesting to hear more about you acquired those initial customers and grew your business!",
          "score": 0,
          "created_utc": "2026-02-09 18:09:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4h1fbv",
              "author": "whyismail",
              "text": "my saas is Brandled : it's basically a simple tool that helps founders grow on X & linkedin and drive inbound.\n\nHonestly I am a tech guy so I didn't had any marketing experience\n\nAnd for the first few months I was stuck at 0\n\nBut slowly i started figuring out marketing:\n\nI was documenting my journey on X & LinkedIn everyday\n\nSending personalized cold dms and emails\n\nWriting valuable reddit posts and then subtly mentioning my product\n\n  \nThese are the things that allowed me to scale from 0",
              "score": 0,
              "created_utc": "2026-02-09 18:13:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4h4wdg",
                  "author": "Wide_Brief3025",
                  "text": "Building in public and engaging on social really does wonders for early SaaS growth. If you want to track new leads or relevant conversations across platforms in real time, tools like ParseStream can save tons of time by alerting you the moment your keywords pop up. Makes it a lot easier to jump in on opportunities as they happen.",
                  "score": -1,
                  "created_utc": "2026-02-09 18:30:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r0uc8o",
      "title": "If you run a marketing agency and are worried about losing your agency to AI, Don't!!!",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r0uc8o/if_you_run_a_marketing_agency_and_are_worried/",
      "author": "Far-Panic3458",
      "created_utc": "2026-02-10 07:25:09",
      "score": 16,
      "num_comments": 3,
      "upvote_ratio": 0.65,
      "text": "I have been running my own marketing agency for quite a few years now and have been interacting with various clients. From startups to corporations, I have done marketing for them all. And I can hardly recall using the same strategy for more than 2 clients. Each one has their own flair, their own style or a “human touch” as i like to say that makes their marketing unique. Sure there are now tools like Blobr AI, LocalQ or Ryze AI that can automate reports but to say that they can replace our work is downplaying our role, undermining our experiences. How does AI train itself? By regurgitating information that humans have already done in the past. Hypothetically, if humans were to be replaced, there would come a point where AI wouldn’t be able to offer any sort of new or beneficial suggestions. And who would come to its aid then? So, the next time anyone says that marketing is going to be majorly automated, do enlighten them :)",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1r0uc8o/if_you_run_a_marketing_agency_and_are_worried/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4lejwi",
          "author": "CleanOpsGuide",
          "text": "AI automates tasks. It doesn’t own results. Agencies that tie themselves to outcomes instead of deliverables will be fine.",
          "score": 2,
          "created_utc": "2026-02-10 10:50:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l82lj",
          "author": "HarjjotSinghh",
          "text": "ai writes bland copy - yours always sounds like you really care",
          "score": 1,
          "created_utc": "2026-02-10 09:50:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4muplh",
          "author": "kmm290859",
          "text": "\bYou're right\b AI is just a tool. The more skilled marketing you are the better results you'll get from the tool.",
          "score": 1,
          "created_utc": "2026-02-10 16:04:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r03jzr",
      "title": "what make you say: it was a productive day?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r03jzr/what_make_you_say_it_was_a_productive_day/",
      "author": "Vision--SuperAI",
      "created_utc": "2026-02-09 12:59:21",
      "score": 16,
      "num_comments": 27,
      "upvote_ratio": 1.0,
      "text": "going full time indie, each day i spend around 12-13 hrs with my laptop. i write down, top main tasks of the day and mostly completes them. but when i look back each day, it feels to me like, i've written only single blog today, i've sent only bunch of emails, i've made only couple of promotional comments on reddit.\n\ni don't feel much productive, it feels i've been wasting time, i'm building a fashion photoshoot tool and currently my revenue is around $250(from 5 customers) launched around 6 months ago, relying mostly on reddit comments with SEO in long term.\n\nso, my question is: how do you decide between a bad day and a productive day??",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1r03jzr/what_make_you_say_it_was_a_productive_day/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4frl55",
          "author": "Pretty_Concert6932",
          "text": "For me a productive day isn’t about volume it’s whether I moved the needle. If the tasks I did directly pushed the product, learning or distribution forward, I count it even if it looks small. Indie work compounds quietly.",
          "score": 6,
          "created_utc": "2026-02-09 14:29:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gajcw",
          "author": "PrettyRadio2073",
          "text": "First of all, congratulations on the $250 revenue and those 5 real customers. In the first 6 months, that’s not a failure; it’s a signal. However, I’ve seen this '12-hour laptop trap' **hundreds of times in my 15 years as a mentor**. You are currently in what I call the **'Circle of Busyness'**: where you mistake movement for progress.\n\nIn my book, **'Startup Inferno'**, I explain that a productive day isn't defined by how many emails you sent, but by how much you reduced the 'structural friction' of your business.\n\nHere is my advice to change your mindset:\n\n1. **Focus on 'Leverage' tasks:** Writing a blog post is fine, but did it improve your conversion rate? Sending emails is okay, but did it shorten your sales cycle? A productive day is one where you build a 'brick' that stays there forever, not just one where you 'tread water'.\n2. **Stop the 12-hour madness:** After 35 years in global strategy and startups, I can tell you: nobody is truly strategic after the 8th hour of staring at a screen. You are likely building a **'Frankenstein Startup',** adding features or content out of anxiety rather than clear vision.\n3. **The 1-Metric Rule:** Define a productive day by one single metric. For you, it might be: 'Did I talk to one fashion photographer today to understand why they haven't paid yet?' That one call is worth 10 blog posts.\n\nA productive day is when you are closer to a scalable system, not just when you are tired. How many of those 12 hours are spent actually talking to potential users vs. just 'polishing' your tool?",
          "score": 6,
          "created_utc": "2026-02-09 16:06:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hqe76",
              "author": "ymbstudios",
              "text": "The second piece of advice is so real lol",
              "score": 1,
              "created_utc": "2026-02-09 20:14:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4fe9w3",
          "author": "AffectionateDiver884",
          "text": "I’m about 10 months into my entrepreneurial journey, and I measure my days a little differently now.\nIf I show up, complete the tasks I planned, and stay disciplined and consistent, I consider it a productive day.\n\nAt the end of each week, I reflect on whether I’ve actually moved forward. If I have, I give myself a small pat on the back. I also review my progress monthly to stay aligned and keep improving.",
          "score": 2,
          "created_utc": "2026-02-09 13:11:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fz5z7",
              "author": "Vision--SuperAI",
              "text": "i'll start analyzing weekly/monthly goals. ",
              "score": 1,
              "created_utc": "2026-02-09 15:10:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4htvaf",
          "author": "Aggravating-Ant-3077",
          "text": "bro $250 from 5 customers is literally product-market fit screaming at you - you're just looking at the wrong metrics. when i had like 12 users paying $20/mo i thought i was failing too until i realized they stuck around for 6+ months. that's when i knew retention was gold.\n\nstop counting blog posts start counting how many users you talk to daily. even 3 convos where you learn why they pay you is more valuable than 10 blog posts nobody reads. your revenue per customer is $50 which is solid for indie - just need more of them.\n\ni track \"days where i moved the needle\" instead of checking off tasks. moved needle = shipped something users will actually see or had a convo that'll lead to revenue. everything else is just busywork.",
          "score": 2,
          "created_utc": "2026-02-09 20:31:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l502b",
              "author": "Vision--SuperAI",
              "text": "yeah, avg revenue is $50(one is on $99 plan), no cancellations yet. i'm trying to invite users for call, but not hearing much. ",
              "score": 1,
              "created_utc": "2026-02-10 09:19:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4j83lb",
          "author": "sophia_where_are_you",
          "text": "I have run an agency for 4+ years and I have a SaaS product too (5K MRR), every day I write down the 3-5 things that NEED to be done for each company to hit the monthly, broken into weekly, goals. \n\nAnd I have a full complete social life I’m excited to get to! I usually still work long hours (2 jobs is no joke), but do your work and go live life. Don’t stay holed up on your laptop. \n\nI find 80% of my  best mental breakthroughs reading a book or doing no-work.",
          "score": 2,
          "created_utc": "2026-02-10 00:55:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fwmnz",
          "author": "afterframestudio",
          "text": "That sounds healthy. What’s your process for the monthly review?",
          "score": 1,
          "created_utc": "2026-02-09 14:57:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4g0acl",
              "author": "Vision--SuperAI",
              "text": "pushing a quality blog each day. reddit is the place from where i got initial customers, but i always fail to be active on reddit and engage in relevant communities. targeting MRR $500 this month, seems highly impossible rn. ",
              "score": 2,
              "created_utc": "2026-02-09 15:16:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4is6ev",
                  "author": "afterframestudio",
                  "text": "How did you got your initial customer on Reddit?",
                  "score": 1,
                  "created_utc": "2026-02-09 23:25:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4g4dj2",
          "author": "FatherOften",
          "text": "I've followed the power list that was created by Andy Frisella/MFCEO Project for 10 years mow as Ive built my business.\n\nIf you go to his website, he's got a post on it.And he's also got an audio, and one of the episodes.\n\nI use a spiral bound notebook. Every night I write down five action items that i'm going to do tomorrow.\n\nSometimes they're all business. Sometimes it's self or marriage or family and business.\n\nIt's stuff that's gonna move the needle, and one of those areas to get me closer to my goals. Action items.\n\nWhen I finished my five things i'm done for the day. I can go rock climbing or play with my children or do whatever I could even keep working.\n\nI write a w for win or l for loss at the top of my list, every day.\n\nIf you win enough days, you win your weeks. If you win enough weeks you win your months.If you win enough months, you win your years, you win enough years, you win your decades.\n\nIn the beginning, I tried to write ten or fifteen things.Because you feel like you can do more.But just do five.\n\nI think you're always gonna end your day wondering if you could have done more. Because that's just the drive of an entrepreneur or anyone that's going to be successful in anything they do.\n\nGrowth in any area takes years or decades. You wouldn't go to a gym and try to lift ten thousand pounds every day to get stronger faster. It takes time. You can't starve yourself for a week and hope to lose weight healthily.\n\nTime does the heavy lifting if you allow it.\n\nIf you're feeling money pressure for your personal overhead and the business is not meeting it.Then, you need to work a job or do some kind of side earning. Don't put that stressor metric on your business or yourself. Production pivot and fix it.",
          "score": 1,
          "created_utc": "2026-02-09 15:36:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gg015",
          "author": "Sima228",
          "text": "For me, a “productive day” is not about the hours or the number of tasks, but whether I removed one bottleneck.",
          "score": 1,
          "created_utc": "2026-02-09 16:32:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gmy48",
          "author": "Spirited_Manager_831",
          "text": "When I started to use a to-do list and a calendar, I thought I was being productive if I filled every checkbox. But sometimes I did mediocre work just to get it done. That’s not the goal either, I later understood.\n\nWhat I understand now? If I advanced my main goal of the day, my top priorities, no matter what, it was a productive day. I don’t have to be doing every checkbox, just the one that really matters. And on the days I don’t advance on my top goals as I wish, I think: not every day I can be 100%, but I showed up and did my best.",
          "score": 1,
          "created_utc": "2026-02-09 17:05:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gzzqz",
          "author": "oxy_oxy",
          "text": "My product is in pretty a pretty good state for early adopters/closed testing. Building it it's just another day in the office. Marketing and distribution is a new beast for me completely. \n\nSo i call a day a productive one, the moment I do pretgy much anything in that direction, as this is me stepping out of my comfort zone. \n\nI raise the bar constantly but slowly not to burn myself out, or fell into perfectionist overthinking mode. \n\nSo growing into unknown territories feels productive to me.",
          "score": 1,
          "created_utc": "2026-02-09 18:07:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i3djj",
          "author": "AdUnlucky2432",
          "text": "When I’ve achieved the bulk of my daily goals.",
          "score": 1,
          "created_utc": "2026-02-09 21:18:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4iu80f",
          "author": "Major_Material5541",
          "text": "Try writing your goals down and keeping them visible, ideally right above your workspace. I’ve found that physically seeing them every day creates a strong sense of accountability. Break them out by time periods.  Day-to-day, weekly, monthly, and annual goals. After each period, take time to measure how you did and where you hit or missed the mark. One thing that’s helped me is setting goals that are attainable but still tough. For example, if you *want* to send 100 emails, set the goal at about 1.2× that. It pushes you without being unrealistic. Hope this helps, and good luck!",
          "score": 1,
          "created_utc": "2026-02-09 23:37:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l0fhv",
          "author": "HarjjotSinghh",
          "text": "13 hours in front of a screen? productive just means you're not actually doing anything.",
          "score": 1,
          "created_utc": "2026-02-10 08:35:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4oxauz",
          "author": "Key-Boat-7519",
          "text": "You’re on the right track focusing on “first things to fix” instead of another giant dashboard. What I’ve found matters most is: 1) brutally narrow scope (one core use case), 2) a simple daily score that moves when users act, and 3) fast feedback on changes. For SEO, pairing something like FirstFixSEO with Search Console and even Reddit-driven tools like Hypefury or Pulse for Reddit helps tie fixes to real questions and clicks, so people can actually feel the needle move day to day.",
          "score": 1,
          "created_utc": "2026-02-10 21:49:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r22u3o",
      "title": "€10K left, 2 SaaS projects, and the constant fear I'm making a huge mistake",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r22u3o/10k_left_2_saas_projects_and_the_constant_fear_im/",
      "author": "Extra-Motor-8227",
      "created_utc": "2026-02-11 17:00:14",
      "score": 16,
      "num_comments": 32,
      "upvote_ratio": 0.87,
      "text": "Two months ago I left my job as a frontend developer to build SaaS products full time. I had about €16K saved up. I'm down to €10K now and some days the math keeps me up at night.\n\nI'm not writing this as a success story. I'm writing this because every post I see here is either \"I made $50K MRR in 3 months\" or \"don't give up, keep grinding.\" Nobody talks about what it actualy feels like in the messy middle. So heres the honest version.\n\n\n\n**The situation**\n\nI started with a first SaaS two months ago. Built it, launched it, started seeing some traction through SEO. Not life changing numbers but enough to keep me going. I decided to put it on near autopilot and let organic growth do its thing while I started building a second product like a week ago.\n\nThe logic makes sense on paper: diversify, let SEO compound, build while I still have runway.\n\nThe reality feels very different.\n\n\n\n**What nobody tells you about living on savings**\n\nSome days are genuinely good. I wake up, check my analytics, see growth, feel like I made the right call. I build features, write content, talk to users. I feel alive in a way I never did at a desk job.\n\nThen there are the other days.\n\nThe days where I open my bank account and do the mental math. €10K. Maybe 4 months of bare minimum living. I start thinking about what happens if this doesnt work. I think about going back to applying for frontend jobs, which brings its own anxiety.\n\nHeres the thing nobody talks about: I've been a frontend dev for 6 years. I can build full apps from scratch. But I studied mechanical engineering, learned to code through a bootcamp (Le Wagon), and built my skills by actualy shipping products, not by grinding LeetCode. So when companies send me technical tests, I bomb them. I can build your entire product but I cant reverse a binary tree on a whiteboard.\n\nThat gap between what I can do and what I can prove in a 45 minute coding test is terrifying when its your plan B.\n\n\n\n**What keeps me going**\n\nI have this goal that I come back to when things get dark. I want to live in Sydney. The sun, the ocean, the lifestyle. Every time I think about quitting I picture myself there and I remember why I'm doing this.\n\nIt sounds stupid when I write it down. But having a clear picture of what your building toward, not just \"financial freedom\" or \"be my own boss\" but something specific and vivid, thats the thing that gets me out of bed on the bad days.\n\nThe traction helps too. Its small but its real. And real traction, even tiny, is proof that the idea works. The question is just wether it'll grow fast enough before the savings run out.\n\n\n\n**Where I'm at mentally**\n\nI'm not gonna pretend I have this figured out. Most days I go back and forth between \"this is the best decision I ever made\" and \"I'm an idiot burning through savings on a dream.\" Sometimes both in the same hour.\n\nToday is one of those days where I just want to disappear and quit everything honestly. Ask me again tomorow and I'll probably feel better. Thats kind of how it goes.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1r22u3o/10k_left_2_saas_projects_and_the_constant_fear_im/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4ukuln",
          "author": "Key-Boat-7519",
          "text": "The main thing here is you already did the rarest part: you stuck around through the silence instead of rage-quitting or sprinting back to a paycheck at the first wobble.\n\nWhat you’re feeling is exactly what happens when your runway and identity are tied together. Two ideas that helped me:\n\n1) Put hard guardrails on the money. Decide now: “If MRR isn’t at X or trending up by Month Y, I freelance 2–3 days/week.” That turns the fear into a trigger for a plan instead of a fog.\n\n2) Stop treating product #1 as “on autopilot.” Pick one growth motion (SEO, cold outreach, or partnerships) and commit to a small weekly quota: number of articles, DMs, or emails. Momentum compounds way faster than splitting your brain across two half-marketed products.\n\nOn the job front, you can dodge a lot of LeetCode hell by aiming at smaller startups, networking into teams, and showing real projects instead of tests. I’ve landed work that way using my own apps as the portfolio, plus things like Upwork and cold DMs; tools like Ahrefs, Indie Hackers, and Pulse for Reddit help me find where my exact users and potential employers hang out.\n\nMain point: give your fear a job with clear rules, focus on one growth engine, and keep a realistic “back to cashflow” plan so Sydney stays a goal, not an escape fantasy.",
          "score": 3,
          "created_utc": "2026-02-11 19:06:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4y7pox",
              "author": "Extra-Motor-8227",
              "text": "Thanks a lot for your comment mate! That's what I needed. You're right about the guardrails, and I think I will start applying today and show my own project as exemple. I will feel 10 times better mentally if I know I have money that comes every month. Can I send you a DM about finding future employers? You seem to know what you're talking about. I need some advice on this.",
              "score": 1,
              "created_utc": "2026-02-12 08:36:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4vraxm",
          "author": "Think-Assistance-419",
          "text": "Same. These are the “good old days” in real time.",
          "score": 3,
          "created_utc": "2026-02-11 22:31:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4y7qwi",
              "author": "Extra-Motor-8227",
              "text": "Depends on the day actually ahah good luck buddy!",
              "score": 1,
              "created_utc": "2026-02-12 08:36:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4u7zj3",
          "author": "ssshield",
          "text": "Being scared and unsure is part of it man. Youve got this. Sydney is there. Youre working the process to get there. \n\nTake a deep breath. Get some sun on your face. \n\nYouve got this.",
          "score": 2,
          "created_utc": "2026-02-11 18:06:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4y7x67",
              "author": "Extra-Motor-8227",
              "text": "Thanks a lot for your message mate, I really appreciate the support",
              "score": 1,
              "created_utc": "2026-02-12 08:38:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4vz0te",
          "author": "m2e_chris",
          "text": "the LeetCode thing is real. I've hired people who aced whiteboard interviews and couldn't ship a feature in two weeks. the system is broken but it's not worth stressing over as your plan B - you'd be better off freelancing on Upwork with your actual portfolio than grinding algorithms.\n\n€10K with 4 months runway and real traction is not a bad position. you're just comparing it to the highlight reel posts where everyone conveniently skips the part where they were terrified.",
          "score": 2,
          "created_utc": "2026-02-11 23:11:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4y82ks",
              "author": "Extra-Motor-8227",
              "text": "That's a real problem, and a lot's of companies ask for those test without knowing what it means. Thanks for your message buddy! You're right, I'm gonna start to hunt for some freelancing",
              "score": 1,
              "created_utc": "2026-02-12 08:39:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4wqzyy",
          "author": "InstantJarvis",
          "text": "the oscillating between \"best decision ever\" and \"what am I doing\" doesn't go away even when things start working. that's just the founder experience. 4 months of runway with real traction is more than most people have when they make this jump.",
          "score": 2,
          "created_utc": "2026-02-12 01:55:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4y858n",
              "author": "Extra-Motor-8227",
              "text": "Thanks for your message mate, appreciate it",
              "score": 1,
              "created_utc": "2026-02-12 08:40:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4wvoiv",
          "author": "Ecaglar",
          "text": "the leetcode thing resonates hard. the hiring system is completely disconnected from actual ability to ship. ive seen people ace interviews and then spend 3 weeks stuck on a simple feature.\n\n  \n4 months runway with real traction is actually a decent position. the messy middle is supposed to feel like this - the posts you see about quick wins are survivorship bias. most people in your situation dont post about it.\n\n  \none thing that helped me: set a hard deadline. \"if im not at X revenue by Y date, i start freelancing part-time.\" removes the mental torture of constantly recalculating runway",
          "score": 2,
          "created_utc": "2026-02-12 02:23:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4y8mzo",
              "author": "Extra-Motor-8227",
              "text": "You're right mate, I need to put hard deadline, and let myself some time until end of the month, and then start to applying / hunt for freelancing. Quick question, any advice on finding a freelancing job? ",
              "score": 1,
              "created_utc": "2026-02-12 08:45:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4x5y8g",
          "author": "Unique-Painting-9364",
          "text": "Having real traction even if it’s small puts you way ahead of most people who are still just dreaming. The messy middle is tough but you are clearly building something real that alone makes this feel far from a mistake.",
          "score": 2,
          "created_utc": "2026-02-12 03:25:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4y8oj9",
              "author": "Extra-Motor-8227",
              "text": "Thanks buddy for your message, I really aprpeciate you're support",
              "score": 1,
              "created_utc": "2026-02-12 08:45:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xboh3",
          "author": "Narrow_Doctor_6912",
          "text": "Good post, as you said, many people don't talk about the messy middle. Because it's scary, it needs acceptance. I am also going through something similar. Apart from trying out some tactics - getting service deals, trying to give offers to improve traction, changing some messaging etc. one thing I am also trying is trying to get the mindset right. Sometimes, I sit in solitude, asking questions, being frank, and then have faith that answers will emerge. Have faith - This too shall pass....",
          "score": 2,
          "created_utc": "2026-02-12 04:03:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4y8t7y",
              "author": "Extra-Motor-8227",
              "text": "Thanks buddy for your message, you're not alone, we are all in the same boat, and if we continue to work on our dream we will make it, I'm 100% sure. I wish you good luck!",
              "score": 2,
              "created_utc": "2026-02-12 08:47:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xlaip",
          "author": "h____",
          "text": "I'm living it. I understand the horror of living on savings, on a limited runway. There's no shame in going back to a job or doing freelancing/consulting to build up savings again. In fact, it's a great time for that since you are building SaaS. Agentic coding helps multi-tasking much better. It's much easier to work on multile projects or something on the side.",
          "score": 2,
          "created_utc": "2026-02-12 05:13:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4y75rw",
              "author": "Extra-Motor-8227",
              "text": "Thanks for your comment mate. Appreciate it, it's good to not be alone. And I'm thinking about finding a job, I will feel 10 times better mentally. ",
              "score": 1,
              "created_utc": "2026-02-12 08:30:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4yftyg",
          "author": "mwitiderrick",
          "text": "i feel like i experience this everyday, especially if you keep looking at twitter, and the way everyone seems to be posting MRR, when you have none, for some reason i dont see any posts from people who dont MRR, survivorship bias is real ",
          "score": 2,
          "created_utc": "2026-02-12 09:56:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ygmoe",
              "author": "Extra-Motor-8227",
              "text": "and social media play a big role in this feeling, I'm pretty only 5% person of SaaS founders succeed, but X social medias show 100% of these 5%",
              "score": 1,
              "created_utc": "2026-02-12 10:04:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4yhxx0",
                  "author": "mwitiderrick",
                  "text": "yeah, social media amplifys the sucess but most people arent making 10K mrr",
                  "score": 1,
                  "created_utc": "2026-02-12 10:16:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o505jiy",
          "author": "topoftheforts",
          "text": "I've been in the same exact situation. Start looking for freelance work right now. You'll thank me in 4 months.\n\nIt's not that I don't believe you can build a profitable SaaS, it's just that in the real world (not Twitter, not MRR screenshots) building a solid business takes a long time and sometimes you might make all the right choices and still fail, because it takes a combination of grit, skills, network, luck.\n\nYou said your expenses are 2.5k / month. Building a SaaS that makes real, stable long term 2.5k MRR takes a long time. Most people never make it. Doing it in 4 months is really fucking hard. Disregard the people who launch an app and declare \"18k MRR!\" after a week. that's not MRR. It's revenue, not recurring.  \nOn top of that, if your actual livelihood depends on this target, it's even harder because as the days go by you start questioning every choice and you start making panic-based choices. Which is the worst mental state to be in when running a business.\n\nIt's just a horrible place to be in and one you shouldn't put yourself in voluntarily.\n\nI don't want to be the negative one, I really wish you all the success in the world but I've been burned myself by the \"just quit! Be a indie hacker!\" voices and it was fucking horrible. I just want to be honest with you so you can spare yourself some dark days. I think sometimes you just need someone to be brutally honest with you.\n\nAs for myself, now I am doing a combination of client work and SaaS and it's much much much easier mentally, as I can sustain myself but my life doesn't depend on my customers not churning.",
          "score": 2,
          "created_utc": "2026-02-12 16:23:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o51baaa",
              "author": "Extra-Motor-8227",
              "text": "No worries buddy and thanks a lot for being honest, I appreciate that. And I'm fully agree with you, I know it's gonna be hard to go to 2.5K MRR in 4 months, that's why I decided to re-do freelancing in parallel, I will be much better mentally. Thanks again mate!",
              "score": 1,
              "created_utc": "2026-02-12 19:39:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o52etbr",
          "author": "theredhype",
          "text": "That you're you're relying on SEO for early traction while living off savings raises a red flag for me. It seems like a misunderstanding about some fundamentals. SEO is not an early traction supporting mechanism. \n\nWhat method / framework / process are you using to identify and mitigate risk? Are you familiar with lean startup stuff? The Customer Development process? Tools and methods like the Business Model Canvas, Value Proposition Design, or The Mom Test?",
          "score": 2,
          "created_utc": "2026-02-12 22:51:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54kp4i",
              "author": "Extra-Motor-8227",
              "text": "Thanks for your answer! Actually the first SaaS is a proven idea: find and outreach peoples on LinkedIn. There are already tons of similar app which is working very well, that's why I know there is a market for this, and I rely on SEO because it's where others app are not.",
              "score": 1,
              "created_utc": "2026-02-13 07:28:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4u6b1v",
          "author": "pr2d3",
          "text": "What is your monthly expenses? And what is the maximum loss that you’re comfortable to take?",
          "score": 1,
          "created_utc": "2026-02-11 17:58:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4y7v5s",
              "author": "Extra-Motor-8227",
              "text": "My monthly expenses are 2500 euros, so I can't exceed this limit",
              "score": 1,
              "created_utc": "2026-02-12 08:37:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ympis",
          "author": "trainmindfully",
          "text": "this is way more real than most of the just ship bro posts in here.\n\nthe messy middle is brutal. when it’s your own savings, every slow week feels personal. analytics up a bit and you’re a genius. flat for three days and suddenly you’re calculating runway at 2am.\n\nhonestly, the fact that you already have real traction, even small, puts you ahead of most people who quit. seo compounding is slow and boring at first. it almost never matches the urgency of your bank account.\n\non the plan b fear, i relate to that gap between can build real stuff and can pass a contrived test. it’s frustrating. but six years shipping actual products is not nothing. worst case, you could probably land somewhere that values output over whiteboard tricks, even if it takes a bit longer.\n\nif you had to pick one of the two saas projects to bet everything on for the next 60 days, which one has the clearest path to revenue? sometimes focus buys you more runway than diversification.\n\neither way, what you’re feeling sounds normal. scary, but normal. the swing between confidence and doubt is kind of the price of doing this.",
          "score": 1,
          "created_utc": "2026-02-12 11:01:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50pzqu",
          "author": "Crafty_Act_3212",
          "text": "Yeah, that's a really honest look at the messy middle with the runway math and the technical gaps. You can cheek this team qoest which help a client who was in that exact spot as a frontend dev trying to scale his SaaS before his savings ran out.",
          "score": 1,
          "created_utc": "2026-02-12 17:59:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51breg",
          "author": "freshWaterplant",
          "text": "Look. If you have doubts validate. Look for your ideal customer before burning more cash. Seriously, this is why there are so many failures. POC and  talk to customers\n\nOn another note: a reality check. This should be a side project. Quit your job when you know you have paying customers",
          "score": 1,
          "created_utc": "2026-02-12 19:42:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zk630",
          "author": "Ash_Skiller",
          "text": "man I think the thing nobody's talking about here is the cash burn visibility problem. You're doing the math in your head at night, but you're probably not seeing the actual runway picture until it's too late to pivot. Most founders in this spot are flying blind on their actual cash position and what levers they could pull.\n\nThe real question isn't just \"\"will this work\"\" but \"\"how many weeks do I have to make it work, and what would need to change by when.\"\" That's not motivational, that's just math you need in front of you constantly. I've heard good things about AsteroCFO. Ai for this exact situation. Their AI CFO does monthly cash reviews that spot risks before they become emergencies for like â‚¬350/month, and you can ask unlimited questions about your numbers in plain English.\n\nWay cheaper than hiring someone and you get answers immediately instead of doing panicked mental math at 2am. Either way, get some kind of system that shows you the actual numbers daily. The fear of not knowing is worse than knowing you have 12 weeks and need to hit X revenue.\n\nGood luck with the products. The fact that you have real traction on product one is not nothing.",
          "score": 0,
          "created_utc": "2026-02-12 14:40:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qye09u",
      "title": "As a SaaS founder - what role do you enjoy the most? (For me it’s customer support, not dev, here's why)",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qye09u/as_a_saas_founder_what_role_do_you_enjoy_the_most/",
      "author": "Genuine-Helperr",
      "created_utc": "2026-02-07 13:37:23",
      "score": 15,
      "num_comments": 19,
      "upvote_ratio": 0.94,
      "text": "Being a founder means wearing many hats  - dev, copywriting, marketing, support, etc.\n\nMost founders love coding....but after 10+ years of building products used by 15,000+ users (prof in 1st comment) , i think customer support should be what they should love.\n\nI love customer support & spent *40% time on support*....Started by selling on CodeCanyon, then single-purchase products, and eventually SaaS.\n\nI’m currently building my second SaaS product.\n\nOver time, I realized **Customer support is gold mine.**\n\nTalking directly to customers gives me:\n\n* Raw, unfiltered feedback\n* Clarity on confusing screens/workflows\n* Use cases I never imagined as a dev\n* Feature requests, edge cases, and real-world issues\n* Better micro-copy wording\n* Update outdated docs\n* Early signals of where users struggle *before* churn happens\n\nOne of my products started as a single module.  \nBy simply listening to customers, it evolved into **15+ modules** that added *approx 5K+ MRR* \\- almost all of them came from support conversations, not my original roadmap.\n\nMany founders see support as a distraction or a time sink.  \nI see it as a **direct feedback loop to build a better product**.\n\nCurious to hear from you: **Which role do you enjoy the most and why?**",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qye09u/as_a_saas_founder_what_role_do_you_enjoy_the_most/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o43hu6c",
          "author": "TheBigCicero",
          "text": "I believe this. A founder should be a sales person and a product manager.",
          "score": 5,
          "created_utc": "2026-02-07 15:52:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44bbnl",
              "author": "Genuine-Helperr",
              "text": "Indeed, doing customer support is one of the best ways to get different marketing angles based on whatever customers are asking",
              "score": 2,
              "created_utc": "2026-02-07 18:17:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o44lrhx",
          "author": "HitItOrQuidditch",
          "text": "I've found talking directly to customers.  \n\nI'm a firm believer that you will never be as close to your customers as you are to your first 50. Which is a type of philosophy Brian Chesky talks about.  You are still small enough to know their pain, their experience, their interactions with your product.  The raw feedback that you can take to heart with the hope it helps redefine things.\n\nReally, it's just hunting for the pain points that hide like needles in the haystack.  Like when selling b2b software to an enterprise company, part of the evaluation is that underlying feeling whether or not that person will lose their job if your product underwhelms.  Yet no one mentions job security...",
          "score": 2,
          "created_utc": "2026-02-07 19:09:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o47ikz6",
              "author": "Genuine-Helperr",
              "text": "Yes, completely agree with the points you've mentioned. Staying close with customers helps you uncover their pain points, their experiences, and their use cases of different features. ",
              "score": 1,
              "created_utc": "2026-02-08 05:47:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o47mqme",
          "author": "Ambitious-Pirate3620",
          "text": "As a frontend ui developer , I love building things \nLike I test out my skills and creativity , \nHere is my portfolio \nUi-developer-nine.vercel.aoo",
          "score": 2,
          "created_utc": "2026-02-08 06:22:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49xb83",
          "author": "Unhappy-Bunch-4594",
          "text": "100% agree on support being underrated. that feedback loop is irreplaceable.\n\nthe thing i'd add: there's a ceiling. around 100-150 active customers, i was spending 40%+ of my week on support and the quality of everything else started dropping. product stalled because i was too busy answering tickets to build.\n\nwhat worked for us: hired a part-time support person but stayed on the weekly \"top 10 tickets\" review. they handle the volume, i read the patterns. same quality insights, maybe 10% of the time commitment.\n\nthe $5K MRR from support conversations resonates hard -- one of our biggest feature expansions came from a customer casually mentioning they were using 4 different tools because ours was missing a workflow they assumed we'd have. never would've found that from a survey or analytics dashboard.\n\nthe counterintuitive part: the support tickets that taught me the most weren't the bug reports or feature requests. they were the \"how do i do X?\" messages that revealed our UX was confusing in ways i was blind to as the builder.",
          "score": 2,
          "created_utc": "2026-02-08 16:35:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4e9mss",
              "author": "Genuine-Helperr",
              "text": "Exactly agree with what you have said. Once you have around 100 to 150 customers, hiring a support person is the best way to offload some of the work to the support person.\n\nAlso, initially, 150 customers are much more than enough to get all the feedback related to features, UI/UX confusions, any text confusion, or anything else. After that, offloading it to a support person is pretty much fine.\n\nAlso, you can use feedback management tools like RightFeature. Where customers can request features, report bugs, and any other requests they have. Other customers can upvote feedback. \n\nBased on upvotes, you can prioritise development work.",
              "score": 1,
              "created_utc": "2026-02-09 07:10:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4a70ql",
          "author": "Existing-Board5817",
          "text": "I like sales, honestly since 90% is automated it feels very efficient  \nI use Starnus for that",
          "score": 2,
          "created_utc": "2026-02-08 17:22:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4e9vom",
              "author": "Genuine-Helperr",
              "text": "that's great",
              "score": 1,
              "created_utc": "2026-02-09 07:12:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4erckn",
                  "author": "Existing-Board5817",
                  "text": ":)",
                  "score": 2,
                  "created_utc": "2026-02-09 10:04:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4e4kve",
          "author": "South-Opening-9720",
          "text": "Totally agree support is the closest thing to “truth” you get as a founder. The trick for me was making it repeatable: one weekly pass where you label the last week’s convos into 5-10 buckets (onboarding confusion, missing docs, bugs, feature asks) and pick 1 fix to ship. If volume grows, chat data is handy to auto-cluster themes so you’re not reading every thread, but you still keep the direct voice-of-customer loop.",
          "score": 2,
          "created_utc": "2026-02-09 06:25:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ea4er",
              "author": "Genuine-Helperr",
              "text": "Definitely a good point. You can also use a feedback management tool like RightFeature to capture all feedback from the customers and then prioritize them based on the upvotes",
              "score": 1,
              "created_utc": "2026-02-09 07:15:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o42sz9q",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-07 13:37:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42szbl",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qye09u/as_a_saas_founder_what_role_do_you_enjoy_the_most/o42sz9q/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-07 13:37:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o432ah5",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-07 14:31:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o432aj3",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qye09u/as_a_saas_founder_what_role_do_you_enjoy_the_most/o432ah5/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 0,
              "created_utc": "2026-02-07 14:31:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r1u84p",
      "title": "I failed 5 ventures before earning my first dollar and here’s what finally changed",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r1u84p/i_failed_5_ventures_before_earning_my_first/",
      "author": "INFSslayer",
      "created_utc": "2026-02-11 10:50:14",
      "score": 14,
      "num_comments": 4,
      "upvote_ratio": 0.9,
      "text": "&#x200B;\n\nWhen I first started my entrepreneurial journey, I genuinely thought the hardest part would be execution.\n\nI was wrong.\n\nThe hardest part was finding the right idea.\n\nBefore this, I failed. Not once. Not twice. Five different ventures. Some died quickly, some dragged on longer than they should have, but all of them had one thing in common. I was building things I thought sounded interesting, not things people were actively struggling with.\n\nToday, our tech startup earned its first dollar.\n\nIt is a small amount. Almost symbolic. But if you have been through failure, you know how big that moment feels. That dollar carries more validation than months of motivation.\n\nWhat changed this time was not my work ethic or discipline. It was how I approached the idea itself.\n\nIn the early days of entrepreneurship, choosing the wrong idea is brutally expensive. Not in money, but in time, energy, and belief. You can work hard on the wrong problem and still end up nowhere. That lesson took me years to learn.\n\nThis time, I focused on something very unglamorous. A problem people were already complaining about. Something boring enough that no one was pitching it with buzzwords. Something that existed whether or not I built a startup around it.\n\nI actually came across the idea while searching on Google and stumbling onto StartupIdeasDB. I do not even know if I am allowed to share links here, so I will avoid that. But what stood out to me was not how exciting the ideas sounded. It was how practical they were. Many of them were rooted in real frustrations people already talk about online.\n\nThat flipped a switch for me.\n\nInstead of asking “Is this idea innovative?”, I started asking “Are people already annoyed enough to pay for a solution?”\n\nSolving problems people complain about openly is far more powerful than chasing ideas that sound impressive in founder circles. Fancy ideas get applause. Boring ideas get revenue. This holds true whether you are building B2B or B2C.\n\nLooking back, my failed ventures were not failures of effort. They were failures of judgment. I was trying to invent demand instead of listening to it.\n\nThis experience taught me something I wish I had understood earlier. Your job as an early stage founder is not to sound smart. It is to reduce pain. Quietly. Consistently. In a way people are already asking for.\n\nToday’s first dollar did not come from brilliance. It came from humility. From accepting that the best ideas are often already hiding in plain sight, inside problems people complain about every single day.\n\nIf you are early in your journey, learn this sooner than I did. The right idea will save you years.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1r1u84p/i_failed_5_ventures_before_earning_my_first/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4s6mb4",
          "author": "CleanOpsGuide",
          "text": "This is real.\n\nA lot of us don’t fail because we don’t work hard, we fail because we’re solving problems nobody is urgently trying to fix.\n\nThe shift from “Is this innovative?” to “Are people already annoyed enough to pay?” is everything.\n\nBoring pain > exciting ideas.\n\nHow did you validate this one differently before building?",
          "score": 1,
          "created_utc": "2026-02-11 11:33:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4u69v8",
              "author": "DeepDownOutside",
              "text": "Thanks ChatGPT",
              "score": 1,
              "created_utc": "2026-02-11 17:58:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4u8aqn",
                  "author": "CleanOpsGuide",
                  "text": "lol nah, just experience",
                  "score": 1,
                  "created_utc": "2026-02-11 18:08:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4yfbuf",
          "author": "mwitiderrick",
          "text": "that is amazing, I have made a few dollars online, my problem has always been scaling from there, and i think what you are saying has a lot to do with it, having painkiller ideas instead of vitamins. need to evaluate ",
          "score": 1,
          "created_utc": "2026-02-12 09:51:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzzker",
      "title": "Is Richard Branson’s success model still possible today?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qzzker/is_richard_bransons_success_model_still_possible/",
      "author": "Zestyclose_Equal_132",
      "created_utc": "2026-02-09 09:14:26",
      "score": 13,
      "num_comments": 37,
      "upvote_ratio": 0.68,
      "text": "I’ve been thinking about this: Richard Branson started Virgin Atlantic back in the 80s with just a small amount of his own money (around £1–2 million), a ton of courage, ideas, and marketing skills, and relied on investors and early customer payments to get the company off the ground.\nDo you think this kind of success is still achievable today? Can someone realistically start a big business from just an idea, without being a millionaire, simply by convincing the right partners and using resources smartly?\nI’d love to hear your experiences or thoughts on whether this kind of entrepreneurial path is still possible in today’s world.",
      "is_original_content": false,
      "link_flair_text": "Idea Validation",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qzzker/is_richard_bransons_success_model_still_possible/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4etou2",
          "author": "Metabotany",
          "text": "Your question is:\n\nCan RBs model be replicated today? That model being “inject £1-2Mm”\n\nThen you go on to say \n\nIs it achievable to start a big business without being a millionaire and implicitly use this model.\n\nThe answer is, for you, probably not, because you can’t even really see the logical conundrum you’ve created in your question how will you demonstrate the execution necessary to deliver concepts?",
          "score": 58,
          "created_utc": "2026-02-09 10:26:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fjzt6",
              "author": "ConcentratedCC",
              "text": "Not only that, but he launched in 1984. The inflation adjusted value of £1M today is £4.2M. And that’s the low end of what op gave as just Branson’s own money that he used.",
              "score": 16,
              "created_utc": "2026-02-09 13:46:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4jh3mv",
                  "author": "ColdStockSweat",
                  "text": "Which will be true in 50 years, and 50 years beyond that.\n\nAnd 50 years beyond that.",
                  "score": 1,
                  "created_utc": "2026-02-10 01:47:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4g6ccm",
          "author": "startupdojo",
          "text": "You make 2m in 1980 sound like it's nothing.  That is the same as 8 million today.  \n\n\nTons of people start tons of successful businesses today with much less.  \n\n\nBut no, ideas and daydreamers don't make businesses.  People with effective skills make businesses.  If you have tip top skills or if you are an amazing salesman, anything is possible. ",
          "score": 15,
          "created_utc": "2026-02-09 15:46:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f8awa",
          "author": "afrostralian",
          "text": "No. Epstein is dead",
          "score": 13,
          "created_utc": "2026-02-09 12:31:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ff2gy",
              "author": "Neurojazz",
              "text": "Virgin 🤮",
              "score": 7,
              "created_utc": "2026-02-09 13:16:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4fk68c",
          "author": "TechnicalScientist27",
          "text": "Is his exact replication possible? Probably not, but the thing is… it was never about replicating the results of someone else. It’s about believing in yourself, digging deep, and obsession. That kind of dedication requires trade offs. Are you willing to pay the costs",
          "score": 5,
          "created_utc": "2026-02-09 13:47:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4eo055",
          "author": "HarjjotSinghh",
          "text": "yeah except now there are 600k memes for free.",
          "score": 2,
          "created_utc": "2026-02-09 09:30:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fgay0",
          "author": "dragonflyinvest",
          "text": "Why do people keep asking if something is possible when all you have to do is look around and see people doing it? If YOU have to ask then I think it suggests it is not possible for you. But Richard Branson never asked anyone whether it was possible. And if I had to guess he never knew if it would work or not, he was having fun and trying to make some money along the way.\n\nI listened to a few of Branson’s masterclass videos and read a biography years ago. The guy just has brass balls he developed from his youth. I remember a story of his mom dropping he and his brother off in the middle of road and making them find their way home. Stuff young adults today would say was “abuse”, but his mom was trying to teach them to be resourceful and solve problems on their own. Branson told a story of how he founded the airline. He was stuck in an airport and his flight kept getting delayed so he just walks into a hangar and talks to some people with planes. Charters one, writes on a paper board “Flights for $99 to wherever the f” he was going, and sold the rest of the empty seats. That was the genesis for the airline idea. \n\nYou look some random ass facts like “he only had this much money” blah blah and you think that is a linchpin to whether he was successful or a failure? He is successful because he tried bold ideas, he solves problems, he doesn’t ask for permission, etc. His mindset is not one to ask Reddit if it will work, he acts on his ideas and sees them through to fruition, and some worked and some didn’t.",
          "score": 3,
          "created_utc": "2026-02-09 13:24:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ivj6j",
              "author": "Major_Material5541",
              "text": "This! Was having a conversation with a successful founder this week who raised $20M. He told me the difference is \"action\". Stop thinking of how you can build X or Y and go do it. ",
              "score": 1,
              "created_utc": "2026-02-09 23:44:21",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4fn6ud",
              "author": "Zestyclose_Equal_132",
              "text": "The way you respond gives the impression that there are millions of Richard Bransons in the world. In reality, that’s not the case. Autonomous billionaires like him are extremely rare. Around us, there are millions trying and failing, and only a few who truly succeed.\nWhen we encounter one of these rare successes, it’s natural to examine every detail of that person: what they own, their situation, their strengths… everything. This is exactly what’s called a case study.\nThe goal isn’t to generalize or create a category, but to understand the individual themselves, in all their dimensions. You need to observe and consider every detail to formulate a realistic hypothesis about what led to their success.",
              "score": 0,
              "created_utc": "2026-02-09 14:05:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4gq11z",
                  "author": "KenM-",
                  "text": "Talking around the main point of that comment goes to show your inadequacy. Go get a job, you need someone to give you directions.",
                  "score": 4,
                  "created_utc": "2026-02-09 17:19:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4eoa2j",
          "author": "Willing-Training1020",
          "text": "It's a mix of harder and easier? Easier because you can launch with almost no capital using no-code tools, remote talent, and lean distribution channels BUT harder because attention is way more fragmented and competition is global. The winning condition is honestly gearing towards speed and iteration over one big bet. Most founders I see winning aren't waiting for the perfect idea or big funding, they're shipping fast, staying lean, and building in public. The path exists, it;s just a way different landscape.",
          "score": 1,
          "created_utc": "2026-02-09 09:33:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ew20c",
              "author": "Zestyclose_Equal_132",
              "text": "DM ??",
              "score": 2,
              "created_utc": "2026-02-09 10:49:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4fmqe2",
                  "author": "Willing-Training1020",
                  "text": "Sure! My inboxes are always open :)",
                  "score": 1,
                  "created_utc": "2026-02-09 14:02:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4eonmu",
          "author": "kubrador",
          "text": "sure, if you don't mind competing against companies with billions in network effects, regulatory capture, and 40 years of infrastructure already built. branson also had the luxury of airlines being way less saturated and vc actually taking swings on crazy ideas instead of just funding the 47th ai chatbot wrapper.\n\nyou can definitely bootstrap something today, just probably not a capital-intensive industry that requires flying planes and navigating the faa.",
          "score": 1,
          "created_utc": "2026-02-09 09:37:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fibz6",
              "author": "Plus-Professional-84",
              "text": "Not necessarily true. Someone with a disruptive business model can enter even very regulated industries, provided that they understand how the market operates and what the client needs are.",
              "score": 1,
              "created_utc": "2026-02-09 13:36:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4f323n",
          "author": "ArmOk3290",
          "text": "Branson is a weird example because airlines are capital heavy, regulated, and distribution is already owned.\n\n  \nIf you swap the industry, the pattern still works. You can start something big without being rich if:\n\n\\- you can launch with a small MVP\n\n\\- you can get to revenue fast\n\n\\- you have a repeatable way to reach customers\n\n  \nWhat changed is that \"convince the right partners\" is harder unless you bring proof. Today that proof is usually traction, a wedge into a niche, or a clear unfair advantage like domain expertise or distribution. The bar is higher, but the path exists.",
          "score": 1,
          "created_utc": "2026-02-09 11:50:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f63zo",
              "author": "Zestyclose_Equal_132",
              "text": "Branson didn’t succeed because he had billions or some secret marketing trick. He succeeded because he dared to do what no one else would even try. The giants could have entered the airline market, but they didn’t so he found a near-empty niche with almost no direct competition. His boldness created a natural advantage that let him grow without fighting thousands of small competitors.",
              "score": 0,
              "created_utc": "2026-02-09 12:14:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4f9uqj",
                  "author": "djaxial",
                  "text": "He was quite wealthy when he started Virgin Airlines. It was the mid 80s. He was well known at this stage. So we had the person brand, the money and the businesses connections. Was it daring? Yes. Was it risky? Not really, he could well afford to fail.",
                  "score": 3,
                  "created_utc": "2026-02-09 12:42:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4fcodk",
          "author": "Delicious-Finding-97",
          "text": "Yes I think the closest comparison would be Steven Bartlett or KSI/Jake Paul, What they are is notorious marketers same as Branson was. Starting an airline is doable but why would you when the margins are so small and the regulations are so high?",
          "score": 1,
          "created_utc": "2026-02-09 13:01:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fvlfz",
          "author": "Boring-Tadpole-1021",
          "text": "“As long as you bring your harem” Branson said to Epstein.",
          "score": 1,
          "created_utc": "2026-02-09 14:51:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g1n6y",
          "author": "Few_Response_7028",
          "text": "Everything is harder today due to increased competition, increased regulation (lobbyists making it harder for new businesses), and increased costs of everything. \n\nStarting a brick and mortar style business is absolutely brutal in the modern age.",
          "score": 1,
          "created_utc": "2026-02-09 15:23:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gqzdw",
          "author": "jryan727",
          "text": "Your example does not make any sense. Could RB have followed the same playbook which involved being a millionaire and using millions of his own dollars today if he was not a millionaire? Who knows!\n\nCan someone start a business without their own capital? Yes. People do it every single day. Capital allocators \\*need\\* to allocate capital. You need to persuade them to allocate some to you and your idea. That's it. ",
          "score": 1,
          "created_utc": "2026-02-09 17:24:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4h0ipd",
              "author": "Zestyclose_Equal_132",
              "text": "Unfortunately, to raise funds, networking is essential. You need a strong network. If investors are not convinced by the product, it will require even more networking.",
              "score": 1,
              "created_utc": "2026-02-09 18:09:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4h5ypw",
                  "author": "jryan727",
                  "text": "Have you ever attempted to raise funds?",
                  "score": 1,
                  "created_utc": "2026-02-09 18:35:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4h5dnl",
          "author": "Just-Personality-304",
          "text": "yes",
          "score": 1,
          "created_utc": "2026-02-09 18:32:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hl7b8",
          "author": "Aggravating-Ant-3077",
          "text": "nah Branson's playbook still works just dial the scale way down - instead of airlines think local service or niche software where you can pre-sell or bootstrap your way to first revenue. the story part still matters more than the money",
          "score": 1,
          "created_utc": "2026-02-09 19:47:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4isl9y",
          "author": "loud-spider",
          "text": "It's not a straight comparison really.\n\nBranson's net worth was already £5m by 1979, so £25-30m in today's money, so likely significantly more in 84.  He may have leased a used 747 for a lot less, but he used the cashflow and reputation of the existing Virgin businesses to guarantee the airline and get away with starting the airline itself on comparatively little capital whilst assuring it would't fold whilst he fought for routes (as Freddie Laker found out the hard way).\n\nEarly cashflow came from forward ticket sales. I can remember a tale of Branson writing a cheque to fill the 747 with fuel and wincing.\n\nAnd Virgin Music was launched on an inheritance of around £3k from an aunt and £300 from his mother in 1970s money, plus a bank loan guaranteed by family money of £25k. Modern cash equivalents probably approaching £200k in total.\n\nIt cost him £2500 to cover the studio costs for Tubular Bells...and the net profits on the sales of that were around £5m-£7m in 70's money.\n\nSO: Sure everyone really starts from 'just an idea', but these founder myths aren't helpful.\n\nBranson bootsrapped a smaller business first that was financed, and used that to underpin a bigger business.  You gotta either bring growth capital, or underwritten financing with you pretty quickly if you want to start to make noises in a sector.\n\nNone of this to say that championing Tubular Bells and making a pile out of it, or seeing where Freddie Laker went wrong weren't genius business moves...they definitely were...it's just that he came from an upper middle class background despite the hippy veneer, and was positioned to make it happen.\n\nSome version of that is the lesson for doing the same today.",
          "score": 1,
          "created_utc": "2026-02-09 23:28:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jgz77",
          "author": "ColdStockSweat",
          "text": "Everything that has ever happened in business in all of history, is still possible today.",
          "score": 1,
          "created_utc": "2026-02-10 01:47:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l2smh",
          "author": "realkaydhako",
          "text": "I never understood those questions. \n\nIf we say no > nothing changes\n\nIf we say yes > nothing changes\n\nI get it, it‘s a simple question to have a conversation.\n\nBut it‘s also a distraction from the things you could do.",
          "score": 1,
          "created_utc": "2026-02-10 08:58:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gbj06",
          "author": "PrettyRadio2073",
          "text": "Interesting question. Having spent **35 years** navigating both global multinationals and the startup world, and **15 years mentoring hundreds of founders**, I’ve seen this 'Branson myth' lead many people straight into what I call the **'Circle of Heresy',** denying current market reality.\n\nIs it still possible? **Yes, but the rules have changed.**\n\n1. **From 'Flashy Marketing' to 'Structural Trust':** In the 80s, you could launch an airline with a bold move and a phone call. Today, transparency is 10x higher. You can't just 'convince' partners; you need to demonstrate a system that works. In my book **'Startup Inferno'**, I call this avoiding the **'Frankenstein Startup',** don't just stitch together promises; build a solid core.\n2. **The 'Pre-payment' Reality:** Using customer money to scale (bootstrapping) is still the ultimate gold standard. But today, customers are more cynical. You need a 'Minimum Viable Trust' before they hand over their cash.\n3. **The Leverage of 2026:** Branson didn't have AI or global digital reach. Today, you don't need millions to start, but you need **extreme focus**. The danger now isn't 'not having resources', it's 'wasting resources' on 100 different paths.\n\nSuccess today isn't about being a billionaire first; it's about being the most **resilient architect** of your own vision. Most people fail not because they lack Branson's money, but because they lack his ability to simplify complex chaos into a single, executable mission.",
          "score": 0,
          "created_utc": "2026-02-09 16:10:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hfdz3",
          "author": "Dennis_Laid",
          "text": "No, Epstein is dead, remember?",
          "score": 0,
          "created_utc": "2026-02-09 19:19:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4es43l",
          "author": "NorthOk728",
          "text": "Exactly.\n\nI just mooch Solana it's a living \n\n9y2SacDUmakRzPaSkKbHKVQZwrBRTnHFXi8mQvZTT5jB",
          "score": -8,
          "created_utc": "2026-02-09 10:11:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r30zr2",
      "title": "Built an audio platform with 57K users, $0 revenue — selling it. Lessons learned.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r30zr2/built_an_audio_platform_with_57k_users_0_revenue/",
      "author": "hifi_fan",
      "created_utc": "2026-02-12 18:18:53",
      "score": 11,
      "num_comments": 16,
      "upvote_ratio": 0.79,
      "text": "Hey everyone,\n\nI built HiFi.fan — an independent audio news and product platform. After 2+ years of solo development, I'm putting it up for sale. Wanted to share the honest numbers and lessons.\n\n**The numbers:**\n- 57,000 active users (2025)\n- 87,000 annual page views\n- 375% year-over-year growth\n- 3,500+ returning visitors\n- $0 revenue (never monetized)\n\n**What it is:**\nA Next.js platform that aggregates audio industry news, product listings, and specs. Think \"what's happening in hi-fi\" in one place. Built with a custom data pipeline that auto-collects content.\n\n**Tech stack:** Next.js, React, Node.js, automated data collection pipeline\n\n**What went right:**\n- Found a real niche — audiophiles actively searching for gear info\n- Growth was organic, no paid marketing\n- Built solid tech infrastructure\n\n**What went wrong:**\n- Never prioritized monetization (classic developer trap)\n- Spent too much time on features, not enough on business model\n- Running it solo meant no accountability on the revenue side\n- Life priorities shifted — can't give it the time it deserves\n\n**Lessons for this community:**\n1. Build monetization into v1, not \"someday\"\n2. 57K users means nothing if you can't convert them\n3. A solo project needs revenue milestones, not just feature milestones\n4. Know when to pass the torch — someone with ad sales experience could monetize this quickly\n\n**Why I'm selling:**\nI simply don't have the time anymore. The platform works, the audience is there, but it needs someone who can focus on the business side. Hosting is ~$100/month self-hosted.\n\n**What's included:**\nFull codebase, domain (hifi.fan), all content, data pipeline, user base, documentation.\n\nIf you're interested or have questions, DM me or email cajoy@hifi.fan.\n\nHappy to share more details with serious inquiries.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1r30zr2/built_an_audio_platform_with_57k_users_0_revenue/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o5166jc",
          "author": "gptbuilder_marc",
          "text": "Weirdly the 57k isn’t the interesting part. The “never prioritized monetization” line is.\n\nThat’s usually not about traffic. It’s about avoidance.\n\nYou built the engine. You just never made it uncomfortable.\n\nWere you holding off because you didn’t want to clutter the experience, or because you didn’t actually know what would convert this audience?\n\nThose are very different problems.",
          "score": 7,
          "created_utc": "2026-02-12 19:15:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50znkx",
          "author": "aerobase-app",
          "text": "This is such a valuable post. The \"build audience first, monetize later\" trap catches so many of us.\n\nI did the same thing with my first product—focused entirely on user growth because it felt productive and validating. 6 months in, I had thousands of visitors but no revenue model that actually worked. The mental shift from \"how do I get more users?\" to \"how do I make money from users?\" is harder than it sounds.\n\nYour lesson about \"revenue milestones, not feature milestones\" hits hard. I had feature checklists. I had user growth charts. What I didn't have was a spreadsheet that said \"by month 3, we need $500 MRR or we change something fundamental.\"\n\nThe brutal truth: users don't automatically convert to revenue just because you have lots of them. 57K audiophiles is an incredible niche audience—affluent, passionate, always buying gear. The fact that it generated $0 isn't a product failure, it's a business model failure. And those are much easier to fix when you catch them early.\n\nFor anyone reading this: if you can't answer \"how will this make money in the first 90 days?\" before you write your first line of code, you're not building a business yet. You're building a project. Both are fine, but know which one you're doing.\n\nGood luck with the sale. The tech and audience you've built is genuinely valuable—just needs someone with a different skillset than pure product development.",
          "score": 2,
          "created_utc": "2026-02-12 18:44:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o534389",
              "author": "drteq",
              "text": "Show me the audience",
              "score": 1,
              "created_utc": "2026-02-13 01:16:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o51tc7q",
          "author": "Jumpy-Possibility754",
          "text": "57k users with $0 revenue is such a brutal / beautiful stat at the same time.\n\nHonestly respect for sharing the real numbers.\n\nReading this, it doesn’t even sound like a failure — it sounds like you built a distribution asset and just never flipped the switch.\n\nIf audiophiles are actively searching for gear info, there were probably at least 3 obvious paths:\n\n– Affiliate links on product listings\n– Featured placements for brands\n– Paid “early access” to new releases / alerts\n\nBut I get it. When you’re deep in building, monetization always feels like “I’ll do it once it’s bigger.”\n\nOut of curiosity — did users ever ask for anything that hinted at willingness to pay? Like comparison tools, price alerts, saved setups, etc.?\n\nAlso, if you’re selling it, 57k active users + 375% YoY growth is not small. The right buyer might care way more about the audience than the revenue.\n\nEither way — this is the classic dev trap, but at least you built something real. Most people don’t even get to 57 users.",
          "score": 2,
          "created_utc": "2026-02-12 21:06:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o544xgj",
              "author": "hifi_fan",
              "text": "Users never contacted directly. Sometime vibe on Reddit post. Brands was giving products for demo but no direct interest in paying. Not from users not from brands :( affiliate also not works",
              "score": 1,
              "created_utc": "2026-02-13 05:16:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o50vqmq",
          "author": "CleanOpsGuide",
          "text": "Build revenue in from day one. If it’s not making money early, it’s probably just a cool project, not a real business.",
          "score": 1,
          "created_utc": "2026-02-12 18:26:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51l9ao",
          "author": "MathewGeorghiou",
          "text": "Congrats on the effort.  Would love to know if the sale happens for you, just curious.  BTW, not sure if a selling site like Flippa might work for you.",
          "score": 1,
          "created_utc": "2026-02-12 20:27:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51wrlj",
          "author": "vmco",
          "text": "First, I really admire the work with this project - the site is clean and easy to navigate. \n\nMoreover the target audience, positioning and the objective of the site is abundantly clear.\n\nHaving said, at the end of the day the site is a blog and therefore a path to monetization is entirely possible. \n\nThe point: You have already completed all of the heavy lifting, why not go the distance and see it through?\n\n",
          "score": 1,
          "created_utc": "2026-02-12 21:22:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5459vg",
              "author": "hifi_fan",
              "text": "The problem is : Dojt wants to waste more time on dev. And don’t have time / exp as sales : contacting brands, leads and etc. tried few monetisatiin strategies, but Adsense and 10$ not worth it",
              "score": 1,
              "created_utc": "2026-02-13 05:19:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o526diw",
          "author": "HarjjotSinghh",
          "text": "why sell when you can just quit your dream?",
          "score": 1,
          "created_utc": "2026-02-12 22:08:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o545bh9",
              "author": "hifi_fan",
              "text": "What do you mean?",
              "score": 1,
              "created_utc": "2026-02-13 05:19:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o533869",
          "author": "drteq",
          "text": "The pitch got me, ngl - but I have to say this feels like fraud, or an attempt to get some users.\n\nMainly the site is designed with newer AI tools that I see quite often - sure you could have upgraded it.\n\nHowever, there is zero engagement signs, zero profiles, zero activity? \n\n600 instagram followers?\n\nNot even a single like on a post?  Do you have anything else to back up the active users claim?\n\nDidn't pass the sniff check, hope I'm wrong.",
          "score": 1,
          "created_utc": "2026-02-13 01:11:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o545k41",
              "author": "hifi_fan",
              "text": "Not fraud at all. And that also bothers me. Why with so many visitors no body likes or comment. I mean comments but rare and it goes deep in pagination. There was another not AI design and users stat actually coming back when changed to cleaner version",
              "score": 1,
              "created_utc": "2026-02-13 05:21:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o53l4hd",
          "author": "No-Fact-8828",
          "text": "Those are very different problems.",
          "score": 1,
          "created_utc": "2026-02-13 03:01:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o546t0z",
          "author": "Deathspiral222",
          "text": "How can you have 57k active users and only 87k annual pageviews? That’s less than two page views per active user for a year.",
          "score": 1,
          "created_utc": "2026-02-13 05:30:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o548ax4",
              "author": "hifi_fan",
              "text": "It is 57k annual active users,  not monthly",
              "score": 1,
              "created_utc": "2026-02-13 05:42:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r0veq7",
      "title": "housecall pro vs jobber vs newer options, what's worth for small entrepreneurs",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r0veq7/housecall_pro_vs_jobber_vs_newer_options_whats/",
      "author": "Rich_Spread_5033",
      "created_utc": "2026-02-10 08:33:07",
      "score": 10,
      "num_comments": 10,
      "upvote_ratio": 0.62,
      "text": "I’ve been testing and researching software options for my small business, a small team of 4, and figured I'd share what I found if it is useful for someone checking different alternatives.\n\nhousecall pro is probably the most well known, honestly it's got everything but that's kind of the problem? like there's so many features I didn't understand half of them, the trial was confusing, basic plan doesn't include quickbooks sync or GPS tracking, you have to pay extra for that stuff, and I kept reading reddit threads about bugs and support being slow. If you're doing high volume residential might be worth it, but for a small team it felt like overkill and the cost didn't make sense.\n\njobber also well known, way cleaner interface, made more sense, scheduling worked great, invoicing was easy, support actually answered my questions fast, but it is not built or home services specifically just service businesses in general, customization is limited, like you can't really change invoice templates much, it is reliable but feels pretty generic and people say once you hit a certain size you outgrow it but it's expensive enough that you'd expect it to scale better.\n\nbizzen is way newer, only heard about it from another mate, it's specifically built for the admin stuff that kills your time, I can create estimates by just talking while I'm driving no add-ons or per-user fees, downside is it doesn't do crew dispatching or project management like the big platforms, it's really just focused on automating admin work, if you need complex scheduling this isn't it, but if you're solo or small team, it makes sense.\n\nSo imo housecall may work for bigger residential operations, jobber is a good option for small to medium teams that want reliable basics and bizzen is for solo or small contractors drowning in admin work, want automation but don't need fancy project management.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1r0veq7/housecall_pro_vs_jobber_vs_newer_options_whats/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4l0qwo",
          "author": "bravelogitex",
          "text": "Start simple. Jobber seems like a good start",
          "score": 1,
          "created_utc": "2026-02-10 08:38:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lzed7",
          "author": "sk1ll111",
          "text": "For me, manually following up on quotes was such a pain but I realized that doing it consistently can get some deals through. It's called QuoteThru and does only this.",
          "score": 1,
          "created_utc": "2026-02-10 13:23:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rtow8",
          "author": "FARHANFREESTYLER",
          "text": "Honestly didn't even know there were other options besides those two, everything I read online was just housecall pro vs jobber comparisons. What's bizzen like day to day, is it actually saving you time or just different work?",
          "score": 1,
          "created_utc": "2026-02-11 09:38:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4sq4ya",
              "author": "Unhappy-Bunch-4594",
              "text": "Checkout FieldCamp, Workiz",
              "score": 1,
              "created_utc": "2026-02-11 13:43:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4v55ce",
              "author": "Rich_Spread_5033",
              "text": "using it for some time now, I'm not spending two hours every evening typing up estimates and chasing customers for responses. It handles most of the back and forth automatically, estimates go out way faster. I still review everything before it goes to customers which takes maybe 10 minutes vs typing from scratch for an hour.",
              "score": 1,
              "created_utc": "2026-02-11 20:43:40",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4we0i9",
              "author": "Chimpugugu",
              "text": "There’s lots of other options, there’s Workiz, Service Fusion, Service Titan and more but we use Clientility for our business. We find it easy to use and affordable compared to other options, the value for price is great and the plans make sense. Lots of these companies trap you with their base plan and you’re forced to end up upgrading and the price is ridiculous and honestly never worth it.",
              "score": 1,
              "created_utc": "2026-02-12 00:36:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4rvss5",
          "author": "Intrepid-Dig9954",
          "text": "thanks for this breakdown, been looking at housecall pro but the pricing structure is confusing as hell, seems like they get you with the base price then nickel and dime you for everything else you actually need.",
          "score": 1,
          "created_utc": "2026-02-11 09:57:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sma0u",
          "author": "Unhappy-Bunch-4594",
          "text": "for a small team of 4 i'd honestly put the most weight on what your crew will actually open every day vs what looks best in a demo.\n\njobber's the safest bet — the scheduling and invoicing just work. the customization limits are real but most 4-person teams don't need crazy custom workflows yet. biggest gripe i hear is expense tracking being locked behind the Grow tier ($267 CAD/mo) and the mobile app feeling a bit basic for field guys.\n\nHCP gets expensive fast — $149/mo essentials for 2+ users and the quickbooks sync being paywalled is rough. if you're already on quickbooks that's a hidden cost you don't see until you're committed.\n\nhaven't tried bizzen personally but if the voice-to-estimate thing works well that's a solid use case for crews that are always driving.\n\none more worth a look if you care about the AI/automation side — FieldCamp does scheduling, dispatch, CRM, and invoicing together with a free tier to start. the AI handles a lot of the grunt work like scheduling by voice and auto-optimizing routes. $39/user/mo for pro.\n\nhonestly at your size the right answer is whichever one your field guys don't hate using. make them test the mobile app for a week before you commit to anything.",
          "score": 1,
          "created_utc": "2026-02-11 13:21:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4u7byv",
          "author": "HarjjotSinghh",
          "text": "too much hype, not enough value - go with simpler tools first.",
          "score": 1,
          "created_utc": "2026-02-11 18:03:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4x17x3",
          "author": "BikeLiftHikeSleep",
          "text": "I used to work for Jobber. If you want I can give you some info if you want to dm. ",
          "score": 1,
          "created_utc": "2026-02-12 02:56:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1ufq4",
      "title": "2 weeks of my worldwide, anonymous question of the day app",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r1ufq4/2_weeks_of_my_worldwide_anonymous_question_of_the/",
      "author": "threeandseven",
      "created_utc": "2026-02-11 11:02:20",
      "score": 9,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "Last year, my wife and I were talking about how boring the internet and our phones are now compared to what it use to be like. We were talking about what was missing, what made it fun. It was that feeling of discovery, of something new every time you \"logged on.\" I thought about this for a while and finally started building a silly fun idea.\n\n  \n**A worldwide, anonymous question of the day app.** If you answer the question, then your postcard gets sent to a random person, and you get a random person's card. Each postcard gets sent out with a stamp of your country.\n\nEvery day, you open the app for a few minutes, collect a new stamp and postcard, read a little about a new culture or perspective, take a few moments to write something, then close the app and forget about it.  Quick, simple, joyful.\n\n  \nI finally launched it **2 weeks ago** on the Apple App Store. Since then, I've had over **500 downloads, 25+ countries participate, a peak day of 87 users**, and since then a fairly consistent 30-50 daily users. The reactions I've gotten from folks have been exactly spot on for the feeling I wanted to create, and the reason I made the app. I've got to read some enlightening and surprising cards and learned about different cultures in the process.\n\nI'm not sure where it will go or where I'll take it yet. I've already put a few UI updates out with more features and fixes. I just want to slowly build the daily active users and find people who really love it.\n\nIf you have an iPhone and want to check it out, DM me for a link!",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1r1ufq4/2_weeks_of_my_worldwide_anonymous_question_of_the/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4s4yj4",
          "author": "trainmindfully",
          "text": "this is the kind of simple internet idea i miss. low pressure, no doomscrolling, just a small daily ritual and then you are done.\n\n500 downloads and 25 countries in two weeks is honestly solid for something this niche. the fact that people are actually writing thoughtful cards is probably the biggest validation you could get.\n\ni really like the one question a day constraint. it keeps it from turning into another endless feed. have you noticed any themes in the answers yet, like certain countries being more reflective or funny?",
          "score": 2,
          "created_utc": "2026-02-11 11:19:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ssycw",
              "author": "threeandseven",
              "text": "Exactly!\n\nI'm impressed with the writing too. I have a minimum of 50 words to send a card, and so far I haven't really seen much mischief around copying/pasting or just typing gibberish to hit the minimum.\n\nRight now there's about 4-5 countries that always have the most respondents, but I think it's too early to pull any trends out from that. I think it very much depends on the prompt.\n\nI am very interested to see if any trends emerge on prompt type (I've broken them down into about 7-8 categories of prompt) or days of the week. I already think I'm noticing a trend for lower participation on Fridays.",
              "score": 2,
              "created_utc": "2026-02-11 13:58:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4t6yzc",
          "author": "Spirited_Manager_831",
          "text": "It's this kind of stuff that was so beautiful in the beginning of internt. Simple stuff, easy routine",
          "score": 2,
          "created_utc": "2026-02-11 15:12:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sonok",
          "author": "dp234523",
          "text": "Ahh sounds just like the internet I miss.   \n  \nAre the questions crowdsourced or are you writing them? I wonder if people would pay knowing their question would be asked the following day.",
          "score": 1,
          "created_utc": "2026-02-11 13:35:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ssjz1",
              "author": "threeandseven",
              "text": "I came up with 7 or 8 \"styles\" of questions (artistic/creative writing, memory, etc.) and then came up with an initial batch, but I ask people to submit them too. Only a couple people have so far.\n\nI think people like the element of surprise every day (what will the question be?). There's also a delicate balance of making it engaging enough that people all over the world will write something somewhat meaningful about.\n\nI like the idea though, I'll think on it, thanks!",
              "score": 2,
              "created_utc": "2026-02-11 13:56:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4stkse",
                  "author": "dp234523",
                  "text": "Very cool idea, what's the link?",
                  "score": 2,
                  "created_utc": "2026-02-11 14:02:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4t20wz",
          "author": "HarjjotSinghh",
          "text": "oh wait so now everyone's actually listening?",
          "score": 1,
          "created_utc": "2026-02-11 14:47:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4t6r0u",
              "author": "threeandseven",
              "text": "Sorry, what do you mean?",
              "score": 1,
              "created_utc": "2026-02-11 15:11:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ta7b7",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-11 15:28:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ta7fq",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r1ufq4/2_weeks_of_my_worldwide_anonymous_question_of_the/o4ta7b7/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-11 15:28:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qz9nue",
      "title": "What actually brings sales? cold outreach, content, or something else?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qz9nue/what_actually_brings_sales_cold_outreach_content/",
      "author": "OkMetal220",
      "created_utc": "2026-02-08 14:01:12",
      "score": 8,
      "num_comments": 44,
      "upvote_ratio": 1.0,
      "text": "Hey! For people selling services (web dev, freelancers, agencies). What’s actually bringing you clients right now?\n\nCold outreach? content? referrals? partnerships?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qz9nue/what_actually_brings_sales_cold_outreach_content/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4chppg",
          "author": "ThreadFinderHQ",
          "text": "Agreed, depends on the industry/ product but: referrals and showing up in communities where your buyers already are. everything else is a distant second early on.\n\ncold outreach works but the conversion rate is brutal and it's soul-crushing when you're doing it solo. content works long-term but you're looking at 6+ months before it compounds into anything meaningful.\n\nthe thing that actually moved the needle for me was just being helpful in specific communities without pitching anything. people check your profile, see what you're building, and reach out. it's slower than cold outreach but the leads are 10x warmer.",
          "score": 3,
          "created_utc": "2026-02-09 00:24:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f1ubu",
              "author": "OkMetal220",
              "text": "Haha thats right, cold outreach is rough solo, and content takes forever to compound. ",
              "score": 1,
              "created_utc": "2026-02-09 11:40:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4cnqcc",
          "author": "alexchen_sj",
          "text": "For me it was cold outreach but done in a very non-spammy way. I would find people complaining about the exact problem I solve, reach out with something specific about their situation, and just ask if they wanted to chat. No pitch in the first message. Conversion was way higher than any content marketing I tried early on.",
          "score": 3,
          "created_utc": "2026-02-09 00:56:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f25sm",
              "author": "OkMetal220",
              "text": "thanks for your reply!!",
              "score": 1,
              "created_utc": "2026-02-09 11:43:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e1yw6",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 3,
          "created_utc": "2026-02-09 06:03:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f20ab",
              "author": "OkMetal220",
              "text": "I also run a content blog, but I’m curious, how long did it take for it to start generating organic traffic? I’ve heard it usually takes a good amount of time.",
              "score": 2,
              "created_utc": "2026-02-09 11:42:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4f2bml",
                  "author": "[deleted]",
                  "text": "[removed]",
                  "score": 2,
                  "created_utc": "2026-02-09 11:44:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4em55i",
          "author": "Vaibhav_codes",
          "text": "Referrals > everything else.  \nContent builds trust.  \nCold outreach only works when it’s hyper targeted.",
          "score": 3,
          "created_utc": "2026-02-09 09:11:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f1w4u",
              "author": "OkMetal220",
              "text": "yes, but referrals are not for ever haha thats the problem",
              "score": 2,
              "created_utc": "2026-02-09 11:41:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4f3c4u",
          "author": "macdaddy0800",
          "text": "Emotions. \n\nFeeling  hungry ? Buy take out? \n\nFeeling insecure or habitually noticing the pantry getting empty or the milk cartoon nearing empty, go grocery shopping. \n\nFeeling generous, why not tip the busker. \n\nFeeling like as a business owner you don't want to hire someone permanently,  because you are feeling unsure about sustainable work, hire a temp. \n\nIt's emotion and feeling, ideally your brand, messaging and distribution need to be appeal to an emotion where the potential customer gets the right message ant the right time.",
          "score": 3,
          "created_utc": "2026-02-09 11:52:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4mbbe9",
              "author": "OkMetal220",
              "text": "sounds good.. thanks",
              "score": 1,
              "created_utc": "2026-02-10 14:28:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4bbgzi",
          "author": "Fat-Programmer-1234",
          "text": "Imagine it would depend on the industry, but I'm keen to find out about this also from people who are currently in the trenches",
          "score": 2,
          "created_utc": "2026-02-08 20:36:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f1peq",
              "author": "OkMetal220",
              "text": "Hey! I’m a freelance web dev, but honestly I don’t think it’s too different across industries (of course, there are always edge cases). Some things change, but the core is the same: create valuable content, engage in communities, and go out and actually talk to people.",
              "score": 2,
              "created_utc": "2026-02-09 11:39:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4hgmil",
                  "author": "Fat-Programmer-1234",
                  "text": "The engage in communities and talking to part is probably where I'm struggling, say most subs have an anti-spam/promotion rule which often get trigger even if I'm genuinely just trying to get some feedback.  \nAnd I've found it hard to go via platforms like Discord because engagement isnt too high.",
                  "score": 1,
                  "created_utc": "2026-02-09 19:25:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4cx3c4",
          "author": "Ecaglar",
          "text": "referrals first if you have any network at all. cold outreach works but yeah the conversion rate is rough early on. the key is finding where people are already complaining about the problem you solve and showing up there consistently",
          "score": 2,
          "created_utc": "2026-02-09 01:50:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f254s",
              "author": "OkMetal220",
              "text": "absolutely, referrals are definitely the easiest starting point if you have any network. I’ve found the same, cold outreach is rough solo, and the real impact comes from consistently showing up where people are already talking about the problem you solve.",
              "score": 1,
              "created_utc": "2026-02-09 11:43:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4dauhy",
          "author": "PiraEcas",
          "text": "at the early phase, outreach",
          "score": 2,
          "created_utc": "2026-02-09 03:01:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f26zw",
              "author": "OkMetal220",
              "text": "and later on?",
              "score": 2,
              "created_utc": "2026-02-09 11:43:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4eqaa9",
          "author": "trainmindfully",
          "text": "it is rarely just one thing. for most people i know it is a mix where one channel does the heavy lifting and the others support it. referrals tend to close best but you cannot force them. content builds trust slowly and compounds if it is consistent. cold outreach still works but only when it is very targeted and personalized, otherwise it burns people out fast. the common thread is clarity. when you are very clear on who you help and what problem you solve, almost any channel works better.",
          "score": 2,
          "created_utc": "2026-02-09 09:53:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f1ij7",
              "author": "OkMetal220",
              "text": "Hey! That’s great to hear! It’s exactly what I’m working on right now with my brand… creating valuable content across different channels to help and connect with people..\n\n ",
              "score": 1,
              "created_utc": "2026-02-09 11:38:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4fu415",
          "author": "Rich-Editor-8165",
          "text": "Ill say  cold outreach brings sales fastest, content builds trust that compounds, and referrals convert best once you have momentum. Early on, outreach pays the bills, content supports it, and referrals show up later if you deliver well.",
          "score": 2,
          "created_utc": "2026-02-09 14:43:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4gjtvj",
              "author": "OkMetal220",
              "text": "and how do you do the cold outreach? by social media or face to face",
              "score": 1,
              "created_utc": "2026-02-09 16:50:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4g1gv2",
          "author": "Intrepid_Boss9449",
          "text": "Cold outreach still works but takes a lot of time and can feel spammy. Content and referrals bring better leads if you build trust first. I use tools like SocListener to help find real sales chances on Reddit and make outreach less annoying.",
          "score": 2,
          "created_utc": "2026-02-09 15:22:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4g2k5y",
              "author": "Wide_Brief3025",
              "text": "Honestly a mix is what works best. Cold outreach can open doors if you personalize it but content and community engagement build trust and tend to attract higher quality leads. If you want to catch the right conversations the moment they're happening, I’ve had good results using ParseStream for real time alerts across forums like Reddit and LinkedIn so you can join in naturally instead of feeling spammy.",
              "score": 2,
              "created_utc": "2026-02-09 15:27:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4g2fqq",
          "author": "aicreds",
          "text": "The channel matters less than the trigger.\n\nCold emails, content, referrals — all of them work if you’re hitting the right attention signal. If you’re not, none of them do.\n\nIn my experience, sales isn’t really about volume. It’s about using the same language your buyer already uses to describe their problem. When someone feels “this person gets it,” cold outreach suddenly doesn’t feel cold.",
          "score": 2,
          "created_utc": "2026-02-09 15:27:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4gk1qp",
              "author": "OkMetal220",
              "text": "right but where to find them?",
              "score": 1,
              "created_utc": "2026-02-09 16:51:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4g5p5r",
          "author": "Rich_Direction_3891",
          "text": "honestly, it’s a mix. cold outreach works if you’re consistent and personal, but referrals and partnerships usually bring higher-quality clients.",
          "score": 2,
          "created_utc": "2026-02-09 15:43:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4mb9hm",
              "author": "OkMetal220",
              "text": "I think its a mix too, thanks",
              "score": 1,
              "created_utc": "2026-02-10 14:28:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4h5kdp",
          "author": "Just-Personality-304",
          "text": "If we should chose any specific from these options, content for sure. ",
          "score": 2,
          "created_utc": "2026-02-09 18:33:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hd59m",
              "author": "OkMetal220",
              "text": "what other option could be?",
              "score": 1,
              "created_utc": "2026-02-09 19:08:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hwr2b",
          "author": "erickrealz",
          "text": "Honestly it depends on where you are in your business. Early stage, cold outreach is king - email and LinkedIn combined will get you meetings fast. A good cold email agency can handle this if you don't wanna burn time on it yourself.\n\nBut long term, referrals are the damn goldmine. Happy clients send you warm leads that close way easier than anything else.\n\nContent's a slow burn but worth it for inbound. I'd stack cold outreach for quick wins while building content and a referral system on the side. that combo is hard to beat.",
          "score": 2,
          "created_utc": "2026-02-09 20:45:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4i6qlz",
              "author": "OkMetal220",
              "text": "thats an excellent answer, thanks...how a good cold email agency does to handle that? do you know something about that?",
              "score": 1,
              "created_utc": "2026-02-09 21:34:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4iwt9v",
          "author": "newuser2110",
          "text": "Cold out reach, but it has to be personable and tailored I’ve worked in that industry before and nothing is worse than spammy messages that you receive all the time that are promted from chat gpt",
          "score": 2,
          "created_utc": "2026-02-09 23:51:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4phkgo",
              "author": "OkMetal220",
              "text": "yeah that sucks man",
              "score": 1,
              "created_utc": "2026-02-10 23:34:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4dk3f6",
          "author": "HarjjotSinghh",
          "text": "i just answered every ad i see with hello, human",
          "score": 1,
          "created_utc": "2026-02-09 03:54:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pak9i",
          "author": "filuKilu",
          "text": "Honestly? Been trying all three and they all kinda suck in their own ways lol. Referrals are amazing WHEN they happen, but it's so passive. Content takes forever to build momentum.\n\n\n\nWhat's actually moving the needle for me lately is cold outreach but with a twist - I stopped just emailing \"hey let's chat\" and started sending a quick, relevant website demo for their business. Like I'll find a local shop with a garbage site, use Thyonix to whip up a modern version in like 5 minutes, and send a Loom walkthrough. Cuts through the noise because you're showing value immediately, not just asking for time.\n\n\n\nIt's still outreach, feels a bit spammy sometimes, but the reply rate is way higher. The key is making it feel like you've already done the work for them.",
          "score": 0,
          "created_utc": "2026-02-10 22:55:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4pi28y",
              "author": "OkMetal220",
              "text": "Yeah, spamming, like what you're doing on every reddit post.",
              "score": 1,
              "created_utc": "2026-02-10 23:37:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qxp0rv",
      "title": "Made $1300 with my SaaS in 28 days. Here's what worked and what didn't",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qxp0rv/made_1300_with_my_saas_in_28_days_heres_what/",
      "author": "whyismail",
      "created_utc": "2026-02-06 18:05:31",
      "score": 8,
      "num_comments": 6,
      "upvote_ratio": 0.83,
      "text": "First UP, I didn't went from idea to $1300 in 28 days.\n\nFor the first three months I didn't knew that you have to market your product too.\n\nI just kept building.\n\nThen when I had 0 users after having a brutally failed PH launch.\n\nI just went down on researching on how apps really grow from \"0\"\n\nWatched endless starter story videos, reddit threads, podcasts, articles and what not.\n\nThen finally formulated a marketing strategy and went all in on it since 1st January.\n\nIt's been a month now since going all in on Brandled and I now have 35 paying users or about $1.3k in MRR\n\nIt's not millions but atleast a proof that my stuff is working.\n\nNow here's what worked:\n\n1. **Building in public to get initial traction:** I got my first users by posting on X (build in public and startup communities). I would post my wins, updates, lessons learned, and the occasional meme. In the beginning you only need a few users and every post/reply gives you a chance to reach someone.\n2. **Warm DMs:** Nope I didn't blasted thousands of cold dms and messages instead I engaged with my ICPs posts and content and then warm dm them asking them to try out my product and give me some feedback (this was the biggest growth lever)\n3. **Word of mouth:** I always spend most of my time improving the product. My goal is to surprise users with how good the product is, and that naturally leads to them recommending the product to their friends. More than 1/3 of my paying customers come from word of mouth.\n4. **SEO:** I went into SEO from day 1, not targeting broad keywords and instead focussed on Bottom of Funnel keywords (alternatives pages, reviews pages, comparision pages), it basically allows you to steal traffic from your competitors\n5. **Removing all formatting from my emails:** I thought emails that use company branding felt impersonal and that must impact how many people actually read them. After removing all formatting from my emails my open rate almost doubled. Huge win.\n\n**What didn’t work:**\n\n**1. Building free tools:** The tools that received most traffic are usually pretty generic (posts downloader, video extractor etc.) so the audience is pretty cold and it's almost impossible to convert them\n\n**2. Affiliate system:** I’ve had an affiliate system live for months now and I get a ton of applications but it’s extremely rare that an affiliate will actually follow through on their plans. 99% get 0 sign ups.\n\n**3. Building features no one wants (obviously):** I’ve wasted a few weeks here and there when I built out features that no one really wanted. I strongly recommend you to talk to your users and really try to understand them before building out new features.\n\nNext steps:\n\nDoing more of what works. I’m not going to try any new marketing channels until I’m doing my current ones really well. And I will continue spending most of my time improving product (can’t stress how important this has been).\n\nAlso working on a big update but won’t talk about that yet.\n\nBest of luck founders!",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qxp0rv/made_1300_with_my_saas_in_28_days_heres_what/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o3ziupd",
          "author": "Deep_Blood_6532",
          "text": "Great tips on Warm DM's, word of mouth & SEO.   \n  \nI went for high-intent keywords on one of my products, as in, people searching for a very specific solution and made a couple sales.  \n  \nI think i messed a couple opportunities up by following the numbers game and using automation tools for that. Now i've just got a shit load of messages I've been ghosted on.\n\nNice to read your experience!",
          "score": 1,
          "created_utc": "2026-02-06 22:54:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o410ak6",
          "author": "Ecaglar",
          "text": "the warm dms point is underrated. most people blast cold messages and wonder why they dont work. engaging first then reaching out feels way less spammy and actually gets responses. the affiliate observation is accurate too - everyone wants to be an affiliate, almost nobody follows through",
          "score": 1,
          "created_utc": "2026-02-07 04:21:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o451ebh",
          "author": "BunchRoyal1929",
          "text": "what's the name of your company Ismail? I could not find anything in the t&c or privacy policy section. who am I contracting with? \n\nbtw - a great tool and site built there. more power to you. 🚀",
          "score": 1,
          "created_utc": "2026-02-07 20:31:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3y2zo9",
          "author": "Wide_Brief3025",
          "text": "Focusing on warm DMs and building in public was a smart move. If you want to scale that approach and catch even more live conversations with your target users, I've found ParseStream really useful. It sends instant alerts when relevant discussions pop up on platforms like Reddit or LinkedIn so you never miss a good engagement opportunity.",
          "score": 1,
          "created_utc": "2026-02-06 18:35:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yweyi",
              "author": "Otherwise_Reveal3977",
              "text": "damn, this is exactly what i need! thanks dude!  \nSecond best discovery for me right after Shazam if it works as i intend it to!",
              "score": 0,
              "created_utc": "2026-02-06 21:00:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r2tt3i",
      "title": "How do you decide what to work on first in the morning?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r2tt3i/how_do_you_decide_what_to_work_on_first_in_the/",
      "author": "Ambitious_Chance_518",
      "created_utc": "2026-02-12 13:45:09",
      "score": 7,
      "num_comments": 15,
      "upvote_ratio": 1.0,
      "text": " I work from home as a freelance marketer, and one thing I noticed is that I used to lose 30–60 minutes every morning just deciding what to do first.\n\nWhat helped me recently was forcing myself to pick only 3 tasks and blocking time for them before I open email or messages. It sounds simple, but it reduced a lot of decision fatigue.\n\nCurious how others handle this:\n\n* Do you plan the night before?  \n* Do you use a system or just go by priority?  \n\nWhat’s worked best for you?  \n",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1r2tt3i/how_do_you_decide_what_to_work_on_first_in_the/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4zcqtp",
          "author": "MarcoMusings",
          "text": "This gets easier with age, as you learn what actually needs doing first. Good rule, get the job you hate done immediately. It’ll just drain your energy. \n\nPrioritisation is a skill that can be taught, I’ve seen it. \n\nWhen I was more on the ground of actual marketing, couple of emails to get the juices flowing, hardest creative task first, then batch up a burst of little things (as those are often the easiest to ignore). \n\nReally you should only be spending 5-10 mins planning your day. Wish I could spend an hour on it! 😂",
          "score": 3,
          "created_utc": "2026-02-12 14:01:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4zenmm",
              "author": "Ambitious_Chance_518",
              "text": "Thanks! I do have a 10-minute planning template I use to help me with these. I think spending more than 10 minutes deciding on what to do, is already a waste of time. haha\n\nPrioritization really is the problem when you feel like every task is as much as important as the others.",
              "score": 2,
              "created_utc": "2026-02-12 14:11:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4zfvn2",
                  "author": "MarcoMusings",
                  "text": "Sounds like you need to work on that prioritisation - there are loads of ways to strengthen that skill. Happy to chat about it on more depth if you want to.",
                  "score": 1,
                  "created_utc": "2026-02-12 14:18:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4zqsiu",
          "author": "drteq",
          "text": "Before I get into work mode I sit down for 5 minutes chill, then get a notepad and review everything I wanted to get done the day before, write down everything I need to get done today, capture new ideas - then put a plan of attack together.  I try to see it as a guide rather than a task list.  Takes 10 minutes, makes my day feel intentional and I rarely lose track of anything.  The priorities tend to reveal themselves",
          "score": 2,
          "created_utc": "2026-02-12 15:14:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zdzfp",
          "author": "AKrissos",
          "text": "I always plan my months and weeks and then break it down by day - each day I write out my big 3 - the 3 most important tasks I need to accomplish that have the biggest effect on my business - then I do them. Each evening I already know what I need to do the next day - that is how I finish off my work day - write the next day 3 to-dos. Until now it's worked pretty well and my adhd brain can cope with 3 things. if I do them and I have time, I do other things but at least the needle moovers are set",
          "score": 1,
          "created_utc": "2026-02-12 14:07:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zgjee",
          "author": "BlingAssassin",
          "text": "Simple.\n\nDo the most tedious and the most heavy lifting work initially and that you absolutely hate to execute",
          "score": 1,
          "created_utc": "2026-02-12 14:21:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zstq9",
          "author": "kubrador",
          "text": "just make a list the night before and don't let yourself have options in the morning. your brain's already fried before coffee so why make it choose anything harder than which mug to use.",
          "score": 1,
          "created_utc": "2026-02-12 15:24:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50hzmw",
          "author": "Ok-Leadership-9748",
          "text": "I sit in silence before I touch anything. The right thing to do always surfaces when I stop trying to control the morning. Took me years to trust that instead of fighting it with frameworks. The moment I stopped forcing structure and started listening, decision fatigue just disappeared. Not everyone’s wired this way but if your gut already knows the answer and you’re spending 30 minutes overriding it with logic - that’s the actual problem.",
          "score": 1,
          "created_utc": "2026-02-12 17:22:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50kkws",
          "author": "Tiny-Clue-136",
          "text": "The best way to execute is with a plan. Just like with life, it's best if not planned from one day to the next. Have a high level 90 day plan, 60 day, 30 day, and then the day-to-day clicks into place as you chase those goals.",
          "score": 1,
          "created_utc": "2026-02-12 17:34:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50q835",
          "author": "techside_notes",
          "text": "I plan the night before, but very lightly.\n\nIf I try to fully map the next day, I end up overengineering it. Now I just write down one “needle mover” for tomorrow. Not three. Just the one thing that would make the day feel meaningful if everything else fell apart.\n\nIn the morning I start with that before opening anything reactive. Email and messages can expand forever, so I treat them as a second shift.\n\nWhat’s helped most is removing the decision in the morning. Waking up and already knowing the first move saves more mental energy than any fancy system I’ve tried.",
          "score": 1,
          "created_utc": "2026-02-12 18:00:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o513jzo",
          "author": "HarjjotSinghh",
          "text": "oh god i'd rather fight a bear than choose just three tasks",
          "score": 1,
          "created_utc": "2026-02-12 19:02:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52ctwg",
          "author": "LMunchkin",
          "text": "In the evening before finishing the job I make a plan for the next day. Usually the hardest or the most needed tasks go first. First thing in the morning: check emails and slack channels for any emergency.  Answer on any email that would help others to continue working so they are not blocked by me. If there are no any emergencies then I stick to the plan I’ve made yesterday.",
          "score": 1,
          "created_utc": "2026-02-12 22:41:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53q6lm",
          "author": "h____",
          "text": "I look at yesterday's log and pick from there. Planning the night before never worked for me.",
          "score": 1,
          "created_utc": "2026-02-13 03:33:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r26m62",
      "title": "If you had to restart from zero today with all your current knowledge, what would you do differently in your first 30 days?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r26m62/if_you_had_to_restart_from_zero_today_with_all/",
      "author": "Eva_Watermelon",
      "created_utc": "2026-02-11 19:14:14",
      "score": 7,
      "num_comments": 23,
      "upvote_ratio": 0.82,
      "text": "# \n\nI’m curious about this from people who have actually built something.\n\nIf you had to start completely from scratch today — no network, no audience, no product — but you kept all your experience:\n\nWhat would your first 30 days look like?\n\nWould you:  \n• build first?  \n• validate first?  \n• grow audience first?  \n• start selling immediately?  \n• document publicly?\n\nI’m especially interested in tactical changes, not motivational ones.\n\nWhat would you actually do differently?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1r26m62/if_you_had_to_restart_from_zero_today_with_all/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4w1evn",
          "author": "m2e_chris",
          "text": "sell first. everything else is procrastination disguised as progress.\n\nfirst two weeks I'd talk to 20 people in whatever niche I'm targeting. not surveys, actual conversations. figure out what they're already paying money to solve badly. then build the simplest possible version of a better solution, even if it's half manual behind the scenes.\n\nlast time I started something from scratch I spent way too long building before anyone had given me money. the version that actually worked was the one where I pre-sold it, then scrambled to deliver.",
          "score": 3,
          "created_utc": "2026-02-11 23:24:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wvluu",
          "author": "Ecaglar",
          "text": "validate before building. every time.\n\n  \nfirst 30 days id spend talking to people and preselling. not \"would you use this?\" - thats useless - but \"heres a landing page, pay me $50 and ill build it for you in 2 weeks.\" if nobody pays, the idea is dead and i saved myself months of building the wrong thing.\n\n  \nthe audience-first approach works too but its slower. unless you already have distribution, building audience takes 6-12 months before it compounds. i dont have that patience anymore",
          "score": 2,
          "created_utc": "2026-02-12 02:22:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4z5wpa",
              "author": "Eva_Watermelon",
              "text": "The “pay $50 or it’s dead” rule is brutal but clean.\n\nHave you ever had an idea where people wouldn’t prepay but later converted once the product existed?\n\nOr do you see lack of prepayment as almost always a reliable kill signal?",
              "score": 1,
              "created_utc": "2026-02-12 13:22:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xge5p",
          "author": "harv_89",
          "text": "Delay quitting my job to start a business until the new business income covers my living expenses, but I never seem to learn haha.",
          "score": 2,
          "created_utc": "2026-02-12 04:37:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4uz8j9",
          "author": "MarcoMusings",
          "text": "Learn a trade - world’s always going to need plumbers, electricians and builders. 😭\n\nSeriously though, sort of. I’d worry less about the journey. There’s always ups and downs. Worrying just burns energy. \n\nI’d definitely build in public too, though 30 years ago you’d have probably had a paper newsletter at best.",
          "score": 1,
          "created_utc": "2026-02-11 20:14:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4z5sqx",
              "author": "Eva_Watermelon",
              "text": "The trade point is interesting actually. Physical skills are the ultimate “non-platform dependent” income.\n\nAnd I agree on worrying less — I think early founders burn a lot of energy trying to control uncertainty instead of shortening feedback loops.\n\nIf you were starting today, would you still build in public even before revenue, or only once there’s traction?",
              "score": 1,
              "created_utc": "2026-02-12 13:21:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4zajbd",
                  "author": "MarcoMusings",
                  "text": "I’d share every part of the journey. People love following others’ journeys and it’ll help you worry less about what people think.",
                  "score": 1,
                  "created_utc": "2026-02-12 13:48:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4x126k",
          "author": "aerobase-app",
          "text": "Day 1-7: I'd pick a niche where I've personally felt the pain, then spend the week doing \"problem interviews\" — not pitching anything, just listening. My biggest mistake early on was solving problems I'd only observed, not experienced.\n\nDay 8-14: Build the smallest thing that proves the problem is urgent. Not an MVP — a \"demo of the solution\" I could show people. I've learned that showing beats describing every time.\n\nDay 15-21: Get 3 people to pay for it before building the real thing. Not \"interested\" — actually pay. If I can't get 3 people to pay in a week, the problem isn't painful enough.\n\nDay 22-30: Build v1 for those 3 paying customers, staying in constant contact. They become my design partners and case studies.\n\nThe pattern I missed early: I thought validation → build → sell was the sequence. It's actually: understand → promise → sell → build. Selling before building feels scary but it saves you from the six-month graveyard of products nobody wants.",
          "score": 1,
          "created_utc": "2026-02-12 02:55:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4z5yy2",
              "author": "Eva_Watermelon",
              "text": "“Understand → promise → sell → build” is a powerful reframing.\n\nDid you find that selling before building changed how you scoped v1?\n\nI imagine once money is involved, scope discipline becomes much easier.",
              "score": 1,
              "created_utc": "2026-02-12 13:22:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xu1zr",
          "author": "ArmOk3290",
          "text": "My 30-day play would flip the order most people use. Week 1 is purely operational foundation, not discovery. Set up the business entity, banking, accounting, and the simplest legal agreements you can. Everyone skips this and it creates drag later.\n\nWeek 2-3 is dual-track: presell to 10 people while simultaneously building a landing page and getting waitlist signups. Not surveys, actual intent signals. If presell doesn't work but waitlist does, you've got data on what to build. If neither works, you've got information that saves you months.\n\nWeek 4 is the pivot point. By now you know if you're chasing something people want or just something interesting to you. The tactical difference now is whether you go deep on one paying customer or iterate based on waitlist data. Both paths are valid but they're very different businesses.\n\n",
          "score": 1,
          "created_utc": "2026-02-12 06:27:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4z64dx",
              "author": "Eva_Watermelon",
              "text": "Interesting take starting with ops first.\n\nDo you feel setting up the entity/accounting early increases commitment, or just reduces future friction?\n\nI’ve seen founders delay that until revenue — but I can see the drag you’re talking about.",
              "score": 1,
              "created_utc": "2026-02-12 13:23:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xyfgk",
          "author": "Vision--SuperAI",
          "text": "I wouldn’t try to invent something new. I’d look for an already proven idea where people are clearly paying $19 to $99 per month. Strong competition is actually a good sign. It means demand is validated.\n\nThen I’d study the top 5 players and figure out where I can genuinely outperform them. There are really only three levers: better pricing, better experience, or better quality and features.\n\nPricing is the weakest long term advantage in my opinion. It’s the easiest to copy and the hardest to defend. I would avoid trying to win by being the cheapest.\n\nWhen I built my AI fashion photoshoot app, PixUp AI, the market was already crowded. The edge wasn’t price. It was focusing heavily on user experience and making sure the output quality was consistently strong. That’s what actually converts and retains.\n\nSo my first 30 days would look like this: pick a validated niche, analyze competitors deeply, identify one real edge, build only the core feature that delivers that edge, and start charging immediately. ",
          "score": 1,
          "created_utc": "2026-02-12 07:06:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4z661r",
              "author": "Eva_Watermelon",
              "text": "Strong point about competition being validation.\n\nWhen you analyzed competitors, what signals told you there was still room? Reviews? Churn complaints? Feature gaps?\n\nI think a lot of founders underestimate how much insight is hidden in competitor friction.",
              "score": 1,
              "created_utc": "2026-02-12 13:23:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ymaep",
          "author": "indexintuition",
          "text": "i would validate way smaller and way faster than i did the first time. when i started, i spent weeks tweaking things behind the scenes because i was scared to look unprepared, and honestly it was mostly procrastination in disguise. now i’d pick one very specific problem, write up a simple outline or offer in a day or two, and talk to real humans about it immediately. not “grow an audience” in a broad sense, just have messy conversations and see what people actually react to. i’d also limit my tools from day one because juggling platforms drained so much mental energy. first 30 days would basically be: clarify one tiny outcome, pre-sell or soft-sell it to validate demand, deliver manually if needed, and only automate after money or real commitment shows up.",
          "score": 1,
          "created_utc": "2026-02-12 10:57:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4z67di",
              "author": "Eva_Watermelon",
              "text": "“Procrastination disguised as preparation” hits hard.\n\nWhen you say you’d pick one tiny outcome — how small are we talking?\n\nSomething deliverable in a week? A day? I think people struggle with defining “small enough.”",
              "score": 1,
              "created_utc": "2026-02-12 13:24:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4z9rhe",
          "author": "Rich-Editor-8165",
          "text": "I will  honestly spend the first 30 days talking to at least 30 real buyers before building anything, pre-sell the solution, and only build once money or strong intent shows up. No audience building, no polishing, no branding. Just validate pain, close small deals, then iterate fast around what people actually pay for.",
          "score": 1,
          "created_utc": "2026-02-12 13:44:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zw8qv",
          "author": "Ok_Tart5733",
          "text": "I’d validate first, 100%. Talk to as many potential customers as possible before building anything. I’ve learned the hard way that building without real demand is just expensive guessing.",
          "score": 1,
          "created_utc": "2026-02-12 15:40:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51l6mc",
          "author": "Wise-Trouble-653",
          "text": "I’d sell first.\n\nNot in a hype way. In a “I refuse to build in the dark again” way.\n\nIf I had zero audience and zero product but kept my experience, the first 30 days would look like this:\n\nWeek 1 I’d pick a very specific problem for a very specific person. Not a niche. A situation. Something painful, expensive, and already happening. Then I’d talk to 10–20 people in that world. No pitching. Just listening for patterns, language, urgency.\n\nWeek 2 I’d design a simple, high-touch offer around what I heard. Probably 1:1. No course. No funnel. No branding. Just a clear outcome and a defined timeframe. Then I’d start selling it directly through conversations.\n\nWeek 3 and 4 I’d refine based on objections and actual delivery. Document insights publicly while I’m doing the work, not before. Content would be reflections from real conversations, not theory.\n\nAudience growth would be secondary. Proof would come first.\n\nThe biggest tactical shift? I wouldn’t spend a single day building assets before validating willingness to pay.\n\nMost people delay selling because they want confidence. But confidence comes from revenue, not preparation.\n\nIf you had to bet on one lever, conversations or content, which would move you faster right now?",
          "score": 1,
          "created_utc": "2026-02-12 20:27:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52au8d",
          "author": "Icy-Pen3656",
          "text": "I’d zero in on talking to real people early and knowing what traction means for me before I build much. That will cut out a lot of wasted time and guesswork.",
          "score": 1,
          "created_utc": "2026-02-12 22:30:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52lxvz",
          "author": "chris_tannucilli",
          "text": "validating is number 1, but in general it would be to pay less attention to nonsense like the company name, logo, color scheme etc. I could've spent all that time and energy focused on things that are ten times more important. I let vanity take over my field of view for too long, over estimating the consequences of those things.",
          "score": 1,
          "created_utc": "2026-02-12 23:30:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0cfff",
      "title": "Winning 40% of disputes feels like failing at business",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1r0cfff/winning_40_of_disputes_feels_like_failing_at/",
      "author": "arrowheadman221",
      "created_utc": "2026-02-09 18:37:46",
      "score": 7,
      "num_comments": 11,
      "upvote_ratio": 0.82,
      "text": "Been tracking my chargeback win rate and it's sitting at 38%. I respond to every single one with detailed evidence, tracking, communication logs, everything. Still lose more than I win. Had someone dispute a charge claiming fraud but they used the same email and shipping address that's been on file for their previous three orders with us. Submitted the order history. Lost anyway. I'm spending roughly eight hours a week on this and my chargeback rate is 0.66%. Not critical yet but trending wrong. Starting to think there's something fundamentally different about how winning merchants handle these that I'm missing.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1r0cfff/winning_40_of_disputes_feels_like_failing_at/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o4hiyvp",
          "author": "PresentShine8249",
          "text": "I have literally never won a chargeback",
          "score": 3,
          "created_utc": "2026-02-09 19:36:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hlnu2",
              "author": "arrowheadman221",
              "text": "damn, sorry",
              "score": 1,
              "created_utc": "2026-02-09 19:49:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4i9tjz",
          "author": "Pedro_Carvalho09",
          "text": "Which platform? shopify?",
          "score": 2,
          "created_utc": "2026-02-09 21:50:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4iavhp",
              "author": "arrowheadman221",
              "text": "Yes",
              "score": 2,
              "created_utc": "2026-02-09 21:55:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hlbhw",
          "author": "funkopopruler",
          "text": "38% is actually decent, most merchants sit around 20-30%. Your evidence sounds solid but timing and formatting matter more than you think. Banks want specific data points in exact formats. chargeflow automates this and hits 85%+ win rates because it knows exactly what each card network wants to see",
          "score": 1,
          "created_utc": "2026-02-09 19:48:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hlpkq",
              "author": "arrowheadman221",
              "text": "very insightful",
              "score": 1,
              "created_utc": "2026-02-09 19:50:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ip15c",
          "author": "Ecaglar",
          "text": "38% is actually better than most tbh. the card networks have their own playbook and most merchants just submit evidence hoping it sticks. the formatting and timing stuff matters more than the actual facts which is frustrating but thats how it works",
          "score": 1,
          "created_utc": "2026-02-09 23:08:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ln2fz",
          "author": "HarjjotSinghh",
          "text": "proof is just another word for boring - good luck convincing fraudsters.",
          "score": 1,
          "created_utc": "2026-02-10 12:00:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i9cem",
          "author": "adayjimnz28",
          "text": "Get chargeflow, automates chargeback disputes and actually increases your chances of winning",
          "score": 1,
          "created_utc": "2026-02-09 21:48:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4iaurc",
              "author": "arrowheadman221",
              "text": "Alright",
              "score": 1,
              "created_utc": "2026-02-09 21:55:40",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4j85db",
              "author": "-BurnAfterPosting-",
              "text": "What does it do to increase your chances of winning?",
              "score": 1,
              "created_utc": "2026-02-10 00:55:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}