{
  "metadata": {
    "last_updated": "2026-01-18 16:49:53",
    "time_filter": "week",
    "subreddit": "EntrepreneurRideAlong",
    "total_items": 20,
    "total_comments": 235,
    "file_size_bytes": 232859
  },
  "items": [
    {
      "id": "1qc3jtd",
      "title": "I got \"rich\" by \"accident\" (coded apps, they blew up, made money). Now AI made them useless and I am lost.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qc3jtd/i_got_rich_by_accident_coded_apps_they_blew_up/",
      "author": "dpwdpw",
      "created_utc": "2026-01-13 21:13:43",
      "score": 363,
      "num_comments": 135,
      "upvote_ratio": 0.88,
      "text": "Hi everyone,\n\nI'm a fullstack software engineer. (htm, css, js, react js, node js). I graduated in computer science and did a few coding bootcamps.  \n  \nI landed a job in 2016 as a dev, I quit in 2018 to try the entrepreneur life. I tried many different businesses ideas, more than 5, everything failed. I'd make ends meet by freelancing Shopify projects and fixing small bugs. I met a lot of nice (and rich) people through this and learned a lot.\n\nWith everything I was learning, I'd always code Shopify apps/chrome extensions with the genuine intent of helping people out. My customers would complain about X, I'd make an app to fix X. I wasn't thinking too much about money, my goal was to make bank by selling products, not apps. \n\nFast forward to 2020. One of the apps blew up almost overnight. I coded a few others based on popular complaints and, in a matter of months, I was profiting $200\\~ USD daily, passively. Some days more, some days less. I could still work on projects and had this nice cushion to support me. \n\nFast-forward to 2026, now I make $0 and I'm going to close my business.\n\nPardon my arrogance, but I'm an excellent programmer. The thing is that there is no market looking for what was once valuable, and I don't really know what to do. Nowadays, being someone with good network/connections is way more valuable than being a top notch programmer.\n\nI invested and saved a lot, so I'm not in a dangerous position (yet), but honestly it's a weird time.\n\nAnyone in a similar position?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qc3jtd/i_got_rich_by_accident_coded_apps_they_blew_up/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzf9imf",
          "author": "Rough-Kaleidoscope67",
          "text": "Similar-ish position here, now building in the AI space, it's sort of adapt or die and I think connections have always been more important than raw talent tbch",
          "score": 136,
          "created_utc": "2026-01-13 21:20:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfpr2m",
              "author": "Fuzzy-Valuable-1774",
              "text": "What are you building in the AI space?",
              "score": 4,
              "created_utc": "2026-01-13 22:36:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzfrbg3",
                  "author": "Rough-Kaleidoscope67",
                  "text": "Trying to build an AI website builder specifically for small business owners, where the sites don't look like AI slop.  There is a lot of imo \"good handholding\" so the information that should be on the site is there (basically info wizard (as much prefilled as possible -> use AI to generate brand styles based on analysis -> generate one pager with all important info in the chosen brand style). Well, that's it in a nutshell, hard to fuck up for small business owners and still unique-ish and on brand.",
                  "score": 17,
                  "created_utc": "2026-01-13 22:44:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzo4gnz",
              "author": "GuiltyImportance4763",
              "text": "They compliment each other... connections alone is not enough.",
              "score": 1,
              "created_utc": "2026-01-15 03:56:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzzhjei",
              "author": "Tight-Preference-823",
              "text": "I completely agree that connections are key. I've found that attending industry events and joining online communities has helped me stay up-to-date with the latest trends and technologies. Have you found any particular resources or networks that have been helpful in your transition to the AI space?",
              "score": 1,
              "created_utc": "2026-01-16 20:20:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfw51c",
          "author": "SIGNANDSELFIEFRAMES",
          "text": "Ya, AI is taking a lot away\n\nI will give one example. when I had something go wrong on my Shopify website, I would go pay a coder up to $150 for a 1 day fix.\n\nThe last 3 problems I had, ChatGPT went into detail, looked at the code, and solved them for me. I saved a lot of $$. I went into the code and fixed the issue.",
          "score": 57,
          "created_utc": "2026-01-13 23:08:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfyxsh",
              "author": "phatdoof",
              "text": "How did you upload your whole site to ChatPT or did you just give them the link?",
              "score": 8,
              "created_utc": "2026-01-13 23:23:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzgbsbg",
                  "author": "SIGNANDSELFIEFRAMES",
                  "text": "When I described the issue and told it my theme (Impulse), it told me where to go in my liquid code. I then went to the section and copied and pasted my entire code of that section into Chat GPT. It told me step by step what to do.\n\nIt just writes me code and tells me to copy and paste it.\n\n  \nIt will also accept a screenshot of the issue. My last issue was that I had variants and it kept defaulting to the first variant when people would go to their cart.\n\nI have even used Chat GPT to code me add ons and stuff to throw into code to use with my theme. I love it lol.\n\nI use Chatgpt for this and I use it to make photoshop scripts for me to speed the sh\\*\\* out of my process for my small business where I do repetitive tasks.\n\nI actually learned a lot about Shopify Liquid. Instead of just doing what it tells me, I then ask it what sections of the code means and does. I just learn at the same time for fun.",
                  "score": 29,
                  "created_utc": "2026-01-14 00:33:02",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzkxadk",
                  "author": "enqvistx",
                  "text": "You use cursor.com ideally.",
                  "score": 1,
                  "created_utc": "2026-01-14 18:12:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzgsdqd",
              "author": "Zestyclose-Sink6770",
              "text": "I used to pay 5$ for a 3 line CSS fix 😂",
              "score": 3,
              "created_utc": "2026-01-14 02:06:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzg2mzt",
          "author": "k_rocker",
          "text": "Being an excellent programmer is great if you work for someone who needs an excellent programmer. \n\nYou need to switch that mindset to fixer, doer, entrepreneur. \n\nFixing problems gets you paid - even if that problem is taking away someone’s boredom for 10 minutes on a train journey. \n\nFind a problem, find a solution. But at least we won’t see you in the subs saying “I’ve got a great idea but need a technical co-founder”. \n\nGood luck on the next one 👌🏻",
          "score": 17,
          "created_utc": "2026-01-13 23:43:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfilkx",
          "author": "ahgoodday",
          "text": "Did you invest your money?\n\nIf you kept working while earning $6k/mo, I hope you did invest at least $3k/mo \n\nBy the way, it was \"easier\" back then but in a different way. Today is still easy, but the world is evolving fast and our brains must keep track of these changes : maybe you don't see anything valuable because you're still wired the same way you were before 2020?\n\nPeople dumber than you are managing to make a lot of money.\n\nJust a hint : we feel like everything's been invented already and it's not worth the effort to build anything because a bigger company already did it. But don't underestimate the number of people that get lost in these big tools. Quite often, they just want a simple tool that fulfills a simple task : ask people IRL working in different industries what their problems are, see if a giant already does it in his 360-AI-powered-all-in-one SaaS, and just code a simple tool based on this single feature (or a couple of features)",
          "score": 26,
          "created_utc": "2026-01-13 22:01:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfswea",
              "author": "dpwdpw",
              "text": "Yes.\n\nPeople smarter or dumber may be making  more or less money, but in the end, I don't see how it's pragmatically relevant. If they are, unless we meet and they teach me something, it's pointless.\n\nI appreciate your tips",
              "score": 7,
              "created_utc": "2026-01-13 22:52:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzfuaf4",
                  "author": "Big_Insurance_2509",
                  "text": "Where are you from buddy?",
                  "score": 1,
                  "created_utc": "2026-01-13 22:59:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzfxm9k",
          "author": "LayyyedBack",
          "text": "If you think about what you did, you were solving real problems businesses were having when no one else was solving them. A company (Shopify) was providing a product to customers, but it was not exactly meeting their needs. So you solved a real problem.\n\nYou say you were developing apps, and I say you were solving problems.\n\nSo... what are the new problems people are having? Maybe start by reaching out to these customers you were contracting for in the past and asking them, what is your biggest problem right now? Or what problem are you having that will help you make more money if it's solved?\n\nI say start by asking.",
          "score": 8,
          "created_utc": "2026-01-13 23:16:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhr8dk",
              "author": "adamb0mbNZ",
              "text": "100% this. At the end of the day, the guy is solving a problem that people will pay for. AI didn't kill it, it just made problem solving more democratized for non-coders. There are still a ton of problems out there that people will pay to have fixed. It's a case of talking to people and finding out what they are, then build the solution",
              "score": 3,
              "created_utc": "2026-01-14 05:48:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfh21w",
          "author": "Old-Scarcity7777",
          "text": "What about joining someone as technical help to learn new skills and grow?",
          "score": 4,
          "created_utc": "2026-01-13 21:54:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzh7sgw",
          "author": "elemist",
          "text": "If you stop putting in the effort then naturally things will taper off. You'll never be able to build something once and live off it in perpetuity. \n\nThink about similar things - an artist records some songs. They may blow up and earn them a lot of money for a few months, but then it tapers off and will continue on a downward trajectory.\n\nIf you're constantly pumping out new stuff, that will likely slow the trajectory as the older songs still will get listens.\n\nThe thing is to use success in one thing to launch into the next big thing and hopefully find success there. Sure Shopify apps/extensions may no longer be a money maker, but think laterally - is there another platform that is crying out for the same thing?\n\nIf your programming skills are as good as you say, then you should easily be able to pivot to another marketplace. It's just a matter of identifying the gap in the market.",
          "score": 3,
          "created_utc": "2026-01-14 03:34:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfpgj0",
          "author": "Sketaverse",
          "text": "Was chatting to someone earlier today and we concluded that 80% of SaaS will soon be dead. That’s actually terrifying. Everything is getting wrecked. \n\nI think there will be a financial tidal wave hitting society in 2026 that people are just not at all ready for.\n\nClaude CoWork alone is gonna fucking rip. \n\nThe only option as I see it is just go all in on this new stack / workflow and get on the right side of the fence (98:2)",
          "score": 6,
          "created_utc": "2026-01-13 22:34:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfqmv5",
              "author": "dpwdpw",
              "text": "what do you mean by Claude cowork ripping?",
              "score": 1,
              "created_utc": "2026-01-13 22:40:35",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o06o2n1",
              "author": "dhgdgewsuysshh",
              "text": "Yeah cos everyone will stop doing their business and will start building and maintaining 100 internal saas, and it will be cheaper than a guy who does the same saas and has exooof scale. Bro what are you talking about",
              "score": 1,
              "created_utc": "2026-01-17 22:23:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfq83j",
          "author": "Free_Tennis7754",
          "text": "Create a blue ocean in a non-ai space with a unique offer. ",
          "score": 5,
          "created_utc": "2026-01-13 22:38:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfxyth",
              "author": "[deleted]",
              "text": "[deleted]",
              "score": 1,
              "created_utc": "2026-01-13 23:18:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzfz7du",
                  "author": "Free_Tennis7754",
                  "text": "Pick a boring niche that does not need AI and niche down.\n\nBlue ocean = Niche down \n\nThink keywords. \n\nExample:\n\n**expense splitter** \\- broad kw - red sea of blood (tons of competitors, easy to vibe code)\n\nvs\n\n**expense splitter for touring musicians splitting gas, hotels, and merch costs mid-tour** = long tail kw - blue ocean (because no one else is selling in that sub-niche and no one will be vibe coding it. And if they do - you pivot)",
                  "score": 10,
                  "created_utc": "2026-01-13 23:25:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzfqrvf",
          "author": "Relative-Tourist8475",
          "text": "6k a month is not « rich ». You made some money, congrats. Now time to get back in the race. Can you replicate anything you did for your initial success? And scale it to let’s say 10x what you did? Can you identify any pattern at all?",
          "score": 6,
          "created_utc": "2026-01-13 22:41:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzft6ag",
              "author": "mizmaclean",
              "text": "Clearly that’s why he put it in quotation marks. To many outside of the US, it’s in fact quite rich.",
              "score": 10,
              "created_utc": "2026-01-13 22:53:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzgddzq",
              "author": "redcoatwright",
              "text": "I think depends where they are? 6k a month passively in some countries would be awesome.\n\nIn the US they could have made at least double if not 2.5x that as a mid level and 3x as a senior/principle",
              "score": 2,
              "created_utc": "2026-01-14 00:41:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzgk47q",
          "author": "Nimora9",
          "text": "I know that it feels bad, but that is the basics of all business.  \n\nEven major companies have their income drop to 0 and every company and entrepreneur is trying to find new ideas and new ways to keep the income coming in.  \n\nThe most important thing to remember is that you figured it out once before and you will figure out again. Just trust yourself!",
          "score": 2,
          "created_utc": "2026-01-14 01:19:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhud6k",
          "author": "Reaper73",
          "text": "Do you have any type of customer list?\n\n\nIf yes, organize them by total order value. Then email the top 10(?) people saying you're the author of x, y and z apps. Thank them for their patronage and then ask them if there is any other software they're looking for. ",
          "score": 2,
          "created_utc": "2026-01-14 06:14:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxbc6e",
          "author": "Negative-Ad-7993",
          "text": "Best of luck to you.  You did nothing wrong, but the world beneath you has shifted.  Absolutely certain you will find firm footing again.\n\nYou already did what most cannot do.  You found a need in the market and you created an app to satisfy that need,  this places you in top 10% of very talented developers who can code but cannot solve real world problems.\n\nThe advantage for your going forward is that you can replicate what you did, using AI and do it much faster.  You can build 5 apps in the same time it took you to build one.  Even if 4 fail, you still have one new winner in the race.\n\nAnd yes, even this winner will expire in short timeframe, AI is going too fast.  But your core skill - being a strong developer who can understand a real world problem and solve it... that skill is what will carry you into the long future.",
          "score": 2,
          "created_utc": "2026-01-16 14:27:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfmvwj",
          "author": "LateNightCommits",
          "text": "Recently cancelled, I didn't mind because I felt certain I'd be able to start some kind of modest SaaS. Not crappy AI wrapper, a genuine business. Well, turns out, there's nothing. Somehow I was worth a six figure salary to a bloated corporation that achieved very little, but on my own, all my skills are worth zero. Time to become an electrician. ",
          "score": 5,
          "created_utc": "2026-01-13 22:22:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfo6g0",
              "author": "dpwdpw",
              "text": "I may end up doing the same, lol. I still want to work online but I don't see many options.",
              "score": 3,
              "created_utc": "2026-01-13 22:28:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzffn0l",
          "author": "kuvvaci-tux",
          "text": "Im sorry to hear that mate, Im developing an app for fun (not sure if it is gonna work and honestly don't care if it wont) if u would like to earn me as a network and friend, u can join me lol 😂",
          "score": 1,
          "created_utc": "2026-01-13 21:47:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzffot2",
          "author": "passivevigilante",
          "text": "Did you invest the money you made or blow it all on random stuff",
          "score": 1,
          "created_utc": "2026-01-13 21:48:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfh218",
              "author": "Boboshady",
              "text": "He spent a lot of money on women, booze and fast cars. The rest he just squandered.",
              "score": 2,
              "created_utc": "2026-01-13 21:54:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzfpwhs",
                  "author": "Sketaverse",
                  "text": "Georgie Best 🫡",
                  "score": 1,
                  "created_utc": "2026-01-13 22:36:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzfh1ti",
          "author": "AdorablePandaBaby",
          "text": "Want to work together on something?",
          "score": 1,
          "created_utc": "2026-01-13 21:54:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfrc1z",
              "author": "Beneficial-Library27",
              "text": "Yeah , i do",
              "score": 1,
              "created_utc": "2026-01-13 22:44:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfmagc",
          "author": "PrivilPrime",
          "text": "did you saved up?",
          "score": 1,
          "created_utc": "2026-01-13 22:19:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfnxdp",
              "author": "dpwdpw",
              "text": "Yes",
              "score": 1,
              "created_utc": "2026-01-13 22:27:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfw1y6",
          "author": "PNW_Uncle_Iroh",
          "text": "There will be lots of opportunities to fix the bugs that AI is creating right now. Start to build a reputation in that space. When the startups who used an AI tool to build their app realize that it won’t scale, you come in and clean up the mess.",
          "score": 1,
          "created_utc": "2026-01-13 23:08:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfwami",
              "author": "dpwdpw",
              "text": "AI will improve to the point of fixing its own bugs in matter of 2 years at most.\n\nI've been using AI since 2024 to code. The progress it's made in months is absurd. It will keep improving. Sooner than later, programmers won't be needed.",
              "score": 3,
              "created_utc": "2026-01-13 23:09:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzfyqeh",
                  "author": "phatdoof",
                  "text": "I heard that AI works fine on new stuff from scratch but has problems fixing existing coded stuff and will need constant hand holding. Do you see this as a case?",
                  "score": 1,
                  "created_utc": "2026-01-13 23:22:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzgjlim",
          "author": "PeanutBAndJealous",
          "text": "is $200 a day a lot?",
          "score": 1,
          "created_utc": "2026-01-14 01:16:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzgpfew",
              "author": "Free-Walrus-7492",
              "text": "In most countries outside the US, yes. I encourage you to travel more.",
              "score": 0,
              "created_utc": "2026-01-14 01:49:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzgsg93",
          "author": "Healthy_Reply_7007",
          "text": "It sounds like you got caught up in the hype of coding apps that became too popular and lost value once they were replaced by AI. How's your network looking now - are those connections still valuable or have they soured?",
          "score": 1,
          "created_utc": "2026-01-14 02:07:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgybz3",
          "author": "Meth_taboo",
          "text": "Are you in the us? Do you want a full time job as a developer ?",
          "score": 1,
          "created_utc": "2026-01-14 02:40:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzh4q1j",
          "author": "elsalvadork",
          "text": "Got a great fintech idea in Europe if you’re up for it",
          "score": 1,
          "created_utc": "2026-01-14 03:16:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhipd6",
          "author": "changework",
          "text": "Check DM",
          "score": 1,
          "created_utc": "2026-01-14 04:46:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhmwe4",
          "author": "Substantial-Suit-597",
          "text": "   I feel your pain, but at the same time I don’t understand why you don’t change your perspective. So I’m part of your Ai problem. I’m a vibe coder, but I would LOVE to have someone with your knowledge on my team and be PART of the Ai revolution - not a victim of it. Your experience can be a massive advantage to help newbies like me. You can create an agency that checks vibe coded apps, fixes them, adds security measures, tests for bugs, and more. You already know what weaknesses can be exploited. \n   I’ve vibe coded a few projects. I have a couple people practically begging me to release one of them and all I shared were screenshots. (It’s honestly a better product than what’s available today!) But I’d love to have a seasoned pro review everything and suggest security fixes, edits or improvements before I officially launch. There’s a need for people with your knowledge!!! But I think you have to be willing to work WITH Ai, decide your unique niche, then grab that bull by the horns and GO!",
          "score": 1,
          "created_utc": "2026-01-14 05:15:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhuqt6",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-14 06:17:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhuqu1",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qc3jtd/i_got_rich_by_accident_coded_apps_they_blew_up/nzhuqt6/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-14 06:17:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzhx9d6",
          "author": "SilencedObserver",
          "text": "Talent and persistence can overcome connections. Timing and luck help, but it’s doable if you persist.  Applying for jobs becomes your new job.  If you’re that great at programming, it should be easy, and maybe you can solve more application complaints.",
          "score": 1,
          "created_utc": "2026-01-14 06:38:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi6z08",
          "author": "mehdi42087",
          "text": "U have found something important Entrepreneurship \n\nNow u could make the Next step and find AI based failures in Code or so and fix them",
          "score": 1,
          "created_utc": "2026-01-14 08:06:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi8qml",
          "author": "Bulky_Wind_4356",
          "text": "Well, I feel the problem lies in not adapting. \n\nIf you run a business, and a new technology comes out, and you don't stop to think how this could affect your business, you're doing it wrong.\n\nOther than that, connections were always far more valuable than having any sort of skill.",
          "score": 1,
          "created_utc": "2026-01-14 08:23:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziiz8t",
          "author": "srodrigoDev",
          "text": "I think that B2C might be messed up as people would rather faff with ChatGPT for 2h than pay a $5 monthly subscription\n\nBut B2B should still be there. I can't see companies replacing all tools with AI.\n\nBTW what do you think about entertainment? If making SaaS/apps were to die, what about making, say, video games? *Wants* will still be there when *needs* are covered by AI.",
          "score": 1,
          "created_utc": "2026-01-14 10:02:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzisyzq",
          "author": "poroo0",
          "text": "I'm someone that needs good devs to join my team. Maybe we can help each other?",
          "score": 1,
          "created_utc": "2026-01-14 11:30:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkd9ah",
          "author": "ugtsmkd",
          "text": "You just need to find problems business owners are dealing with and solve them. There will always be problems and ai doesn't do context well.  For instance Intuit has alienated a bunch of it's users.\n\nIf your comfortable with big data and migration there's definitely an opportunity in creating a tool to migrate people + historical info from intuit QuickBooks desktop/online to alternatives like zoho etc.",
          "score": 1,
          "created_utc": "2026-01-14 16:41:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkgd2x",
          "author": "Bgmchan15",
          "text": "The market for “UI interfaces” is kind of over I believe but there will be a massive market for outcomes. Kind of like from deterministic (rule based form filling) to non deterministic work (eg, filling a form via an AI agent after calculating what to fill for each field by checking additional submitted docs). Think of it like an evolution, and its chaotic. I think boring operational inefficiencies in mid-sized companies -20-30 employees is a good area - not too big (long sales cycle and enterprise is expensive), or too small (cannot afford). Logistics, staffing, manufacturing. These guys are drowning in manual work which maybe was not possible earlier but parts of it can now be handled by AI agents. People are not even aware what is possible and if you can truly understand their business overheads and low value work and demonstrate via a POC a satisfactory outcome  (eg saved X hours of manual work), small businesses will be happy to avail your services (agents). \n\nFor eg, I worked with a large marketplace in India recently where we deployed a voice ai agent - they needed Indian english accent - to speak with freelancers to verify and do a level 2 screening. Earlier, this was a huge time suck. Once they tested it (paid POC) and ran it, they were happy to deploy it - currently happening in phases - especially after we established benchmarks on cost, accuracy, false negatives, etc. It’s a bit of process - like building trust in the outcome. And having ways to override the AI outcome if needed.\n\nPS - Saying this from experience as an engineer turned product manager turned AI consultant (yeah pivots).",
          "score": 1,
          "created_utc": "2026-01-14 16:55:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzn5clm",
          "author": "palvaran",
          "text": "I think it really comes down to your network. As you are helping others hopefully you are staying connected somehow via something like LinkedIn so that others can see what you are doing and you can showcase your portfolio over time.\n\nIt’s hard out there, but keep going and don’t give up.",
          "score": 1,
          "created_utc": "2026-01-15 00:31:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznd4ke",
          "author": "Rustyshackilford",
          "text": "Like other guy said. Learn to code AI apps. With your knowledge, integrating AI isnt a softball pitch. \n\nAnything that can interpret user intent and cut down on man hours is appreciated.",
          "score": 1,
          "created_utc": "2026-01-15 01:14:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nznn201",
              "author": "dpwdpw",
              "text": "It's much more complex than that.\n\nIf you do make an amazing app that does solve people's problems, you still need to make your way through 8273 other similar vibecoded apps and build trust. Coding a good solution isn't the only issue.",
              "score": 1,
              "created_utc": "2026-01-15 02:12:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzqjk1s",
                  "author": "Rustyshackilford",
                  "text": "Sounds like youve defeated yourself then",
                  "score": 2,
                  "created_utc": "2026-01-15 14:54:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nznph6j",
          "author": "distortd6",
          "text": "How did you acquire clients? I have a degree in SE but never put it to use. I haven't coded a full project since school 10 years ago but I work in technical integrations and AI can handle the majority of my code now.\nI think I'd be a similar asset to local small businesses and could provide a large amount of value to them, just dint know how to approach them.",
          "score": 1,
          "created_utc": "2026-01-15 02:26:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzny47l",
              "author": "dpwdpw",
              "text": "posting daily on Instagram/YouTube, after a few months they started coming in.",
              "score": 2,
              "created_utc": "2026-01-15 03:17:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzoc2uu",
          "author": "Every-Lake-1787",
          "text": "Being someone with good network/connections is way more valuable than anything else and always has been. \n\nFTFY",
          "score": 1,
          "created_utc": "2026-01-15 04:48:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzojytk",
          "author": "SaunaApprentice",
          "text": "Back to figuring shit out and getting it done. It’s not more complicated than that.",
          "score": 1,
          "created_utc": "2026-01-15 05:46:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpjyye",
          "author": "dragonflyinvest",
          "text": "Are you rich enough not to trade time for money, but to instead let your money do the work for you?",
          "score": 1,
          "created_utc": "2026-01-15 11:13:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqgfn6",
              "author": "dpwdpw",
              "text": "realistically speaking, I don't see how that's possible. On the internet everything is possible (invest x in stocks y and you'll have passive income), in reality it's not like that. I have worked with many people trying a lot of things, ive seen up close what does and does not work.\n\ninvesting is good for your future, but it won't make you Rich",
              "score": 1,
              "created_utc": "2026-01-15 14:39:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzqxu5j",
                  "author": "dragonflyinvest",
                  "text": "I asked because you posted that you “got rich by accident”. But cool.",
                  "score": 1,
                  "created_utc": "2026-01-15 16:01:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzppqkd",
          "author": "dontknowme99",
          "text": "Would you be interested in giving me your input on an idea I have? If so, DM me… I’d appreciate it.",
          "score": 1,
          "created_utc": "2026-01-15 12:00:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt0jvj",
          "author": "weeluc",
          "text": "Hey man, I have an awesome project pretty much ready to go, all back end is done we just need the front end (design is ready on figma). Its marketing/shopify related. If you would like to connect hit me up. I have been a bootstrapped founder for 15 years with a couple of good exits",
          "score": 1,
          "created_utc": "2026-01-15 21:40:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyddja",
          "author": "znv142",
          "text": "Can you guys build an extension that lets you get rid of AI slop on Linkedin, YouTube, etc? I'd pay top dollar as a user! : )",
          "score": 1,
          "created_utc": "2026-01-16 17:20:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzh41f",
          "author": "Big-Watercress-9943",
          "text": "Many also sell fragments of solutions instead of solving whole problems and we need to slowly start shifting from “model‑centric” to problem‑centric thinking, otherwise we will all miserably fail.\n\nWe are happy to collaborate or create a working group if needed",
          "score": 1,
          "created_utc": "2026-01-16 20:18:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05h31x",
          "author": "Crazy_Signal4298",
          "text": "Your value is not all coding.   You can spot a problem and produce a solution.    That is basic value in a business.",
          "score": 1,
          "created_utc": "2026-01-17 18:49:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06lxif",
          "author": "todays_dumbest",
          "text": "How did you find about about your customers complaining when you started off?",
          "score": 1,
          "created_utc": "2026-01-17 22:12:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06xwgp",
          "author": "joefife",
          "text": "Hey. Been there before mate - I used to run a very popular niche dating website, turning over about £600k a year.\n\nIt died in the advent of grindr.\n\nI now run a property maintenance company. I'm basically a handyman that knows how to do admin 😂\n\nHappy to chat - know what it's like to have this kind of shift. For me it happened in less than a year, had to make several people redundant, nearly went bust as I was used to spending a decent income.",
          "score": 1,
          "created_utc": "2026-01-17 23:12:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzflk5o",
          "author": "achintyabhavaraju",
          "text": "AI is ruining alot! I'm secretly anticipating for the bubble to burst. Just tired of all the uncertainty",
          "score": 2,
          "created_utc": "2026-01-13 22:15:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfqyay",
              "author": "Relative-Tourist8475",
              "text": "AI can’t burst. It’s a paradigm shift. It is there, will remain there, and keep being used more and more.",
              "score": 11,
              "created_utc": "2026-01-13 22:42:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzfszra",
                  "author": "mizmaclean",
                  "text": "Yes. It’s like the internet. The internet can’t burst. There was the dot com bubble, and there is definitely something to be gleaned there.",
                  "score": 4,
                  "created_utc": "2026-01-13 22:52:30",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzg0wzc",
                  "author": "Low-Ad-8828",
                  "text": "This is correct. The bubble that will burst is the market. the paradigm shift has happened already (until the next one). AI is not going away.",
                  "score": 4,
                  "created_utc": "2026-01-13 23:34:27",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzgdm2z",
                  "author": "redcoatwright",
                  "text": "Yeah the AI bubble bursting does not mean AI \"goes away\" it means the insane valuations some of these AI companies are commanding will deflate rapidly and a ton.",
                  "score": 2,
                  "created_utc": "2026-01-14 00:42:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzfoc88",
              "author": "dpwdpw",
              "text": "How exactly would the burst look like and how would it positively impact us, ordinary citizens?",
              "score": 1,
              "created_utc": "2026-01-13 22:29:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzhyrf7",
                  "author": "BiscottiBusiness9308",
                  "text": "Probably not positively - at least from an access lens. Currently we get access for almost free to frontier tools that are incredibly expensive to develop and need huge infra to run. If the big labs stop their race, i imagine that rather prices go up due to consolidation and/or development stagnates. What do you think?",
                  "score": 1,
                  "created_utc": "2026-01-14 06:51:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzfpk1o",
          "author": "RealAnthonyCamp",
          "text": "I’m confused by the rich part. Isn’t $200/day equal to $73K per year?",
          "score": 0,
          "created_utc": "2026-01-13 22:35:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfur61",
              "author": "Ryuma666",
              "text": "There are countless cities in the world (outside world?) where people can easily retire with 2-300k.",
              "score": 3,
              "created_utc": "2026-01-13 23:01:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzgu5od",
                  "author": "Weederboard-dotcom",
                  "text": "that doesnt make them rich",
                  "score": -2,
                  "created_utc": "2026-01-14 02:16:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzfptne",
              "author": "dpwdpw",
              "text": "that wasn't my only source of income, I was doing coding projects as well.\n\npeople would use my apps, get to know me and then hire. It only brought pros",
              "score": 1,
              "created_utc": "2026-01-13 22:36:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfsteq",
          "author": "swealteringleague",
          "text": "You’re still valuable because AI coding sucks right now and you need talented programmers to use it correctly. It’s just instead of needing 100 you can do the same work with 10. So supply/demand has shifted heavily over the last few years.\n\nHit up these smaller projects that are in need like Hyros etc, or use your skills to make your own apps like Base44 Stacker etc.",
          "score": -2,
          "created_utc": "2026-01-13 22:51:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzftasw",
              "author": "dpwdpw",
              "text": "Realistically I don't think so. I sent over 3000 emails (some to previous customers, some very well crafted cold emails - I landed many clients through cold email in the past, so I'm somewhat \"skilled\" at it), with no positive responses.\n\nThere's just no need for a dev right now, with the exception of big companies with very specific needs.",
              "score": 1,
              "created_utc": "2026-01-13 22:54:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qblml8",
      "title": "the richest guy i’ve met this year doesn’t have linkedin",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qblml8/the_richest_guy_ive_met_this_year_doesnt_have/",
      "author": "Sea-Plum-134",
      "created_utc": "2026-01-13 08:02:09",
      "score": 184,
      "num_comments": 81,
      "upvote_ratio": 0.88,
      "text": "living across different cities for my college @ tetr. really messes with your idea of success. back home, “rich” usually looks like: good tech job, some real estate, maybe stocks. active on linkedin. posts about leadership recently in india, met a guy at a cafe in delhi. nothing flashy. simple clothes. regular car. found out later he owns 40+ properties across the area. started with a single pizza shop 15 years ago. now runs a quiet empire. no linkedin. no twitter. no personal brand. his entire network lives on whatsapp. deals happen over food. it made me realize how narrow my definition of success had become.\n\nthe people posting about wealth usually seem to have the least of it. the people with actual wealth are mostly… quiet.\n\nwho’s the most unexpectedly wealthy person you’ve come across?",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qblml8/the_richest_guy_ive_met_this_year_doesnt_have/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzbi1rs",
          "author": "Aretosteles",
          "text": "Big news: linkedin is just another social media bubble",
          "score": 159,
          "created_utc": "2026-01-13 08:12:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzc63vu",
              "author": "Rickarddo",
              "text": "I have found zero value in LinkedIn.   Had over 1000 contacts before I jumped off.  I view it as a FOMO app.    So much congratulatory  bragging.    \n\nI have my own business and in my industry, being on it is the norm.",
              "score": 26,
              "created_utc": "2026-01-13 11:54:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzctuxq",
                  "author": "gapingweasel",
                  "text": "so true. zero value...I might have applied for 100s of jobs via linkedIn and till now I have just got 1 interview call via that platform. it is a setting platform.",
                  "score": 2,
                  "created_utc": "2026-01-13 14:21:10",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzju55o",
                  "author": "[deleted]",
                  "text": "I have had some value, as I have got 3 jobs from it so far.",
                  "score": 1,
                  "created_utc": "2026-01-14 15:14:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzbldi7",
              "author": "zephyrtron",
              "text": "☝️ Posting every day on Li is *not* a requirement for success. God how I wish it was.",
              "score": 7,
              "created_utc": "2026-01-13 08:44:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzbqj1s",
              "author": "qqbbomg1",
              "text": "It’s all PR stunts, I haven’t updated in so long cause I need a better news than my current job LOL",
              "score": 4,
              "created_utc": "2026-01-13 09:35:04",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzdgntr",
              "author": "drivendreamer",
              "text": "Truth here. It is more worthless by the day",
              "score": 1,
              "created_utc": "2026-01-13 16:11:59",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzzhd9f",
              "author": "Tight-Preference-823",
              "text": "That's an interesting perspective. I've found that LinkedIn can be a useful tool for networking and staying connected with colleagues and peers, but it's not the only measure of success. The story of the rich guy without LinkedIn is a great reminder that there are many paths to success.",
              "score": 1,
              "created_utc": "2026-01-16 20:19:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzbkwzf",
          "author": "Fancy-Pen-2343",
          "text": "The top 5 richest guys I know don't own dump trucks.\n\n LinkedIn is a tool.  Cold calling is a tool.  Dump trucks are tools.  Websites are tools.  You use what tools work best to work on your business.  When you are growing you try to look around and say, what tools do I need to use.  \n\nIf LinkedIn isn't part of your workflow, why would you expect an efficient person to use it?  It would be like driving to work in a dump truck.",
          "score": 37,
          "created_utc": "2026-01-13 08:40:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzd47k2",
              "author": "SpadoCochi",
              "text": "Exactly.",
              "score": 2,
              "created_utc": "2026-01-13 15:13:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzejv2h",
              "author": "Tradepad",
              "text": "Bang on! Perfectly said.",
              "score": 2,
              "created_utc": "2026-01-13 19:20:39",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nziqr0j",
              "author": "Sea_Sea_4863",
              "text": "The replies to your comments reminds me of linkedin",
              "score": 2,
              "created_utc": "2026-01-14 11:12:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzivgwq",
                  "author": "Fancy-Pen-2343",
                  "text": "This reminds me of a time I overcame adversity by using my saas crm to optimize my conversation win rate.",
                  "score": 1,
                  "created_utc": "2026-01-14 11:50:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzz9kgp",
              "author": "parthoasis",
              "text": "Finally someone said it. Linkedin changed my life lol",
              "score": 1,
              "created_utc": "2026-01-16 19:43:28",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzbmo1m",
              "author": "IDoButtStuffs",
              "text": "Dump trucks kaha se aa gya bich me",
              "score": -6,
              "created_utc": "2026-01-13 08:57:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzbpm9m",
                  "author": "BangCrash",
                  "text": "I'm wondering the exact same thing",
                  "score": 1,
                  "created_utc": "2026-01-13 09:26:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzbig9w",
          "author": "CA_Vijaykumar_Puri",
          "text": "Same experience. Co-incidentally, all top 5 of my clients (in terms of net worth) globally do NOT have a social media presence... forget LinkedIn! Just makes you wonder....",
          "score": 29,
          "created_utc": "2026-01-13 08:16:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzbllaq",
              "author": "koproller",
              "text": "Because they do not need it. People know them. They can get into contact with people they want to be in contact with.",
              "score": 20,
              "created_utc": "2026-01-13 08:46:44",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzbil5j",
              "author": "BelovedInvestor",
              "text": "Yes, people around me who are cash rich with high network do not have social media presence less the professional Linkedin...",
              "score": 2,
              "created_utc": "2026-01-13 08:17:55",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzbqn8m",
              "author": "qqbbomg1",
              "text": "I doubt that, they all have them but you just can’t find it, it’s under different name and only connected to people they care about, could be private profile, they also have exclusive apps they use that need net worth verification btw.",
              "score": -5,
              "created_utc": "2026-01-13 09:36:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzbirkq",
          "author": "kubrador",
          "text": "my old landlord drove a beat up camry and wore the same three shirts on rotation. found out he owned the entire block when i tried to negotiate rent and he just laughed and said \"i don't need the money, i just hate paperwork\"\n\nthe linkedin hustle crowd is playing a completely different game than actual wealthy people. one group is selling the idea of success, the other group is too busy counting rent checks to post about it",
          "score": 13,
          "created_utc": "2026-01-13 08:19:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzcyuhu",
              "author": "greyspurv",
              "text": "I know people who are very rich who does not have Linkedin or any other social media, but saying people on Linkedin is not actually is wealthy is just going too far haha, lots of uber rich on Linkedin",
              "score": 1,
              "created_utc": "2026-01-13 14:46:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzbmcak",
          "author": "dragonflyinvest",
          "text": "I was thinking who tf uses LinkedIn? \n\nI’ve never associated wealth with social media except those few who own the platforms (ie. Mark Zuckerberg, Jack Dorsey, etc)",
          "score": 10,
          "created_utc": "2026-01-13 08:53:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzeaxgn",
          "author": "-n-i-c-k",
          "text": "I work in M&A. We joke you’ve made it when you can delete your LinkedIn. That means you have enough REAL connections that the work, deals, and money just come straight to your cell phone, no chasing. No bs. Goals man, goals",
          "score": 7,
          "created_utc": "2026-01-13 18:40:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbxl8i",
          "author": "TheGottVater",
          "text": "You mean a profile people can spam sell you on?",
          "score": 5,
          "created_utc": "2026-01-13 10:41:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcsil4",
          "author": "rwoooshed",
          "text": "The upper class doesn't use or consume social media like us serfs do. It's considered trash and harmful. Plus you don't want to advertise your wealth or connections and endanger your way of life.",
          "score": 3,
          "created_utc": "2026-01-13 14:14:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc7mb7",
          "author": "JMALIK0702",
          "text": "Last week, one of my client who's a head of sales at a big construction company rescheduled our weekly meet because he had plans to go for a baseball game with a prospect. Say all about systems, AI etc but it will never be able to counter the fact that \"People need to talk to People\"",
          "score": 3,
          "created_utc": "2026-01-13 12:05:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzd3v31",
          "author": "mayhem77",
          "text": "And? LinkedIn is just a circle jerk.",
          "score": 3,
          "created_utc": "2026-01-13 15:12:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdde8o",
          "author": "Caspera99",
          "text": "Where does he learn about B2B sales or get DMs about MBA courses?",
          "score": 3,
          "created_utc": "2026-01-13 15:56:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc8mdp",
          "author": "ceedee04",
          "text": "“Rich” is society specific.\n\nIn America, ‘rich’ is tightly related to ‘ego’, which is not the case in every society.\n\nIn Australia, the rich seem to want to hide it, it is almost embarrassing for them.",
          "score": 6,
          "created_utc": "2026-01-13 12:13:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzc9ykg",
              "author": "IamNotYourBF",
              "text": "It's one reason people in the USA buy big stupid trucks. It's a class signaling mechanism. It's like a peacock showing its feathers.",
              "score": 4,
              "created_utc": "2026-01-13 12:22:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzitgbq",
                  "author": "-M83",
                  "text": "ok just to play devils advocate. have u ever driven a big stupid truck? they’re awesome and fun as hell, lol. but yea overall I agree with u. however in my area of the USA it’s mostly G wagon and Range Rover that’s used as a status symbol. ",
                  "score": 1,
                  "created_utc": "2026-01-14 11:34:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nziqnqw",
              "author": "Living_Natural1829",
              "text": "I know several of Americans who have a net worth over $20 million who you would just think are middle class.  I don’t see how you can make broad statements about people when you have no clue how much they have.  Those flashy ego people?  Maybe they aren’t really rich and you’ve been fooled.\n\nAnd maybe there are studies out there that show you are correct and I’m wrong.  But using anecdotal evidence to make broad statements like yours (or mine) can’t possibly be accurate.",
              "score": 2,
              "created_utc": "2026-01-14 11:11:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzc5d6i",
          "author": "DanGleeballs",
          "text": "Punctuation is your friend, brother.",
          "score": 2,
          "created_utc": "2026-01-13 11:48:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbnflg",
          "author": "ryan1257",
          "text": "I’m surprised you didn’t use the word “boring” to describe the guy.",
          "score": 3,
          "created_utc": "2026-01-13 09:04:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc1ox5",
          "author": "panveer",
          "text": "That’s old school success, very difficult to do that if you’re in tech/business post 2020. In our time how would we network globally without access to social media",
          "score": 2,
          "created_utc": "2026-01-13 11:17:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzce24n",
              "author": "Chris_91_Adams",
              "text": "networking globally without social media is hard but virtual events and workshops help i found Invisioned AI has a social media manager that makes online networking and engagement easier.",
              "score": 1,
              "created_utc": "2026-01-13 12:50:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzc1ahp",
          "author": "ComputerSeveral3901",
          "text": "Yup we're all buying into the \"idea of success\" just like everything else in life including happiness, relationships, sex etc. The media is out there all the time defining what everything must look and feel like.",
          "score": 1,
          "created_utc": "2026-01-13 11:13:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzceiur",
          "author": "Squidssential",
          "text": "Many such cases!",
          "score": 1,
          "created_utc": "2026-01-13 12:53:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzclr7e",
          "author": "SnooCupcakes7312",
          "text": "ok so? it’s useless anyway",
          "score": 1,
          "created_utc": "2026-01-13 13:37:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcmuu1",
          "author": "Portfoliana",
          "text": "Bro this hits hard. Know a guy who runs a small cleaning company, drives an old beat up honda, zero social media presence. Casually mentioned he owns 3 apartment buildings last month lol\n\nMeanwhile the crypto bros on twitter with lambo pics are usually just selling you a course.​​​​​​​​​​​​​​​​",
          "score": 1,
          "created_utc": "2026-01-13 13:43:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcnb05",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-13 13:46:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzcnb37",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qblml8/the_richest_guy_ive_met_this_year_doesnt_have/nzcnb05/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-13 13:46:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzcocpw",
          "author": "Land_of_smiles",
          "text": "Lots of rich people I know don’t have facebook let alone LinkedIn",
          "score": 1,
          "created_utc": "2026-01-13 13:51:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcrp7y",
          "author": "GeorgeHarter",
          "text": "Know your target audience. \nYou need to be where your prospects and customers are. If you are looking for a tech job, or want to sell to people at tech companies, you likely need a likedin presence. \n\nIf you’re running restaurants, real estate or construction businesses, maybe you don’t need to be in LI.",
          "score": 1,
          "created_utc": "2026-01-13 14:09:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcwg6t",
          "author": "bigawuc",
          "text": "When someone mentions LinkedIn, they typically have all the annoying qualities of an MBA grad. \n\nFor example, they get taught to obsess over building their “Network”. This translates into a very disingenuous form of relationship building. The connection feels fake… people sense this… authenticity matters.\n\nAnother shot, you MBAs don’t have to setup your story, or announce that you’re about to tell a story before telling it. Just have a normal conversation and tell your story… stop elevator pitching everyone",
          "score": 1,
          "created_utc": "2026-01-13 14:34:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzczocm",
          "author": "greyspurv",
          "text": "It all really depends, I know both very rich with and without social media and Linkedin, I always find it funny when people say \"really rich\" does this and \"really wealthy\" does this instead.  \nLike no social class is a monolith lol.",
          "score": 1,
          "created_utc": "2026-01-13 14:51:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzd2s32",
          "author": "smedlap",
          "text": "I have known some very wealthy people. One that stands out was a crazy guy who dressed like a janitor all the time and would meet me to show apartments he owned so he could judge the tenants I was bringing him. They all thought he was the building superintendent. I knew that he owned 50 buildings in Boston.",
          "score": 1,
          "created_utc": "2026-01-13 15:06:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdsl4y",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-13 17:17:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzdsl83",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qblml8/the_richest_guy_ive_met_this_year_doesnt_have/nzdsl4y/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-13 17:17:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzdv1gk",
          "author": "UniqueBobcat",
          "text": "Unrelated but how is tetr? It sounds great on paper but not sure how it’d be in reality",
          "score": 1,
          "created_utc": "2026-01-13 17:29:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdxljv",
          "author": "Foreign_Tower_7735",
          "text": "In my opinion I have come across zero super wealthy person in my life, all were humble and rich-ich. My definition of wealthy is very close to the one you described, however I have been reading and listening and sometimes I also feel the universe is holding a big panel at me saying stop wanting to own a home because the recent information I have are famous investment advisors who rent a flat rather than buy a home because they call it a liability and instead buy one to rent it. \nHowever, some people who coach others to start a business often say they bought a giant house and live the life of their dreams. \n\nSo honestly, I don't really know. I guess the idea today is that internet all the tech and TV's are accessories and that money and business exist without them too and being rich implies work and dedication and you do not need to have a Bentley or a Rolls Royce to be rich. \n\nI feel if you have the money accomplish your dream lifestyle because otherwise you will ask yourself is it worth it. But then maybe change things, sell the flashy car for a basic one, dump the designer styles for everyday stuff and sell or even better rent the giant house and get a cozy flat to rent or buy one without a mortgage if you are very rich and pretend it has a rent and save your money too.",
          "score": 1,
          "created_utc": "2026-01-13 17:41:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzep75g",
          "author": "Spirited_Manager_831",
          "text": "LinkedIn is just like Instagram. People only show exactly what they want others to see",
          "score": 1,
          "created_utc": "2026-01-13 19:44:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfggnk",
          "author": "CherryRoutine9397",
          "text": "I’ve noticed this too. The loudest people online tend to be selling a lifestyle, not actually living one. The wealthiest guy I know runs a boring logistics business, still uses a cracked phone, no socials at all. Deals happen through old contacts and WhatsApp. Kinda killed my idea that success needs an audience.",
          "score": 1,
          "created_utc": "2026-01-13 21:51:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgamg2",
          "author": "Ordinary-Hat5363",
          "text": "LinkedIn is just a piece of trash, full of noise",
          "score": 1,
          "created_utc": "2026-01-14 00:26:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhvvfn",
          "author": "I-mAGreatShowman3369",
          "text": "LinkedIn is just LinkedIn",
          "score": 1,
          "created_utc": "2026-01-14 06:26:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhvym4",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-14 06:27:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhvynm",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qblml8/the_richest_guy_ive_met_this_year_doesnt_have/nzhvym4/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-14 06:27:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nziowz5",
          "author": "Better-Addendum2674",
          "text": "Let me guess who the rich guy was Reid Hoffman right",
          "score": 1,
          "created_utc": "2026-01-14 10:56:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziqmsm",
          "author": "levichambers_1",
          "text": "knew a corner store owner who seemed average forever.. cheap clothes, same routine.. dude had been snapping up rentals on the side for years, now sits on millions in property.. no linkedin or posts, just lives lowkey.. eye opener tbh..",
          "score": 1,
          "created_utc": "2026-01-14 11:11:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzj78qm",
          "author": "RAC-City-Mayor",
          "text": "Makes sense - LinkedIn is for employees and sales people, not asset owners…",
          "score": 1,
          "created_utc": "2026-01-14 13:11:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzj9o4l",
          "author": "TJHawk206",
          "text": "There are 3 levels of people. \n\n1. No linkdin \n2. Linkdin \n3. No Linkdin \n\nThe guy you met is #3.",
          "score": 1,
          "created_utc": "2026-01-14 13:26:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzk2yds",
          "author": "MORPHOICES",
          "text": "I’ve observed a similar pattern. \\~\n\nThe richest one in my circles controls a mundane logistics firm. No Linkedin. No tweeting. Brandless item. \n\nMost would think he’s doing “fine” at best.\n\nHe has a quiet 20 year track record.\n\nWhat shocked me wasn’t the money – but how little his identity depended on it. Do not post. No demonstrations. No innovative thinking. Effective systems, enduring relationships, and patience.\n\nThe business of attention makes wealth appear loud online.\n\nWealth tends to be quiet offline becausee attention is a liability.\n\nMany people think they are successful just because they are visible in the tech world. Typically, real operators are maximizing for cash flow, control, and time rather than for applause.\n\nSignal Your Competency on this Platform Genuine riches honor moderation.\n\nThe two pathways are valid buut are very different games. It is dangerous to pretend to be one thing while using the other’s scoreboard.\n\nThat one realization changed how I define winning.",
          "score": 1,
          "created_utc": "2026-01-14 15:55:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkcw11",
          "author": "Due-Tip-4022",
          "text": "Same for me in the US. The richest I know are not on LinkedIn. Neither are most of my target market. LinkedIn is for sales people. If you sell selling, its where you want to be. But most everything else, its a huge waste of time. I mean, its literally just advertising pretending to be social media. Its like the commercial channel with the occasional somewhat interesting tidbit.\n\nHere though, WhatsApp isn't really used for business. Kind of met with distrust in my industry anyway. I only use it to communicate with overseas suppliers when there is no other way. Just so inconvenient. Here, phone calls and email are king.",
          "score": 1,
          "created_utc": "2026-01-14 16:40:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlvacz",
          "author": "XtremeD86",
          "text": "Im pretty well off.  I have linked in but none of the info about me is even remotely close to accurate anymore.  The entire service is a way for someone to doxx you if they want to.\n\nEven today someone I used to work with 15 years ago added me so I looked at their profile.  They're a machine operator... The fact that he spelt it as machene made me instantly ignore the guy.\n\nOther than that, I don't use the service. And actually deleted my profile after seeing that earlier.  It's a waste of time, and it's all real estate agents trying desperately to sell homes, or bored HR workers posting stupid memes that are meant to make you feel good.  Such as \"yesterday is over, today is new, you got this\".\n\nLike what the fuck does that even mean?",
          "score": 1,
          "created_utc": "2026-01-14 20:45:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznct94",
          "author": "National-Shopping154",
          "text": "Hmm..are you guys in India rn? i am from MU",
          "score": 1,
          "created_utc": "2026-01-15 01:13:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp1up7",
          "author": "sc1lurker",
          "text": "Why would he use LinkedIn?\n\nUnless he's a public figure of some sort, there's no need.\n\nLinkedIn is mostly for peasants to showcase why they should be hired.  You know, to work for someone else.",
          "score": 1,
          "created_utc": "2026-01-15 08:22:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp35t3",
          "author": "Glad_Imagination_798",
          "text": "Money loves silence? \nIn my case, I can say LinkedIn helps to make my brand recognized, so I would stand for LinkedIn.",
          "score": 1,
          "created_utc": "2026-01-15 08:35:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpaek9",
          "author": "Thisizuser",
          "text": "In my 30s, now I am discovering people who don’t have much of online presence. One of my client pretty much runs deals through what’s app, in person and Zoom meetings. No time for content. \n\nBut there are few names on LinkedIn (cool or not) seems like they have made huge businesses out of personal branding, newsletters and courses. They consistent as robots - pretty difficult without a system.",
          "score": 1,
          "created_utc": "2026-01-15 09:46:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpak5j",
          "author": "Stock_Trader_J",
          "text": "I’m nut ultra rich but do quite well for myself as a financial advisor. I deleted my LinkedIna few years ago. For the following reasons:\n\n1. Happy with the product shelf at the company I am at and my compensation, so why would I want to have a social media geared to employment.\n\n2. Kept getting offers from people who got their license 20 minutes ago and work for MLM’s to “work for my self part time under them” and that I would make millions, meanwhile they have never done a life insurance needs analysis or retirement plan themselves.\n\nI have found that spending more time in person with people (even friends) got me more referrals. \n\nI also couldn’t stand the platform.",
          "score": 1,
          "created_utc": "2026-01-15 09:47:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpuv7h",
          "author": "Timely-Run-7958",
          "text": "I don’t know about you guys, as working man, an engineer, I get some amazing opportunities on here for work and stuff but to each their own",
          "score": 1,
          "created_utc": "2026-01-15 12:37:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr1k6s",
          "author": "zyneman",
          "text": "I knew a rich guy who didnt own a phone. \"Ill see you when i see you\"",
          "score": 1,
          "created_utc": "2026-01-15 16:18:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw3gnt",
          "author": "shitalimalviya",
          "text": "Every story has two sides.  \nSome shaped by social media…  \nand some where social media doesn’t exist at all.",
          "score": 1,
          "created_utc": "2026-01-16 09:17:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw4z45",
          "author": "Impressive-Key7784",
          "text": "The rich can afford to not have linkedin",
          "score": 1,
          "created_utc": "2026-01-16 09:31:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03012m",
          "author": "Late_Canary2264",
          "text": "I know local millionaires and billionaires, diverse age groups, none of them have a linkedin profile. Linkedin is a bubble tbh.",
          "score": 1,
          "created_utc": "2026-01-17 10:14:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o068xz5",
          "author": "ProcedureGloomy6323",
          "text": "I don't know a single serious person who uses LinkedIn, it sounds like a bubble of corporate idiots to me ",
          "score": 1,
          "created_utc": "2026-01-17 21:07:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbuo1k",
          "author": "davearneson",
          "text": "He is a money launderer for a criminal cartel",
          "score": 1,
          "created_utc": "2026-01-13 10:14:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbqqtz",
          "author": "qqbbomg1",
          "text": "I doubt that, they all have them but you just can’t find it, it’s under different name and only connected to people they care about, could be private profile, they also have exclusive apps they use that need net worth verification btw.",
          "score": -1,
          "created_utc": "2026-01-13 09:37:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qb8j20",
      "title": "Zakeke vs Threekit and Expivi, which 3D product configurator wins for customization and flexibility?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qb8j20/zakeke_vs_threekit_and_expivi_which_3d_product/",
      "author": "Scary-Breakfast7882",
      "created_utc": "2026-01-12 21:53:30",
      "score": 36,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I’m evaluating different 3D product configurators for my store, and I’m torn between Zakeke, Threekit, and Expivi. I run a store with a wide range of customizable products, and I need a tool that not only shows products in 3D but also lets my customers interact with them easily. Here's a quick rundown of my thoughts so far:\n\n* **Zakeke:** The ease of integration and its strong focus on user experience really stand out to me. It’s API-first, and it seems much more agile than some of the other platforms. Plus, I’ve heard great things about its web-to-print capabilities, which is essential for some of my custom products.\n* **Threekit:** This one is impressive, especially for high quality visuals. The \"Virtual Photography\" feature is a huge plus for marketing, but it seems to come with a steeper learning curve and a more complicated pricing structure. I’m not sure it’s worth the complexity, especially for a growing business.\n* **Expivi:** The interface is clean and intuitive, but it lacks some of the deeper integration capabilities that I think Zakeke offers. while the 3D modeling is nice, it doesn’t seem as scalable as Threekit for large product catalogs.\n\nI’m mainly looking for a solution that combines flexibility, ease of integration, and strong customization tools without too much overhead. for those of you who’ve worked with these tools, which one works best for customizable product stores and why? do you have any feedback on ERP syncing or the ability to scale?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qb8j20/zakeke_vs_threekit_and_expivi_which_3d_product/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzbegss",
          "author": "Main_Lengthiness_606",
          "text": "I’ve used Zakeke and Threekit for different projects. Zakeke is much easier to integrate and much more cost-effective for smaller stores. Threekit’s visual fidelity is great, but as you mentioned, the pricing can be a concern. I would stick with Zakeke if you want something that scales without complexity.",
          "score": 4,
          "created_utc": "2026-01-13 07:39:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcb5wj",
      "title": "Competitor raised $81M, I’ve raised $81. Am I wasting my time?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qcb5wj/competitor_raised_81m_ive_raised_81_am_i_wasting/",
      "author": "Vanilla-Green",
      "created_utc": "2026-01-14 02:26:27",
      "score": 28,
      "num_comments": 54,
      "upvote_ratio": 0.82,
      "text": "I built a tiny Android voice keyboard in a week with the same functionality as my competitor. Unlike basic voice typing that simply transcribes what you say, my app understands you. It filters out filler words (like “um” and “uh”), fixes grammar, and formats your sentences instantly in every app. Super early.\n\nCurrent stats:\n\t•\tapp is live\n\t•\t~25 installs\n\t•\tzero real users\n\t•\ttotal spend: about $81\n\nMeanwhile a competitor in this space (Wispr Flow) raised $81M. Not a typo.\n\nTrying to figure out what this actually is:\n- a real startup worth grinding on or just a neat feature that I’ll never be VC-backed\n\nCouple quick questions:\n- would you invest in something like this? yes or no\n- is it obviously way too early to think about raising?\n- what would need to happen before this is even “fundable”?\n\nNot promoting, genuinely deciding whether to double down or move on.\n\nBrutal honesty welcome.\n",
      "is_original_content": false,
      "link_flair_text": "Idea Validation",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qcb5wj/competitor_raised_81m_ive_raised_81_am_i_wasting/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzh1zjz",
          "author": "SenorTeddy",
          "text": "Don't think in terms of product/features, think in terms of business, logistics, partnerships, etc. $81M wouldn't go to an app that could be built in a week and there are gaps in what you know about your competitor. From their site:\n\n    SOC 2 Type II and ISO 27001 compliance\n    Enforced HIPAA compliance\n    Enforced Privacy Mode (Zero Data Retention)\n    SSO / SAML\n    Advanced usage dashboards\n\nHave a plan on how to make money with your app, and then prove it with examples(I did this ad, spent this much, got this many installs, this is my convert %).",
          "score": 19,
          "created_utc": "2026-01-14 03:00:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhkzr1",
              "author": "el_pezz",
              "text": "Investors know OP used Claude 😅",
              "score": 5,
              "created_utc": "2026-01-14 05:02:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzpbzbu",
              "author": "OfficiallyThePeter",
              "text": "100% ... what biz pitch to investors are 5\\~10 year plan to 10x investments. \n\nSo - how are you going to make that revenue? Its not about your hackathon results, its about growth, performance, conversions and revenue!",
              "score": 1,
              "created_utc": "2026-01-15 10:01:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzvd2mi",
              "author": "Substantial-Suit-597",
              "text": "That HIPAA compliance and zero data retention is GOLD! That’s likely what closed the investment.",
              "score": 1,
              "created_utc": "2026-01-16 05:33:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzh2he2",
              "author": "Vanilla-Green",
              "text": "That’s true, I don’t know how to target enterprise tho never marketed to them not sure how to",
              "score": -4,
              "created_utc": "2026-01-14 03:03:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzher8k",
                  "author": "candleinthewind1997",
                  "text": "If they're HIPAA compliant, that's huge and that's something you can't do on your own. Medical privacy laws are very strict and one mistake can be a $$$ lawsuit. I can see why the competitor app would raise so much. A lot of medical apps/programs are buggy trash and we can't just like...text patient info.",
                  "score": 8,
                  "created_utc": "2026-01-14 04:19:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzh8k7h",
                  "author": "SenorTeddy",
                  "text": "If you want to go that route try researching it",
                  "score": 1,
                  "created_utc": "2026-01-14 03:39:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzhpree",
                  "author": "Difficult_Ad2864",
                  "text": "Do they have a deck or any information that might clue you in on crunchbase or any other tech sites? Study their tech and their sites, and try to see if you can figure companies that they’re selling to. \n\nIf they’re selling for a price, undercut them for example. If you have to, try to hire someone with experience specific to what you’re doing in B2B tech sales.",
                  "score": 1,
                  "created_utc": "2026-01-14 05:37:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzh1a0e",
          "author": "ConsciousLeader9448",
          "text": "You’re not gonna outmarket or out-quality a competitor that huge. And if your product is too similar, you’re just gonna live in their shadow. But if it has a defining feature that Wispr Flow doesn’t, you should be laser focused on marketing and exploiting that. And if you see enough interest, you can start thinking about raising more money",
          "score": 9,
          "created_utc": "2026-01-14 02:56:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzh1v3t",
              "author": "Vanilla-Green",
              "text": "Yes I was thinking of one, but they can copy the feature easily",
              "score": 2,
              "created_utc": "2026-01-14 02:59:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzh52m9",
                  "author": "Character-Role-600",
                  "text": "You need to get that out in the market. This massive company is probably not following your every move",
                  "score": 6,
                  "created_utc": "2026-01-14 03:18:40",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o086wt0",
                  "author": "NeedleworkerNo4900",
                  "text": "Then you don’t have a product.",
                  "score": 1,
                  "created_utc": "2026-01-18 03:12:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzhjf2x",
          "author": "Sketaverse",
          "text": "Go get a billion TikTok views and you’ll be there too",
          "score": 5,
          "created_utc": "2026-01-14 04:50:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhjhib",
              "author": "Vanilla-Green",
              "text": "But what content to post to get billion views",
              "score": 0,
              "created_utc": "2026-01-14 04:51:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzhxb91",
                  "author": "Sketaverse",
                  "text": "There’s a massive write up of it with a full breakdown",
                  "score": 2,
                  "created_utc": "2026-01-14 06:39:06",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzhnzkk",
                  "author": "SmartSasshole",
                  "text": "You can hire contract social media/ marketing managers to get you started. If you can't invest in outsourcing, watch how your competitors are reaching your target audience. \n\nYou don't want to copy them. You want to be inspired and observe how your market feels about the problem you're solving. Emotions drive a lot of purchases.",
                  "score": 1,
                  "created_utc": "2026-01-14 05:23:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzhn91e",
          "author": "kubrador",
          "text": "the $81M competitor thing is irrelevant. they raised that money to figure out if this market exists. you get to watch them spend it and learn for free.\n\nreal question: do your 25 installs include anyone who opened it twice? that's your answer. not \"is this fundable\" but \"does anyone actually want this\"\n\nyou built it in a week which means the app isn't your moat anyway. if this works, you win on distribution or some niche they're ignoring (accessibility? specific language? enterprise compliance?)\n\ndon't raise money. get 50 people using it daily first. that's like 2 months of work max to know if you're onto something.",
          "score": 5,
          "created_utc": "2026-01-14 05:18:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhq1pa",
              "author": "Difficult_Ad2864",
              "text": "They also set the market price",
              "score": 2,
              "created_utc": "2026-01-14 05:39:48",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzhol7p",
              "author": "Vanilla-Green",
              "text": "True agreed thank you trying out find out way to reach and sell to actual users",
              "score": 1,
              "created_utc": "2026-01-14 05:28:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzjoo1d",
          "author": "chibstelford",
          "text": "As a daily user of Wispr Flow, I downloaded your app and gave it a shot. It's not bad and the speech to text recognition is pretty good. Not 100% of what Wispr Flow offers, but somewhat close.\n\nThe biggest downside for me is I very much like my existing keyboard, and don't want to replace it with the very lo-fi one that your app contains. Your app would be much more adoptable if I could keep my existing keyboard and your transcription button was just an add-on to that.\n\nJust my 2c",
          "score": 4,
          "created_utc": "2026-01-14 14:46:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzjt33t",
              "author": "Vanilla-Green",
              "text": "Makes sense but our goal is for you to replace the keyboard permanently but I get where you are coming from",
              "score": 1,
              "created_utc": "2026-01-14 15:09:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nznf7iy",
                  "author": "chibstelford",
                  "text": "Sure... Best of luck!",
                  "score": 3,
                  "created_utc": "2026-01-15 01:26:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzhp1pb",
          "author": "Difficult_Ad2864",
          "text": "Happens a ton in my industry for my startup. On average, founders raise something like $30m+ off the bat. I couldn’t raise $1. I ended up investing myself. Without spending money I don’t have, I spent a year ingraining myself to become an industry expert. I realized that my COGS, with everything, was “only” $13,700 not including $200k manufacturing costs. I used my own money instead. \n\nThe same investors who rejected me are now confused as to how I managed to get everything up and running. Two of them have had to write off their investments. \n\nI know that, once I start scaling nationwide, I can go back to them, or possibly not even need external investors. I still haven’t paid myself anything in two years. It’s definitely a grind. Based on my experience, I wouldn’t invest this soon. Invest your own funds first, but you need to find a way to bootstrap and be efficient. It’s too early for external partners unless you have a product that is just THAT special and industry-changing. Invest in yourself instead for now. To be “fundable,” you need to show a good value proposition. What makes you stand out from the competition? Why should consumers buy your product? What’s your profit margin? There are also other factors that could be industry specific. For example, one investor that’s interested in my company right now told me yesterday that, “I want to see your product sold at this specific place that I like”",
          "score": 3,
          "created_utc": "2026-01-14 05:32:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzn5pby",
          "author": "Crowley-Barns",
          "text": "Did you check out Willow’s recent funding round?! $150m I think. \n\n(Willow do the same thing as Whisprflow and presumably OP.)\n\nIt’s nuts.",
          "score": 2,
          "created_utc": "2026-01-15 00:33:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzno8h2",
              "author": "Vanilla-Green",
              "text": "Crazy you know why",
              "score": 1,
              "created_utc": "2026-01-15 02:18:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nznohws",
                  "author": "Vanilla-Green",
                  "text": "Says 4.2 m tho",
                  "score": 1,
                  "created_utc": "2026-01-15 02:20:29",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzon3s7",
          "author": "mindpuzzleintern",
          "text": "What is the name of the app? And are you interested in growing that \nLet's jam onto that",
          "score": 2,
          "created_utc": "2026-01-15 06:11:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzonjnf",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-15 06:15:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzonjoj",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qcb5wj/competitor_raised_81m_ive_raised_81_am_i_wasting/nzonjnf/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-15 06:15:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzonkx1",
              "author": "Vanilla-Green",
              "text": "Yes it’s called Zavi",
              "score": 1,
              "created_utc": "2026-01-15 06:15:35",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nzoobuh",
              "author": "Vanilla-Green",
              "text": "You can check my profile it’s Zavi",
              "score": 1,
              "created_utc": "2026-01-15 06:21:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzoxeqz",
          "author": "HeadLingonberry7881",
          "text": "The competitor isn't on Android. What is your playstore link to test the app anf give you a feedback?",
          "score": 2,
          "created_utc": "2026-01-15 07:41:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzoxs3i",
              "author": "Vanilla-Green",
              "text": "It’s called Zavi, link is there on my profile",
              "score": 1,
              "created_utc": "2026-01-15 07:44:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nztaw8n",
          "author": "PanderBaby80085",
          "text": "I have a bit of experience that is relevant to your situation. I can’t say too much on here but I will DM you.",
          "score": 2,
          "created_utc": "2026-01-15 22:29:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzum2k7",
              "author": "Vanilla-Green",
              "text": "Great thanks",
              "score": 1,
              "created_utc": "2026-01-16 02:45:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o009x7h",
          "author": "snowboardlasers",
          "text": "It's not what you know or what you can do, it's who you know.",
          "score": 2,
          "created_utc": "2026-01-16 22:36:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01uaj3",
          "author": "OrganizationOne8338",
          "text": "You would have used an existing model while your competitor might have built a model , it’s the IP they own which is giving it such high valuation.",
          "score": 2,
          "created_utc": "2026-01-17 04:17:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07dpbc",
          "author": "GaryARefuge",
          "text": "There is so much wrong with how you are going about this and thinking about this.\n\nThere is so much horrible advice in here.\n\nYou are skipping about 1,000 critical steps and making erroneous comparisons to far more established and mature companies.  You're worried about things that you can't even begin to answer at the stage you are at currently.\n\n>a real startup worth grinding on or just a neat feature that I’ll never be VC-backed\n\nDon't be an idiot. Don't grind. Be patient. Be calculated. Be controlled. Work on this slowly and steadily within healthy boundaries that prioritize other aspects of your life and well-being. Don't fall into toxic bullshit that people in these communities push endlessly about going all in and rushing.\n\nYou need to focus on basic validation tests to see if what you built is something people want, enjoy using, benefit from, and find value in.\n\nYOU HAVE NO USERS. You have no revenue. YOU HAVE NO VALIDATION. You are still sitting on a huge mountain of assumptions.\n\nLearn *Lean Methodology*. Read the book, *Traction*.  \n\nYou clearly have no idea what you are doing, and you need to spend more time learning the basics.\n\nYou need to get your first customer. Then, enough customers to have a viable, sustainable business. Then, you can start to explore whether or not this could qualify as a VC-backed startup business. \n\n>would you invest in something like this? yes or no\n\nHell no. \n\nNo product validation. No operational validation.\n\n**There are three core types of validation that you need to achieve:**\n\n**Market Validation:** Validating that a market for your product/service exists and it is large enough to sustain your success \n\n**Product Validation:** Validating that the market wants your product, that they are willing to pay for it, that they enjoy it enough to continue using it, and that they enjoy it enough to tell others to use it \n\n**Operational Validation:** Validating that you and your team are capable of growing and running a successful company\n\nYou have no users. No customers. No revenue. No traction. Nothing. Only assumptions.",
          "score": 2,
          "created_utc": "2026-01-18 00:35:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07e25y",
          "author": "GaryARefuge",
          "text": ">is it obviously way too early to think about raising?\n\nYes. Obviously.  Why would any legitimate investor give you money? This is an insanely risky deal with no demonstrated upside at all.  You have nothing to demonstrate that you know what you are doing, know how to build a product people want, pay for, and love, know how to operate a successful business, know how to scale a business with investment capital, or anything else.\n\n>what would need to happen before this is even “fundable”?\n\n• Past successes (of any size) outside of this current startup\n\n• Existing Relationships\n\n• Experience (relevant most of all)\n\n• Expertise (relevant most of all)\n\n• Demonstrable Aptitude\n\n• Demonstrable Perseverance\n\n• Demonstrable Leadership\n\n• Demonstrable Strategic Decision Making\n\n• Demonstrable Fluidity\n\n• Demonstrable Communication Skills\n\n• Traction with this current startup\n\n• Product Performance and Scalability\n\n• Existing Patents, Copyrights, Trademarks\n\n• Product Validation with this current startup\n\n• Revenue from this current startup and the rest of your financials\n\n• Your cap table\n\n• Potential Scalability and Market Opportunity\n\n• Synergies with the investor's expertise, interests, experience, other portfolio companies\n\n• The Relationship you have with the investor\n\n• Likelihood of you being able to achieve success\n\nThis essentially equates to your Quality of Character & the Quality of the Deal. What exactly do you have to persuade an investor that you are worth taking a gamble on?  Not much from what you've shared.\n\nSo, focus on changing that before you try raising capital from investors.\n\nBut don't rush to do that either. You don't need to raise capital from investors to build a successful company.   In fact, far too many founders rush to raise, and it is a huge mistake for a variety of reasons.",
          "score": 2,
          "created_utc": "2026-01-18 00:37:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09fhcl",
          "author": "melchisiade",
          "text": "They got investor's Money because they probably have a business Plan, a structure, a marketed product and pitches to show around.",
          "score": 2,
          "created_utc": "2026-01-18 08:49:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhewpt",
          "author": "xatey93152",
          "text": "What is the name of your app?",
          "score": 1,
          "created_utc": "2026-01-14 04:20:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhf16z",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-14 04:20:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzhf190",
                  "author": "AutoModerator",
                  "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qcb5wj/competitor_raised_81m_ive_raised_81_am_i_wasting/nzhf16z/?context=3) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-14 04:20:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzhf4e3",
              "author": "Vanilla-Green",
              "text": "You can check on my profile it’s Zavi",
              "score": 1,
              "created_utc": "2026-01-14 04:21:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzhvuja",
          "author": "alp82",
          "text": "Didn't see the M and was utterly confused",
          "score": 1,
          "created_utc": "2026-01-14 06:26:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhw85k",
          "author": "Vanilla-Green",
          "text": "Ahaha",
          "score": 1,
          "created_utc": "2026-01-14 06:29:46",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o07sgow",
          "author": "gujuvenile",
          "text": "I use whispr flow. It's magical",
          "score": 1,
          "created_utc": "2026-01-18 01:53:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o086rgm",
              "author": "Vanilla-Green",
              "text": "Do try us",
              "score": 1,
              "created_utc": "2026-01-18 03:12:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qamrhu",
      "title": "If you had to start over, what would you do differently?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qamrhu/if_you_had_to_start_over_what_would_you_do/",
      "author": "William45623",
      "created_utc": "2026-01-12 05:42:17",
      "score": 23,
      "num_comments": 47,
      "upvote_ratio": 0.9,
      "text": "This could be about work, learning, habits, or life in general.\n\nIf you could go back and restart with what you know now, what’s one thing you’d change and what lesson did it teach you?\n\nOpen to any perspective.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qamrhu/if_you_had_to_start_over_what_would_you_do/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nz4fl49",
          "author": "kubrador",
          "text": "would've stopped reading business books and just started selling stuff way sooner\n\nspent like 2 years \"preparing\" which was really just procrastinating with extra steps. the learning happens when you're losing money and can't sleep, not when you're highlighting passages in your apartment",
          "score": 16,
          "created_utc": "2026-01-12 07:00:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz6rb2a",
              "author": "repready_ai",
              "text": "so true, most of the actual learning happens by doing. gets to a point where consumption of knowledge is just procrastination rather than action.",
              "score": 3,
              "created_utc": "2026-01-12 16:38:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nz4ichl",
          "author": "CleanOpsGuide",
          "text": "I’d stop confusing motion with progress.\n\nEarly on I spent too much time optimizing plans instead of validating reality. The biggest shift was focusing on one small action that created feedback, then sticking with it long enough to learn something real.\n\nMomentum usually comes after consistency, not excitement.",
          "score": 11,
          "created_utc": "2026-01-12 07:25:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4snxs",
          "author": "Which-Pie2787",
          "text": "Communication is a key to make you or break you. So if I had to start over, I would first try to communicate better and work on my introvertness. Due to lack of communication skills, I had missed on so big opportunities and I am alway miss-understood and ignored on decisonse.",
          "score": 7,
          "created_utc": "2026-01-12 09:01:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5c3ys",
          "author": "Individual-Spirit181",
          "text": "I would have surrounded myself with better mentors and more people who were ambitious. Who you spend your time with matters. Where you live matters.",
          "score": 5,
          "created_utc": "2026-01-12 11:57:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz6ph5c",
              "author": "Flod_Lawjick",
              "text": "How do you identify/find mentors?",
              "score": 1,
              "created_utc": "2026-01-12 16:29:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nz94nk7",
                  "author": "Individual-Spirit181",
                  "text": "Mentors: These are the people or entrepreneurs who are way more successful than you are. They are the people we look at and feel \"jealousy\" or low-key envy. Not actual malicious jealousy, but jealousy as our internal signal that what they are doing or have achieved - that's what we want. We don't even have to know them personally. We can study what they do, and what they've done to get where they are. On a local level, if you live in a big city with successful businessmen or women, go where they go, find entrepreneur or start-up networking events or seminars. Network with the big real estate agents, chamber of commerce or bankers in your area, they seem to know everyone. Find key businesses that are having success and ask to work with/for them for a few months as an intern. The knowledge you gain will be worth far more than a salary.",
                  "score": 1,
                  "created_utc": "2026-01-12 23:15:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz5q673",
          "author": "AmbitiousJump5768",
          "text": "Not hiring a fractional finance team sooner. When we guessed on our profit margins, whether to hire someone or go to a new location, how to get better interest rates on equipment loans, or do we have enough cash flow while we wait to get paid, etc. it was a disaster trying to figure this all out on a whim. Take ownership and know your numbers asap to know how to spot red flags early on.\n\nHiring with no structure. To hire and expect people to know what to do from day one is unfair to your team. They deserve your best and that includes your preparation to onboard them correctly.\n\nRunning a business leads to burn out really fast. Find hobbies and lean on the right people outside of the business that keep your mind and body active and clear.",
          "score": 3,
          "created_utc": "2026-01-12 13:31:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4vb7n",
          "author": "Simple-Climate-4385",
          "text": "Sarcastically, I will do the same, with just filtering some friends",
          "score": 3,
          "created_utc": "2026-01-12 09:27:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6skr1",
          "author": "Azaptive",
          "text": "I would have built way smaller from the start. Introduced engaged customers as early as possible and built a feature centred solely around them. Not a product, just a feature. Over time, adding features that serve this group of users, I’d have had not only a more fulsome product, but an immediately engaged audience of customers ready to buy. \n\nComing in with grand ideas was a pain in the butt!",
          "score": 3,
          "created_utc": "2026-01-12 16:43:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6xk6r",
          "author": "Intrepid_Boss9449",
          "text": "I’d start tracking inputs instead of obsessing over outcomes. Like a daily \"ship something\" habit, 30 to 60 minutes of learning, 5 reach outs, 1 workout. Outcomes come later but inputs compound and you can control them.",
          "score": 3,
          "created_utc": "2026-01-12 17:06:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4ggve",
          "author": "MORPHOICES",
          "text": "If I could start again, I’d take my time. \\~\n\nInitially, I confused excitement with forward momentum and reset the clock every couple of weeks.\n\nWhat I learned later is that most things only start making sense after the very boring middle.\n\nIf I had stuck with one thing longer I could have saved myself a lot of false starts.",
          "score": 2,
          "created_utc": "2026-01-12 07:08:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4jo9a",
          "author": "phoot_in_the_door",
          "text": "don’t rack up debt",
          "score": 2,
          "created_utc": "2026-01-12 07:37:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4kilp",
          "author": "Wtf_Sai_Official",
          "text": "Won't take debts",
          "score": 2,
          "created_utc": "2026-01-12 07:45:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4p7h7",
          "author": "TayyabArain",
          "text": "I’d focus less on trying to optimize everything early and more on just staying consistent. Most lessons only really stuck once I kept showing up long enough to see patterns.",
          "score": 2,
          "created_utc": "2026-01-12 08:28:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4c6t1",
          "author": "internetcookiez",
          "text": "invest more into s&p500 earlier",
          "score": 1,
          "created_utc": "2026-01-12 06:31:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4pvdl",
          "author": "Pytha8",
          "text": "I would not waste 3 first years of failing to be consistent, failing to do my habits, doing 30% of the work planned and go to bed and say \"lets do it tomorrow\". I'll prioritize every opportunity I have to make money even 30$, every call I get.",
          "score": 1,
          "created_utc": "2026-01-12 08:35:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4szt8",
          "author": "valvin1",
          "text": "I've started only in 2025 an e-commerce project. And the thing I've learnt even if it is intuitive: you need money! So first be sure you'll have enough money to start: stocks, solution, materials... 2000€ is not enough :)\n\nThe second learning, working as an employee and starting a business is not as easy as you believe.",
          "score": 1,
          "created_utc": "2026-01-12 09:05:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz50pg9",
          "author": "yihihi",
          "text": "Not thinking that I am superman and find people to work with. Not rushing the progress.",
          "score": 1,
          "created_utc": "2026-01-12 10:19:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz57nyv",
          "author": "Phreakasa",
          "text": "As soon as there is too much work, and you can afford it, get an employee. Learn to delegate. Otherwise, you will land in a golden cage.",
          "score": 1,
          "created_utc": "2026-01-12 11:21:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5gqbc",
          "author": "organicviolence",
          "text": "i wouldn't wait for the perfect billion-dollar idea and started with a boring business.",
          "score": 1,
          "created_utc": "2026-01-12 12:31:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5ubny",
          "author": "unstereotyped",
          "text": "Be a sugarbaby and marry rich.\n\n/s\n\nI would not go into business with a family member. What a disaster.",
          "score": 1,
          "created_utc": "2026-01-12 13:55:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5v090",
          "author": "chorefit",
          "text": "Not pay an Instagram influencer for marketing",
          "score": 1,
          "created_utc": "2026-01-12 13:58:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5v7ur",
          "author": "Weekly_Accident7552",
          "text": "I would focus on building systems the team could actually use before scaling. Early on everything lived in my head and it broke as soon as more people joined. Once we put repeatable work into shared checklists in Manifestly, scaling stopped feeling chaotic. The lesson was teams scale systems, not effort.",
          "score": 1,
          "created_utc": "2026-01-12 14:00:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz613sv",
          "author": "Own_Republic275",
          "text": "changed my pov to be focused on generating money quickly somehow while bootstrapping and then after that focus on other factors",
          "score": 1,
          "created_utc": "2026-01-12 14:31:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz68ftu",
          "author": "Chemical_Strength380",
          "text": "Work a way out to make money myself so i had more freedom and time to myself, and not a 9-5 slave",
          "score": 1,
          "created_utc": "2026-01-12 15:09:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6cit0",
          "author": "Equivalent_Crow_9009",
          "text": "I’d be more patient with myself.\n\nLesson learned: consistency matters more than speed.",
          "score": 1,
          "created_utc": "2026-01-12 15:29:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6i1yo",
          "author": "cathnowtt",
          "text": "I’d stop chasing “perfect” and start shipping sooner. Most progress comes from feedback and iteration, not overthinking. The lesson was that action compounds faster than planning ever will.",
          "score": 1,
          "created_utc": "2026-01-12 15:55:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6qteu",
          "author": "bageltakenrun",
          "text": "Networking and getting stuff done.\n\nHonestly, imma hell of a procrastinator. and I wish I wouldv'e started networking sooner",
          "score": 1,
          "created_utc": "2026-01-12 16:35:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6ydaz",
          "author": "TypicalValuable8467",
          "text": "I’d focus way earlier on leverage instead of effort.\nI spent too long optimizing skills in isolation (learning more, working harder) instead of building things that compound: audience, distribution, reusable systems, relationships. The lesson for me was that being “good” isn’t enough being visible and well-positioned matters just as much, sometimes more.\nIf I had to restart, I’d still learn the fundamentals, but I’d ship publicly sooner and optimize for feedback + compounding from day one.",
          "score": 1,
          "created_utc": "2026-01-12 17:10:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz76udj",
          "author": "Sima228",
          "text": "I’d start talking to real people much earlier instead of trying to “figure things out” alone. Most of my wrong turns came from building or optimizing in isolation, not from lack of effort or skill. Progress sped up the moment feedback became a habit, not a milestone.",
          "score": 1,
          "created_utc": "2026-01-12 17:49:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz7fm6v",
          "author": "SolidStrain1747",
          "text": "Live with providers till 27/29 yrs old.",
          "score": 1,
          "created_utc": "2026-01-12 18:28:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz7h6cq",
          "author": "Page10Results",
          "text": "Start ORM way earlier so I could have a better standing now on our platforms. I honestly didn’t give it much thought past checking the top results for my brand, but when we hired Reputation Pros, they walked us through the benefits and they were pretty clear to see. \n\nNow, we have a presence online which helps with new customers.",
          "score": 1,
          "created_utc": "2026-01-12 18:35:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz7h6qx",
          "author": "achintyabhavaraju",
          "text": "I would be more patient in learning than rushing to execute and regretting later. Regret is so costly for an entrepreneur. One cost me 7 years and a lot of money!",
          "score": 1,
          "created_utc": "2026-01-12 18:35:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz858tw",
          "author": "dungie79",
          "text": "From a marketer’s POV: I’d start building a personal brand way earlier.\n\nEven just a simple LinkedIn presence or a basic portfolio site. I waited too long thinking “I’ll do it when I’m more experienced,” but visibility compounds just like skills do.\n\nYou don’t need to be an expert to start sharing",
          "score": 1,
          "created_utc": "2026-01-12 20:25:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz8kgwx",
          "author": "ConstructionLoud1973",
          "text": "I’d skip the endless “research” phase and just launch the damn thing sooner. action beats perfection every time, the real lessons only hit when money’s actually on the line.",
          "score": 1,
          "created_utc": "2026-01-12 21:37:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzabo4n",
          "author": "alexdoescyber",
          "text": "Start with a sales system",
          "score": 1,
          "created_utc": "2026-01-13 03:07:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzaiye9",
          "author": "MMWRejoice",
          "text": "This is solid advice. What helped me most at the beginning was focusing on one income idea instead of jumping around.",
          "score": 1,
          "created_utc": "2026-01-13 03:47:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdbexj",
          "author": "Tall-Pension8879",
          "text": "Wish I had realized life is a game earlier so I would not have taken everything so seriously.",
          "score": 1,
          "created_utc": "2026-01-13 15:47:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzidwha",
          "author": "FieldNoticing",
          "text": "I’d stay in medical school, and make sure my mom invested in Apple when they were first raising money!",
          "score": 1,
          "created_utc": "2026-01-14 09:13:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziyhn7",
          "author": "Leemulvs",
          "text": "I would have worked out what pays well and gone for it. I never knew what I wanted to do aoshould have jus picked something and gone for it.",
          "score": 1,
          "created_utc": "2026-01-14 12:13:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlrjwl",
          "author": "annaleeblue",
          "text": "Go to school for something I really want to do, not what everyone said I should do.",
          "score": 1,
          "created_utc": "2026-01-14 20:28:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp0vie",
          "author": "Smile-Cat-Coconut",
          "text": "To be totally honest I would have trained for a career that would give me a ready income and not gone into business for myself. It’s been a brutal road since 1999 and I probably would have had a much better life with more rich and interesting experiences dealing with people. Not to mention health insurance and a 401k.",
          "score": 1,
          "created_utc": "2026-01-15 08:13:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o038t3s",
          "author": "rdpl_",
          "text": "i wouldn't ask randoms on reddit but gtfo and ask the ones who achieved something",
          "score": 1,
          "created_utc": "2026-01-17 11:35:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5ts9e",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-01-12 13:52:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzui256",
              "author": "cipioxx",
              "text": "Facts",
              "score": 1,
              "created_utc": "2026-01-16 02:23:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qbzves",
      "title": "I built my business to $15k MRR with content creation without paid ads, here's howI built my business to $15k MRR with content creation without paid ads, here's how",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qbzves/i_built_my_business_to_15k_mrr_with_content/",
      "author": "simple_pimple50",
      "created_utc": "2026-01-13 18:57:50",
      "score": 21,
      "num_comments": 3,
      "upvote_ratio": 0.76,
      "text": "\n\nI hit $15k MRR last month and haven't spent a dollar on paid ads. Everything has been organic content, here's the approach and lessons\n\nThe Strategy: I focus on one platform first until you really understand it. I went all in on linkedn for 8 months before expanding. Got to 12k followers and consistent engagement then expanded to twitter and instagram using similar content but adapted for each platform\n\nCreate one good piece of content per week and multiply it across formats. One detailed post becomes a thread, carousel, newsletter and short video. Im using blotato to handle platform specific formatting which saves hours\n\nEngage genuinely with your audience. I spend 30 min daily responding to comments and dm’s. Thats where real relationships and customers come from, not just posting and disappearing.\n\nLessons: Consistency beats perfection. I posted 5 times per week even when I thought the content wasnt great. Showing up regularly matters more than occasional perfect posts\n\nAuthenticity wins, people can tell when you're being real vs trying too hard. Share actual experiences, wins and losses because that's what resonates\n\nLong form content > short form for trust building. My detailed posts get way more client inquiries than quick tips\n\nContent roi takes time. First 4 months I got basically nothing, month 5-6 things started picking up, month 7+ it really accelerated. You need patience\n\nCurrent stats:\n\n- 18k followers on linkedn\n- 6k on twitter\n- 4k on Instagram\n- $15k MRR\n- Zero ad spend\n\nIf you're bootstrapping, content is your best bet. Takes time but it works.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qbzves/i_built_my_business_to_15k_mrr_with_content/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzqe7fx",
          "author": "AdPlastic5148",
          "text": "If you could talk more about what kind of content really stands out for you?",
          "score": 1,
          "created_utc": "2026-01-15 14:28:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o019vrx",
          "author": "Willing_Builder4289",
          "text": "Solid breakdown. Most people don’t have the consistency to last 8 months on one platform that alone explains the MRR.\nCurious though: at $15k MRR, what % of your audience actually converts without you being personally involved with the lead?",
          "score": 1,
          "created_utc": "2026-01-17 02:05:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfkjip",
      "title": "I studied 47 SaaS products that went from $0 to $10k MRR last year. Here's what they all did right.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qfkjip/i_studied_47_saas_products_that_went_from_0_to/",
      "author": "whyismail",
      "created_utc": "2026-01-17 18:17:45",
      "score": 21,
      "num_comments": 4,
      "upvote_ratio": 0.84,
      "text": "Hey, I went into SaaS last year with my tool Brandled (helps founders grow on X & LinkedIn) in a pretty competitive space with $0 and 0 audience and ended up wasting six months straight on the wrong things.\n\nSpent half a year stuck at $0 MRR.\n\nThen I became obsessed with one question: what separates SaaS products that make it from those that die at zero.\n\nSo I went down a rabbit hole. Studied 47 founders who went from $0 to $10k+ MRR in the last year. Watched their podcasts, red their tweets, and everything i could get my hands on.\n\nHere's what I learned from all of them, and what I was doing catastrophically wrong.\n\n**1. Frictionless signup isn't optional**\n\nEvery successful product had one-click social login. Google OAuth mostly.\n\nThe ones that died had email verification flows, password requirements, multi-step forms asking questions before showing any value.\n\nThe math is brutal. If you lose 30% of people at signup and you're getting 1000 visitors a month, that's 300 potential customers gone. At a 10% trial-to-paid conversion, that's 30 paying customers per month lost to signup friction alone.\n\nI started with magic link only. Completion rate was 45%. Added Google login. Jumped to 78% the next day.\n\nEvery percentage point of friction at signup costs you real revenue. Most founders don't even measure this.\n\n**2. They launched in weeks, not months**\n\nNone of them spent 6 months building in secret.\n\nAverage time from idea to first paying customer: 3-6 weeks. They launched with ONE core feature. Then spent most of their time marketing it.\n\nI did the opposite. Spent 3 months building features before launching. Content generation, analytics, scheduling, competitor tracking, everything. Got 12 signups. Zero paying customers.\n\nConvinced myself the product wasn't good enough. Spent another month adding features. Still nothing.\n\nThe problem wasn't my product. Nobody knew it existed.\n\nAfter I stopped building and started marketing, posting on Reddit, doing LinkedIn outreach, documenting on X, I hit $126 MRR in 4 days.\n\nSame product. Different approach.\n\nPost-launch is 90% marketing, 10% product.\n\n**3. They were shameless about promotion**\n\nThe successful ones talked about their product everywhere. Not spammy. Just never hiding it.\n\nReddit threads. Twitter replies. Forum comments. Anywhere their audience hung out.\n\nThey'd give genuinely helpful advice first, then naturally mention their tool when relevant.\n\nStarted being shameless. Every relevant conversation where someone complained about the problem I solved, I'd help them first, then mention I built something for this.\n\nA few people definitely get mad but I feel the upside is worth it.\n\nYour product won't discover itself.\n\n**4. They asked churned users what went wrong**\n\nEvery successful product had a system for this. Automated email going out when someone cancels asking what didn't work.\n\nI was doing none of this. Saw cancellations in Stripe, felt rejected, moved on. Never asked why. Never learned anything.\n\nNow every cancelled user gets emails through and automated email sequence and the replies are done by me personally.\n\nResponse rate is 40%. The feedback is literally gold.\n\nEvery single one is fixable. But I only learned because I asked.\n\nChurned users tell you the real truth about your product.\n\n**5. They used their own product religiously**\n\nNot one successful founder was building something they didn't use daily. They were their own heaviest users.\n\nI wasn't doing this. Used my tool occasionally to \"test\" but wasn't relying on it daily.\n\nForced myself to create all my content through my own product for a week. Found 7 bugs in 30 minutes that never showed up in testing.\n\nGenerate button didn't work on mobile. Analytics took 8 seconds to load. Onboarding skipped steps if you refreshed.\n\nMy users were experiencing this and not telling me. They were just leaving.\n\nIf you're not using your product daily as a real user, you're building blind.\n\n**6. They fixed retention before scaling acquisition**\n\nBiggest strategic difference.\n\nFailed products: 30-50% monthly churn, constantly chasing new users to replace ones leaving.\n\nSuccessful products: Fixed retention first, got churn to 10-20%, then scaled acquisition.\n\nThe math: At 40% churn, you acquire 40 customers to net 24. At 15% churn, you acquire 40 and net 34. Same effort, 42% better results.\n\nI was obsessed with new signups. Ignored my 40% churn rate. Got 10 new customers, lost 4. Net: 6.\n\nStopped all acquisition. Fixed onboarding from 8 steps to 3. Added email sequences. Built features retained users asked for. Churn dropped to 15%.\n\nSame acquisition effort, now net 8-9 customers instead of 6.\n\nRetention is the foundation. Acquisition is the multiplier.\n\n**7. They shipped MVPs with one feature**\n\nEvery successful product launched stupidly lean. One core feature done exceptionally well.\n\nI launched with 7 features: content generation, analytics, scheduling, competitor tracking, SWOT, comments, hashtags.\n\nCodebase was a nightmare. Users were confused. I was maintaining features 3% of users touched.\n\nShould've launched with one thing: AI content that sounds human. Made that 10x better. Everything else later based on what paying customers asked for.\n\nYour MVP should make people say \"this solves my exact problem\" even if ugly and missing features.\n\nNot \"wow, so many features\" while solving nothing particularly well.\n\n**8. They priced based on value, not competition**\n\nNone of them raced to the bottom on pricing.\n\nThey looked at the value delivered. Hours saved. Revenue generated. Pain eliminated.\n\nThen priced a fraction of that value.\n\nI priced at $19/month because competitors were at $29-39. Thought I'd win on price. Just looked cheap and inferior.\n\nNeeded 263 customers to hit $5k MRR at $19 versus only 128 at $39.\n\nRaised price to $29-39. Conversions didn't drop. They improved slightly.\n\nHigher price signaled solving a valuable problem.\n\nPeople who care about $10 differences aren't your best customers. They'll churn for anything $3 cheaper.\n\n**9. They automated relationship building**\n\nEvery successful product had email sequences from day one. Not promotional. Actual value and engagement.\n\nWelcome emails. Feature education. Check-ins. Re-engagement for quiet users. Win-back for churned users.\n\nI was sending nothing after signup. Users signed up, got busy, forgot, churned.\n\nEngagement doesn't happen by accident. You engineer it.\n\n**10. They validated with money, not words**\n\nThe problem with feedback: it's free. People say nice things because it costs them nothing.\n\nI built features based on \"that would be helpful\" comments from users who weren't even paying. Wasted weeks on features nobody used.\n\nNow I only build what paying customers explicitly request.\n\nMoney is the only validation that matters. Words are cheap. Credit card numbers are truth.\n\n**The one thing they all had**\n\nThey didn't quit when it felt hopeless.\n\nThey all hit $0 for months. Got depressed. Questioned everything. Wanted to shut it down.\n\nBut didn't.\n\nThe difference between $0 and success wasn't talent or luck. It was not quitting before they figured out what works.\n\n90% of SaaS products die not because they couldn't work. Because the founder quit too early.\n\nIf you're stuck at $0, study the people who've made it. Not the outliers. The normal founders who went from $0 to $10k.\n\nThey're not special. They just did specific things that compound and didn't quit when it got hard.\n\nThe playbook is right there. You just have to execute it.\n\nHappy to answer questions or go deeper on any of this.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qfkjip/i_studied_47_saas_products_that_went_from_0_to/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o09hxii",
          "author": "Training-Dinner1660",
          "text": "Muy buen análisis. El único matiz que añadiría es el **sesgo del superviviente**: muchos hicieron exactamente esto y aun así no llegaron (👆🏼 el primero)\n\nLo valioso aquí no es la checklist, sino normalizar lo largo y mentalmente duro que es quedarse en $0 durante meses antes de que algo empiece a moverse 😅",
          "score": 1,
          "created_utc": "2026-01-18 09:11:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0a5d34",
          "author": "GnirobSW",
          "text": "7. Can you give some examples of the one feature SaaS that were successful?",
          "score": 1,
          "created_utc": "2026-01-18 12:39:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05qnfr",
          "author": "AnonJian",
          "text": "Certainly sounds good, but you assume those who fail had a choice. Build It And They Will Come is a blind launch. And yeah, when you are trying to hit a user market-blind, you will be flinging features right and left in desperation.\n\nMinimalism doesn't mean crippleware, it means building from a definitive key insight about the target customer. You can't do that if you consider launch the perfect time to go looking for the user. People don't post asking where to find the first hundred users because they understand the user, quite the opposite.\n\nPeople are using features just like shotgun pellets are used by a poor marksman. Where the analogy breaks down is a marksman doesn't tightly and deliberately shut his eyes before pulling the trigger, shotgun or sniper rifle. \n\nThis happened to you because you flatly rejected the advice. This happens to everyone else because they turn their back on Lean Startup methodology and, yes, Minimum Viable Product. Post anything, everyday, nothing ever changes.",
          "score": 1,
          "created_utc": "2026-01-17 19:34:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08kefn",
          "author": "dafuqherby",
          "text": "Thank you so much for sharing! I took note of a lot of what you said. I am pretty sure that every topic you talked about will be worth paying attention to.\nMay I ask you where do you usually find content about those founders? I fell like following some of them for inspiration.",
          "score": 0,
          "created_utc": "2026-01-18 04:34:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdbyl2",
      "title": "What security do small retail shops in Italy usually need?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qdbyl2/what_security_do_small_retail_shops_in_italy/",
      "author": "Sorry-Orchid-9821",
      "created_utc": "2026-01-15 06:18:15",
      "score": 19,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I'm getting ready to open a little retail store in Italy and want to keep things safe for my team and customers without overspending. Shoplifting happens, especially in busier areas, so I'm trying to figure out the practical approach. \n\nA lot of small shops seem to rely on good cameras, motion-sensor alarms, bright lighting, and clear signage. But in some spots (city centers, higher-value items), people also bring in private security guards.\n\nIf hiring a private agency makes sense, what should I check to pick a reliable one, proper licensing (TULPS), retail-specific experience, GDPR compliant camera setup, and realistic pricing?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qdbyl2/what_security_do_small_retail_shops_in_italy/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzqju7c",
          "author": "Adventurous_Mail9055",
          "text": "For retail stores, I’d recommend going with a professional security agency that specializes in commercial spaces. Slyservice helped me set up a comprehensive security solution for my store, including both physical guards and video surveillance. It made a huge difference in preventing theft and ensuring safety.",
          "score": 4,
          "created_utc": "2026-01-15 14:56:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzmb4u",
          "author": "Tight-Preference-823",
          "text": "Hi u/Sorry-Orchid-9821, that's a great question! I've done some research on this topic. For small retail shops in Italy, it's common to use a combination of cameras, motion-sensor alarms, and clear signage to deter shoplifting. Additionally, some shops opt for private security guards, especially in high-risk areas. It's also essential to train staff on how to handle shoplifting incidents and to have a good relationship with local law enforcement.",
          "score": 0,
          "created_utc": "2026-01-16 20:43:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcelq8",
      "title": "Why travel agents find booking tours and experiences the most time consuming task",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qcelq8/why_travel_agents_find_booking_tours_and/",
      "author": "Potential_Force_4136",
      "created_utc": "2026-01-14 05:11:04",
      "score": 14,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "I love planning trips, but booking tours and activities has always been the most frustrating part of my workflow, half the time i m chasing confirmations, double checking details, or following up instead of actually advising my clients. It turns something that should be simple into a whole project. I just want one place where i can search experiences, book them, and move on with my day without adding more admin or mental load.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qcelq8/why_travel_agents_find_booking_tours_and/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzhmqqo",
          "author": "These_Run_7070",
          "text": "having a single search and book platform would save so much time, but i always notice there are gaps with inventory or service in every tool i have tried.",
          "score": 5,
          "created_utc": "2026-01-14 05:14:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhn08q",
          "author": "kubrador",
          "text": "honestly this reads like you're about to pitch your own tool lol\n\nbut yeah tour booking is a mess because the industry is fragmented af. you've got viator, GetYourGuide, local operators with websites from 2006, some guy named Paolo who only responds on WhatsApp\n\nthe \"one place\" thing doesn't really exist because operators don't want to be commoditized and aggregators take fat commissions",
          "score": 3,
          "created_utc": "2026-01-14 05:16:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzi1nb2",
              "author": "Potential_Force_4136",
              "text": "I am not pitching anything. I am genuinely just trying to figure out how other people handle the fragmentation and admin load",
              "score": 1,
              "created_utc": "2026-01-14 07:16:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzhnf08",
          "author": "Appropriate-Plan5664",
          "text": "Yup booking tours always feels like spinning plates, especially when every platform has its own quirks and confirmation delays.",
          "score": 2,
          "created_utc": "2026-01-14 05:19:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhr1tq",
          "author": "Secret-Boot-8924",
          "text": "The weirdest thing is that flights and hotels got so much easier over the years but tours seem stuck in the past, almost like the systems are held together with tape.",
          "score": 2,
          "created_utc": "2026-01-14 05:47:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhzvvy",
          "author": "Curious-Session4119",
          "text": "From a workflow optimization perspective, the core problem is fragmented data and manual reconciliation. Most booking platforms aren’t designed for multi-client visibility or bulk tracking, which leads to repeated follow-ups and cognitive overhead.  \nA more scalable approach is to centralize booking data into a single system",
          "score": 2,
          "created_utc": "2026-01-14 07:01:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhzye5",
              "author": "Curious-Session4119",
              "text": "ideally one that supports:\n\n* API integrations with major experience providers for automatic confirmations\n* Client specific dashboards showing booked vs. pending activities\n* Automated reminders for both agents and clients\n* Reporting on revenue and commissions",
              "score": 2,
              "created_utc": "2026-01-14 07:02:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzhz50h",
          "author": "SpecialistAd7913",
          "text": "part of the challenge is that tours and experiences are inherently fragmented. One approach that works for me is batching all booking related tasks into dedicated time blocks instead of handling them piecemeal. It makes the admin feel less chaotic and keeps the mental load from spilling into client interactions",
          "score": 1,
          "created_utc": "2026-01-14 06:54:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziqnb7",
          "author": "samexplorer69",
          "text": "what if we can create an ai agent that just surf around the web collect the data along with availability, pricing, etc and also with other social platforms along with rating and review photos video and link and evaluate the whole data on its own  \nand give us the best experience by matching our trip plans",
          "score": 1,
          "created_utc": "2026-01-14 11:11:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzk7kb6",
          "author": "Rich-Editor-8165",
          "text": "Because most tours and activities still rely on manual processes. Different vendors use different systems, confirmations are slow, details change last minute, and there’s rarely one clean place to manage everything. What should be a quick booking turns into a lot of chasing and double checking, which adds up fast.",
          "score": 1,
          "created_utc": "2026-01-14 16:16:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qca5z8",
      "title": "Selling concert and event packages. Curious what you guys think and how I could improve",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qca5z8/selling_concert_and_event_packages_curious_what/",
      "author": "Scalar_Shift",
      "created_utc": "2026-01-14 01:42:12",
      "score": 11,
      "num_comments": 10,
      "upvote_ratio": 0.92,
      "text": "I originally posted this in on the flipping subreddit but got told it belonged here so hopefully this is the right place for this. I also want to add a disclaimer that, while I do make money off of events like concerts, plays, sports, etc. I do everything in my power to add value and I never just straight up resell tickets on their own. Ultimately I sell total event packages but I’m a big music lover so concerts are my bread and butter and on the rare occasions I can’t fill the bookings I give the tickets away for free. \n\r\nI live in a very touristy area that always has some sort of events going on and a couple of years ago I had to travel for months at a time for work. I listed my place on AirBnB and my buddy helped run it while I was away. It did fine. Nothing crazy but it was certainly nice extra cash. \n\r\nAs you’d expect, bookings often correlated with big events. So we eventually started experimenting with offering full trip packages instead of just lodging. I’d post in fan forums, Facebook groups, and occasionally relevant subreddits when a show is announced and offer a bundled option that includes:\n\r\n●\tConcert tickets\n\r\n●\tLodging at the AirBnB\n\r\n●\tTransport to/from the venue\n\r\n●\tA band T-shirt + poster\n\r\nIt ended up doing so well that when I stopped traveling I invested in a bigger place to keep it going and land larger groups. The response was significantly better than I expected, especially for weeknight shows that the Airbnb would normally be empty.\n\r\nWhat really made this work long-term is the repeat customers. People who love concerts REALLY love concerts. Once someone has a great experience, they’ll come back for another show, sometimes multiple times a year. I also keep an email list of past guests, so a lot of events sell out fast without much effort.\n\r\nOn top of that, I quietly include a few extras that I don’t advertise, just to exceed expectations:\n\r\nA framed photo from the weekend (I set up a small photo station near the entrance with an event-themed backdrop and everyone takes photos before heading out while they’re all dressed up). A welcome basket with water, ponchos, snacks, and a printed guide with venue tips + best local food and drinks. And everyone’s favorite… while guests are at the show, I prep a pile of grilled cheese sandwiches so there’s a drunk midnight snack waiting when they get back. People go absolutely nuts for it and the word of mouth has been massive.\n\r\nFrom an ops side, the biggest challenge for me was landing the actual tickets without paying insane resale markups. I organized around early access and planning. Knowing which shows were coming, when presales dropped, and which ones were actually worth building packages around. I get all of my info from venues email lists and presale sites. I used to use presalecodefinder but got sick of the ads so I switched to presale.codes. I prefer it because you can set alerts and search by location instead of just artists like most other sites.\n\r\nLike I said, I love concerts and love being able to monetize that passion while sharing it with others. While the money isn’t enough to replace my actual job, it’s been significant enough for me to rapidly increase my savings and put me on track to FIRE in the next few years… hopefully. \r\nI mainly want to know how can I expand this beyond myself? I’d love to do it full time but I feel like I’ve plateaued and I probably couldn’t run two by myself. Any advice?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qca5z8/selling_concert_and_event_packages_curious_what/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzhvh52",
          "author": "Inevitable_Tree_2296",
          "text": "How difficult is it to consistently get tickets for groups? I'd assume you're housing like 6-8 people if you upsized your airbnb.",
          "score": 8,
          "created_utc": "2026-01-14 06:23:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhydrx",
              "author": "Scalar_Shift",
              "text": "Yeah its a 4 bedroom and sleeps 2 per room. For the tickets, it's not as bad as people make it out to be. Not every show is Taylor Swift levels of demand. As long as I get the presale code, which is nearly every time with the aggregators and venue emails, then it's not really a problem",
              "score": 1,
              "created_utc": "2026-01-14 06:48:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nziax8d",
                  "author": "Strong_Pool_4000",
                  "text": "But why use an aggregator instead of just signing up for the artists email lists and such? I feel like that'd be more consistent.",
                  "score": 1,
                  "created_utc": "2026-01-14 08:44:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzgw1ox",
          "author": "ImpulseTravel",
          "text": "I love that you’re adding value vs just scalping tickets.",
          "score": 2,
          "created_utc": "2026-01-14 02:27:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhdbny",
          "author": "Late_Extent_1463",
          "text": "This is sick. Its like being a travel agent except specifically for concerts.",
          "score": 2,
          "created_utc": "2026-01-14 04:09:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhhvsg",
              "author": "Scalar_Shift",
              "text": "Yeah that's a great way to put it! The value comes from the ease of having everything taken care of and not having to worry about booking it all separately and managing ubers (which is an absolute nightmare when leaving a venue btw). I know the space very well now so I always know the best routes and times to avoid severe traffic but also not have everyone there so early that they may as well be camping out lol.",
              "score": 1,
              "created_utc": "2026-01-14 04:40:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzgvc1u",
          "author": "honestfyi",
          "text": "This sounds like a ton of work but really innovative. Write a how to guide and sell it to Airbnb hosts? Or offer to run the back end for existing hosts in relevant markets? Could work well if you focus on some specific bands with an enthusiastic fan base. \n\nAlso you could reach out to band managers maybe. I have a friend who tours nationally and they always tack on some weeknight shows in the markets they’re traveling to. I’ve toured with them, those shows tend to be less well attended. They might appreciate what you’re doing to help get fans to these shows.",
          "score": 1,
          "created_utc": "2026-01-14 02:23:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbupew",
      "title": "Where do you find likeminded entrepreneurs?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qbupew/where_do_you_find_likeminded_entrepreneurs/",
      "author": "snoozebuttonn",
      "created_utc": "2026-01-13 15:44:41",
      "score": 11,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "Hey everyone 😁 I’m a young software engineer based out of Atlanta and I’ve been actively working on my own software company for a bit. I’m curious where are some of the best places or ways to meet other entrepreneurs? I’m more so interested in networking with other entrepreneurs, not even just tech alone.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qbupew/where_do_you_find_likeminded_entrepreneurs/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzdncz3",
          "author": "Sudden-Context-4719",
          "text": "Check out local startup meetups or coworking spaces in Atlanta, they usually have events where entrepreneurs hang out. Also try Reddit subs to connect online.",
          "score": 3,
          "created_utc": "2026-01-13 16:42:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzf5ule",
              "author": "snoozebuttonn",
              "text": "Yeah i’m gonna give this a shot!",
              "score": 1,
              "created_utc": "2026-01-13 21:02:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzejg0l",
          "author": "Nightcoon3",
          "text": "Honestly, try join some hobby/activities in your area, I've made some really great connections with people from all backgrounds and surprisingly a lot of founders of startups and other entrepreneurs.",
          "score": 2,
          "created_utc": "2026-01-13 19:18:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzezwez",
          "author": "Lucky-Back-5239",
          "text": "I feel like local events and social media, would love to contact if you want!",
          "score": 2,
          "created_utc": "2026-01-13 20:34:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzec0uh",
          "author": "HucciBucci",
          "text": "Im a business broker! So I’m in the business of sticking my nose in other people’s business ;)\n\nIndustry events if you’re in the city, follow up with contact details. Finding opportunities for public speaking works well too. Online spaces (like here!), and engaging locally on linkedin with questions/comments. Finding a network through your work is great too- past customers for focus groups, subcontractors, that kind of thing. Just a couple of ideas!\n\nAlso in GA, but not Atlanta. Feel free to DM sometime.",
          "score": 1,
          "created_utc": "2026-01-13 18:45:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzf63kn",
              "author": "snoozebuttonn",
              "text": "Okay thanks for your insight this is pretty solid!",
              "score": 2,
              "created_utc": "2026-01-13 21:03:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfhgou",
          "author": "MingleMinds",
          "text": "I'm in the same boat here in Dallas. I can link up with founder in are all AI focused or SaaS but can't find groups that are consumer focused.",
          "score": 1,
          "created_utc": "2026-01-13 21:56:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzj41ur",
          "author": "MixSad3421",
          "text": "Hello everyone, i would also like to network but im kinda isolated n brasil in a small city. im French and would like to network with french or english speaking person, in person here its impossible to meet anyone with those criterias, any ideas on how to network online, or online entrepreneurs communities?",
          "score": 1,
          "created_utc": "2026-01-14 12:51:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzl41q1",
          "author": "uepodcast2021",
          "text": "Your doing it right now! Reaching out here is an amazing first step so good for you! Also many Facebook and LinkedIn groups are super helpful. \n\nIs there a specific reason you want to reach out to entrepreneurs? What are you hoping to accomplish? \n\nJuat curious 😁",
          "score": 1,
          "created_utc": "2026-01-14 18:41:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzlrwg4",
              "author": "snoozebuttonn",
              "text": "Honestly just for the exposure. I’m only 23 but have lots of technical experience building software and have had this constant feeling to build my own thing. I also have found out that not everyone runs a business the same so it’s interesting to learn from other people’s perspective.",
              "score": 1,
              "created_utc": "2026-01-14 20:29:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o078imh",
          "author": "Alarmed-Cattle-2728",
          "text": "I am also a software engineer based out of Atlanta have some idea and currently working on a hobby project, maybe we can collaborate…",
          "score": 1,
          "created_utc": "2026-01-18 00:08:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qb0pp5",
      "title": "Solo founder. $126 MRR in 4 days after 6 months at $0. The stuff nobody wants to hear.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qb0pp5/solo_founder_126_mrr_in_4_days_after_6_months_at/",
      "author": "whyismail",
      "created_utc": "2026-01-12 17:11:44",
      "score": 9,
      "num_comments": 4,
      "upvote_ratio": 0.8,
      "text": "Look, I know this isn't some $50k MRR flex... but hear me out.\n\nI see you grinding at 2 AM, convincing yourself that \"one more feature\" will finally get you customers. It won't.\n\nI wasted 6 months building shit nobody asked for before I realized something - as a solo founder stuck at $0, your problem isn't your product. It's everything else. Here's exactly what changed:\n\n**1. I Stopped \"Building\" and Started Talking**\n\nBig mistake: I spent 5 months coding in isolation thinking \"build it and they will come.\"\n\nThey didn't come.\n\nThen I forced myself to do something uncomfortable - I started cold messaging 50 people on LinkedIn every single day. Not copy-paste spam. Actually personalized messages to people who engage with top posts in my niche.\n\nResponse rate: 15-20%.\n\nThese people told me what they actually wanted. \n\nYour obsession with coding is just avoiding rejection.\n\n**2. Fuck Your Feature List**\n\nThis one hurt but... I deleted 7 features I spent weeks building.\n\nTurned out 3% of users ever clicked on them.\n\nStripped everything down to ONE thing: AI content that sounds like you, not ChatGPT.\n\nMade that 10x better instead of adding more mediocre features.\n\nYour feature bloat is killing you. Pick one thing and make it unfairly good.\n\n**3. The Pricing Move That Felt Insane**\n\nStarted at $19/month to \"compete\" with bigger tools at $39.\n\nConversion rate: 6%.\n\nThen I did something that felt stupid - raised it to $29/month.\n\nConversions went UP to 11%.\n\nPlus the customers who complained about the $10 difference:  \n  \nThey were going to be nightmare support tickets anyway.\n\nStop racing to the bottom.   \n  \nYour low price isn't helping you.\n\n**4. Reddit Became My Unfair Advantage**\n\nWhile everyone's trying to hack the algorithm on X, I did the most unsexy thing possible...\n\nWrote ONE valuable post per day on Reddit.   \n  \nNo promo links in the post. (Just let people ask)\n\nOne post drove 50+ qualified visitors. That's more than weeks of \"viral\" tweets with 50k impressions ever did.\n\nNow I repurpose that one post across 5-10 relevant subreddits.\n\nCost: $0. Time: 60 minutes per day.\n\n**5. SEO But Make It Actually Smart**\n\nEveryone told me: \"Write about LinkedIn growth tips!\"\n\nCool, I'd be competing with HubSpot, Neil Patel, and every marketing blog with DA 80+.\n\nI'd never rank.\n\nSo I went bottom-of-funnel instead:\n\n* \"Brandled vs \\[competitor\\]\" comparison pages\n* \"Best \\[competitor\\] alternatives\"\n* \"\\[competitor\\] review\"\n\nThese get 50-200 searches per month. But everyone searching is ready to buy.\n\nAnd I can actually rank for them.\n\nOne comparison page drives more revenue than 10 \"tips and tricks\" articles ever did.\n\n**6. I Stopped Pretending to Be a Big Company**\n\n**The Solo Founder's Actual Edge**\n\nYou can't outspend funded competitors. You can't out-hire them. You can't out-build them.\n\nBut you can out-care them.\n\nEvery customer gets a personal response from me. Every feature request gets a Loom video (even if it's a \"no\"). Every cancelled user gets a real email asking what I could've done better.\n\nBig companies can't do this. Their support team doesn't even know their founder.\n\nYou ARE the founder. That's your moat.\n\n**Why I Almost Quit (And Why You Shouldn't)**\n\nMonth 3: $0. Thought about quitting. Month 4: $0. Definitely thought about quitting. Month 5: $0. Wrote my \"I'm shutting down\" post. Month 6: Changed everything. Hit $126 in 4 days.\n\nHere's what nobody tells you: most founders quit right before things work.\n\nNot because their idea was bad. Because they ran out of patience.\n\nThe difference between $0 and $126 isn't talent. It's just refusing to quit when everything feels pointless.\n\n**The Truth About \"Making It\"**\n\nI'm not at $20k MRR. I'm not at $10k. I'm at $126.\n\nBut you know what? I went from \"this will never work\" to \"holy shit, people are actually paying me.\"\n\nThat mental shift is worth more than the money.\n\nBecause now I know the model works. Now it's just about repetition.\n\nKeep doing outreach. Keep writing content. Keep talking to users. Keep shipping.\n\n$126 becomes $500. $500 becomes $2k. $2k becomes $10k.\n\nBut only if you don't quit at $0.\n\nLook, I'm not some guru. I'm just a solo founder who wasted 6 months doing everything wrong.\n\nBut if you're stuck at $0 like I was, maybe my mistakes can save you some time.\n\nHappy to answer questions or share more details.\n\n(And yeah, the tool is Brandled - helps founders grow on LinkedIn & X without sounding like ChatGPT. But more importantly: just keep building. Most people quit right before it works.)",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qb0pp5/solo_founder_126_mrr_in_4_days_after_6_months_at/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nz8tvbu",
          "author": "nonFungibleHuman",
          "text": "I wonder why people come running to reddit to write these huge wallposts as soon as they make some money, like they found the golden recipee.\n\nI see the intention might be good, but this doesnt look like a story I would like to read because it sounds so artificial, maybe because of the formatting, LLM slop, you tell me.",
          "score": 4,
          "created_utc": "2026-01-12 22:21:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzaxfho",
              "author": "Stuttering_Salesman",
              "text": "Skipped to the bottom and just see it's AI ad slop",
              "score": 2,
              "created_utc": "2026-01-13 05:18:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzc20ng",
          "author": "LessResolution1266",
          "text": "So happy I joined this space and saw your post. Thank you so much for sharing your insights, it's something I needed to read! And please listen to your own advice and keep on writing and sharing, because there is always at least one person who will benefit. \n\nAnd you're so right about the code thing. If you're a solo founder who's also a software developer, it's so easy to get caught up with code and features, and often times it's the only thing I want to do - which is OK, because that's the way you finish something. I am currently in the validation stage for the product I recently built. I still don't have customers, but I decided I am not building anymore features until I find the people who are meant to use this tool. I created a first version, published it and now I am looking for people and teams on LinkedIn that might be interested (not just in buying, but in collaboration, giving feedback etc.). Each day I connect with 10-20 niche profiles, and as I do that, more and more suggestions and connections are coming along. \n\nSo you are 100% right: we do need to stop building for a while, and do the \"uncomfortable\" thing which is communicating, getting feedback, getting ourselves out there, become visible. As soon as I realized this, the process started becoming natural and comfortable.",
          "score": 1,
          "created_utc": "2026-01-13 11:19:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrk3h1",
          "author": "stealthagents",
          "text": "It's wild how many solo founders get stuck in their own heads, thinking that coding is the magic solution. Sometimes all it takes is actually reaching out and chatting with potential users to figure out what they really want. Those cold messages are brutal, but they can save you from wasting time on features nobody cares about.",
          "score": 1,
          "created_utc": "2026-01-15 17:41:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcabe2",
      "title": "Ce qui a vraiment aidé un petit studio B2B à structurer son outbound",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qcabe2/ce_qui_a_vraiment_aidé_un_petit_studio_b2b_à/",
      "author": "ashcobra",
      "created_utc": "2026-01-14 01:49:02",
      "score": 8,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Je partage un retour d’expérience avec un petit studio français orienté growth B2B, UCLIC.\n\nComme beaucoup d’équipes au début, leur outbound était assez chaotique. Prospection manuelle, relances mal suivies, peu de visibilité sur ce qui fonctionnait réellement. Plutôt que d’augmenter le volume, on a d’abord travaillé sur la structure.\n\nOn a combiné quelques outils simples comme Lemlist pour les séquences, PhantomBuster pour l’extraction de données, et HubSpot comme CRM léger. Rien de très sophistiqué. L’impact est surtout venu d’un meilleur ciblage, de données plus propres et de responsabilités claires sur les relances.\n\nLes résultats n’ont pas été spectaculaires, mais surtout plus stables. Des taux de réponse plus réguliers, moins de leads perdus, et plus de temps pour améliorer les messages plutôt que faire du répétitif.\n\nConclusion perso: les outils aident, mais seulement quand le process est clair. Automatiser trop tôt, ça amplifie juste le désordre.",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qcabe2/ce_qui_a_vraiment_aidé_un_petit_studio_b2b_à/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzl1o44",
          "author": "Delicious-One-5129",
          "text": "Même constat ici. Le vrai changement pour nous a été de définir un ICP précis, simplifier les séquences et instaurer une routine de nettoyage de la data. Une fois ces bases en place, tout le reste devient beaucoup plus efficace.",
          "score": 2,
          "created_utc": "2026-01-14 18:31:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzo9zjr",
          "author": "MindlessGurl-55",
          "text": "On a traversé la même phase. Travailler avec UCLIC nous a surtout aidés à poser des règles claires sur les relances et la qualité des listes. Concrètement on a combiné Lemlist, PhantomBuster et HubSpot, mais le vrai levier a été le process instauré.",
          "score": 1,
          "created_utc": "2026-01-15 04:33:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qeptp1",
      "title": "How to do proper investor outreach for seed funding without a network (raised $4M doing this)",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qeptp1/how_to_do_proper_investor_outreach_for_seed/",
      "author": "dolm09",
      "created_utc": "2026-01-16 19:34:52",
      "score": 8,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Most advice about investor outreach assumes you already know the right people. Alumni networks, warm friends of friends, early angels who open doors. That was not my situation.\n\nI started fundraising as a first-time founder based in Europe, with zero VC relationships and no built-in credibility. No one was waiting for my deck. No one was forwarding my intro. If I wanted investor meetings, I had to create them from scratch.\n\nHowever, I managed to make it predictable by treating it as another sales funnel.\n\nAcross multiple rounds, I ended up having well over a hundred investor conversations. Most of them said no. That was expected. What mattered was that the process eventually produced momentum, and more importantly, it produced a small number of yeses.\n\nThe turning point came when I rebuilt my investor outreach around warm introductions that I could generate systematically, even without knowing a single investor personally.\n\nHere is what fundraising actually looked like in practice for me.\n\n* Pre-seed: around 70 investor conversations\n* Seed: around 175 investor conversations\n* Total passes: 166\n\nYou should expect at least 99 no’s before the first yes. That is normal and not a signal that you are doing something wrong.\n\nEarly on, I made every mistake possible.\n\n* Pitches were too long\n* I reached out to the wrong investors\n* There was no urgency\n* I let investors control timing\n\nNothing worked consistently until I reframed fundraising as a numbers game with strict process discipline. The biggest improvement did not come from a better deck or a tighter pitch. It came from changing who I contacted first.\n\nI stopped messaging investors directly and focused on **portfolio founders instead.**\n\nFor every VC fund I wanted to speak with, I followed the same steps.\n\n1. Go to the VC website\n2. Open the portfolio page\n3. Identify founders in or near my sector\n4. Connect with them on LinkedIn\n5. Ask for a quick video call to know about their experience with X investor\n\nFor each VC, I would reach out to about 15 portfolio founders, around 3 founders agreed to a short 15-minute chat, and one or two almost always offered a warm intro to their investor.\n\nThis made investor outreach repeatable and predictable.\n\nWhy this works?\n\nWhen an investor hears about your company from one of their own founders, you are no longer a random inbound.\n\nAnd you can pitch with a total different energy because the investor assumes there is existing momentum. You can play a game where they can start thinking that if they wait, the round might fill without them.\n\nThat shift in perception does more than traction alone ever did for me.\n\nOne of the biggest misconceptions about fundraising is that investors are purely driven by traction and numbers.\n\nUrgency beats raw traction more often than founders want to admit. If not, look at all the TechCrunch & LinkedIn cringe-posts where founders with a powerpoint slide raise a gazillion dollars.\n\nAlso, if you spread investor calls over months, nothing compounds. One call per week creates no momentum. Investors forget you.\n\nIf you compress conversations into a tight window, momentum builds naturally. Conversations reference each other. Interest compounds.\n\nThat is how rounds close.\n\nNow building something specifically to automate all this in case anyone is interested.\n\nHappy to answer questions!",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qeptp1/how_to_do_proper_investor_outreach_for_seed/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o02r1qc",
          "author": "Due-Philosopher-1426",
          "text": "Thanks for sharing. This seems helpful",
          "score": 2,
          "created_utc": "2026-01-17 08:49:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o03kt1r",
              "author": "dolm09",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-01-17 13:08:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o037oe5",
          "author": "wtstm",
          "text": "Thanks for sharing! Interesting perspective on compressing the conversations into a tight window. How do you achieve to schedule all these calls with founders and investors into a tight window? When do you start to prepare the founder introductions? That sounds like a lot of work",
          "score": 2,
          "created_utc": "2026-01-17 11:25:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o03jbtq",
              "author": "dolm09",
              "text": "It starts getting momentum after a couple of weeks. Think of it this way:\n\n1st week you reach out to a batch of founders.\n\n2nd week you start getting a decent amount of positive responses, so you start scheduling calls.\n\nSince founders are always busy, you don't probably jump on a call until 3rd week. Then you get some yeses.\n\n4th week you start getting intros.\n\nAfter the 4th week the batches start to overlap, so after that you are always getting a relevant volume of meetings with investors.\n\nIt's a lot of work, but knowing that only 1% of startups end up raising a round, seems like a reasonable effort.",
              "score": 2,
              "created_utc": "2026-01-17 12:58:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o086499",
          "author": "rt2828",
          "text": "Great idea!",
          "score": 2,
          "created_utc": "2026-01-18 03:08:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0a8e2t",
              "author": "dolm09",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-01-18 13:02:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o040e5j",
          "author": "KoumKoumBE",
          "text": "Very interesting! Thanks for sharing! I also assume that by choosing your founders well, you can automatically restrict your efforts to investors who are used to your niche?\n\nDid the founders feel proud of being contacted by you? (I mean: feeling important and successful enough that someone asks them for advice). When they were saying no, what was their reason, if you can tell?",
          "score": 1,
          "created_utc": "2026-01-17 14:38:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04h6mg",
              "author": "dolm09",
              "text": "Totally right on everything you said. Your goal when getting the call with the founder is to feed their ego since raising capital is super hard but at the same time very lonely. Your goal is also to build authority by sharing you achievements (capital raised in the past, your PHD, the product you've built, deals, user feedback, whatever works for you), so they feel they are sharing great dealflow with their investors.\n\nWhen they were saying no to make the intro, most of the time they were insecure stuck-ups that raised recently. It's okay, life happens, you just move on and keep reaching out to others.",
              "score": 2,
              "created_utc": "2026-01-17 16:02:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qezl7m",
      "title": "Building a mobile app is easy. Getting users is not.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qezl7m/building_a_mobile_app_is_easy_getting_users_is_not/",
      "author": "Vanilla-Green",
      "created_utc": "2026-01-17 01:43:50",
      "score": 7,
      "num_comments": 17,
      "upvote_ratio": 0.89,
      "text": "I am building Zavi, an Android voice keyboard app that turns raw voice to polished text in every app and trying to figure out what actually works for early growth.\n\nWhat got you your first 100 users\n\nWhat looked promising but was a complete waste of time\n\nNot interested in theory or growth hacks.\n\nOnly things you would do again if starting from zero today.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qezl7m/building_a_mobile_app_is_easy_getting_users_is_not/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o02dgrh",
          "author": "OneHunt5428",
          "text": "best way is to find a small specific online community where people are already complaining about the problem you solve. just jump in offer genuine help and share your thing naturally when it fits",
          "score": 4,
          "created_utc": "2026-01-17 06:45:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02noeq",
          "author": "rdpl_",
          "text": "already your description is weak, do not just tell what it is but why is it better than the current solutions and why tf did you develop it if there dozen other solutions which are good enough\n\nfwiw, getting user is only hard for an app that nobody needs",
          "score": 3,
          "created_utc": "2026-01-17 08:17:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02ovzi",
              "author": "Vanilla-Green",
              "text": "But this solution people do need",
              "score": -1,
              "created_utc": "2026-01-17 08:29:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o02pk2w",
                  "author": "rdpl_",
                  "text": "no, bc, even after having you asked you are not able to answer why your solution is better than existing solutions\n\nif you are not able to articulate the most basic things how would you be able to build an app with the right feature set? \n\nthis is a waste of time of everyone, sry",
                  "score": 1,
                  "created_utc": "2026-01-17 08:35:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o03dvgk",
          "author": "AnonJian",
          "text": "You get first users in the research phase everybody jettisons to crap something out market-blind. That is not a secret or growth hack, it is supply and demand. Only supply does not obligate demand to manifest automagically.\n\nPeople post to ask how to find complete strangers they don't understand so never could have developed a product for. Abusing the word \"user\" only serves to confuse them. You are not owed users, zero is an option.",
          "score": 2,
          "created_utc": "2026-01-17 12:17:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o073ys4",
          "author": "AtmosphereNo9845",
          "text": "Personally posted videos of myself on TikTok. Looked up videos that were easy to copy and had already gone viral on Peerwatch, and just replicated them. Had like 8 accounts on 1 device and kept posting 1 time on each account a day.",
          "score": 2,
          "created_utc": "2026-01-17 23:44:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08kxgq",
          "author": "kubrador",
          "text": "the first 100 came from me spamming it in relevant discord servers and one reddit comment that blew up. literally nothing else moved the needle.\n\nspent 3 months on seo and content marketing thinking it'd be passive gold. wrote like 15 articles. got maybe 5 users total. complete ghost town.\n\nif i started over i'd just cold dm people in communities actually using voice-to-text apps (transcription discord servers, reddit threads about accessibility, youtube comment sections of similar products). sounds cringe but it converts way better than anything automated.\n\nthe real thing that finally worked was getting one youtuber to demo it casually and just... asking their audience for feedback in the replies. that's it.",
          "score": 2,
          "created_utc": "2026-01-18 04:37:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o08lwjw",
              "author": "Vanilla-Green",
              "text": "Great can you share the the relevant discords please",
              "score": 1,
              "created_utc": "2026-01-18 04:44:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o02tgk5",
          "author": "trainmindfully",
          "text": "getting the first users usually comes from one narrow use case, not the app’s full vision. early on, what works is finding people who already feel the pain badly enough to tolerate rough edges and reaching them where they already complain about it. what wastes time is broad launch posts, generic communities, or anything that assumes people want to try a new app without a strong trigger. i would do direct problem driven outreach again, even if it feels unscalable at first, because it teaches you who actually cares. once you know that, growth channels become clearer instead of theoretical.",
          "score": 1,
          "created_utc": "2026-01-17 09:12:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qea9li",
      "title": "Month 8 update: From idea to $30K MRR - the full breakdown",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qea9li/month_8_update_from_idea_to_30k_mrr_the_full/",
      "author": "Delecch",
      "created_utc": "2026-01-16 08:09:09",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 0.88,
      "text": "Been a while since I posted here, wanted to share where things are at. This community has been super helpful, so hopefully this gives something back.\n\n\n\n\\*\\*Quick background:\\*\\*\n\nStarted a social media management SaaS 8 months ago. First-time founder, no VC funding, just me and eventually one part-time contractor.\n\n\n\n\\---\n\n\n\n\\*\\*THE NUMBERS (Month 8):\\*\\*\n\n\n\n| Metric | Value |\n\n|--------|-------|\n\n| MRR | $30,400 |\n\n| Customers | 342 |\n\n| Churn | 5.8% monthly |\n\n| CAC | \\~$0 (organic only) |\n\n| LTV | \\~$520 |\n\n| Runway | Infinite (profitable) |\n\n\n\n\\---\n\n\n\n\\*\\*THE TIMELINE:\\*\\*\n\n\n\n\\*\\*Months 1-2:\\*\\* Building in isolation (mistake)\n\n\\- Built MVP in 8 weeks\n\n\\- Talked to exactly 0 customers\n\n\\- Assumed I knew what people wanted\n\n\n\n\\*\\*Month 3:\\*\\* Soft launch (reality check)\n\n\\- Posted on Product Hunt - 30 upvotes, 2 customers\n\n\\- Realized my assumptions were 60% wrong\n\n\\- Had to pivot core features\n\n\n\n\\*\\*Month 4:\\*\\* Started building in public\n\n\\- Began sharing everything on Twitter/X\n\n\\- Weekly revenue updates, failures, learnings\n\n\\- First signs of organic traction\n\n\n\n\\*\\*Months 5-6:\\*\\* Growth phase\n\n\\- Hit $10K MRR\n\n\\- Started engaging in communities (Reddit, indie hackers)\n\n\\- Word of mouth kicked in\n\n\n\n\\*\\*Months 7-8:\\*\\* Optimization\n\n\\- Reduced churn from 12% to 5.8%\n\n\\- Hired part-time support person\n\n\\- Hit $30K MRR\n\n\n\n\\---\n\n\n\n\\*\\*WHAT ACTUALLY WORKED:\\*\\*\n\n\n\n1. \\*\\*Building in public\\*\\* - People trust transparency. Sharing failures built more trust than highlighting wins.\n\n\n\n2. \\*\\*Community engagement\\*\\* - Not spamming links. Actually helping people. The conversions came naturally.\n\n\n\n3. \\*\\*Obsessing over churn\\*\\* - Spent 2 months just on retention. Onboarding, support, feature requests.\n\n\n\n4. \\*\\*Simple tech stack\\*\\* - Next.js, Supabase, Stripe, Vercel, Crescitaly for analytics. Nothing fancy.\n\n\n\n\\---\n\n\n\n\\*\\*WHAT FAILED:\\*\\*\n\n\n\n\\- Cold email (2% reply rate)\n\n\\- LinkedIn content (maybe wrong audience)\n\n\\- Paid ads (tried $500, terrible ROAS)\n\n\\- Product Hunt launch (timing was wrong)\n\n\n\n\\---\n\n\n\n\\*\\*BIGGEST LESSONS:\\*\\*\n\n\n\n1. Talk to users before building anything\n\n2. Distribution is as important as product\n\n3. Churn kills faster than slow growth\n\n4. You don't need funding to build something real\n\n\n\n\\---\n\n\n\n\\*\\*WHAT'S NEXT:\\*\\*\n\n\n\n\\- Hiring first full-time employee\n\n\\- Launching v2 with new features\n\n\\- Maybe exploring YouTube content\n\n\n\nHappy to answer any questions. What's your ride along story?",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qea9li/month_8_update_from_idea_to_30k_mrr_the_full/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzw6sek",
          "author": "Prestigious_Head6566",
          "text": "Can anyone explain what churn means in this context, im not a native english speaker",
          "score": 2,
          "created_utc": "2026-01-16 09:48:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzw7wgy",
              "author": "GrrasssTastesBad",
              "text": "That would be someone paying or using the product one month, then not staying with it after that.",
              "score": 2,
              "created_utc": "2026-01-16 09:58:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzw8bgm",
                  "author": "Prestigious_Head6566",
                  "text": "Thanks for the clarification",
                  "score": 1,
                  "created_utc": "2026-01-16 10:02:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzymuc4",
          "author": "NoCloutTy",
          "text": "Really cool breakdown. Currently in the \"actually talk to users before building anything\" lol. Thought I knew exactly what people wanted but turns out you never actually do. Tough pill to swallow but its been really cool connecting with people and creating something that you know will be useful before actually putting the work in. Its easy to get caught up just building building building, and not thinking about if there will actually be payoff. Excited to keep moving after hearing success like this. Thanks for sharing",
          "score": 2,
          "created_utc": "2026-01-16 18:01:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwk2xw",
          "author": "davis_untrapd",
          "text": "The jump from 12% to 5.8% churn in 2 months is honestly the most impressive part of this breakdown. Most founders I've talked to treat churn as a \"we'll fix it later\" problem and keep chasing new signups.\n\nCurious about your approach to that - was it mostly:\n- Onboarding improvements (getting people to the \"aha moment\" faster)?\n- Product changes based on why people were leaving?\n- Or proactive support reaching out before cancellation?\n\nAlso really resonated with the \"building in isolation\" mistake in months 1-2. I did the same thing - spent 6 weeks heads-down building before talking to anyone. Realized about 40% of what I built wasn't what anyone actually wanted.\n\nThe $0 CAC with 342 customers through pure organic is a strong case study for the \"distribution is as important as product\" lesson. Thanks for sharing the real numbers.",
          "score": 1,
          "created_utc": "2026-01-16 11:42:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxcl54",
          "author": "Local-Employ9800",
          "text": "Focusing this hard on churn that early is the real unlock here. Most people chase MRR screenshots and ignore the bucket leaking underneath, but your 2-month sprint on onboarding, support, and feature requests is exactly why the rest of the numbers make sense.\n\n\n\nYour path mirrors what worked for me: building in public on X, then doubling down on communities. For my SaaS, answering niche questions in subs and on Indie Hackers drove more signups than any cold email campaign. I pair that with tools like Hypefury for scheduling and Zapier for routing leads into my CRM, and lately Pulse for Reddit has been useful to track and jump into the right Reddit threads without spamming.\n\n\n\nIf you keep your “infinite runway” mindset and keep shipping in public while obsessing over retention, that $30K will feel like the small early chapter sooner than you think. Focusing on churn and distribution over flashy launches is the right move.",
          "score": 1,
          "created_utc": "2026-01-16 14:33:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzchu3",
          "author": "EmploymentProud3436",
          "text": "Really solid post. The churn reduction is the most impressive part here — a lot of founders keep chasing signups while the bucket’s leaking.\n\n\nAlso appreciate you calling out what didn’t work PH, ads, cold email. Way more useful than another “here’s my growth hack” thread. Thanks for sharing the numbers.",
          "score": 1,
          "created_utc": "2026-01-16 19:56:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01as7p",
          "author": "Willing_Builder4289",
          "text": "Solid execution. Getting churn from 12% to 5.8% in 2 months is no joke.Your focus and consistency is def rare. \n\nIf you don't mind what % of churn right now is silent churn vs explicit cancellations? That’s usually where SaaS at this stage bleeds without realizing",
          "score": 1,
          "created_utc": "2026-01-17 02:10:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcapjc",
      "title": "Month 6 of my startup: Working product, zero customers. Here's what I'm learning.",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qcapjc/month_6_of_my_startup_working_product_zero/",
      "author": "Healthy_Reply_7007",
      "created_utc": "2026-01-14 02:06:05",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 0.88,
      "text": "Building in public because I need accountability.\n\n**What I'm building:**\n\nAn all-in-one workspace for engineering teams. Think Jira + Notion + meeting notes, but actually connected with AI.\n\n**The problem:**\n\nEngineers waste hours searching for context across scattered tools. When people leave, knowledge disappears. Onboarding takes forever.\n\n**Where I am:**\n\n\\- Product: Built ✓\n\n\\- Users: 0\n\n\\- Revenue: $0\n\n\\- Runway: Running out of savings\n\n**What I've tried:**\n\n\\- Cold outreach on LinkedIn (low response rate)\n\n\\- Twitter/X content (slow growth)\n\n\\- \"Subtle\" Reddit posts asking questions (no conversions)\n\n\\- Product Hunt (haven't launched yet)\n\n**What I'm trying this month:**\n\n\\- Direct Reddit posts in communities that allow it\n\n\\- Email campaign to YC founders (got a list of 5000)\n\n\\- More aggressive positioning\n\n**Lessons so far:**\n\n1. Building without users = building blind\n2. \"If you build it, they will come\" is a lie\n3. Distribution is harder than building\n4. Should have done customer discovery first\n\n**The ask:**\n\nIf you've been through this phase, what worked for you? What finally got you from 0 to 10 users?",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qcapjc/month_6_of_my_startup_working_product_zero/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzhrjmn",
          "author": "kubrador",
          "text": "you built something nobody asked for and now you're trying to market your way out of a product problem\n\n\"jira + notion + AI\" is a feature list. every eng team already has tools they hate but know how to use. switching cost is massive and \"actually connected\" isn't compelling enough to overcome it\n\nyour distribution tactics are fine but they won't fix this. cold outreach, content, reddit posts - none of that matters if the value prop doesn't make someone go \"holy shit i need this today\"\n\n find 5 eng managers, hop on calls, ask what's actually painful right now. not \"would you use this\" but \"what did you waste time on this week.\" then build that specific thing for those specific people\n\nyou're 6 months in with zero users and running out of money. that's the market telling you something",
          "score": 4,
          "created_utc": "2026-01-14 05:51:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpc8ky",
              "author": "Healthy_Reply_7007",
              "text": "I appreciate your words and time you took to wrote this. 6 months I was building without talking anyone. I know I'm wrong but that doesn't mean that market is telling me about this product (market doesn't know yet).   \n  \nAnd If I make it less complicated then I would say syncally is glean. com but specifically for engineering teams and at lower cost so that early stage startups can use it. \n\nAnd there is complete market for all in one tool like clickup, linear, or any other project management tool.",
              "score": 2,
              "created_utc": "2026-01-15 10:03:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzh4f3j",
          "author": "ConsciousLeader9448",
          "text": "It’s definitely difficult marketing these all in one platforms because it seems much more intimidating to pay for than some niche saas, even if it has more value. I faced the same problem with my platform which helps people make money online. What got me users was a mix of content on TikTok, reels, X, YouTube. You just wanna speak authentically and hook people’s attention",
          "score": 1,
          "created_utc": "2026-01-14 03:14:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpcbl3",
              "author": "Healthy_Reply_7007",
              "text": "I get your concernt there is complete market for all in one tool like clickup, linear, or any other project management tool. I feel all project management tools are already all-in-one platform.",
              "score": 1,
              "created_utc": "2026-01-15 10:04:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzmqksp",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-14 23:12:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpchw8",
              "author": "Healthy_Reply_7007",
              "text": "Wait when did I said I spend 5k$? Looks like this comment is also generated by SignalSCouter lol.",
              "score": 1,
              "created_utc": "2026-01-15 10:06:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o07fsl4",
          "author": "HalastersCompass",
          "text": "Don't think you thought this one through",
          "score": 1,
          "created_utc": "2026-01-18 00:47:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o09hlw7",
              "author": "Healthy_Reply_7007",
              "text": "what do you mean?",
              "score": 1,
              "created_utc": "2026-01-18 09:08:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qdhwwx",
      "title": "An early lesson I am learning about hiring in a real estate business",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qdhwwx/an_early_lesson_i_am_learning_about_hiring_in_a/",
      "author": "Chirag_koshti",
      "created_utc": "2026-01-15 12:13:41",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I am early in building my real estate business and wanted to share something I am learning right now about hiring.\n\nAt first, I thought bringing people onboard quickly mattered most. What I am starting to notice is that clarity matters more than speed. When roles are not clearly defined, even good people can struggle and expectations can drift.\n\nLately, I have been slowing down and spending more time understanding what kind of help I actually need before bringing someone in. It feels slower than pushing for growth, but it feels easier to manage.\n\nStill figuring things out as I go. If anyone else here is at a similar stage, I would be interested to hear what you are learning while building your first small team.",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qdhwwx/an_early_lesson_i_am_learning_about_hiring_in_a/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzpxuxj",
          "author": "kubrador",
          "text": "lmao you just discovered what every business owner learns by hiring their third person. clarity beats speed, groundbreaking stuff. the lesson is you're gonna hire the fourth person and immediately forget this and repeat the whole cycle again.",
          "score": 1,
          "created_utc": "2026-01-15 12:56:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzq6ppv",
          "author": "PersonalEcho9244",
          "text": "Clarity before hiring helps, but change really happens when systems no longer depend on you being in the center of it.",
          "score": 1,
          "created_utc": "2026-01-15 13:48:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzwetpb",
              "author": "Chirag_koshti",
              "text": "That’s a good point. I’m starting to realize that building simple systems early makes hiring and scaling much smoother. Otherwise everything keeps running through the founder.",
              "score": 1,
              "created_utc": "2026-01-16 10:59:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzxvu6x",
                  "author": "PersonalEcho9244",
                  "text": "Exactly! Systems matter, but workflow design makes scaling sustainable ☺️",
                  "score": 1,
                  "created_utc": "2026-01-16 16:02:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qdcw80",
      "title": "running a service business when the whole market is working against you",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qdcw80/running_a_service_business_when_the_whole_market/",
      "author": "Dangerous-Guava-9232",
      "created_utc": "2026-01-15 07:11:18",
      "score": 5,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Maybe I'm just venting but I run an insurance brokerage and every client conversation lately feels like apologizing for things completely outside our control. The market has been brutal with premium increases across the board and we're the ones delivering that news even though we didn't cause any of it.\n\nCommercial clients who've been with us 10+ years are suddenly questioning everything. Personal lines people are shopping around constantly. My staff is exhausted from being the messenger for bad news day after day.\n\nHad a longtime account mention they almost left without even telling us why. Not because of service issues really but because the whole experience of dealing with insurance right now is negative and we happen to be the face of it. We do good work but when external conditions are this rough it feels like none of that matters because every touchpoint is uncomfortable for everyone involved.\n\nAnyone else in service businesses feeling like client relationships are way more fragile when market conditions suck? Starting to wonder what we can actually control here besides just showing up and trying to be human about it.",
      "is_original_content": false,
      "link_flair_text": "Seeking Advice",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qdcw80/running_a_service_business_when_the_whole_market/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "nzrjecm",
          "author": "ninjapapi",
          "text": "Yeah the morale thing is real. we noticed our team was getting worn down because every single call felt heavy, even the ones that should've been simple. someone calling to update their address or ask about a payment would get the same tired energy as the difficult renewal conversations because staff was just depleted from the constant negativity.\n\nNow we’re routing the routine stuff through sonant and it made a bigger difference than expected. not because it saved time necessarily but because when clients actually get through to our people now it's for the conversations that actually need a human approach. Staff has more patience for the hard market talks when they're not also fielding \"what's my policy number\" calls back to back all morning. clients needing real help get someone who isn't already exhausted before the conversation starts.\n\nthe market is what it is, but at least we're not burning out our best people on stuff that doesn't require them",
          "score": 13,
          "created_utc": "2026-01-15 17:38:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpe7fc",
          "author": "LNsworld",
          "text": "This resonates a lot.\nIn my humble opinion, being the face of bad news for things you didn’t cause is emotionally draining in a way most people don’t see.\n\nOne thing that could help in a service role during rough market cycles is separating “outcomes that are under control” from “conditions that aren't”.\nYou can’t fix pricing or sentiment, but you can control clarity, tone, and how safe clients feel in conversations.\n\nSometimes what clients stay for isn’t savings, but the feeling that someone is actually in it with them.\nThat doesn’t make the days easier, but it does make the work meaningful again.",
          "score": 2,
          "created_utc": "2026-01-15 10:22:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzu4lg6",
          "author": "indexintuition",
          "text": "this really resonates, even outside insurance. when you’re the human delivering bad news you didn’t create, it wears you down fast. i’ve noticed when markets get rough, people aren’t just reacting to the price, they’re reacting to how powerless the whole situation makes them feel. sometimes the only thing you can control is acknowledging that discomfort out loud instead of trying to smooth it over. it doesn’t fix the numbers, but it can help clients feel less like they’re being brushed off. you’re not wrong that relationships feel more fragile right now, a lot of people are just stretched thin everywhere.",
          "score": 2,
          "created_utc": "2026-01-16 01:07:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpi3y5",
          "author": "OneHunt5428",
          "text": "Yeah, that’s a rough spot and totally relatable. When the market’s bad, clients often project the frustration onto whoever’s closest, even if you’re doing everything right. Honestly, being transparent and human might be the only real lever you have right now, and that still counts more than it feels like in the moment.",
          "score": 1,
          "created_utc": "2026-01-15 10:57:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqxq79",
          "author": "outdahooud",
          "text": "same boat different industry, retention feels harder when you're not the one causing the problem but you're still associated with it",
          "score": 1,
          "created_utc": "2026-01-15 16:01:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzralv1",
          "author": "Role_Every",
          "text": "Ugh, this sounds incredibly stressful. Being the face of bad news you can't control is one of the hardest parts of running a service business, and I totally get why your staff is exhausted. It really chips away at the trust you've spent years building.\n\nYou're right, you can't control the market, but you *can* build trust outside of those difficult client calls. One thing that helps is partnering with credible, third-party voices in finance—like bloggers or creators—who can educate people about *why* the market is so tough right now. It helps reframe the problem as a market issue, not a 'you' issue.\n\nThe main challenge is finding authentic people who are genuinely credible. We actually specialize in doing that manual research and vetting for brands in complex niches. Feel free to reach out if you'd ever want to discuss it.",
          "score": 1,
          "created_utc": "2026-01-15 16:58:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrgohq",
          "author": "BarberUnited7894",
          "text": "we've gotten way more proactive about communicating market conditions before renewal conversations, helps set expectations at least.",
          "score": 1,
          "created_utc": "2026-01-15 17:26:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzs1o5i",
          "author": "Embarrassed_Key_4539",
          "text": "Best thing you can do is be proactive with your communication and help your clients shop around",
          "score": 1,
          "created_utc": "2026-01-15 18:59:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzs2i0m",
          "author": "Sinatra2727",
          "text": "You’re definitely not alone. What you’re describing is almost textbook *“being the human interface to a broken system.”* Insurance just makes it extra painful because the outcome is a bill going up for something people hope they never need.\n\nA few thoughts from someone who’s seen this play out in other service industries during ugly market cycles:\n\n**1. Clients aren’t mad** ***at*** **you — they’re mad** ***through*** **you**  \nWhen conditions suck, clients look for a place to park frustration. The broker, advisor, or agency becomes the emotional lightning rod because you’re the only human they can talk to. That doesn’t make it fair, but it does mean the relationship damage often isn’t actually about trust or service quality.\n\n**2. Silence is now a risk, not neutrality**  \nThe account that almost left without telling you is a big signal. When markets are rough, clients mentally assume *everyone* is bad unless proven otherwise. Proactive communication (even when there’s no good news) often matters more than the content itself. “We know this is awful, here’s what we’re watching, here’s what we can and can’t control” can stop people from quietly shopping.\n\n**3. Reframe your role internally: translator, not messenger**  \nYour team’s burnout makes total sense. One thing that helps morale is reframing the job from “delivering bad news” to “helping clients understand reality and avoid worse outcomes.”  \nFor example:\n\n* “Yes, premiums are up, but here’s what would’ve happened without these adjustments.”\n* “Here’s what *didn’t* increase because of the decisions we made.”\n\nThat shift matters a lot for staff psychology.\n\n**4. You** ***do*** **control the experience, even if you don’t control the price**  \nWhen prices are bad, experience becomes the differentiator:\n\n* Clear explanations > technical jargon\n* Predictability > surprise renewals\n* Empathy > defensiveness\n\nClients are far more forgiving of bad outcomes when they feel informed and respected early.\n\n**5. This is where long-term trust is actually built (ironically)**  \nA lot of service businesses lose clients in good times because relationships are shallow. The ones that survive brutal cycles tend to come out with *stickier* clients because they were transparent, human, and present when things sucked.\n\nIt doesn’t make the day-to-day any less draining, but this period is quietly sorting brokers who are just transactional from those who are genuinely trusted advisors.\n\nYou’re asking the right question: *what can we actually control?*  \nAnswer: communication, framing, empathy, and consistency. That doesn’t fix the market, but it absolutely changes who stays with you when it recovers.\n\nhttps://preview.redd.it/bcmcvn3q9kdg1.png?width=960&format=png&auto=webp&s=ee776c6f9a197d6efad018c12fed2b80546a6046",
          "score": 1,
          "created_utc": "2026-01-15 19:03:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfk1em",
      "title": "Is anyone else nostalgic for the joy of random physical rewards?",
      "subreddit": "EntrepreneurRideAlong",
      "url": "https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qfk1em/is_anyone_else_nostalgic_for_the_joy_of_random/",
      "author": "sirdangc8k",
      "created_utc": "2026-01-17 17:59:15",
      "score": 5,
      "num_comments": 9,
      "upvote_ratio": 0.86,
      "text": "Some of my best childhood memories came from opening treasure chests in RPGs, pulling collectible cards, or getting a surprise toy in a kids' meal. That element of surprise and tangible reward left a lasting impression.\n\nI’ve been thinking about how apps today are all digital points, badges, streaks; but rarely offer anything physical. What if an app could mail you a surprise gift after hitting a milestone, like earning points, gaining subscribers, or completing a challenge?\n\nHas anyone seen something like this done well? Do you think people would value a physical token for digital achievements? I’m exploring the idea and would love to hear your thoughts or creative use cases!\n\n*I’m working on a project related to this that ties software and a bunch of expensive manufacturing machines to do it all in house. And will be sharing the ride along journey with ya'll!*\n\n*I share a little more in this video* on my reddit profile\n\nLmk what you think 🙏",
      "is_original_content": false,
      "link_flair_text": "Ride Along Story",
      "permalink": "https://reddit.com/r/EntrepreneurRideAlong/comments/1qfk1em/is_anyone_else_nostalgic_for_the_joy_of_random/",
      "domain": "self.EntrepreneurRideAlong",
      "is_self": true,
      "comments": [
        {
          "id": "o05tfiw",
          "author": "simon_mo",
          "text": "Oh my god, like 10000 percent. They still do it in Japan and they do it really well!",
          "score": 1,
          "created_utc": "2026-01-17 19:48:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05uaov",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-17 19:52:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05uar7",
              "author": "AutoModerator",
              "text": "Your [comment](https://www.reddit.com/r/EntrepreneurRideAlong/comments/1qfk1em/is_anyone_else_nostalgic_for_the_joy_of_random/o05uaov/) in /r/EntrepreneurRideAlong was automatically removed because it contained a URL or a markdown link.\n\nTo keep our community focused and prevent spam, we do not allow URLs or links (including Reddit internal links) in comments at this time.\nIf you believe this removal was a mistake, please [contact the moderators](https://www.reddit.com/message/compose?to=/r/EntrepreneurRideAlong).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EntrepreneurRideAlong) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-17 19:52:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o06137m",
          "author": "lkbngwtchd",
          "text": "Like youtube?",
          "score": 1,
          "created_utc": "2026-01-17 20:26:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o06hif5",
              "author": "SpottedOutpost",
              "text": "Yes like YouTube badges but for normal people / customer accounts",
              "score": 1,
              "created_utc": "2026-01-17 21:50:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o070bbb",
          "author": "NoCloutTy",
          "text": "This is cool, what kind of items do you have in mind?",
          "score": 1,
          "created_utc": "2026-01-17 23:25:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07x7fi",
          "author": "kubrador",
          "text": "only thing that'll kill you is logistics and unit economics until you scale, so you better nail the manufacturing side hard or you're just paying to ship people $2 trinkets. but if you've got the machines in-house and figured out the math, you're already ten steps ahead of every other app trying this. go absolutely bonkers with it.",
          "score": 1,
          "created_utc": "2026-01-18 02:19:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0851hi",
          "author": "trainmindfully",
          "text": "the nostalgia is real, but the hard part isn’t the idea, it’s the economics and logistics once novelty fades. physical rewards feel magical at first, then users start anchoring on cost, delays, and consistency. most attempts i’ve seen die when shipping friction eats margins or expectations spike. i’d be curious how you think this stays special past the first few milestones without turning into a fulfillment business.",
          "score": 1,
          "created_utc": "2026-01-18 03:02:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09z3b4",
          "author": "MASTERV10",
          "text": "I miss it so much.",
          "score": 1,
          "created_utc": "2026-01-18 11:48:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}