{
  "metadata": {
    "last_updated": "2026-02-25 09:09:57",
    "time_filter": "week",
    "subreddit": "fintech",
    "total_items": 20,
    "total_comments": 82,
    "file_size_bytes": 99717
  },
  "items": [
    {
      "id": "1r99t2p",
      "title": "Is AI the real edge or just faster iteration?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r99t2p/is_ai_the_real_edge_or_just_faster_iteration/",
      "author": "Glittering_Jelly4177",
      "created_utc": "2026-02-19 20:06:19",
      "score": 64,
      "num_comments": 9,
      "upvote_ratio": 0.97,
      "text": "AI is becoming the default label for modern trading systems.\n\nBut after looking into different structured platforms; [atomichedge.com](http://atomichedge.com) being one example Istudied, I’m starting to think AI isn’t the edge itself.Maybe the edge is process discipline, risk allocation logic, and execution efficiency.Does machine learning create durable advantage or just accelerate adaptation?\n\nInterested in hearing technical takes.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r99t2p/is_ai_the_real_edge_or_just_faster_iteration/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o6dybpg",
          "author": "Adventurous_Read_758",
          "text": "\nAI can make iteration faster, but at the end of the day the underlying math and logic are what really matter.",
          "score": 1,
          "created_utc": "2026-02-20 08:00:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dzd5z",
          "author": "kanchan1711",
          "text": "\n\nThis is a solid discussion. Too many people get lost in buzzwords without understanding the fundamentals.",
          "score": 1,
          "created_utc": "2026-02-20 08:10:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6efgbo",
          "author": "Any_Sleep1653",
          "text": "\nI’ve found that machine learning is most useful for optimizing parameters rather than actually forecasting outcomes.",
          "score": 1,
          "created_utc": "2026-02-20 10:41:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eg9lw",
          "author": "Better_Chance_4492",
          "text": "Most alpha eventually fades, what really sticks is consistent process and risk management.",
          "score": 1,
          "created_utc": "2026-02-20 10:48:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eghgz",
          "author": "skeleton012",
          "text": "A long-lasting edge usually comes from solid structure and disciplined process, not from trying to predict the next move.",
          "score": 1,
          "created_utc": "2026-02-20 10:50:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ehvt1",
          "author": "Traditional_Rock_451",
          "text": "A long-lasting edge usually comes from solid structure and disciplined process, not from trying to predict the next move",
          "score": 1,
          "created_utc": "2026-02-20 11:02:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g8ilc",
          "author": "WhichMongoose5514",
          "text": "We need to be careful using AI in finance.   Mostly due to the predictive nature. Here accuracy is the key . Hence we need to exercise caution before using it\n\nWe must not forget it’s just another tool in the tool belt",
          "score": 1,
          "created_utc": "2026-02-20 16:53:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kv6s0",
          "author": "Stup2plending",
          "text": "In trading specifically, helping beginners in particular but even the more experienced traders once a in while leave their emotions aside is one of the big advantages of AI. Instead of chasing returns after a couple of losing trades, the AI, if set up correctly and with good logic will just stick to its plan. And it's that consistency that is so helpful. \n\nThere are great general fintech uses for it too as I use it to help with onboarding and retention issues.",
          "score": 1,
          "created_utc": "2026-02-21 10:09:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dogv4",
          "author": "TrioDeveloper",
          "text": "For me, AI isn't the edge but a multiplier. Without proprietary data, strong risk management, and solid execution, ML just helps you lose money faster. Most signals decay once they're crowded. Durable edge usually lives in data quality, capital allocation, and infrastructure. AI just accelerates the feedback loop. I think the real moat isn't that we use AI. It's what we have that others don't. Curious how others see it.",
          "score": 0,
          "created_utc": "2026-02-20 06:30:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8kk8u",
      "title": "Quick DLP Software reality check, what’s working for SaaS/cloud and source code?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r8kk8u/quick_dlp_software_reality_check_whats_working/",
      "author": "herereallygone00",
      "created_utc": "2026-02-19 00:34:36",
      "score": 25,
      "num_comments": 7,
      "upvote_ratio": 0.97,
      "text": "Hey folks, I’m trying to get a reality check from practitioners who’ve evaluated or deployed DLP Software recently (endpoint, network, and especially cloud/SaaS).\n\nA few things I’m specifically curious about:\n\nSource code protection:\n\nWhich DLP Software approaches actually work for repos, CI/CD artifacts, and dev laptops?\n\nAre you relying more on classification + policies, or secrets scanning + repo controls, or both?\n\nCloud/SaaS coverage:\n\nFor Microsoft 365 / Google Workspace / Slack / Salesforce / Box, etc., what’s been the best path: CASB-style controls, native SaaS controls, API-based DLP, or endpoint-first?\n\nAny big gaps you didn’t expect until rollout?\n\nBypass reality (the stuff users do):\n\nHow do common bypasses shake out in practice: password-protected archives, client-side encryption, screenshots, copy/paste into personal accounts, “shadow” upload tools, etc.?\n\nDo you treat DLP as “detect + deter,” or do you successfully block a meaningful % without breaking workflows?\n\nOperational pain:\n\nWhere do you spend most of your time: tuning rules, classification, exceptions, false positives, policy drift, or incident triage?\n\nAny “must-have” features for reducing noise (workflows, incident enrichment, integrations)?\n\nAlso: in the broader cloud data security conversation, I keep seeing Cyera mentioned alongside DSPM / data discovery + classification. From what I’ve read, teams sometimes pair discovery/classification with DLP Software controls (since finding and labeling sensitive data is half the battle). If anyone’s evaluated that “DSPM + DLP” combo, I’d love to hear what the decision criteria looked like (even if you didn’t pick Cyera).\n\nWhat vendors or patterns have you worked with, and what are the honest tradeoffs?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r8kk8u/quick_dlp_software_reality_check_whats_working/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o683qc7",
          "author": "Iron-Horde",
          "text": "We use Cyberhaven. Covers source code tracking from repos to wherever devs paste it, catches AI tools, personal accounts, etc.\n\nEndpoint approach works better than trying to integrate with every SaaS tool separately. Gets screenshots and copy/paste too.\n\nTuning took time upfront but investigations are way faster now you see the full story instead of digging through logs.",
          "score": 1,
          "created_utc": "2026-02-19 11:29:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a97a6",
          "author": "whatwilly0ubuild",
          "text": "Source code protection is where traditional DLP falls apart fastest. The tools built for detecting credit card numbers in emails don't understand code context at all. A function named `get_secret_key()` isn't sensitive, but the actual AWS credentials hardcoded three lines below it are. Most teams end up splitting this into two separate problems. Secrets scanning with tools like GitLeaks, TruffleHog, or GitHub's native scanning handles the credentials and API keys. Repo access controls and audit logging handle the \"who can see what code\" problem. Trying to force endpoint DLP to understand source code sensitivity is painful and generates endless false positives.\n\nFor cloud and SaaS coverage the honest answer is that no single approach covers everything well. Native controls in M365 and Google Workspace work reasonably for their own ecosystems but the policies don't translate across platforms. CASB-style inline inspection catches uploads but struggles with API-based access and sanctioned app usage. API-based DLP can scan content at rest but can't block in real-time. Most production deployments end up layering multiple approaches and accepting gaps. The big surprise for teams at rollout is usually how much sensitive data already exists in places they didn't know about, so discovery has to happen before enforcement or you're flying blind.\n\nThe bypass reality is humbling. Password-protected archives defeat most inspection. Client-side encryption before upload works if users are motivated. Screenshots and photos of screens are basically undetectable. Copy-paste into personal browser sessions or webmail is hard to block without aggressive endpoint lockdown that kills productivity. Our clients running DLP programs have generally landed on \"detect and deter\" rather than \"block everything\" because the blocking approach creates so much friction that users find workarounds or productivity tanks. The deterrence value comes from users knowing their actions are logged even if not blocked.\n\nOperational time distribution in my experience is roughly 40% false positive tuning and exception handling, 30% policy drift as business processes change and new tools get adopted, 20% incident triage, 10% actual new policy development. The classification problem dominates everything because if you can't accurately identify what's sensitive, your policies are either too broad and noisy or too narrow and miss things.\n\nOn the DSPM plus DLP combination, the logic is sound. You can't protect data you don't know exists. Discovery and classification tools like Cyera, Varonis, or BigID find where sensitive data actually lives, then DLP policies enforce controls based on those classifications. The decision criteria usually come down to whether your primary gap is visibility or enforcement. If you don't know where your sensitive data is, DSPM first. If you know but can't control it, DLP first. Most teams that try to deploy DLP without good discovery end up drowning in false positives or missing their actual high-risk data.",
          "score": 1,
          "created_utc": "2026-02-19 18:31:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aaf8s",
          "author": "NewZealandTemp",
          "text": "One thing I keep seeing in comparisons is that “DLP Software” can mean totally different things depending on where enforcement happens:\n\nEndpoint DLP (agents controlling copy/paste, printing, uploads, removable media)\n\nNetwork DLP (egress inspection, proxies)\n\nSaaS/API DLP (scanning content inside apps like M365/Drive/Slack)\n\nCloud data security / DSPM (discovery/classification across cloud data stores)\n\nFrom what I’ve read in vendor bakeoffs and analyst-style writeups, a lot of misses come from assuming one category covers all. Curious how people here map “what we’re trying to stop” → “where we enforce,” especially for dev workflows and SaaS sprawl.",
          "score": 1,
          "created_utc": "2026-02-19 18:36:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ce0px",
          "author": "Ok_Interaction_7267",
          "text": "We went through this recently in a SaaS-heavy environment.\n\nBig takeaway: DLP without good data context is rough. On its own it turned into regex tuning + false positives. Once we had continuous data discovery/classification in place (we use Sentra for cloud/SaaS), DLP got more precise because policies were tied to actual sensitivity and exposure, not just content patterns.\n\nFor source code, traditional DLP wasn’t the main control. It’s mostly secrets scanning in repos/CI, tight repo permissions, and monitoring obvious exfil paths on endpoints.\n\nFor M365/Google Workspace, API-level visibility into the data was key. Endpoint-only didn’t cut it. AI assistants just amplify whatever permission mess already exists.\n\nYou’re never going to block every bypass without breaking workflows. We block clear high-risk cases, detect/escalate the gray area, and focus heavily on reducing overexposed sensitive data upstream.",
          "score": 1,
          "created_utc": "2026-02-20 01:10:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d5na4",
          "author": "Papito24",
          "text": "On bypasses: password-protected archives + client-side encryption seem like the classic “limits of content inspection” problem. The discussions I’ve seen tend to frame it as: if you can’t inspect content, you end up leaning on context signals (destination domain/app, user risk, device posture, unusual volumes, labels, etc.) and process controls (repo permissions, secrets management, least privilege, monitoring).\n\nIf your program is mature, do you treat encrypted exfil as “always block to unknown destinations,” or do you allow it with stricter controls (like only to approved storage/workflows)? I’m trying to understand what’s realistic without causing constant business exceptions.",
          "score": 1,
          "created_utc": "2026-02-20 04:03:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qj5rx",
          "author": "Mormegil1971",
          "text": "I’m also curious how many teams are pairing data discovery/classification tools with DLP Software. The argument I keep seeing is: “DLP policies get way easier when you actually know where sensitive data lives and it’s labeled.” Cyera comes up in that context as a DSPM/data discovery option people compare, but I’m not sure how common the pairing is in practice versus trying to do everything inside one suite.\n\nIf you’ve evaluated “DSPM + DLP,” what were the deal-breakers or success factors? (Coverage of data stores, accuracy of classification, integration into enforcement, incident workflow, etc.)",
          "score": 1,
          "created_utc": "2026-02-22 07:30:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6vo4lv",
          "author": "Spawn_75_3311",
          "text": "Cyberhaven is the way to go.",
          "score": 1,
          "created_utc": "2026-02-23 01:47:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8bof7",
      "title": "Fintech history timeline",
      "subreddit": "fintech",
      "url": "https://i.imgur.com/1aEdLPp.jpeg",
      "author": "boppyblice25",
      "created_utc": "2026-02-18 18:51:23",
      "score": 15,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r8bof7/fintech_history_timeline/",
      "domain": "i.imgur.com",
      "is_self": false,
      "comments": [
        {
          "id": "o67ag1y",
          "author": "PassionImpossible326",
          "text": "This is very much detail graph. And I dint know world's first ATM was launched by Barclys bank",
          "score": 1,
          "created_utc": "2026-02-19 06:56:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69lcj8",
          "author": "rain_malanix",
          "text": "Neat, but I feel like Ethereum is notable and relevant enough to make the timeline too",
          "score": 1,
          "created_utc": "2026-02-19 16:37:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o658kgu",
          "author": "ploesdrupl",
          "text": "I dont think Google Wallet is significant enough to be on that timeline",
          "score": 0,
          "created_utc": "2026-02-18 23:09:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rc3tac",
      "title": "Expense platform PayEM astroturfing finance subreddits with a single account",
      "subreddit": "fintech",
      "url": "https://i.redd.it/a3v8dups23lg1.png",
      "author": "partyxpat",
      "created_utc": "2026-02-23 01:20:34",
      "score": 11,
      "num_comments": 0,
      "upvote_ratio": 0.93,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1rc3tac/expense_platform_payem_astroturfing_finance/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1rc9dn9",
      "title": "Prototyping real use cases is way harder than designing “Happy Path” screens",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1rc9dn9/prototyping_real_use_cases_is_way_harder_than/",
      "author": "Curious-Session4119",
      "created_utc": "2026-02-23 05:53:38",
      "score": 8,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I’m building prototypes for a fintech product, and I realized something: designing the main flow is easy. Designing real behavior is not. What happens when a user skips a step?  \nwhat happens when data is missing?, what happens when they come back after 3 months? My prototypes look great when everything goes right. The second I try to map real-world use cases, my design files explode into duplicates and disconnected screens. I want a way to visually organize use cases, branches, and logic before everything becomes high-fidelity. Some place where wireframes, notes, and flows can live together, so im not guessing how the product should behave.\n\nAt the moment, my prototypes show UI but not product thinking.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1rc9dn9/prototyping_real_use_cases_is_way_harder_than/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o6wp40b",
          "author": "Careless_Passage8487",
          "text": "For a particularly messy fintech project, we moved the early flow mapping into Miro. Instead of trying to represent everything in Figma from the start, we created a shared board where each path happy, skipped, or exception had its own branch. Screens, notes, and edge cases lived together visually. Stakeholders could explore scenarios without breaking the design file, and developers could see exactly how logic connected to screens.",
          "score": 5,
          "created_utc": "2026-02-23 05:58:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wslh1",
          "author": "Firm-Goose447",
          "text": "We were building a subscription management feature, the happy path sign up, add card, confirm email was easy. but when we mapped real-world behaviors like paused accounts, expired cards, skipped verification, or users returning after months, our figma file quickly became a tangled mess of 50+ screens. developers couldn’t tell which screens were authoritative, and product managers were constantly asking for clarifications. It really made.",
          "score": 2,
          "created_utc": "2026-02-23 06:28:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x5tl9",
          "author": "ETP_Queen",
          "text": "missing data, retries, stale sessions, regulatory flags, reconciliation breaks. If those aren’t mapped first, the prototype is just a demo, not a system. I’ve found it helps to model states and transitions (almost like a mini state machine) before touching high-fidelity screens. Flows break less when the logic is explicit.",
          "score": 2,
          "created_utc": "2026-02-23 08:32:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wpwz0",
          "author": "Economy_Passenger296",
          "text": "For me, the first mistake is trying to force everything into a single high-fidelity prototype too early. ive started keeping a “logic-first” layer a visual diagram of every user path, edge case, and failure scenario, separate from polished screens. once that layer is clear, creating wireframes or prototypes is much faster, and you don’t lose context when things inevitably change.",
          "score": 1,
          "created_utc": "2026-02-23 06:05:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9gdla",
      "title": "QA here — uneasy about AI being pushed toward production in lending systems. Am I overthinking this?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r9gdla/qa_here_uneasy_about_ai_being_pushed_toward/",
      "author": "c0rza1r_12",
      "created_utc": "2026-02-20 00:23:05",
      "score": 7,
      "num_comments": 18,
      "upvote_ratio": 0.89,
      "text": "I work in fintech (mortgage / loan origination systems), mainly on the QA / validation side. I’m not an AI expert — I was pulled into an internal AI project because of my domain and testing background.\n\nThe goal was to use AI to generate business rules for mortgages and consumer loans. On paper it sounds great — faster rule writing, less manual effort, more efficiency.\n\nIn practice… it’s been messy.\n\nWe tested multiple baseline models. Refined prompts. Added structured output constraints. Wrapped guardrails around it. Tried narrowing scope. And still:\n\n\t•\tLogical inconsistencies\n\n\t•\tEdge cases breaking\n\n\t•\tConfident-but-wrong outputs\n\n\t•\tStrange eligibility conditions\n\n\t•\tFormatting issues that could affect downstream systems\n\nFrom a QA perspective, this isn’t minor. In lending, small logic errors can mean incorrect approvals or declines. That’s compliance exposure, audit findings, and real customer impact.\n\nWhat’s honestly making me uneasy is that there’s still momentum to move it closer to production. I get the innovation pressure. AI is the buzzword. Nobody wants to look like they’re lagging behind.\n\nBut there’s a difference between using AI as a drafting assistant that a human fully owns and validates… and letting it influence decision logic in heavily regulated systems.\n\nAgain, I’m not anti-AI. I actually find the tech interesting and I’m not trying to block innovation. I just feel like the reliability and determinism gap is being underestimated.\n\nAm I overreacting?\n\nIs anyone else in fintech seeing this “ship it and harden it later” mindset around LLMs?\n\nHow are you drawing the line between assistive tooling and production decision logic?\n\nTrying to figure out if this is just internal pressure where I am or if this is where the industry is heading.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r9gdla/qa_here_uneasy_about_ai_being_pushed_toward/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o6c8m63",
          "author": "amg-rx7",
          "text": "Not over reacting. You do need to cover your ass and inform the stakeholders of your observations of the results and state your concerns. Stakeholders being informed should include compliance leaders.\n\nYou should probably try and mitigate risk with a soft launch where ai makes the decision but needs human review before anything goes out to customers. Probably other risk mitigation steps as well…",
          "score": 4,
          "created_utc": "2026-02-20 00:37:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6cvsq2",
              "author": "c0rza1r_12",
              "text": "I did inform PO and CPO about the issues, it didn’t end up well, unfortunately. I quit because it was going against my professional standards. Thankfully I kept good contacts at the company, so people I know will show up for quality. I’ll use your advice earlier - before it becomes reactive. Thank you.",
              "score": 3,
              "created_utc": "2026-02-20 02:59:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6h5ds6",
                  "author": "RocheleAveruiz",
                  "text": "How did you make the decision to quit? A lot of people in these spaces will stay despite knowing fully well what they're doing and the implications, so seeing someone make the choice and have it be based on that is pretty rare.",
                  "score": 1,
                  "created_utc": "2026-02-20 19:23:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6jrh2x",
                  "author": "amg-rx7",
                  "text": "Pretty harsh but I understand",
                  "score": 1,
                  "created_utc": "2026-02-21 04:14:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6dhb3k",
          "author": "rhizome-compliance",
          "text": "I think it should work as you say: these systems can inform human decisions on loans, but not make them directly. Does your company have a legal department? An ally there might help to pump the breaks on this a bit.",
          "score": 3,
          "created_utc": "2026-02-20 05:29:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6e3vvx",
          "author": "ETP_Queen",
          "text": "You’re not overthinking it at all. In lending, small logic errors aren’t “bugs,” they’re real customer and compliance issues. If you’re already seeing inconsistencies and edge cases breaking, that’s a signal.\n\nAI can be great as a drafting or support tool, but decision logic in regulated systems needs to be deterministic and fully auditable. “Ship and harden later” doesn’t really work when approvals and declines are involved.",
          "score": 3,
          "created_utc": "2026-02-20 08:53:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dd4oo",
          "author": "opinionsnotmine",
          "text": "In the US, consumer lenders most provide the specific reasons for denial of an application for credit. I would be equally worried about \"disparate impact\" liability if the models have discriminatory effects of a protected basis - while the CFPB has been clear that they won't bring actions under the disparate impact their, many states' AG will absolutely continue to do so.  Also note that, even absent any disparate impact, there could be fair lending liability for using data are \"proxies\" for membership in a protected class.  AI use is definitely risky, but there are absolutely ways to use AI responsibly and with minimal added regulatory risk.  ",
          "score": 2,
          "created_utc": "2026-02-20 04:57:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eq1b3",
          "author": "Professional_Mix2418",
          "text": "Also pending your jurisdiction consumer have the right not to have automated decision making. The AI Act also identifies high risk businesses and this seems to fall into that category. This may help your case to frame it constructively. And even if the EU AI Act isn’t applicable in your jurisdiction you can still use it as a best practice test and conscious decision point to do or not do. \n\nThat way you aren’t making it about you, you are pointing to recognised standards.",
          "score": 2,
          "created_utc": "2026-02-20 12:06:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fo2ha",
              "author": "c0rza1r_12",
              "text": "\nWe’re operating in NL, Germany and now the UK, how would you bring this up if you were me? Would you directly reference the EU AI Act + automated decision-making / high-risk stuff, or just position it more as “this is where regulation is heading / recognised best practice”?",
              "score": 1,
              "created_utc": "2026-02-20 15:18:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6fr0bg",
                  "author": "Professional_Mix2418",
                  "text": "The AI was enacted last year februari. In the NL and DE it is the law. I wouldn’t bring it that hard as many organisations aren’t aware of it. And the regulators I. NL it’s with the AP are toothless. \n\nBut as part of the project you have both GDPR and the AI Act that give the guard rails on how this can be used. So as you have the concerns already from your experience and as a human being, familiarise yourself with those pieces and bring it in as a positive constructive feedback with regulatory implications. The fintech sector is already in the high risk category so this isn’t an option for them. \n\nBut yes too often management has got no clue, sales people find compliance and regulations annoying. But it’s a fiduciary duty to the organisation to protect it.",
                  "score": 2,
                  "created_utc": "2026-02-20 15:32:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6c6q16",
          "author": "venturepulse",
          "text": "you forgot to say which model you used",
          "score": 1,
          "created_utc": "2026-02-20 00:26:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6c8t15",
          "author": "c0rza1r_12",
          "text": "We used GPT-4 Turbo and Claude 3 Opus. Both were prompted with the same inputs for consistency.",
          "score": 1,
          "created_utc": "2026-02-20 00:38:59",
          "is_submitter": true,
          "replies": [
            {
              "id": "o6df4b6",
              "author": "cxavierc21",
              "text": "Why such out of date models?",
              "score": 1,
              "created_utc": "2026-02-20 05:12:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6dvl8z",
                  "author": "c0rza1r_12",
                  "text": "Those were the models we used when I was actively on the project a year ago.",
                  "score": 1,
                  "created_utc": "2026-02-20 07:35:17",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6con0c",
          "author": "PuzzleheadedPeace360",
          "text": "Isn’t it illegal in your state/jurisdiction to deny loans without explaining the exact reasons? If the AI model hallucinates it can expose the company to a big liability. ",
          "score": 1,
          "created_utc": "2026-02-20 02:15:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gzaal",
          "author": "sgart25",
          "text": "Vendor here in the space assisting with real-time querying of account info for support purposes. We are strongly against the approach of “hardening it later.” Our philosophy is to master 1-2 use cases, demonstrate success with customers, and build on use cases from there.",
          "score": 1,
          "created_utc": "2026-02-20 18:55:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6h580h",
          "author": "whatwilly0ubuild",
          "text": "You're not overthinking this. Your instincts are correct and the concerns you're raising are exactly what a good QA person should be surfacing.\n\nThe core problem is that LLMs are probabilistic systems being asked to produce deterministic logic. Business rules in lending need to be exactly right every time. An LLM producing a rule that's correct 95% of the time is a compliance nightmare because you don't know which 5% is wrong until it's already made bad decisions. The \"confident but wrong\" pattern you're observing isn't a bug you can fix with better prompts, it's fundamental to how these models work.\n\nThe distinction you drew is the right one. AI as drafting assistant where humans fully validate every output is reasonable. AI influencing production decision logic in regulated lending is a different risk category entirely. The problem with the second scenario isn't that AI is involved, it's that the validation burden doesn't actually decrease. If you have to fully verify every rule the AI generates, you haven't saved effort, you've added a step while creating false confidence that the AI output is a reasonable starting point.\n\nThe \"ship it and harden it later\" mindset around LLMs is absolutely happening across fintech. Our clients see it constantly. The pressure comes from leadership reading headlines about AI transformation and not wanting to fall behind. The problem is that \"harden it later\" doesn't work for compliance. You can't un-approve a loan that shouldn't have been approved, and regulators don't accept \"we were iterating\" as an explanation for fair lending violations.\n\nWhere to draw the line practically. If the AI output goes directly into a system that affects customer outcomes without expert human review of every single output, it's not ready. If the failure mode is \"customer gets wrong decision\" rather than \"employee has to redo some work,\" the bar for reliability is regulatory, not just operational.\n\nDocument your findings thoroughly. When this becomes an audit issue later, you want a clear record that QA raised concerns.",
          "score": 1,
          "created_utc": "2026-02-20 19:22:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdainv",
      "title": "Anyone here actually using bunq? I'm more interested in real bunq bank reviews.",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1rdainv/anyone_here_actually_using_bunq_im_more/",
      "author": "Zirerag",
      "created_utc": "2026-02-24 08:13:21",
      "score": 6,
      "num_comments": 6,
      "upvote_ratio": 0.88,
      "text": "I've been looking into bunq lately as an alternative to Revolut. I'm wondering if it is a solid choice for digital nomads? I'd prefer to manage everything remotely and avoid dealing with physical branches altogether. Specifically, I'm curious about: international payments, some investing features, and is it possible to pay by credit card around the world without restrictions? I'd love to hear honest feedback from people who've using it long-term.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1rdainv/anyone_here_actually_using_bunq_im_more/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o73qn4m",
          "author": "rubenknol",
          "text": "non-SEPA international payments are done through an integration with Wise, they do not natively do foreign currency transfers\n\nthe support is completely unreachable ever since they replaced the chat with an AI bot, you can NEVER talk to a human again and many people who need urgent help are left without it as a result\n\nthe credit card is actually accepted as one internationally, but in some EU countries car rental places understand that it's not a 'real' credit card/there is no underlying credit line and will not accept them\n\nif you don't do shady stuff, your account will not be restricted - anyone who had their account restricted did shady stuff like onlyfans, unregulated crypto exchanges or receiving random mid-size amounts from random people",
          "score": 2,
          "created_utc": "2026-02-24 08:26:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73upef",
              "author": "Zirerag",
              "text": "Yeah, I mean I read a bunch of reviews, but opinions are different, some positive, others negative. And the same for all online banks. That’s why I asked a question here. Thanks anyway!",
              "score": 1,
              "created_utc": "2026-02-24 09:05:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o742kw1",
                  "author": "rubenknol",
                  "text": "that said, i've used it as my main bank for over 7 years while i lived in Germany and had no issues receiving salary, paying bills, daily spend, paying abroad",
                  "score": 1,
                  "created_utc": "2026-02-24 10:19:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o73rc0t",
          "author": "xavier_D_amico",
          "text": "I've been using bunq for about 1.5 years now. Since I work remotely as well, I prefer online banks, and so far it's been pretty good. They regularly update and add new features, and I like that I can handle most things myself, approvals, transfers, opening additional accounts without having to contact support.\n\nFor international payments, I mostly use local IBANs. Transfers have been fast and without much bureacracy. I recently traveled to Vietnam and Thailand, and my credit card worked fine there.\n\nAs for investing features, I can't say anything about it since I don't use them.",
          "score": 2,
          "created_utc": "2026-02-24 08:32:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73uqx8",
              "author": "Zirerag",
              "text": "Thank u for sharing ur XP!",
              "score": 1,
              "created_utc": "2026-02-24 09:05:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o74bkbi",
          "author": "Doughwisdom",
          "text": "It’s great for managing money on the go, but I’d just make sure you’re comfortable with the mixed reviews on customer support before going all in.",
          "score": 1,
          "created_utc": "2026-02-24 11:37:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8j1q8",
      "title": "Saw these guys promising to replace compliance teams. How many times are we going to fall for this?",
      "subreddit": "fintech",
      "url": "https://www.linkedin.com/posts/alexandreberkovic_yesterday-we-announced-our-71m-seed-round-activity-7430027952643432449-2nU4?utm_source=share&utm_medium=member_desktop&rcm=ACoAACc5Fz0BOlOIh6vul9nrOfEyyFXnpwIoNjs",
      "author": "AinaPapaya",
      "created_utc": "2026-02-18 23:30:00",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r8j1q8/saw_these_guys_promising_to_replace_compliance/",
      "domain": "linkedin.com",
      "is_self": false,
      "comments": [
        {
          "id": "o65u7nc",
          "author": "meninblck9",
          "text": "This all breaks down when you have complicated names. NICE has been around forever and not cracked the code. Uipath just acquired Workfusion who uses AI agents for AML / KYC sanction screening. The space is a mess still.",
          "score": 2,
          "created_utc": "2026-02-19 01:08:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65z92z",
          "author": "13Morton",
          "text": "I’ve been in identity / AML long enough to have seen a few “this replaces compliance” waves come and go.\n\nThe pattern is usually the same: we treat AML like a detection or pattern-matching problem when in reality it’s a judgment, defensibility, and governance problem.\n\nTransaction monitoring? Sure; models can (and should) improve signal quality. Screening? Automate it. Triage? Optimize it.\n\nBut a SAR narrative isn’t just an output. It’s a position. It’s something you may have to defend to regulators months later with documented rationale, policy alignment, and an audit trail that holds up under scrutiny.\n\nRegulators don’t examine “model confidence scores.” They examine controls, governance, explainability, escalation paths, and documented human accountability.\n\nAI can absolutely make compliance teams more effective.\n“Your last compliance hire” is a very different claim.\n\nIf anything, the vendors who win long-term are the ones who understand they’re augmenting risk judgment, not replacing it.",
          "score": 2,
          "created_utc": "2026-02-19 01:38:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65yug1",
          "author": "lodavo",
          "text": "There are some things that humans should be behind. Security is one of them. Either the AI is too stupid to do it properly or you have a super intellectual black box whose reasoning/intention isn't fully understood controlling your security system.",
          "score": 1,
          "created_utc": "2026-02-19 01:36:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66pvbb",
          "author": "PassionImpossible326",
          "text": "Those all are flashy demos created by Cloude , kids of age 16-17 trying to take on messy fintech problems , c'mon NICE,ACTIMIZE and player like them been here more than your age and still not able to Crack that.\nSuch demos kicked out of the room when compliance team start reviewing them.",
          "score": 1,
          "created_utc": "2026-02-19 04:18:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8vlsk",
      "title": "NEW AML AI-POWERED",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r8vlsk/new_aml_aipowered/",
      "author": "Organic_Act7411",
      "created_utc": "2026-02-19 10:18:56",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I'm founder and dev of an AI-powered platform designed to automate Anti-Money Laundering (AML) investigations for compliance teams, particularly in EU fintechs\n\nI get good feedback from fintech people and I wanna know what possible feature if you are in (neobanks, exchanges crypto, payments, would add to make it more complete, now the plataform has: AI agent investigator with deep reasoning, generating structured narratives, compliant STR/SAR drafts, and full explainability in minutes. Enable end-to-end investigations in 60 seconds, and adapt via human feedback loops for MiCA/5AMLD auditability.\n\nwhat feature you would remove/add for make it more stand out in the crowded AML IA space\n\nthanks folks",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r8vlsk/new_aml_aipowered/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o67wq2r",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-19 10:28:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67xmc0",
              "author": "Organic_Act7411",
              "text": "Totally agree. those 4 features we have it already, just the 4th one is on dev mode but for got to market is fine not have it for now, I'll take look to Agentix Labs ref. cheers",
              "score": 1,
              "created_utc": "2026-02-19 10:36:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r9ojs5",
      "title": "ION group LDP superday advice",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r9ojs5/ion_group_ldp_superday_advice/",
      "author": "Former-Screen8870",
      "created_utc": "2026-02-20 07:04:57",
      "score": 5,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Hey!! Has anyone attended the ion group rotational analyst ldp superday in the past? Got shortlisted for it but have no idea what to expect or how to prepare, any help would be greatt!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r9ojs5/ion_group_ldp_superday_advice/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o6yiejv",
          "author": "Chemical_Anybody9772",
          "text": "Which regional superday are you attending? \n\n",
          "score": 1,
          "created_utc": "2026-02-23 14:44:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ypt8v",
              "author": "Former-Screen8870",
              "text": "In hong kong",
              "score": 1,
              "created_utc": "2026-02-23 15:22:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6yqate",
                  "author": "Chemical_Anybody9772",
                  "text": "ah good luck... I also applied in hk but I didn't get any email... seems like I am ghosted :(",
                  "score": 1,
                  "created_utc": "2026-02-23 15:24:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o714x7d",
          "author": "bakhshish10",
          "text": "hey congrats!! how close to the superday did they send invites, like 2-3 weeks?",
          "score": 1,
          "created_utc": "2026-02-23 22:12:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71t6zq",
              "author": "Former-Screen8870",
              "text": "Thanks! Also around 4 weeks",
              "score": 1,
              "created_utc": "2026-02-24 00:24:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rbwh56",
      "title": "Everyone is talking about Voice AI in BFSI. Why is no one talking about in-app AI agents?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1rbwh56/everyone_is_talking_about_voice_ai_in_bfsi_why_is/",
      "author": "DizzyGold6618",
      "created_utc": "2026-02-22 20:23:41",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 0.86,
      "text": "Scroll through any fintech or BFSI thread right now and it’s all Voice AI.\n\nVoice automation.\nVoice agents.\nVoice collections.\nVoice compliance.\n\nBut almost no one is talking about what’s happening inside the app itself.\nMost drop-offs in BFSI don’t happen on calls.\n\nThey happen inside:\n\nKYC flows\nLoan applications\nDispute forms\nPayment journeys\nOnboarding steps\n\nUsers abandon mid-journey because the app cannot resolve friction in real time.\n\nIt shows information.\nIt explains policy.\nIt redirects to support.\nBut it does not act.\n\nVoice AI is powerful for outbound, reminders, and support automation.\n\nBut if the in-app experience is still static, context-blind, and escalation-heavy, are we really solving the biggest leakage points?\nWhy are we optimizing the channel\ninstead of optimizing the journey?\n\nSerious question for product teams in BFSI:\n\nWould reducing in-app drop-offs by even 10 to 15 percent have a bigger revenue impact than automating more call volume?\nCurious if others are seeing the same gap.\nIs in-app intelligence the quieter, bigger opportunity right now?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1rbwh56/everyone_is_talking_about_voice_ai_in_bfsi_why_is/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o6ue5tq",
          "author": "Fun-Hat6813",
          "text": "This hits so close to home it's almost painful. I spent years watching financial services companies pour millions into voice automation while their users were literally bleeding out through broken application flows. The obsession with voice AI feels like we're polishing the doorknob while the house is on fire - sure, it's shiny and impressive, but people are still walking away frustrated before they even need to make a call.\n\n\n\nI've been neck deep in this exact problem, especially working with alternative lenders who were losing deals left and right because their KYC and application processes were these nightmarish document upload marathons. Users would get halfway through uploading bank statements or tax returns, hit some validation error or unclear instruction, and just... leave. No phone call, no complaint, just gone. We built intelligent agents at Starter Stack AI that actually understand what users are trying to accomplish in real time and can guide them through these complex flows, fix data issues on the spot, and eliminate those friction points that cause abandonment. The difference in completion rates is honestly staggering.\n\n\n\nThe revenue math on this is pretty brutal when you actually run the numbers. A 10-15% reduction in drop-offs during loan applications or onboarding can literally translate to millions in additional originations for mid-sized lenders, way more impact than automating another hundred collection calls. But voice AI gets all the buzz because it's easier to demo and sounds more futuristic than \"we made the form filling experience not suck.\" The real opportunity is building apps that can actually think and problem-solve alongside users instead of just displaying static information and hoping for the best.",
          "score": 2,
          "created_utc": "2026-02-22 21:30:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6wp7bd",
              "author": "DizzyGold6618",
              "text": "This is exactly the blind spot most teams underestimate.\n\nVoice automation gets budget because it is visible. In-app abandonment is silent.\n\nThe painful part is that users do not complain. They just drop.\n\nCompletely agree that fixing document upload loops, validation ambiguity, and unclear next steps can move revenue far more than optimizing call volume.\n\nWhere I think the next layer evolves is beyond guided assistance toward true in-app orchestration. Not just guiding users, but coordinating backend systems in real time so issues are resolved instead of just explained.\n\nWe are building Revrag around that premise. Intelligence that sits inside the application layer and works with backend state, not around it.\n\nWould love to compare notes on completion rate impact across different segments.",
              "score": 1,
              "created_utc": "2026-02-23 05:59:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o71pqw7",
          "author": "kubrador",
          "text": "you're right that in-app friction is the bigger leak, but voice ai gets funding because it's shinier and easier to demo to executives than \"our kyc form now has better context awareness.\" \n\nalso voice agents print money on collections calls in ways smooth ux never will, so venture capital votes accordingly.",
          "score": 1,
          "created_utc": "2026-02-24 00:05:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra9cjz",
      "title": "Director-level work without title/comp — normal?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1ra9cjz/directorlevel_work_without_titlecomp_normal/",
      "author": "Pbjamking1212",
      "created_utc": "2026-02-20 22:16:36",
      "score": 4,
      "num_comments": 5,
      "upvote_ratio": 0.75,
      "text": "Looking for perspective.\n\nI’ve been at a 15-year-old fintech (\\~25 employees) for almost 4 years. I’m a Senior AE (70k base / 150k OTE) and consistently hit quota.\n\nFor the past 6+ months, I’ve also been:\n\n* Hiring and interviewing new AEs\n* Training and coaching\n* Letting an underperformer go\n* Building sales processes\n* Representing sales in product meetings\n* Supporting enterprise deals\n* All while still carrying my own number\n\nWe have two AEs total (including me). I hired the other rep, and he’s still ramping and requires support.\n\nI asked the President about formalizing a Director of Sales role and adjusting comp. He said he’s “not sure we need a manager” yet, but expects me to build the sales team.\n\nAt this point, it feels like I’m being asked to do leadership work without authority or compensation — basically doing it for free.\n\nIs this a normal “prove it first” situation in small companies? Or is this a misalignment I should push harder on?\n\nTrying to handle this strategically, not emotionally. Appreciate any honest thoughts.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1ra9cjz/directorlevel_work_without_titlecomp_normal/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o6i6uh0",
          "author": "cxavierc21",
          "text": "Push harder. Be ready to walk, though.",
          "score": 2,
          "created_utc": "2026-02-20 22:29:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6iaps6",
          "author": "Murdles14u",
          "text": "Ya, they’re taking advantage of the situation. \n\nNow you’re stuck, if you pull back and focus on sales then you’re not a team player.\n\nLike the other comment above, push harder and be ready to walk. \n\nYou could prepare for your next conversation with an ask of an extra $15-$20k of base to bridge the gap. Usually a Director should carry a base of $125-$150k depending on the company size. So if you approach it as a middle ground that rewards you for your extra care and attention, but still saves him on a new hire at a higher comp plan then he should see the logic and give you the bump up. \n\nIf you go a bit deeper and do some market research to see what the Director level roles are like in your region and industry then share that info while you’re asking for more money, that shows you’re aware of your value in the marketplace and it also shows the value of your smaller ask of 15-20k. \n\nAlso, ask yourself if you want to grow into a director role fully? If yes, then the conversation is about setting you on a path and the comp is the motivator for that. If that’s the case, then in that same conversation position the bump as a stepping stone to when you become a director and will grow the sales team and take on the target of your whole team. But that would also be another raise and restructuring of your comp plan to give you a variable that’s brings your OTE close to $200k.\n\nI caution you against actually interviewing/accepting another role and telling him about it. I used to work for a VP who would counter offer the role, then fire the person after 6 months because they weren’t loyal enough.",
          "score": 1,
          "created_utc": "2026-02-20 22:50:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lzsnf",
          "author": "just-dg",
          "text": "It’s unfortunately normal, even in larger companies.\n\nThere’s a description people use called “founding AE” (or founding + whatever the role is) which implies selling, building process, probably helping build a team, etc. That’s more common in new startups, probably with a similar FTE count to your company. There’s typically some meaningful equity (of course only really matters when the company successfully exits) to align incentives.\n\n^^ This is what your actual role sounds like - could be wrong. You can use this if you look for a role elsewhere and it should resonate.\n\nWhich do you care about more - authority or compensation?\n\nYou could open up a conversation about comp - equity, higher commission with higher targets, etc. It doesn’t need to be dependent on becoming a director or manager.\n\nYou could also ask for more details on when they see the need coming. If you’re involved in hiring, you will probably have a decent idea. 3-5 direct reports is a reasonable point to need it.\n\nYou could ask for more explicit authority but I wouldn’t do that without having the pay behind it. They are incentivized to do this. It’s a business, and the objective is to get the most ROI out of their capital as possible - you are human capital.\n",
          "score": 1,
          "created_utc": "2026-02-21 15:10:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6pgr31",
          "author": "kubrador",
          "text": "you're doing the job for free, they're just not calling it that yet. the \"prove it first\" thing works when there's actual growth to show. if you're hiring your second rep and he's still ramping, you haven't proven the model scales yet, which is probably their (dumb) logic.\n\n\n\npush harder, but frame it differently: \"here's what director-level work costs in the market, here's what i'm already doing, pick a number or i'm job searching\". vague timelines get you nowhere.",
          "score": 1,
          "created_utc": "2026-02-22 02:32:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72tu9a",
          "author": "itsdrmario515",
          "text": "You need to be director with manager / contributor roles",
          "score": 1,
          "created_utc": "2026-02-24 03:59:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9204y",
      "title": "Looking for a technical cofounder (AI + FinTech / RegTech)",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r9204y/looking_for_a_technical_cofounder_ai_fintech/",
      "author": "Motor_Advertising193",
      "created_utc": "2026-02-19 15:22:35",
      "score": 4,
      "num_comments": 2,
      "upvote_ratio": 0.75,
      "text": "Hi all, slightly different post to the usual “idea looking for dev”.\n\nI work in financial crime / compliance in the UK and have been deep in the intersection of regulation and AI over the past year. I’m now building an AI-native RegTech platform aimed at becoming a “Stripe for compliance” — starting with automated AML and AI Act readiness for financial institutions.\n\nThis isn’t a napkin idea. I’ve already mapped:\n\n• MVP architecture\n\n• Regulatory model (UK/EU)\n\n• Product thesis\n\n• Early positioning\n\nWhat I don’t have (yet) is the right technical partner.\n\nI’m looking for a backend-leaning builder (Python/Node, AI API familiarity, cloud infra) who’s interested in building something meaningful in a space that’s about to get very real very quickly.\n\nNot looking for freelancers or agencies — I’m looking for a true cofounder. Equity-based, long-term thinking.\n\nIf you’ve worked in fintech, regtech, or enterprise SaaS and have been itching to build something serious, I’d genuinely love to connect.\n\nHappy to share the blueprint and thinking openly.\n\nJohn",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r9204y/looking_for_a_technical_cofounder_ai_fintech/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o6c0vxt",
          "author": "465di",
          "text": "Have dm'd",
          "score": 1,
          "created_utc": "2026-02-19 23:53:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd75ev",
      "title": "ai data security platform question: genai rollout created a visibility gap we can’t close",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1rd75ev/ai_data_security_platform_question_genai_rollout/",
      "author": "No_Glass3665",
      "created_utc": "2026-02-24 05:09:30",
      "score": 4,
      "num_comments": 7,
      "upvote_ratio": 0.84,
      "text": "From what I’ve read in AI governance/security discussions, a lot of teams hit the same snag: GenAI adoption outpaces guardrails, and then data starts flowing through prompts, copilots, and connectors/vector stores without a clean end to end map.\n\n\nIf you’ve worked on getting this under control, what was the first practical step that actually helped inventorying apps/data paths, tightening permissions, prompt/data controls, better logging, adding an AI security/DSPM layer, etc.? What order worked?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1rd75ev/ai_data_security_platform_question_genai_rollout/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o735e8w",
          "author": "kubrador",
          "text": "shadow it is always the answer. stop pretending you know what's happening, audit what actually is, then you can fix it. the moment you try to \"implement governance first\" you've already lost because your engineers are three genai tools deep and nobody told you.",
          "score": 1,
          "created_utc": "2026-02-24 05:21:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7389a4",
          "author": "Soft_Emotion_9794",
          "text": "From what I’ve seen in writeups and team discussions, tools like Cyera can help at least map where sensitive data lives and how it flows across systems, which makes the “who’s feeding what into AI” conversation a lot less hand wavy.",
          "score": 1,
          "created_utc": "2026-02-24 05:44:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o738kiu",
          "author": "Swimming_Humor1926",
          "text": "Most of the approaches I’ve read about lean toward the second. A DSPM style view (data locations, access paths, oversharing signals) doesn’t magically solve AI risk by itself, but it can remove the mystery around what’s exposed and to whom. Then teams usually layer in tighter permissions, better centralized logging, and basic policies for connectors and prompt handling (e.g., what’s allowed to be sent, how secrets are detected/redacted, which apps can connect to which stores). The AI part tends to get more manageable once the underlying data access picture is clearer.",
          "score": 1,
          "created_utc": "2026-02-24 05:46:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73d2bk",
          "author": "spillingteawbk",
          "text": "Yeah, this GenAI visibility gap is a real pain point, especially in regulated industries like fintech where data lineage and access are critical. It sounds like you're already on the right track thinking about order.\n\nFrom my experience, the first practical step that really makes a difference is actually starting with a thorough audit of what's \\*already happening\\* – the 'shadow AI' problem. Engineers are often using tools and connectors you might not even know about. So, I'd focus on:\n\nWe landed on using AccuKnox for this.   Use logs from your cloud providers, existing SIEM, and network traffic analysis to understand which AI tools and services are being used and what data they're interacting with. This is where you start building that initial map of app/data paths. It's not glamorous, but you can't secure what you don't know exists.\n\nOnce you have a rough idea of data flow, implementing strong data classification and discovery in your vector stores and wherever prompts are being processed becomes key. Tools that can identify sensitive data types (PII, financial info) are crucial here. We saw our sensitive data leakage risk drop by about 85% after getting a better handle on this.\n\nAfter inventory and classification, you can start layering in controls. This usually means starting with broader access policies for connectors and then getting more granular with prompt content filtering and data egress controls. Trying to do everything at once is a recipe for burnout.\n\nThe engineers will adopt new tools, and your job is to discover that adoption and then put appropriate guardrails in place systematically. It's an iterative process. A tool that helps unify visibility across cloud workloads, APIs, and data, especially with agentless capabilities, can really streamline this discovery phase without adding more operational overhead.",
          "score": 1,
          "created_utc": "2026-02-24 06:23:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73dlz1",
          "author": "MoistPear459",
          "text": "Did folks treat that as an AI specific fix, or more like “get data governance under control first” and AI is just another consumer of the same data layer?",
          "score": 1,
          "created_utc": "2026-02-24 06:28:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7654gd",
          "author": "Ok_Interaction_7267",
          "text": "This usually isn’t an “AI went rogue” problem. It’s that GenAI plugged into a data layer that was already messy.\n\nWhat’s worked from what I’ve seen is boring but effective: get real visibility into where sensitive data lives and who can access it. Clean up over-permissioned roles and long-lived tokens. Turn on logging around connectors and data movement. Then layer in prompt/egress controls.\n\nIf you skip straight to prompt filtering without fixing access, you’re just putting a filter on top of overshared data.\n\nDSPM-style tools (Sentra, Cyera, etc.) are relevant in that they help answer “who can access what and can it reach a model.”",
          "score": 1,
          "created_utc": "2026-02-24 17:24:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76ddmp",
          "author": "whatwilly0ubuild",
          "text": "The visibility gap problem is real and the order of operations matters more than most teams realize.\n\nInventory first, always. You can't secure what you don't know exists. Before tightening anything, map what GenAI tools are actually in use, not what's officially sanctioned. Shadow AI adoption is rampant. Check DNS logs, SSO integrations, expense reports for AI subscriptions, browser extension audits. Our clients consistently discover 3-5x more AI tools in use than IT officially approved. This inventory becomes your scope.\n\nData flow mapping second. For each tool identified, trace what data sources it can access. Copilots connected to email, docs, or code repos have implicit access to everything in those systems. Vector stores and RAG pipelines often ingest more than intended because someone pointed them at a broad file share. The connector and plugin architecture of most GenAI tools creates transitive access that's easy to miss.\n\nPermission tightening third, and this is where the real work starts. Most GenAI data exposure isn't the AI doing something wrong, it's the AI having access to data the user shouldn't have seen in the first place. Pre-existing permission sprawl becomes visible when an AI assistant surfaces documents the user technically had access to but never would have found. Fixing this is unglamorous IAM hygiene.\n\nLogging and monitoring fourth. Once you know what exists and have tightened permissions, instrument what you can. Prompt logging is sensitive because it captures user input, so legal and HR need to weigh in. But knowing what data is being sent to which models is essential for incident response.\n\nDSPM or AI security layers are useful but they're an overlay on the foundations above. They help with ongoing visibility and policy enforcement but can't fix gaps in inventory or permissions they don't know about.",
          "score": 1,
          "created_utc": "2026-02-24 18:01:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rab4yw",
      "title": "How long does it take to get a Neobank live these days?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1rab4yw/how_long_does_it_take_to_get_a_neobank_live_these/",
      "author": "No-Bad-3624",
      "created_utc": "2026-02-20 23:28:02",
      "score": 4,
      "num_comments": 20,
      "upvote_ratio": 0.83,
      "text": "If I wanted to launch a barebones Neobank how long would it take to launch with a Baas platform and how much would I be looking at cost wise in the US? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1rab4yw/how_long_does_it_take_to_get_a_neobank_live_these/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o6mymv5",
          "author": "barbsbaloney",
          "text": "Probably 3-12 months of biz dev. \n\nDepending on who your law firm is and what compliance model you develop could be faster. \n\nYou’d want to budge $20k/month for a bank deal and $100k in legal fees. Again could be less if you’re not working with a bank and have a different compliance model.",
          "score": 3,
          "created_utc": "2026-02-21 18:06:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x7iwl",
          "author": "ETP_Queen",
          "text": "tbh people always underestimate this. “just plug into a baas and ship” sounds easy but the sponsor bank, compliance model, card network approvals, kyc flows, ops playbooks… that’s where the real time goes. even a lean setup can drift into 6–12 months pretty fast.\n\ncost wise it’s rarely just dev. you’ve got platform minimums, bank/issuer fees, legal, compliance consultants, ongoing monitoring. the stack is doable, but the governance layer is what makes it real.",
          "score": 3,
          "created_utc": "2026-02-23 08:48:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ldzvj",
          "author": "ji_b",
          "text": "Need funding, and, consequently, a revenue model. Not every baas provider/issuer will share interest on deposits, and those that do will take a cut. Interchange also ain’t what it used to be, and, without a team/consultant (FSV et al.) in place to build said team, it’s a long shot. \n\n6-12 months with funding + team + bank in place.",
          "score": 2,
          "created_utc": "2026-02-21 12:56:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6vckjv",
          "author": "looch_app",
          "text": "We built a fully-functional neobank. In the US, neobank = no banking charter. BaaS platforms are happy to sell you their service, but then you need to pitch the partner bank and sometimes even Visa or Mastercard depending on what card you’re issuing. If interchange is your sole source of income, you’re not going to make it. Dev work depends on your team and the kind of UX you’re after. 6-12 months.",
          "score": 2,
          "created_utc": "2026-02-23 00:38:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ij6x7",
          "author": "monkey6",
          "text": "Ask us to write your business plan for you and to find investors for you as well",
          "score": 2,
          "created_utc": "2026-02-20 23:37:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6q27qa",
              "author": "houseofn1njas",
              "text": "For US banks only? What about UK?",
              "score": 1,
              "created_utc": "2026-02-22 05:02:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6mx00j",
          "author": "mightymouse1906",
          "text": "Why do we need yet another neo-bank? ",
          "score": 3,
          "created_utc": "2026-02-21 17:58:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ildry",
          "author": "comrace",
          "text": "Depends on your approach anything from 6-24 mths. License not included. I talk from experience",
          "score": 1,
          "created_utc": "2026-02-20 23:50:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6isp7x",
          "author": "ImTheDeveloper",
          "text": "Been through the process fully twice and now going into my 3rd. It 100% depends on your funding and the path the regulator puts you down. In the UK to go from 0 to live id say you're in 18 months territory but I'm the US you can shave a minimal amount off",
          "score": 1,
          "created_utc": "2026-02-21 00:32:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6q2da1",
              "author": "houseofn1njas",
              "text": "It takes a lot longer than 18 months in UK.  And substantial funding to get the right team in place.  Just to get the invite to apply, let alone apply and get the licence.",
              "score": 1,
              "created_utc": "2026-02-22 05:04:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6r07le",
                  "author": "ImTheDeveloper",
                  "text": "As I said it depends on your funding and whether you go into this with a predefined team. My 1st time round we were 2 years and one of the new banks going through at the time (think monzo/atom/starling era). 2nd time we were in alongside bank north, recognise, allica, gb bank, monument etc. This time round we are funded ahead of time due to parent company structures, team pre-assembled and knowledge of the process (see above) and a bank in the box rather than full build out.\n\nIt also depends on your goal posts for start and end of the process as well as the timeframe from the regulator to keep up with responses and feedback. The COVID era startup banks struggled massively and it did take 3+ years due to funding, regulatory feedback slowdown due to staff shortages etc. That's not the case right now they are sticking to the timelines and can be pushed along",
                  "score": 1,
                  "created_utc": "2026-02-22 10:13:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6jlt2d",
          "author": "fuggleruxpin",
          "text": "Doesn't it matter on what the bank does?  Custody/ lending / trading trust etc....",
          "score": 1,
          "created_utc": "2026-02-21 03:35:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6jouzk",
              "author": "No-Bad-3624",
              "text": "Just looking to offer checking accounts",
              "score": 1,
              "created_utc": "2026-02-21 03:56:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6mx5iy",
                  "author": "mightymouse1906",
                  "text": "why? ",
                  "score": 1,
                  "created_utc": "2026-02-21 17:59:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6nqsgk",
          "author": "Johnstake123",
          "text": "I have one for sale if you are interested. Send me dm. You will save a lot of time and money",
          "score": 1,
          "created_utc": "2026-02-21 20:29:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6pojpz",
          "author": "chrispedini",
          "text": "Please tell us what marginalized segment of society it is you want to save! Or will you plant a tree? Release a trout into a river? \n\nNeobanks are, by and large, just a branch of a legacy bank / system. I have more NDAs than I can remember but if you can DM me I’d love to help.",
          "score": 1,
          "created_utc": "2026-02-22 03:25:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74hrc3",
          "author": "marketingmonkey16",
          "text": "I was wondering for neobank related things, so I was referring to one of the **Goodfirms** page and they are claiming that the total time to launch the neobank is **7 to 14 months** inclusiveness all the processes from the base.",
          "score": 1,
          "created_utc": "2026-02-24 12:23:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7a6p80",
          "author": "massiew18",
          "text": "I’ve been looking into neobank launch timelines and most estimates seem to fall in the 7–14 month range if you include licensing, compliance (KYC/AML), core banking integration, card issuing, and regulatory approvals.\n\nI saw a similar timeframe referenced on Goodfirms, and it generally aligns with what firms like Deloitte and McKinsey & Company have discussed around regulatory and infrastructure complexity in digital banking builds.\n\nThat said, I assume the timeline changes significantly depending on whether you're using a BaaS provider vs. pursuing your own license.\n\nFor those who’ve worked on or launched a neobank — does 7–14 months sound realistic, or optimistic?",
          "score": 1,
          "created_utc": "2026-02-25 06:21:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd27g4",
      "title": "Are corporate cards legit / worth it?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1rd27g4/are_corporate_cards_legit_worth_it/",
      "author": "RocheleAveruiz",
      "created_utc": "2026-02-24 02:22:23",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 0.72,
      "text": "I'm not a fintech savant but I know my way around API's and tools. One topic that's come up a lot this year with other early stage founders raising post seed has been corporate cards. I know there are huge players in this space like ramp, etc. that offer corporate cards with expense management features built in, which I can see how it facilitates spend tracking. Any founders here using corporate cards who wouldn't mind sharing insights? When did you start looking into them and what made it the right time. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1rd27g4/are_corporate_cards_legit_worth_it/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o72n9nj",
          "author": "alicantetocomo",
          "text": "You want to build one or just use one?",
          "score": 2,
          "created_utc": "2026-02-24 03:18:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77guf6",
          "author": "DigIndependent7488",
          "text": "Ramp is great, their built in tools are really useful as well which is probably the best selling point to ramp compared to a lot of other competitors. When it comes to what to choose they actually have a pretty decent article comparing to all other cards: [https://ramp.com/business-credit-cards](https://ramp.com/business-credit-cards)\n\n  \nRamp's tracking automations are cool and very useful but maybe you could benefit more from another card's apr or cashback or so on. It all depends on how many employees, how many expenses, etc. And how much you value certain features over others.",
          "score": 1,
          "created_utc": "2026-02-24 21:01:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rc73h2",
      "title": "Built a UK app for private money pools (ROSCAs) but I am getting lost!",
      "subreddit": "fintech",
      "url": "https://i.redd.it/npou6o1ow5lg1.png",
      "author": "EMPTY-BOX-044",
      "created_utc": "2026-02-23 03:55:05",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 0.81,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1rc73h2/built_a_uk_app_for_private_money_pools_roscas_but/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o6xknai",
          "author": "schepter",
          "text": "Here's some harsh truths you asked for at the bottom.\n\nHow did you get so far into your app development before validating the core idea of holding funds into an escrow account. This should have been done as part of your MVP or discovery phase. It would've saved you weeks or months making the app and backend infrastructure.\n\nHow are you handling building their credit score and have you made the appropriate connections for reporting it? Usually in finance there's a lot of regulatory requirements for local regions so I'm hoping you've done that at least (worried you haven't since you didn't validate your escrow issue).",
          "score": 3,
          "created_utc": "2026-02-23 10:56:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yf994",
              "author": "njbmartin",
              "text": "Ultimately, this. You can pour your heart and soul into building something that solves a real problem, but doing the research first would have saved you the heartache. Finance is heavily regulated in the UK, and what you’re essentially trying to build is a “savings account” and would require partnering with an existing Electronic Money Institution partner.\n\nFor the “credit building” aspect, you’re probably looking at something similar to Loqbox, which would require you to be a credit broker and have appropriate regulations in place or require you to partner with. You would have to provide “credit” in order for you to report payments to credit reference agencies.\n\nWithout serious funding behind you, it will be impossible to get the support you need to make this work.",
              "score": 2,
              "created_utc": "2026-02-23 14:27:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7116j0",
                  "author": "EMPTY-BOX-044",
                  "text": "Thank you both for the honesty and the reality check. You are 100% right.\n\nI fully admit my mistake🤷‍♂️  \nI didn't do enough deep research on the compliance side before I started building. My motivation blinded me a bit 🙃. I genuinely believed this would be a massive, legal, and highly convenient solution for people. Seeing that Stripe provided almost everything out of the box (Payment Gateway + seamless KYC via Connect Express) made me rush into development, assuming they would naturally support the escrow-like flow for this use case.\n\nThat being said, I have absolutely zero regrets. Catching this critical flaw *before* launching and touching real user money is a huge win for me.\n\nThis roadblock definitely isn't going to stop me. Right now, I am waiting on replies from a few BaaS providers to see if I can partner with them and legally operate under their regulatory umbrella for the safeguarding piece. If I find the right provider, I have absolutely no problem rewriting the backend and adjusting the code to integrate their system, as long as it guarantees user funds are safe and makes the platform a true success.\n\nAs for the credit score feature, you're entirely right about the regulatory headache. Since I'm doing all that alone, I will push that to future updates once the core safeguarding is fully secured with the right provider.\n\nThanks again for the insights, it saved me from a massive disaster!",
                  "score": 1,
                  "created_utc": "2026-02-23 21:54:30",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o71ys5j",
          "author": "swemming",
          "text": "Would you be interested in doing this for the US?",
          "score": 2,
          "created_utc": "2026-02-24 00:55:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72cyne",
              "author": "EMPTY-BOX-044",
              "text": "100% yes! In fact, the US was a massive part of the roadmap from day one.\n\nMy original plan was to launch in the UK first to establish a really strong PoC and validate the model, and then immediately flip the switch to open it up in the US right after.\n\nThat’s actually the main reason I fell into the Stripe trap in the first place. I built the entire backend around Stripe Connect because I thought it would give me a seamless, out-of-the-box way to scale across both the UK and the US simultaneously without having to rebuild the infrastructure. It was a huge letdown when I realised their TOS strictly prohibits holding funds in escrow for this type of flow in both regions.\n\nBut launching in the US is still an absolute top priority for me once I secure the right BaaS/safeguarding partner",
              "score": 1,
              "created_utc": "2026-02-24 02:17:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7a3u1x",
          "author": "Zachariou",
          "text": "Really like the idea and execution however, If you’re handling “client money” as in you have control of the money, you NEED to be FCA regulated.",
          "score": 1,
          "created_utc": "2026-02-25 05:58:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9iywy",
      "title": "Does anyone experience long (business) customer onboarding?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r9iywy/does_anyone_experience_long_business_customer/",
      "author": "Icy_Tour6309",
      "created_utc": "2026-02-20 02:19:15",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I’m curious to hear if anyone is facing this problem. If not, how are you currently handling business customer onboarding? What tools are you using?\n\nWe’re building AI agents for AML and are looking for fintech startups struggling with KYB. We’re offering a free partnership to help streamline onboarding in exchange for feedback.\n\nCriteria to qualify:\n\n* You have at least 2 AML or compliance analysts\n* You primarily onboard businesses, not individuals\n* You struggle with manual document reviews\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r9iywy/does_anyone_experience_long_business_customer/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o6cqho0",
          "author": "Smooth_Wishbone1755",
          "text": "Yeah our KYB process is a nightmare - takes us like 3-4 weeks minimum for complex corporate structures and our compliance team is drowning in docs",
          "score": 3,
          "created_utc": "2026-02-20 02:27:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6cqwdm",
              "author": "Icy_Tour6309",
              "text": "I'll DM you",
              "score": 2,
              "created_utc": "2026-02-20 02:29:31",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6dqkf8",
              "author": "Flimsy-Ball2017",
              "text": "Just curious, any AI tool involved in this KYB process? ",
              "score": 2,
              "created_utc": "2026-02-20 06:49:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6kvdon",
          "author": "Stup2plending",
          "text": "It's long for everyone. I work a little down the funnel from you in retention strategies like why a business onboards but then does not transact or takes 6 weeks to make their first transaction.\n\nLet's talk.",
          "score": 2,
          "created_utc": "2026-02-21 10:11:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6v3e7y",
              "author": "Icy_Tour6309",
              "text": "Thanks for sharing this. I just sent you a message!",
              "score": 1,
              "created_utc": "2026-02-22 23:46:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r844re",
      "title": "Vibe-coded tools in financial advisor ops: what guardrails are non-negotiable?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r844re/vibecoded_tools_in_financial_advisor_ops_what/",
      "author": "obchillkenobi",
      "created_utc": "2026-02-18 14:16:00",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I’m seeing more teams vibe code  internal tools with AI (Replit/Cursor/ChatGPT-style), the kind that usually work well in a demo.   \n  \nFrom conversations with a few advisor-ops teams, a pattern I see is  that drafts + pre-flight checks are fine, but anything that starts behaving like a system of record (or complex workflows) is where things get messy.\n\nExamples  (from advisor/RIA ops POV):  \n\\- billing/fee checks (“does billed rate match the signed schedule/discounts?”)  \n\\- marketing/comms pre-checks (flag promissory language / missing disclosures  \n\\- onboarding/paperwork preflight \n\nFor anyone who has shipped similar tools in production:  \n\\- what’s safe to build this way vs a hard no?  \n\\- what guardrails actually mattered (approvals, evidence/logging, tests/goldens, access control, monitoring/rollback)?  \n  \nLooking for real patterns and any lessons you can share.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r844re/vibecoded_tools_in_financial_advisor_ops_what/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o62dimm",
          "author": "kubrador",
          "text": "the honest answer is \"all of it breaks the second a client calls their lawyer.\" you're basically asking which parts of compliance can be handled by vibes and the answer is none of them.\n\nthat said, the actual pattern i've seen work: treat ai-assisted tools like a really good intern who needs to get everything initialed. drafts and flags are fine because humans still decide. the moment it starts \\*deciding\\* (auto-billing adjustments, regulatory sign-offs, document finalization) you've moved from \"helpful\" to \"liability with a gpu.\"\n\nthe guardrails that mattered in practice were dumber than they sound. audit trails matter way more than you think because regulators don't care if your claude instance was right 99% of the time, they care that you can prove what happened. version control for prompts. separate staging/prod entirely. and honestly, the access control piece is underrated; not letting the tool touch prod databases",
          "score": 3,
          "created_utc": "2026-02-18 15:15:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6314g0",
              "author": "KimchiCuresEbola",
              "text": "Using AI to build proper system much more quickly with good engineers and domain experts = OK\n\nThrowing everything into AI and having it be \"the system\" != OK",
              "score": 1,
              "created_utc": "2026-02-18 17:03:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o62bgqz",
          "author": "oedividoe",
          "text": "Partner with teams/startups who are willing to co-build and co-evolve in AI ",
          "score": 2,
          "created_utc": "2026-02-18 15:06:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a9hh1",
          "author": "whatwilly0ubuild",
          "text": "The \"works in demo\" to \"works in production\" gap is exactly where vibe-coded tools fall apart in regulated contexts. The pattern you're seeing is correct, and the line you drew around system of record behavior is roughly the right place.\n\nWhat's generally safe to build this way. Read-only checks and flagging are the sweet spot. Fee schedule validation that surfaces discrepancies for human review, marketing copy scanners that flag potential compliance issues, document completeness checklists before submission. These tools can be wrong without catastrophic consequences because a human makes the final call. The AI is doing triage, not decisions.\n\nWhat's a hard no. Anything that writes to a system of record without human approval. Anything that generates client-facing content that goes out without review. Anything that calculates fees or billing amounts that flow directly into invoices. The moment the tool's output becomes the source of truth rather than an input to human judgment, you've crossed into territory where vibe-coded quality isn't acceptable.\n\nThe guardrails that actually mattered for our clients shipping similar tools. Logging everything with immutable audit trail was non-negotiable. Not just what the tool output, but what inputs it received, which version of the logic ran, and what the human did with the recommendation. When a regulator asks why a disclosure was missing, \"the AI said it was fine\" isn't an answer. Evidence that a human reviewed and approved is what matters.\n\nApproval gates with explicit sign-off are essential for anything beyond pure advisory output. The tool flags, a human reviews, the human clicks approve, that approval is logged. This sounds obvious but teams skip it because it adds friction, then regret it when something goes wrong.\n\nGolden test suites covering known edge cases saved teams from embarrassing failures. Vibe-coded tools break in weird ways when inputs drift from what the developer tested against. A set of regression cases that must pass before any deployment catches the obvious stuff.\n\nAccess control scoped tightly from day one. Internal tools tend to accumulate permissions over time. Start restrictive.\n\nRollback capability that's actually tested. When the tool starts producing garbage, can you revert in minutes or does it require an engineer to debug and redeploy?\n\nThe monitoring question is underrated. Most teams don't instrument internal tools well, so they don't notice degradation until someone complains. Even basic metrics like \"flagging rate over time\" catch model drift or logic bugs before they become incidents.\n\nThe honest pattern is that vibe-coded tools work fine for the 80% case but regulated environments are defined by the 20% edge cases that matter disproportionately.",
          "score": 2,
          "created_utc": "2026-02-19 18:32:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6h7s2m",
          "author": "Ok-Office-6564",
          "text": "Hey u/obchillkenobi , we are using this guy [https://github.com/LerianStudio/ring](https://github.com/LerianStudio/ring) to set all the guard rails we believe we need. ",
          "score": 1,
          "created_utc": "2026-02-20 19:35:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcu00m",
      "title": "Looking for payment startups expanding to Africa [Crypto or Fiat companies]",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1rcu00m/looking_for_payment_startups_expanding_to_africa/",
      "author": "Ok_Knowledge_7543",
      "created_utc": "2026-02-23 21:08:23",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I'm on the lookout for seed or just launched payment or fintech startups that are trying to make inroads into Africa. Wether it's for operations, Compliance related stuff or payment integrations, kindly respond to this thread.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1rcu00m/looking_for_payment_startups_expanding_to_africa/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": []
    }
  ]
}