{
  "metadata": {
    "last_updated": "2026-02-17 17:24:28",
    "time_filter": "week",
    "subreddit": "fintech",
    "total_items": 19,
    "total_comments": 83,
    "file_size_bytes": 111653
  },
  "items": [
    {
      "id": "1r2zrd4",
      "title": "Moved from seed stage to series B",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r2zrd4/moved_from_seed_stage_to_series_b/",
      "author": "Pale-Plant-3495",
      "created_utc": "2026-02-12 17:33:57",
      "score": 97,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "My new job at a series B is different(by a lot) from the seed stage companies I worked at before  \n  \nThere's 120 people here and everything has actual structure. My previous places had 40 people MAX and you'd just figure things out as you went  \n  \nOnboarding was 2 weeks with actual training instead of someone showing me where slack is and good luck. There's an org chart that makes sense and product roadmap instead of whatever the founders decided that week  \n  \nEngineering has processes now too. PR reviews aren't just whoever's around like there's sprint planning and we don't push to prod on Fridays(sounds basic but coming from seed stage chaos it feels almost corporate)  \n  \nHiring takes multiple rounds and forever compared to the week long process I'm used to but people fit their roles instead of everyone doing everything  \n  \nI didn't expect the jump to feel this big with way more meetings and process but things move faster because nobody's constantly figuring out what we're even doing  \nI am very happy with my current state here and I would love to hear if you guys who have transitioned similarly to me/from seed to series B feel the same  \nShare your experiences",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r2zrd4/moved_from_seed_stage_to_series_b/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o50me5q",
          "author": "subtle_violation",
          "text": "I feel the same way as u man I remember starting at a seed company and it was like here's your laptop figure it out. Series B actually had documentation and training sessions and people whose job was to help new hires get set up",
          "score": 3,
          "created_utc": "2026-02-12 17:43:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50vvck",
              "author": "Past_Cherry6520",
              "text": "It's not just onboarding either when I got into it finance had systems too instead of the usual chaos. Everyone has corporate cards with Ramp at my new place so you can just buy what you need without the whole personal card reimbursement shit I dealt with at seed companies",
              "score": 3,
              "created_utc": "2026-02-12 18:26:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54u32f",
                  "author": "KimchiCuresEbola",
                  "text": "Personal card reimbursement is a pro, not a con!\n\nRack up those hotel/airline miles when you can!",
                  "score": 1,
                  "created_utc": "2026-02-13 08:55:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o50lj15",
          "author": "Successful-Fan-2584",
          "text": "Went the opposite direction recently I left a series B for a seed company and I miss the structure way more than I thought I would",
          "score": 2,
          "created_utc": "2026-02-12 17:38:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50oiiz",
          "author": "TartSarcasm",
          "text": "Do you miss anything about the seed stage or is it all better at series B",
          "score": 2,
          "created_utc": "2026-02-12 17:52:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50w2xe",
              "author": "Pale-Plant-3495",
              "text": "The chaos 100%",
              "score": 1,
              "created_utc": "2026-02-12 18:27:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o50mt6i",
          "author": "Royal-Can9032",
          "text": "I made this jump last year and the hardest part was adjusting to how slow decisions feel even though they're probably better decisions. took me like 3 months to stop being frustrated by it",
          "score": 1,
          "created_utc": "2026-02-12 17:45:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53iva2",
          "author": "KimchiCuresEbola",
          "text": "It's good to see different types of companies and see how all of the run\n\nSeed has pros and cons. Series B has pros and cons. SMBs have pros and cons. Massive corporations have pros and cons.",
          "score": 1,
          "created_utc": "2026-02-13 02:47:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54owyl",
              "author": "Sorry_Still_8881",
              "text": "Yes, it's better to have such experience before he know which is good",
              "score": 1,
              "created_utc": "2026-02-13 08:07:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o53v9v5",
          "author": "JasonDai404",
          "text": "Large and small companies each have their own advantages and disadvantages. Learn from their strengths and improve yourself.",
          "score": 1,
          "created_utc": "2026-02-13 04:07:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54t07g",
          "author": "Ok-Introduction-2981",
          "text": "Difference between survival and scale, you now move slower to move faster.",
          "score": 1,
          "created_utc": "2026-02-13 08:45:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cd60p",
          "author": "RealNickanator",
          "text": "That matches what a lot of people experience, Series B is usually where startup chaos turns into real execution. You trade some speed and autonomy for clarity and leverage, but the net effect is often moving faster because fewer things break or get re-litigated every week.",
          "score": 1,
          "created_utc": "2026-02-14 14:23:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5c9ll",
      "title": "The high-risk merchant problem nobody in fintech wants to solve",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r5c9ll/the_highrisk_merchant_problem_nobody_in_fintech/",
      "author": "Much-Veterinarian399",
      "created_utc": "2026-02-15 11:21:47",
      "score": 22,
      "num_comments": 15,
      "upvote_ratio": 0.91,
      "text": "I work in payment processing for high-risk merchants - peptides, supplements, CBD, stuff that Stripe and PayPal ban on sight.\n\nNot the sexy side of fintech. No AI, no blockchain, no disruption narratives. Just businesses that cant accept payments normally and the mess that creates.\n\nWanted to share some perspective because this corner of fintech is basically invisible, but the money moving through it is not.\n\nThese are legitimate businesses selling legal products. But they cant get a normal merchant account. Stripe auto-rejects. PayPal bans them after a few weeks. The alternatives? Offshore processors with slow payouts, crypto-only checkouts that kill conversion, or sketchy setups that disappear overnight.\n\nMost merchants end up in a cycle: get approved somewhere, process for a few months, get shut down, lose $20-50k in held funds, start over with a new processor. Repeat until they give up or figure out how to make it work long term.\n\nThe gap is massive. Big processors dont want the compliance headache. Sketchy processors take advantage. Merchants are stuck with bad options.\n\nSome merchants figure out how to stay on mainstream rails long-term. Others cycle through processors forever. The difference usually isnt compliance - its infrastructure and how the accounts are structured.\n\nCurious if anyone else here works in or around this space. Theres almost no discussion about it despite the volume involved.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r5c9ll/the_highrisk_merchant_problem_nobody_in_fintech/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5i3ts1",
          "author": "madoff1503",
          "text": "I owned a peptide company and the amount of shady high risk merchant processing companies was insane. It's legitimate theft. They would charge $500-5000 for a \"set up\" fee and then would never deliver. \"That solution got shutdown but we have another one we're finalizing.\" One of them tried telling me they had a private solution yada yada thought it was weird they sent me credit card terminals and told me to do one transaction a month for compliance on it. Low and behold I got put on a matchlist as their underwriting team put me down as an online gardening tool ecom shop.",
          "score": 5,
          "created_utc": "2026-02-15 13:17:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5lhwpe",
              "author": "economickk",
              "text": "Yo that is actually insane. I imagine it’s because of the people who were actually doing shady shit. I wouldn’t call the cops and say “bro I tried importing steroids from China and this guy at moolahmovaz.com burned me $5k!”",
              "score": 1,
              "created_utc": "2026-02-15 23:54:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5louy5",
                  "author": "madoff1503",
                  "text": "Gray area quasi legal peptide sites last thing you want to do is bring any kind of legal attention to yourself. They know this and exploit it.",
                  "score": 1,
                  "created_utc": "2026-02-16 00:35:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5i05ss",
          "author": "Fibonatix",
          "text": "What you’re describing - repeated shutdowns, rolling reserves, held funds, and constant re-approval cycles - typically reflects a mismatch between business model structure and acquiring infrastructure.Risk is not only about compliance; it also includes transaction volume, subscription mechanics, geographic exposure, and how accounts are structured within the acquiring framework .\n\nHigh-risk payment processing requires:\n\n* Strong compliance alignment (PCI DSS, KYC, AML)\n* Advanced fraud prevention tools\n* Transparent customer communication to reduce disputes\n* Proper gateway integration and infrastructure planning\n\nWhen these elements are weak or misaligned, merchants can enter the cycle you described, approvals followed by shutdowns.\n\nManaging high-risk payment processing is not about eliminating risk, but structuring it correctly and working with experienced providers who understand the industry’s regulatory and operational nuances.",
          "score": 5,
          "created_utc": "2026-02-15 12:51:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5iv5t5",
          "author": "NPSALLEN",
          "text": "High risk is about compliance \nMost of merchants have no clue and just look for fast approvals\nAlso you have fda - Dea and ftc to deal with their rules \nWe have a compliance product that merchants can use - its helps them be compliant and stay that way",
          "score": 2,
          "created_utc": "2026-02-15 15:50:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5k15dp",
          "author": "quadrapay1",
          "text": "The core issue here is not that high-risk merchants are too risky. It's actually that most acquiring stacks were not architected for the volatility in dispute ratio, regulatory scrutiny, subscription continuity, or cross-border exposure. \n\nSo basically, they rely on blunt risk triggers instead of nuanced portfolio management. Sustainable setups in the space usually involve multi-mid redundancy, traffic segmentation by geographies and product line, controlled scaling of volume velocity, disciplined refund workflow to preempt chargeback, clean descriptor strategy, and underwriting alignment from day one, rather than post-approval patchwork.\n\nI would say that merchants who basically survive long term treat payments as an infrastructure engineering, not just a play and plug utility. And the gaps you are describing exist because very few providers are actually willing to invest in a level of structural risk design instead of just monetizing the churn cycle.\n\nThank you for highlighting this critical scenario here.",
          "score": 1,
          "created_utc": "2026-02-15 19:14:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s7xqw",
          "author": "No_Argument_1709",
          "text": "We provide our clients with multiple solutions for redundancy, both domestic and international, for debit and credit processing. Additionally, we offer them both an ACH solution and Google and Apple Pay, ensuring that if one system goes down, they can still process payments.",
          "score": 1,
          "created_utc": "2026-02-17 00:43:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hutph",
          "author": "FarAwaySailor",
          "text": "I work in that field. I built a stablecoin checkout with chargeback protection. The major difference for high-risk merchants is that (EVM)Blockchain has smart contracts, which means all the processing can be done without the processor taking custody of the funds, or taking on the chargeback risk. This means that the risk profile of the merchant is completely irrelevant to the processor,.so I can take on any merchant regardless of their business",
          "score": -1,
          "created_utc": "2026-02-15 12:08:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hvi7v",
              "author": "Much-Veterinarian399",
              "text": "Interesting approach. How does the chargeback protection work on your end like is it escrow-based or something else?\n\nMy concern with crypto/stablecoin checkout is always conversion. Most merchants I work with see 30-40% drop when they remove PayPal/card options. Customers trust what they know.\n\nDo you have data on how your checkout converts compared to traditional rails? Curious if the gap is closing or if its still a hard sell for merchants who want mainstream customers.",
              "score": 1,
              "created_utc": "2026-02-15 12:14:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5hxujy",
                  "author": "FarAwaySailor",
                  "text": "The chargeback is handled through escrow smart-contracts on the chain. The tech is good and the fraud protection is an order of magnitude better than current solutions. The processing is cheaper. I reckon there's a lot of friction for users in having to hold different coins to pay 'gas' (transaction fees), and also choosing the right network and wallet, so my checkout pays the gas fees for you and automatically selects the right target wallet on the right chain. The conversion gap will close once people get used to it. There are many many advantages to paying (and receiving) this way. There was a time when people didn't want to use credit cards because they were happy with cash and cheques. There was a time when people didn't want phones because they were happy with letters and telegrams.\n\nI should also say: you don't have to remove other checkouts (eg PayPal) to install mine, so you don't have to risk an immediate drop in conversions!",
                  "score": -3,
                  "created_utc": "2026-02-15 12:33:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5hwk0q",
          "author": "kubrador",
          "text": "the fintech equivalent of being a talented plumber who specializes in unclogging toilets at 3am. nobody wants to admit they need you until they're desperately googling your number.",
          "score": 0,
          "created_utc": "2026-02-15 12:23:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hwqbh",
              "author": "Much-Veterinarian399",
              "text": "hahahahhaha, you could not describe it better.. ",
              "score": 1,
              "created_utc": "2026-02-15 12:24:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ibnoc",
          "author": "Any-Inevitable-2724",
          "text": "Ugh, I know exactly what you mean, there are nights I'm so brain-dead that just popping one of those frozen orange chicken meals from Trader Joe's into the oven is the absolute peak of my culinary ambition, lol.",
          "score": 0,
          "created_utc": "2026-02-15 14:06:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r62ubv",
      "title": "stablecoins vs. banks... who wins the 2026 settlement war?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r62ubv/stablecoins_vs_banks_who_wins_the_2026_settlement/",
      "author": "RecordDue9421",
      "created_utc": "2026-02-16 07:06:21",
      "score": 16,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "just saw a report that stablecoins are starting to rival the actual interbank settlement layer for cross-border payments. its not just for buying 'dog coins' anymore lol.\n\nim trying to track which specific protocols are getting the most 'wholesale' adoption from traditional banks. i feel like the alpha isnt in the coins themselves, but in the infrastructure that connects them to the old-school banking world.\n\nr u guys looking at the settlement plays or still chasing 100x moonshots??",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r62ubv/stablecoins_vs_banks_who_wins_the_2026_settlement/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5n9swk",
          "author": "TrioDeveloper",
          "text": "Totally, the real action isn't in the coins themselves, it's in the plumbing that connects them to traditional banks. A lot of stablecoin talk is hype, but the banks quietly adopting the infrastructure are where the alpha is. Personally, I'm watching settlement plays more than chasing 100x moonshots. That's where the long-term wins are. Curious to hear what others think.",
          "score": 6,
          "created_utc": "2026-02-16 07:23:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nxnp3",
          "author": "Visa5e",
          "text": "Banks.\n\nBecause stablecoins only solve a small part of the overall picture, so the benefit to moving to them for settlement is marginal, yet involves a lot of work.\n\nIf it aint broke, why fix it?",
          "score": 2,
          "created_utc": "2026-02-16 11:07:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nk2mn",
          "author": "kayandrae",
          "text": "EVM still dominates this settlement layer from what I can see, as for who wins, I believe banks will rely more and more on stablecoins. \n\nI've also been seeing a lot more companies prop up to offer stablecoins issuance so that finorgs can use an open market to transfer funds between each other.. think JPMusd to CHASEusd on a Dex.\n\nI don't see how efficient this is vs say USDC/USDT, but I do believe we are in the exploration phases of what stablecoins settlements will look like going forward.",
          "score": 1,
          "created_utc": "2026-02-16 09:00:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ogi34",
          "author": "Commercial-Track-854",
          "text": "Banks will rely more and more on stablecoins for settlement.  \nStablecoins have everything you'd want a money to be: instant settlement, on-chain transparency for real-time tracking, low fees, no need for correspondant banking, programmability (for future Agents/MCP interactions).  \nEverything is booming in the sector. Stripe acquired Bridge for 1Bn, everyone wants a stablecoin settlement layer.  \nAlso, the stablecoin payment solution market is consolidating around heavy compliance since US (Genius act)/EU (MiCA) are setting up. Only a handful of players will likely remain and develop their offer. In Europe the leader in stablecoin payment solution is called Fipto, they have all the licenses to operate.",
          "score": 1,
          "created_utc": "2026-02-16 13:26:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ohalm",
          "author": "PassionImpossible326",
          "text": "Well the real battle isn’t stablecoins vs banks. It’s who owns the settlement layer with trust baked in.Stablecoins can move value faster and cheaper, but wholesale adoption won’t happen without deterministic counterparty verification and pre-transaction risk controls. Banks care less about speed and more about certainty.The alpha might not be in the coin — it’s in the identity + safety infrastructure that makes institutions comfortable using them.\nWatching that layer closely:)",
          "score": 1,
          "created_utc": "2026-02-16 13:31:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ti4wl",
          "author": "hhannis",
          "text": "For USA: trump coins, and crypto will be the solution for everything. For the rest of the world and smart people: Banks.",
          "score": 1,
          "created_utc": "2026-02-17 05:41:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5oh8wy",
          "author": "Pwog2",
          "text": "There are a few stablecoin infrastructures that seem to win the market for stablecoin settlement. Traditional payment companies and banks are certainly going to have to adapt. I've seen a comment about Fipto, I've also heard about Fipto as being the best all-round stablecoin payment infrastructure, pretty cool business model.",
          "score": 0,
          "created_utc": "2026-02-16 13:31:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r50w2u",
      "title": "KYC integration is taking 3 months and our mobile app gained 40MB. Is this normal?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r50w2u/kyc_integration_is_taking_3_months_and_our_mobile/",
      "author": "Only_Helicopter_8127",
      "created_utc": "2026-02-15 00:43:50",
      "score": 12,
      "num_comments": 15,
      "upvote_ratio": 1.0,
      "text": "We're a Series A fintech adding identity verification and it's been a nightmare. Three months in, still not live. The SDK added massive bloat to our mobile app, documentation is impossible to follow without enterprise dev experience, and every customization needs a support ticket.\n\nOur app load time tanked and we're seeing 18% user drop off during the verification flow. The verification itself works when people finish it, but getting there is brutal.\n\nIs this just how KYC works or did we mess up our vendor selection? Need something that's developer friendly without destroying our app performance.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r50w2u/kyc_integration_is_taking_3_months_and_our_mobile/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5fks5z",
          "author": "Logical-Professor35",
          "text": "40MB SDK and 3 month integration timeline? vendor selection was definitely the problem here not KYC in general.",
          "score": 9,
          "created_utc": "2026-02-15 00:49:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5fm846",
          "author": "Unique_Buy_3905",
          "text": "KYC integration shouldn't take three months or add 40MB unless something went sideways. \n\nTypical timeline is 2-4 weeks for mobile SDK with decent documentation. \n\nSounds like vendor either has bloated SDK or implementation hit complications neither side anticipated upfront.",
          "score": 5,
          "created_utc": "2026-02-15 00:58:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5fvwsj",
          "author": "JaseDoom",
          "text": "Definitely should not work like that. I am genuinely curious who your vendor is and what specifically you integrated and if it includes any step-up auth flows.",
          "score": 2,
          "created_utc": "2026-02-15 02:03:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5fokm4",
          "author": "ImpressiveProduce977",
          "text": "The combination of massive SDK, unclear docs, and long timeline points to vendor mismatch for startup environment. Enterprise-focused providers optimize for feature breadth over developer experience because their buyers are banks with large engineering teams. \n\nFintech startups need different tradeoffs lighter SDKs, clear documentation, responsive support, fast integration. 18% drop off during verification is recoverable but requires both technical optimization and UX improvements. \n\nBefore investing more time optimizing current vendor might be worth quick evaluation of alternatives to understand if switching saves time versus continuing to fight current implementation.",
          "score": 1,
          "created_utc": "2026-02-15 01:14:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5g8sbo",
          "author": "kubrador",
          "text": "you picked the wrong vendor. 40mb for identity verification is genuinely embarrassing and 3 months for integration should have triggered a pivot at month 1.\n\n\n\ngood news is most decent kyc providers (jumio, onfido, etc) integrate in 2-3 weeks and add maybe 5-10mb. your 18% dropoff is probably half bloat, half friction from wrestling their docs. look at anyone using web-based verification instead of an sdk monster and you'll see the difference immediately.",
          "score": 1,
          "created_utc": "2026-02-15 03:32:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5h1vek",
          "author": "Delicious-Letter-318",
          "text": "I helped a company at similar point as you guys, fintech, series B had to completely redo and improve identity verification as similar users tanking when it came to KYC and their experience sucked on mobile. After I finish with them they went on to exit at £41m.\n\nIt’s basically just forms on the experience so really shouldn’t be adding so much to the build, does your team have a design system in place.\n\nI think your 18% drop-off highlights it’s an experience problem. Forms sound easy but they can be easily over complicated and with KYC people need to know where they are, what they require before heading into the process, how far through they are and if they can return one entered.\n\nI also supported a major high street retail bank in the UK with this exact same process and once they shipped, we increased the mobile conversion for their onboarding by 156% in the first week.\n\nHappy to take a look and confirm if it’s an experience issue over the loading speed, just DM me and we can setup a call.",
          "score": 1,
          "created_utc": "2026-02-15 07:34:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5i5158",
          "author": "Cryptolooser777",
          "text": "\nDefinitely not normal. 3 months and 40MB for a KYC SDK is a red flag — sounds like one of the legacy enterprise vendors that bolt on features without caring about bundle size.\n\nFor consumer identity verification, a modern integration should take 2-4 weeks max. Look for vendors that offer a web-based flow you can embed via iframe or redirect link rather than a native SDK — eliminates the app bloat entirely and your mobile performance stays intact.\n\nA few things to evaluate when switching:\n\n• SDK size (should be <5MB or ideally zero with a web redirect approach)\n\n• Documentation quality — if you need a support ticket for basic customization, run\n\n• Drop-off analytics built into their dashboard\n\n• Sandbox environment that actually mirrors production\nI run a compliance tech company (Recomply.ai) and we deliberately went web-first for our B2B onboarding forms for exactly this reason — forcing a heavy SDK on clients is a non-starter. Different use case than yours but the principle is the same: the verification UX shouldn't be the bottleneck.",
          "score": 1,
          "created_utc": "2026-02-15 13:25:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5inzx6",
          "author": "DizzyGold6618",
          "text": "40MB SDK bloat and 3 months integration is not “normal” anymore. That is legacy compliance architecture leaking into product experience.\nMost KYC vendors optimize for regulatory completeness, not app performance or developer ergonomics.\nA few questions worth examining:\nIs the SDK fully embedded, or can parts be modular / server-side?\nAre you coupling identity verification too tightly with your core app bundle?\nIs the drop-off happening due to load time or verification friction?\nAre you measuring time-to-verification or just completion rate?\n18% drop-off in verification is not a small UX issue. That is revenue leakage.\nThe bigger structural issue is this:\nMost compliance layers are designed as external add-ons.\nThey are not designed to feel native inside the product journey.\nCurious, are you evaluating alternatives or trying to optimize within the current vendor stack?\nWould love to understand how others are handling KYC without destroying performance.",
          "score": 1,
          "created_utc": "2026-02-15 15:14:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mi4ev",
          "author": "arpand",
          "text": "You have not shared enough context. \n\n* If you are building a short-term loan application, the SDK is utilised. \n* Depending on the KYC type, different APIs & SDKs to be considered. \n* On average, KYC take less than a week. \n* Someone I knew used Prove SDK and spent more than 2 months. This was a different sort of use case.\n* On average, using OnFido, Persona, and SumSub has been much faster. \n\nThanks\n\n",
          "score": 1,
          "created_utc": "2026-02-16 03:44:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rzp52",
          "author": "Ok-Office-6564",
          "text": "3 months is not acceptable. You should use orchestrations workflow's solutions",
          "score": 1,
          "created_utc": "2026-02-16 23:55:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u14zs",
          "author": "ETP_Queen",
          "text": "Yeah this reads like an enterprise-first vendor shoved into a startup UX.\n\n40MB on mobile + 3 months usually means the SDK is doing way too much on-device (and the docs/support model assumes a bank-sized eng team). KYC is hard, but it shouldn’t feel like you’re shipping a second app.\n\nIf I were you I’d do two things in parallel: instrument the flow end-to-end to see exactly where the 18% drop happens, and run a quick “switch vs fix” comparison with a lighter hosted/webview or more modular provider. If the vendor can’t meet you halfway on footprint + DX, you’re basically paying in churn.",
          "score": 1,
          "created_utc": "2026-02-17 08:29:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gafwf",
          "author": "bamboofighter",
          "text": "Yeah your vendor is not doing you justice. Hire my team & we’ll get you done ✅ PM for details",
          "score": 0,
          "created_utc": "2026-02-15 03:44:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r35234",
      "title": "What part of KYC causes the most friction in real implementations?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r35234/what_part_of_kyc_causes_the_most_friction_in_real/",
      "author": "Apprehensive_Rip1466",
      "created_utc": "2026-02-12 20:50:34",
      "score": 10,
      "num_comments": 3,
      "upvote_ratio": 0.92,
      "text": "I’ve been looking more closely at KYC workflows lately and trying to understand where things actually get painful in production. On paper it feels straightforward collect documents, verify identity, complete compliance checks but I’m guessing the real friction shows up in the details.\n\nFor teams that have built or integrated KYC flows, what ended up being harder than expected? Was it user drop-off during onboarding, document quality issues, false positives, internal review cycles or something else entirely?\n\nI’m currently working on a small project in this space called KYC Easy and trying to better understand real-world bottlenecks beyond the obvious surface-level ones. Would really appreciate hearing lessons learned from people who’ve implemented this at scale.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r35234/what_part_of_kyc_causes_the_most_friction_in_real/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o51yucx",
          "author": "DizzyGold6618",
          "text": "On paper KYC looks simple because people only think about the happy path.\nIn production, the real friction is not document upload. It is everything that happens when something goes slightly wrong.\nMost teams underestimate three things:\nException handling\nThe flow works perfectly when inputs are clean. The moment a document is slightly blurry, name mismatch happens, or AML throws a soft match, the system starts exposing how rigid it actually is.\nTransparency gap\nFrom the user side it looks like “Processing…”\nFrom the internal side it is stuck in a manual review queue. That silence is where trust starts eroding.\nContext fragmentation\nUser starts onboarding in app. Gets blocked. Switches to email or call center. Has to explain everything again because backend systems are not stitched properly. That is not a KYC problem. That is an architecture problem.\nMost KYC implementations are optimized for compliance checklists, not for user resolution.\nAnd that is why drop off happens.\nThe friction is not in collecting documents.\nIt is in handling imperfection.\nIf your system cannot gracefully handle edge cases, you do not have a KYC flow. You have a demo flow.\nCurious how many teams here are actually measuring friction in exception scenarios versus just completion rates on the happy path.",
          "score": 3,
          "created_utc": "2026-02-12 21:31:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o555pdy",
          "author": "xaic",
          "text": "If I Had to Rank the Top Friction Points\nAt scale, the biggest pain tends to be:\n\nML accuracy vs fraud risk tuning\n\nManual review backlog from false positives\n\nVendor reliability and integration brittleness\n\nUX drop off from biometric friction\n\nRegulatory interpretation changing mid stream\n\nI could drill in more, but can't be bothered. If you're curious about something specific, ask.",
          "score": 2,
          "created_utc": "2026-02-13 10:45:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ebwyd",
          "author": "RealNickanator",
          "text": "In practice it’s usually the edge cases that hurt most, blurry documents, name mismatches, address quirks, and false positives that force manual review. Those slow everything down and create user frustration even when the core flow looks clean on paper.",
          "score": 1,
          "created_utc": "2026-02-14 20:29:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5scv1",
      "title": "Innovation",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r5scv1/innovation/",
      "author": "ResponseCheap2755",
      "created_utc": "2026-02-15 22:39:04",
      "score": 6,
      "num_comments": 19,
      "upvote_ratio": 0.88,
      "text": "Finance being the most boring area. \n\nSeems like all major players build on integrations only. Until established innovation seems impossible, take stripe for example.\n\nOther than blockchain, is there something that fintechs are looking at for innovation? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r5scv1/innovation/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5ldk3l",
          "author": "Nowhere-Man-Nc",
          "text": "There are still plenty of opportunities for innovation in fintech: from KYC and compliance automation to shifting from old-school technical trading toward more social and experience-driven models. But in practice, most visible experimentation today seems concentrated in crypto. The rest of fintech often behaves as if it is “good enough,” leaning toward conservative optimization rather than real innovation.\n\nMaybe that’s the result of increasing compliance pressure. Maybe it reflects broader uncertainty in the market. But after a few decades in this industry, my impression is that the drive for innovation is much lower than it was during the golden fintech decade of the early 2000s. That period felt like expansion. Today feels more like preservation.",
          "score": 3,
          "created_utc": "2026-02-15 23:28:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5na117",
              "author": "ResponseCheap2755",
              "text": "Agree !!\nAt least at surface level innovation seems to very slow. \n\nMaybe there is nothing for startups to enter but I wanted to understand from people who are at big companies. \n\nAre they looking at some innovation to solve problems in finance area as you said Risk and KYC/KYB with advent of AI and LLMs?",
              "score": 1,
              "created_utc": "2026-02-16 07:25:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5lr4hb",
          "author": "KimchiCuresEbola",
          "text": "Guess it depends on what your definititon of \"fintech \"is.\n\nWhat VCs call FinTech is limited in scope: payment processing, blockchain, etc.\n\nIf you're talking about tech in finance, some of the most cutting edge tech comes from finance.\n\nRentech started using AI in the 1990's, Pandas was created at AQR, XTX has more GPUs than most tech companies, Citadel has an army of FPGA engineers, prop desks/hedge funds work with petabytes worth of data, etc.",
          "score": 3,
          "created_utc": "2026-02-16 00:49:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5q9unk",
              "author": "ResponseCheap2755",
              "text": "Completely agree, the definition matters a lot, when i was writing the post i was focused on payments industry primarily but fintech is definitely much wider.\n\nAnd as I understand finance in general used to look for optimisation and heavy processing but do we still see any outrageous or disruptive outcomes from the same companies or institutions?",
              "score": 1,
              "created_utc": "2026-02-16 18:45:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5rbjxq",
                  "author": "KimchiCuresEbola",
                  "text": "I mean Alex Gerko at XTX has literally been UK's largest tax payer for several consecutive years from earnings.\n\nDepends on what you consider to be \"outrageous or disruptive outcomes\"?",
                  "score": 2,
                  "created_utc": "2026-02-16 21:47:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ly34f",
          "author": "JimmieLenz",
          "text": "You need to start investigating more, there is no area of innovation that even approaches finance. Time value of money, fractional banking, credit derivative swaps, other areas are constrained by physical properties (think Moore's Law) Finance is only constrained by what we can imagine. \n\nThere is no end to the innovation here, and don't be fooled by the technology aspect, this is only the means by which we implement ideas.",
          "score": 3,
          "created_utc": "2026-02-16 01:33:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qbvi4",
              "author": "ResponseCheap2755",
              "text": "This seems a bit abstract for simpletons like me, professor, but I definitely understand what you are pointing towards.\n\nDo you have any white papers to recommend to learn a bit more about the possibilities?\nNot just the mathematics but other aspects too, let’s say sociological. Until the financial solution works well with society the math alone won’t work.",
              "score": 1,
              "created_utc": "2026-02-16 18:54:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5mqdph",
          "author": "0xSmartMoney",
          "text": "you simply don’t need anything more… with the rise of Agents and smartcontracts the whole embedded finance stack can be streamlined now. Furthermore the assets can manage their own life cycles themselves = programmable embedded finance\n\nin simple terms embedded finance’s SHOPIFY moment is fast approaching. companies will tailor and offer financial services themselves…",
          "score": 2,
          "created_utc": "2026-02-16 04:42:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qcgit",
              "author": "ResponseCheap2755",
              "text": "Sounds fascinating!!\n\nCan you explain a bit more on this and explain the implications of this?\n\nWhere do you see this happening ?",
              "score": 2,
              "created_utc": "2026-02-16 18:57:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5tkqr3",
                  "author": "0xSmartMoney",
                  "text": "It is fascinating…\n\nImagine it’s 1994 and some random guy tells you that merchants will turn into global commerce companies, managing everything from listing products and setting prices dynamically to running sales campaigns, handling export/import logistics, warehousing, last-mile delivery, and returns, all orchestrated by software. It would have sounded fascinating, yet not very convincing, right? 🙂\n\nBut e-commerce is reality today. Merchants became digital brands with exclusive user networks, selling directly to those users. They operate with one ultimate North Star: maximize revenue per user.\n\nI’m telling you the same transformation is inevitable in finance. Merchants will take control of the remaining piece, financial services. Their North Star won’t change, and they won’t stop looking for ways to increase revenue per user. That’s why they’ve been embedding financial services into their stack, embedded finance (EF). Over the last decade, EF has increased revenues, but much of that upside has been captured by third parties. And merchants will always look for ways to remove those extra hands from the cookie jar.\n\nWith the rise of AI agents, this becomes far more doable. Our embedded BNPL stack is built AI-native. Very soon, we’ll be able to run Klarna’s playbook with 20 key employees and agents, not an army of 4,000. Our knowledge base is unified, not siloed like Revolut’s. We’ve streamlined the entire flow from origination to recovery. Our asset securitization infrastructure is digitally native, compliant smart contracts originating assets that are matched with instant on-chain liquidity, delivery vs. payment.\n\nAll that’s left is packaging this into SaaS: enabling merchants to list BNPL offers, set pricing, run campaigns, originate and securitize loans instantly; essentially tailor and offer BNPL directly to users.\n\nThat’s the Shopify moment for embedded finance <-fireworks emoji>\n\nThe implications mirror those of e-commerce. We’ll see massive consolidation in traditional finance; most banks won’t catch up. Many will become forward-flow providers underwriting merchant-originated loans. Trillion-dollar on-chain marketplaces will emerge around this activity. Smart merchants will obtain banking licenses to further maximize revenue per user. We may even see Amazon competing with JPMorgan Chase over auctioned receivables.\n\nEven smarter merchants will turn their exclusive user networks into closed-loop financial ecosystems, where users invest in the brands they love via tokenized bonds financing inventory and growth. Savings accounts become brand-native, “save $50 with Cleveland Clinic and get your teeth fixed anytime.” A new layer of utility apps will emerge, robo-advisors bidding at receivable auctions, leverage looping apps, and more.\n\nAt the bottom line, trillions in capital will shift from bank balance sheets to merchant balance sheets. The startups leading this shift will become the new Amazons, the new Shopifys.\n\nI’m proud that we’re not just following this path with the right recipe; we’re bold enough to choose the vertical with the strongest PMF and carve out a niche to make it ours. Just like Amazon started with books, transforming an ancient trillion-dollar model requires finding the path of least resistance 😉",
                  "score": 1,
                  "created_utc": "2026-02-17 06:02:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5nj7ck",
          "author": "xaic",
          "text": "Asking if there’s innovation in fintech is like asking if there’s innovation in plumbing because the pipes are already installed.\n\nFintech *is* continuous innovation. Blockchain is just one loud corner of it.\n\nEverything from embedded finance, real time payments, AI driven fraud detection, smarter KYC, alternative underwriting, open banking, programmable money, better onboarding UX, retention mechanics, vertical SaaS + payments stacks… that is all innovation.\n\nStripe building on integrations is not a lack of innovation. It is platform strategy. The boring part is the rails. The value is what you build on top.\n\nIf anything, fintech is one of the few industries where shaving 20 seconds off onboarding can be worth millions. If that is boring, then so is oxygen.",
          "score": 2,
          "created_utc": "2026-02-16 08:52:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qd984",
              "author": "ResponseCheap2755",
              "text": "Yes, oxygen is boring despite being a necessity, I understand components are improving but that can be considered incremental not disruptive.\n\nFinance had many such disruptive moments historically, last one close to this was the blockchain idea which was a paradigm shift.\n\nI don’t read about anything which has similar impact. \nEven if we consider adoption of blockchains a failure or slower than expected",
              "score": 1,
              "created_utc": "2026-02-16 19:00:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5rgpxm",
                  "author": "xaic",
                  "text": "You don’t need headlines for something to be transformative. \n\nA lot of fintech evolution happens in 5–20 second improvements in onboarding, better ML driven KYC, lower fraud false positives, smarter underwriting, smoother end to end flows. At scale, those “boring” gains are huge.\n\nYes, there are paradigm shifts. Card networks were one. Blockchain was one. Crypto is just one application built on top of that architectural shift.\n\nBut most real impact comes from infrastructure quietly getting better. Disruption is not only new rails. It is also making existing rails radically more efficient.",
                  "score": 1,
                  "created_utc": "2026-02-16 22:13:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5mm6mo",
          "author": "tornavec",
          "text": "AI-agents",
          "score": 1,
          "created_utc": "2026-02-16 04:12:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qc657",
              "author": "ResponseCheap2755",
              "text": "I hear a lot about agentic commerce but that is a level up of APIs with LLMs, that can be considered orchestration at best not innovation.\nThe innovation happened in the LLM level agents are just users of that.",
              "score": 2,
              "created_utc": "2026-02-16 18:55:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5uban1",
          "author": "PassionImpossible326",
          "text": "Tons of innovation is happening in fintech space. Fintech is not just Rails , payment,access etc , it is a ecosystem,  a vastly segregated ecosystem. \nThere are lot of things which needs improvement in Identity and safety paradigm in fintech space.",
          "score": 1,
          "created_utc": "2026-02-17 10:06:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6y0g3",
      "title": "Wise blocked both of personal account and business account without a prior notice. Don't trust them.",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r6y0g3/wise_blocked_both_of_personal_account_and/",
      "author": "pooquipu",
      "created_utc": "2026-02-17 05:55:08",
      "score": 6,
      "num_comments": 7,
      "upvote_ratio": 0.8,
      "text": "Today wise blocked both of my personal and business accounts. The business account was unused for several years, because my business is closed, but the wise business account was never closed.\n\nThey blocked the business account for this reason. This is fair and expected.\n\nWhat I didn't see coming, however, is a few days later they've blocked my regular account where l store a lot of money. Reason: they had to close all accounts associated with the business account.\n\nI'm abroad and wise is my main payment method, I have only a small backup but won't last for more than a few days. I'll get around it and get my money refunded, but they basically screwed me without a notice, despite I have been using their services for nearly a decade now and was trusting them.\n\nI think lately wise customer service has greatly degraded, and this is the ultimate proof that something is wrong with their services.\n\nIt's time to move away to a better alternative.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r6y0g3/wise_blocked_both_of_personal_account_and/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5to46a",
          "author": "FieldNoticing",
          "text": "So I’m understanding you properly, Wise found out your business was closed on their own, so they closed all your accounts? How long was your business closed for? And was your business account opened before the personal account? I have both as well and I’m wondering if this is something I need to be proactive about now.",
          "score": 1,
          "created_utc": "2026-02-17 06:30:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tpvfc",
              "author": "pooquipu",
              "text": "My business was closed for 2\\~3 years. They closed the wise business account first and a few days later the personal wise account living on the same global account, that was effectively my daily account, I use with the wise card everyday.\n\nThe personal account existed for much longer than that business account.\n\nI recommend using wise only for transfers and moving the money immediately to a safe account. If you need to use your card, just transfer the money from your safe account as you need it. They proved to be unreliable.",
              "score": 1,
              "created_utc": "2026-02-17 06:45:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5u5leu",
          "author": "TrioDeveloper",
          "text": "Thanks for sharing this really helpful heads-up. I've been using Wise too, so it's good to know about situations like this before it becomes a problem.",
          "score": 1,
          "created_utc": "2026-02-17 09:12:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5udl07",
              "author": "pooquipu",
              "text": "yes, I eventually got my personal account unlocked after providing various documents. Going forward I'll use wise only as a transfer pipe and only keep small amount of money in it, and always have a reliable backup payment method with me.",
              "score": 1,
              "created_utc": "2026-02-17 10:27:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5u7xyk",
          "author": "ItinerantFella",
          "text": "I've heard similar stories about customers of major banks, PayPal, Stripe, Wise, Revolut, Airwallex, etc. \n\n\nWhich bank/transfer service guarantees they won't do it?",
          "score": 1,
          "created_utc": "2026-02-17 09:35:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5udy0b",
              "author": "pooquipu",
              "text": "None, other than the good old national banks that come with national guarantees and a banker who make sure you feel loved as a customer. Main reason I use wise is because the national banks are not good for international transfers, but after this experience I started to value even more my reliable banker.",
              "score": 1,
              "created_utc": "2026-02-17 10:30:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5w15cz",
          "author": "0rbus",
          "text": "Wise banned me completely from using their platform as they tried holding onto 5 figures in my business account and only let it go when I threatened legal action against them. I can't even send a personal transaction as they've completely banned me from their systems. Seriously shady company they are.",
          "score": 1,
          "created_utc": "2026-02-17 16:30:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2ry8a",
      "title": "Wallet to Wallet Payments Are Challenging Card Networks",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r2ry8a/wallet_to_wallet_payments_are_challenging_card/",
      "author": "Mother_Network9453",
      "created_utc": "2026-02-12 12:19:27",
      "score": 5,
      "num_comments": 10,
      "upvote_ratio": 0.78,
      "text": "\n\nFor decades, card networks defined how money moves. Swipe. Authorize. Settle. Repeat.  \nIt worked well but it was built for a world of banks, borders, and intermediaries.\n\nWallet to wallet payments are quietly changing that model.\n\nWhen two wallets transact, there is no acquirer, no card network, no interchange stack in the middle. Value moves directly from one user to another, often in seconds, sometimes in real time. No chargebacks. No weekend delays. No hidden routing logic.\n\nWhat makes this shift important is not crypto speculation. It is usability.\n\nPeople are already using wallets to pay freelancers, settle global invoices, send family money across borders, and move stablecoins like digital cash. For them, it feels closer to sending a message than making a payment.\n\nCard networks still dominate retail, but they were not designed for programmable money, micro payments, or always on global settlement. Wallets are.\n\nThis does not mean cards disappear. It means the monopoly on payments is ending.\n\nThe future of payments is not plastic.  \nIt is software.\n\nAnd increasingly, it lives inside wallets.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r2ry8a/wallet_to_wallet_payments_are_challenging_card/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o4zp6ha",
          "author": "monkey6",
          "text": "What percentage of overall payments is p2p? I’d imagine… tiny",
          "score": 3,
          "created_utc": "2026-02-12 15:06:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54c7vu",
              "author": "Mother_Network9453",
              "text": "Fair question. If you look at total global retail payments today, wallet to wallet is still a small percentage. Cards dominate volume and acceptance.\n\nWhat’s interesting to me isn’t share *today*, it’s where new payment behavior is forming. Cross border P2P, freelancer payouts, creator economies, stablecoin transfers, and B2B settlements are growing fast and many of those flows never touch card rails at all.\n\nHistorically, card networks didn’t start big either. They scaled once the use case fit. Wallets are doing the same, just in different categories first.\n\nSo yes, tiny in aggregate. But not tiny where payment infrastructure is actually changing.",
              "score": -1,
              "created_utc": "2026-02-13 06:14:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4zk0i6",
          "author": "FieldNoticing",
          "text": "True. There’s less friction and lower hanging fruit for introduction to digital economy.",
          "score": 2,
          "created_utc": "2026-02-12 14:39:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54cad9",
              "author": "Mother_Network9453",
              "text": "Here’s a clean, thoughtful reply that **builds on their point** and subtly advances your thesis:\n\n>",
              "score": 1,
              "created_utc": "2026-02-13 06:15:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5004z4",
          "author": "jm22381",
          "text": "That's right. Bizum Pay for NFC-enabled account-to-account payments with merchants will launch in the summer of 2026. By 2027, all European \"Bizum\" systems will be able to make these types of payments. User-to-user transfers via NFC will make the lack of Apple Cash in Europe irrelevant.",
          "score": 2,
          "created_utc": "2026-02-12 15:58:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54ccp7",
              "author": "Mother_Network9453",
              "text": "That’s a great example. Bizum shows how account to account and wallet based rails are moving from P2P into everyday merchant payments.\n\nWhat’s interesting is that once NFC is just an interface and not a card requirement, the underlying rail matters more than the form factor. From a user perspective it still feels like tap to pay, but the economics and settlement model are completely different.\n\nApple Cash being irrelevant in that context is telling. It’s less about the brand and more about who owns the payment rail underneath.",
              "score": 1,
              "created_utc": "2026-02-13 06:15:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o54bau9",
          "author": "TrioDeveloper",
          "text": "Agree, wallet-to-wallet payments are a game-changer, instant, direct, frictionless; they make moving money feel as easy as sending a message.",
          "score": 1,
          "created_utc": "2026-02-13 06:07:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n1d24",
              "author": "Mother_Network9453",
              "text": "Exactly. And what’s interesting is that once money feels like a message, expectations change permanently. People stop tolerating delays, reversals, and hidden layers. Even if cards remain, the benchmark for speed and simplicity is now set by wallets, not networks.",
              "score": 1,
              "created_utc": "2026-02-16 06:09:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ene03",
          "author": "Affectionate_Boss657",
          "text": "yea wallet-to-wallet is the move for direct value transfer... i use alicebob wallet for that, holds my diverse assets and lets me swap or send easily without the old card network delays.",
          "score": 1,
          "created_utc": "2026-02-14 21:32:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n1fzm",
              "author": "Mother_Network9453",
              "text": "That’s a good example of why wallets are gaining traction. Once users can hold, move, and swap value in one place without waiting on card rails, the old delays start to feel unnecessary rather than normal.",
              "score": 1,
              "created_utc": "2026-02-16 06:09:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r2pq0j",
      "title": "6 Months Work Experience with Fiserv",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r2pq0j/6_months_work_experience_with_fiserv/",
      "author": "Legal-Armadillo3299",
      "created_utc": "2026-02-12 10:12:54",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 0.86,
      "text": "Today I want to share about my working experience with Fiserv.\n\nI worked with a giant Fintech company for 5 years. I left that company and joined Fiserv and that was one of the worst decision of my life. Before joining itself the Manager stated reaching out to me on whatsapp and one day he shouted at me just 2 days before my joining and it was because I asked so many questions about the health insurance and pension plan. The manager called me and blasted that who gets pension and health insurance from the first day. It was so rude. It gave me a feeling that I have taken a wrong step already. Later he apologised and convinced me to join the company.\n\nThey all work from Nenagh and they all are like doing micro management. They started monitoring in/out timings and attendance. They made it mandatory to be in the office campus for atleast 8.5 hrs every day and if they find it lesser they will set up a meeting and ask for the reason in the email. I have seen the tensed faces in Fiserv where people are really stressed to go out even in the lunch time.\n\nhttps://preview.redd.it/be7zjrfcg1jg1.jpg?width=900&format=pjpg&auto=webp&s=3872b75c1e563e39c9de9c9b4dc836a6dccae085\n\nhttps://preview.redd.it/hv0g9yhcg1jg1.jpg?width=1600&format=pjpg&auto=webp&s=734bdac65986db8e62e21df070cd7113f081b1a5\n\nThey ask everyone to come to office but they dont have proper canteen even and whatever they have is just for the cakes and pastries and that too very expensive.\n\nMy life was made hell by my manager. He comes from the same place where I am from but instead of supporting me he started torturing me. He wanted me to be sacred, frightened, tensed but I was not that kind of person and he didn’t like this. He used to blast at me for every small thing. For any ask like wfh or leaves he used to behave as I have something very big from him and he is doing a big favour by approving my leaves or wfh.\n\nI had my citizenship ceremony in Killarney around 5pm in the evening for which I had to travel from Dublin. When I reached out to him for the leave he became so angry. He wanted me to return the same day from Killarney and come to office the next day which was nearly impossible as I had to travel with my 3 years old kid. But he wasn’t ready to hear anything. He even advised me to miss the citizenship ceremony and attend some other time. My manager himself took half a day leave for his citizenship ceremony but in my case he wanted me to return the same day from Killarney. He first threatened me about bad rating if I take leave. When I wasn’t scared then he threatened me about losing of my job even. I joined on 1st Oct and 15dec he gave me a bad rating and I was on PIP.\n\nAnd finally 1 week before my probation complete date I was called and fired. That day also the manager shouted at me. He told me that because of me the company is in loss. I told him Cmon I am a family man and I have my own responsibilities and I left my previous giant Fintech company for Fiserv and this is I have to see today. My father is a cancer patient and because of my manager’s ego and immaturity I had to suffer and it was a very stressful condition for me.\n\nFiserv is the worst company I have ever worked. They fire every year and they have hire and fire policies and the management is completely non-supportive. I have seen them torturing the people to travel to Nenagh.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r2pq0j/6_months_work_experience_with_fiserv/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o53h17i",
          "author": "markvii_dev",
          "text": "Terrible company",
          "score": 2,
          "created_utc": "2026-02-13 02:35:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50z3dh",
          "author": "rahulrambo3",
          "text": "No work life balance. Wfh and leaves are big things. Bonus is a scam",
          "score": 1,
          "created_utc": "2026-02-12 18:41:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5g8ja",
      "title": "Wise permanently offboarded me after phone theft and unauthorized transactions – is this proportionate under EU risk policy?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r5g8ja/wise_permanently_offboarded_me_after_phone_theft/",
      "author": "Icy_Smile6481",
      "created_utc": "2026-02-15 14:40:31",
      "score": 5,
      "num_comments": 16,
      "upvote_ratio": 0.86,
      "text": "In October 2025, I was assaulted while travelling and my phone was stolen. Shortly after, unauthorized transactions occurred on my EU-based Wise business account (approximately €1,400).\n\nI reported the incident immediately and filed a police report. Wise investigated and declined reimbursement, stating that the transactions were properly authenticated under strong customer authentication (SCA).\n\nFollowing this, Wise permanently closed all my accounts (both personal and business). I went through their internal complaints process and submitted an appeal, which was rejected.\n\nFrom a fintech risk and compliance perspective, I’m trying to better understand:\n\n• In cases where a customer is a documented fraud victim of a single theft incident, is permanent offboarding considered proportionate?\n\n• How do EU fintech institutions balance PSD2 protection principles with risk-based account termination?\n\n• Is this becoming a standard risk management approach across EU-regulated institutions?\n\nI’m genuinely interested in how this is viewed from an industry and regulatory standpoint.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r5g8ja/wise_permanently_offboarded_me_after_phone_theft/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5kk6sg",
          "author": "monkey6",
          "text": "How’d they get into your phone?",
          "score": 1,
          "created_utc": "2026-02-15 20:52:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n4njx",
              "author": "Icy_Smile6481",
              "text": "The phone was stolen while unlocked during the assault.\n\nShortly after, unauthorized access occurred. I immediately reported it and filed a police report.",
              "score": 1,
              "created_utc": "2026-02-16 06:37:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ovxur",
                  "author": "monkey6",
                  "text": "Sorry to hear that. Does the Wise app need to look at your face or have a password entered to open it/sign in?",
                  "score": 1,
                  "created_utc": "2026-02-16 14:50:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5kypis",
          "author": "rubenknol",
          "text": "It doesn’t matter if it’s proportionate or not - they can choose freely who they do business with",
          "score": 1,
          "created_utc": "2026-02-15 22:06:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n5539",
              "author": "Icy_Smile6481",
              "text": "Sure, they can choose their clients.\n\nBut when someone is the victim of a documented theft, loses funds, and reports it immediately, permanently terminating all accounts raises a legitimate question about proportionality for a regulated EU institution.\n\nEspecially when alternative risk measures — such as temporary restrictions or enhanced monitoring — could also have been considered.",
              "score": 1,
              "created_utc": "2026-02-16 06:41:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5njyxo",
                  "author": "rubenknol",
                  "text": "can you recite me the exact part of the regulation under the belgian (where wise has their EU banking license) banking laws where you think this is in breach of? ",
                  "score": 1,
                  "created_utc": "2026-02-16 08:59:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5pzil3",
          "author": "RevolutionaryRush717",
          "text": "Tell you what. By installing the app of your phone, you accepted the risk of not being able to protect your account and your phone sufficiently.\n\nAnyway, that's the pitch Wise will make: *you* bore the risk, not them.\n\nYou disagreeing is enough for them to terminate your contract.\n\nPeople, let this be a reminder of the downsides of banking apps and 2FA on the same device.\n\nIt's like the thieves taking cash from your wallet.\n\nCash is gone, and so is the transaction.",
          "score": 1,
          "created_utc": "2026-02-16 17:57:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tvpmm",
              "author": "Icy_Smile6481",
              "text": "I understand the point about user responsibility.\n\nBut this isn’t comparable to physical cash. Wise operates under EU financial regulation and supervision. Electronic payment institutions are subject to specific consumer protection and risk-management standards.\n\nIn this situation, the customer is already the victim of a documented assault and financial loss. When reimbursement is refused and all accounts are permanently terminated, it effectively compounds the impact of the fraud.\n\nThe question is whether that combined outcome aligns with the spirit of EU consumer protection and proportionality principles.",
              "score": 1,
              "created_utc": "2026-02-17 07:38:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5tkx0a",
          "author": "pooquipu",
          "text": "I experience a slightly different problem with similar outcome, they closed my account without delay. I used it as my main and business account so there is quite a bit of money on it. I had to ask relatives to send money to my revolut account.\n\nI think it's time to move away from them.\n\nTheir customer services became terrible lately. Few times I had to deal with them in the last two years, they were totally garbage.\n\n  \nFact is now my money is fully blocked, and they can do that without a notice, in under a second. That's sketchy, isn't it?",
          "score": 1,
          "created_utc": "2026-02-17 06:03:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tw5ea",
              "author": "Icy_Smile6481",
              "text": "It’s concerning to see similar experiences. When sudden account closures or fund restrictions affect customers who rely on these accounts for personal and professional use, the impact can be severe.\n\nWhen a company like Wise operates under EU financial supervision, customers reasonably expect more predictability and safeguards than what feels like an instant shutdown.",
              "score": 2,
              "created_utc": "2026-02-17 07:42:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5txs16",
                  "author": "pooquipu",
                  "text": "Right. This experience takes me back to reality.\n\nI’ve started looking for alternatives and I’m currently comparing them. I’ll continue using these neobank services, but only with a small buffer of money. I’m shifting my trust back to long-established traditional banks.\n\nOn a personal note, I really enjoyed these fully online, lower-cost companies. But now, I realize how much of a game changer it is to have a real human who genuinely cares about you as a customer, even if you have to pay a more. I'll never underestimate this again.",
                  "score": 1,
                  "created_utc": "2026-02-17 07:57:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5iouu0",
          "author": "Individual-Artist223",
          "text": "Wise don't care about their customers!\n\nReading Reddit, lots of customers are being kicked off.\n\nI'm wondering whether the company is now on a death spiral.\n\nThey IPO, people made money and left, Wise broke.\n\nThoughts?",
          "score": 0,
          "created_utc": "2026-02-15 15:19:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ivmae",
              "author": "Icy_Smile6481",
              "text": "I’ve seen similar reports too.\n\nIn my case, it was a documented theft, police report filed, one fraud event — then permanent closure of all accounts.\n\nI’m trying to understand whether that kind of response is considered proportionate under EU risk management and PSD2 principles, especially when the customer is the victim of a single incident.\n\nI’d genuinely appreciate input from people familiar with fintech risk or EU regulatory practice.",
              "score": 0,
              "created_utc": "2026-02-15 15:53:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r626r3",
      "title": "Card as a Service and BIN Sponsorship Are Quietly Taking Over Fintech",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r626r3/card_as_a_service_and_bin_sponsorship_are_quietly/",
      "author": "Mother_Network9453",
      "created_utc": "2026-02-16 06:29:30",
      "score": 4,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "\n\nMost people still associate fintech with consumer apps and flashy wallets. But behind the scenes, the real momentum is shifting toward infrastructure, especially Card as a Service and BIN sponsorship.\n\nInstead of building a bank from scratch or waiting years for licenses, startups and enterprises are launching card programs through CaaS platforms. These providers handle issuing, processing, compliance, and network connectivity, while the business focuses on distribution and use cases.\n\nWhat’s driving the trend is scale and speed.\n\nCaaS platforms now support  \n• Startup and enterprise grade card issuing  \n• Multi region BIN sponsorship for cross border programs  \n• Built in KYC AML and transaction monitoring\n\nThis means companies can launch prepaid, debit, or virtual cards across multiple geographies without becoming a regulated bank.\n\nWhy this matters is simple. Time to market used to be measured in years. Now it’s months or even weeks. Compliance is embedded into the infrastructure instead of being an afterthought. And fintech teams can iterate on products without constantly renegotiating with banks.\n\nConsumer fintech might get the headlines, but infrastructure is where the long term value is being built.\n\nCurious to hear thoughts from people working on issuing, payments, or embedded finance.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r626r3/card_as_a_service_and_bin_sponsorship_are_quietly/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5n7k49",
          "author": "TrioDeveloper",
          "text": "Really interesting breakdown, totally agree the real value shift is happening behind the scenes. CaaS and BIN sponsorship let companies scale fast without banking headaches. Consumer apps get the headlines, but the real advantage is in the infrastructure.",
          "score": 1,
          "created_utc": "2026-02-16 07:03:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nhugb",
              "author": "Mother_Network9453",
              "text": "Appreciate that. The “without banking headaches” part is exactly it, though I think it also creates a new set of challenges. Teams move faster, but now they’re dependent on issuer banks, processors, and scheme rules they don’t fully control. The winners long term will be the ones who treat CaaS as leverage, not a black box.",
              "score": 1,
              "created_utc": "2026-02-16 08:39:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r1pxbo",
      "title": "Non-technical path into fintech, what helped you most?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r1pxbo/nontechnical_path_into_fintech_what_helped_you/",
      "author": "TraditionalTowel4217",
      "created_utc": "2026-02-11 06:29:40",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Hi! I’m a first year business student planning to concentrate in finance and MIS, and I’ve recently gotten interested in fintech. I’ve started trying to learn code on my own (definitely harder than I expected lol) just to understand the space better. \n\nFor those working on the business side of fintech, what did you do to prepare yourself for your role? Any skills, internships, or experiences you’d recommend focusing on early on? Thanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r1pxbo/nontechnical_path_into_fintech_what_helped_you/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o4rlidt",
          "author": "Slight_Warthog8706",
          "text": "Network network network! Try to find events around you where you can talk to people working at places/roles you're aiming for.\n\nLinkedIn can be a great prospecting tool to find people who you can reach out to via email or LinkedIn. Leverage Apollo (free sign up) to find their email.",
          "score": 1,
          "created_utc": "2026-02-11 08:20:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n3ka8",
              "author": "TrioDeveloper",
              "text": "100% agree networking and hitting events make a huge difference. A few good conversations can open way more doors than a dozen cold applications.",
              "score": 1,
              "created_utc": "2026-02-16 06:28:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5nb4an",
          "author": "KarinaOpelan",
          "text": "Networking absolutely helps, but do it with intent. Go to events and reach out on LinkedIn with specific questions about their role, metrics, and what skills they actually use, not just “how do I get in?” Follow up thoughtfully, and focus on people a few years ahead of you since they’re often more responsive and relatable. Strong, informed networking beats random cold outreach every time.",
          "score": 1,
          "created_utc": "2026-02-16 07:36:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3xxkf",
      "title": "PhD in finance+senior consultant in fintech, applied for 100+ jobs but haven't landed any second interview so far",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r3xxkf/phd_in_financesenior_consultant_in_fintech/",
      "author": "Independent_One9236",
      "created_utc": "2026-02-13 19:03:10",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I applied for over 100 jobs but haven't landed any second interview so far. Would appreciate any advice on possible directions, salary expectations, etc.!\nBackground: PhD in finance, 7 years of research + 2 years of industry experience as a senior consultant in a Chinese fintech company. I'm familiar with fintech, data analytics and digital transformation. I also worked in projects valued at 2M+. I'm really confused about what's happening",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r3xxkf/phd_in_financesenior_consultant_in_fintech/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o57xpgu",
          "author": "meninblck9",
          "text": "It’s a bad job market. Keep at it. Write a blog. Make some interesting posts on LinkedIn. Network. Network.",
          "score": 3,
          "created_utc": "2026-02-13 19:49:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bipg3",
          "author": "KimchiCuresEbola",
          "text": "Fintech is very broad as is the roles within specific niches. What specifically did you do?",
          "score": 1,
          "created_utc": "2026-02-14 10:28:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1sf5n",
      "title": "How can financial firms improve advisor productivity through technology?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r1sf5n/how_can_financial_firms_improve_advisor/",
      "author": "Specialist-Pie1714",
      "created_utc": "2026-02-11 09:00:59",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "By utilizing automated systems as well as centralized customer relationship management (CRM) systems and cloud computing technologies, financial institutions can utilize advanced technology to help their financial advisors become more productive through decreased amounts of time spent completing manual processes and improved workflow for everyday tasks. Newer technology solutions can automate several of the routine aspects of financial advisor operations, including but not limited to client onboarding, document processing, reporting, and compliance checks, allowing for advisors to dedicate more of their time to value-added work including but not limited to client engagement, overall planning, and portfolio strategy.\n\nUsing a centralized CRM and cloud-based system will provide advisors with a single (and live) view of all client-related data, eliminating the need for the advisor to switch from one source of data to another and reducing time to validate and reconcile information. Additionally, using an artificial intelligence (AI)-enabled analytical tool will further improve the efficiency of financial advisor functionality by rapidly surfacing insights, alerts, and recommendations to allow advisors to make quicker, more informed decisions.\n\nFinancial services firms that embrace purpose-built WealthTech solutions will frequently experience dramatic increases in operational efficiency. The technology ecosystem of these WealthTech solutions will allow for firms systems to be unified, workflows to be automated, and scalable operations to be established to allow financial advisors to work more efficiently, service more clients effectively, and create a better overall experience for their client base.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r1sf5n/how_can_financial_firms_improve_advisor/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o54kdc6",
          "author": "KarinaOpelan",
          "text": "Firms boost advisor productivity when they redesign the workflow first and layer tech on top of that. One clean data backbone, automated onboarding and servicing flows, and compliance that runs in the background free up real advisor time. AI can enhance insights and communication, but only once the core systems talk to each other. In many cases the breakthrough comes from integration work and workflow engineering, sometimes delivered with fintech development partners like Cleveroad, rather than from adding another standalone tool.",
          "score": 1,
          "created_utc": "2026-02-13 07:25:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3int2",
      "title": "Whats the best payment processor for high risk merchants",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r3int2/whats_the_best_payment_processor_for_high_risk/",
      "author": "InternationalSun4095",
      "created_utc": "2026-02-13 07:14:39",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 0.72,
      "text": "Im in a high risk insdustry (peptides) and have just been banned from stripe. What high risk payment processor can i use in Australia? Looking for options ASAP",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r3int2/whats_the_best_payment_processor_for_high_risk/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o55rjiq",
          "author": "dangercoder",
          "text": "Hey, maybe [https://paymentproviders.io/](https://paymentproviders.io/) could be useful - you can filter on: Browse all providers - high risk. The website currently covers 1k+ provides. \n\nI'd recommend a provider such as https://paymentproviders.io/providers/coinremitter if you just want to accept crypto (fast path).\n\nGetting accepted by a provider that accepts high risk merchants requires legal work and can take time and a bunch of back and forth with their compliance department.",
          "score": 1,
          "created_utc": "2026-02-13 13:23:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5kthx9",
          "author": "quadrapay1",
          "text": "Peptide is a problem. In Australia its a bigger problem. I suggest you explore alternative options.",
          "score": 1,
          "created_utc": "2026-02-15 21:39:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o559nc3",
          "author": "crystalblogger",
          "text": "I would recommend Ivno.io as it supports your geo and works with multiple high risk businesses without issues. The approval and onboarding is also instant. You may want to have a look at https://ivno.io",
          "score": 0,
          "created_utc": "2026-02-13 11:19:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6xurl",
      "title": "What are the biggest technology trends in financial services today?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r6xurl/what_are_the_biggest_technology_trends_in/",
      "author": "Specialist-Pie1714",
      "created_utc": "2026-02-17 05:46:27",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 0.81,
      "text": "The biggest technology trends in **financial services** today are **cloud computing**, artificial intelligence (AI)/machine learning, automation/robotic process automation (RPA), and open banking/API ecosystem. These technologies enable financial institutions to increase efficiency, reduce operational costs, and provide more personalization in their offerings.\n\nAnother significant technology trend in **financial services** today is advanced data analytics, which allows for better risk management and customer understanding. Another significant technology trend in the **financial services** industry today is the adoption of robust cybersecurity and compliance technology. Financial institutions today are collaborating with technology companies that offer integrated solutions, bringing together various technology trends in a single offering. For example, **Arcus Partners** provides cloud computing and AI/ML solutions.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r6xurl/what_are_the_biggest_technology_trends_in/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5uen9y",
          "author": "goodkarma789",
          "text": "Agreed. Still waiting for a trend of traditional finance mechanisms upgrading their systems to be more up to date with today's market needs though. Like Letters of Credit going onchain, or prepayment/BNPL leveraging digital assets as collateral instead. Just some ideas",
          "score": 1,
          "created_utc": "2026-02-17 10:37:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6untg",
      "title": "I’m a Fund Accounting professional working on a way to open up Hedge Fund investing to the average investor. Am I crazy?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r6untg/im_a_fund_accounting_professional_working_on_a/",
      "author": "Low_Lunch_172",
      "created_utc": "2026-02-17 03:07:28",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 0.8,
      "text": "Hey everyone,\n\nI’ve spent my career in the \"guts\" of the hedge fund world as a fund accountant. One thing has always bothered me: Tier-1 managers (think Citadel, Millennium, etc.) are essentially locked away from anyone who isn't an ultra-high-net-worth \"Accredited Investor.\"\n\nI’m working on a platform to \"wrap\" these funds and offer daily liquidity to the average investor. I have already worked out the setup of this and know it's possible, while also giving retail investors similar returns (if not better) than the HF investors being able to utilize preferrential fee classes. From a tax perspective, I've also worked out a way to get this launched without having to issue K-1s and issue plain old 1099s.\n\nThere's a lot of gnitty gritty that would go into launching something like this, but my general question is would you actually move a portion of your portfolio into this? If you could invest in Tier 1 HFs would you?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r6untg/im_a_fund_accounting_professional_working_on_a/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5t6gh7",
          "author": "cxavierc21",
          "text": "You sound naive to the regulatory hurdles of your plan. You can’t possibly think you’re the first to have this idea, right?",
          "score": 6,
          "created_utc": "2026-02-17 04:15:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5swzv2",
          "author": "alicantetocomo",
          "text": "Figure out if you can get licensed before going down the technology path.",
          "score": 3,
          "created_utc": "2026-02-17 03:13:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tevra",
          "author": "RealDapper",
          "text": "I’m very curious about how you intend to sell these “wrapped” funds to retail investors. Is the company owning your platform regulated under ICA issuing ETFs to track these funds? Unsure how else you’d do it, so you’re looking at some heavy compliance and licensure.\n\nRegulation aside, your question is: “would retail investors purchase your securities” (correct me if I’m wrong in my reading of your post). I can’t speak for every retail investor out there, but my understanding is that many don’t know about alternative investment options (which are already limited because it’s a regulatory challenge to sell to the public) because it’s complex to advertise for and many people are risk averse.\n\nI think you’d have a market for your platform but seek counsel.",
          "score": 2,
          "created_utc": "2026-02-17 05:15:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tkuj0",
          "author": "Why_StrangeNames",
          "text": "Interesting that you chose this problem. Could you explain your journey that led you to this?\n\nReason being if I was in FA for many years I would go down the path of providing something to funds. Selling hedge funds to retail wouldn’t be something I’d be interested in because there’s a reason hedge funds only serves the AI - they can afford the risk. I wouldn’t invest in a HF myself because the amount of capital I’m offering wouldn’t move a needle for the HF, and the risk they take is way more than I can accept when I put money in someone else’s hands. It generally doesn’t make sense for retail to go into these alternative funds because the best we can do is either buy the market or just invest ourselves.",
          "score": 2,
          "created_utc": "2026-02-17 06:02:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tzf6c",
          "author": "ETP_Queen",
          "text": "You’re not crazy, but the hard part isn’t the tech, it’s the structure regulatory perimeter.If the underlying isn’t daily liquid, “daily liquidity” has to be engineered and that’s where most models break.The key question isn’t *can you wrap it?*  it’s *who holds the assets, who’s liable, and how do you keep it nonmisleading for retail?*",
          "score": 1,
          "created_utc": "2026-02-17 08:13:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ug2w6",
          "author": "KimchiCuresEbola",
          "text": "The top pod-shops are so capacity constrained that they're returning capital to clients and regularly turning away sovereign wealth funds.\n\nWhy would they give allocation to retail and ruin their brand?\n\nAlso skeptical about your background as there are a ton of issues with your setup that someone with even a few years of experience in the space would immediately spot.",
          "score": 1,
          "created_utc": "2026-02-17 10:50:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vyx8s",
          "author": "fuggleruxpin",
          "text": "Master feeder is the norm here.  Maybe some way to marry that to what the likes of forge etc are doing?  If you can get it to market my company's tech stack could be very helpful to scale marketing.... Good luck.  Tough space. Many bodies on the highway.  But no one's really cracked it .",
          "score": 1,
          "created_utc": "2026-02-17 16:18:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2mfc8",
      "title": "Nearly finished tesing",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r2mfc8/nearly_finished_tesing/",
      "author": "Agent_invariant",
      "created_utc": "2026-02-12 06:45:06",
      "score": 2,
      "num_comments": 6,
      "upvote_ratio": 0.67,
      "text": "I'm coming to the end of testing something I've been building.\n\nNot launched. Not polished. Just hammering it hard.\n\nIt’s not an agent framework.\n\nIt’s a single-authority execution gate that sits in front of agents or automation systems.\n\nWhat it currently does:\n\nExactly-once execution for irreversible actions\n\nDeterministic replay rejection (no duplicate side-effects under retries/races)\n\nMonotonic state advancement (no “go backwards after commit”)\n\nRestart-safe (crash doesn’t resurrect old authority)\n\nHash-chained ledger for auditability\n\nFail-closed freeze on invariant violations\n\nIt's been stress tested it with:\n\nconcurrency storms\n\nreplay attempts\n\ncrash/restart cycles\n\nShopify dev flows\n\nwebhook/email ingestion\n\nIt’s behaving consistently under pressure so far, but it’s still testing.\n\nThe idea is simple:\n\nAgents can propose whatever they want. This layer decides what is actually allowed to execute in the system context.\n\nIf you were building this:\n\nWho would you approach first?\n\nAgent startups? (my initial choice)\n\nSaaS teams with heavy automation?\n\nE-commerce?\n\nAny other/better suggestions?\n\nAnd if this is your wheelhouse, what would you need to see before taking something like this seriously?\n\nTrying to figure out the smartest next move while we’re still in the build phase.\n\nBrutal honesty prefered.\n\nThanks in advance",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r2mfc8/nearly_finished_tesing/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o4ynvsd",
          "author": "saasgrowthnotes",
          "text": "This is sharp. The fail-closed freeze + hash-chained audit layer is a serious design decision. Curious how are you thinking about sequencing launch messaging once this goes public? A lot of infra products struggle translating system integrity into buyer clarity.”",
          "score": 1,
          "created_utc": "2026-02-12 11:11:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4zc51j",
              "author": "Agent_invariant",
              "text": "Appreciate that.\nWe’re planning to sequence it around a single concrete failure case first — not the architecture.\nInstead of talking about hash chains or invariants, we’ll show one messy real scenario (duplicate irreversible action under retries/crash), then show how the layer blocks it deterministically.\nThe messaging will be about preventing irreversible mistakes, not about system design philosophy.\nIf we can’t explain it through a specific nightmare, we’re not ready to launch it.",
              "score": 1,
              "created_utc": "2026-02-12 13:57:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o50tq7o",
          "author": "whatwilly0ubuild",
          "text": "The problem you're solving is real but the buyer identification is tricky.\n\nAgent startups are probably not your best first target despite seeming obvious. Most agent companies right now are focused on capabilities, making the AI do more impressive things. Safety and execution control is something they'll bolt on later when a customer demands it or after something goes wrong. Selling infrastructure to companies that aren't yet feeling the pain is a long sales cycle with lots of \"interesting, come back in six months.\"\n\nThe better wedge is teams that already got burned. SaaS companies running automation that had a duplicate charge incident, a webhook storm that created chaos, or an idempotency bug that cost real money. They understand the problem viscerally. Fintech and payments adjacent companies are particularly good here because the cost of exactly-once failures is concrete and quantifiable.\n\nE-commerce is interesting specifically for the Shopify angle you mentioned. Inventory management, order processing, and fulfillment automation all have irreversible actions where duplicates cause real operational pain. The challenge is that most e-commerce teams don't think in terms of execution gates, they think in terms of \"my app double-charged someone.\"\n\nWhat I'd need to see to take this seriously. Integration story matters more than the core capability. How hard is it to actually put this in front of an existing system? If the answer requires significant refactoring of how actions are dispatched, adoption will be slow regardless of how good the guarantees are. A clean SDK that wraps existing action calls would be more compelling than requiring architectural changes.\n\nThe hash-chained ledger for auditability is smart positioning because it gives you a compliance angle beyond just operational safety. Regulated industries care about proving what happened and when.\n\nOur clients building agent systems have generally found that the safety and control layer is something teams underinvest in until an incident forces prioritization. Your challenge is finding the teams right after that incident rather than before it.",
          "score": 1,
          "created_utc": "2026-02-12 18:16:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5od2sp",
              "author": "Agent_invariant",
              "text": "\n\nYou’re probably right about agent startups. A lot of them are still in “make it impressive” mode, not “make it unbreakable” mode. Selling protection before they’ve felt pain is always harder.\n\nThe “right after an incident” point is interesting though. That’s probably the real window. When someone’s just dealt with a duplicate side-effect or a retry storm and is thinking, “this can’t happen again.”\n\nOn integration — completely agree. If this requires people to re-architect their dispatch layer, it’s dead on arrival. The goal is to wrap existing irreversible calls, not redesign their system. So, it can sit cleanly in front. \n\nAnd yeah, the audit trail angle is there, but we’re not leading with compliance. Right now it’s more about stopping expensive, annoying mistakes in flows that should only happen once.\n\nAppreciate the points.",
              "score": 1,
              "created_utc": "2026-02-16 13:05:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5o53va",
          "author": "Tasty-Helicopter-179",
          "text": "Interesting layer to be building, especially right now while everyone is rushing agents into production without much execution governance.\n\nIf I were thinking about early adopters, I’d bias toward domains where irreversible actions carry a financial or compliance blast radius. Fintech ops, payments, lending workflows, even treasury automation. E-commerce is busy but usually more tolerant of rollbacks and compensating actions. The pain is sharper where “exactly once” is existential, not just operationally annoying.\n\nAgent startups sound logical, but in my experience they’re still optimizing for speed and demos. They feel the risk but often don’t want the friction yet. SaaS platforms with mature automation layers or internal ops agents tend to appreciate execution gates more because they’ve already been burned by replay, race conditions, or webhook chaos.\n\nBefore taking something like this seriously, I’d want to see failure stories, not just success runs. Where it froze execution, how operators recovered, what audit timelines looked like under dispute. We’ve logged similar invariant and replay scenarios in Tuskr during stress cycles just so authority decisions and state transitions were inspectable after the fact.",
          "score": 1,
          "created_utc": "2026-02-16 12:09:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5oc7kj",
              "author": "Agent_invariant",
              "text": " We’re not starting with Fintech, due diligence cycles are long and we want to get real-world exposure faster.\n\nFailure stories are the missing piece.(?) Not just “it survives chaos,” but “here’s the exact scenario where it froze, here’s what would’ve happened without it, and here’s how recovery worked.”\n\nThanks, appreciate the depth and time to write that.",
              "score": 1,
              "created_utc": "2026-02-16 12:59:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r59ogp",
      "title": "Difference between fintech and finance degree?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r59ogp/difference_between_fintech_and_finance_degree/",
      "author": "Curious_fox333",
      "created_utc": "2026-02-15 08:41:08",
      "score": 2,
      "num_comments": 2,
      "upvote_ratio": 0.67,
      "text": "I’m trying to choose my degree for college and recently I was told that I should look into fintech.  I don’t know much about it and was hoping to get some advice and how it’s different that a regular finance degree in education, hiring rate, pay, job opportunity, and the day to day work.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r59ogp/difference_between_fintech_and_finance_degree/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5k3ltu",
          "author": "PaymentFlo",
          "text": "Finance teaches you how money works.\nFintech teaches you how money moves using technology.\n\nFinance is traditional and stable. Fintech is faster-growing and more tech-driven.\n\nThe smartest move? Learn finance fundamentals and add tech skills on top.",
          "score": 1,
          "created_utc": "2026-02-15 19:27:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nbhpb",
          "author": "Slight_Warthog8706",
          "text": "Think of it this way -> finance teaches you how money moves, fintech teaches you how to build the technology that moves it.\n\nA finance degree is the traditional route. Accounting, corporate finance, investments, financial modeling. It leads to jobs like banking, financial analysis, wealth management, corporate finance roles. Very established career paths, well understood by employers, solid hiring pipelines.\n\nA fintech degree is newer and more interdisciplinary. You'll get some finance fundamentals but mixed with programming, data science, product design, and blockchain/payments technology. It prepares you more for roles at companies like Stripe, Square, Revolut, or the tech side of banks - think product management, data analytics, software development for financial platforms.",
          "score": 1,
          "created_utc": "2026-02-16 07:39:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}