{
  "metadata": {
    "last_updated": "2026-01-31 02:49:57",
    "time_filter": "week",
    "subreddit": "fintech",
    "total_items": 20,
    "total_comments": 119,
    "file_size_bytes": 136628
  },
  "items": [
    {
      "id": "1qpdvha",
      "title": "Stablecoin payment infrastructure hitting 72% yoy growth and private valuations climbing 15-20x annually",
      "subreddit": "fintech",
      "url": "https://cointelegraph.com/news/stablecoin-payment-flows-hit-56-trillion-2030",
      "author": "AetherGripX",
      "created_utc": "2026-01-28 15:08:18",
      "score": 58,
      "num_comments": 12,
      "upvote_ratio": 0.97,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qpdvha/stablecoin_payment_infrastructure_hitting_72_yoy/",
      "domain": "cointelegraph.com",
      "is_self": false,
      "comments": [
        {
          "id": "o2eb1xk",
          "author": "Livid-Ad7977",
          "text": "GENIUS Act compliance changes the game. Now it’s about who can actually operationalize compliance instead of hand waving it",
          "score": 8,
          "created_utc": "2026-01-29 12:08:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ebfuf",
              "author": "Choice-Answer8895",
              "text": "I think thats why crypto payments kept stalling. Teams underestimated how much fintech baggage they were signing up for",
              "score": 1,
              "created_utc": "2026-01-29 12:10:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2ec3zk",
                  "author": "No-Artichoke-5721",
                  "text": "I’ve seen a couple SDK style approaches where wallets can add spending without becoming regulated entities themselves. Oobit is interesting in that context, not as a consumer app, but as plumbing. Visa rails, stablecoins, compliance handled once instead of every team reinventing it",
                  "score": 1,
                  "created_utc": "2026-01-29 12:15:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ea0qu",
          "author": "Extra_Fly5172",
          "text": "Payments are brutally competitive and incumbents don’t roll over easily",
          "score": 2,
          "created_utc": "2026-01-29 12:00:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2eac2f",
          "author": "Life_Government7906",
          "text": "real signal is legacy players jumping in",
          "score": 2,
          "created_utc": "2026-01-29 12:03:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28i0eu",
          "author": "FarAwaySailor",
          "text": "It's not really stablecoin *payment* is it? It's just western-union in Houston converts 1000USD into USDC, puts it in their wallet 0x1234... then western-union in Bangalore takes it out of wallet 0x1234... and converts it to INR.",
          "score": 3,
          "created_utc": "2026-01-28 16:07:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2cdu7b",
              "author": "gadawg1020",
              "text": "Isn't that precisely what stablecoin payment infrastructure is supposed to do?",
              "score": 1,
              "created_utc": "2026-01-29 03:06:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2cfz75",
                  "author": "FarAwaySailor",
                  "text": "You can do what you like with it, but a stablecoin *payment* is where a token moves from wallet 0x1234... to wallet 0x5678...",
                  "score": 3,
                  "created_utc": "2026-01-29 03:18:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2gpj3k",
          "author": "swemming",
          "text": "Whats th best exchange to convert $150k/month of USD to tether/USDC? Outside of the US? Thanks",
          "score": 1,
          "created_utc": "2026-01-29 19:12:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hmqv1",
          "author": "KaziRashidDev",
          "text": "Ok",
          "score": 1,
          "created_utc": "2026-01-29 21:50:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpc4fx",
      "title": "binance paid $4.3 billion in the largest money laundering settlement in history but that wasn't even the interesting part. the DOJ monitor just filed their first report. here's what they found:",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qpc4fx/binance_paid_43_billion_in_the_largest_money/",
      "author": "sphinx-hq",
      "created_utc": "2026-01-28 14:00:42",
      "score": 46,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "binance just paid $4.3 billion because they... forgot to check if their users were terrorists.\n\nthe world's largest crypto exchange (we're talking about THE biggest player) failed to report over 100,000 suspicious transactions. and not just random suspicious stuff. we're talking hamas, al-qaeda, ISIS.\n\nbut wait it gets worse...\n\nwhen U.S. regulators told them \"hey maybe implement some anti-money laundering programs?\" binance basically said \"nah we're good\" smh.\n\nCEO changpeng zhao was literally on calls helping VIP customers set up offshore accounts to dodge compliance. like, they had actual meetings about how to help people avoid the rules.\n\nyou know what's insane? this was just... not doing basic compliance.\n\n$4.3 billion fine. zhao got 4 months in prison and had to pay $50 million personally.\n\noh and here's the cherry on top this was the first time in history a CEO pleaded guilty alongside their company. the DOJ's single largest corporate guilty plea ever.\n\nthe whole thing was just basic stuff they didn't do: check who your customers are. report weird transactions. don't help terrorists move money. compliance 101.\n\nbut here's the thing every single red flag they missed could have been caught automatically with the right tools. every suspicious pattern they ignored, every fake identity that slipped through.\n\n\"oops we accidentally banked al-qaeda\" shouldn't be a thing in 2025.\n\nhow does the largest exchange in the world not have basic KYC? was this willful ignorance or just incompetence at scale? i still can't wrap my head around it.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qpc4fx/binance_paid_43_billion_in_the_largest_money/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o2942zy",
          "author": "MediumApricot7124",
          "text": "It was the biggest exchange BECAUSE there was no kyc",
          "score": 13,
          "created_utc": "2026-01-28 17:42:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2lh6x8",
              "author": "ChainPlastic7530",
              "text": "now instead they are reporting everything according to DAC8 in Europe",
              "score": 1,
              "created_utc": "2026-01-30 13:07:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o28aovt",
          "author": "SeanyDay",
          "text": "It was a choice to remove barriers to entry and maximize market share.\n\nThat's pretty much it.\n\nAnd with this corrupt government administration in power, they can pay their way out of problems.",
          "score": 7,
          "created_utc": "2026-01-28 15:35:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2b6j2l",
          "author": "Durian881",
          "text": "And the CEO was pardoned by a President not known for being compliant to laws. Trump Regime is going to be an interesting case study for decades.",
          "score": 4,
          "created_utc": "2026-01-28 23:14:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2da8a3",
              "author": "FoggyPeaks",
              "text": "This is the bigger problem actually",
              "score": 1,
              "created_utc": "2026-01-29 06:47:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2b3775",
          "author": "RedDoorTom",
          "text": "Feature not a bug",
          "score": 2,
          "created_utc": "2026-01-28 22:57:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bl2ww",
          "author": "Efficient-Hat5546",
          "text": "You have access to this report or just your take on what it says?",
          "score": 1,
          "created_utc": "2026-01-29 00:29:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2caldo",
          "author": "68dk",
          "text": "Pardoned by Trump…",
          "score": 1,
          "created_utc": "2026-01-29 02:48:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2d8a9h",
          "author": "whatsasyria",
          "text": "Someone doesn't understand risk reward",
          "score": 1,
          "created_utc": "2026-01-29 06:31:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27xwcg",
          "author": "allcentury-eng",
          "text": "For transactions not on the trust network, what are the options?",
          "score": -1,
          "created_utc": "2026-01-28 14:34:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmpbx6",
      "title": "Are bank/fintech partnerships finally getting their act together?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qmpbx6/are_bankfintech_partnerships_finally_getting/",
      "author": "sphinx-hq",
      "created_utc": "2026-01-25 17:27:00",
      "score": 33,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "My hot take is that 2026 could be the year bank/fintech partnerships actually start to work.\n\nAnd yes, I know it’s easy to be cynical about these partnerships given all the high-profile failures and regulatory blowups.\n\nhowever, I’m starting to wonder if the problem was never the idea itself, but the fact that nobody knew where the lines were drawn: who owns the risk? who runs due diligence? what does “good enough” compliance actually mean?\n\nIn a lot of bank/fintech partnerships, those answers always were fuzzy at best. Lately though, I’ve been seeing more industry led efforts to standardize expectations around this stuff: clearer assessments, clearer roles, clearer compliance frameworks.\n\nIn other words, I’ve been paying attention to the new Coalition for Financial Ecosystem Standards (CFES) and it’s giving me hope.\n\nI might be overly optimistic here, but I feel like with clearer standards and sharpter tools, 2026 could finally be the year of durable partnerships and not just impressive headlines. What do you think?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qmpbx6/are_bankfintech_partnerships_finally_getting/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o1noybe",
          "author": "talltad",
          "text": "I work for a bank and help fintechs commercialize via a partnership.  \n\nMy hot take is that it depends on where the fintech is in their growth cycle.  Early on it’s all about liability and avoiding the risks associated with working in this space.  As they mature it becomes more about optimization and efficiency, removing friction from on-boarding customers and compliance obligations.  Mature companies seek to carve out and take on small amounts of risk depending on the return and their tech stack.  \n\nI’m yet to look up the CFES you mentioned but certainly don’t see how it could hurt",
          "score": 3,
          "created_utc": "2026-01-25 17:55:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1nl1kr",
          "author": "Equivalent-Disk5923",
          "text": "Agreed on the root cause, but I’m optimistic. Standards help, but incentives still aren’t perfectly aligned. Banks want safety, fintech wants speed. Curious if CFES can bridge that gap in practice, not just on paper.",
          "score": 2,
          "created_utc": "2026-01-25 17:39:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1qjuq7",
          "author": "ccvgghbj",
          "text": "Hi, I’m new to the bank–fintech partnership space and I’m working on it. You mention CFES as a reason 2026 could be different. Which specific failure modes do you think CFES would prevent, and through what mechanism. What would still be missing even with CFES. And in your view, why do these problems keep recurring in the first place?",
          "score": 1,
          "created_utc": "2026-01-26 01:38:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ruhbr",
          "author": "Deep_Ladder_4679",
          "text": "Totally agree that the ambiguity around compliance and risk ownership has been the real killer. If CFES can actually get banks and fintechs on the same page, we might finally see partnerships that work rather than just look good on paper.",
          "score": 1,
          "created_utc": "2026-01-26 06:16:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sbwqa",
          "author": "payments_ops",
          "text": "I think the point about unclear lines is doing a lot of work here. In my experience, most of the failures were not about bad actors or bad intentions, but about ambiguity  surviving too far into production.\n\nOnce real money or shared outcomes are involved, assumptions get stress tested very quickly. Clear standards help, but only if they translate  into operational boundaries that everyone understands before something goes wrong. Otherwise the partnership only looks aligned on paper.",
          "score": 1,
          "created_utc": "2026-01-26 08:42:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tb3u4",
          "author": "KimchiCuresEbola",
          "text": "See: Synapse",
          "score": 1,
          "created_utc": "2026-01-26 13:23:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uswph",
          "author": "TechExactly-",
          "text": "From a tech standpoint, that ambiguity usually means endless delays and custom work because no one wants to sign off on the compliance layer.\n\nIf these new standards really do create a reliable handshake, it changes the game. It turns a partnership from a messy, risk-heavy project into a scalable integration. Fingers crossed we’re finally moving past the era of \"pilot purgatory.\"",
          "score": 1,
          "created_utc": "2026-01-26 17:33:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yxzz7",
          "author": "TrioDeveloper",
          "text": "I think 2026 could be the year these partnerships start working. The issue has always been fuzzy lines around risk, due to the need for perseverance and compliance. Efforts like CFES are finally clarifying those expectations, making partnerships more operational and less just for headlines. Still early days, but I'm optimistic.",
          "score": 1,
          "created_utc": "2026-01-27 06:11:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zj0ib",
          "author": "ClarityCore",
          "text": "Yes, momentum is improving, but it’s still uneven. Partnerships work best where roles are clearly defined banks focus on compliance and balance sheets, while fintechs drive UX, data, and speed. The biggest gaps remain slow decision cycles, integration complexity, and unclear ownership of the customer. Models with revenue-sharing and API-first integration are showing more sustainable traction.",
          "score": 1,
          "created_utc": "2026-01-27 09:15:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dring",
          "author": "UKRetailFinance",
          "text": "2026 is definitely for people to focus more on FinTechs",
          "score": 1,
          "created_utc": "2026-01-29 09:24:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kod5p",
          "author": "houseofn1njas",
          "text": "Which areas do you think are most needed for such partnerships? Bank apps are pretty good nowadays so is it product? Or still CX?",
          "score": 1,
          "created_utc": "2026-01-30 09:22:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpbw0u",
      "title": "why does it feel like compliance analysts get all the stress but none of the credit?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qpbw0u/why_does_it_feel_like_compliance_analysts_get_all/",
      "author": "Jerold_Silva231",
      "created_utc": "2026-01-28 13:51:08",
      "score": 24,
      "num_comments": 4,
      "upvote_ratio": 0.97,
      "text": "i’ve been working in compliance/fincrime for a while now, and something that keeps bothering me is how invisible the work feels. when things go wrong, compliance gets blamed, but when things go right, nobody notices.\n\nyou can clear hundreds of alerts, stop actual bad activity, keep the company out of trouble and it’s just an “expected” part of the job. but miss one thing, or slow something down and suddenly everyone’s asking questions.\n\na lot of the pressure comes from the fact that we’re the last line of defense, but we don’t really control the inputs. it’s such stressful work, and most of it happens quietly in the background.\n\ndoes anyone work in a team where compliance work is actually recognized and rewarded? or where the last line of defense found something to get 7h of sleep...",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qpbw0u/why_does_it_feel_like_compliance_analysts_get_all/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o29dxsm",
          "author": "No-Flan6382",
          "text": "Because most of senior leadership tends to be people with a talent for selling. It’s a culture thing - they view compliance as a hurdle for salespeople to get over in order to close a deal, not a safeguard to protect their company from potential damages. \n\nThe way I tried to overcome this in my own career was by making compliance into something that could be promoted as a potential profit center. In other words, get automations and standards so polished that we can sell compliance as a service, or use it as a competitive advantage in sales discussions. \n\nI’ve found that for the most part though, it boiled down to people viewing compliance as a necessary evil and a cost center to the company.",
          "score": 1,
          "created_utc": "2026-01-28 18:24:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dhwmr",
              "author": "kayandrae",
              "text": "To add to the conversation, track \"how much fines have we avoided this month\" metric and it would probably help communicate business value",
              "score": 1,
              "created_utc": "2026-01-29 07:54:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o29lf9m",
          "author": "yous-guys",
          "text": "We recently switched our system (about 2 months ago) and daily, leadership just yells at us to turn auto approvals on- but maintain we must have 0 fraud. \n\nThe just out to lunch on how it all works.",
          "score": 1,
          "created_utc": "2026-01-28 18:56:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cir6c",
          "author": "Scary_Try_948",
          "text": "Vì compliance thường đứng ở tuyến đầu chịu rủi ro nhưng lại ở phía sau sự ghi nhận: làm tốt thì không ai để ý vì “chưa có chuyện gì xảy ra”, còn chỉ cần sót một lần là bị soi ngay. Họ gánh trách nhiệm lớn, quyền quyết định hạn chế, lại hay phải nói “không”, nên áp lực cao nhưng công lao ít được nhìn thấy.",
          "score": 1,
          "created_utc": "2026-01-29 03:34:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmq5ad",
      "title": "running compliance at a crypto company is actual hell. anyone found tools that work for this space?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qmq5ad/running_compliance_at_a_crypto_company_is_actual/",
      "author": "Jerold_Silva231",
      "created_utc": "2026-01-25 17:56:29",
      "score": 23,
      "num_comments": 14,
      "upvote_ratio": 0.87,
      "text": "i've been doing AML/compliance for 6 years, last 2 in crypto. and man nothing prepared me for this. the volume is insane. we process thousands of transactions daily and our screening tool flags probably 40% of them because apparently everyone in crypto has a name that fuzzy matches someone on a watchlist somewhere. but the real problem is none of the legacy vendors understand on-chain data. like at all. we're trying to connect wallet analytics with our KYC/KYB data and it's all manual. i have analysts alt-tabbing between chainalysis and our case management system copy pasting stuff. SAR filing is a nightmare. every report takes 2+ hours because we have to manually compile evidence from like 6 different sources. and the regulators... look i get it, crypto is high risk. but the scrutiny means we need PERFECT audit trails and our current setup is duct tape and prayers. we tried chainalysis for on-chain stuff (decent), elliptic (meh), looked at sumsub and jumio for KYC but they're not really built for our workflow. recently heard about sphinxhq and sardine being more crypto-native but haven't tried them yet. what's actually working for crypto compliance teams? especially for alert triage and SAR automation? i'm losing my mind over here",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qmq5ad/running_compliance_at_a_crypto_company_is_actual/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o1o6sa7",
          "author": "Wiz711",
          "text": "Which company are you at? I’m at Gemini running into same issues",
          "score": 2,
          "created_utc": "2026-01-25 19:09:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hs432",
              "author": "Heavensdoor16",
              "text": "Dealing with the same thing. Been looking at decentralized identity providers as a way out of the copy-paste workflow — Zyphe is one we're testing. Verify once, credential follows the user, less manual reconnection when you need to build a case. Too early to say if it solves everything but the approach makes more sense than stitching it together after the fact.",
              "score": 1,
              "created_utc": "2026-01-29 22:16:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1nwprw",
          "author": "KimchiCuresEbola",
          "text": "Hire a domain expert.\n\nIf you're already working with regulators, you're going to need a compliance officer at some point anyways. The compliance domain expert should be the one figuring this out, not you asking a bunch of random people on Reddit.",
          "score": 1,
          "created_utc": "2026-01-25 18:27:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1o37iw",
          "author": "Typicalusrname",
          "text": "Look for someone who built out AML for a major broker dealer, they’ll be used to designing volume centric solutions",
          "score": 1,
          "created_utc": "2026-01-25 18:53:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1o6mmc",
          "author": "Classic_Chemical_237",
          "text": "Elliptic. it is costly but that's the cost of doing Web3",
          "score": 1,
          "created_utc": "2026-01-25 19:08:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1oqqkp",
          "author": "Efficient-Hat5546",
          "text": "Are you looking for a good combination of systems and workflows that “speak” to each other without going through all 6 sources and alt-tabbing while copy pasting? \n\nSorry to tell you this but its likely going to need to be a bespoke tool built in house that all your vendors feed into. No combination of 3rd party tools recommended by reddit will fit your use case until they actually get access to your system and see how compliance works there.\n\nI’m no tech person, but can’t your compliance tech/engineering team help link wallet address from a transaction id/hash to the customer id, linked to your blockchain analytics tool? Maybe they are and its still too manual? \n\nHave seen it done properly, albiet manual, at an established crypto firm and I’m now trying to help another firm set it up right.",
          "score": 1,
          "created_utc": "2026-01-25 20:37:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1q8ni2",
          "author": "Narrow-Pattern-7483",
          "text": "Foreign exchange settlement and purchase",
          "score": 1,
          "created_utc": "2026-01-26 00:42:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1y32h3",
          "author": "pittburgh_zero",
          "text": "I worked In big banking.  BSA/AML/KYC is no joke.  We always built stuff in house.  Off the box solutions just don’t work.",
          "score": 1,
          "created_utc": "2026-01-27 02:52:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2i9qcm",
              "author": "Kurimidew",
              "text": "Mostly agree but i think the landscape has shifted a bit. the problem with pure in-house is you're also owning the liability for identity data storage and the infra to keep it examiner-ready.\n\nWhat's changed is there are now APIs that give you the identity primitives without you holding the PII centrally. client-side encryption, portable credentials, Zero-knowledge proofs for verification without exposing underlying docs. you still build your own workflows on top but you're not reinventing identity verification from scratch or becoming a honeypot for sensitive data.\n\nNot saying off-the-shelf works — but \"own your architecture, outsource the identity layer\" is a middle ground that's working for some Teams.",
              "score": 1,
              "created_utc": "2026-01-29 23:47:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o20f33j",
          "author": "Sumsub_Insights",
          "text": "Totally hear you, this is super common for crypto compliance teams, and honestly, you’re not exaggerating. I’m on the Sumsub team, so I’ll speak plainly about what we’ve seen actually help in practice (not a sales pitch). The biggest pain point you mentioned is fragmentation. When analysts have to jump between on-chain analytics, KYC tools, and case management, everything slows down and audit trails get messy. Teams that centralize identity data + transaction context in one place see alerts automatically enriched and cases don’t have to be manually rebuilt.\n\nA few things that matter specifically for crypto:\n\n• **Configurable rules per business model** — flows can be tuned differently for CEXs, on/off-ramps, custody providers, OTC desks, etc., instead of relying on a single generic setup.  \n• **Automated alert triage & evidence collection** — reduces false positives and cuts down SAR/STR prep time because the supporting data is already attached.  \n• **BYOK** — encryption keys stay with the client, which helps with security and regulator scrutiny.\n\nNo tool removes all the pain of crypto compliance, but consolidating data and automating the mechanical work usually gets teams out of “duct tape and prayers” mode.\n\nDrop us a line if there are more details to share on the case — happy to help!",
          "score": 1,
          "created_utc": "2026-01-27 13:23:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ehmc1",
          "author": "Ok-Introduction-2981",
          "text": "This is a real pain in crypto. Detection isn’t the hard part, evidence is. Things break when teams have signal but can’t produce regulator ready artifacts without manual stitching. The ones that stabilize separate signal from audit packaging. \n\nOn chain analytics give context, but KYB and identity need to stand on their own. That’s why some teams lean on au10tix for standardized identity evidence and layer chain analysis on top. It cuts SAR prep time and keeps examiners calmer.",
          "score": 1,
          "created_utc": "2026-01-29 12:52:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ntjca",
          "author": "tjech",
          "text": "I hear good things about Crystal, we’re only using Chainalysis right now but with growing vols. \n\nhttps://crystalintelligence.com/",
          "score": 0,
          "created_utc": "2026-01-25 18:14:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnmniw",
      "title": "there are 8 compliance nightmares that will keep fintech ceos up at night in 2026 but only 3 of them are actually about regulation",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qnmniw/there_are_8_compliance_nightmares_that_will_keep/",
      "author": "sphinx-hq",
      "created_utc": "2026-01-26 17:31:14",
      "score": 21,
      "num_comments": 4,
      "upvote_ratio": 0.89,
      "text": "there are 8 compliance nightmares coming for banks in the months ahead...\n\ni just read through the compliance forecast from datasnapper and it's interesting to say the least. most teams aren't ready for what's coming tbh.\n\nhere's what's heading their way:\n\nESG reporting isn't just paperwork anymore. miss one thing under the new EU rules and you're in regulatory quicksand.\n\nAI-generated fakes are slipping past human reviewers every single day - your analysts are outmatched and outnumbered.\n\nAML/CTF expectations are now real-time. \"we'll look into it next week\" isn't gonna fly anymore.\n\ndigital banking rules are changing faster than most teams can update their internal playbooks.\n\nconsumer protection is getting way more aggressive. fair lending violations = fines + public backlash.\n\neveryone's adding AI but nobody's talking about how messy the compliance risks are if you get it wrong. classic catch-22.\n\noperational resilience is suddenly a big deal. regulators want to know if you can survive the next crisis before it happens.\n\nglobal tax rules are turning digital transactions into a reporting nightmare.\n\nwhat worries me is how many teams still think they're on top of it while all this stuff quietly slips through.\n\nwhich of these is going to blow up first? my money's on AI governance but curious what others think.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qnmniw/there_are_8_compliance_nightmares_that_will_keep/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o1uxgd3",
          "author": "rhizome-compliance",
          "text": "\"AI governance\" has become almost a meaningless buzzword at this point, so I agree that it's very likely a regulator will try to actually define what expectations are.",
          "score": 2,
          "created_utc": "2026-01-26 17:53:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zat8w",
          "author": "payments_ops",
          "text": "A lot of these aren't regulation problems so much as evidence and response time problems. Teams often have policies, but they can't show what the system saw at the time. What decision was made. Why it was made and what actions were enforced.\n\nMy guess is AI governance and real time monitoring will blow up first because once something goes wrong, auditors care less about intent and more  about whether you reconstruct the decision trail and prove controls were operational.",
          "score": 1,
          "created_utc": "2026-01-27 07:59:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26tca6",
          "author": "Pretty-Mirror-5876",
          "text": "AI governance is already a dumpster fire. People are implementing it without knowing the data lineage or bias, which is a disaster waiting to happen. ESG is next, the reporting is getting wild.",
          "score": 1,
          "created_utc": "2026-01-28 10:05:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27f97h",
          "author": "oftgefragt_dev",
          "text": "just wait til \"Know Your Agent\" comes into the field \n\na whole lotta compliance issues are comin i feel like",
          "score": 1,
          "created_utc": "2026-01-28 12:54:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qoaraw",
      "title": "AI fatigue in fintech is real. And it’s getting worse",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qoaraw/ai_fatigue_in_fintech_is_real_and_its_getting/",
      "author": "oftgefragt_dev",
      "created_utc": "2026-01-27 10:58:04",
      "score": 12,
      "num_comments": 16,
      "upvote_ratio": 0.93,
      "text": "I’m seeing more and more fintech products slap “AI-powered” on the landing page, but very few actually understand finance deeply enough to deserve it.\n\nA lot of these tools:\n\n* oversimplify financial reality\n* miss critical edge cases\n* confidently output numbers that *look* right but are strategically wrong\n\nFinance isn’t just calculation.  \nMany of these tools overlook the very reason why accounting or finance can be a challenge. There are many non-static variables. See, there's the number game, and then there's the guessing game.\n\nFor example, you can’t treat company finances like a clean personal budget and expect useful output. Accountants and finance operators spend most of their time on the messy parts.\n\nI run a business myself, and honestly, I wouldn’t trust most of the “AI finance” products on the market today for real decisions. \n\nCurious if others feel this too:  \nDo you think fintech AI is being rushed at the expense of usefulness?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qoaraw/ai_fatigue_in_fintech_is_real_and_its_getting/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o21popz",
          "author": "petartod",
          "text": "Fintechs' home pages are filled with lies.",
          "score": 3,
          "created_utc": "2026-01-27 17:02:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o25ltt8",
              "author": "oftgefragt_dev",
              "text": "many testimonials arent even testimonials , im %99 sure. also the level of security when it comes to fintech, especially the -- we are already small, compliance isnt a big deal-- type ones is accelerating this mess.",
              "score": 1,
              "created_utc": "2026-01-28 04:16:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o21zyg7",
          "author": "GabagoolProvolone",
          "text": "Bro you used AI to write this slop",
          "score": 3,
          "created_utc": "2026-01-27 17:47:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26gjp3",
              "author": "tornavec",
              "text": "If you're going to make accusations, back them up with facts. Otherwise, it's just empty talk.",
              "score": 0,
              "created_utc": "2026-01-28 08:07:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o26guia",
                  "author": "GabagoolProvolone",
                  "text": "Pipe down son",
                  "score": 3,
                  "created_utc": "2026-01-28 08:10:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o227ss1",
          "author": "One_Peanut_273",
          "text": "Very true",
          "score": 2,
          "created_utc": "2026-01-27 18:20:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o272pxw",
          "author": "Annual_Judge_7272",
          "text": "Soon everything with agents in beta all the data",
          "score": 2,
          "created_utc": "2026-01-28 11:25:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20cbq2",
          "author": "Annual_Judge_7272",
          "text": "This works \n\nhttps://knowledge.dotadda.io",
          "score": 1,
          "created_utc": "2026-01-27 13:08:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o25nnv0",
              "author": "oftgefragt_dev",
              "text": "u mean summarizing SEC files?",
              "score": 1,
              "created_utc": "2026-01-28 04:28:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o272s8i",
          "author": "Annual_Judge_7272",
          "text": "Just conference calls now",
          "score": 1,
          "created_utc": "2026-01-28 11:26:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29e7so",
          "author": "attn-transformer",
          "text": "I've been a wall street quant for 15 years and building workflow automation. I turn structured finance prospectuses into executable models, forecast cashflows, and create scenarios.",
          "score": 1,
          "created_utc": "2026-01-28 18:26:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29p73k",
              "author": "oftgefragt_dev",
              "text": "curious. how does your side differ in comparison to ml or dl based financial data analysis?",
              "score": 1,
              "created_utc": "2026-01-28 19:13:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o29syha",
                  "author": "attn-transformer",
                  "text": "Agent finds features -> builds logit model -> analyze results -> iterate.  \nModel becomes a reusable artifact in the system.   \n  \n\\- train(dataset\\_x)  \n\\- run(dataset\\_y)\n\nThen modeling the actual cashflows - hard:\n\nFor example: In a prospectus there are dozens of cashflow rules specifying which investors receive what cashflows, given conditions on collateral performance, priority of payments, certain rules, etc, laid out in a 250 page legal prospectus. \n\nMy agent can extract this information -> run tests to ensure accuracy -> analyze the underlying collateral -> use historical data to build forecast collateral performance -> generate pricing.\n\nIt's all very challenging technically, but enables a portfolio manager to move 10x faster and get smarter analytics.",
                  "score": 2,
                  "created_utc": "2026-01-28 19:30:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o29g65e",
          "author": "whatwilly0ubuild",
          "text": "The fatigue is real and justified. Most \"AI-powered\" fintech is a thin wrapper around an LLM with some financial prompts, marketed as if it's a breakthrough.\n\nThe core problem you're identifying is that finance is adversarial in ways that generic AI doesn't understand. Tax optimization isn't just math, it's anticipating how regulators interpret rules. Cash flow forecasting isn't just trend projection, it's modeling customer behavior, supplier dynamics, and market conditions that interact in non-obvious ways. The \"messy parts\" you mention are often the entire value of having a skilled finance person.\n\nWhat I see constantly with our clients evaluating these tools is the confidence calibration problem. An LLM will give you a number with the same tone whether it's correct, approximately right, or completely fabricated based on a misunderstanding of the question. In finance, the difference between those three outcomes can be bankruptcy or jail time. Most AI tools have no mechanism to say \"I don't actually know this well enough to answer.\"\n\nThe tools that actually work in finance tend to be narrow and boring. Automated categorization of transactions. Anomaly detection for fraud. Document extraction from invoices. These are well-defined problems with clear success metrics. The moment you expand to \"AI CFO\" or \"AI financial advisor\" territory, you're in bullshit land because those roles require judgment that current AI genuinely cannot provide.\n\nThe rush is happening because investors are funding anything with AI in the pitch and founders are responding to incentives. The correction will come when enough businesses make bad decisions based on confidently wrong AI output and the lawsuits start piling up.",
          "score": 1,
          "created_utc": "2026-01-28 18:34:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29ou8s",
              "author": "oftgefragt_dev",
              "text": "the ai hype is very evident among investors yea, so much so that one could speculate that investors running to ai companies like they have been hit by Cupid is intentional and to drive more traffic to ai tools and cloud resources",
              "score": 1,
              "created_utc": "2026-01-28 19:11:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2aqdhh",
          "author": "McSabre1983",
          "text": "Snake oil everywhere",
          "score": 1,
          "created_utc": "2026-01-28 21:57:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qonbv8",
      "title": "Open Banking API for personal finance app (Next.js) — any affordable options left?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qonbv8/open_banking_api_for_personal_finance_app_nextjs/",
      "author": "Longjumping_Pay_2093",
      "created_utc": "2026-01-27 19:10:06",
      "score": 10,
      "num_comments": 20,
      "upvote_ratio": 0.82,
      "text": "Hey everyone,\n\nI want to build a small web app with Next.js **for personal use only**.  \nThe goal is to track **my own bank accounts**, build statistics, and get a better overview of my finances.\n\nI’m currently trying to save as much money as possible for a future house, so my wife and child can have a good life — and I thought building my own tool would be both useful and a fun project.\n\nThe problem I’m running into:\n\n* Nordigen was acquired by GoCardless and **new signups for Bank Account Data seem to be disabled**\n* Other Open Banking APIs I’ve found (Tink, banksapi, finAPI, etc.) are **very expensive**, even for single-user / read-only use\n* I only need **read-only access to my own accounts**, no payments, no transfers, no SaaS product\n\nIs there **any affordable or developer-friendly solution** left for this use case?  \nOr is CSV import / mock data basically the only realistic option right now?\n\nWould really appreciate any pointers or real-world experiences. Thanks!\n\nEDIT:  \nBank accounts are in germany.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qonbv8/open_banking_api_for_personal_finance_app_nextjs/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o22k6m8",
          "author": "jayebird111",
          "text": "Does your bank let you download your data in a structured form like a spreadsheet? Even if not, you could use an LLM to convert your PDF statements easily enough these days. If it's just for you it should do the trick",
          "score": 1,
          "created_utc": "2026-01-27 19:13:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22m8w3",
              "author": "Longjumping_Pay_2093",
              "text": "To be 100% clear: You want me to export csv files from every bank account and upload it into my own tool?",
              "score": 1,
              "created_utc": "2026-01-27 19:22:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o22qshy",
                  "author": "jayebird111",
                  "text": "Unfortunately you won't find a tool that lets you do this as an individual. There's rightly a high barrier to entry to use open banking data.\n\nOpen banking technology has no concept of whether it's your own data you're receiving or not.\n\nBanks can't go around letting people they know nothing about receive continuous streams of their customers' transaction data; it's a recipe for fraud and scams.\n\nYour options are probably:\n\n1. Download/export the data and import it into what you're building\n2. Find an existing app that does what you want\n3. Register a company that can pass the KYB checks of the open banking service you're using",
                  "score": 2,
                  "created_utc": "2026-01-27 19:42:47",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o22n50o",
                  "author": "kiwiinNY",
                  "text": "How many bank accounts do you have?",
                  "score": 1,
                  "created_utc": "2026-01-27 19:26:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22kf06",
          "author": "phoenixy1",
          "text": "It would help to know what country these bank accounts are in.",
          "score": 1,
          "created_utc": "2026-01-27 19:14:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22mcyf",
              "author": "Longjumping_Pay_2093",
              "text": "Germany.",
              "score": 1,
              "created_utc": "2026-01-27 19:23:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o22y3ki",
                  "author": "phoenixy1",
                  "text": "Yeah Europe is a very hobbyist-unfriendly market unfortunately for this kind of thing. I'm not aware of any platforms that will let you do this at pricing that makes sense. Downloading the CSV may be your best bet.",
                  "score": 1,
                  "created_utc": "2026-01-27 20:15:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22sjex",
          "author": "o9dev",
          "text": "You could try TrueLayer although it looks like they've dropped self-serve and pricing information from their site.",
          "score": 1,
          "created_utc": "2026-01-27 19:50:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22zcx7",
          "author": "nexafin",
          "text": "We ([Nexafin](https://nexafin.com)) are working with GoCardless and we have an API you can use if you prefer to work with your own data and we are also working in a read only MCP. You can use WELCOME50 for a 50% off first year, if you would like to give us a try. \n\nDM me if you have any questions.",
          "score": 1,
          "created_utc": "2026-01-27 20:21:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o247o5i",
          "author": "ButtonEnjoyer",
          "text": "Maybe check out \n\nhttps://beta-bridge.simplefin.org/   \n\nI’ve not used them personally but it’s on my todo list to check it out.",
          "score": 1,
          "created_utc": "2026-01-27 23:49:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25ppts",
          "author": "Glittering-Network41",
          "text": "Does SimpleFin bridge work for you? Connect the accounts and then use their API key to get data",
          "score": 1,
          "created_utc": "2026-01-28 04:41:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o25prae",
              "author": "Glittering-Network41",
              "text": "It’s under $2/mo but not sure about German accounts. I have used it with a python script that updates an xlxs. Simple and quick",
              "score": 1,
              "created_utc": "2026-01-28 04:41:19",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o26so9d",
              "author": "Longjumping_Pay_2093",
              "text": "My banks are not supported",
              "score": 1,
              "created_utc": "2026-01-28 09:59:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o26kcxw",
          "author": "Emma_exploring",
          "text": "Cool project idea! Sadly, affordable open banking APIs in Germany are scarce since Nordigen shut down. For now, CSV exports + automation scripts are probably the most practical option. If you just want to experiment, mock data works too until a developer‑friendly API reopens.",
          "score": 1,
          "created_utc": "2026-01-28 08:42:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29f32w",
          "author": "whatwilly0ubuild",
          "text": "The affordable Open Banking API market for personal projects has gotten rough. Nordigen's free tier was the go-to answer and that door closing hurts.\n\nFor Germany specifically, you have a few options that aren't the enterprise-priced providers.\n\nFinTS/HBCI is the German banking standard and there are open source libraries that connect directly to your bank without a third-party API provider. Python has the fints library, there's also openhbci. Your bank needs to support FinTS which most German banks still do, and you'll need to get credentials from your bank. It's more work to set up than a REST API but it's free and you're not dependent on a provider's pricing changes.\n\nGoCardless Bank Account Data might still be accessible. Their documentation suggests the free tier still exists for small volume, just harder to find signup flow since they're pushing enterprise. Worth trying to create a developer account directly rather than assuming it's completely gone.\n\nActual Budget and Firefly III both have German bank import capabilities through various connectors. If your goal is personal finance tracking rather than building something custom, these self-hosted tools might solve the problem without you needing to build from scratch.\n\nThe CSV import route is honestly not terrible for personal use. Most German banks let you export transactions and automating the import into your Next.js app is a few hours of work. Less elegant than real-time API but functional and zero ongoing cost.\n\nOur clients building personal finance tools for European markets have generally found that direct bank protocols like FinTS work better for single-user apps than trying to find cheap API providers.",
          "score": 1,
          "created_utc": "2026-01-28 18:29:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c2dx3",
          "author": "One_Peanut_273",
          "text": "Did you find anything here?",
          "score": 1,
          "created_utc": "2026-01-29 02:03:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2efuc6",
          "author": "fed239",
          "text": "Hey! For free access to your own accounts you can use Enable Banking API, open-source PFM apps (like Sure and Actual Budget) use the option. The feature is described here: [https://enablebanking.com/docs/api/linked-accounts](https://enablebanking.com/docs/api/linked-accounts)",
          "score": 1,
          "created_utc": "2026-01-29 12:40:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq953q",
      "title": "Which \"boring\" niche is actually a goldmine for a fintech startup in 2026, and which \"sexy\" niche is a total trap?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qq953q/which_boring_niche_is_actually_a_goldmine_for_a/",
      "author": "jeeves_inc",
      "created_utc": "2026-01-29 13:53:28",
      "score": 10,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qq953q/which_boring_niche_is_actually_a_goldmine_for_a/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o2etnse",
          "author": "Mayur_Botre",
          "text": "Boring goldmine: compliance-heavy back office stuff like reconciliations, vendor payments, tax and reporting workflows. Sexy trap: consumer fintech, wallets, neobanks, or anything fighting on UX alone with brutal CAC and thin margins. The money is where pain is mandatory, not optional.",
          "score": 21,
          "created_utc": "2026-01-29 13:59:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jzswt",
          "author": "Agreeable-Door-101",
          "text": "B2B is still underserved. Lots off oops to improve process build an ecosystem for Smes. \n\nPayments alone is too crowded. Minimal\nMargins and lots of oversight.",
          "score": 1,
          "created_utc": "2026-01-30 05:52:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2pk8nm",
              "author": "IndividualBuffalo278",
              "text": "what are some specific examples of oops to improve process build an ecosystem for smes?",
              "score": 1,
              "created_utc": "2026-01-31 00:56:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2k8u35",
          "author": "TrioDeveloper",
          "text": "Agree the money's in boring B2B where the pain is unavoidable: compliance, reporting, reconciliation, weird accounting edge cases. Stuff companies hate but can't skip.\n\nThe sexy trap for me is consumer fintech that's basically payments + nicer UX. Insanely crowded, brutal CAC, razor-thin margins, and you're up against companies that can outspend you forever.\n\nI'd go after boring problems people *have* to pay for, not flashy ones they can ignore.",
          "score": 1,
          "created_utc": "2026-01-30 07:04:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr6hfz",
      "title": "Anyone here tried an AI headshot Pro generator yet? Curious what people think about these tools.",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qr6hfz/anyone_here_tried_an_ai_headshot_pro_generator/",
      "author": "My_Rhythm875",
      "created_utc": "2026-01-30 14:10:39",
      "score": 10,
      "num_comments": 1,
      "upvote_ratio": 0.84,
      "text": "Not promoting anything. Just sharing an experience and curious how others feel about this.\n\nI tried one recently after needing a basic professional photo and not having the time or interest to book a photographer. The specific app I tried was [Generate Professional Headshot](https://apps.apple.com/us/app/generate-professional-headshot/id6751214183) from the App Store. I went in expecting something gimmicky. Most of the results were not usable, but a couple were acceptable for low stakes use like a temporary profile image.\n\nWhat made me think was not the quality but the role of tools like this. It did not feel like a replacement for a photographer. It felt more like a convenience option for people who need something quickly and would not have booked a shoot anyway.\n\nAt the same time I can see potential downsides. People may end up using images that do not really look like them. Platforms could fill up with very similar looking faces. First impressions might become less honest.\n\nSo I am curious how others see this type of tool.\nDo you see it as harmless convenience or more of a net negative.\nWould you personally use an AI generated headshot for something informal or temporary.\nFor photographers or creatives here does this feel like a threat or just a different category.\n\nNot recommending it and not arguing for or against it. Just trying to understand where people think the line is between a useful shortcut and something that cheapens professional presentation.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qr6hfz/anyone_here_tried_an_ai_headshot_pro_generator/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o2n1ivm",
          "author": "Imaginary-Carrot2532",
          "text": "I personally use [gentube.app](https://www.gentube.app/?_cid=cm), and I found it to save me a lot of time and money",
          "score": 0,
          "created_utc": "2026-01-30 17:36:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qo9574",
      "title": "What do you actually want from a banking app as a young user?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qo9574/what_do_you_actually_want_from_a_banking_app_as_a/",
      "author": "ProudPerspective7510",
      "created_utc": "2026-01-27 09:24:07",
      "score": 9,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "We’re trying to understand how young people actually experience banking apps today.\n\n\n\nAs a user, I’m curious:\n\n\\- What features do you expect from a modern banking app?\n\n\\- Do things like rewards, challenges, or gamification matter to you?\n\n\\- How important is personalization (custom insights, spending tips, goals)?\n\n\\- What do current banking apps get completely wrong?\n\n\n\nNo selling — just genuinely curious about real user expectations.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qo9574/what_do_you_actually_want_from_a_banking_app_as_a/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o1zkt3x",
          "author": "Turbulent-Cap-6469",
          "text": "Honestly the biggest thing most apps get wrong is making simple stuff way too complicated. Like why do I need to navigate through 5 screens just to send money to a friend\n\n  \nGamification is kinda cringe unless it's actually useful - don't give me badges for spending money lol. But if you can gamify saving or hitting financial goals that's actually pretty cool\n\n  \nThe spending insights are clutch when they work properly, most apps just tell me I spent money on \"miscellaneous\" which is useless. I want to know I'm dropping too much on DoorDash without having to categorize everything manually",
          "score": 5,
          "created_utc": "2026-01-27 09:32:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o203owj",
              "author": "alex_aws_solutions",
              "text": "I share this opinion completely! Well said. \nIn Brazil I'm using Nubank. They get some things done quite good and user friendly!",
              "score": 1,
              "created_utc": "2026-01-27 12:11:34",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o21l5x7",
              "author": "Otherwise-Ear1256",
              "text": "You're so right on your first point. Every once in a while I'll get a call from my mother asking if I can send someone some money because she just can't deal with the amount of clicks it takes to do so, it shouldn't be that lengthy of a process yet every bank and every app have it that way.",
              "score": 1,
              "created_utc": "2026-01-27 16:43:34",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o27f2fj",
              "author": "oftgefragt_dev",
              "text": "agree, i think one fundemental mistake of apps today is assuming their users are stupid",
              "score": 1,
              "created_utc": "2026-01-28 12:53:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2406sq",
          "author": "jeazous",
          "text": "Love this",
          "score": 1,
          "created_utc": "2026-01-27 23:10:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2568lc",
          "author": "0xmerp",
          "text": "I would love to see tighter OS integration. Not sure how much you can customize the bank cards added to Apple Wallet but it would be great if some information were available at a glance from Apple Wallet.\n\nCommonly used features like transfers should be front and center. \n\nNotifications for important events. Incoming transfers should have a notification with basic info (who’s it from, how much, to which account). Same with outgoing transfers. The less I have to actually open the app the happier I am.",
          "score": 1,
          "created_utc": "2026-01-28 02:48:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o261ay6",
          "author": "TrioDeveloper",
          "text": "Honestly, I just want it to be fast and simple. Show my balance when logged in and let me send money in like 2 taps. Gamification doesn't matter unless it helps me save or hit goals; badges for spending are pointless. Personalization would be nice if it were useful, like telling me I'm overspending on food or subscriptions instead of dumping them under misc. Most apps overcomplicate basic stuff. I have to dig through menus to do simple things; it's annoying.",
          "score": 1,
          "created_utc": "2026-01-28 06:01:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26kfu0",
              "author": "ProudPerspective7510",
              "text": "While everything is becoming simpler, banks and their applications never seem to simplify. I like this \"Make it simple\"",
              "score": 3,
              "created_utc": "2026-01-28 08:43:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o268xvh",
          "author": "kubrador",
          "text": "honestly the bar is just \"don't make me call someone.\" current apps are allergic to solving actual problems. they'd rather show me a pie chart of my coffee spending than let me dispute a charge without 6 screens of nonsense.\n\ngamification is corporate speak for \"we found out users hate banks so we added confetti.\" if your app needs to be fun to use, something's already broken. personalization that matters: tell me why i'm bleeding money. spending tips are useless if they're just \"wow you spent a lot on food\" like yeah no shit, i eat.\n\nwhat they get wrong is acting like young people want to \\*engage with their bank.\\* we tolerate you at best. just make transfers instant, keep my money safe, and stay out of my way.",
          "score": 1,
          "created_utc": "2026-01-28 07:02:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27czwp",
          "author": "LawyerExpensive9880",
          "text": "For me, I just want a banking app that’s simple, fast, and doesn’t make basic things feel complicated. Small rewards and cashbacks do matter because they make everyday spending feel a bit more rewarding, which is why I end up using Paytm so often. Personal insights are useful too, but only when they’re easy to understand and not overwhelming. What most apps get wrong is trying to look fancy instead of actually making life easier.",
          "score": 1,
          "created_utc": "2026-01-28 12:39:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qopmpq",
      "title": "Looking for input on best corporate cards for startups",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qopmpq/looking_for_input_on_best_corporate_cards_for/",
      "author": "Otherwise-Ear1256",
      "created_utc": "2026-01-27 20:31:23",
      "score": 8,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "We're looking into corporate card options atm and was wondering what founders on reddit had to say. We're a startup of 8 people gearing up to expand our sales team over the next few month. One of the biggest assets that will be mission critical is per card limitations, merchant locks, and the full gamut of advanced spend controls these cards usually have baked in. What options o you know of or used that can be easily deployed across a distributed sales team and cover detailed expense tracking, automatic receipt matching, etc al? It didn't take much digging to figure out that Brex and Ramp are category leaders. So far the latter a better fit for us rn. Any suggestions on how to navigate the corporate card landscape for early stage folks?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qopmpq/looking_for_input_on_best_corporate_cards_for/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o236p8s",
          "author": "Agreeable_Two_8444",
          "text": "> One of the biggest assets that will be mission critical is per card limitations, merchant locks, and the full gamut of advanced spend controls these cards usually have baked in.\n\nRamp. We've been using them for quite a while now and they're great  \nTheir cards are amazing and you can set limits per vendor/merchant as well as budget limit so that employees can use it for specific vendors only. It's easy to integrate it with Quickbooks/Netsuite as well and the receipts are auto matched so it's super easy instead of doing it manually",
          "score": 8,
          "created_utc": "2026-01-27 20:54:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o246ffq",
              "author": "edwinfromramp",
              "text": "unsurprisingly +1. happy to chat more if you want to dive in",
              "score": 2,
              "created_utc": "2026-01-27 23:42:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o26u8uj",
          "author": "thesophisticatedCISO",
          "text": "Ramp and PayEm feel similar on the surface, but they’re optimized for slightly different priorities.\n\nRamp is great if you want something reps adopt instantly and don’t need a lot of nuance in approvals or workflows early on. It’s very “set it and forget it” for basic controls.\n\nPayEm tends to shine once you care more about control and structure. things like tighter per-card rules, approval flows before spend, and cleaner accounting handoff. It’s less rewards-driven and more finance-led, which can actually be a plus as teams scale and spend gets messier.\n\nIf your sales team is growing fast and you want fewer surprises showing up at month end, PayEm is worth a serious look alongside Ramp.",
          "score": 3,
          "created_utc": "2026-01-28 10:13:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o286d5n",
          "author": "z_neonHawk7454",
          "text": "just go with Ramp. Brex got bought and they seem like the only game in town now that's not a trad bank.",
          "score": 2,
          "created_utc": "2026-01-28 15:15:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25colc",
          "author": "drunkmuppet",
          "text": "C suite and sales.  Another vote for ramp. Makes my life easy and keeps my folks out of trouble (within reason). They also can do cards for client events so prospects can spend for uber and incidentals at events you hose",
          "score": 1,
          "created_utc": "2026-01-28 03:23:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26ritp",
          "author": "Chaolik",
          "text": "What's your vertical and GEO?",
          "score": 1,
          "created_utc": "2026-01-28 09:48:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jf2yz",
          "author": "kluxRemover",
          "text": "Just use privacy cards. It’s what I use , I can set whatever limits I want ( amount , merchant , burner cards etc )",
          "score": 1,
          "created_utc": "2026-01-30 03:36:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o264agn",
          "author": "CommonDrive792",
          "text": "At 8 people you shouldn’t need too much complexity. Recommend you keep things simple and only add complexity as you grow.\n\nWe’ve tried both (we’re a bit larger though) and the Ramp experience was a disaster for us. I’m also personally turned off by their leaders and investors on X. We’ve been on Brex for a while now and only great things to say. At your size, consider getting some accounting firm to manage your account (you can likely ask Brex to hook you up).\n\nHope this helps!",
          "score": -4,
          "created_utc": "2026-01-28 06:25:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o288b5i",
              "author": "Icy-Survey7266",
              "text": "Good bot lol all your content is talking bad about Ramp  \nWe've been using them for quite a while now and I can only say good words about them our experience has been flawless and their sales was GREAT at explaining what they actually offer. The whole team's on a free plan but we might be moving to a paid one during Q2  \nRamp is miles ahead of Brex, Brex was literally valued at 12b and recently got acquired for less than half of that amount lol. I 100% think that Ramp's the best corporate card that exists and I will always talk good about a product that I use and that it works especially now when there are so many bad products being marketed",
              "score": 0,
              "created_utc": "2026-01-28 15:24:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2bvipe",
                  "author": "CommonDrive792",
                  "text": "Not sure what’s your problem or why you’re getting so emotional. OP asked for advice and I’m giving a first hand experience. Good for you for your experience, very happy for you. \n\nI couldn’t care less for VC valuations. If anything, Brex’s acquisition put an anchor on how public markets value those companies, and shows how overinflated Ramp’s valuation is. I’d be worried about their ability to survive.",
                  "score": 1,
                  "created_utc": "2026-01-29 01:25:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qq50yx",
      "title": "Traditional OCR vs AI OCR vs GenAI OCR. What actually works for financial docs?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qq50yx/traditional_ocr_vs_ai_ocr_vs_genai_ocr_what/",
      "author": "iliveformyships",
      "created_utc": "2026-01-29 10:27:34",
      "score": 8,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "Financial documents like invoices, statements, and contracts are messy in practice, and no single OCR approach handles everything well.\n\nFrom what I’ve seen across production setups:\n\n• Traditional OCR is fast and predictable, but it struggles once layouts get complex or scans are noisy.\n\n• AI-based OCR handles more variation, though it still needs tuning and validation to stay reliable.\n\n• GenAI approaches can reason through tricky formats, but they are harder to control, more expensive, can hallucinate values and still early for production-critical workflows.\n\nMost real systems end up being a mix of things. OCR plus layout detection, ML models for field extraction, and rules or confidence checks layered on top.\n\nCurious how others in fintech are handling this today. Are you testing GenAI for document extraction yet, or sticking with more traditional approaches?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qq50yx/traditional_ocr_vs_ai_ocr_vs_genai_ocr_what/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o2eqw5t",
          "author": "rkripple12345",
          "text": "Traditional OCRs are tried and tested method ser, AIs cant track when some tricky things occur. Most Big Fintech still depend on Traditional OCRs",
          "score": 1,
          "created_utc": "2026-01-29 13:45:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fgyyr",
              "author": "IrfanCommenter",
              "text": "I have seen the same in a lot of large fintech setups. Traditional OCR is still trusted because it is predictable, especially when combined with strong rules and validation. Newer AI approaches help in edge cases, but most teams seem to layer them on top rather than replace the core OC",
              "score": 2,
              "created_utc": "2026-01-29 15:52:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2g29g8",
                  "author": "Terrible_Comment_690",
                  "text": "Yeah, that matches what I have seen too. Traditional OCR still gives teams more control, and AI tends to get used selectively where rules start to struggle",
                  "score": 1,
                  "created_utc": "2026-01-29 17:27:12",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2gquuo",
                  "author": "Otherwise-Ear1256",
                  "text": "Yeah, I don't see full replacement happening any time soon despite all the hype that there is for it. W need to see a couple fails first in order to learn the best approach forward still.",
                  "score": 1,
                  "created_utc": "2026-01-29 19:18:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2etucv",
          "author": "teroknor92",
          "text": "For data extraction from financial documents such as invoices, documents containing tables, APIs like ParseExtract and LlamaParse work well. However, it’s important to test them with variations of your documents before using them in production. I’m currently using ParseExtract and haven’t encountered hallucination issues for document I work with. Some documents fail with traditional ocr and some with modern GenAI approaches, for example, traditional OCR often confuses $ with 5, and 1 with 7, especially in handwritten documents.",
          "score": 1,
          "created_utc": "2026-01-29 14:00:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g518f",
          "author": "rhizome-compliance",
          "text": "I can't imagine going back to traditional methods now. The AI approach is actually one of the most useful aspects of transformer-based tech, and one of the only truly reliable use-cases. It may or may not be considered expensive, but you have to weigh it against the cost of transcription errors for your business case.",
          "score": 1,
          "created_utc": "2026-01-29 17:39:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gn97m",
          "author": "TapNorth0888",
          "text": "Yes agree with some of the comments, can’t go back to traditional, it’s all AI OCR now and especially GEN. \nThe hallucination is very manageable if you stack several processors with extractors AND validators in a pipeline. \nWe are handling thousands of documents a day through both a lending market place and a stand alone Saas offering built for exactly this, with some of the most complex documents (scanned pages of bank statements and passbooks) and manage to do this with extreme high accuracy",
          "score": 1,
          "created_utc": "2026-01-29 19:01:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kuo09",
          "author": "TheresNoShortcut",
          "text": "I have an app which scans and categorizes receipts and invoices. From my experience traditional OCR is still better in pure recognition for long receipts with a lot of items. All AI models I have tried so far start to hallicinate item prices as soon as there are 30+ items on it. It's getting worse for more items.\n\nOn the other hand, AI catches the context better, e.g. the connection between item names, quantities, and prices, esp. for warped receipts.\n\nLocal models <= 30b are almost not usable for receipts. So there are a lot of privacy concerns using large models in the cloud with financial data, but there are plans where the provider does not use or even store the uploaded data.",
          "score": 1,
          "created_utc": "2026-01-30 10:19:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqc75o",
      "title": "Is tokenization actually disrupting traditional finance or just hype?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qqc75o/is_tokenization_actually_disrupting_traditional/",
      "author": "coffeemakeslife",
      "created_utc": "2026-01-29 15:49:37",
      "score": 8,
      "num_comments": 9,
      "upvote_ratio": 0.91,
      "text": "Working in fintech for the past 5 years and I'm trying to figure out if asset tokenization is real disruption or just blockchain people trying to reinvent the wheel.\n\nThe pitch is compelling: tokenize real-world assets (real estate, equipment, art, whatever), fractionalize ownership, enable 24/7 trading, reduce intermediaries, lower costs. Sounds great on paper.\n\nBut in practice? Most platforms I've seen are either:\n\n1. **Stupid expensive** \\- $50k+ just to tokenize something, which only makes sense for huge deals\n2. **Regulatory nightmares** \\- Nobody knows if this is a security, commodity, or something else\n3. **Liquidity issues** \\- Cool, you tokenized your building... now who's buying these tokens?\n\nThat said, I tested one platform (vestascan.com) that's actually free to deploy tokens and comes with built-in data rooms for compliance docs. The infrastructure is there. You can deploy asset-backed tokens in like 15 minutes.\n\nBut the question remains: **Is anyone actually using this stuff to move real money?**\n\nI'm specifically interested in hearing from fintech folks who've:\n\n* Actually tokenized assets (not just tested)\n* Found real buyers/investors for tokenized products\n* Navigated the regulatory landscape successfully\n* Built sustainable business models around this\n\nBecause right now it feels like we're building infrastructure for a use case that doesn't exist yet. Or am I missing something?\n\n**Genuinely curious** \\- is this the future of asset management or are we 5-10 years too early?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qqc75o/is_tokenization_actually_disrupting_traditional/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o2hj9ey",
          "author": "whatwilly0ubuild",
          "text": "You're not missing anything. The infrastructure-ahead-of-demand observation is accurate.\n\nThe honest state of tokenization is that it works in a few narrow contexts and is mostly premature hype everywhere else.\n\nWhere it actually moves real money. Private credit and fund tokenization for institutional investors is probably the most legitimate use case right now. Franklin Templeton, Hamilton Lane, and similar players are using blockchain rails for fund shares because it genuinely reduces back-office settlement costs. But notice these are sophisticated institutional contexts with existing legal frameworks, not retail investors buying fractionalized art.\n\nThe fractionalization pitch is mostly broken. The idea that regular people will buy $100 slices of commercial real estate sounds great until you realize there's no secondary market, no liquidity, and the legal structure for enforcing ownership rights across jurisdictions is a mess. You've created an illiquid security with extra steps. Our clients exploring this space have found that the buyer base for fractionalized alternative assets is much smaller than the pitch decks suggest.\n\nThe regulatory question isn't \"nobody knows,\" it's \"everyone knows but nobody wants to admit it.\" Most tokenized assets are securities. Full stop. The platforms dancing around this with \"utility token\" framing are building on sand. The ones doing it properly are registering as securities, which means the cost and complexity advantages largely disappear.\n\nThe free deployment tools you mentioned are solving the wrong problem. Creating the token is trivial. The hard parts are legal structuring, ongoing compliance, investor verification, and most importantly finding buyers. A platform that makes deployment free is just shifting where the friction lives.\n\nFive to ten years too early is probably right for mass adoption. The institutional plumbing use case is real now. The retail fractionalization dream needs regulatory clarity that doesn't exist yet.",
          "score": 4,
          "created_utc": "2026-01-29 21:34:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ifvuz",
              "author": "reewona",
              "text": "Agree largely. What I believe is missing is the legal architecture which recognises and confirms the rights which attempt to pass thru tokenised trading. The legal challenge is complex and  multifaceted including jurisdictional issues and enforcement. This will continue to be the brakes on meaningful traction. ",
              "score": 1,
              "created_utc": "2026-01-30 00:21:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fijb3",
          "author": "Darkrayh",
          "text": "Very interesting post.\n\nMost tokenization so far seems to be happening around stablecoins, with private companies launching their own (Fidelity, Société Générale, etc.). For them, this makes sense as a natural continuation of their existing business models.\n\nI’m also curious about your point that it costs at least $50k to tokenize assets, where does that figure come from?",
          "score": 2,
          "created_utc": "2026-01-29 15:58:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fpqhk",
              "author": "coffeemakeslife",
              "text": "Good question. The $50k+ number usually comes from the full stack around tokenization, not just the smart contract.\n\nIn most setups it includes legal structuring, regulatory advice, SPV or wrapper entity setup, transfer agent style processes, compliance policies, custody integration, and custom platform or infrastructure work. For a one off issuer, those fixed costs add up fast, which is why it only makes sense for large deals.\n\nWhat’s changing now is that infrastructure is getting more standardized. Platforms are starting to bundle token deployment, investor onboarding, document management, and permissions into one workflow, so issuers don’t have to rebuild everything from scratch every time. That’s where costs can drop meaningfully.\n\nIn my view, the real value isn’t just cheaper token creation. It’s reducing friction in due diligence, access control, and distribution. That’s where traditional processes are slow and expensive today.\n\nCurious to hear if you’re seeing real production use cases beyond stablecoins in your network.",
              "score": 1,
              "created_utc": "2026-01-29 16:31:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fszvp",
          "author": "naki26",
          "text": "Broadridge has a pretty serious distributed ledger repo product doing trillions in volume but is not a meaningful contributor to revenue for them (which I guess is kind of the point for clients). Tokenizing rwa is great on paper as far as instant settlement removing counter party risk but market still has to be active and it feels like its not the infrastructure that is a problem so much as the assets themselves (as you pointed out). Would also check out Figure, who is building some interesting stuff with their OPEN network, which for private credit i think there actually is an infrastructure gap vs equities trading",
          "score": 2,
          "created_utc": "2026-01-29 16:45:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2m5hot",
              "author": "SilkenicDud",
              "text": "I think this hits the nail on the head. Tech's not the issue anymore; it's about getting things out there, dealing with the rules, and whether people actually want what's being offered. Tokenization is obviously useful when it fixes a problem in the market, like with repurchase agreements, private credit, or quicker settlements. But for things like real estate or art? You're not really making things more liquid; you're just changing the shape of something that's hard to sell and hoping someone buys it. Unless big players are ready to hold and trade these tokens big time, it'll stay a small thing or just part of the behind-the-scenes stuff, not a big money-maker. That’s why it seems like the real stuff is going on quietly in the background with infrastructure and payments, not with all the fancy tokenize everything talk. It's also where you see actual connections being made between regular finance and crypto, like those regulated fintech things that handle both regular money and crypto. That’s partly why I’ve been keeping an eye on stuff like blackcatcard. They're not about the hype; they're about making these systems actually useful every day",
              "score": 1,
              "created_utc": "2026-01-30 15:12:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2mb06z",
          "author": "DeFiNomad",
          "text": "I think you’re asking the *right* question. Most tokenization pitches ignore the exact frictions you mention: cost, regulation, and, most importantly, liquidity.\n\nFrom what I’ve seen, tokenizing *random* assets rarely works. Fractionalization without real demand just creates illiquid pieces.\n\nWhere it *does* start to make sense is tokenizing **assets that already have massive off-chain demand but are inaccessible to most people**. A recent example is Hecto Finance, which is tokenizing exposure to large private companies (SpaceX-type assets). These are already liquid in private markets, the token becomes the access layer.  \nContext: [https://crypto.news/hector-turns-largest-private-companies-public-tokens/](https://crypto.news/hector-turns-largest-private-companies-public-tokens/?utm_source=chatgpt.com)\n\nThat changes the equation: demand exists first, infrastructure second.\n\nMy takeaway after working in fintech/crypto: Tokenization isn’t about “putting everything on-chain.” It’s about **unlocking access to markets people are currently priced out of**.\n\nCurious if others here have seen real buyers, not just pilots.",
          "score": 1,
          "created_utc": "2026-01-30 15:37:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2md8o2",
          "author": "Visa5e",
          "text": "New solutions to old problems will only be succesful if the incremental improvement justifies ripping up things that are already proven to work.\n\n  \nPut simply, is tokenisation amazing enough to justify the risk of starting again?\n\nProbably not.",
          "score": 1,
          "created_utc": "2026-01-30 15:47:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mtsg2",
          "author": "Anton_Grin",
          "text": "This is truly a paradigm shift and the future of finance, but)))...\n\nThe industry is approaching this through a backdoor...\n\nThe technology has been tested, but real-world cases are few and far between and bear no resemblance to what was discussed even 10 years ago.\n\n\n\nFracturing and so on are just minor pleasantries; the most important thing is future settlements in tokenized ecosystems.\n\nRegulations can already be said to be well-developed, but they have effectively equated these instruments to the level of IPOs, and they are only available to serious players and large businesses.\n\nFree systems and platforms offer a wrapper, but not all-inclusiveness, and this is the wrong approach.\n\n\n\nAt the same time, large banks are testing the tokenization of collateral and other instruments on their platforms. The industry doesn't want to give up its position, but it's inevitable.",
          "score": 1,
          "created_utc": "2026-01-30 17:01:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnuz2a",
      "title": "Why did fintech emerge and what problem did they really come to solve?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qnuz2a/why_did_fintech_emerge_and_what_problem_did_they/",
      "author": "Pepe_Turbo",
      "created_utc": "2026-01-26 22:18:56",
      "score": 6,
      "num_comments": 12,
      "upvote_ratio": 0.88,
      "text": "Greetings community!\n\nLately I hear the term fintech a lot, but I feel it's often used without explaining the context.\n\nFrom their origin, fintech emerged to solve very specific problems: limited access to credit, slow processes, lack of transparency, etc.\n\nIn your experience, do you believe that fintech today is actually solving those problems or just changed the channel?\n\nI'm interested in reading your different points of view.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qnuz2a/why_did_fintech_emerge_and_what_problem_did_they/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o22odur",
          "author": "tsurutatdk",
          "text": "Fintech mainly emerged to reduce friction in moving money: faster, cheaper, more accessible payments and credit. Some of it is real progress, some is just a new UI on old rails.\n\nCrypto payments can be real progress when merchants actually use it. xMoney is one example I consider because it focuses on merchant adoption and compliance.",
          "score": 2,
          "created_utc": "2026-01-27 19:32:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29lqiy",
              "author": "Otherwise-Ear1256",
              "text": "It feels like it's taken forever for merchants to adapt crypto, even though I get why it still feels like we're moving at such a slow pace that we might not get there at all.",
              "score": 2,
              "created_utc": "2026-01-28 18:58:06",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2hrbzt",
              "author": "Pepe_Turbo",
              "text": "That 'new UI on old rails' line is a brutal reality check. It’s like putting a Ferrari body over a lawnmower engine—it looks sleek until you realize the plumbing underneath is still from the 70s. I think you hit the nail on the head with merchant adoption, too. At the end of the day, it doesn't matter how 'revolutionary' a tech is if the person selling me a coffee thinks it's a headache to use.\n\nFocusing on compliance (like you mentioned with xMoney) is usually the 'boring' part that actually makes or breaks crypto for real-world use. Do you think we’ll ever truly replace the 'old rails,' or are we just going to keep building layers on top of them forever?",
              "score": 1,
              "created_utc": "2026-01-29 22:12:29",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2i12ne",
              "author": "payments_ops",
              "text": "I would say it’s less about a single catastrophic failure and more about cumulative exposure. Big, headline-grabbing events tend to accelerate attention, but incentives really change when the cost of ambiguity becomes routine rather than exceptional , repeated enforcement actions, partnership breakdowns, insurance refusals, and personal liability creeping closer to decision-makers.\nRegulators usually don’t need to get ahead in a visionary sense; they just need enough concrete cases where responsibility can’t be cleanly assigned. Once that happens often enough, expectations harden and behaviours shift.",
              "score": 1,
              "created_utc": "2026-01-29 23:01:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o27fmmm",
          "author": "oftgefragt_dev",
          "text": "i wanna approach from a different angle. most times in fintech, you need to make the user aware of what they need. bc the goal is making every process, every action safer, smoother, quicker. and you, as the person who makes the tech, are aware of the potential of it. if we only waited for people to demand the exact product, there would be no fintech today",
          "score": 2,
          "created_utc": "2026-01-28 12:56:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hqp8k",
              "author": "Pepe_Turbo",
              "text": "That’s a great point. It’s the classic 'faster horse' argument—if we only built what people asked for, we’d still be waiting 3 days for a wire transfer just because we were used to it. Fintech definitely pushed us to realize that the 'old way' was actually broken, not just slow.\n\nBut honestly, do you think there's a risk of over-engineering things? Sometimes I wonder if we’re solving real friction or just creating 'needs' for features that look cool in a demo but don't actually change the user's life.\n\n",
              "score": 1,
              "created_utc": "2026-01-29 22:09:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1zdsdt",
          "author": "payments_ops",
          "text": "Early fintech solved access and speed problems that traditional finance struggled with. What it didn't fully solve was accountability once systems scaled- who owned decisions, how intent was recorded, and how failures were explained after the fact.\n\nA lot of the tension we see now feels less like fintech failing and more like the ecosystem catching up to the responsibility that faster, more abstracted systems created.",
          "score": 1,
          "created_utc": "2026-01-27 08:26:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21ouc9",
              "author": "Pepe_Turbo",
              "text": "Spot on. That 'abstraction' part is exactly what makes it so frustrating when things break. We basically traded the slow, grumpy bank manager for a sleek app that—let’s be honest—often feels like talking to a brick wall when you actually need a human to own a mistake. We got the speed, but we lost the 'who do I talk to?' part.\n\nDo you think any of the big players are actually trying to fix this accountability gap, or is 'blaming the algorithm' just the new industry standard?",
              "score": 1,
              "created_utc": "2026-01-27 16:59:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o21qhve",
                  "author": "payments_ops",
                  "text": "I don’t think most big players are ignoring it, but I also don’t think they’re incentivised to fix it yet. Speed, scale, and cost reduction still win internally, and accountability tends to show up as a downside only when something goes wrong.\n“Blaming the algorithm” works until it doesn’t — usually when a regulator, partner, or court asks who actually owned the decision at the time. My sense is we’re in an awkward transition phase where abstraction delivered real gains, but the social and legal expectations around ownership haven’t fully caught up.\nIt feels less like bad intent and more like unresolved responsibility.",
                  "score": 2,
                  "created_utc": "2026-01-27 17:06:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qq1tag",
      "title": "What's actually the best Web3 Payment Card in 2026, P2P is getting me headaches.",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qq1tag/whats_actually_the_best_web3_payment_card_in_2026/",
      "author": "Rahul_2503",
      "created_utc": "2026-01-29 07:14:22",
      "score": 6,
      "num_comments": 19,
      "upvote_ratio": 0.76,
      "text": "I am in crypto since 2017 and earlier it was easy to cash out the crypto, but with recent rules and regulations its tough to do P2P and also exchanges are doing absurd things with blocking accounts. Frankly speaking I'm tired of the whole routine, move to exchange, convert to fiat, pay fees, wait for withdrawal, then actually spend it.\n\nThe main things i am looking in the crypto card is\n\nIt should work anywhere globally with no hidden cost, doesn't charge insane conversion fees.\n\nIt should let me spend my cryptos for daily needs without moving at multiple places. Card should be powered by Visa. In app will be a bonus.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qq1tag/whats_actually_the_best_web3_payment_card_in_2026/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o2doxb9",
          "author": "Front_Essay3056",
          "text": "I’ve been in the same situation, moving crypto around, waiting for withdrawals, dealing with P2P risks. I’ve started using Orbit X Pay, and it lets you spend crypto directly with a Visa card. Makes things way simpler and less stressful.",
          "score": 1,
          "created_utc": "2026-01-29 08:59:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dq0sq",
              "author": "Rahul_2503",
              "text": "Can u send me more info about Orbit X and its key USPs",
              "score": 1,
              "created_utc": "2026-01-29 09:09:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2dqy8s",
          "author": "web_30",
          "text": "P2P is the biggest scam happening specially in Nigeria and India. It's time to ditch all these traditional banking system, where they just freeze our accounts without our consent. All thanks to OrbitX which has given me freedom to use my crypto anytime anywhere. Visa Powdered Signature and Platinum card is just what web3 industry is currently in need off to ditch the traditional banking.\nLet's use OrbitX Pay cards for your all your daily needs and it will also help you getting scammed from P2P. Do check orbitxpay.com",
          "score": 1,
          "created_utc": "2026-01-29 09:18:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2erw8x",
              "author": "Rahul_2503",
              "text": "Interesting take, Orbit X - I checked their website super clean. Card is powered by Visa and app is available on android and IOS too. Still going through the docs to understand better, thanks for the suggestions.",
              "score": 1,
              "created_utc": "2026-01-29 13:50:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ds9n1",
          "author": "martin_call",
          "text": "Nova card from Whіtebit",
          "score": 1,
          "created_utc": "2026-01-29 09:31:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2duene",
              "author": "Rahul_2503",
              "text": "Can u list it features ser",
              "score": 1,
              "created_utc": "2026-01-29 09:51:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2dubba",
          "author": "OwlPay_Wallet_Pro",
          "text": "What about gift cards? Convert USDC into gift cards right inside your wallet, then use them for everyday spending like coffee, clothes, and more.",
          "score": 1,
          "created_utc": "2026-01-29 09:50:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2duhyi",
              "author": "Rahul_2503",
              "text": "Gift cards i have used but it comes with limits bro",
              "score": 2,
              "created_utc": "2026-01-29 09:51:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2jp22z",
                  "author": "OwlPay_Wallet_Pro",
                  "text": "You’re right, gift cards can come with more restrictions, but they also often have 5–10% discounts. Cards and gift cards both work, it just depends on how you like to spend.",
                  "score": 1,
                  "created_utc": "2026-01-30 04:37:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2eljsh",
          "author": "pump_machine",
          "text": "Nice question raised, today exchanges are also doing the dirty tricks to hold the accounts incase of p2p scams. I think we need a smart web3 banking solution for nearby futures, where we can store crypto with peace and get real yields and spend crypto for daily needs.",
          "score": 1,
          "created_utc": "2026-01-29 13:16:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2es0uc",
              "author": "Rahul_2503",
              "text": "Based on the suggestions you should check Etherfi and Orbit X pay cards",
              "score": 1,
              "created_utc": "2026-01-29 13:51:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2erjhd",
          "author": "rkripple12345",
          "text": "I too got scammed by P2P and also Kucoin froze my funds but after that i mostly depends on crypto cards. Today i am using 2 cards - Etherfi cards for yields and Orbit X Pay card for daily needs. Both are having good tech with amazing features. I suggest you to look into those cards for your needs.",
          "score": 1,
          "created_utc": "2026-01-29 13:48:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hk402",
              "author": "Otherwise-Ear1256",
              "text": "Jesus, did they at least give a reason as to why they froze your stuff?",
              "score": 1,
              "created_utc": "2026-01-29 21:38:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kf8oj",
          "author": "tornavec",
          "text": "Yes, I'm aware of that handy card",
          "score": 1,
          "created_utc": "2026-01-30 07:59:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp5zse",
      "title": "Everything founders should know about Card as a Service before launching debit or prepaid programs",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qp5zse/everything_founders_should_know_about_card_as_a/",
      "author": "Mother_Network9453",
      "created_utc": "2026-01-28 08:41:01",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "\n\nCard as a Service often looks straightforward. You see a few APIs, a dashboard, and a promise that cards can go live in weeks. That surface level simplicity hides a lot of complexity underneath.\n\nLaunching a debit or prepaid card is not just a product decision. It is a regulatory and operational commitment.\n\nOne thing founders learn late is that Card as a Service is not mainly about technology. The real work happens in partnerships, approvals, and ongoing compliance. APIs help you issue cards but they do not protect you when something goes wrong.\n\nYour issuing bank will shape your product more than most people expect. Limits, usage rules, dispute processes, and even where your cards can be used are often bank driven. If the partnership is restrictive, your roadmap becomes restrictive too. This is why understanding who owns the BIN, who holds customer funds, and how flexible the setup is really matters.\n\nDebit and prepaid cards are not interchangeable. Prepaid programs come with caps, reload rules, and tighter controls. Debit cards require deeper integration with banking systems and stronger compliance oversight. Treating them as similar products is one of the most common early mistakes.\n\nCompliance is not something you finish during onboarding. KYC approval is just the starting point. Transaction monitoring, chargebacks, audits, and regulatory reporting continue for as long as the program is live. Many programs get paused not because of fraud, but because of missed processes.\n\nCard networks add another layer founders often overlook. Visa and Mastercard have their own rules and monitoring. You can be compliant with your bank and still be in violation of network requirements. When that happens, the impact is immediate and painful.\n\nThen there is the money side. Fees add up fast. Interchange sharing, network costs, bank fees, fraud losses, and disputes all affect margins. Without clear unit economics, it is possible to grow users and still lose money on every transaction.\n\nOwnership is another quiet issue. Who controls customer data, card inventory, approvals, and compliance relationships will decide how easy it is to raise funds or expand to new markets later. Speed to launch is tempting, but control matters more in the long run.\n\nMost card programs do not fail because the product is bad. They fail because founders assumed someone else was handling the hard parts.\n\nCard as a Service can be powerful when used with clarity and patience. But it works best for founders who treat it as regulated infrastructure, not a shortcut.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qp5zse/everything_founders_should_know_about_card_as_a/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o26yet1",
          "author": "Ok-Influence-7707",
          "text": "The only companies making money on card issuing are the BIN owners and the processors they work with.\n\nThe market is flooded with \"card as a service' these days, it's hard to differentiate your product. Unless you have a 20,000 user corporate plan, for example.",
          "score": 1,
          "created_utc": "2026-01-28 10:50:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27ehtc",
              "author": "Mother_Network9453",
              "text": "You’re right that BIN owners and processors capture most of the *direct* issuing economics. For many programs, issuing itself is closer to a cost center than a profit engine.\n\nWhere some teams miscalculate is assuming “card issuing” *is* the product. In reality, the defensibility usually comes from what wraps around it. distribution, compliance ownership, underwriting logic, or a very specific workflow the card enables.\n\nThe CaaS saturation you mention is real. Without a clear ICP and volume anchor, like your 20,000 user corporate example, margins get crushed fast. The few programs that work long term tend to start with a non card pain point and use the card as an enabler, not the value prop.\n\nCurious to see whether more issuers move toward vertical specific use cases rather than generic issuing stacks. That feels like one of the few remaining ways to differentiate.",
              "score": 1,
              "created_utc": "2026-01-28 12:49:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27rvyv",
          "author": "kubrador",
          "text": "basically if you launch a card program thinking it's just slapping an api together, you'll learn real quick that the actual work is begging your bank not to freeze everything while mastercard audits you for fun",
          "score": 1,
          "created_utc": "2026-01-28 14:04:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ctcxx",
              "author": "Mother_Network9453",
              "text": "100% this. The API is the easy part.  \nThe real work is governance, controls, and proving to the bank and network that you won’t blow up their risk model.  \nMost “card programs” fail not at launch, but at the first audit, dispute spike, or compliance review they didn’t design for.",
              "score": 1,
              "created_utc": "2026-01-29 04:42:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qn8hgg",
      "title": "Equity researchers: What's broken about using AI for stock research?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qn8hgg/equity_researchers_whats_broken_about_using_ai/",
      "author": "Deep_Ladder_4679",
      "created_utc": "2026-01-26 06:33:01",
      "score": 5,
      "num_comments": 32,
      "upvote_ratio": 1.0,
      "text": "Talked to an analyst friend who said ChatGPT/Perplexity are basically useless for stock research, unreliable sources, messy data outputs, no control over what gets pulled.\n\nDoes this match your experience? What parts of research are most painful right now?\n\nGenuinely curious what the real problems are.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qn8hgg/equity_researchers_whats_broken_about_using_ai/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o25jm89",
          "author": "khantrade",
          "text": "Yeah your friend's right, the generic AI tools are kinda trash for this because they pull from anywhere and don't actually understand financial data context. The real pain is you end up fact-checking everything anyway which defeats the purpose. Honestly if you want something that actually works, you need a tool that's built specifically for markets and pulls from real sources like SEC filings and actual exchange data instead of just scraping the internet, which is why something like Lattice actually solves this problem way better than ChatGPT ever will.",
          "score": 2,
          "created_utc": "2026-01-28 04:03:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o25zoc2",
              "author": "Deep_Ladder_4679",
              "text": "Yes, you got it right after considering this i have developed a platform where you just pass the query and sit relax and our AI agent will get all the information by performing deep research for you in proper format and at the end you can generate reprt in pdf or doc format and you can share as well.",
              "score": 1,
              "created_utc": "2026-01-28 05:49:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1sa2zo",
          "author": "Individual-Artist223",
          "text": "You friend is wrong - I could get AI doing all that.",
          "score": 2,
          "created_utc": "2026-01-26 08:26:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1sellv",
              "author": "Deep_Ladder_4679",
              "text": "Can you give some insight into how do you use it in your workflow",
              "score": 2,
              "created_utc": "2026-01-26 09:07:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1sm156",
                  "author": "Individual-Artist223",
                  "text": "Tell me what you normally do / what you want done, I'll tell you how AI can get it done.",
                  "score": 1,
                  "created_utc": "2026-01-26 10:15:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1smqc3",
          "author": "KimchiCuresEbola",
          "text": "Sell-side or buyside? The problem that I have with people pitching \"AI for stock research\" is that most people don't have domain expertise in investing.\n\nFor a sell-side analyst, putting out research reports (and their quality) is just about the least important part of what they do. A research analyst (aside from the weird European MiFID rules) does not drive revenue to the firm by putting out good research. They drive revenue to the firm by having the best coverage of companies (for quickest updates and NDRs). The guy/gal who covers and researches Nvidia really well isn't going to get business over the researcher who is best connected to the entire c-suite at Nvidia and can easily get an investor roadshow for his/her clients at any time.\n\nFor buy-side, discretionary, fundamental single-stock picking firms are pretty much dead at this point. No one is pitching stocks to allocate 10% of a portfolio into anymore (and haven't for well over a decade). I'm sure you could use AI for some orchestration over proprietary quant tools, but that would require building a full quant infrastructure first before the AI stuff.",
          "score": 1,
          "created_utc": "2026-01-26 10:21:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1swejx",
              "author": "myztaki",
              "text": "What do you mean by \"discretionary, fundamental single-stock picking firms\" being dead? Because this is simply not true, I agree that quant-strategies have grown more popular but fundamental is far from dead",
              "score": 2,
              "created_utc": "2026-01-26 11:43:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1t1mzq",
                  "author": "KimchiCuresEbola",
                  "text": "Equity l/s has been absolutely decimated the past several years (100's of billions in outflows)  \nMany equity market neutral firms have joined multi-strats as pods  \nFundamental value has been dead since GFC  \nActivist was popular for a while, but tbh haven't heard anything in years  \nDiscretionary long-only has had years of outflows.\n\nPerhaps dead is a bit of an exaggeration, but most of the folks I know in the space are now at firms/pods that require factor neutral (moving into quant territory) and very few opportunities left in old school discretionary fundamental.",
                  "score": 2,
                  "created_utc": "2026-01-26 12:23:11",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1tkwpj",
                  "author": "Deep_Ladder_4679",
                  "text": "Fundamental is not dead.",
                  "score": 1,
                  "created_utc": "2026-01-26 14:16:08",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1tkr7e",
              "author": "Deep_Ladder_4679",
              "text": "I mean, be it buy side or sell side, if you want to make any decision, you need data, and you can not go to different places to go and collect the information you need, which you can do, but it will be time-consuming, and you will be overwhelmed with lots of data, sometimes prone to err. To reduce that AI does the work for you, and that is left for you to analyse and make a decision.",
              "score": 1,
              "created_utc": "2026-01-26 14:15:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1tm9wj",
                  "author": "KimchiCuresEbola",
                  "text": "Nobody serious is willy-nilly \"go\\[ing\\] to different places to go and collect the information you need\". There are established data pipelines/ETL processes and data warehousing for a reason. \n\nThe only places I can think that AI could possibly help is with some of the grungy code for setting up alternative data pipelines, but it's (yet or possibly ever) going to, at scale, both figure out where the data is and autonomously scrape that data.",
                  "score": 1,
                  "created_utc": "2026-01-26 14:23:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1z736c",
          "author": "oftgefragt_dev",
          "text": "The reason these tools could be claimed to be \"useless\" is due to their far-fetched accessibility. Non-scarcity simply ruins the edge of a strategy. Yes, it provides data. But there is no scenario where everyone makes a profit. Still, with a person-centred approach, using AI to get a clearer market sentiment is beneficial. \n\nBesides this, speed is the #1 case where AI completely surpasses human capability through automation.",
          "score": 1,
          "created_utc": "2026-01-27 07:26:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1z8cxg",
              "author": "Deep_Ladder_4679",
              "text": "So that is what i am saying that for gathering reliable information through AI is good but at the end decision should be your yours.Only time that you will spend on critical decision without worring about info you need.",
              "score": 2,
              "created_utc": "2026-01-27 07:37:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1z90pb",
                  "author": "oftgefragt_dev",
                  "text": "The decision can be made by the ai .Just not an ai that makes the same decision for everyone. There are many organizations that let ai do the decision-making , but the difference is those models are not open to just any random person of public.",
                  "score": 1,
                  "created_utc": "2026-01-27 07:43:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1zd6da",
          "author": "dataflow_mapper",
          "text": "yeah that tracks with what i’ve seen. the big issue isnt “intelligence”, it’s trust and traceability. equity research lives and dies on knowing exactly where a number came from and why it changed. llms are bad at that.\n\nthey’re useful for summarizing filings, drafting notes, or sanity checking assumptions, but not as a source of truth. the painful parts are still cleaning data, reconciling diff sources, and understanding edge cases in comps or guidance. until ai can show its work cleanly and consistently, most analysts wont let it anywhere near core models.",
          "score": 1,
          "created_utc": "2026-01-27 08:21:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o201jog",
              "author": "Deep_Ladder_4679",
              "text": "But considering the same scenario i have deveoped deep research specifically for equity research better than existing one in accuracy, verifiable source, data structure format and no hallucination.",
              "score": 1,
              "created_utc": "2026-01-27 11:55:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2063vc",
          "author": "kubrador",
          "text": "ai hallucinates filings like it's writing fanfiction. your friend's right. it'll confidently cite a non-existent earnings call or invent competitor market share that sounds plausible enough to waste 3 hours fact-checking.\n\nfor actual work, people are using ai to summarize already-vetted sources or clean data, not as the source itself. the painful part isn't the ai, it's that your research workflow is still 70% \"is this information real\" which ai made worse, not better.",
          "score": 1,
          "created_utc": "2026-01-27 12:28:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmj0cz",
      "title": "If Veriff is off the table for risk reasons, what’s your go to identity verification alternative?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qmj0cz/if_veriff_is_off_the_table_for_risk_reasons_whats/",
      "author": "thomasclifford",
      "created_utc": "2026-01-25 13:23:44",
      "score": 5,
      "num_comments": 10,
      "upvote_ratio": 0.86,
      "text": "We’re currently live with identity verification and reassessing vendors after an internal risk review, with the goal of understanding practical downsides and their impact on conversion rather than feature checklists.\n\nCurrent shortlist and the main concern we are trying to validate for each:\n\nJumio. Cost at scale and whether pricing pressure outweighs conversion gains in practice.\n\nOnfido. False rejection rates and demographic skew under real world traffic.\n\nAU10TIX. Limited first hand production data on approval rates, operational overhead, and audit handling.\n\nSumsub. Dashboard usability, reporting depth, and consistency of support during incidents.\n\nAt this stage, main priority is keeping our funnel flowing while staying compliant. What are you running in prod? Looking for honest feedback on what's working and what flops.\n\nedit: An internal risk review raised questions around certain data flows and threat models, particularly in light of recent industry events.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qmj0cz/if_veriff_is_off_the_table_for_risk_reasons_whats/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o1m50oj",
          "author": "ducster",
          "text": "What's wrong with Veriff?",
          "score": 4,
          "created_utc": "2026-01-25 13:32:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1m6ncf",
          "author": "artur5092619",
          "text": "Probably reframe the question from which vendor is best to where does conversion break. \n\nA lot of the issues shows up outside pure ID accuracy. Retry logic, error messaging, and how gracefully edge cases fall back to manual review often matter more than headline pass rates. \n\nAlso worth testing how each provider behaves under peak load and during incident response.",
          "score": 2,
          "created_utc": "2026-01-25 13:42:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1m930i",
          "author": "Bitter-Ebb-8932",
          "text": "One thing that helped cut through the noise was separating conversion impact from operational drag. Some vendors look strong on approval rates, but that story falls apart once edge cases pile up, overrides become routine, and rejection logic gets hard to explain. \n\nThe real cost shows up later as QA load, support churn, and audit friction. Looking at retry behaviour, re-submission patterns, and how explainable decisions still are months down the line surfaces meaningful differences much faster than any demo ever will.",
          "score": 2,
          "created_utc": "2026-01-25 13:56:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mbq66",
          "author": "theironcat",
          "text": "From a compliance standpoint, the biggest differences show up months later during audits. \n\nSome platforms make it easy to reconstruct a decision with clean evidence and timestamps. Others technically pass users but leave gaps that turn into painful remediation work. \n\nAnd that long tail cost rarely shows up in early pilots but matters a lot in production.",
          "score": 1,
          "created_utc": "2026-01-25 14:11:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mcxwx",
          "author": "heromat21",
          "text": "We're on au10tix currently, switched about 8 months ago. Pass rates did improve compared to our last vendor, which was the main driver for the switch. Integration was straightforward, took about two weeks for mobile SDK. Dashboard covers what you need for monitoring rejection reasons and pass rate trends. Support has been responsive when we've needed policy tuning for new markets. Audit documentation they provide matches what compliance teams actually ask for, which saves time. \n\nMain thing is you'll need to invest upfront in configuring territory specific policies if you operate globally, but that's standard for any platform handling multiple jurisdictions.",
          "score": 1,
          "created_utc": "2026-01-25 14:17:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1me7vv",
          "author": "Pristine-Judgment710",
          "text": "Before asking about conversion, ask what breaks under stress because the real test is incident handling: delayed responses, partial outages, or policy misfires in one geography. Asking how a vendor handled its last serious incident and what changed afterward usually tells you more than any approval rate slide.",
          "score": 1,
          "created_utc": "2026-01-25 14:24:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mfmih",
          "author": "Spare_Discount940",
          "text": "At this stage, is less about which vendor is best and more of where does identity verification stop being a competitive edge. Spending cycles debating false rejects weekly, it becomes a distraction. \n\nThe strongest setups tend to fade into the background and only surface when something genuinely unusual happens.",
          "score": 1,
          "created_utc": "2026-01-25 14:32:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rfe23",
          "author": "Global-Tradition-318",
          "text": "Ran into this exact problem last year. The tricky part isn't the vendor features—it's what breaks at 2am when you're processing 10x normal volume and support is slow to respond.\n\nFwiw we saw Onfido's false rejection rates spike hard on certain passport types (older Indian documents were rough). Jumio's pricing did get painful past about 50k verifications monthly, but their uptime was solid.\n\nHonestly might be worth testing a newer player if cost is a concern. We're running Owl Eyes now—ballpark 50-70% cheaper than what we paid Onfido, and the pass rates are comparable. Not perfect but the API is dead simple and they don't gate you behind sales calls. Caveat being we're only at about 15k verifications monthly so your mileage may vary at scale.\n\nThe gotcha is always how they handle edge cases. Can you easily override? Does manual review actually work? Those questions matter more than the demo.",
          "score": 1,
          "created_utc": "2026-01-26 04:31:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnn3tm",
      "title": "Why is global payment access still so fragmented by geography?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qnn3tm/why_is_global_payment_access_still_so_fragmented/",
      "author": "ChoiceStrong6035",
      "created_utc": "2026-01-26 17:47:26",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 0.73,
      "text": "Something I keep running into when building or evaluating payment flows is how uneven access still is depending on geography. Stripe, ACH, Plaid, and even basic card issuance work well in some regions and are effectively unavailable in others.\n\nThis becomes more obvious when looking at regions like the Middle East, where local currencies and banking rails add another layer of complexity. I noticed this recently while reviewing how WasabiCard approaches regional payment access, particularly around AED and SAR support, which highlighted how uncommon proper local coverage still is.\n\nFor people working in fintech, do you see this fragmentation as mainly regulatory, banking driven, or a risk tolerance issue from providers themselves? And do you think this gap is actually shrinking, or just shifting between regions?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qnn3tm/why_is_global_payment_access_still_so_fragmented/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o1v2sj1",
          "author": "Visa5e",
          "text": "Because cross border involves settlement which involves FX, which involves multi jurisdictional compliance and screening.\n\nWhich is hard.",
          "score": 10,
          "created_utc": "2026-01-26 18:16:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wwnpe",
          "author": "0xmerp",
          "text": "ACH is a US-specific payment method, so that was never going to work anywhere but the US, just like Interac doesn’t work outside of Canada.",
          "score": 3,
          "created_utc": "2026-01-26 23:08:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zbvq7",
          "author": "payments_ops",
          "text": "fragmentation often looks geographic, but in practice it's about risk visibility. Rails tend to be cautious where they can't clearly reconstruct intent, responsibility and failure paths. Systems that make those explicit tend to see fewer hard boundaries over time, even if the underlying rails remain fragmented.",
          "score": 1,
          "created_utc": "2026-01-27 08:09:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zrbqy",
          "author": "Careful-Cup4161",
          "text": "Cross-border payments require settlement, which inevitably involves FX, that’s exactly why we’re solving this through stablecoin orchestration.",
          "score": 1,
          "created_utc": "2026-01-27 10:31:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}