{
  "metadata": {
    "last_updated": "2026-02-14 02:59:58",
    "time_filter": "week",
    "subreddit": "fintech",
    "total_items": 11,
    "total_comments": 37,
    "file_size_bytes": 61136
  },
  "items": [
    {
      "id": "1r2zrd4",
      "title": "Moved from seed stage to series B",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r2zrd4/moved_from_seed_stage_to_series_b/",
      "author": "Pale-Plant-3495",
      "created_utc": "2026-02-12 17:33:57",
      "score": 92,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "My new job at a series B is different(by a lot) from the seed stage companies I worked at before  \n  \nThere's 120 people here and everything has actual structure. My previous places had 40 people MAX and you'd just figure things out as you went  \n  \nOnboarding was 2 weeks with actual training instead of someone showing me where slack is and good luck. There's an org chart that makes sense and product roadmap instead of whatever the founders decided that week  \n  \nEngineering has processes now too. PR reviews aren't just whoever's around like there's sprint planning and we don't push to prod on Fridays(sounds basic but coming from seed stage chaos it feels almost corporate)  \n  \nHiring takes multiple rounds and forever compared to the week long process I'm used to but people fit their roles instead of everyone doing everything  \n  \nI didn't expect the jump to feel this big with way more meetings and process but things move faster because nobody's constantly figuring out what we're even doing  \nI am very happy with my current state here and I would love to hear if you guys who have transitioned similarly to me/from seed to series B feel the same  \nShare your experiences",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r2zrd4/moved_from_seed_stage_to_series_b/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o50me5q",
          "author": "subtle_violation",
          "text": "I feel the same way as u man I remember starting at a seed company and it was like here's your laptop figure it out. Series B actually had documentation and training sessions and people whose job was to help new hires get set up",
          "score": 3,
          "created_utc": "2026-02-12 17:43:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50vvck",
              "author": "Past_Cherry6520",
              "text": "It's not just onboarding either when I got into it finance had systems too instead of the usual chaos. Everyone has corporate cards with Ramp at my new place so you can just buy what you need without the whole personal card reimbursement shit I dealt with at seed companies",
              "score": 3,
              "created_utc": "2026-02-12 18:26:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54u32f",
                  "author": "KimchiCuresEbola",
                  "text": "Personal card reimbursement is a pro, not a con!\n\nRack up those hotel/airline miles when you can!",
                  "score": 1,
                  "created_utc": "2026-02-13 08:55:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o50lj15",
          "author": "Successful-Fan-2584",
          "text": "Went the opposite direction recently I left a series B for a seed company and I miss the structure way more than I thought I would",
          "score": 2,
          "created_utc": "2026-02-12 17:38:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50oiiz",
          "author": "TartSarcasm",
          "text": "Do you miss anything about the seed stage or is it all better at series B",
          "score": 2,
          "created_utc": "2026-02-12 17:52:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50w2xe",
              "author": "Pale-Plant-3495",
              "text": "The chaos 100%",
              "score": 1,
              "created_utc": "2026-02-12 18:27:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o50mt6i",
          "author": "Royal-Can9032",
          "text": "I made this jump last year and the hardest part was adjusting to how slow decisions feel even though they're probably better decisions. took me like 3 months to stop being frustrated by it",
          "score": 1,
          "created_utc": "2026-02-12 17:45:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53iva2",
          "author": "KimchiCuresEbola",
          "text": "It's good to see different types of companies and see how all of the run\n\nSeed has pros and cons. Series B has pros and cons. SMBs have pros and cons. Massive corporations have pros and cons.",
          "score": 1,
          "created_utc": "2026-02-13 02:47:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54owyl",
              "author": "Sorry_Still_8881",
              "text": "Yes, it's better to have such experience before he know which is good",
              "score": 1,
              "created_utc": "2026-02-13 08:07:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o53v9v5",
          "author": "JasonDai404",
          "text": "Large and small companies each have their own advantages and disadvantages. Learn from their strengths and improve yourself.",
          "score": 1,
          "created_utc": "2026-02-13 04:07:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54t07g",
          "author": "Ok-Introduction-2981",
          "text": "Difference between survival and scale, you now move slower to move faster.",
          "score": 1,
          "created_utc": "2026-02-13 08:45:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0a6k0",
      "title": "Quick thought on cashback design: Assets vs Straight cash",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r0a6k0/quick_thought_on_cashback_design_assets_vs/",
      "author": "Ordinary_Horse9984",
      "created_utc": "2026-02-09 17:18:25",
      "score": 35,
      "num_comments": 15,
      "upvote_ratio": 0.7,
      "text": "Been thinking about how cashback actually works from a product POV.  \nWith normal cards it’s dead simple: Spend > fixed rebate > done. Predictable, boring, no choices.  \nWhen rewards are paid in an asset instead, the dynamic changes a bit. You can sell immediately and treat it like normal cashback, or hold and take some volatility for potential upside. Same spend, different risk profile.\n\nWhat’s interesting is that each transaction creates a tiny, user-controlled exposure funded by spend that was happening anyway. That seems to change how people perceive rewards vs points or cash equivalents. I tracked this casually for a bit and the realized value ended up drifting from the headline rate just based on timing decisions. Obviously cuts both ways, and volatility/taxes/liquidity all matter.\n\nCurious if folks here see asset-based rewards as a legit engagement lever?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r0a6k0/quick_thought_on_cashback_design_assets_vs/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o4lochh",
          "author": "ZestycloseWill5287",
          "text": "this is why i went all in on high cashback rates found Oobit doing 10% unlimited with their token. Baseline already 5x better than chase. If token 2xs im at 20% effective, doesnt even need to moon. Just needs to not dump and youre way ahead of traditional cards",
          "score": 6,
          "created_utc": "2026-02-10 12:10:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lohgo",
              "author": "AccidentalSorcerer",
              "text": "I get the logic and yeah the math looks spicy, works great if the token chops or grinds up",
              "score": 1,
              "created_utc": "2026-02-10 12:11:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4loomc",
                  "author": "Salty-Opinion-9787",
                  "text": "Worst case you treat it like normal cashback and sell instantly",
                  "score": 1,
                  "created_utc": "2026-02-10 12:12:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4lov8o",
              "author": "Soggy-Buy-4726",
              "text": "I think this makes sense if you’re already crypto native and okay with volatility",
              "score": 1,
              "created_utc": "2026-02-10 12:14:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lirt8",
          "author": "Unusual-Fish-8634",
          "text": "I think the interesting part isn’t whether asset-based cashback is “better' it’s that it changes the mental model. Cashback is finished the moment it hits. Asset rewards extend the decision lifecycle, sell now, hold, rebalance later. That alone increases engagement",
          "score": 3,
          "created_utc": "2026-02-10 11:27:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lk0ee",
          "author": "Extra_Fly5172",
          "text": "Yeah, from a product POV it’s almost like every transaction creates a micro decision point. With cash, the user’s done. With assets, they’re nudged to check back in. That’s sticky in a way points never were",
          "score": 1,
          "created_utc": "2026-02-10 11:37:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lk8o0",
              "author": "Life_Government7906",
              "text": "Exactly. It’s not even about upside, it’s optionality. The user feels in control, even if they just insta sell 90% of the time",
              "score": 1,
              "created_utc": "2026-02-10 11:39:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4lkp61",
                  "author": "Livid-Ad7977",
                  "text": "But that optionality cuts both ways. Volatility means the realized cashback rate can drift pretty far from the headline. Some users will overestimate upside and underestimate risk",
                  "score": 1,
                  "created_utc": "2026-02-10 11:43:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4ll13a",
              "author": "Choice-Answer8895",
              "text": "Asset rewards basically shift risk from issuer to user. Great for engagement, but it does mean the reward isn’t a clean, predictable value anymore",
              "score": 1,
              "created_utc": "2026-02-10 11:45:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lle16",
          "author": "InfluenceNo8154",
          "text": "As a user, I weirdly like that though. Cashback just disappears into my balance. Asset rewards feel like something I chose to do something with, even if I end up selling",
          "score": 1,
          "created_utc": "2026-02-10 11:48:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lm51k",
              "author": "SweatyInevitable8159",
              "text": "Same. Even when I sell immediately, it feels more intentional than “here’s $1.37 back, congrats'",
              "score": 1,
              "created_utc": "2026-02-10 11:54:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lmspo",
          "author": "Pale-Bike4926",
          "text": "The tax angle matters a lot here. Asset rewards introduce tracking overhead that cash doesn’t. That friction might kill the appeal for some users long term",
          "score": 1,
          "created_utc": "2026-02-10 11:58:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ln5pn",
              "author": "GlassAd1992",
              "text": "asset rewards are great for power users, but there’s a real simplicity premium to straight cash",
              "score": 1,
              "created_utc": "2026-02-10 12:01:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4lndk6",
                  "author": "MoonlitParcel",
                  "text": "Feels like asset based rewards aren’t a replacement for cashback, but a different lever entirely. More engagement, more optionality, more complexity. Whether that’s a feature or a bug probably depends on who you’re building for",
                  "score": 1,
                  "created_utc": "2026-02-10 12:03:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r35234",
      "title": "What part of KYC causes the most friction in real implementations?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r35234/what_part_of_kyc_causes_the_most_friction_in_real/",
      "author": "Apprehensive_Rip1466",
      "created_utc": "2026-02-12 20:50:34",
      "score": 9,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I’ve been looking more closely at KYC workflows lately and trying to understand where things actually get painful in production. On paper it feels straightforward collect documents, verify identity, complete compliance checks but I’m guessing the real friction shows up in the details.\n\nFor teams that have built or integrated KYC flows, what ended up being harder than expected? Was it user drop-off during onboarding, document quality issues, false positives, internal review cycles or something else entirely?\n\nI’m currently working on a small project in this space called KYC Easy and trying to better understand real-world bottlenecks beyond the obvious surface-level ones. Would really appreciate hearing lessons learned from people who’ve implemented this at scale.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r35234/what_part_of_kyc_causes_the_most_friction_in_real/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o51yucx",
          "author": "DizzyGold6618",
          "text": "On paper KYC looks simple because people only think about the happy path.\nIn production, the real friction is not document upload. It is everything that happens when something goes slightly wrong.\nMost teams underestimate three things:\nException handling\nThe flow works perfectly when inputs are clean. The moment a document is slightly blurry, name mismatch happens, or AML throws a soft match, the system starts exposing how rigid it actually is.\nTransparency gap\nFrom the user side it looks like “Processing…”\nFrom the internal side it is stuck in a manual review queue. That silence is where trust starts eroding.\nContext fragmentation\nUser starts onboarding in app. Gets blocked. Switches to email or call center. Has to explain everything again because backend systems are not stitched properly. That is not a KYC problem. That is an architecture problem.\nMost KYC implementations are optimized for compliance checklists, not for user resolution.\nAnd that is why drop off happens.\nThe friction is not in collecting documents.\nIt is in handling imperfection.\nIf your system cannot gracefully handle edge cases, you do not have a KYC flow. You have a demo flow.\nCurious how many teams here are actually measuring friction in exception scenarios versus just completion rates on the happy path.",
          "score": 3,
          "created_utc": "2026-02-12 21:31:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o555pdy",
          "author": "xaic",
          "text": "If I Had to Rank the Top Friction Points\nAt scale, the biggest pain tends to be:\n\nML accuracy vs fraud risk tuning\n\nManual review backlog from false positives\n\nVendor reliability and integration brittleness\n\nUX drop off from biometric friction\n\nRegulatory interpretation changing mid stream\n\nI could drill in more, but can't be bothered. If you're curious about something specific, ask.",
          "score": 2,
          "created_utc": "2026-02-13 10:45:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2pq0j",
      "title": "6 Months Work Experience with Fiserv",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r2pq0j/6_months_work_experience_with_fiserv/",
      "author": "Legal-Armadillo3299",
      "created_utc": "2026-02-12 10:12:54",
      "score": 6,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Today I want to share about my working experience with Fiserv.\n\nI worked with a giant Fintech company for 5 years. I left that company and joined Fiserv and that was one of the worst decision of my life. Before joining itself the Manager stated reaching out to me on whatsapp and one day he shouted at me just 2 days before my joining and it was because I asked so many questions about the health insurance and pension plan. The manager called me and blasted that who gets pension and health insurance from the first day. It was so rude. It gave me a feeling that I have taken a wrong step already. Later he apologised and convinced me to join the company.\n\nThey all work from Nenagh and they all are like doing micro management. They started monitoring in/out timings and attendance. They made it mandatory to be in the office campus for atleast 8.5 hrs every day and if they find it lesser they will set up a meeting and ask for the reason in the email. I have seen the tensed faces in Fiserv where people are really stressed to go out even in the lunch time.\n\nhttps://preview.redd.it/be7zjrfcg1jg1.jpg?width=900&format=pjpg&auto=webp&s=3872b75c1e563e39c9de9c9b4dc836a6dccae085\n\nhttps://preview.redd.it/hv0g9yhcg1jg1.jpg?width=1600&format=pjpg&auto=webp&s=734bdac65986db8e62e21df070cd7113f081b1a5\n\nThey ask everyone to come to office but they dont have proper canteen even and whatever they have is just for the cakes and pastries and that too very expensive.\n\nMy life was made hell by my manager. He comes from the same place where I am from but instead of supporting me he started torturing me. He wanted me to be sacred, frightened, tensed but I was not that kind of person and he didn’t like this. He used to blast at me for every small thing. For any ask like wfh or leaves he used to behave as I have something very big from him and he is doing a big favour by approving my leaves or wfh.\n\nI had my citizenship ceremony in Killarney around 5pm in the evening for which I had to travel from Dublin. When I reached out to him for the leave he became so angry. He wanted me to return the same day from Killarney and come to office the next day which was nearly impossible as I had to travel with my 3 years old kid. But he wasn’t ready to hear anything. He even advised me to miss the citizenship ceremony and attend some other time. My manager himself took half a day leave for his citizenship ceremony but in my case he wanted me to return the same day from Killarney. He first threatened me about bad rating if I take leave. When I wasn’t scared then he threatened me about losing of my job even. I joined on 1st Oct and 15dec he gave me a bad rating and I was on PIP.\n\nAnd finally 1 week before my probation complete date I was called and fired. That day also the manager shouted at me. He told me that because of me the company is in loss. I told him Cmon I am a family man and I have my own responsibilities and I left my previous giant Fintech company for Fiserv and this is I have to see today. My father is a cancer patient and because of my manager’s ego and immaturity I had to suffer and it was a very stressful condition for me.\n\nFiserv is the worst company I have ever worked. They fire every year and they have hire and fire policies and the management is completely non-supportive. I have seen them torturing the people to travel to Nenagh.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r2pq0j/6_months_work_experience_with_fiserv/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o53h17i",
          "author": "markvii_dev",
          "text": "Terrible company",
          "score": 2,
          "created_utc": "2026-02-13 02:35:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50z3dh",
          "author": "rahulrambo3",
          "text": "No work life balance. Wfh and leaves are big things. Bonus is a scam",
          "score": 1,
          "created_utc": "2026-02-12 18:41:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2ry8a",
      "title": "Wallet to Wallet Payments Are Challenging Card Networks",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r2ry8a/wallet_to_wallet_payments_are_challenging_card/",
      "author": "Mother_Network9453",
      "created_utc": "2026-02-12 12:19:27",
      "score": 5,
      "num_comments": 7,
      "upvote_ratio": 0.78,
      "text": "\n\nFor decades, card networks defined how money moves. Swipe. Authorize. Settle. Repeat.  \nIt worked well but it was built for a world of banks, borders, and intermediaries.\n\nWallet to wallet payments are quietly changing that model.\n\nWhen two wallets transact, there is no acquirer, no card network, no interchange stack in the middle. Value moves directly from one user to another, often in seconds, sometimes in real time. No chargebacks. No weekend delays. No hidden routing logic.\n\nWhat makes this shift important is not crypto speculation. It is usability.\n\nPeople are already using wallets to pay freelancers, settle global invoices, send family money across borders, and move stablecoins like digital cash. For them, it feels closer to sending a message than making a payment.\n\nCard networks still dominate retail, but they were not designed for programmable money, micro payments, or always on global settlement. Wallets are.\n\nThis does not mean cards disappear. It means the monopoly on payments is ending.\n\nThe future of payments is not plastic.  \nIt is software.\n\nAnd increasingly, it lives inside wallets.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r2ry8a/wallet_to_wallet_payments_are_challenging_card/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o4zk0i6",
          "author": "FieldNoticing",
          "text": "True. There’s less friction and lower hanging fruit for introduction to digital economy.",
          "score": 2,
          "created_utc": "2026-02-12 14:39:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54cad9",
              "author": "Mother_Network9453",
              "text": "Here’s a clean, thoughtful reply that **builds on their point** and subtly advances your thesis:\n\n>",
              "score": 1,
              "created_utc": "2026-02-13 06:15:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4zp6ha",
          "author": "monkey6",
          "text": "What percentage of overall payments is p2p? I’d imagine… tiny",
          "score": 2,
          "created_utc": "2026-02-12 15:06:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54c7vu",
              "author": "Mother_Network9453",
              "text": "Fair question. If you look at total global retail payments today, wallet to wallet is still a small percentage. Cards dominate volume and acceptance.\n\nWhat’s interesting to me isn’t share *today*, it’s where new payment behavior is forming. Cross border P2P, freelancer payouts, creator economies, stablecoin transfers, and B2B settlements are growing fast and many of those flows never touch card rails at all.\n\nHistorically, card networks didn’t start big either. They scaled once the use case fit. Wallets are doing the same, just in different categories first.\n\nSo yes, tiny in aggregate. But not tiny where payment infrastructure is actually changing.",
              "score": 1,
              "created_utc": "2026-02-13 06:14:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5004z4",
          "author": "jm22381",
          "text": "That's right. Bizum Pay for NFC-enabled account-to-account payments with merchants will launch in the summer of 2026. By 2027, all European \"Bizum\" systems will be able to make these types of payments. User-to-user transfers via NFC will make the lack of Apple Cash in Europe irrelevant.",
          "score": 2,
          "created_utc": "2026-02-12 15:58:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54ccp7",
              "author": "Mother_Network9453",
              "text": "That’s a great example. Bizum shows how account to account and wallet based rails are moving from P2P into everyday merchant payments.\n\nWhat’s interesting is that once NFC is just an interface and not a card requirement, the underlying rail matters more than the form factor. From a user perspective it still feels like tap to pay, but the economics and settlement model are completely different.\n\nApple Cash being irrelevant in that context is telling. It’s less about the brand and more about who owns the payment rail underneath.",
              "score": 1,
              "created_utc": "2026-02-13 06:15:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r16sot",
      "title": "Lorum vs Airwallex for platform balances + payouts?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r16sot/lorum_vs_airwallex_for_platform_balances_payouts/",
      "author": "mardymarve",
      "created_utc": "2026-02-10 17:17:39",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 0.86,
      "text": "Hey, I am building a platform payments app. EU first, then UK. Users hold balances in EUR/GBP, we take pay-ins, then pay out sellers and contractors. Next step is GCC corridors, starting with AED and BHD, plus USD rails for treasury.\n\nWe run our own internal ledger, so we mostly need clean external events. Think stable transaction IDs, basic webhook events for posted and reversed, and statements that tie out without hand-fixing every week. I am not chasing exotic features. I just want something that stays predictible once volume ramps.\n\nAirwallex shows up a lot as the common “ship fast” choice. Lorum keeps coming up when people talk about platform account setups and ops pain later. I have also seen posts about Airwallex restrictions with funds stuck in review, so I am a bit cautious.\n\nAnyone got experience with either one?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r16sot/lorum_vs_airwallex_for_platform_balances_payouts/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o4ueplg",
          "author": "CreativeSpare6466",
          "text": "Airwallex is fast to get live and api is clean. But the funds stuck in review thing is real, seen that come up multiple times.\n\nLorum is more of a clearing/specialist correspondent setup. Haven't heard much about them tbh but looks solid. ",
          "score": 3,
          "created_utc": "2026-02-11 18:37:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ukoyb",
          "author": "whatwilly0ubuild",
          "text": "Airwallex is the faster path to live for EU/UK but the operational concerns you've heard are valid. They work well at lower volumes and simpler use cases. Once you scale or hit compliance edge cases, funds getting stuck in review becomes a real pattern. Their support responsiveness degrades noticeably when you're not a top-tier account. The API is decent but webhook reliability has been inconsistent for some use cases, which matters a lot if you're running your own ledger and need clean event streams.\n\nLorum is more purpose-built for the platform model you're describing. Designed around holding balances, multi-currency, and the kind of ledger-first architecture where you need external events to reconcile cleanly. Less name recognition but the teams using them for similar setups tend to report fewer operational surprises once integrated. The GCC corridor coverage is worth verifying directly since that's a thinner market for most providers.\n\nThe reconciliation pain point you mentioned is where the real difference shows up over time. Airwallex statements can require manual cleanup when transactions reverse or settle weirdly. If your internal ledger depends on trusting external events without constant hand-fixing, that friction compounds. Our clients running platform payments have found that the \"boring\" operational qualities, like stable transaction IDs and predictable webhook sequencing, matter more than feature lists once volume ramps.\n\nFor GCC specifically, neither is a slam dunk. Airwallex has some coverage but AED and BHD corridors are often handled through partners rather than direct rails, which adds latency and reconciliation complexity. Worth asking both for specifics on how those corridors actually work rather than trusting the website coverage maps.\n\nThe practical move is running a pilot with real edge cases, reversals, partial settlements, multi-currency conversions, before committing. The happy path always works. It's the exceptions that reveal whether you'll be debugging their system or running your business.",
          "score": 3,
          "created_utc": "2026-02-11 19:05:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r11d8z",
      "title": "We just found out our UBO mapping was wrong for 30% of our corporate clients. How do you even fix that without shutting down onboarding?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r11d8z/we_just_found_out_our_ubo_mapping_was_wrong_for/",
      "author": "CallaClaret",
      "created_utc": "2026-02-10 13:55:11",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 0.86,
      "text": "I want to share this because I think a lot of teams are sitting on the same problem and don't know it yet.\n\nDuring audit prep last month we pulled a random sample of 200 corporate client files to review our beneficial ownership documentation. Expected maybe 5-10% would have minor gaps. The actual number with material errors in their UBO mapping was 30%. Not missing documents. Wrong ownership structures. Chains that stopped one entity too early. Nominees recorded as actual beneficiaries. Circular ownership loops that nobody caught during onboarding.\n\nThe initial reaction from the team was pure panic. 30% of 200 is 60 files. But we have roughly 3,000 corporate clients. If the error rate holds across the full book, we're looking at 900 client files with potentially incorrect UBO data. That's not a remediation project. That's a crisis.\n\nThe first question from senior leadership was whether we needed to pause onboarding while we fixed it. Which I understand but practically that means telling the business to stop generating revenue while compliance cleans up a mess that accumulated over years. That conversation went about as well as you'd expect.\n\nWhat we're doing instead is running parallel tracks. New onboarding continues but with a completely revised UBO verification process that addresses every failure pattern we found in the sample. Existing client remediation happens in batches prioritized by risk. Highest risk client types first. PEP-connected entities. Multi-jurisdictional structures. Clients in high-risk geographies.\n\nSo far most of our errors came from the same root causes. Analysts relying on client-provided org charts without independent verification. Registry data that was outdated at the time of onboarding and ownership thresholds applied inconsistently because different analysts interpreted the 25% beneficial ownership rule differently for complex structures.\n\nThat last one was hard because it's a training and process failure not a data failure. We had the information in many cases we just applied the rules wrong.\n\nFor anyone who hasn't stress tested their UBO data recently I'd strongly recommend pulling a sample before your regulator does it for you. The error rate might surprise you. Start with your most complex client structures because that's where the problems hide. Multi-layered holding companies, trust structures, anything involving nominees.\n\nWe're about eight weeks into the remediation now. It's going to take at least another four months to work through the full book. Not fun but at least we found it ourselves.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r11d8z/we_just_found_out_our_ubo_mapping_was_wrong_for/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o4nskqo",
          "author": "whatwilly0ubuild",
          "text": "The parallel track approach is the right call. Shutting down onboarding to remediate is the kind of decision that sounds responsible in a compliance meeting and gets you fired in a board meeting.\n\nThe 30% error rate is high but not shocking for corporate KYC that accumulated over years with inconsistent processes. The dirty secret of most AML programs is that the data quality degrades over time while everyone assumes it's fine because onboarding \"completed successfully.\" Our clients who've done similar audits typically find error rates between 15-40% depending on client complexity and how many process changes happened without retroactive cleanup.\n\nThe root causes you identified are universal. Client-provided org charts are lies until verified, not because clients are malicious but because they often don't know their own ownership structure accurately. The 25% threshold interpretation issue is brutal because it's genuinely ambiguous in complex structures. Does a 20% holder who also controls the board count? Depends on who you ask and when you ask them.\n\nOne thing that helps with the remediation prioritization beyond risk factors is looking at transaction volume and relationship profitability. A dormant high-risk client matters less than an active one pushing volume through daily. Regulators care about what's actually flowing through the bad data, not just the theoretical risk.\n\nThe timeline reality is that four more months is optimistic if you're doing proper verification rather than just asking clients to re-confirm what they already told you. Re-verification that actually catches circular ownership and nominee structures requires independent registry pulls and sometimes investigative work. Budget for at least some percentage of clients who can't or won't provide adequate documentation, and have a plan for whether you exit those relationships or accept enhanced monitoring.\n\nThe training failure piece is worth investing in properly. Written procedures that address the specific ambiguities you found, with worked examples of the exact structures that tripped people up, prevent this from recurring.",
          "score": 3,
          "created_utc": "2026-02-10 18:40:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n6nly",
          "author": "felix-thebest",
          "text": "Correct the prob for new ones, manually fix the old ones by rescanning them. 200 is not too many. Communicate transparently about the issue. People understand.",
          "score": 1,
          "created_utc": "2026-02-10 16:59:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rb0bg",
          "author": "trippytaco8",
          "text": "Good catch finding this yourselves before regulators did. Four more months of remediation is painful but better than the alternative.  \n\nThe 30% error rate doesn’t surprise me. Most onboarding tools treat UBO mapping like filling out a form instead of solving a logic puzzle. Since I’m not sure what your onboarding flow looks like, I’m going to assume it’s a form. Maybe consider visual ownership graphs with validation that blocks progress? When you’re looking at nested tables or form fields, circular loops and incomplete chains hide. Same data as a node graph? Those problems are instantly obvious. Add hard stops when the chain doesn’t resolve to a natural person.\n\nOn the monitoring side, consider ongoing registry checks and drift detection. Corporate structures change constantly but compliance systems treat them like static snapshots. Periodic re-validation (time-based or triggered by external signals like acquisition news) catches when your UBO data has gone stale. Otherwise you’re documenting historical ownership and calling it current.\n\nWe work on compliance flows for fintech companies and see these patterns a lot. Happy to share more specific examples if useful. DMs open.",
          "score": 1,
          "created_utc": "2026-02-11 06:43:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r05xo3",
      "title": "When fintech apps can’t explain KYC reviews, what’s the right way to handle users?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r05xo3/when_fintech_apps_cant_explain_kyc_reviews_whats/",
      "author": "Ok-Estimate-8918",
      "created_utc": "2026-02-09 14:40:51",
      "score": 4,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "I’ve been reading and discussing how KYC actually works in fintech apps, and one thing seems pretty clear now. Many fintechs do lighter KYC upfront and then tighten checks later based on things like transaction volume, account age, risk model changes, or regulatory updates. When that happens, accounts can suddenly go under review or get restricted. Support usually can’t explain much because they genuinely don’t know the details or legally can’t share them.   \nSo the vague 'please wait' responses aren’t always incompetence, they’re kind of built into how compliance and risk teams operate.  \nGiven that reality, I’m curious about the \"**product side of this problem\"**. If fintechs can’t disclose investigation details, what actually works to reduce user frustration? Is it advance warnings, clearer timelines, better status visibility, or something else?\n\nFor people who’ve worked in fintech, payments, or compliance-heavy products; what have you seen work in practice, and what seems working in theory but fails in real regulated environments?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r05xo3/when_fintech_apps_cant_explain_kyc_reviews_whats/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o4fy38f",
          "author": "venturepulse",
          "text": "Nothing can reduce frustration when person doesn't get what they need, especially when they wasted so much of their time filling the 3-4 pages of form upfront, doing selfies and uploading the docs.\n\nIf you walked 1km to a remote pharmacy to buy specific very important medicine (advertised by that pharmacy) and discovered that this pharmacy refuses to sell it to you, would their sad face and apologies do any difference to you? And even if you call before going they'll say you have to come to them first before they decide whether to sell that medicine to you.\n\nMany fintechs love advertising \"for everyone, global, accessible\", baiting people into signing up and uploading their docs, just to smash them later with automated refusal that could have been given on the earliest stages of the application filing.\n\nI believe this happens because fintechs face no liability for harvesting too much data too early, without filtering out applications as soon as they get the first hint that customer may not suitable for their risk policy.\n\nThe only way to reduce customer's frustration is to respect their time: keep their time investment as low as possible if rejection is about to happen. Value people's time and people will be less angry about it because they'll feel they are treated with respect and not as another disposable irrelevant data point.\n\nRespect requires care. Care means planning process around minimizing the resource cost for the other person: money, emotions, time.",
          "score": 2,
          "created_utc": "2026-02-09 15:05:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g2h60",
          "author": "FewEmployment1475",
          "text": "If KYC is handled internally by the company rather than by an external provider, the process must be automated with minimal human involvement.\nHere’s how I implemented it:\n\nA merchant applies for an account on the payment platform, uploads the minimum required documents, personal and company data, provides a business description, and submits the application. An employee reviews the documents and compares the business description with the website from which API requests will originate. \n\nIf they don’t match — rejection. If they do, automated checks run against AML lists and the company is verified in the commercial registry (tax number, business activity, address, etc.).\n\nIf everything is fine, screenshots of the homepage and store are taken and stored with the submitted documents. The merchant is approved for basic KYC and the API becomes active.\n\nA script visits the website once per month, takes screenshots, and stores them with the documents. If the hash differs by 20%, it raises an alert; if it differs by 50%, the account is blocked and administrators are immediately notified by email for review.\n\nIf the merchant reaches a predefined monthly sales threshold, the API stops accepting requests. Several dashboard notifications appear before this limit is reached. At that point, additional documents are required to allow the API to continue operating — now without limits 😉. This is integrated into a real payment gateway and works very well.\n\nThere’s no need to monitor every transaction manually… you can also add red flags for unusually large transactions or many small ones.\nGood luck!",
          "score": 2,
          "created_utc": "2026-02-09 15:27:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4gfb7a",
              "author": "rhizome-compliance",
              "text": "So if they update their website design, you'll shut off access?",
              "score": 1,
              "created_utc": "2026-02-09 16:29:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4gghgr",
                  "author": "venturepulse",
                  "text": "Thats modern fintech scene right there! Something unusual? Ban that \\*\\*\\*\\*!\n\nYou can see that u/FewEmployment1475 sees his/her clients as milking cows that have to have same color, same regular milk production and same mooo voice. If anything changes, that poor cow gets slaughtered by \"smart\" algorithm.\n\nClients who sign up with such institutions are destined to be butchered at some point.",
                  "score": 2,
                  "created_utc": "2026-02-09 16:34:36",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4ha1hx",
                  "author": "FewEmployment1475",
                  "text": "By design is not possible to be changed web address after KYC submit. API working only with the provided web address.\nTo change web design is not a problem, just inform the platform for that.",
                  "score": 1,
                  "created_utc": "2026-02-09 18:54:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4hlcka",
          "author": "FewEmployment1475",
          "text": "I want to clarify that I’m speaking from experience on a real, serious project that took over 8 months and three top engineers to fully complete. It included a full developer sandbox, complete documentation, main and failover servers with 99.9% uptime, replicated databases, and extremely high security standards. There were blockchain- and API-level audits, plus a polished user interface.\n\nThis wasn’t a casual side project — serious money and effort were on the line. Partnerships with PayPal and Stripe as a marketplace, support from MetaMask and Blockaid are just some of the achievements the team delivered. On top of that, we shipped a Shopify app, an NPM package, and a WooCommerce plugin for WordPress — which should make it clear that the comments here sound dismissive of everything that was built and everyone who supported and believed in this project.\n\nI shared an opinion on a genuinely complex topic, and those who don’t want to play by the rules reacted loudly… but that’s life. I believe you’ll find the right payment model for yourselves 😉\nBest regards",
          "score": 2,
          "created_utc": "2026-02-09 19:48:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ioguy",
          "author": "whatwilly0ubuild",
          "text": "The gap between compliance reality and user experience is a genuine product problem, and most fintechs handle it poorly.\n\nWhat actually works in practice.\n\nProactive warnings before restrictions hit. Telling users \"you're approaching a threshold where we'll need additional verification\" while they can still act is massively better than freezing the account and then asking for documents. Our clients who implemented soft warnings saw support ticket volume drop significantly compared to hard stops with no notice.\n\nExplicit expectations during onboarding. Most users don't know that additional verification is even possible later. A single screen during signup explaining \"as your usage grows, we may need additional documentation\" sets expectations and reduces the feeling of betrayal when it happens.\n\nStatus visibility without details. You can show \"document received, under review, estimated 2-3 business days\" without disclosing why the review was triggered. Users mostly want to know something is happening and when it might end, not necessarily why.\n\nGuaranteed human escalation paths. Even if the frontline agent can't share details, knowing there's a way to reach someone with authority reduces frustration. The feeling of shouting into a void is worse than the actual wait.\n\nWhat sounds good but fails in practice. Chatbots and automated status updates that just repeat the same information. Vague timelines like \"up to 30 days\" when most cases resolve in 48 hours. Promising callbacks that never happen.\n\nThe uncomfortable truth is that some fintechs deliberately keep communication vague because friction during review causes some risky users to self-select out. The poor experience is partly a feature, not entirely a bug.",
          "score": 2,
          "created_utc": "2026-02-09 23:05:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k0ok6",
          "author": "PassionImpossible326",
          "text": "Best part is If you can’t explain the reason, then explain the process — what stage it’s in, what might trigger it, and what usually happens next.\nIf reviews are likely later, warn users early (“higher limits = deeper checks”) so it doesn’t feel random.\nIf timelines are uncertain, give ranges + visible status, not silence (“day 3 of review” beats “please wait”).\nAnd if support can’t say why, let them clearly say what users can and cannot do while it’s under review — that alone cuts frustration a lot.\nI have done this for my infra.",
          "score": 1,
          "created_utc": "2026-02-10 03:45:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0iifh",
      "title": "Looking for partners to tackle these remittance corridors",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/gallery/1r0iifh",
      "author": "rhizome-compliance",
      "created_utc": "2026-02-09 22:18:06",
      "score": 4,
      "num_comments": 8,
      "upvote_ratio": 0.7,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r0iifh/looking_for_partners_to_tackle_these_remittance/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": [
        {
          "id": "o4it8hq",
          "author": "Wolfywolfyfenrir",
          "text": "Sorry not available for partnership as my company already operates a solution in this space. However I’d recommend you look at the deployment tracker for potential partners here:\n\nhttps://www.gsma.com/mobile-money-metrics/#global?y=2017?v=overview?g=global\n\nI am unaffiliated with them in any way shape or form, it is just a good resource for potential mobile money providers in the space.",
          "score": 2,
          "created_utc": "2026-02-09 23:31:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4itxnd",
              "author": "rhizome-compliance",
              "text": "Interesting resource, I'll take a look thanks!",
              "score": 1,
              "created_utc": "2026-02-09 23:35:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lau1a",
          "author": "465di",
          "text": "Have DM'd",
          "score": 2,
          "created_utc": "2026-02-10 10:16:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xatwr",
          "author": "rp_Neo2000",
          "text": "I'm Indian. And speaking from experience there are more Remittance companies focused on India than most people are aware of! I don't know if the market is just that big that it can absorb so many companies, or that the companies are burning on CAC just to get the audience before they launch something else. In the last 6 weeks, I've learned of 2 additional Indian remittance companies quite by accident, and I'm in the FinTech space. \n\nA maybe better way to look at this is what are the growing or/and underserved markets, and how many companies operate in that space. Is there place for a new company? What's your USP and Will CAC be a problem?",
          "score": 2,
          "created_utc": "2026-02-12 03:57:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4xqsip",
              "author": "rhizome-compliance",
              "text": "Yeah, the blue graph shows these markets growing at a good rate, but you bring up a good point about wanting to see the number established companies in each.\n\nWe're probably on the cusp of a lot of new corridors opening up too, these are just the biggest now.",
              "score": 1,
              "created_utc": "2026-02-12 05:58:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4iwx2f",
          "author": "rhizome-compliance",
          "text": "A bit of context on the graphs, the inflows and fee data are from World Bank's public API for remittance data.",
          "score": 1,
          "created_utc": "2026-02-09 23:52:00",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o4k140y",
          "author": "swemming",
          "text": "I've looked at the world bank data and it is not accurate at all. They use aggregate data from traditional remittance companies aka Western Union. The top markets you shared are absolute blood baths right now with companies running negative GM to gain market share.",
          "score": 1,
          "created_utc": "2026-02-10 03:48:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kuauf",
              "author": "rhizome-compliance",
              "text": "You definitely need a wedge. The data is a fine enough proxy for reality, though. You don't need private data to know a lot of these markets are growing like crazy, and also why it makes sense to invest in getting established.",
              "score": 1,
              "created_utc": "2026-02-10 07:36:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qy2yil",
      "title": "Building an LLM-powered \"Risk Radar\" for earnings analysis. Would love feedback on the product logic/UI.",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qy2yil/building_an_llmpowered_risk_radar_for_earnings/",
      "author": "Lumpy-Accountant-750",
      "created_utc": "2026-02-07 03:29:41",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "**Intro:** Hi everyone,\n\nI’ve been working on a fintech project aimed at solving \"earnings season fatigue.\" We all know the standard data (EPS, Revenue) is easy to get, but the **qualitative risks** hidden in 10-Qs and earnings calls are often missed by retail investors.\n\nI’ve designed three core features to tackle this using LLMs and data visualization. I’d love to get the community’s thoughts on the utility and the UI:\n\n**1. AI Risk Radar (The \"Red Flag\" Engine):** Instead of just sentiment analysis, this engine looks for anomalies like inventory spikes vs. revenue growth, or subtle shifts in management’s vocabulary compared to the last 4 quarters. It generates a \"Risk Score\" and explains the \"Why\" in plain English.\n\n**2. Real-time Earnings Call Insights:** A live-streaming transcript service that doesn't just transcribe, but \"tags\" management answers. If an executive becomes evasive or uses language historically linked to negative future performance, the UI flags it in real-time.\n\n**3. Visual Volatility Calendar:** A dashboard to map out upcoming earnings for a specific watchlist, focusing on expected volatility rather than just the date.\n\n**The Question for** r/FinTech\\*\\*:\\*\\*\n\n* **As professionals/enthusiasts:** Do you think a \"Risk Score\" is too reductive for investors, or is the \"Key Red Flags\" list more valuable?\n* **Regarding the Live Insights:** Would you find real-time flagging distracting, or is it the \"killer feature\" for someone who can't listen to every word?\n\nI've attached some UI mockups below to show the current direction. Any feedback on the UX or the underlying logic would be hugely appreciated\n\n**What's New: I've built an AI tool to spot red flags in financial reports!**\n\nI've been working on an AI that digs into financial reports to help you spot potential risks. Try the web version now and let me know what you think!\n\n**Give it a try:** [**https://www.next4.ai/stockAI/m-audit.html**](https://www.next4.ai/stockAI/m-audit.html)\n\nIf you find it useful, an app version is coming next! Check out the real analysis it generated for Snowflake (SNOW) below.\n\nhttps://preview.redd.it/3ki70sbbokig1.png?width=752&format=png&auto=webp&s=6101392d737e5bc598813199a88644126c3fff4b\n\nhttps://preview.redd.it/b1f7bwbbokig1.png?width=586&format=png&auto=webp&s=1807f9aeea1e637b96f85035902a2773be753265\n\nhttps://preview.redd.it/8xbccegbokig1.png?width=586&format=png&auto=webp&s=011fd18d12fc2d48e0ca32569fd97d62ed31f6f8\n\nhttps://preview.redd.it/pblibqbbokig1.png?width=722&format=png&auto=webp&s=fe7c77128874345ec432c786578722d037d6457c\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qy2yil/building_an_llmpowered_risk_radar_for_earnings/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o40z1jh",
          "author": "tornavec",
          "text": "Interesting",
          "score": 2,
          "created_utc": "2026-02-07 04:12:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41qfw8",
              "author": "Lumpy-Accountant-750",
              "text": "Thanks，so... hypothetically, what's a monthly fee you wouldn't run away from? Also, any must-have features I should know about? No funny business, just curious!",
              "score": 2,
              "created_utc": "2026-02-07 08:00:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4jfn1h",
          "author": "Lumpy-Accountant-750",
          "text": "Hi，all！i've launched an AI-powered risk screener for financial reports. Everyone is welcome to give it a try and share your feedback! Access it here: [https://www.next4.ai/stockAI/m-audit.html](https://www.next4.ai/stockAI/m-audit.html)",
          "score": 1,
          "created_utc": "2026-02-10 01:39:27",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1pxbo",
      "title": "Non-technical path into fintech, what helped you most?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r1pxbo/nontechnical_path_into_fintech_what_helped_you/",
      "author": "TraditionalTowel4217",
      "created_utc": "2026-02-11 06:29:40",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "Hi! I’m a first year business student planning to concentrate in finance and MIS, and I’ve recently gotten interested in fintech. I’ve started trying to learn code on my own (definitely harder than I expected lol) just to understand the space better. \n\nFor those working on the business side of fintech, what did you do to prepare yourself for your role? Any skills, internships, or experiences you’d recommend focusing on early on? Thanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r1pxbo/nontechnical_path_into_fintech_what_helped_you/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o4rlidt",
          "author": "Slight_Warthog8706",
          "text": "Network network network! Try to find events around you where you can talk to people working at places/roles you're aiming for.\n\nLinkedIn can be a great prospecting tool to find people who you can reach out to via email or LinkedIn. Leverage Apollo (free sign up) to find their email.",
          "score": 1,
          "created_utc": "2026-02-11 08:20:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}