{
  "metadata": {
    "last_updated": "2026-01-03 08:27:57",
    "time_filter": "week",
    "subreddit": "fintech",
    "total_items": 26,
    "total_comments": 92,
    "file_size_bytes": 127437
  },
  "items": [
    {
      "id": "1pwyhwe",
      "title": "I Found The Best IPTV Service in Canada & USA? My Honest Review (Sports, Movies & PPV)",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pwyhwe/i_found_the_best_iptv_service_in_canada_usa_my/",
      "author": "rubby_natasa",
      "created_utc": "2025-12-27 14:00:52",
      "score": 647,
      "num_comments": 190,
      "upvote_ratio": 0.99,
      "text": "When I first started looking for an IPTV Service, my main goal was simple: something stable for channels from the USA and Canada. What I didn’t expect was how unreliable many IPTV Providers turned out to be after a short time. Some worked fine for a few days, then buffering and missing channels started. Because of that, I decided to properly test a few IPTV subscriptions instead of switching based on quick impressions.\n\nOne of the services I kept using during this process was **HuluxTV\\*COM** \n\nI ran it alongside other IPTV subscriptions to compare real, everyday usage rather than short trials. Over time, it stayed more consistent than most of the other IPTV Providers I tried.\n\n**Channels and Regions That Mattered to Me**\n\nContent availability was a big factor. HuluxTV covered the channels I actually watch, including IPTV USA and IPTV Canada content, plus UK and some European categories. Having these regions available in one IPTV Service made daily viewing much easier without juggling multiple subscriptions.\n\n**Performance During Normal Use ⚡**\n\nWith many IPTV subscriptions, problems usually show up during busy hours. Freezing, slow loading, or sudden drops in quality were common issues I ran into. With HuluxTV, streams loaded faster and stayed stable more often than what I experienced with other IPTV Providers, which made a noticeable difference in day-to-day use.\n\n**Devices and Setup Experience 📱💻**\n\nI tested this IPTV Service on several devices, including a TV, a streaming device, a phone, and a computer. Setup was simple, and performance stayed fairly consistent across devices. That wasn’t always the case with other IPTV Providers, where the experience changed depending on the platform.\n\n**Final Thoughts 📝**\n\nAfter spending time comparing different options, HuluxTV ended up being the IPTV Service I continued using because it held up better over time. Everyone’s needs are different, but for my usage, this IPTV subscription stayed reliable when others didn’t.\n\nIf anyone wants to share their experience with IPTV Providers or talk about what they look for in an IPTV Service, feel free to join the discussion.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pwyhwe/i_found_the_best_iptv_service_in_canada_usa_my/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nw6xv7g",
          "author": "monkey6",
          "text": "Spam",
          "score": 3,
          "created_utc": "2025-12-27 14:11:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwsatp0",
              "author": "Desperate-Credit4366",
              "text": "I think 90% of this platform is spam or even bots",
              "score": 2,
              "created_utc": "2025-12-30 19:43:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwje4qo",
              "author": "[deleted]",
              "text": "HuluxTV gave me the most seamless movie nights ever in Canada best IPTV without question.",
              "score": 0,
              "created_utc": "2025-12-29 13:02:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nw77n71",
          "author": "Tichop",
          "text": "We don't care kiddo",
          "score": 2,
          "created_utc": "2025-12-27 15:10:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw9iju1",
          "author": "meninblck9",
          "text": "This sub is full of spam",
          "score": 2,
          "created_utc": "2025-12-27 22:23:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwdxool",
              "author": "Altruistic-Raise-579",
              "text": "Super true lolll",
              "score": 1,
              "created_utc": "2025-12-28 16:43:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx960kq",
          "author": "MiraiKage24",
          "text": "For UK audiences, HuluxTV feels well optimized and reliable.",
          "score": 1,
          "created_utc": "2026-01-02 14:02:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx97oa6",
          "author": "mysticloud21",
          "text": "Movie marathons in Australia finally run smoothly with HuluxTV.",
          "score": 1,
          "created_utc": "2026-01-02 14:12:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx97qzj",
          "author": "No-Rich-4888",
          "text": "For USA game nights with friends, HuluxTV keeps things smooth.",
          "score": 1,
          "created_utc": "2026-01-02 14:12:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx98hqw",
          "author": "Intrepid-Web3827",
          "text": "HuluxTV made my Canadian setup feel more professional.",
          "score": 1,
          "created_utc": "2026-01-02 14:17:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx98nnf",
          "author": "milydsd",
          "text": "For sports and shows in the USA, HuluxTV covers everything I need.",
          "score": 1,
          "created_utc": "2026-01-02 14:17:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q1707n",
      "title": "🇪🇸 IPTV España: La mejor experiencia IPTV en España – mi búsqueda de un servicio realmente estable",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1q1707n/iptv_españa_la_mejor_experiencia_iptv_en_españa/",
      "author": "Electronic_Egg_203",
      "created_utc": "2026-01-01 15:40:04",
      "score": 102,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "Durante los últimos meses he probado varios servicios de IPTV y, sinceramente, la mayoría me dejaron bastante decepcionado. Cortes constantes durante los partidos de fútbol, canales que desaparecían sin previo aviso y un servicio de atención al cliente que casi nunca respondía.\n\n\n\nViviendo en España y siendo muy aficionado al fútbol —tanto nacional como internacional—, buscaba algo que de verdad fuera estable: buena calidad de imagen, subtítulos en español y un precio razonable.\n\n\n\nDespués de muchas pruebas, por fin encontré un servicio que cumple con todo lo que necesitaba:\n\n\n\nSin interrupciones\n\n\n\nMiles de canales (deportes, películas y series)\n\n\n\nConexión estable y continua\n\n\n\n\n\n👉 Para quien tenga curiosidad, actualmente utilizo un servicio que se puede encontrar en:\n\n[https://iptvprofesional-es.store/](https://iptvprofesional-es.store/)\n\n\n\nEn mi caso, ha sido la solución definitiva.\n\n\n\nMe gustaría conocer la experiencia de otros usuarios:\n\n¿qué proveedores de IPTV utilizan en España o Latinoamérica y qué tal les han funcionado?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1q1707n/iptv_españa_la_mejor_experiencia_iptv_en_españa/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1puczlw",
      "title": "Are we witnessing the collapse of visual KYC?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1puczlw/are_we_witnessing_the_collapse_of_visual_kyc/",
      "author": "sphinx-hq",
      "created_utc": "2025-12-24 03:12:09",
      "score": 35,
      "num_comments": 12,
      "upvote_ratio": 0.96,
      "text": "So I came across this post on LinkedIn where a guy took a real photo of himself with President Macron and used AI to swap Macron for Elizabeth Holmes. \n\nhe mentioned he used one prompt and a few clicks. Out comes a photo of him shaking hands with someone who's currently in jail and who he's never met. And it looked completely real. Like if he'd posted it without context I would've believed it. \n\nThis isn't even new anymore as i keep seeing variations of it, people faking photos with Elon Musk, Sam Altman, whoever. It's become a party trick. \"Look what I can do in two minutes.\" \n\nBut the compliance implications are what I can't stop thinking about. Current verification systems are built around \"does this look real\" as a meaningful filter. this made sense when fabrication was hard. When it took skill, time, and access to pull off a convincing fake. Now anyone can clear it in minutes with zero technical ability. \n\nThe same guy who made the Holmes photo also tested generating fake passports and utility bills. The output passes the eye test without much effort and this can be replicated in many areas (refund scams with AI-generated “damaged goods” photos, synthetic identities onboarding with generated documents, impersonations that look identical to the real person).\n\nI keep going back and forth on whether this is a solvable technical problem or if we're just watching the entire premise of visual verification collapse in slow motion. \n\nhow do you think compliance should adapt their defenses in a world where \"seeing\" is no longer \"believing\"?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1puczlw/are_we_witnessing_the_collapse_of_visual_kyc/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nvo7ztd",
          "author": "phatdoof",
          "text": "Most KYC nowadays include following prompts to turn your head and the screen has flashing lights so they see if your head goes a shade of green or red when the screen flashes.",
          "score": 6,
          "created_utc": "2025-12-24 05:27:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvodtjh",
          "author": "TomatoCapt",
          "text": "Selfie + ID photo. Check out Onfido as an example vendor",
          "score": 4,
          "created_utc": "2025-12-24 06:15:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvolelm",
              "author": "cheradenine66",
              "text": "I've seen so many people bypass that with barbie dolls, corpses, random homeless people they grabbed off the street in Russia, etc.",
              "score": 1,
              "created_utc": "2025-12-24 07:23:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvs08g2",
                  "author": "TomatoCapt",
                  "text": "I use Onfido at work everyday and did testing during vendor selection. It’s very good and prevents the cases you mentioned. ",
                  "score": 1,
                  "created_utc": "2025-12-24 21:13:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvp3kt3",
          "author": "jayebird111",
          "text": "You need better video selfies/ liveness for now, from next year accept digital ID (every EU country’s about to get it)",
          "score": 2,
          "created_utc": "2025-12-24 10:21:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvzc95d",
          "author": "Pale_Neat4239",
          "text": "You're asking the right question at exactly the right time. The shift from \"visual verification = trust\" to \"visual verification = liability\" is fundamentally changing how compliance teams need to think about identity validation infrastructure.\n\n\n\nWhat we're seeing is that organizations need to layer different modalities. Deepfake detection, behavioral analysis, blockchain-based identity verification, even multi-factor biometric checks. But here's the thing: most fintechs are bolting these on reactively rather than orchestrating them as part of a coherent strategy.\n\n\n\nThe teams scaling successfully aren't just upgrading their KYC tools, they're rethinking the entire identity verification workflow as a risk-orchestration problem. You need continuous re-authentication, transaction velocity monitoring, device fingerprinting running in parallel. Visual verification becomes one signal among many, not the primary one.\n\n\n\nThe compliance angle is trickier though. Regulators still expect certain checkboxes (document verification, face matching), but the bar for \"adequate\" is moving fast. I'd be curious if anyone here has navigated the conversation with regulators about moving beyond traditional visual KYC entirely?",
          "score": 2,
          "created_utc": "2025-12-26 05:27:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvqpyb7",
          "author": "Aphroditesent",
          "text": "Work for a KYC workflow solution and we tested AI generated ID’s and it’s outrageous how easy it is to  create them. It will be a constant challenge to create software that can keep up with advances like this. A human ultimately will always have to be responcible.",
          "score": 1,
          "created_utc": "2025-12-24 16:53:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw0oho6",
          "author": "Advanced-Kangaroo754",
          "text": "Mail and wet ink signatures. Software itself won't even exist as we know it. Would you even trust your computer screen and a phone call in 5 years? Lets not even get into the quantum stuff...",
          "score": 1,
          "created_utc": "2025-12-26 13:08:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwp27l9",
          "author": "whatwilly0ubuild",
          "text": "Visual KYC isn't collapsing, it's shifting from \"does this look real\" to \"can we verify provenance and liveness.\" The compliance industry saw this coming and has been adapting for years.\n\nLiveness detection is the first defense. Modern KYC systems require live video with random actions like head turns or blinking in specific patterns. Way harder to fake in real time than static images, though deepfake video is getting there too.\n\nDocument verification is moving beyond visual checks to data validation. Cross-referencing passport numbers against issuing databases, checking security features not visible in photos, validating embedded chips. The image is one signal among many, not the primary method.\n\nOur clients doing KYC learned that layered verification catches way more fraud than single checks. Combine document verification, liveness detection, database cross-checks, behavioral analysis, and risk scoring. Faking one layer is easy, faking all simultaneously is much harder.\n\nFor fake utility bills and passports specifically, these already get caught by backend validation more than visual inspection. Utility bills verified by calling providers. Passports validated through chip readers or government databases.\n\nWhat's genuinely concerning is the narrowing gap between \"this is hard to fake\" and \"anyone can fake this.\" Used to be years, now it's months. Compliance systems relying on annual updates are getting lapped by publicly available AI tools.\n\nThe realistic future isn't abandoning visual verification, it's treating it as weak evidence needing corroboration. A photo proves nothing by itself but combined with liveness checks, database validation, and behavioral signals it still adds value.\n\nWhat doesn't work anymore is human reviewers spotting fakes visually. Humans can't compete with AI-generated content quality. Automated checks with strong backend validation are mandatory.\n\nThe collapse you're describing is already happening for low-effort KYC relying on visual plausibility without strong backend checks. Companies doing proper verification adapted years ago. The ones still relying on \"does it look real\" are behind and vulnerable.",
          "score": 1,
          "created_utc": "2025-12-30 07:49:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvqe8zu",
          "author": "PaymentFlo",
          "text": "You’re not overreacting, visual KYC is collapsing in slow motion, and most compliance teams are still treating AI fraud like edge cases.\n\nWhat used to require Photoshop + skill now takes 1 prompt and 1 minute, and it will be packaged into fraud-as-a-service kits soon.\n\nDefenses have to shift from “does this look real?” to cross-modal verification, e.g., behavior patterns, metadata, doc issuance APIs, and even AI-generated content detection.\n\nIn this new era, trust comes from provenance, not pixels and teams that don’t adapt risk becoming the next Wirecard.",
          "score": 0,
          "created_utc": "2025-12-24 15:51:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzw9vx",
      "title": "El mejor servicio IPTV con la mejor suscripción IPTV: Por qué IPSTREAMTV domina el mercado en 2025",
      "subreddit": "fintech",
      "url": "/r/cardgames/comments/1prjbk9/el_mejor_servicio_iptv_con_la_mejor_suscripción/",
      "author": "susei_donal",
      "created_utc": "2025-12-30 22:49:53",
      "score": 32,
      "num_comments": 12,
      "upvote_ratio": 0.95,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pzw9vx/el_mejor_servicio_iptv_con_la_mejor_suscripción/",
      "domain": "",
      "is_self": false,
      "comments": [
        {
          "id": "nx4tl9h",
          "author": "Ljs204",
          "text": "Works on my TV.",
          "score": 1,
          "created_utc": "2026-01-01 20:15:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pu2srf",
      "title": "Need recommendations for DSPM for AI",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pu2srf/need_recommendations_for_dspm_for_ai/",
      "author": "0zlord",
      "created_utc": "2025-12-23 19:30:11",
      "score": 21,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Our team is starting to seriously think about how to secure data around all our AI projects (training data, model inputs/outputs, etc.. We’ve been reading up on DSPM and it seems like the right approach especially given that so much sensitive info can end up in places it shouldn’t when AI is involved.\n\nCurious what people are actually using in production, would love any real world recommendations or learnings. Thanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pu2srf/need_recommendations_for_dspm_for_ai/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nvn5wpl",
          "author": "ixitimmyixi",
          "text": "We evaluated a few DSPM options and Cyera was one that really ended up standing out for us. We liked how quickly it gave us visibility into where sensitive data lived across cloud and SaaS, and how it classified that data with real context. \n\nSetup wasn’t a huge lift, and the risk insights felt actionable, not just dumping more alerts on the security team. But yeah if AI data exposure is what you’re worried about, it’s definitely worth a look I'd say. There's a few out there that I know are really good, but this is what's worked for us.",
          "score": 1,
          "created_utc": "2025-12-24 01:15:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvp3thj",
          "author": "Ok_Interaction_7267",
          "text": "The key thing with AI + DSPM is that sensitive data starts showing up in a lot of new places - training sets, prompts, embeddings, logs, model outputs often without anyone explicitly putting it there.\n\nWhat’s worked best is starting with visibility first: where sensitive data actually lives and which AI pipelines can touch it, then using DSPM to catch drift as data gets copied into feature stores, vector DBs, etc.\n\nTool/vendor-wise, we've seen Sentra and BigID used best for this - mainly because accurate discovery + access context matters more than classic DLP once AI is in the mix.",
          "score": 1,
          "created_utc": "2025-12-24 10:24:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvzcgq7",
          "author": "Pale_Neat4239",
          "text": "You're asking this at the exact right moment. The rise of AI training pipelines has completely changed how organizations need to think about DSPM, and frankly, most traditional data governance frameworks are struggling to keep up.\n\n\n\nOne thing I'd add to the conversation: DSPM for AI isn't just about \"where is sensitive data\", it's about understanding data lineage through model training, inference, and fine-tuning cycles. You need visibility into:\n\n\n\n\\- What training data fed into each model\n\n\\- How that data was transformed or augmented\n\n\\- Where inference outputs are being stored\n\n\\- Access patterns and retention policies\n\n\n\nThis becomes especially critical when you're orchestrating multiple AI services across your platform. The teams that are scaling successfully aren't bolting DSPM onto AI; they're building it into the architecture from day one.\n\n\n\nFrom a compliance perspective (especially if you're handling PII or transaction data), regulators are expecting this level of transparency now. Having that audit trail isn't optional anymore. What's your current data governance maturity level? Are you greenfield or retrofitting onto existing infrastructure?",
          "score": 1,
          "created_utc": "2025-12-26 05:28:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpgiil",
          "author": "andrew_northbound",
          "text": "In my experience as AI strategist, DSPM is great for data at rest. But for AI use cases, you still need some kind of data in motion control too (prompts, outputs, tool calls). DSPM alone won’t stop leakage.\n\nWhat I usually see teams pick:\n\nif team is already deep in M365 / Entra / Azure, they tend to go with Microsoft Purview DSPM.\n\nif team is already using Wiz, they often add Wiz DSPM for the cloud context and posture tie-in.\n\nif team wants a standalone DSPM, I see Cyera, BigID, Varonis, or Securiti come up most often.\n\nWhat we’ve learned in production is DSPM works best when you pair it with an LLM gateway or a DLP layer on the app/agent side.",
          "score": 1,
          "created_utc": "2025-12-30 10:02:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pub59t",
      "title": "KYC/KYB ops is our current bottleneck, which combo actually reduces manual review??",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pub59t/kyckyb_ops_is_our_current_bottleneck_which_combo/",
      "author": "Terry_Ackee",
      "created_utc": "2025-12-24 01:39:34",
      "score": 19,
      "num_comments": 12,
      "upvote_ratio": 0.95,
      "text": "We’re scaling a fintech product and KYC/KYB ops has quietly become the thing that dictates our growth speed, not the models or the risk score, but the manual glue work: collecting docs, chasing missing fields, checking weird edge cases, writing case notes, and leaving something audit-friendly for partners.\n\nWe’ve been trying to map the market into layers instead of one vendor to rule them all.\n\nOn the IDV side we’re looking at Persona and Entrust IDV (formerly Onfido), plus Sumsub. G2 reviews for these read like “solid workflows, decent implementation, good support” which is reassuring, but IDV alone doesn’t solve the ops backlog. \n\nThen there’s orchestration and decisioning like Alloy. Again, seems useful for connecting KYC/AML/fraud logic, but it still doesn’t magically do the human work of assembling a case file. \n\nWe also looked at broader RiskOps stacks like Sardine and Unit21 (more holistic fraud + compliance + case management vibes). Unit21’s reviews specifically talk about being built for compliance teams and configurable rules, which is the kind of thing we need if we keep control in-house. \n\nNow the new layer: agent-style tools that claim they can actually do the manual review steps. Parcha and Greenlite are loud here, and SphinxHQ is in the same category (agents that follow SOPs and produce audit trails). Greenlite doesn’t seem to have enough G2 reviews yet, so we’re mostly judging it off what they claim publicly.\n\nIf anyone built a stack that actually reduced manual case time, what combination worked? And what part ended up being the hidden tax: integrations, audit comfort, or exception handling??",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pub59t/kyckyb_ops_is_our_current_bottleneck_which_combo/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nvnqm0f",
          "author": "BucketsOfBanter",
          "text": "Look into footprint, end-to-end KYC/B, fraud detection, and agentic AI for automating manual review. Might be a fit.",
          "score": 2,
          "created_utc": "2025-12-24 03:25:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw0i2nq",
              "author": "NoCommittee4973",
              "text": "Been down this rabbit hole and honestly the \"agentic AI\" stuff is still mostly marketing fluff - you'll end up with the same manual work just wrapped in fancier dashboards",
              "score": 1,
              "created_utc": "2025-12-26 12:15:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvo1ofx",
          "author": "ryanyvr80",
          "text": "Full disclosure: I’m the founder of Gratify, a company that does this. We automated KYB / KYC / underwriting evidence collection (data, docs, 3rd parties) because we saw how manual it was, and how it should be automated with technology. I’m always keen to hear how people think about this very problem. I’ll send you a message- if appropriate let’s find a way to chat.",
          "score": 2,
          "created_utc": "2025-12-24 04:40:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvp3eyh",
          "author": "jayebird111",
          "text": "Why would you need Persona or Entrust as well as SumSub? They do the same thing\n\nThis is a made-up post, probably to promote Sphinx",
          "score": 2,
          "created_utc": "2025-12-24 10:20:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnjx0n",
          "author": "JaseDoom",
          "text": "I have used Alloy previously with model scores and attribute inputs from sardine and socure. Our manual workflow was very, very low with the right set of rules. That being said, very specific fraud attacks can still occur so you must stay on top of your logic and adjust as needed.\n\nEdited to add: we also used persona for Doc Verification as step up auth within alloy. You might also consider KBA/OTP depending what your workflow and step up auth looks like.",
          "score": 1,
          "created_utc": "2025-12-24 02:42:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnqw73",
          "author": "Secret_Audience_8307",
          "text": "FinCheck can help you for sure - [syed@fincheckllc.com](mailto:syed@fincheckllc.com)",
          "score": 1,
          "created_utc": "2025-12-24 03:27:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnw0m5",
          "author": "Plus_Cat6736",
          "text": "Oh man, I totally feel you on the KYC/KYB bottleneck. It can be such a time sink! We faced similar issues trying to scale our client onboarding and the manual work was just brutal. \\n\\nWe ended up piecing together tools that focused on different aspects. For IDV, Persona was pretty solid for us, but it still left us with a bunch of manual stuff to handle. We also tried using Alloy for orchestration but even that didn’t eliminate the human element of assembling everything. \\n\\nOne thing that really helped was focusing on automating the documentation part. Like, reducing the time spent on gathering and reviewing documents made a huge difference. It took us a bit to figure out the right balance, but cutting our review time from like 6 hours to maybe 2 hours per case was a game changer. \\n\\nNot saying it’s a magic bullet, but we've been testing Qwantify for some of our smaller clients and it's helped streamline some of those manual checks. Still doing some parts manually, but early results show it reduces that bottleneck. \\n\\nWhat’s your team size for these operations? Have you looked into how long each of these steps takes, or maybe even assessed the impact of your current tools?",
          "score": 1,
          "created_utc": "2025-12-24 04:00:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvqe5pu",
          "author": "PaymentFlo",
          "text": "We cut manual review time by over 70% using Persona for IDV, Alloy for decision logic, Greenlite to execute SOPs, and Unit21 for case management.\n\nGreenlite was the real unlock, automates doc checks, flags edge cases, even writes case summaries.\n\nBiggest hidden tax? Bad data piping and weak audit trails from agent tools. Stack works best when each layer owns one job cleanly, no single vendor can do it all.",
          "score": 1,
          "created_utc": "2025-12-24 15:50:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvzd6vt",
          "author": "Pale_Neat4239",
          "text": "You've identified the right problem space. The real bottleneck isn't actually the tools, it's that most orgs are stitching them together instead of orchestrating them.\n\n\n\nHere's what we typically see: Team A picks Persona for IDV, Team B picks Sardine for fraud, Team C picks Unit21 for Case Management. Then they spend 6 months building integrations because there's no unified decisioning layer.\n\n\n\nThe hidden tax ends up being:\n\n\\- Manual API integrations (expensive, fragile)\n\n\\- Duplicate workflows across tools (you end up running KYC checks twice)\n\n\\- No coherent risk scoring (each tool has its own flags)\n\n\\- Data silos (the case management tool doesn't talk to the fraud tool)\n\n\n\nWhat actually works: Build the case assembly logic first (as an orchestration layer), then plug in the verification tools. This way you control the flow, not the vendors.\n\n\n\nSpecific to reducing manual review: You need the tools to pass confidence scores and rule triggers back to your orchestration engine, which then decides \"this needs human review\" or \"auto-approve\". The combo that works best depends on your risk appetite, but the integration pattern is what really kills manual review efficiency, not the individual tools.\n\n\n\nHave you mapped out the case assembly logic yet, or are you still in the \"which tool\" phase?",
          "score": 1,
          "created_utc": "2025-12-26 05:34:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwp2lgu",
          "author": "whatwilly0ubuild",
          "text": "The manual review bottleneck doesn't get solved by adding more vendors, it gets solved by reducing cases that need human review in the first place. Most stacks just redistribute the work instead of eliminating it.\n\nIDV tools like Persona and Onfido are solid but still kick edge cases to manual review. Bad lighting, document glare, expired IDs, name mismatches. The automation works on clean happy path cases that were already easy. The operational burden comes from the 15-30% with issues.\n\nOrchestration tools like Alloy help route decisions but don't make them for you. You still need humans defining rules, handling exceptions, and reviewing flagged cases. They connect data sources and surface relevant info in one place.\n\nOur clients learned case management tooling matters way more than expected. Unit21 and similar platforms reduce time per case with better UI and structured workflows. Shaving 5 minutes off each manual review adds up fast at volume.\n\nAgent-style tools claiming to do actual review work are mostly vaporware. They can extract data and fill forms, but judgment calls about whether a selfie matches an ID still need human eyes. The audit trail piece is critical and most don't produce documentation compliance teams trust.\n\nWhat actually reduces manual work is better data collection upfront. If your onboarding captures clean photos, complete information, and proper document types first time, way fewer cases need review.\n\nThe combo that works: solid IDV for automated happy path, orchestration if connecting multiple data sources, then invest in case management for unavoidable manual review. Skip agent tools until they prove they can handle real compliance requirements.\n\nHidden taxes are integration work and exception handling. Every vendor has edge cases their automation misses. You build internal tools for gaps between vendors creating maintenance burden. Compliance teams won't trust black box AI decisions without extensive validation.\n\nReality check: best case you automate 60-70% of straightforward cases and reduce time per manual review from 15 minutes to 5-8 minutes. You won't eliminate manual work entirely because compliance requires human judgment on ambiguous cases.",
          "score": 1,
          "created_utc": "2025-12-30 07:52:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwp3z5c",
          "author": "Fun-Hat6813",
          "text": "Yeah the \"agent-style tools\" category is where things get interesting because most traditional KYC vendors still dump the messy stuff back on your team.\n\nWe actually built something in this space at Starter Stack AI after watching mid-market lenders get crushed by exactly what you're describing. The dirty secret is that even with good IDV and orchestration, you still need something that can actually read through a pile of bank statements, cross-reference entity docs, and write up coherent case notes without a human babysitting every step. Most of the \"automation\" tools still require your ops team to do the thinking part, they just digitize the paperwork shuffling. The real breakthrough happens when you have agents that can actually follow your SOPs end-to-end and produce audit-ready documentation that your compliance team trusts. From what I've seen in the market, the hidden tax usually ends up being exception handling like you mentioned, because every vendor optimizes for the happy path but real KYB cases are full of weird edge cases and incomplete docs. The tools that actually work are the ones that can handle those exceptions intelligently instead of just flagging them for human review. Integration complexity is definitely real too, but honestly if a tool actually cuts your manual case time by 60-70%, you'll find a way to make the integrations work.",
          "score": 1,
          "created_utc": "2025-12-30 08:05:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzrvet",
      "title": "Building 2026 KYC stack, what vendors are you evaluating?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pzrvet/building_2026_kyc_stack_what_vendors_are_you/",
      "author": "Old_Inspection1094",
      "created_utc": "2025-12-30 19:50:27",
      "score": 12,
      "num_comments": 25,
      "upvote_ratio": 0.94,
      "text": "Enterprise teams planning KYC stacks always chase real recommendations beyond slick vendor decks since most solutions shine until audits expose gaps or fraud spikes overwhelm signals, making compliance fit feel like a gamble without proven shortlists. \n\nWhat vendors actually earned your shortlist and why for next year's high-stakes requirements?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pzrvet/building_2026_kyc_stack_what_vendors_are_you/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nwsef6h",
          "author": "Particular-Target487",
          "text": "I’d be looking at an orchestration layer plus 2–3 IDV workhorses and then judging them on match rates, fraud catch, audit trails, and how painful or not they are for your ops team to live in every day.",
          "score": 3,
          "created_utc": "2025-12-30 20:00:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwsog2g",
              "author": "Old_Inspection1094",
              "text": "Yeah, this is where my head is at too. The hard part I keep running into is getting decent, apples‑to‑apples data on match rates and fraud catch before signing, instead of learning the truth six months into production. ",
              "score": 1,
              "created_utc": "2025-12-30 20:49:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwsqp66",
                  "author": "Particular-Target487",
                  "text": "Totally with you on that. The only way we’ve gotten close is insisting on a short pilot with our own traffic and asking for raw decision logs so we can slice approval, reject and manual review ourselves.",
                  "score": 1,
                  "created_utc": "2025-12-30 21:00:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwskq1y",
          "author": "Ok-Introduction-2981",
          "text": "One surprise win has been treating KYC as a product with a roadmap and owners, then swapping vendors in and out behind an API when fraud patterns or rules change, instead of rebuilding the stack every two years.",
          "score": 3,
          "created_utc": "2025-12-30 20:31:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwsoyeb",
              "author": "Old_Inspection1094",
              "text": "This resonates a lot. When you swap a vendor behind the API, how painful has retraining analysts and auditors been, or did the abstraction layer actually make that part smoother too.",
              "score": 1,
              "created_utc": "2025-12-30 20:51:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwshqj9",
          "author": "ImpressiveProduce977",
          "text": "Went through the exact process building requirements last quarter evaluating options side-by-side with heavy focus on signal quality and false positive controls across real attack patterns that hit hardest. \n\nAU10TIX stood out right in due diligence delivering solid precision that built real confidence to shortlist and move to testing while risk coverage felt reliable from day one without the usual caveats.",
          "score": 5,
          "created_utc": "2025-12-30 20:16:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwsk6va",
              "author": "Numerous_Salad_9572",
              "text": "A lot of ‘top KYC providers’ look great in rankings, but when pressure‑tested on data residency, uptime SLAs and incident response, only a handful are really enterprise‑ready",
              "score": 2,
              "created_utc": "2025-12-30 20:28:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwspcvy",
                  "author": "Old_Inspection1094",
                  "text": "Totally agree that rankings hide the boring but deadly stuff. Were data residency and uptime the main filters for you, or did incident response and breach history knock more names off the list than you expected.",
                  "score": 1,
                  "created_utc": "2025-12-30 20:53:43",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwsm6fk",
              "author": "Hot_Blackberry_2251",
              "text": "The only vendors that make our shortlist are the ones who can show hard numbers on catch rates for impersonation and synthetic IDs over the last 12–18 months, not just generic ‘AI’ slides",
              "score": 2,
              "created_utc": "2025-12-30 20:38:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwspird",
                  "author": "Old_Inspection1094",
                  "text": "This is the piece I wish more RFPs forced vendors to show. Have you found any honest way to validate those impersonation and synthetic numbers yourself, or are you mostly relying on references and your own limited pilot data.",
                  "score": 1,
                  "created_utc": "2025-12-30 20:54:29",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwsp4q0",
              "author": "Old_Inspection1094",
              "text": "Super helpful context. When you say ‘solid precision,’ was that mostly better control of false positives on legit customers, or did you also see a noticeable lift on synthetics and impersonation attempts during your tests.",
              "score": 1,
              "created_utc": "2025-12-30 20:52:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwsrjfz",
                  "author": "ImpressiveProduce977",
                  "text": "In our tests the biggest gain was fewer good customers being kicked to manual review, and then a smaller but still real lift on catching document tampering and replay patterns that were slipping past older tools.",
                  "score": 1,
                  "created_utc": "2025-12-30 21:04:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwsgpcs",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2025-12-30 20:11:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwsord6",
              "author": "Old_Inspection1094",
              "text": "I really like that three‑point lens. Do you track that formally anywhere, or is it more gut feel from ops and compliance when you review vendors each year. ",
              "score": 1,
              "created_utc": "2025-12-30 20:50:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwv9c4f",
          "author": "Pale_Neat4239",
          "text": "The real evaluation filter: How do vendors perform on YOUR risk profile, not industry rankings.\n\n\n\nWhen I evaluate KYC stacks:\n\n1. Test on your specific use case (geography, customer segment, payment types)\n\n2. Demand catch rates on PROVEN fraud (ask for their false negative %, not just marketing numbers)\n\n3. Check regional compliance—a top vendor in US might not handle SEA/MENA workflows well\n\n4. API integration friction often kills even good vendors; demo their integration experience\n\n\n\nBonus: Ask vendors for references from companies similar to yours, then ask those references about post-sale support quality. That's where many fall apart. Best score on evals ≠ best partner after day 1.",
          "score": 1,
          "created_utc": "2025-12-31 05:33:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvhxv0",
              "author": "Anidhiman",
              "text": "This is a great checklist—it’s basically a \"no-nonsense\" framework for anyone who’s tired of being burned by sales decks.\n\nI’m building in this space too, and that \"post-sale support\" point is usually the biggest trap. Everyone is your best friend during the demo, but the second you have a high-priority \"onboarding spike\" fail at 2 AM, they're suddenly a ghost.\n\nI’m curious though—when you were testing on your specific risk profile, was there a particular \"proven fraud\" type that finally exposed the gap in those bigger vendors? Like, was it sophisticated synthetic IDs or just simple, low-effort stuff that they were somehow missing?\n\nAlso, love the tip about asking for similar references. Did you actually find a reference that was honest about the \"post-sale\" support, or did they all just give you the polished version? It’s so hard to get the real story until you’re already locked in.",
              "score": 1,
              "created_utc": "2025-12-31 06:41:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nx8js18",
              "author": "Old_Inspection1094",
              "text": "This is really practical framework, 🙏. On the false negative % and regional compliance, we had a vendor perform great in US demos but completely failed when we tested Southeast Asia documents.",
              "score": 1,
              "created_utc": "2026-01-02 11:22:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwvpa1t",
          "author": "whatwilly0ubuild",
          "text": "KYC vendor selection depends on your regulatory scope, volume, and risk tolerance. No universal stack works for everyone.\n\nFor IDV, Persona and Onfido are safe bets. Persona has better workflow customization, Onfido has stronger global document coverage. Both kick edge cases to manual review at similar 15-20% rates. Sumsub is cheaper but fraud detection isn't as sophisticated.\n\nAlloy works if you're orchestrating multiple data sources like credit bureaus, sanctions screening, and document verification. Solid decisioning engine but you still build the rules.\n\nFor holistic platforms, Unit21 wins on case management for compliance teams. UI built for investigators not engineers. Sardine is stronger on real-time fraud signals but weaker on audit trails.\n\nWhat earns shortlist: proven uptime during volume spikes, clear pricing that doesn't explode with edge cases, responsive support understanding your regulations, and audit trails satisfying examiners without custom work.\n\nWhat disqualifies vendors: vague answers about false positive rates, \"contact sales\" for basic technical docs, demo-only features not in production.\n\nThe gap teams underestimate is operational overhead. Every vendor has cases automation misses. Test their case management tools seriously, not just happy path automation.\n\nFor 2026, watch vendors adding LLM-based document review. Some are legit improvements, others are marketing rebadges. Ask for false positive metrics on real customer data, not synthetic benchmarks.\n\nRegulatory fit matters more than features. EU KYC needs strong GDPR tooling and EU data residency. US-focused vendors retrofitting EU compliance are painful.\n\nReal shortlist criteria: can they handle your use case today without custom development, do they have reference customers in your vertical, and will pricing scale reasonably as you grow.",
          "score": 1,
          "created_utc": "2025-12-31 07:46:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx8kqjl",
              "author": "Old_Inspection1094",
              "text": "Super helpful breakdown, appreciated!. Everyone shows the happy path but nobody talks about handling the twenty percent kicked to manual review. Your LLM document review callout is timely since we're seeing lots of vendors pitch this with vague metrics.",
              "score": 1,
              "created_utc": "2026-01-02 11:31:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx00bj0",
          "author": "fatboysuns",
          "text": "Which market?\nB2b or b2c?\nCredit, deposits or crypto?\n\nThere are more ingredients. I would suggest to start with this before going down the stack",
          "score": 1,
          "created_utc": "2025-12-31 23:48:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx8l9ke",
              "author": "Old_Inspection1094",
              "text": "We're B2B fintech doing embedded payments for mid market SaaS. Primary markets are US and EU with LATAM expansion planned. Mix of banking partnerships and direct compliance depending on jurisdiction.",
              "score": 1,
              "created_utc": "2026-01-02 11:35:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pz2kst",
      "title": "Found 20+ Operator roles at top FinTechs - Revolut, Cash App, Affirm, etc.",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pz2kst/found_20_operator_roles_at_top_fintechs_revolut/",
      "author": "TurnoverOptimal",
      "created_utc": "2025-12-30 00:03:22",
      "score": 10,
      "num_comments": 3,
      "upvote_ratio": 0.92,
      "text": "Hey everyone,\n\nI’ve been manually tracking top operator roles (BizOps, Chief of Staff, Partnerships, Risk/Compliance) at the best FinTech companies because I was tired of digging through generic listings on LinkedIn.\n\nI realized others might find this useful, so here is the list I pulled for this week. If you want the full list (with links to the applications) sent to your inbox, you can grab it here: [https://fintech-operators.beehiiv.com/p/issue-4](https://fintech-operators.beehiiv.com/p/issue-4)\n\n**Business Operations & Strategy**\n\n* Business Operations, Column (Infrastructure, Private), SF\n* Strategy & Operations Manager, Revolut (Neobank, Series E+), NYC\n* Biz Ops Manager, Sofi (Neobank, Public), Multiple Locations\n* Strategy & Ops Manager, Robinhood (Exchange, Public), Multiple Locations\n\n**Chief of Staff**\n\n* Chief of Staff, Casap (Fraud, Series A), SF or NYC\n* Director & Chief of Staff, AssetMark (Wealth Management, PE-Backed), Bay Area\n* Chief of Staff - R&D, Addepar (Wealth Management, Series G), Remote\n* Chief of Staff (Marketing), Xsolla (Payments, Private), Los Angeles\n* Chief of Staff - Automotive, Experian (Consumer Credit, Public), Remote\n* Chief of Staff, Juniper Square (Private Markets, Series D), SF\n\n**Growth & Partnerships**\n\n* Strategic Alliance & Partnerships Manager, Affirm (BNPL, Public), Remote\n* Growth, Column (Infrastructure, Private), SF\n* VC Partnerships Manager, Rho (B2B Banking, Series B), NYC\n\n**Risk & Fraud**\n\n* Senior Operations Risk Manager, Affirm (BNPL, Public), Remote\n* Fraud Team Lead - FinCrime, Adyen (Payments, Public), Multiple Cities\n* Compliance Ops KYC Program Manager, Cash App (Neobank, Public), SF\n* Senior Risk Manager, Wise (Payments, Public), Austin\n\nI’m going to try and do this every week. Hope this helps anyone looking!\n\nFull List here!  \n[https://fintech-operators.beehiiv.com/p/issue-4](https://fintech-operators.beehiiv.com/p/issue-4)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pz2kst/found_20_operator_roles_at_top_fintechs_revolut/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nwol0nt",
          "author": "Pale_Neat4239",
          "text": "This list is gold for understanding where partnerships and integration work actually happens. Notice how many of these roles focus on vendor orchestration, not just product management. The companies winning at scale are the ones treating their ops/partnerships folks as core infrastructure, not overhead. That's where integration strategy gets embedded early.",
          "score": 1,
          "created_utc": "2025-12-30 05:26:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwusnl2",
              "author": "TurnoverOptimal",
              "text": "Agreed on using JDs as a way to learn more about career paths and what companies are focusing on.",
              "score": 1,
              "created_utc": "2025-12-31 03:41:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwr6nhz",
          "author": "iamzamek",
          "text": "Seems good. Do you have any contact with them? I know a top guy for fintech and would be more than happy to recommend him.",
          "score": 1,
          "created_utc": "2025-12-30 16:36:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxxdln",
      "title": "The Best IPTV Service Subscription In 2025 - How to Find Verified IPTV Provider",
      "subreddit": "fintech",
      "url": "/r/AndroidHelp/comments/1pvqzbc/the_best_iptv_service_subscription_in_2025_how_to/",
      "author": "susei_donal",
      "created_utc": "2025-12-28 17:44:16",
      "score": 9,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pxxdln/the_best_iptv_service_subscription_in_2025_how_to/",
      "domain": "",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1puvn0y",
      "title": "Developer specializing in fintech.",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1puvn0y/developer_specializing_in_fintech/",
      "author": "Deep-Extent4283",
      "created_utc": "2025-12-24 19:44:11",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 0.88,
      "text": "Any developers who have already created a fintech company want to exchange ideas?\n\nI can also pay for consulting 🫡",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1puvn0y/developer_specializing_in_fintech/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nvsscvo",
          "author": "therealshadyman",
          "text": "What specifically are you looking for?",
          "score": 1,
          "created_utc": "2025-12-25 00:16:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvtbcrh",
          "author": "NegativeNebula7589",
          "text": "I'm working for the Fintech company, specializes in payment in Japan\n\nWhat would you like to exchange?",
          "score": 1,
          "created_utc": "2025-12-25 02:37:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvurz8k",
          "author": "kyyza",
          "text": "Product Engineer here working at a successful B2B2C investment platform in the UK - happy to talk!",
          "score": 1,
          "created_utc": "2025-12-25 10:50:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvw5u5o",
          "author": "SnowMinimum2364",
          "text": "Happy to jam. What are you building, and where are you stuck right now (idea, compliance, data access, payments, underwriting, onboarding)? Happy to lend a hand.",
          "score": 1,
          "created_utc": "2025-12-25 17:07:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvzarz7",
          "author": "BD_RemitOS",
          "text": "Happy to explore possible synergies. Let me know your thought process, and will be catering to you as we are fully into fintech and payments",
          "score": 1,
          "created_utc": "2025-12-26 05:14:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvzxz3u",
          "author": "yuridrabik",
          "text": "A SaaS tech founder behind a stock market research platform here. In case you are in a similar space I’m open for a chat.",
          "score": 1,
          "created_utc": "2025-12-26 08:53:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwi5yab",
          "author": "KarinaOpelan",
          "text": "Happy to connect, i’ve been around fintech long enough to know the hardest parts usually aren’t the code but everything around it. Banks, compliance, payments, all the fun stuff no one warns you about, curious what you’re building and what you’re trying to figure out right now.",
          "score": 1,
          "created_utc": "2025-12-29 06:34:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pylr3h",
      "title": "Does faster liquidation actually make digital lending safer?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pylr3h/does_faster_liquidation_actually_make_digital/",
      "author": "Medium-Door2236",
      "created_utc": "2025-12-29 13:02:56",
      "score": 5,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "Many fintech lending platforms use rapid margin calls and automated liquidation to control credit risk. During volatile markets, does speed truly reduce losses, or can it amplify selling pressure and market stress? Curious how others view this trade-off from a risk management perspective.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pylr3h/does_faster_liquidation_actually_make_digital/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nwjh729",
          "author": "Serif222",
          "text": "What market would you refer to? If something like an S&P500 index fund liquidity is no issue. Fast sells are beneficial, interested to hear others’ perspectives if other issues.",
          "score": 1,
          "created_utc": "2025-12-29 13:22:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwogysd",
              "author": "Medium-Door2236",
              "text": "In very liquid markets like the S&P 500, fast selling usually works because liquidity is deep and exits aren’t crowded. Problems tend to appear in less liquid assets, concentrated positions, or leveraged credit, where speed can amplify price moves instead of reducing risk.  \nShould fast liquidation be treated as a market-specific tool, effective in highly liquid indices but risky elsewhere?",
              "score": 2,
              "created_utc": "2025-12-30 04:58:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwjnlem",
          "author": "manan34",
          "text": "Speed helps individual lenders, but it doesn’t automatically make the system safer.\n\nFast liquidation works when three things are true:\n\t1.\tthe collateral is highly liquid,\n\t2.\tliquidation happens before everyone else hits the exit, and\n\t3.\tbehavior is uncorrelated.\n\nIn reality, especially in digital lending, those assumptions break quickly.\n\nWhat we’ve seen in practice is that faster liquidation reduces idiosyncratic risk but increases systemic risk. When everyone runs the same triggers, uses the same models, and liquidates at the same thresholds, speed becomes a feedback loop, not a safety net.\n\nThe safer design isn’t “faster sell,” it’s smarter containment:\n\t•\texposure limits tied to real cash-flow, not just mark-to-market prices\n\t•\tstaggered or conditional liquidation, not cliff-edge margin calls\n\t•\trecovery mechanisms aligned to how borrowers actually earn and repay, not how markets panic\n\nIn SME and real-economy lending especially, you don’t win by dumping assets faster, you win by structuring repayment and recovery so liquidation is the last resort, not the first reflex.\n\nSpeed is a tool. Governance, structure, and incentives decide whether it stabilizes the system or blows it up.",
          "score": 1,
          "created_utc": "2025-12-29 14:01:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwogras",
              "author": "Medium-Door2236",
              "text": "Speed helps individual lenders, but it doesn’t automatically make the system safer. Fast liquidation can reduce single-loan risk, yet when everyone uses the same models and triggers, it turns into a feedback loop that increases systemic risk—especially in digital and SME lending. In these cases, smarter containment matters more than faster selling: cash-flow-based exposure limits, staggered liquidations, and recovery structures that reflect how borrowers actually repay.  \nShould fintech lenders focus more on cash-flow-based risk management than ultra-fast liquidation to reduce systemic risk?",
              "score": 1,
              "created_utc": "2025-12-30 04:56:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwspwuh",
          "author": "fredericnoel1973",
          "text": "Not always. Faster liquidation can cut losses by limiting deterioration, but in volatile markets it can trigger fire sales, pushing prices down and increasing systemic stress.",
          "score": 1,
          "created_utc": "2025-12-30 20:56:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtcihv",
          "author": "Lee_at_Lantern",
          "text": "Speed is a double-edged sword here. Yes, faster liquidation limits the lender's downside during a crash, but it also creates cascading sell pressure that can turn a dip into a rout. Anyone who's watched a flash crash accelerate as margin calls trigger more margin calls has seen this play out.\n\nThere's also a misaligned incentive problem: many platforms charge liquidation fees, which means they actually profit when borrowers get liquidated. That's a perverse incentive to be trigger-happy rather than work with borrowers through volatility.\n\nThe counterargument is that giving borrowers time to respond can actually reduce total liquidations. If someone gets a margin call and has 72 hours to add collateral or make a payment, many will cure the position rather than lose it. Instant liquidation removes that option entirely, and you end up selling borrowers out at the worst possible moment.\n\nI work at Lantern Finance (crypto-backed lending) and we deliberately built in a 3-day grace period after margin calls for this reason. We also don't charge liquidation fees, so there's no incentive on our end to liquidate aggressively. Our view is that working with borrowers during volatility beats racing to sell them out.\n\nDifferent risk tolerance, different approach. Neither is objectively \"right\" but I think the industry often defaults to speed without questioning whether it's actually optimal for either party.",
          "score": 1,
          "created_utc": "2025-12-30 22:45:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx1ct31",
              "author": "Medium-Door2236",
              "text": "Speedy liquidations protect lenders, but they can also amplify market crashes by triggering cascading sell pressure. Platforms that profit from liquidation fees may be incentivized to liquidate aggressively rather than work with borrowers during volatility.\n\nModels with a grace period after margin calls, like Lantern Finance’s 3-day window with no liquidation fees, aim to reduce forced selling and allow borrowers to cure positions. This can lower total liquidations and improve outcomes in volatile markets.  \nIn crypto-backed lending, do grace periods and borrower-friendly liquidation models reduce systemic risk compared to instant liquidations, or do they simply delay losses in extreme market crashes?",
              "score": 1,
              "created_utc": "2026-01-01 05:15:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx4mhie",
                  "author": "Lee_at_Lantern",
                  "text": "That's the right question, and we actually just got real-world data on this.\n\nDuring the October 10th crash, not a single Lantern borrower got liquidated. Some hit margin call territory, but because they had time to respond, they added collateral. Then prices recovered. If we'd had instant liquidations, those borrowers would have been sold out at the bottom and missed the recovery entirely.\n\nThat's the scenario where grace periods shine: sharp volatility that reverses. Instant liquidation locks in losses at the worst moment, while a grace period lets borrowers and markets stabilize.\n\nIn a prolonged decline where prices don't recover, grace periods are less of a magic bullet. But even then, spreading liquidations over time reduces the cascade effect where forced selling accelerates the crash.\n\nSo to directly answer your question: grace periods reduce systemic risk in most volatility scenarios. The October crash was a real test and the model worked exactly as intended.",
                  "score": 1,
                  "created_utc": "2026-01-01 19:40:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwvjb0d",
          "author": "WTF-US",
          "text": "This is the classic \"Micro-prudential vs. Macro-prudential\" paradox. From a platform's specific P&L perspective, yes, millisecond automated liquidation reduces bad debt exposure. It's great for the balance sheet in isolation.\nHowever, from a systemic risk perspective, it can be disastrous.",
          "score": 1,
          "created_utc": "2025-12-31 06:52:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx21fvf",
              "author": "Medium-Door2236",
              "text": "This highlights the micro-prudential vs macro-prudential risk trade-off in digital lending and margin finance. Automated liquidations protect individual platform balance sheets, but synchronized selling can increase market volatility and systemic risk across the ecosystem.  \nShould digital lending platforms and LAS systems prioritize market stability alongside balance-sheet protection?",
              "score": 1,
              "created_utc": "2026-01-01 09:14:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q1qax2",
      "title": "Where Is the Next Investment Frontier?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1q1qax2/where_is_the_next_investment_frontier/",
      "author": "2zemoonwego",
      "created_utc": "2026-01-02 05:31:49",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "What, in your opinion, has the potential to become the next transformative investment opportunity, like Bitcoin?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1q1qax2/where_is_the_next_investment_frontier/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1pusydy",
      "title": "All-in-one portfolio app showing bank, crypto, stock, and real-estate holdings; gives insights, transfers, and tax summaries via secure API integrations.",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pusydy/allinone_portfolio_app_showing_bank_crypto_stock/",
      "author": "DiagramFeedbackLab",
      "created_utc": "2025-12-24 17:43:58",
      "score": 5,
      "num_comments": 12,
      "upvote_ratio": 0.86,
      "text": "I keep running into the same frustration and want to sanity-check if it’s just me.\n\n\n\nBetween:\n\n– bank accounts\n\n– investment accounts\n\n– crypto wallets\n\n– real estate\n\n– tax implications\n\n\n\neverything lives in different systems, with different update cycles and visibility.\n\n\n\nMost tools I’ve tried either:\n\n– only cover one asset class well\n\n– break when accounts change\n\n– give numbers but no real insight or action\n\n– become useless at tax time\n\n\n\nI’m curious:\n\n• What’s the hardest part of tracking your full net worth today?\n\n• Is it aggregation, accuracy, security, taxes, or something else?\n\n• Has anyone found a setup that actually \\*sticks\\* long-term?\n\n\n\nNot selling anything — genuinely trying to understand where existing tools fall short.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pusydy/allinone_portfolio_app_showing_bank_crypto_stock/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nvrz2ur",
          "author": "crd_battle",
          "text": "Well honestly I am facing same kind of thing , so if there is no answer then build one .",
          "score": 1,
          "created_utc": "2025-12-24 21:06:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nweigxe",
              "author": "mfayzanasad",
              "text": "wer'e working on one already at [moneymappr.com](http://moneymappr.com) (everything except taxes for now)",
              "score": 1,
              "created_utc": "2025-12-28 18:25:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwl7jdt",
                  "author": "DiagramFeedbackLab",
                  "text": "Nice — appreciate you sharing.  \nOne thing I keep running into is cost-basis accuracy and API breakage over time, especially across brokers + crypto.  \nCurious what you’ve found hardest so far to keep reliable long-term?",
                  "score": 1,
                  "created_utc": "2025-12-29 18:35:41",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvvfrxz",
          "author": "jpmasud",
          "text": "But where do you get secure api integrations from?",
          "score": 1,
          "created_utc": "2025-12-25 14:22:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw61g96",
              "author": "DiagramFeedbackLab",
              "text": "That’s exactly the hard part.\n\nFrom what I’ve seen, most tools either:  \n• rely on open-banking aggregators (with their own limits), or  \n• fall back to manual entry when things get complex\n\nI’m trying to understand whether people would prefer:  \n• fewer integrations that are rock-solid, or  \n• broader coverage with partial/manual workflows\n\nCurious what tradeoff you’ve found acceptable so far.",
              "score": 1,
              "created_utc": "2025-12-27 09:40:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw3hcmp",
          "author": "fz1z4",
          "text": "You're asking for a lot. Specifically with the somewhat generic points around \"tax implications\" and \"insights/actions\"... what exactly are you hoping for here? Genuine question.\n\n  \nYea there's lots of trackers with open-banking type APIs available for NW tracking (investment accounts, crypto, and perhaps somewhat manual insertion of RE). But beyond that it's a bit overkill.",
          "score": 1,
          "created_utc": "2025-12-26 22:32:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyvd4a",
      "title": "Bridging digital-asset inflows to EUR: Keytom vs Trastra from a fintech angle",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pyvd4a/bridging_digitalasset_inflows_to_eur_keytom_vs/",
      "author": "MDiffenbakh",
      "created_utc": "2025-12-29 19:19:35",
      "score": 4,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "For solo founders, freelancers, and small online businesses, alternative payment rails are becoming common — especially with cross-border clients. The real challenge starts after funds arrive: converting them efficiently into EUR, keeping fees predictable, and integrating with existing banking workflows.\n\nI’ve been comparing Keytom and Trastra as EUR on/off-ramp solutions. Both provide EUR IBANs and cards, but their product focus is quite different.\n\n**Keytom**  \nFeels designed around operational efficiency. Named EUR IBAN, asset wallets and conversion in a single interface, transparent rates, free SEPA Instant transfers, and a virtual card. The product minimizes friction in the receive → convert → transfer/spend loop. From a fintech perspective, it’s clearly optimized for frequent flows and back-office style usage rather than consumer spending.\n\n**Trastra**  \nMore card-led in its design. Conversion to a EUR IBAN paired with a Visa card usable online, in-store, and at ATMs (Apple Pay supported). UX mirrors traditional debit products, which lowers the learning curve. However, fixed fees on SEPA transfers, FX, and ATM usage can make cost modeling less favorable for high-frequency or low-ticket transactions.\n\n**Product takeaway**  \nKeytom leans toward infrastructure-like efficiency for EUR liquidity management within the EEA. Trastra prioritizes end-user spending convenience. Both sit at the intersection of alternative payments and traditional banking and require KYC and country eligibility.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pyvd4a/bridging_digitalasset_inflows_to_eur_keytom_vs/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1pupwt8",
      "title": "EU payment institution froze account after pre-approval — 1 month, no response. What are my options?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pupwt8/eu_payment_institution_froze_account_after/",
      "author": "Agreeable_Kale_182",
      "created_utc": "2025-12-24 15:28:01",
      "score": 4,
      "num_comments": 10,
      "upvote_ratio": 0.84,
      "text": "Hello, I’m posting here to ask for general advice and to understand whether others in the EU fintech space have experienced something similar.\n\nI am an EU customer (Italy) of a Belgium-licensed payment institution. Before making two international transfers, I contacted customer support and received explicit confirmation that the payments were allowed. I then completed two outgoing transfers of USD 4,400 each to a supplier for personal-use goods.\n\nShortly after, my account was restricted without prior notice or explanation. Since then:\n\n• Access to my remaining balances (over €12,000) has been blocked  \n• I cannot withdraw the funds myself  \n• I was told the case was “under review”  \n• Later I was informed the account would not be reopened, without specific reasons  \n• Communication has since stopped entirely\n\nMore than 1.5 months have passed, and the remaining funds have not been returned. I followed the institution’s internal complaints process and escalated the matter to the relevant Belgian consumer and financial authorities under the PSD2 framework.\n\nI am not accusing anyone of wrongdoing — I understand compliance reviews are sometimes necessary. My question is more practical:\n\n**In the EU context, what are realistic next steps when a payment institution restricts an account and significantly delays returning customer funds after closure?**\n\nAny insight from people familiar with EU fintech, compliance, or similar cases would be appreciated.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pupwt8/eu_payment_institution_froze_account_after/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nvqaqcl",
          "author": "Agreeable_Kale_182",
          "text": "For clarity, the institution involved is Wise Europe SA (Belgium-licensed). I avoided naming it in the post itself to keep the discussion focused on EU fintech processes rather than a specific brand.",
          "score": 1,
          "created_utc": "2025-12-24 15:32:28",
          "is_submitter": true,
          "replies": [
            {
              "id": "nw0ap9f",
              "author": "mustymajority",
              "text": "That's rough, Wise can be pretty brutal with their compliance stuff once they decide you're flagged. The Belgian regulator route was smart but they move slow as hell - might want to also file with your local Italian authorities since you're the customer there. €12k held for 1.5 months without explanation is getting into \"lawyer time\" territory honestly",
              "score": 1,
              "created_utc": "2025-12-26 11:05:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvre0on",
          "author": "PocoLoco1",
          "text": "Everyone that’s run a regulated financial institution in the UK or Europe knows *exactly* what Wise is doing here.",
          "score": 1,
          "created_utc": "2025-12-24 19:03:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw5mv9d",
              "author": "hurryupiamdreaming",
              "text": "and what are they doing there?",
              "score": 1,
              "created_utc": "2025-12-27 07:19:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvy67gf",
          "author": "frey79",
          "text": "The EU is a totalitarian shithole these days. People have bank accounts closed regularly for all sorts of reasons. The EU banking regulations when it comes to surveillance of customers is simply so demanding that it’s not worth for banks (or payment providers) to keep customers who deviate the slightest from some predetermined profile their operations are optimized for. The same EU rules also do not have any provisions for customer rights or transparency. Surveillance and control takes priority.",
          "score": 1,
          "created_utc": "2025-12-26 00:29:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw8xfis",
              "author": "bumboclaat_cyclist",
              "text": "The worst part is once you trigger this sort of action they will not explain shit to you and just not engage at all.",
              "score": 1,
              "created_utc": "2025-12-27 20:28:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw8yb0c",
                  "author": "frey79",
                  "text": "This is a fundamental flaw of the EU AML legislation. It gives banks (and other businesses) unrestricted rights to deny service with no requirements for transparency. At the same time, this contradicts anti-discrimination laws as businesses can freely discriminate while hiding behind AML rules. It completely removes due process from society by outsourcing law enforcement to unaccountable private entities.",
                  "score": 1,
                  "created_utc": "2025-12-27 20:33:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw840bg",
          "author": "fredericnoel1973",
          "text": "Send a formal written demand for payout date + final complaint. Escalate to Ombudsfin (BE financial ombudsman) and the NBB/FSMA. If funds still withheld after a set deadline, involve a lawyer and file EU small‑claims/civil action.",
          "score": 1,
          "created_utc": "2025-12-27 17:56:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw8dvoh",
          "author": "Agreeable_Kale_182",
          "text": "I have already taken all possible steps.  In addition, contact a lawyer and file an application with the court. The Belgian Ombudsman has not yet responded to my letter.",
          "score": 1,
          "created_utc": "2025-12-27 18:45:53",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "nwr5j8a",
          "author": "Agreeable_Kale_182",
          "text": "Update: funds received. Case resolved.",
          "score": 1,
          "created_utc": "2025-12-30 16:31:28",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1pva7ac",
      "title": "Potential valuation for a very early stage personal finance fintech app",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pva7ac/potential_valuation_for_a_very_early_stage/",
      "author": "Ambitious_Gain_7500",
      "created_utc": "2025-12-25 10:00:36",
      "score": 4,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Hey all,\n\nNew member over here.\n\nI have been doing some research and I was curious if a fintech or RIA wanted to acquire an  open banking based financial wellness app instead of building it, what valuation range is reasonable? The platform is mobile first platform, cloud native and feature rich. Any information on this would be helpful! Thanks.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pva7ac/potential_valuation_for_a_very_early_stage/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nvvznmz",
          "author": "emperorOfTheUniverse",
          "text": "0\n\nNegative money probably actually. Presumably you have costs.",
          "score": 5,
          "created_utc": "2025-12-25 16:30:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw0e31n",
          "author": "reewona",
          "text": "Valuation of pre-revenue financial platforms is really difficult to assign some type of metric to. In such a case you are likely to be projecting value based on future key assumptions such as  significant market need, product-solution fit for financial services, founding team's fintech expertise, scalable business model, and path to monetisation amid regulations. \n\n\nI would advise running a pilot at least to validate key assumptions. If still doesn't address all issues but gives a less shaky framework for making certain assumptions. \n\n\nYou will also want to see comparable businesses which have sold at similar stages as they can help establish range. ",
          "score": 2,
          "created_utc": "2025-12-26 11:38:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw2avsi",
              "author": "Ambitious_Gain_7500",
              "text": "Thanks.",
              "score": 1,
              "created_utc": "2025-12-26 18:41:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw4xj21",
          "author": "Single_Order5724",
          "text": "No revenue a personal finance app is just an expense hence why Goldman Sachs left the space before Marcus was a personal finance networth app",
          "score": 2,
          "created_utc": "2025-12-27 03:58:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvuoft1",
          "author": "meninblck9",
          "text": "With no revenues it’s impossible to value your business. You might have IP with value but that’s subjective. Your best bet would be to approach  focus financial partners or dynasty financial and see if they bite. Maybe even Carson wealth mgmt",
          "score": 1,
          "created_utc": "2025-12-25 10:12:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyeue4",
      "title": "Software Engineering (or similar) or Finance?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pyeue4/software_engineering_or_similar_or_finance/",
      "author": "SadReception2782",
      "created_utc": "2025-12-29 06:24:30",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Hey everyone, I'd like your opinion on this decision I've been considering for a while now.\n\nI'm going to share a bit about my background and the skills I believe I possess, as well as my future goals.\n\nI'm really interested in the world of investments and finance (especially Fintech). I've never made an investment in my life, but I'm willing to learn what's necessary. Regarding programming, I'm very drawn to creating technologies, applications, or programs, but I have almost no experience in that area, and I've never been very logical or technical. In fact, I lean more towards the creative side, and I'm aware that this type of engineering is more mathematical or technical, but I think I'm motivated by the idea of ​​learning something completely new and combining both the technical and creative aspects to create something more innovative, or combining my interest in finance and programming to specialize in Fintech. Additionally, I'd like to gain experience working remotely (and be able to travel while working), but I don't just want to work as a freelancer; I'd also like to lead a team or a project.\n\nFurthermore, I highly value soft skills and believe they are essential in any career. I really enjoy sales and entrepreneurship, and I'd like to start or integrate businesses in the future. I consider myself a sociable person and would like to improve my public speaking and negotiation skills.\n\nSo, choosing a career that complements my vision and the skills I want to learn (IT, Finance, and Business) is proving difficult. I was considering a solid foundation in technology (Engineering) and taking courses or certifications in other areas (Fintech or Business), but I've realized that many people know how to program and create things without a university degree. I'd also like to gain work experience in the tech field, and I'm not sure how necessary a degree is. I know people who didn't learn at university, and they say there's a lot of filler there, and it's very complicated, only to end up still being a junior and having to take courses elsewhere.\n\nMy other option is a degree in Finance (focused on technology especially), like Quantitative Finance or something related. But many people think you can learn Finance with just a master's degree or certificates, so I don't know if a full degree is worth it, especially considering that traditional Finance is becoming almost obsolete. If I do pursue this degree, I'd like to take separate programming courses (and try to reach a senior level), but I don't know how effective that would be without a degree.\n\nI need your help, please.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pyeue4/software_engineering_or_similar_or_finance/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nwj6bi2",
          "author": "emperorOfTheUniverse",
          "text": "Go get a degree in finance. \n\nYou sound young enough that you have no idea about just how much you have no idea about anything. Go to school.",
          "score": 2,
          "created_utc": "2025-12-29 12:03:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkba6s",
          "author": "logoutsignout",
          "text": "Go and do software engineering first, then master it and do a PhD in Financial Engineering and you are good to go.",
          "score": 2,
          "created_utc": "2025-12-29 16:04:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkkmk1",
          "author": "ewq2140",
          "text": "Take a coursera class (or two) in finance (maybe an introduction to financial statement analysis, valuation, or corporate finance) and take a courses class or two in the technical realm (human computer interaction for ux, or something about a programming language). Since you’re young it’s important to try to get a legitimate taste of both in my opinion, instead of just planning it out in your head. Everything sounds cool in theory. I wish someone would have been around to give me this advice when i was 19-20.",
          "score": 2,
          "created_utc": "2025-12-29 16:49:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjxjt7",
          "author": "Lost-Bicycle-7610",
          "text": "i'm working for a bank, i learned finance by myself.",
          "score": 1,
          "created_utc": "2025-12-29 14:56:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwk8hn1",
          "author": "this_guy_sews",
          "text": "A (good) degree in Computer Science will give you strong foundations which will likely be all the more important in the age of AI.\n\n\nAs to pursuing Finance vs Software, do you see your future self as a Finance expert who can develop software, or a Software Engineer with a background in Finance? There's no wrong choice here, just different outcomes.",
          "score": 1,
          "created_utc": "2025-12-29 15:51:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwknlj0",
          "author": "Finabro",
          "text": "Finance is a broad term. If you want to go down the quant /software route, advanced computer science, statistics, mathematics, economics with econometrics focus, and financial engineering, will be good choices. If you go non-computer science; make sure to at least compliment your degree with a minor in computer science. You won't be doing IB/PE/Consulting with that approach -- there are exceptions, but almost guaranteed to not be the case.\n\nTraditional finance is still around, strong as ever, although it has evolved. People just conflate the term because for example if you go to law school, you can be any type of lawyer. They assume the same about finance, but it's really not the case. Corporate Finance is really just Management Accounting (which is where the cliche of Accounting can do Finance, but not the other way around, primarily comes from). Investment Finance is more traditional finance. Investment Banking / Advisory / Wealth Management, is primarily Sales. Financial Engineering mathematical optimizations, in other words calculus heavy. Quantitative finance, statistics heavy, with a lot of firms literally knowing almost nothing about finance in a meaningful sense, but boy can they tell you about market patterns.\n\nYou won't learn \"finance\" from a certificate, these areas are heavy in content (albeit at differing levels of technical difficulty). If you want the quantitative finance / software engineering route, you want to get at very least a Masters Degree; you'll have openings on either the Software side or the model side of the business; few of the folks that broke in actually had PhDs. But if you were to want Investment Banking, it would be a total waste.",
          "score": 1,
          "created_utc": "2025-12-29 17:03:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwo6qdb",
              "author": "AdCold9811",
              "text": "Hey , I’m a business analyst working in financial risk management. I am at the intersection of business and tech. I want to be future ready which is AI but also want to What sort of areas should I target ? In my current role I’ve learned the soft skills part of it and everything that’s required to successfully automate a manual process ,also learned risk management practices. But I’m having anxiety as to what skills should I target next .",
              "score": 1,
              "created_utc": "2025-12-30 03:53:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwoe84w",
                  "author": "Finabro",
                  "text": "Sounds like you've got a great start. My two cents would be think less about collecting a raw list of skills and to focus more on having an idea of where it is where you want to go. If you're already where you want to be, ask yourself where do you want to bring the team / projects you're working on.\n\nTechnology has and will likely continue to move at 100 miles per hour; trying to stay up-to-date on everything is a losing battle. Figure out what technologies your company is using, learn the general principles you can apply everywhere, then execute and optimize with the technology being used at the local level.\n\nBeing an expert at Rust when your department only uses C# and Python isn't going to help you much. You can leverage general principles to speed you along, but that's about it.",
                  "score": 1,
                  "created_utc": "2025-12-30 04:40:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pwqfhr",
      "title": "From Hollywood to Algorithms: Disney Partners with OpenAI",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pwqfhr/from_hollywood_to_algorithms_disney_partners_with/",
      "author": "Scary_Bus4383",
      "created_utc": "2025-12-27 06:01:24",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "Disney has reportedly invested $1B in OpenAI, allowing its iconic IP to be used within Sora, OpenAI’s generative video platform.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pwqfhr/from_hollywood_to_algorithms_disney_partners_with/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1pvvfl9",
      "title": "What Volume Caps Mean in High-Risk Merchant Accounts",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pvvfl9/what_volume_caps_mean_in_highrisk_merchant/",
      "author": "Internal_Ad9214",
      "created_utc": "2025-12-26 04:26:53",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Volume caps are common in high-risk merchant accounts and are designed to limit sudden financial exposure for banks and processors. These caps define how much you can process daily or monthly. Exceeding approved limits without prior notice can trigger account reviews, temporary holds, or even freezes. Gradual, predictable growth helps processors assess risk safely and maintain long-term account stability.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pvvfl9/what_volume_caps_mean_in_highrisk_merchant/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nvzdhhq",
          "author": "Pale_Neat4239",
          "text": "Good primer on volume caps. One thing I'd add: volume caps are really just one dimension of a tiered risk framework that processors use to manage exposure before you hit their internal models for full underwriting.\n\n\n\nWhat's interesting from a product perspective is that volume caps are becoming less rigid tools and more dynamic thresholds. We're seeing processors move toward velocity-based constraints that adjust based on:\n\n\n\n\\- Transaction success rates\n\n\\- Chargeback ratios\n\n\\- Geographic risk patterns\n\n\\- Behavioral analytics\n\n\n\nInstead of \"you're capped at $X/month,\" it's more \"your limit is $X based on your current risk profile, but if you hit Y success rate, it increases automatically.\"\n\n\n\nThis matters for merchants because it changes the game from \"hit the ceiling and get frozen\" to \"prove lower-risk behavior and earn higher limits.\" But it also means processors need better real-time risk scoring to manage their exposure dynamically.\n\n\n\nFor fintech platforms building on top of payment processors, this is where API integration with processor risk engines becomes critical. You need to surface these dynamic limits to merchants, explain the rules, and sometimes even help them optimize their transaction mix to improve their risk score over time.",
          "score": 2,
          "created_utc": "2025-12-26 05:37:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw0au0w",
          "author": "Vaddawg",
          "text": "If you are concerned about high tickets or volumes then think creatively.  What markets deal with these problems on a constant basis?  One example would be commercial insurance companies.  Who do they process payments with?  Well in the US there are 3 major players.  ePayPolicy, Input1, and Applied Pay.  If you have the Financials to back your product you can always find processors that don't care about you volume and make high ticket nightmares a thing of the past.",
          "score": 1,
          "created_utc": "2025-12-26 11:06:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwi32v7",
          "author": "manan34",
          "text": "This is exactly where most merchant programs break, volume caps aren’t a risk tool, they’re a blunt instrument.\n\nThe real issue isn’t *how much* a merchant processes, it’s whether the growth is explainable, financeable, and reconcilable.\n\nAt Trazmo, we work with banks and platforms to move beyond static volume caps by:\n\n* Financing growth instead of blocking it\n* Tying limits to real transaction data and payout cycles\n* Using ledger-first reconciliation so exposure is always known, not guessed\n* Scaling small-ticket volume safely instead of freezing accounts when things finally go well\n\nHigh-risk doesn’t mean “cap and pray”, it means design for velocity with controls baked in.\n\nHappy to compare notes if others here are building merchant finance or high-volume payment programs.",
          "score": 1,
          "created_utc": "2025-12-29 06:11:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pu3m2r",
      "title": "Keytom vs Nebeus: which crypto-fiat bridge wins for daily flows?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pu3m2r/keytom_vs_nebeus_which_cryptofiat_bridge_wins_for/",
      "author": "MDiffenbakh",
      "created_utc": "2025-12-23 20:03:35",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Ran into both Keytom and Nebeus while sorting out a smoother way to handle crypto alongside regular banking—think IBAN accounts, swaps, and cards without constant app-switching. Nebeus packs a ton upfront: multi-currency support for fiat and coins, named IBANs, easy swaps, plus yields, lending, and even subscriptions if you're parking cash long-term. It acts like a one-stop finance spot, great for earning a bit while shuffling money around, but it gets cluttered for basic stuff like deposit-swap-withdraw, and heavier fiat use kicks in paid tiers.\n\nKeytom keeps it stripped down by design—EUR IBAN account, crypto/stablecoin wallets, straightforward fiat swaps, instant SEPA outs, and a virtual card to spend direct. No bells like staking or loans; it's pure routing: load up, convert what you need, push to bank or tap the card. Fees pop up clear before every action, and there's a referral perk for steady users, making costs predictable without the bloat.\n\nPick Nebeus if you want the full toolkit in one app—multi-currency, extras for growth, and you're cool with some complexity or upgrading plans. Go Keytom for no-frills crypto-to-EUR plumbing that just works fast on receives, swaps, and payouts. Both need KYC and supported-country residency (EU/UK heavy, check restrictions elsewhere), so they're not global wildcards. They could even stack: Nebeus for holding/earning, Keytom for quick ramps.\n\nAnyone using these in fintech stacks?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pu3m2r/keytom_vs_nebeus_which_cryptofiat_bridge_wins_for/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1pyt3di",
      "title": "Best platform for programmatic ACH payments in a B2B SaaS context?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pyt3di/best_platform_for_programmatic_ach_payments_in_a/",
      "author": "Remote-Jellyfish-455",
      "created_utc": "2025-12-29 17:56:38",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Building a platform that needs to handle ACH payments between businesses - collecting payments from one party and eventually settling with another.\n\nLooking at options like Dwolla, Column, Modern Treasury, Increase, etc.\n\nKey requirements:\n\n* API-first\n* Handle both debits and credits\n* Good sandbox/testing environment\n* Reasonable pricing for a startup\n\nFor those who've implemented this: What did you go with and why? Any regrets or things you wish you knew before choosing?\n\nAlso - where do you go to learn about this stuff beyond the docs? Found it surprisingly hard to find good resources comparing these options.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pyt3di/best_platform_for_programmatic_ach_payments_in_a/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nwm4w1k",
          "author": "kraph",
          "text": "Straddle - feel free to dm me\n\nhttps://straddle.com/embed\nhttps://docs.straddle.com/guides/embed/overview",
          "score": 1,
          "created_utc": "2025-12-29 21:16:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q19een",
      "title": "Best AI data privacy platform for 2026?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1q19een/best_ai_data_privacy_platform_for_2026/",
      "author": "iTzAll_Gucci",
      "created_utc": "2026-01-01 17:19:53",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I’ve been looking into AI data privacy platforms that help organizations handle sensitive data safely as they roll out AI use cases. I feel like having a tool that automates privacy controls, discovery, and compliance is super useful/needed right now. I'm seeing a lot of tools come up in searches but Im curiious what people here are using or know about. \n\nIf you can share any insights on platforms or solutions, that would be awesome.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1q19een/best_ai_data_privacy_platform_for_2026/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nx42btv",
          "author": "Plus_Cat6736",
          "text": "It sounds like you’re on the right track looking for AI data privacy tools. It's such a hot topic now with all the emphasis on compliance. But honestly, there are so many options out there that it can get really overwhelming. Are you focusing more on automated compliance checks or privacy controls?",
          "score": 1,
          "created_utc": "2026-01-01 18:00:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx707sp",
              "author": "TestElectrical5830",
              "text": "Definitely leaning more toward automated compliance checks since manual auditing is such a pain - privacy controls are important too but compliance seems like the bigger headache to solve first",
              "score": 1,
              "created_utc": "2026-01-02 03:40:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx528jg",
          "author": "Plus_Cat6736",
          "text": "Not my area of expertise, but I'm also curious about the right tools for this. It's such a hot topic right now! Maybe try reaching out to compliance-focused communities or forums, they usually have some valuable input. Have you found any platforms that look promising so far?",
          "score": 1,
          "created_utc": "2026-01-01 21:01:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxchva4",
          "author": "dungeon_master101",
          "text": "Had somewhat similar use case. I don’t know about dedicated data privacy platforms but you can explore Microsoft azure encrypted data categories along with CMEK (Customer Managed encryption keys) if you are comfortable hosting on azure.\nHope this helps!",
          "score": 1,
          "created_utc": "2026-01-02 23:54:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q1w5zd",
      "title": "Building repayment infrastructure for informal credit in India — looking for feedback from fintech investors",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1q1w5zd/building_repayment_infrastructure_for_informal/",
      "author": "daya_donn",
      "created_utc": "2026-01-02 11:21:22",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 0.81,
      "text": "I’m building a fintech infrastructure platform focused on repayment, agreements, and recovery for India’s informal credit economy.\n\nThis is not a lending product. It sits behind lending — providing auto-debits, digital agreements, follow-up workflows, and recovery coordination so lenders (individuals or businesses) don’t have to manage repayment friction themselves.\n\nThe use cases range from:\n• Individuals lending to friends/family\n• MSMEs operating on supplier credit\n• Rental / subscription businesses\n• Marketplaces enabling credit-led transactions\n\nCurrent status:\n• Working prototype built\n• End-to-end flow tested (agreement → auto-debit → follow-up)\n• Early interest from B2B use cases where “Pay via [platform]” is embedded rather than built in-house\n• v1 preparing for launch\n\nI’ve previously built a startup that received a Government of India (SISFS) grant and raised external capital, so I’m approaching this as an infra-first, compliance-aware play.\n\nI’m primarily looking to hear from fintech investors or operators who’ve seen infra businesses scale in regulated markets:\n– What do you look for early in infra fintech?\n– Where do you see defensibility forming in credit-adjacent platforms?\n– What would you pressure-test first before pre-seed?\n\nHappy to share details 1:1 if relevant. Mainly here for thoughtful discussion.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1q1w5zd/building_repayment_infrastructure_for_informal/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nx976jf",
          "author": "m_corleone_22",
          "text": "Informal lending is mostly relationship or trust based. Recovery as well follows the same structure. A platform for auto debit and followups would make a impact if everything currently happens offline? Maybe theres a reason it is underserved? \n\nPlus the msme usecase is something that probably will have the most friction since its retailers and traders often have to do cash movement/rotation to buy other products or high margin or high volume products which is why they delay the payments. I personally if were in a retailers shoe wont so auto debit enablement on my account since it would either mean i will have no cash/money for other procurement or my account will have no money and auto debit will fail. \n\nIf informal lending was to be converted to this formal procedures maybe they would take credits from nbfc or banks.\n\nAltough this is my personal opinion, maybe you can try onboarding a few retailers first and expand horizontally. Good luck. Happy to help with any tech queries. Have fintech founding enguneer experince and my systems are currently used by BOBCards credit card onbording, capri home loans loan management and recovery team and other projects which are underway by the company that i was foudning engineer of which can not be discolsed publicly.",
          "score": 1,
          "created_utc": "2026-01-02 14:09:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx9b0vq",
          "author": "Embarrassed_Log_5949",
          "text": "Looks interesting. In the informal lending economy, most contracts are verbal and interest rates are very high. And most would like to keep these transactions off the books for tax purposes. But the thought of formalising the informal collections process sounds interesting. I spent sometime in the FinTech world first as a key contributor to digital public infra and then as an operator. Would love to chat 1:1 and see if there are synergies",
          "score": 1,
          "created_utc": "2026-01-02 14:31:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx9v588",
          "author": "Ok-Office-6564",
          "text": "are you building your own ledger/core system or are using any available in the market?",
          "score": 1,
          "created_utc": "2026-01-02 16:13:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxa21sm",
              "author": "daya_donn",
              "text": "Good question.\n\n\n\nWe’re building our own lightweight ledger + agreement state machine focused specifically on informal credit flows (not a full NBFC core).\n\n\n\nReason:\n\nAvailable cores are built for regulated lending (loan accounts, interest accruals, NPA logic, etc.), whereas our use case needs:\n\n• Agreement-centric tracking (not loan-centric)\n\n• Flexible repayment schedules (ad-hoc, partial, delayed)\n\n• Auto-debit orchestration + retries\n\n• Follow-up & recovery workflows tied to agreement state\n\n• B2B embed use cases (“Pay via Le’Udhaar”)\n\n\n\nThat said, we integrate with regulated rails where required (UPI Autopay / e-mandates, banks, PSPs) and keep the core modular so parts can be swapped if needed.\n\n\n\nHappy to go deeper on the architecture if useful.",
              "score": 1,
              "created_utc": "2026-01-02 16:45:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q23dy4",
      "title": "Solid crypto-fiat neobanks in the fintech space right now?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1q23dy4/solid_cryptofiat_neobanks_in_the_fintech_space/",
      "author": "Lanky_Information166",
      "created_utc": "2026-01-02 16:39:09",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "Fintech's exploding with hybrid apps blending crypto wallets, IBAN accounts, and cards - but which actually deliver for real flows like trading ramps, freelance payouts, or yield harvests to euros? The pain points are clear: named personal IBAN for SEPA (ideally Instant), low/no-fee crypto swaps, reliable virtual cards, and stability on non-trivial volumes without surprise holds or compliance snags. EU/EEA focus is key for most users dodging US regs.\n\nA few I've rotated through like Wirex and Nebeus. But Keytom impressed in practice - personal EUR IBAN, fast SEPA Instant, crypto wallets in one app, virtual card works fine, and it's handled mid-range cashouts smoothly so far without glitches.\n\nCurious on the latest: what's your top fintech pick for fiat/crypto management? Any underrated ones scaling well in 2026?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1q23dy4/solid_cryptofiat_neobanks_in_the_fintech_space/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nxctl89",
          "author": "digitalbubble",
          "text": "Revolut?",
          "score": 1,
          "created_utc": "2026-01-03 00:59:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q1u1q9",
      "title": "In 2025, why is moving money still harder than sending an email?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1q1u1q9/in_2025_why_is_moving_money_still_harder_than/",
      "author": "Substantial-Film1861",
      "created_utc": "2026-01-02 09:12:49",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 0.67,
      "text": "I tried to send $200 to a friend on New Year's Eve.\\\\\n\n\\- Venmo: \"Transaction declined\" (no explanation)  \n\\- Cash App: Wouldn't verify my identity (I've used it before)  \n\\- Zelle: Limit of $500/day, but couldn't find the recipient  \n\\- Bank transfer: 3-5 business days\n\nFinally got it done through a combination of apps. Total time: 15 minutes. Total fees: \\~$15.\n\nMeanwhile:\n\n   \\- I can send an email to Australia in seconds  \n   \\- I can video call Tokyo in real-time  \n   \\- Solana processes transactions for $0.00025 in 400ms  \n   \\- Visa handles 65,000 transactions per second\n\nThe technology exists to move money instantly for almost nothing. Why doesn't our banking system use it?\n\nIs it regulatory? Technical? Or is \"the float\" just too profitable to give up?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1q1u1q9/in_2025_why_is_moving_money_still_harder_than/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nx8auls",
          "author": "abeorch",
          "text": "To be honest this isnt a problem for most of the world. Most countries have faster payments syatems for almost instant transfer between bank accounts and SEPA does this across most of Europe. \n\nThe problem is the slow adoption of Fednow by US banks. Vote with your feet and move to a bank that supports it.",
          "score": 3,
          "created_utc": "2026-01-02 10:00:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx8bk9l",
              "author": "Substantial-Film1861",
              "text": "You're completely right. FedNow launched in 2023 and could solve this — instant transfers, 24/7, between participating banks. The problem is adoption: only about 1,400 of the \\~10,000 US banks have joined, and most of the big banks (BofA, Citi, Capital One) still haven't. Meanwhile, countries like the UK, Australia, India, and Brazil have had instant payments for years. Some of them *mandated* adoption. We're taking a 'laissez-faire' approach and hoping banks voluntarily give up float revenue. Spoiler: they won't. I'll look into which banks support FedNow — thanks for the tip.",
              "score": 1,
              "created_utc": "2026-01-02 10:07:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxa8zl7",
          "author": "emperorOfTheUniverse",
          "text": "In America, it's because of too much law and not enough law at the same time. Regulation E protects consumers for fraud and such, but it adds a layer of risk that all money movers have to account for. This is why all your apps are working so hard to verify your identity and the slightest wiff of possible fraud, shutting your transfer down. Too many returned money transactions can shut down a bank or payment business. \n\nOn the 'not enough law' side, other countries have done better at mandating 'open banking', which goes a long way to verifying funds and identity for money transfer. America is behind on that.",
          "score": 1,
          "created_utc": "2026-01-02 17:18:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxbn524",
          "author": "ItinerantFella",
          "text": "I'm guessing you're in America? (Where they invented the internet). Just send a check!",
          "score": 1,
          "created_utc": "2026-01-02 21:15:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxdxmhh",
              "author": "elevarq",
              "text": "Check? A piece of paper from the 1900s last century? It’s not safe, can be stolen, can be fake, can be without funds. \nNearly every country has abandoned this and some day the USA will wake up and do the same",
              "score": 1,
              "created_utc": "2026-01-03 05:03:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx8o563",
          "author": "FarAwaySailor",
          "text": "It isn't if you use stablecoin.\n\nIf you think about it for a moment, you might also ask why paying for goods and services is so shitty too - merchants pay upwards of 3 percent in card fees (which is passed on to the customer too); and merchants have to pass default-risk assessment (higher risk = higher fees) in order to *receive* payments; and fraud risk is massive because it is really easy if you know someone's card number. The whole system was built 40 years ago, before we all had computers in our pockets. It really doesn't have to be that way, but we accept it all because we're used to it.",
          "score": -1,
          "created_utc": "2026-01-02 11:59:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxa7vtx",
          "author": "tsurutatdk",
          "text": "The tech isn’t the bottleneck anymore. Regulation, legacy incentives, and fragmented rails are. That’s why payment layers like **xMoney** matter. They focus on making existing systems interoperable and usable, not just faster on chain.",
          "score": -1,
          "created_utc": "2026-01-02 17:12:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzzwil",
      "title": "What to study to go into fintech as a finance major.",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1pzzwil/what_to_study_to_go_into_fintech_as_a_finance/",
      "author": "Reasonable_Ice6585",
      "created_utc": "2025-12-31 01:25:21",
      "score": 2,
      "num_comments": 6,
      "upvote_ratio": 0.67,
      "text": "I’m currently a Junior undergrad in finance, and I’m starting to feel like I have more of an interest in tech/data science and the technology aspect of analytics.\n\n  \ni’m currently wondering if I should self learn Python and SQL, and maybe do a (government sponsored) master’s in something data/tech related?\n\n  \nhow would I find fintech related jobs? what even are fintech jobs? I just have so many questions, but all I know is i’ve always had an interest in tech, and that I’m a finance major.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1pzzwil/what_to_study_to_go_into_fintech_as_a_finance/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "nwudhsk",
          "author": "Wheelio",
          "text": "Fintech is very broad, but largely it is more ‘tech’ than ‘fin’. Yes being tech oriented or having tech skills is going to give you more options in the industry than finance. \n\nBut there’s many positions at any given fintech company. Product roles (usually require more experience, not often for new graduates) are an example. Or many business analyst type roles that exist like in any business in any industry. \n\nFintech is more a product family than an industry really. It’s a subset of tech. \n\nIf there’s something about finance based products you are interested in just look up and list as many companies as you can that make the products you care about. Get internships or find a foot in the door. Then over years of experience you’ll get a better understanding of what exactly businesses do and what roles exist and where to take your career.",
          "score": 5,
          "created_utc": "2025-12-31 02:10:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwzehf3",
              "author": "unrealistic_matron",
              "text": "Python and SQL are definitely worth learning - they're like the bread and butter for most fintech roles. The government sponsored masters sounds like a solid move if you can swing it\n\n  \nFor finding jobs just start following fintech companies on LinkedIn and checking their career pages. A lot of them post entry level analyst positions that are perfect for finance majors who know some coding. Also check out places like Stripe, Square, Robinhood etc - they're always hiring and usually pretty good about training people up",
              "score": 1,
              "created_utc": "2025-12-31 21:41:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx0ih7x",
          "author": "emperorOfTheUniverse",
          "text": "Consider this: you want to get into fintech but don't even know what a fintech job is.\n\nYou absolutely can learn technology on your own. Learn Python and SQL. It's easy. \n\nYou need to identify what aspects of finance get touched by technology. Understand payments, banking, etc. Read the book 'anatomy of the swipe'. Learn about ACH and card networks. Understanding ACH, RegE, and NACHA is valuable. Understanding how to do file transfer to facilitate it is more trivial.\n\nBest thing you can do now, is get internships and build a jobs network within your finance discipline. Learn technology in the background. It's easy to hire devs. It's harder to know and/or tell devs what to build.",
          "score": 3,
          "created_utc": "2026-01-01 01:41:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwv92pm",
          "author": "Pale_Neat4239",
          "text": "The tech + domain knowledge combo is your actual edge. Here's what I'd prioritize:\n\n\n\n1. Python (non-negotiable)\n\n2. Data fundamentals (SQL, databases)\n\n3. Understand payments/compliance/KYC workflows (this separates junior from mid-level)\n\n\n\nMy take: Most fintech roles value someone who can communicate between engineers and business stakeholders. Your finance background is gold. Use it. Build projects that solve real fintech problems (payment routing, risk scoring, settlement workflows).\n\n\n\nInternships > degrees. Get your hands dirty with real code and real business context.",
          "score": 2,
          "created_utc": "2025-12-31 05:31:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx4vp65",
          "author": "Special_Rice9539",
          "text": "Get really comfortable using AI coding tools.  With Claude AI, you can outperform pure computer science majors, especially if you have good writing skills",
          "score": 1,
          "created_utc": "2026-01-01 20:26:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx5o55d",
          "author": "fredericnoel1973",
          "text": "Learn Python and SQL, plus Excel, statistics, and basic ML. Focus on fintech domains (payments, lending, risk, regtech) and practice with APIs. Build a data portfolio (dashboards, forecasting, fraud detection). Network with fintechs/banks/startups and apply; a data/tech master can help if desired.",
          "score": 1,
          "created_utc": "2026-01-01 22:56:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}