{
  "metadata": {
    "last_updated": "2026-02-06 09:09:58",
    "time_filter": "week",
    "subreddit": "fintech",
    "total_items": 20,
    "total_comments": 132,
    "file_size_bytes": 160005
  },
  "items": [
    {
      "id": "1quos2w",
      "title": "best data security solutions what’s actually worth deploying?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1quos2w/best_data_security_solutions_whats_actually_worth/",
      "author": "Corrin_Radd",
      "created_utc": "2026-02-03 10:47:34",
      "score": 23,
      "num_comments": 9,
      "upvote_ratio": 0.94,
      "text": "i’m trying to put together a short list of the best data security solutions that actually help reduce risk without turning into a never-ending tuning project. we’re dealing with the usual mix of cloud storage, saas apps, and a bunch of data scattered across teams, and i’m stuck between “buy a platform” vs “best-of-breed everything.” what tools have you used that genuinely made things better (visibility, access control, detection, incident response), and what tools sounded amazing but were a pain in real life?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1quos2w/best_data_security_solutions_whats_actually_worth/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o3bxz0z",
          "author": "Mammoth_Ad2733",
          "text": "when you talk about cloud storage, saas apps, and scattered data, what do you mean? don't you have a centralized solution?",
          "score": 1,
          "created_utc": "2026-02-03 12:34:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dralu",
          "author": "Such-Evening5746",
          "text": "I’ve mostly seen teams get burned by big “data security platforms” that turn into endless alert tuning.\n\nWhat actually helped us was starting with data discovery and effective access visibility. Once we could see where sensitive data lived and who really had access, a lot of obvious risks jumped out (public links, stale users, over-permissive service accounts). Fixing that reduced more risk than any fancy control.\n\nDetection only became useful once it was tied to sensitive data access instead of generic UEBA-style anomalies. We use Sentra for discovery + access visibility across cloud/SaaS, and Wiz for cloud posture, and that combo covered most of our real risk without constant tuning.\n\nBlanket DLP and single-SaaS tools sounded great, sucked in practice. Fewer focused platforms > duct-taped point tools.",
          "score": 1,
          "created_utc": "2026-02-03 18:05:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3emqr5",
          "author": "kratoz0r",
          "text": "for us, Cyera was a solid win for getting a handle on where sensitive data lives and what’s exposed, which made the rest of the “data security solutions” conversation way more grounded.\n\nis that like a dlp tool or more of a “data discovery + permissions” thing?\n\nmore discovery/posture and access risk, at least in our setup. cyera helped us find the scary stuff fast (overshared, weird access paths), then we tightened perms and set alerts, but we still use other tools for endpoint/email style dlp and broader controls.",
          "score": 1,
          "created_utc": "2026-02-03 20:30:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f4ffo",
          "author": "whatwilly0ubuild",
          "text": "The \"buy a platform versus best-of-breed\" question is the right starting point because the answer determines how much of your life you want to spend on integration work.\n\nThe platform approach wins for most mid-size teams. Running separate tools for DLP, CASB, access control, and detection sounds great until you're maintaining five different policy engines that don't talk to each other and your analysts are swiveling between four dashboards. The integration tax is real and it compounds every time you add a new SaaS app or cloud service.\n\nWhat actually works in practice. For cloud and SaaS visibility, Microsoft Purview is solid if you're already a Microsoft shop. It covers DLP, classification, and access monitoring across M365 and Azure natively. The cross-platform coverage is weaker but if 70% of your data lives in Microsoft's ecosystem it's the path of least resistance. If you're multi-cloud or Google-heavy, Netskope or Palo Alto's DSPM do a decent job of discovery and classification across environments.\n\nThe tools that sound amazing but become tuning nightmares are almost always DLP solutions. Every vendor demos beautifully with clean data and predefined policies. In production you're drowning in false positives within a week because real data doesn't look like demo data. Our clients who've had success with DLP started extremely narrow, one data type, one channel, tuned until false positive rate was manageable, then expanded. The teams who turned everything on day one abandoned the tool within six months.\n\nFor access control, the boring answer is usually right. Proper IAM hygiene, regular access reviews, and least-privilege enforcement through your identity provider catches more risk than any fancy tool. Veza or ConductorOne can help automate access reviews if manual reviews are falling behind.\n\nDetection and response is where best-of-breed sometimes wins. Your SIEM or XDR platform handles the detection layer but data-specific alerts often need a specialized tool feeding signals into it rather than trying to make the SIEM understand data context natively.\n\nThe one thing I'd prioritize above any tool purchase is knowing where your sensitive data actually lives. You can't protect what you can't see. Start with discovery and classification before buying protection tools.",
          "score": 1,
          "created_utc": "2026-02-03 21:52:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hyfah",
          "author": "SecureSlateHQ",
          "text": "The biggest risk isn’t lack of tools, it’s too much complexity for a small team to manage. Big platforms look good but often turn into constant tuning projects, especially with scattered data and SaaS sprawl. What actually helps is clear visibility into where sensitive data lives, tight access control, and simple ways to review and revoke access.  \n  \nDetection tools are often overkill if basics like permissions and ownership aren’t fixed first. Fewer, well-understood tools that you can explain during an audit usually reduce more risk than a “do-everything” platform no one maintains.",
          "score": 1,
          "created_utc": "2026-02-04 08:38:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nny7j",
          "author": "Yummyinmytummyhunger",
          "text": "I work in fintech product ops, so my perspective is skewed heavily toward payment security and compliance, but we’ve wrestled with the \"platform vs. point solution\" headache a lot recently.\n\nIn my experience, \"best-of-breed\" usually just means \"integration nightmare\" unless you have a dedicated devops team to stitch it all together.",
          "score": 1,
          "created_utc": "2026-02-05 03:43:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v0ehr",
          "author": "Exact-Delay2152",
          "text": "There’s no single “best” data security tool — what actually works is getting the basics right. In real setups, the biggest wins come from solid IAM + MFA, proper endpoint protection, encryption, and backups that you’ve actually tested. Add logging/monitoring so you can see what’s happening, and only go heavy on stuff like DLP if you truly need it. Most breaches aren’t advanced hacks — they’re bad access control, misconfigs, leaked creds, and human mistakes. Layered security + recovery capability beats any “magic product” every time.",
          "score": 1,
          "created_utc": "2026-02-06 06:50:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu1gxl",
      "title": "What's the best API for updating cards across multiple merchants?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qu1gxl/whats_the_best_api_for_updating_cards_across/",
      "author": "No-Commercial-4044",
      "created_utc": "2026-02-02 17:28:18",
      "score": 23,
      "num_comments": 4,
      "upvote_ratio": 0.94,
      "text": "I’m a PM at a mid-sized fintech with a card program and we are looking for a way to auto-update payment methods across different merchants when users get new cards (due to expiration, lost/stolen etc). Looking for something with solid merchant coverage and decent security. What are y'all using?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qu1gxl/whats_the_best_api_for_updating_cards_across/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o3c5xfr",
          "author": "CableNew5147",
          "text": "Check out Knot's CardSwitcher API. Handles encrypted card data via JWE, updates across merchants automatically, and they're PCI compliant so you don't touch any live card numbers nor assume the risk. Pretty solid merchant coverage and straightforward integration with their SDK",
          "score": 10,
          "created_utc": "2026-02-03 13:24:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o392t4c",
          "author": "whatwilly0ubuild",
          "text": "You're looking for card-on-file updater services. The options depend on whether you're an issuer or working through a processor.\n\nVisa Account Updater (VAU) and Mastercard Automatic Billing Updater (ABU) are the network-level services that handle this. As a card issuer or program manager, you push updated card details to the networks and participating merchants automatically receive the new credentials. Coverage is decent but not universal since merchants have to participate, and not all do.\n\nThe catch is you don't integrate with these directly in most cases. Your issuer processor or BIN sponsor handles the network connectivity. So the real question is whether your current processor supports VAU/ABU and how well their implementation works. Some processors handle it seamlessly, others have it technically available but the enrollment and data flow is clunky.\n\nIf you're on Marqeta, Lithic, or similar modern issuer platforms, they generally have account updater built in or easily enabled. The implementation is mostly configuration rather than heavy engineering. Older processors may require more manual work to get it running properly.\n\nThe coverage gap is real though. Not every merchant participates in the network updater programs. Subscription services and large retailers generally do because failed recurring charges cost them money. Smaller merchants often don't bother. So you'll reduce failed transactions significantly but won't eliminate them entirely.\n\nOur clients running card programs typically see 60-70% of card-on-file relationships updated automatically through the network services. The remaining 30-40% still result in declines that the cardholder has to fix manually.\n\nOne thing to discuss with your processor is the timing. Some implementations push updates in batch which can take days, others are near real-time. For lost/stolen replacements the speed matters since you want merchants updated before the next billing cycle hits.",
          "score": 2,
          "created_utc": "2026-02-02 23:59:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37bl3d",
          "author": "scumbagbill",
          "text": "I work for a payment processor, and have worked in payments for 10+ years, so happy to give you my opinion.\n\nAll acquirers or processors should have an Account Updater tool. There is a few different flavors of this (batch, Real Time, Network Tokens). However, in this case, it sounds like you are issuing a card to your consumers, and want to update at the merchants where your consumers have their cards stored. This isn't really possible, as that is more on the merchant to do with their payment processor (and there a few reasons for this, mostly merchants dont want to update cards if they do not plan on billing your consumer in the foreseeable future) Your role would be to provide updated information to the processors when they go to do an update.\n\nThe best tool for this is network tokens, as the networks (Visa, MC) would be doing the update, but again that is enabled by the processor.\n\nI should be clear, my experience is more on the acceptance side, rather than issuing, so maybe someone can correct me, but I havent heard of issuers pushing out wide reaching updates to merchants. PM me if you have more questions, or want to discuss further.",
          "score": 1,
          "created_utc": "2026-02-02 18:50:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr6hfz",
      "title": "Anyone here tried an AI headshot Pro generator yet? Curious what people think about these tools.",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qr6hfz/anyone_here_tried_an_ai_headshot_pro_generator/",
      "author": "My_Rhythm875",
      "created_utc": "2026-01-30 14:10:39",
      "score": 14,
      "num_comments": 25,
      "upvote_ratio": 0.85,
      "text": "Not promoting anything. Just sharing an experience and curious how others feel about this.\n\nI tried one recently after needing a basic professional photo and not having the time or interest to book a photographer. The specific app I tried was [Generate Professional Headshot](https://apps.apple.com/us/app/generate-professional-headshot/id6751214183) from the App Store. I went in expecting something gimmicky. Most of the results were not usable, but a couple were acceptable for low stakes use like a temporary profile image.\n\nWhat made me think was not the quality but the role of tools like this. It did not feel like a replacement for a photographer. It felt more like a convenience option for people who need something quickly and would not have booked a shoot anyway.\n\nAt the same time I can see potential downsides. People may end up using images that do not really look like them. Platforms could fill up with very similar looking faces. First impressions might become less honest.\n\nSo I am curious how others see this type of tool.\nDo you see it as harmless convenience or more of a net negative.\nWould you personally use an AI generated headshot for something informal or temporary.\nFor photographers or creatives here does this feel like a threat or just a different category.\n\nNot recommending it and not arguing for or against it. Just trying to understand where people think the line is between a useful shortcut and something that cheapens professional presentation.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qr6hfz/anyone_here_tried_an_ai_headshot_pro_generator/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o2ro1yj",
          "author": "Plane_Candle5908",
          "text": "I’ve tried one too. Same experience , most images were bad, a couple usable.",
          "score": 1,
          "created_utc": "2026-01-31 10:25:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rohnh",
          "author": "AirportOk7793",
          "text": "This is one of those tools that solves a boring problem, not an artistic one.",
          "score": 1,
          "created_utc": "2026-01-31 10:29:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2roirw",
          "author": "hemanthx1746",
          "text": "For remote teams or internal Slack profiles, I see zero problem.",
          "score": 1,
          "created_utc": "2026-01-31 10:29:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rokdl",
          "author": "Wizard8317",
          "text": "I think the danger is when people forget it’s an approximation, not a portrait.",
          "score": 1,
          "created_utc": "2026-01-31 10:29:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rokwe",
          "author": "Qoaei",
          "text": "Photographers sell trust and personality. AI headshots don’t.",
          "score": 1,
          "created_utc": "2026-01-31 10:30:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rolpz",
          "author": "Seasonnn7",
          "text": "Convenient? Yes. Authentic? Not really. Useful anyway? Probably.",
          "score": 1,
          "created_utc": "2026-01-31 10:30:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2roqcm",
          "author": "godxrav",
          "text": "I tried one and my face looked… better, but not accurate. Like an alternate-universe version \nof me.",
          "score": 1,
          "created_utc": "2026-01-31 10:31:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rovab",
          "author": "Excellent-Nature-801",
          "text": "As a creative, I’m more concerned about people not realizing when images are \nAI-generated.",
          "score": 1,
          "created_utc": "2026-01-31 10:32:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rp120",
          "author": "GolfInteresting7844",
          "text": "People who want quality will still \nbook shoots.",
          "score": 1,
          "created_utc": "2026-01-31 10:34:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rp8cu",
          "author": "kaagaz-ki-kashti",
          "text": "I’d only use it temporarily. Something about knowing it’s not really “me” feels off.",
          "score": 1,
          "created_utc": "2026-01-31 10:36:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rpf5f",
          "author": "Pitiful-Invite73",
          "text": "The “everyone starts looking the same” part is already happening and it’s kind of weird.",
          "score": 1,
          "created_utc": "2026-01-31 10:38:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rpqun",
          "author": "PassagePlus3777",
          "text": "worry recruiters won’t know what’s real anymore but then again, resumes already aren’t \nfully “real.”",
          "score": 1,
          "created_utc": "2026-01-31 10:41:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rpwl6",
          "author": "LieApprehensive9210",
          "text": "Feels more like Canva than a photographer replacement. Different use case.",
          "score": 1,
          "created_utc": "2026-01-31 10:42:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rqgxj",
          "author": "lunahanae",
          "text": "The tech is impressive, but the outputs feel soulless to me.",
          "score": 1,
          "created_utc": "2026-01-31 10:47:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rqkuv",
          "author": "Ok-Preparation5622",
          "text": "The “everyone starts looking the same” part is already happening and it’s kind of weird.",
          "score": 1,
          "created_utc": "2026-01-31 10:48:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rqn5i",
          "author": "Ok-Preparation5622",
          "text": "The “everyone starts looking the same” part is already happening and it’s kind of weird.",
          "score": 1,
          "created_utc": "2026-01-31 10:49:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rs2oe",
          "author": "tsuyub",
          "text": "I’d never use \nit for something serious though.",
          "score": 1,
          "created_utc": "2026-01-31 11:02:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ru3v3",
          "author": "icycool29",
          "text": "I think it’s fine for LinkedIn placeholders or internal tools, but public-facing stuff feels risky.",
          "score": 1,
          "created_utc": "2026-01-31 11:21:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rvwl8",
          "author": "Status-Let-4755",
          "text": "As a photographer, I don’t really see this as competition.",
          "score": 1,
          "created_utc": "2026-01-31 11:36:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2s2b2h",
          "author": "Crafty-Cut2231",
          "text": "I don’t think this cheapens professional presentation it just creates a new baseline.",
          "score": 1,
          "created_utc": "2026-01-31 12:29:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2s6bbl",
          "author": "thegamerlola",
          "text": "Those ai headshots is pretty easy to make using Fidd.art. Just need it to be ultra realistic including the type of lenses, etc. But it cannot replace photographers.",
          "score": 1,
          "created_utc": "2026-01-31 12:59:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sdr1n",
          "author": "Silverchhapri",
          "text": "Honestly, for people who hate cameras, this might be the only way they ever get a \nprofessional-looking photo.",
          "score": 1,
          "created_utc": "2026-01-31 13:46:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wtkze",
          "author": "Vic_78",
          "text": "I wouldn’t pay much for it, but I get why people use it.",
          "score": 1,
          "created_utc": "2026-02-01 03:44:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xic6u",
          "author": "ExplanationPale4698",
          "text": "Accepted for casual use, questionable for anything   \nofficial.",
          "score": 1,
          "created_utc": "2026-02-01 06:46:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2n1ivm",
          "author": "Imaginary-Carrot2532",
          "text": "I personally use [gentube.app](https://www.gentube.app/?_cid=cm), and I found it to save me a lot of time and money",
          "score": -1,
          "created_utc": "2026-01-30 17:36:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qv0gjy",
      "title": "KYC document verification, how granular should fraud detection be?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qv0gjy/kyc_document_verification_how_granular_should/",
      "author": "Due-Philosophy2513",
      "created_utc": "2026-02-03 18:46:51",
      "score": 14,
      "num_comments": 15,
      "upvote_ratio": 0.89,
      "text": "For fintechs handling KYC: We're building a customer onboarding flow requiring proof of address and business documentation. Compliance wants \"document authenticity verification\" but we're struggling to define what that means technically.\n\nIs it enough to validate extracted data matches expected format? Or do we need actual forgery detection (checking if PDF was tampered with, validating document structure, metadata integrity)?\n\nCurrent vendor does OCR + basic format checks. Compliance says that's insufficient for detecting sophisticated fakes. But building forensic document analysis in-house seems extreme.\n\nWhere's the reasonable middle ground for document fraud prevention in regulated industries?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qv0gjy/kyc_document_verification_how_granular_should/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o3e321l",
          "author": "Hour-Librarian3622",
          "text": "OCR plus format checks is literally just reading the document. That's not fraud detection at all.",
          "score": 7,
          "created_utc": "2026-02-03 18:58:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3eennx",
              "author": "Traditional_Vast5978",
              "text": "Building forensic analysis in house is insane unless document verification is your actual product. The gap between basic OCR and real fraud detection requires maintaining models for metadata integrity, PDF structure validation, and image manipulation patterns. Platforms like au10tix handle those detection layers automatically and update when new forgery techniques emerge. Compliance gets the depth required while engineering avoids months building commodity infrastructure that specialized vendors already solved at scale.",
              "score": 3,
              "created_utc": "2026-02-03 19:52:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3e4w0g",
          "author": "Unique_Buy_3905",
          "text": "Went through this exact debate last quarter. Compliance kept saying \"we need more\" without defining what more meant technically. Eventually mapped out attack types we actually faced versus theoretical ones and built detection around real threats. \n\nTurns out most document fraud hitting regulated companies isn't sophisticated at all, it's recycled templates and edited PDFs. Save the forensic analysis budget for the cases that need it.",
          "score": 4,
          "created_utc": "2026-02-03 19:06:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ebkai",
          "author": "ImpressiveProduce977",
          "text": "OCR catches what the document says, not whether it's authentic. The forensic piece needs to run parallel, not sequential. We had similar pushback until switching to au10tix where document structure validation and tampering detection happen during the same verification pass instead of after. Turns out most sophisticated fakes fail multiple checks simultaneously, you just need tools that actually look for those signals instead of trusting extracted text matches format.",
          "score": 4,
          "created_utc": "2026-02-03 19:38:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3e6y2q",
          "author": "Hot_Blackberry_2251",
          "text": "The middle ground is layered detection. Start with metadata integrity and PDF structure validation, that catches 80% of tampered documents without building forensic tools. Add image manipulation detection on top for the sophisticated stuff. Don't need to solve everything in house, just enough to catch what basic OCR misses completely.",
          "score": 2,
          "created_utc": "2026-02-03 19:16:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3efgyh",
          "author": "Minute-Confusion-249",
          "text": "Nobody in regulated industries actually builds forensic document analysis from scratch. The economics simply doesn't make sense. \n\nWhat works is a tiered approach where basic validation filters obvious garbage, then automated detection catches manipulated documents, and manual review handles edge cases that automation flags but can't conclusively determine. \n\nYour current vendor doing OCR plus format checks is genuinely insufficient because a well made PDF forgery passes format validation every time. The jump from basic checks to actual forgery detection isn't incremental, it's architectural. Either your vendor handles that layer or you need one that does because compliance is right that basic checks won't hold up during an audit.",
          "score": 2,
          "created_utc": "2026-02-03 19:56:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3e2cem",
          "author": "Smooth-Machine5486",
          "text": "Your compliance team is right but for the wrong reasons. Format validation catches lazy fakes. Sophisticated forgery detection needs metadata analysis and structural integrity checks. The gap between those two is where regulated companies get burned.",
          "score": 1,
          "created_utc": "2026-02-03 18:55:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3edo1d",
          "author": "EquivalentBear6857",
          "text": "The balance is automated detection layers that catch document manipulation without manual forensics on every submission. Metadata analysis, PDF structure integrity, image consistency checks. These aren't theoretical, they catch actual fraud patterns hitting regulated industries daily. Build detection around threats you're facing.",
          "score": 1,
          "created_utc": "2026-02-03 19:48:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3eovvw",
          "author": "Wrong_Watercress1937",
          "text": "You're right, building forensic analysis in-house is extreme, but relying solely on OCR is a major compliance risk. The 'middle ground' in regulated industries is usually automated image forensics and metadata analysis provided by specialized vendors. Look for solutions that check for 'pixel anomalies' (to detect Photoshop edits) and PDF structure integrity. Also, if you’re using a mobile flow, NFC-based chip reading for passports is the gold standard that satisfies almost any regulator.",
          "score": 1,
          "created_utc": "2026-02-03 20:41:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f6i3q",
          "author": "consultali",
          "text": "Depending your location/country, proof of address can be driving license - generally accepted everywhere. There are number of vendors who does tampering detection, lively match and in some cases cross-check with book-of-record(more expensive). Identity verification is pre-req for all of these for KYC.\n\nfyi: \"...data matches expected format...\" doesn't have any value in KYC.",
          "score": 1,
          "created_utc": "2026-02-03 22:02:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3fywph",
          "author": "PaymentFlo",
          "text": "The middle ground is risk-based, not perfection-based.\nMost regulated teams combine OCR + format checks with source validation (issuer, address match, recency) and selective tamper signals.\nFull forensic analysis is usually reserved for edge cases or escalations, not every customer.\nThe goal isn’t to catch every fake it’s to show regulators you’re proportionate, consistent, and escalating risk intelligently.",
          "score": 1,
          "created_utc": "2026-02-04 00:31:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3fzg0v",
          "author": "Mission_Royal_4402",
          "text": "here in russia we have open api gov infra to cross validate things like tax id, person / company id, we have standardized format for bank account statements, tax declaration, etc etc and... I've just got the same request you described :D literally \"we need more\". I checked on \"why?\" and oh my god what they showed me: people faking statements and ids like pro! There are even online services offering anti-anti-fraud-ready solutions :DD I even saw a service which offers ai-based face+id photo/video gen to pass... facial recognition via online persona confirmation. Anyways, deploy it in-house it's nightmare as is, I'd say look for a partner / saas / be ready to pass it to ops for manual check (validation) or pass it to fin dep to enhance fin risk model of your company so it handles fraud more gracefully a.k.a. higher chances of fraud :D",
          "score": 1,
          "created_utc": "2026-02-04 00:34:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hr72s",
          "author": "tornavec",
          "text": "Outsourcing?",
          "score": 1,
          "created_utc": "2026-02-04 07:32:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3lm2iw",
          "author": "whatwilly0ubuild",
          "text": "Your compliance team is right that OCR plus format checks isn't enough, but forensic document analysis in-house is overkill. The middle ground is a specialized vendor, not a custom build.\n\nThe threat model matters here. Basic format validation catches lazy fakes, someone who typed up a utility bill in Word with the wrong date format or missing fields. That stops maybe 40% of attempts. The remaining 60% are people using real document templates with modified data, edited PDFs where the visual output looks perfect but metadata or internal structure is inconsistent. Those require actual document forensic checks that you shouldn't build yourself.\n\nWhat the better vendors actually check beyond OCR. PDF internal structure analysis, looking for editing artifacts left by tools like Adobe or online PDF editors. Font consistency across the document since spliced text often uses slightly different font rendering. Metadata inspection for creation dates, software used, modification timestamps that don't match the supposed document origin. Image analysis for utility bills and bank statements checking for compression artifacts around edited regions. Cross-referencing extracted data against known templates for major issuers like specific banks and utility companies.\n\nOnfido, Jumio, and Veriff all offer document verification beyond basic OCR. Shufti Pro is cheaper and decent for lower volume. The pricing jump from basic OCR to forensic verification is meaningful but way less than building in-house, and you get ongoing model updates as fraud techniques evolve.\n\nOur clients in regulated fintech usually land on a tiered approach. Automated checks handle the bulk of verifications, anything the system flags as suspicious gets routed to manual review, and you set thresholds based on risk level. Higher value accounts or higher risk jurisdictions get stricter automated checks before human review.\n\nThe compliance question to answer concretely is what's your false acceptance rate tolerance. That number drives how aggressive your verification needs to be and helps you evaluate vendors objectively rather than arguing about vague \"authenticity\" requirements.",
          "score": 1,
          "created_utc": "2026-02-04 21:02:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qumxal",
      "title": "Why do so many fintech MVPs stall after launch?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qumxal/why_do_so_many_fintech_mvps_stall_after_launch/",
      "author": "Snow-Giraffe3",
      "created_utc": "2026-02-03 08:51:35",
      "score": 14,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "I’ve noticed a pattern with fintech startups: solid ideas, clean MVPs, even early traction, but then growth flatlines. Distribution gets expensive, compliance slows experimentation, and teams struggle to balance speed with trust.\nFor founders or operators here: what actually helped you move from “working product” to sustainable growth in fintech? Was it partnerships, better UX, fundraising timing, or something else?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qumxal/why_do_so_many_fintech_mvps_stall_after_launch/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o3b8vun",
          "author": "floppyintruder",
          "text": "honestly the biggest thing that killed momentum for us was trying to do everything in-house instead of leveraging existing infrastructure early on. we spent months building payment rails that honestly weren't much better than what stripe or plaid could offer\n\n  \npartnerships were huge but not the flashy kind - boring stuff like working with community banks and credit unions who already had the trust factor built in. they became our distribution channel and helped with the compliance headaches too\n\n  \nthe other thing is most teams underestimate how long the sales cycles are in fintech. b2b especially - you're not selling to individuals making impulse decisions, you're selling to institutions that take 6+ months to evaluate anything financial. having enough runway for those longer cycles made all the difference",
          "score": 9,
          "created_utc": "2026-02-03 08:55:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cx37d",
              "author": "Snow-Giraffe3",
              "text": "Lots to consider here. Key issues being that trust must work. Partners and banks have to must be sold on that the product/idea is legit, and in turn, they trust me with their money, and see what they bought is in action and is going to grow profits.",
              "score": 1,
              "created_utc": "2026-02-03 15:46:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3beuq7",
          "author": "tonyfith",
          "text": "Marketing is hard, and finding the correct audience is even harder.",
          "score": 6,
          "created_utc": "2026-02-03 09:54:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3d29xv",
              "author": "Snow-Giraffe3",
              "text": "Don't I know it. And a lot of competition too factors in.",
              "score": 2,
              "created_utc": "2026-02-03 16:10:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3f54is",
          "author": "whatwilly0ubuild",
          "text": "The pattern is real and it's almost always the same few causes.\n\nDistribution in fintech is brutally expensive because trust is the product. Nobody switches financial infrastructure based on a landing page. CAC reflects the fact that you're asking people to trust you with money, and most MVPs stall because founders budgeted for product development but not for the 12-18 months of grinding through sales cycles where prospects say \"love it but need to see you survive another year.\"\n\nCompliance compounds in ways teams don't anticipate. Your MVP launched with basic KYC. Now every new feature needs updated policies, legal review, maybe a new license. Each expansion costs more in compliance overhead than engineering.\n\nWhat actually moved the needle for our clients who got past the stall. Partnerships with established players was the most common unlock, solving trust and distribution simultaneously. Narrowing focus rather than expanding, owning one use case for one segment completely rather than being mediocre across five. And unit economics clarity early so you know whether to raise, pivot pricing, or change channels.\n\nThe uncomfortable truth is most fintech MVPs stall because the market they targeted isn't big enough to sustain the compliance and distribution costs required to serve it. The product works but the business doesn't pencil out.",
          "score": 3,
          "created_utc": "2026-02-03 21:56:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ck065",
          "author": "The_Wrecking_Ball",
          "text": "Trust is a big factor for adoption. \n\nProduct market fit and delivering real value is hard.  Not incremental value, but a solution which solves a customer’s problem, not a perceived problem with our “killer” solution.",
          "score": 2,
          "created_utc": "2026-02-03 14:41:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cy2f5",
              "author": "Snow-Giraffe3",
              "text": "It is the general consensus to the problem. Delivering customer satisfaction.",
              "score": 1,
              "created_utc": "2026-02-03 15:50:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ftglj",
          "author": "Much-Permission-3999",
          "text": "We were struggling with every new features we decided to add. Then we hired a team, Qoest that helped us build a modular system that let us iterate on the UX without redoing the whole compliance layer each time.",
          "score": 2,
          "created_utc": "2026-02-04 00:01:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jpby5",
              "author": "Snow-Giraffe3",
              "text": "Interesting approach to consider because I had never heard of them. I will check them and see what they offer. \n\nThank you for this.",
              "score": 1,
              "created_utc": "2026-02-04 15:44:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jl71a",
          "author": "Forsaken_Lie_8606",
          "text": "distribution is the real product in fintech. most teams spend 90 percent of their energy on the MVP and then realize acquiring users in a regulated space costs 10x what they budgeted. the ones that work usually nail one distribution channel before building anything",
          "score": 2,
          "created_utc": "2026-02-04 15:25:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qruzn1",
      "title": "The End of the Banking Era: Global Business is Switching to Stablecoins",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qruzn1/the_end_of_the_banking_era_global_business_is/",
      "author": "tornavec",
      "created_utc": "2026-01-31 06:34:33",
      "score": 9,
      "num_comments": 29,
      "upvote_ratio": 0.7,
      "text": "Stablecoin transaction statistics reveal a significant shift in the B2B payments sector. While businesses previously processed $100 million in stablecoin transfers per month, this figure grew to $3 billion by the start of the year — surpassing VISA's annual turnover of $33 trillion.\n\n \n\nThe majority of these transactions are conducted in USDC on the Ethereum blockchain. Circle, the issuer of this token, holds the most significant licences from US regulators, which is why its solutions pose the most serious competition to banks. The volume of such transfers exceeded $4.5 trillion in the fourth quarter of 2025 alone. \n\nHowever, the adoption of the MiCA law is facilitating the development of EURC settlements in the European market. The token's capitalisation has grown by 300%.\n\nUnlike bank transfers, companies use stablecoins to pay suppliers and staff, reducing transaction times from several days to a matter of minutes. In addition to the speed of transfers, all settlements are transparent and easy to track on the blockchain, enabling decentralised automation.\n\nCrypto payment gateways are becoming the main competitors of banks in the battle for corporate clients. These services enable the issuing of invoices and the acceptance of payments, with automatic conversion to fiat or stablecoins. The platforms provide all the necessary tools for working seamlessly with cryptocurrency.\n\nKey players:\n\n  • BitPay: One of the oldest players. They have a powerful B2B solution that enables you to issue invoices in USDC, USDT and other coins.\n\n  • Triple-A: A licensed payment institution operating in Singapore and the EU. They specialise in the corporate sector, helping businesses to accept crypto payments and receive fiat currency in their bank accounts.\n\n  • Cryptomus: Actively operating in LATAM, North America and Africa. It allows you to automate B2B and B2C payments and make bulk payments. It also supports instant stablecoin conversion.\n\n  • BVNK is very popular in Europe and Asia for B2B settlements. It positions itself as a bridge between traditional finance and crypto.\n\n  • CoinsPaid: A large processing company, popular in Europe and the CIS, focused on high turnover.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qruzn1/the_end_of_the_banking_era_global_business_is/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o2rrknk",
          "author": "Agreeable-Door-101",
          "text": "Calm down. There are still many obstacles \n\nFiat on / off ramp still in play \nUSD skew is not sustainable, from a political pov there is added risk. Like defence the line in the sand is now drawn. \n\nSolves some real world use cases at this point. I won’t be buying bread with it though. Industry view vs real world application is still worlds apart.",
          "score": 10,
          "created_utc": "2026-01-31 10:57:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3badt1",
              "author": "Historical_Tear4677",
              "text": "exactly, besides regulatory and political reasons, if everything is stablecoin, there would be so much less loans. It will be really hard for businesses to take out loans. banks exist for a reason. there are so much more money than there actually is.",
              "score": 3,
              "created_utc": "2026-02-03 09:10:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2s6wty",
          "author": "xaic",
          "text": "People have been declaring “the end of banking” for literally centuries. Every time a new financial technology shows up, credit, telegraph transfers, cards, online banking, fintech, now stablecoins, the same story plays out. Old system is “finished.” It never is.\n\n\nBanks are not just money pipes. They are:\n\n• legal trust layers, identity, compliance, dispute handling\n\n• credit engines, loans, trade finance, risk management\n\n• bridges to the real economy, taxes, courts, payroll, regulation\n\n\nStablecoins are great at moving value fast. That is one slice of what banks do. They do not replace balance sheets, lending, deposit protection, or the legal framework businesses rely on when something goes wrong.\nMost huge stablecoin volume numbers also mix in trading, arbitrage, and automated on-chain activity, not just real business payments. Growth is real, but “this killed banks” is a massive leap.\n\n\nWhat actually happens historically is simple. New tech appears. Banks either integrate it or build around it. Cards did not kill banks. Online did not kill banks. Fintech did not kill banks. Stablecoin rails will likely become another layer inside the system, not a funeral for it.\n\n\nThe only constant in finance is that the plumbing evolves. The institutions managing trust and credit just keep changing shape, not disappearing.",
          "score": 9,
          "created_utc": "2026-01-31 13:03:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2whw56",
              "author": "tornavec",
              "text": "Yes, banks have always been needed as intermediaries, acting as trustees and guarantors. However, for instance, I can't know if a counterparty has sent me money until it arrives in my account. With cryptocurrency payments, I see immediately that the funds have been sent to my address. I need neither a guarantor nor a middleman.",
              "score": 2,
              "created_utc": "2026-02-01 02:32:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3arybg",
                  "author": "xaic",
                  "text": "Instant visibility on-chain sounds impressive, but in practice that problem is already being solved inside the banking system. Real-time payment rails and modern P2P infrastructures mean funds can reach accounts in seconds with clear references and identity tied to the transfer. For most businesses, “I see it in my bank instantly” versus “I see it in my wallet instantly” is not a game-changing difference.\n\n\nAlso, seeing that money was sent is not the same as having protection. Businesses care about dispute mechanisms, fraud controls, legal recourse, and compliance frameworks when something goes wrong. A transaction hash does not replace those institutional safeguards.\n\n\nAdd to that IBAN name checks, confirmation-of-payee systems, and increasingly sophisticated fraud monitoring, and the “I don’t know who paid me” issue is far less relevant than it used to be.\n\n\nStablecoins improve speed and transparency, no question. But they are enhancing the payments layer, not removing the need for the financial and legal infrastructure that banks provide.",
                  "score": 3,
                  "created_utc": "2026-02-03 06:20:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2r5xec",
          "author": "kubrador",
          "text": "$4.5 trillion in q4 2025 but somehow banks still exist, truly the end times are upon us",
          "score": 4,
          "created_utc": "2026-01-31 07:33:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2r1eyy",
          "author": "monkey6",
          "text": "Here’s some Visa numbers \n\nhttps://annualreport.visa.com/home/defaul",
          "score": 3,
          "created_utc": "2026-01-31 06:52:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2r46ks",
          "author": "alicantetocomo",
          "text": "Visa’s annual volume is $14T and global stable coin volume in 2025 was $33T. There is no point comparing Visa to the total stable coin volume as it’s an apples to oranges comparison.",
          "score": 3,
          "created_utc": "2026-01-31 07:17:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t501s",
              "author": "ChainPlastic7530",
              "text": "one guy moving between 10 different address the same 1 million usdt would be counted as 10m volume even if its 10 address he himself own, even worse when using DeFi, the same assets might move between multiple addresses only for 1 transaction...",
              "score": 4,
              "created_utc": "2026-01-31 16:11:21",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2xnelh",
              "author": "Pairywhite3213",
              "text": "Yeah, they’re separate things, but the wider acceptance of stablecoins does feel like a sign that payments are slowly moving beyond traditional rails. Tools like xMoney help connect crypto and stablecoins with regular currencies, which makes that transition feel a bit more practical and less abstract.",
              "score": 1,
              "created_utc": "2026-02-01 07:31:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2sxfce",
          "author": "EatTheOld",
          "text": "Calm down. Between fiat on / off ramp fees, exchange fees, & gas it’s cheaper to use fiat in many cases. Smart large counterparties are using the threat of moving to stablecoins as leverage with their banks to lower fees.\n\nRegulatory considerations are also real and no one wants to have to explain to their enterprise risk committee why they’re holding some thinly traded shitcoin with who knows what backing it - and don’t give me that GENIUS act nonsense, it’s worthless unless someone is actually auditing the collateral behind the coins not just trusting what the stablecoin-of-the-day is telling you they’re holding. \n\nStablecoins have tons of use cases. But it’s also still the Wild West.",
          "score": 3,
          "created_utc": "2026-01-31 15:34:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2wgvs8",
              "author": "tornavec",
              "text": "Let me tell you a real story. Back in 2019, almost all business between Chinese companies and Argentina was conducted in stablecoins. That's why China's share of USDT issuance grew to 68%. And even now, Asians are the most active in using stablecoins for business. The West, as you rightly said, is still wild and backward when it comes to cryptocurrency adoption.",
              "score": 1,
              "created_utc": "2026-02-01 02:26:33",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3l6mhb",
              "author": "Diligent-Shoulder-30",
              "text": "if you do Everything or most of it in Stablecoins you dont have to on off ramp so fees are way lower",
              "score": 1,
              "created_utc": "2026-02-04 19:48:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3l6ph6",
                  "author": "Diligent-Shoulder-30",
                  "text": "But chicken egg problem…",
                  "score": 1,
                  "created_utc": "2026-02-04 19:49:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2tn2kt",
          "author": "ConjureDiscord",
          "text": "How do stable coins handle fraud, KYC, and AML?Banks aren’t going away anytime soon just based on these questions.",
          "score": 3,
          "created_utc": "2026-01-31 17:38:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2wfmgw",
              "author": "tornavec",
              "text": "Let's be honest, we're not children here. How effective are KYC and AML really in fighting money laundering and terrorism? During this so-called \"fight\", crime has gone transnational and isn't even rushing to adopt crypto. Criminals find fiat convenient enough. As for stablecoins, their issuers can and do freeze any wallet they deem suspicious.",
              "score": 2,
              "created_utc": "2026-02-01 02:18:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ywzo3",
                  "author": "ConjureDiscord",
                  "text": "You didn’t answer the question. How does a business recover a fraudulent stablecoin payment? Banks have chargebacks and legal process. Stablecoins have ‘hope Circle freezes the wallet in time.’\nAnd Circle freezing wallets unilaterally isn’t the win you think it is. That’s just a bank with fewer protections and no FDIC insurance. You’re not disrupting the system, you’re recreating it worse.",
                  "score": 3,
                  "created_utc": "2026-02-01 13:51:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2zlzv4",
          "author": "Careful-Cup4161",
          "text": "Stablecoins are great for moving money, but not for payments, because very few people want to use them due to their complexity.",
          "score": 3,
          "created_utc": "2026-02-01 16:01:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34751m",
              "author": "tornavec",
              "text": "It's not that stablecoins are complex—it's pure user inertia. Using USDT is no harder than any other in-app payment. Funny how e-wallets were deemed \"too complex\" too, yet Africa had been using them for half a decade before the West caught on.",
              "score": 1,
              "created_utc": "2026-02-02 06:59:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o36pdbg",
          "author": "arpand",
          "text": "Working with Stablecoin payment orchestration product. Banks are very much here. \n\nStablecoins make it faster - based on region the experience can be different. Having worked with Bridge, Rampnow, YellowCard and more - payment experience is based on type of payment & region.",
          "score": 3,
          "created_utc": "2026-02-02 17:09:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3l78gj",
              "author": "Diligent-Shoulder-30",
              "text": "Would you recomend start something in the field",
              "score": 1,
              "created_utc": "2026-02-04 19:51:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2vbjru",
          "author": "PaymentFlo",
          "text": "Stablecoins are growing fast, but they’re complementing banks more than replacing them.\nMost of this volume is B2B settlement where speed and certainty matter more than consumer protections.\nThe real shift isn’t “end of banking,” it’s banks losing exclusivity over payment rails.",
          "score": 2,
          "created_utc": "2026-01-31 22:31:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2wekdy",
              "author": "tornavec",
              "text": "It's true that for now, banks remain essential for stablecoins due to their fiat gateways. However, the very purpose of digital tokens is to pull liquidity out of the traditional banking system. I'm anticipating a banking crisis that will finally push all settlements onto digital tokens.",
              "score": 1,
              "created_utc": "2026-02-01 02:12:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o30v2vv",
                  "author": "Ge_Yo",
                  "text": "No need for banks to collapse for this to play out. More likely is TradFi and Web3 complement each other, banks handle fiat ramps and compliance, stablecoins handle faster settlement. Gateways like xMoney make it practical for businesses with invoices, payment links, and payouts in fiat or stables.",
                  "score": 2,
                  "created_utc": "2026-02-01 19:26:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2wzrk7",
          "author": "ConsequencePlayful34",
          "text": "Where are people using this ?",
          "score": 2,
          "created_utc": "2026-02-01 04:25:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34825a",
              "author": "tornavec",
              "text": "From buying hosting anonymously with USDT to traders tying their wallets to cards for everyday spending—the uses are everywhere. In Australia, paying for island trips in USDT is hot because you dodge the brutal exchange fees. Dead serious. That list goes on.",
              "score": 2,
              "created_utc": "2026-02-02 07:07:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cdnss",
          "author": "Liamttt_21",
          "text": ".",
          "score": 2,
          "created_utc": "2026-02-03 14:07:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2s5wfv",
          "author": "thegamerlola",
          "text": "Stablecoins moving this fast in B2B is wild, banks better watch out.",
          "score": 1,
          "created_utc": "2026-01-31 12:56:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu3zb9",
      "title": "I worked with a fintech that didn’t fail from lack of funding, it failed from manual workflows",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qu3zb9/i_worked_with_a_fintech_that_didnt_fail_from_lack/",
      "author": "rising_48",
      "created_utc": "2026-02-02 18:54:51",
      "score": 9,
      "num_comments": 11,
      "upvote_ratio": 0.8,
      "text": "I’ve seen this happen more than once.\n\nThe product was fine. Customers were coming in. On paper, things looked okay.\n\nBut behind the scenes... Everything was manual. Onboarding took days. Approvals lived in email threads. Compliance checks were done “when someone had time.” Reporting was a mess of spreadsheets no one fully trusted.\n\nAt first, the team tried to fix it by hiring more people. That only made things slower and more fragile. What actually broke them wasn’t competition or capital, it was the operational drag. Manual processes quietly piled up until the business couldn’t move fast enough anymore.  \nSince then, I’ve noticed a pattern: fintech startups that survive don’t just build good products, they automate the boring, critical workflows early.\n\nCurious if others here have seen a startup stumble because of manual ops. What was the breaking point?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qu3zb9/i_worked_with_a_fintech_that_didnt_fail_from_lack/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o37q1lb",
          "author": "zmasta94",
          "text": "Currently running a “boring” business that I’ve grown to $1M annual rev in about 3 years. Starting to notice similar issues so I have begun building automations for repetitive tasks using Replit, Cursor et al. \n\nThis is after no-coding it with Airtable and Zapier to the best standard I could last year. \n\nWill know in three months if the early investment pays off.",
          "score": 1,
          "created_utc": "2026-02-02 19:57:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cryyq",
              "author": "rising_48",
              "text": ">That’s a solid milestone, congrats on the $1M.\n\n>\n\n>’ve seen Airtable/Zapier get teams surprisingly far, but at some point it starts bending under its own weight. Curious what tasks you’re prioritizing first.",
              "score": 1,
              "created_utc": "2026-02-03 15:21:36",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3cwo7u",
              "author": "iheartjetman",
              "text": "What kind of “boring” business do you run if you don’t mind me asking?",
              "score": 1,
              "created_utc": "2026-02-03 15:44:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o37qyfh",
          "author": "Altruistic-Cattle761",
          "text": "Uh, what exactly were all the software engineers working on while this runaway train of manual processes not just destabilized but actually destroyed the business?",
          "score": 1,
          "created_utc": "2026-02-02 20:01:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3a77h4",
              "author": "Maleficent-Loan2079",
              "text": "Yeah this feels like AI lol",
              "score": 2,
              "created_utc": "2026-02-03 03:50:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3csgso",
                  "author": "rising_48",
                  "text": ">Probably because it’s a pattern I’ve seen play out more than once. No prompts here though 🙂",
                  "score": 1,
                  "created_utc": "2026-02-03 15:24:01",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3csaz8",
              "author": "rising_48",
              "text": ">Most of engineering time was tied up in customer-facing features and integrations. Ops tooling kept getting deprioritized because it didn’t feel “urgent” until it suddenly was. By the time it became obvious, the manual debt was already massive.",
              "score": 1,
              "created_utc": "2026-02-03 15:23:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3bdk65",
          "author": "Business_Raisin_541",
          "text": "And you call them fintech? The irony",
          "score": 1,
          "created_utc": "2026-02-03 09:42:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3crsl3",
              "author": "rising_48",
              "text": ">That’s actually the irony I was trying to highlight. On the product side they were positioned as  “fintech.” Internally, a lot of it still ran like a traditional ops-heavy business. That gap is what ended up hurting them.",
              "score": 1,
              "created_utc": "2026-02-03 15:20:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hgrko",
          "author": "BigKozman",
          "text": "I have seen this pattern in fintech for almost ten years. Lots of spreadsheets, retrofitted ERPs , lots of scripting just to unify messy data sources and match transactions across banks, ledgers and payment providers and CFOs pulling their hair at end of month closing.\n\nIt’s why I built [Naya](https://naya.finance) to help fintechs automate all of this with AI and run everything through one unified ledger 📒 \n\nI guess this should have helped.",
          "score": 1,
          "created_utc": "2026-02-04 06:03:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3im7b4",
          "author": "bkh_leung",
          "text": "These are more fin than tech companies...\n\nMeaning they probably just lend people money played with large credit facilities instead of being a true tech company",
          "score": 1,
          "created_utc": "2026-02-04 12:08:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qs2xq6",
      "title": "I built an FX cost auditing tool. No one cares. What am I missing?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qs2xq6/i_built_an_fx_cost_auditing_tool_no_one_cares/",
      "author": "SaltyMajor7698",
      "created_utc": "2026-01-31 13:53:43",
      "score": 8,
      "num_comments": 23,
      "upvote_ratio": 0.79,
      "text": "I spent 6 months building a platform that audits hidden FX spreads \nin cross-border payments.\n\nThe problem seemed real:\n• Most companies pay 1.2-1.8% FX markup they don't know exists\n• Banks hide it in \"competitive rates\"\n• On $1M in annual international payments = $12-18K wasted\n\nI talked to 50+ CFOs. Built the tech. Can show exact spreads in 5 minutes.\n\nResult: No one will pay for it\n\nThe responses I get:\n• \"Interesting, but not a priority\"\n• \"We're happy with our bank\"\n• \"I don't understand the problem\"\n• \"There are existing tools for this\"\n\n\nAny brutal honesty appreciated where I positioned it wrong ? Or my whole idea is wrong .\n\n\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qs2xq6/i_built_an_fx_cost_auditing_tool_no_one_cares/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o2shxal",
          "author": "GaineyConsulting",
          "text": "Showing them there is a problem does not equal solving their problem. If your tool showed them how to actually save these costs and had actionable advice or better yet fixed the problem for them, then it’d be a different story",
          "score": 12,
          "created_utc": "2026-01-31 14:11:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sn3mx",
              "author": "loosemon",
              "text": "This what I was going to say.",
              "score": 3,
              "created_utc": "2026-01-31 14:40:44",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2thfon",
              "author": "SaltyMajor7698",
              "text": "I mean it did have a component for the transactions control but I wasn't able to highlight it since I couldn't get one cfo to give me a pilot Audit.\nI should have positioned it correctly ?? I mean I am clueless rn",
              "score": 1,
              "created_utc": "2026-01-31 17:10:46",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2thmh0",
              "author": "SaltyMajor7698",
              "text": "And appreciate the comment . Have a great one 😊",
              "score": 1,
              "created_utc": "2026-01-31 17:11:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2sgxga",
          "author": "ctrl-alt-realty",
          "text": "Honestly, for a lot of companies, \\~2% just feels like rounding error, not something worth switching banks over.",
          "score": 6,
          "created_utc": "2026-01-31 14:05:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ti3gk",
              "author": "SaltyMajor7698",
              "text": "Ok...so they just don't really care about this in fx Market ? \nI want to understand that's it",
              "score": 1,
              "created_utc": "2026-01-31 17:13:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2tk4mm",
                  "author": "ctrl-alt-realty",
                  "text": "Answer me one thing \\~ Let's say you have a revenue of 9.1Cr will you care so much to save 18 lakhs? Or will you concentrate more on cash flows, growth rate etc.?",
                  "score": 2,
                  "created_utc": "2026-01-31 17:23:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2ucpa6",
                  "author": "123eire",
                  "text": "Things of the additional dependcies on a bank. Tax filing - accountants needing access to- auditors charging for time. Likelihood of going bust. There is value but you usually need to be lucky on timing and hope to get a CEO just after they did an unusually large payment in FX and know they got spanked",
                  "score": 1,
                  "created_utc": "2026-01-31 19:39:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2sqno7",
          "author": "bkh_leung",
          "text": "Next time, evaluating the problem... you need to size the problem and the cost of switching or changing behavior \n\nAnd then judge price to all that\n\nA painful problem but not a big enough pain is not worth switching the operation over\n\nYou also need to examine how entrenched are the incumbents \n\nIs their moat how integrated they are with existing tech or ops? You're going to have to onboard users that aren't entrenched yet... and that may dramatically decrease your market size",
          "score": 3,
          "created_utc": "2026-01-31 15:00:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2th4a7",
              "author": "SaltyMajor7698",
              "text": "Yeah the cost of switching or changing behaviour is where i miscalculated.\nI mean i was talking to few CFO's they highlighted the issue but they haven't clearly mentioned this is what we are facing .\nOne of them said \"this is good but let me talk to the team how we could adapt \" but he just told them they have been handling them with the inhouse tools .\nAny way thanks for the suggestion.",
              "score": 1,
              "created_utc": "2026-01-31 17:09:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2shro7",
          "author": "kubrador",
          "text": "people don't want to know they're getting fleeced, they want to know they're not. you're selling guilt.\n\n\n\nalso cfos aren't losing sleep over 1.2% on fx spreads when they're juggling 50 other fires. you need to sell to the guy who actually touches the wire transfers and gets yelled at when money doesn't arrive.",
          "score": 2,
          "created_utc": "2026-01-31 14:10:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2thxa2",
              "author": "SaltyMajor7698",
              "text": "Wait am I targeting the wrong people entirely....",
              "score": 1,
              "created_utc": "2026-01-31 17:13:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2tjnlf",
          "author": "swemming",
          "text": "How are you auditing the spreads? When you find there is a difference in spread what is your solution to the CFO?",
          "score": 1,
          "created_utc": "2026-01-31 17:21:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2tm994",
              "author": "SaltyMajor7698",
              "text": "We audit spreads through real-time monitoring against market benchmarks, with automated alerts flagging deviations beyond set thresholds. When differences are found, we quantify the exact cost impact, present data-driven evidence to providers requesting justification or rebates for unjustified spreads, and renegotiate rate cards if patterns emerge. We then optimize processes through better timing windows, pre-trade controls, and competitive bidding. The CFO receives quarterly reports detailing total spread costs, amounts recovered through interventions, and projected savings from optimizations, ensuring transparency and continuous improvement in FX execution.  \ni used ai to write this as i want to be a bit detailed , sorry",
              "score": 0,
              "created_utc": "2026-01-31 17:34:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3nue02",
                  "author": "halfbakedalaska",
                  "text": "What is anyone supposed to do with this information other than get mad about having to pay a middle man?  Do you have a solution to eliminate the middle man and save someone money?  Because that would be worth paying for of course (and you become the middle man but in a different, much less expensive way.)\n\nI think this isn’t an easy problem to solve for many reasons, including regulatory and risk challenges.",
                  "score": 1,
                  "created_utc": "2026-02-05 04:25:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2vaxao",
          "author": "sonicadishservedcold",
          "text": "How plug and play is this. If they have to get approvals for change management in their org to get your widget in the are not going to do this. \n\nAlso people may not give you access to real time data for a pilot. Can you ask them for historical data identified for you to run scenarios and show them actual losses every month. \n\nGetting a pilot in organizations is hard. We have to find the right stakeholder for whom this is a pain point daily and who can get promoted due to this or save their jobs. Run through 2-3 orgs and drive down different stakeholders till you find an excited one.",
          "score": 1,
          "created_utc": "2026-01-31 22:28:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vb3zi",
          "author": "PaymentFlo",
          "text": "The problem isn’t that the cost isn’t real, it’s that it’s hidden, gradual, and already normalized.\nCFOs pay urgently to stop fires, not to optimize leaks they don’t feel daily. This usually sells only when tied to a bigger trigger, like switching banks or post-audit pressure.",
          "score": 1,
          "created_utc": "2026-01-31 22:29:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xettl",
          "author": "Why_StrangeNames",
          "text": "Did you dig further when u got those responses?",
          "score": 1,
          "created_utc": "2026-02-01 06:16:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xrv1c",
              "author": "SaltyMajor7698",
              "text": "Yes yes and got a clear picture \nThanks to the responses I made few tweaks",
              "score": 1,
              "created_utc": "2026-02-01 08:11:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2yqem6",
                  "author": "Why_StrangeNames",
                  "text": "So what’s the picture now?",
                  "score": 1,
                  "created_utc": "2026-02-01 13:10:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2y89le",
          "author": "iPhantomDragon",
          "text": "As of January 2024 (for NatWest, RBS and Ulster Bank) the FX spread had actually been increased to 2.5% for payments up to the value of £25,000 crippling even more businesses. I left in August due to them mismanaging the money and constantly coming up with \"no permanent contracts come up in Bolton, just have to stay on agency\" and \"no budget for a raise\" after 3+ years of employment with thr agency. Being on the agency meant I could be paid \"the minumim salary for this particular band\" whilst also not qualifying for 99%of the benefits that the permanent staff do. Total BS",
          "score": 1,
          "created_utc": "2026-02-01 10:43:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z6awa",
          "author": "khanoftruthfi",
          "text": "I worked for a company that had a lot of cross border fx, and to your point we had a lot of cross border slippage as a result. The problem wasn't the audit. We know we are incurring slippage. We would never have paid for a software to tell is what we already know (maybe with more precise numbers).\n\nWe would have paid for a solution to reduce that slippage. I think the tech has meat on the bones if you can convert from identifying the problem to solving the problem (in any capacity).",
          "score": 1,
          "created_utc": "2026-02-01 14:44:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qua1x3",
      "title": "Any tried and tested takes on best corporate card programs for small businesses?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qua1x3/any_tried_and_tested_takes_on_best_corporate_card/",
      "author": "Otherwise-Ear1256",
      "created_utc": "2026-02-02 22:33:42",
      "score": 8,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Any corporate card fintech wizards that could give me an unbiased overview on the perks of using corporate cards for a small business? Hybrid office with distributed sales team, if it helps. The bundled expense tracking features + cashback look attractive - current setup feels limited comparably.. Options on the table include all the top names with ramp and brx lined up as likely choices. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qua1x3/any_tried_and_tested_takes_on_best_corporate_card/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o3bzerb",
          "author": "Sea-Invite3130",
          "text": "For a distributed team the expense tracking integration matters way more than cashback so how we did it was having everything auto sync through Ramp with our sales team across 4 states",
          "score": 6,
          "created_utc": "2026-02-03 12:44:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f67oj",
          "author": "whatwilly0ubuild",
          "text": "For a small business with distributed sales team, Ramp is probably your best bet. The cashback is 1.5% flat with no categories to optimize around, the expense management is genuinely good, and the controls for distributed teams work well. You can issue virtual cards instantly for specific vendors or spending categories and set per-card limits. The receipt matching and auto-categorization saves real time compared to chasing salespeople for expense reports.\n\nBrex has pulled back from small businesses and is focusing more on mid-market and enterprise. Unless you're venture-backed or have significant cash balances they may not even approve you. Worth checking but don't count on it.\n\nOther options worth considering. Amex Business Gold or Platinum gives you points instead of cashback which can be worth more if you travel, plus the brand carries weight with some vendors and clients. The expense tooling is weaker than Ramp though so you'd potentially need a separate expense management layer.\n\nMercury offers corporate cards tied to their banking product. If you're already banking with them or considering it, having cards and banking in one place simplifies things. The rewards are modest compared to Ramp but the unified dashboard is nice.\n\nFor a distributed sales team specifically, the things that matter most in practice are easy virtual card issuance so you're not mailing physical cards everywhere, clear spending policies that enforce themselves, and receipt capture that doesn't require nagging. Ramp handles all three well.\n\nOur clients running similar setups usually land on Ramp for the operational efficiency and only choose Amex when the travel rewards or brand perception matters more than expense automation.\n\nOne thing to check is whether your current accounting software integrates cleanly with whatever you pick. A card program that doesn't sync with your books just moves the manual work from expense reports to reconciliation.",
          "score": 3,
          "created_utc": "2026-02-03 22:01:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ayzb1",
          "author": "Budget-Vegetable8158",
          "text": "Hey! I've worked with a few different platforms in this space. For distributed teams specifically, you'll want to look at a few key things beyond just cashback:  \n  \n1. How easy is it for your sales team to get virtual cards instantly when they need them? (traveling, ads, subscriptions)  \n2. Does the expense tracking actually reduce the back-and-forth, or does it just create a fancier spreadsheet?  \n3. Real-time visibility into spend - can you actually catch issues before month-end?  \n  \nRamp and Brex are solid options, but also worth checking out PayEm. They're particularly strong on the multi-entity/distributed team side - the approval workflows are actually intuitive (rare in fintech), and their virtual card provisioning is instant. The GL coding automation is legitimately helpful if you're trying to close books faster.  \nThe cashback rates are pretty competitive across the board these days - I'd focus more on which platform actually reduces your team's administrative load vs. just digitizing the same painful process.  \nWhat's your current pain point - the reimbursement process, the lack of spend visibility, or something else?",
          "score": 1,
          "created_utc": "2026-02-03 07:21:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3azcpx",
          "author": "thesophisticatedCISO",
          "text": "I've worked with a few small businesses making this switch, I'd suggest looking at PayEm - less talked about but built specifically for the hybrid/distributed use case you described. Their sales team controls are particularly good for what you're describing.   \n  \nSince you mentioned a distributed sales team, a few things that might help your evaluation are virtual cards capabilities - really useful for remote teams and one-off vendor payments. Not all platforms handle this equally well.  \n  \nOn the expense tracking side, check how granular the policy controls are. With distributed teams, you'll want something that doesn't require constant manual approval but still gives you visibility.",
          "score": 1,
          "created_utc": "2026-02-03 07:25:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1quihtt",
      "title": "Honest question: are corporate cards actually helping finance teams, or just adding another layer to manage?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1quihtt/honest_question_are_corporate_cards_actually/",
      "author": "Routine_Post_3154",
      "created_utc": "2026-02-03 04:39:55",
      "score": 7,
      "num_comments": 9,
      "upvote_ratio": 0.82,
      "text": "This might be an unpopular take, but I’m not sure corporate cards have evolved at the same pace as modern companies.\n\nOn the surface, they solve a real problem. In reality, finance teams still spend a lot of time dealing with workarounds: manual approvals, unclear ownership, reimbursement policies, and after-the-fact reviews.\n\nAs companies grow and spend becomes more distributed, it often feels like the card system is reacting instead of leading. Finance becomes a traffic controller rather than a strategic function.\n\nAre corporate cards genuinely reducing operational load for your team?  \n\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1quihtt/honest_question_are_corporate_cards_actually/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o3jt8lc",
          "author": "DigIndependent7488",
          "text": "Ramp is reducing the operational load in my business by a lot, and just lowering internal confusion and making processes easier overall. They feel pretty modern and caught up to modern businesses... I know it's kind of cliché to mention Ramp and whatever but they're unironically really good\n\n",
          "score": 11,
          "created_utc": "2026-02-04 16:02:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ahgna",
          "author": "FinalFlower1915",
          "text": "This is a dumb post. It reads like op is about to pitch a BRAND NEW PRODUCT TO REPLACE CARDS woo ooh..\nBet it's.. drumroll.. virtual cards",
          "score": 3,
          "created_utc": "2026-02-03 04:59:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ajod8",
              "author": "Routine_Post_3154",
              "text": "lol",
              "score": 2,
              "created_utc": "2026-02-03 05:15:11",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3d97c8",
              "author": "swemming",
              "text": "They are about to pitch ramp. I love ramp but the marketing is getting egregious.",
              "score": 1,
              "created_utc": "2026-02-03 16:42:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3e2btb",
                  "author": "FinalFlower1915",
                  "text": "ramp is just another card provider lol",
                  "score": 2,
                  "created_utc": "2026-02-03 18:55:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3agnqa",
          "author": "Smart-Psychology-148",
          "text": "I think they help a lot. being the head of marketing now I have separate card of company and now I don’t have to rely upon my CEO for the payments and neither do I have to rely upon my personal card and later claim reimbursement so it helps a lot",
          "score": 2,
          "created_utc": "2026-02-03 04:53:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f5o8m",
          "author": "whatwilly0ubuild",
          "text": "Corporate cards are genuinely better than the alternatives they replaced. The question is whether \"better than expense reports and reimbursements\" is a high enough bar, and it isn't.\n\nThe modern card platforms like Ramp, Brex, and similar have actually moved the needle on the control side. Real-time spend visibility, per-card limits, merchant category restrictions, automated receipt matching. Compared to handing someone a shared Amex and hoping they submit receipts, it's a massive improvement. That part works.\n\nWhere it falls apart is exactly what you described. The approval workflows are clunky, ownership gets murky as teams scale, and finance still ends up doing after-the-fact cleanup rather than proactive management. The tools promise \"set policies and forget\" but in practice every company has edge cases that don't fit clean rules. Someone needs a higher limit for one vendor, a contractor needs temporary access, a subscription renewal hits an expired card. Each exception becomes a manual touch.\n\nThe deeper problem is that cards are a spending mechanism being asked to be a spend management system. Those are different things. Our clients managing distributed teams have found that the card itself is maybe 30% of the problem. The other 70% is budget ownership, procurement process, and forecasting. No card platform solves those well because they're organizational problems not payment problems.\n\nThe \"finance as traffic controller\" observation is accurate and it's a design failure in how most companies implement these tools. If every transaction needs someone in finance to approve, adjust, or reconcile, you've just digitized the bottleneck rather than eliminating it.\n\nWhat actually reduces operational load is pushing budget ownership to department leads with hard limits and letting finance focus on exceptions and trends rather than individual transactions.",
          "score": 2,
          "created_utc": "2026-02-03 21:58:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3fhshq",
          "author": "vjgunner",
          "text": "I’m generally pro corporate cards, but only when they’re actually smart. Otherwise you’re right, they just move the mess upstream. How they’ve helped in my experience, when done right:\n1. No reimbursements later. Spend gets captured and reconciled in the same cycle instead of chasing people three months later with “hey can you upload that receipt?”\n2. Employees save a ton of time and don’t have to front their own money, which quietly removes a lot of friction and resentment.\n3. Big win for finance if the controls are good. The card should know where it’s being used, block obviously wrong stuff, and auto-tag spend to the right category or GL without manual cleanup.\n4. When cards have dumb limits and generic rules, finance becomes a traffic cop. When they have contextual controls, finance actually gets to lead instead of react.\n\nSo yeah, corporate cards can be great. But only if they’re opinionated enough to enforce policy on swipe, not just record mistakes after the fact.",
          "score": 1,
          "created_utc": "2026-02-03 22:58:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtd8iu",
      "title": "Airwallex escalated a £5k business dispute into a POCA freeze on six figures — police lifted it almost immediately",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qtd8iu/airwallex_escalated_a_5k_business_dispute_into_a/",
      "author": "Top_Cold7905",
      "created_utc": "2026-02-01 22:40:15",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 0.78,
      "text": "Posting this anonymously as a warning to other founders.\n\nI’ve just come out the other side of what can only be described as a completely disproportionate overreach by Airwallex, and I feel people choosing fintech banks deserve to know how bad this can get.\n\nShort version:\n\nA routine B2B dispute (\\\\\\\\\\\\\\~£5k) was escalated by Airwallex into a POCA (Proceeds of Crime Act) account freezing order, locking six figures of legitimate business funds.\n\nThe police reviewed the evidence and applied to court to lift the freeze almost immediately.\n\nThat alone should tell you something.\n\n⸻\n\nWhat happened\n\n\t•\tLong-standing trading business, compliant, VAT-registered, with documented turnover.\n\n\t•\tOne customer raised a dispute on a wholesale order (commercial disagreement, not fraud).\n\n\t•\tAirwallex froze the entire account, not just the disputed amount.\n\n\t•\tWithout warning, this escalated into a POCA freezing order via law enforcement.\n\n\t•\tNo charges. No allegations. No explanation at the time.\n\nI was then required to:\n\n\t•\tSubmit invoices\n\n\t•\tSubmit bank statements\n\n\t•\tExplain business model\n\n\t•\tAttend an interview (civil, not under caution)\n\nAfter reviewing the documents, the police officer herself applied to court to set aside the POCA order.\n\nThe court agreed.\n\n⸻\n\nThe problem\n\nThis wasn’t fraud.\n\nThis wasn’t money laundering.\n\nThis wasn’t criminal.\n\nIt was a commercial dispute, and Airwallex treated it like organised crime.\n\nWhat’s terrifying is:\n\n\t•\tPOCA is designed for serious criminal proceeds\n\n\t•\tAirwallex appears willing to trigger it over routine business disputes\n\n\t•\tThe freeze applied to all funds, not the disputed amount\n\n\t•\tThere is no meaningful warning, timeline, or recourse while it happens\n\nEven worse:\n\nThe police cleared it faster than Airwallex froze it.\n\nThat tells you where the real dysfunction sits.\n\n⸻\n\nWhy this matters\n\nIf you’re a:\n\n\t•\tfounder\n\n\t•\tinternational trader\n\n\t•\thigh-volume business\n\n\t•\tbusiness relying on USD/EUR rails\n\nYou need to understand this risk.\n\nWhen fintech banks say “we may freeze your account for compliance”, what they really mean is:\n\nWe can remove your access to working capital instantly, escalate it to law enforcement, and let you fight to prove innocence.\n\nEven if you’ve done nothing wrong.\n\n⸻\n\nMy takeaway\n\n\t•\tAirwallex is extremely risk-averse to the point of recklessness\n\n\t•\tPOCA should be a last resort — not a compliance shortcut\n\n\t•\tThe damage to a business during a freeze is real, immediate, and severe\n\n\t•\tBeing “cleared” doesn’t undo the disruption\n\nI’m not naming myself or my company, but I would not choose Airwallex again, and I strongly suggest anyone considering them understands this risk before trusting them with material balances.\n\nIf you’re choosing a banking partner:\n\nAsk yourself what happens on their worst day — not their best.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qtd8iu/airwallex_escalated_a_5k_business_dispute_into_a/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o34adan",
          "author": "tjech",
          "text": "I’ve had both Barclays and Revolut do something similar. In Revoluts case, we were locked out of £100k and it took a week to unfreeze. Barclays was much longer. We make sure to split funds across multiple accounts and separate ops from treasury accounts. Banks 🤷🏼‍♂️",
          "score": 1,
          "created_utc": "2026-02-02 07:28:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34fzjy",
          "author": "FarAwaySailor",
          "text": "In the future we will all be using payment solutions that don't involve 3rd party custody of funds and this 40yr old throwback system will disappear forever.",
          "score": 1,
          "created_utc": "2026-02-02 08:20:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34kigp",
              "author": "emgeehammer",
              "text": "Found the butter",
              "score": 1,
              "created_utc": "2026-02-02 09:04:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o34p0bc",
                  "author": "FarAwaySailor",
                  "text": "Let me know if you want to use it to make an omelette.",
                  "score": 1,
                  "created_utc": "2026-02-02 09:48:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qu2kpt",
      "title": "How do you test Stablecoin payments KYB and KYC?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qu2kpt/how_do_you_test_stablecoin_payments_kyb_and_kyc/",
      "author": "arpand",
      "created_utc": "2026-02-02 18:06:31",
      "score": 5,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "We appear to be hitting the wall while working on Stablecoin payment orchestration for the customer. \n\n  \nThe customer expects us to test with different scenarios, but we do not have enough testing scenarios or data points to test. \n\n\n\nWe have to test this in the production environment, or has any found a better solution?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qu2kpt/how_do_you_test_stablecoin_payments_kyb_and_kyc/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o398fp0",
          "author": "FarAwaySailor",
          "text": "It's unclear what your requirement is, but you can run stablecoin payments between wallets with no KYC at all. If your business flow requires KYC for some other reason you can test that as a totally separate process.",
          "score": 5,
          "created_utc": "2026-02-03 00:30:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3acwih",
              "author": "arpand",
              "text": "Our workflow requires KYB. Hence, we need a community support to test out the solution.",
              "score": 2,
              "created_utc": "2026-02-03 04:27:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37q3jj",
          "author": "jayebird111",
          "text": "Need more information to answer this. What technology are you using? What have you tried?",
          "score": 3,
          "created_utc": "2026-02-02 19:57:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ad0dn",
              "author": "arpand",
              "text": "The product is built on TypeScript and AWS. The problem is we have very limited to production accounts to test out flows.",
              "score": 2,
              "created_utc": "2026-02-03 04:28:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o392ddh",
          "author": "whatwilly0ubuild",
          "text": "Testing compliance flows in production is a terrible idea for obvious reasons. You don't want real customer data mixed with test scenarios and you definitely don't want to submit fake KYB documents to actual compliance providers.\n\nMost KYC/KYB providers have sandbox environments but they're limited. Sumsub, Onfido, Jumio, and similar all offer test modes with predefined personas that trigger different outcomes like pass, fail, manual review, document expired. The problem is these sandboxes don't cover the weird edge cases that actually matter, like a business registered in one jurisdiction with directors in three others and a complex ownership structure.\n\nWhat actually works for comprehensive testing. Build a mock compliance layer that sits between your orchestration system and the real providers. Define your own test personas that map to real scenarios your customer cares about. Sole proprietor, multi-entity corporate, high-risk jurisdiction, PEP involvement, mismatched beneficial ownership docs. Route test transactions through the mock layer and real ones through the actual provider. This gives you unlimited test scenarios without touching production compliance infrastructure.\n\nFor the stablecoin payment flow specifically, most chains have testnets where you can simulate the actual payment mechanics. Ethereum Sepolia, Solana devnet, whatever chain you're on. Circle has USDC on testnets. The payment orchestration logic can be tested end to end without real money.\n\nThe gap our clients usually hit is the integration between payment confirmation and compliance status. Payment lands on-chain but KYB is pending, or KYB passes but the wallet isn't whitelisted yet. These state machine edge cases are where bugs hide and they're best caught with a proper test harness, not production testing.\n\nBuild a scenario matrix with your customer. Every combination of KYB status, KYC status, payment amount threshold, jurisdiction, and entity type. That becomes your test plan and also your documentation for compliance auditors who will eventually ask how you validated the system.",
          "score": 3,
          "created_utc": "2026-02-02 23:57:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ad72j",
              "author": "arpand",
              "text": "\\-->The gap our clients usually hit is the integration between payment confirmation and compliance status. Payment lands on-chain but KYB is pending, or KYB passes but the wallet isn't whitelisted yet. These state machine edge cases are where bugs hide and they're best caught with a proper test harness, not production testing.\n\nThis. Thank you. We will create testing plan based on this. Thank you.",
              "score": 2,
              "created_utc": "2026-02-03 04:29:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3p3wqd",
          "author": "Nervous-Cup-7279",
          "text": "have created a group of testers across geographies. do get in touch if interested",
          "score": 1,
          "created_utc": "2026-02-05 10:59:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1quxvfj",
      "title": "Never ran ads in my life, looking for advice for a B2B Payment Processor in an emerging market",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1quxvfj/never_ran_ads_in_my_life_looking_for_advice_for_a/",
      "author": "Careful-Cup4161",
      "created_utc": "2026-02-03 17:15:44",
      "score": 5,
      "num_comments": 24,
      "upvote_ratio": 1.0,
      "text": "I’m currently building a B2B SaaS payment processor, targeting an emerging / early-stage market.\n\nNow I’m wondering:  \n  \n•When does it actually make sense to start running ads for a B2B SaaS?  \n•Are ads even worth it early on in an emerging market?  \n•Which channels would you recommend first (Google, Meta, Reddit, LinkedIn, others)?  \n•What would be a reasonable starting budget for a young startup with very limited funds?\n\nTo be clear:  \n  \n•We’re a small team  \n•Early traction but still iterating  \n•No clear idea of budget yet just trying to understand what’s realistic and what’s a waste of money at this stage\n\nI’m not looking for growth hacks or “scale fast” advice more like founder-to-founder lessons:\n\nthings you wish you knew before burning money on ads.\n\nAny feedback, war stories, or strong opinions welcome\n\nThanks a lot!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1quxvfj/never_ran_ads_in_my_life_looking_for_advice_for_a/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o3fz7cx",
          "author": "PaymentFlo",
          "text": "Ads make sense after you know exactly who buys, why, and how long sales take.\nIn emerging B2B markets, ads usually educate more than they convert which gets expensive fast.\nEarly on, founder-led sales, content, and direct conversations beat paid traffic.\nAds work best once you’re amplifying something that already closes, not trying to discover it.",
          "score": 2,
          "created_utc": "2026-02-04 00:33:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i0svw",
              "author": "Careful-Cup4161",
              "text": "Yes, that’s my impression as well. We were thinking of testing a specific country, like India, since we’re going to adopt Indian payment methods.\n\nDo you have experience in fintech marketing?  \nI’d be interested in discussing it with you.",
              "score": 1,
              "created_utc": "2026-02-04 09:01:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hyl2q",
          "author": "Forsaken_Lie_8606",
          "text": "organic growth is underrated. if your product is good enough that people tell others about it you dont need ads at all. most of the best fintech products i use i found through word of mouth",
          "score": 2,
          "created_utc": "2026-02-04 08:40:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i0qwe",
              "author": "Careful-Cup4161",
              "text": "Yes, that’s my impression as well. We were thinking of testing a specific country, like India, since we’re going to adopt Indian payment methods.\n\nDo you have experience in fintech marketing?  \nI’d be interested in discussing it with you.",
              "score": 1,
              "created_utc": "2026-02-04 09:00:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3di7o0",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 17:24:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ds8h8",
              "author": "Careful-Cup4161",
              "text": "did you try to run ads yourself?",
              "score": 1,
              "created_utc": "2026-02-03 18:10:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3dzcpx",
          "author": "Designer_Money_9377",
          "text": "The main thing with early B2B ads in an emerging market is often about validating demand before scaling spend.\n\nI've tried a few approaches for identifying early B2B leads, from manual LinkedIn prospecting to using tools like Apollo or even just scraping Reddit threads myself. leadsRover is interesting because it specifically scans Reddit for high-intent mentions and helps draft responses, which can save a ton of time compared to manual searching, though it's still pretty niche.\n\nAre you seeing any specific forums or communities where your target businesses are already discussing payment solutions?",
          "score": 1,
          "created_utc": "2026-02-03 18:41:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3haxla",
              "author": "Accurate_Might3142",
              "text": "Agree on validating demand before spending on ads. Scanning places where people are already talking about the problem (like Reddit or niche forums) is usually a much stronger signal early on than broad targeting.\n\nOnce intent is clear, the bottleneck I’ve seen is turning those conversations into usable B2B leads without a ton of manual work. That’s where pairing intent discovery with lightweight enrichment helps. We’ve used Peak AI at that stage to fill in work emails or validate contacts after identifying relevant companies, which keeps things focused instead of scaling spend blindly.\n\nCurious what segments you’re seeing the most traction from so far.",
              "score": 1,
              "created_utc": "2026-02-04 05:18:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3heonv",
                  "author": "Wide_Brief3025",
                  "text": "Your approach makes a lot of sense. Tapping into active discussions where pain points come up has given me better leads than running broad ads ever did. If you want to automate finding those intent rich conversations and get alerts as they happen, ParseStream can really cut down the manual work without missing relevant chances.",
                  "score": 1,
                  "created_utc": "2026-02-04 05:47:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ffa94",
          "author": "StrongLiterature8416",
          "text": "For a B2B processor in an emerging market, ads are usually a bad first move until you know exactly who closes and why.\n\n\n\nWhat worked for me: pick one narrow segment (e.g., mid-size wholesalers, SaaS resellers, etc.), do 20–30 discovery calls, and close 3–5 customers via pure outbound + referrals. Until you can consistently get someone to say “yes” on a call, ads just help you waste money faster.\n\n\n\nI’d start with:\n\n\\- Direct outreach: LinkedIn DMs, warm intros, industry WhatsApp/Telegram groups.\n\n\\- Answering niche questions: here on Reddit, local forums, founder/SMB communities.\n\n\n\nChannels later: Google Search for high-intent “B2B payments \\[your country\\]”, maybe Reddit/Meta retargeting, and I’d only touch LinkedIn once ACV is high and positioning is tight.\n\n\n\nFor tiny budgets, think in experiments: $300–$500 per channel to buy learning, not growth. I’ve used HubSpot and Apollo for outbound, and Pulse to surface Reddit threads where people are literally complaining about payments so I can jump in with something specific. So the point: nail one narrow use case via hand-to-hand selling before you pump money into ads.",
          "score": 1,
          "created_utc": "2026-02-03 22:45:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i0ug9",
              "author": "Careful-Cup4161",
              "text": "thanks, already have a reddit tool",
              "score": 1,
              "created_utc": "2026-02-04 09:01:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3i34gu",
          "author": "SchniederDanes",
          "text": "one mistake i see B2B founders make early is assuming ads should “convert” on their own. in b2b, especially emerging markets, they almost never do.\n\nwhat’s worked better for us is treating ads as intent capture, not conversion... we run ads and give people a simple option to call. those calls go to an AI receptionist on dialnote.com.. that answers common questions, qualifies the lead, and books a meeting if there’s real intent... anyone who doesn’t book or drops off gets added to a smartreach.io.. where we run a nurturing sequence that runs over a few months.\n\nthat post-ad system is what actually improves ROAS... ads alone rarely work. what happens after the click matters more than the click itself.",
          "score": 1,
          "created_utc": "2026-02-04 09:23:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ichhq",
              "author": "Careful-Cup4161",
              "text": "what is your project?",
              "score": 1,
              "created_utc": "2026-02-04 10:50:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3nvr9s",
                  "author": "SchniederDanes",
                  "text": "set it up for a client that provides payment solutions (merchant services)",
                  "score": 2,
                  "created_utc": "2026-02-05 04:34:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ixz0b",
          "author": "sandropuppo",
          "text": "For B2B payments in an emerging market, I'd honestly hold off on paid ads until you've nailed your ICP through direct outreach and partnerships.   \n  \nLinkedIn can work but your CAC will be brutal early on - focus on building case studies first, then ads become way more effective.",
          "score": 1,
          "created_utc": "2026-02-04 13:24:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3j0cug",
              "author": "Careful-Cup4161",
              "text": "Thanks for the advice!  \nDo you have experience in fintech marketing?  \nI’d be interested in discussing it with you.",
              "score": 1,
              "created_utc": "2026-02-04 13:38:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3j3krs",
                  "author": "sandropuppo",
                  "text": "I don't unfortunately, but still have experience with similar marketing stuff (i was working at notion). feel free to dm me",
                  "score": 1,
                  "created_utc": "2026-02-04 13:55:32",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3jdfbo",
                  "author": "Wide_Brief3025",
                  "text": "For B2B fintech, organic engagement usually works best at first. Try joining industry discussions on platforms like Reddit and LinkedIn to build credibility and learn what decision makers care about. If you want to track relevant conversations and spot lead opportunities in real time, ParseStream can help streamline that process without needing to go all in on paid ads.",
                  "score": 1,
                  "created_utc": "2026-02-04 14:47:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3jwbo4",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-04 16:16:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jwnfg",
              "author": "Careful-Cup4161",
              "text": "Yes, that’s what everyone here told me, I’m going to focus on outbound then! Thanks for the reply!",
              "score": 1,
              "created_utc": "2026-02-04 16:18:22",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3k3dk9",
              "author": "Wide_Brief3025",
              "text": "Focusing on outbound is smart at this stage since you can learn a ton by talking directly to prospects. Another strategy that works for B2B payment processors is tracking online conversations where your target audience hangs out. There are tools like ParseStream that alert you when relevant discussions pop up on Reddit, Quora, and LinkedIn so you can engage right away which can be a goldmine for finding early leads.",
              "score": 1,
              "created_utc": "2026-02-04 16:49:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3or2r4",
                  "author": "Careful-Cup4161",
                  "text": "do you scrappe and automate comment? I'm interrested",
                  "score": 1,
                  "created_utc": "2026-02-05 08:58:05",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3oe5mp",
          "author": "United_Broccoli_4032",
          "text": "For an early-stage B2B SaaS, especially in an emerging market, it often makes sense to start ads once you have a solid grasp of your value props and a clear ICP-otherwise you’re just burning cash guessing. Instead of spreading thin across platforms right away, lean into channels where you can hyper-target decision-makers; LinkedIn is a natural fit but can get pricey, and Meta can surprise you if you target by job title or industry interests.\n\nWith limited funds, aim for learning over scaling. Test creatives and messaging with small daily budgets, then double down on what’s moving the needle. That’s exactly where something like Didoo AI shines - it automates testing and optimization so you’re not stuck manually fiddling with audiences and creatives all day, which is a huge time and budget saver early on.\n\nNothing beats founder-to-founder: be patient, track unit economics closely, and treat your ad spend as a research budget until your funnel’s solid. Ads are worth it, just not before you’ve nailed what you’re actually selling and who’s actually buying.",
          "score": 1,
          "created_utc": "2026-02-05 06:57:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3or6li",
              "author": "Careful-Cup4161",
              "text": "Thanks",
              "score": 1,
              "created_utc": "2026-02-05 08:59:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qwkefu",
      "title": "What is your KYC compliance software missing that you need right now?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qwkefu/what_is_your_kyc_compliance_software_missing_that/",
      "author": "_bugmaker",
      "created_utc": "2026-02-05 12:49:01",
      "score": 5,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "Hello guys,\nI’m thinking of building a kyc compliance software that will provide you with tools to:\n\n- Collect securely your customer (individuals & companies) data & docs through a link or an embedding on your own website/app\n\n- Perform ID & document verification\n\n- Perform a one-click sanction check across US, EU & Africa sanction databases\n\n- Perform risk assessment based on predefined or custom rules\n\n- Generate dynamic reports on human language input.\n\n- Create a custom playbook that will be run on receiving a KYC. This playbook will enable you to go through your companies internal process and publish status updates (even to your customer)\n\nI know there are quite some tools out there that currently do those, so what do you think there are missing that would be a game changer for you if they had it ? Be it business specific (legal/law, Financial, etc) or technical.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qwkefu/what_is_your_kyc_compliance_software_missing_that/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o3prxhq",
          "author": "tonyfith",
          "text": "KYC is not a software problem. The problem is lack of open international databases to verify data against. Anyone who has ever tried to use a (global) real-time business registrations verification knows the issue.",
          "score": 6,
          "created_utc": "2026-02-05 13:47:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qrg29",
              "author": "_bugmaker",
              "text": "Do you know Open Santions ? This is an aggregation of a lot of international sources. Pretty Decent IMO. Do you think we need a lot more than that ?",
              "score": 1,
              "created_utc": "2026-02-05 16:43:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qy4fy",
          "author": "alicantetocomo",
          "text": "All of these features are table stakes in kyc systems today. What other pain point are you solving?",
          "score": 4,
          "created_utc": "2026-02-05 17:14:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3r7b4r",
              "author": "_bugmaker",
              "text": "That’s actually my question. I know that those features are the “basic” features provided by these kind of softwares. The reason we are thinking about building it is that we’ve already developed the different components and we just need to “put them together” to get this kind of software. So asking this question is the same as asking: What do you think will be a key differentiator for a KYC software in the current market ?",
              "score": 1,
              "created_utc": "2026-02-05 17:57:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pl1ld",
          "author": "Arjun_SHIELD",
          "text": "Great idea. KYC is a headache in fintech/marketing tech!\n\nTech-wise, better no-code custom rules + real-time sanction lists. Would love multi-lang support for global teams too.",
          "score": 3,
          "created_utc": "2026-02-05 13:07:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qrulj",
              "author": "_bugmaker",
              "text": "A WYSIWYG rule builder would be nice indeed. What do you mean by “realtime” sanction list ? How can it be realtime ?",
              "score": 1,
              "created_utc": "2026-02-05 16:45:31",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3s2if9",
              "author": "SeanyDay",
              "text": "Asking for better no-code is a backwards way of saying you need at least one real dev/engineer on your team.\n\nNo code is always inferior at scale.\n\nGet a real dev and they will use the tools better than your extremely limited no code options.",
              "score": 1,
              "created_utc": "2026-02-05 20:22:11",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3s8aut",
              "author": "13Morton",
              "text": "GBG offers all of this",
              "score": 1,
              "created_utc": "2026-02-05 20:49:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3r3j4i",
          "author": "rhizome-compliance",
          "text": "There are hundreds of solutions that do all of this. We offer one at Rhizome Compliance, and we throw it in for free if you buy other services from us. There are other providers that claim free KYC as well. Something to consider if you're trying to determine where the floor is for these types of products.",
          "score": 3,
          "created_utc": "2026-02-05 17:40:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rhhtg",
          "author": "GabagoolProvolone",
          "text": "There's plenty out there, but my beef is that they're clunky and unreliable, filled with putrid AI tweaks that'll end up flagging anyone who's ever logged onto the internet.",
          "score": 2,
          "created_utc": "2026-02-05 18:44:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3slcum",
          "author": "Wrong_Watercress1937",
          "text": "As a legal consultant in the space, I see this debate often. OCR is just data entry; it is NOT fraud detection.\n\nIf your compliance says OCR is insufficient, they are likely worried about 'Presentation Attacks' and high-quality AI forgeries. The 'middle ground' isn't about doing full forensics in-house-it’s moving toward a Risk-Based Approach (RBA).\n\nFor low-risk tiers, basic OCR is fine. But for high-risk onboarding, you need Document Authenticity Verification which includes:\n\n- Metadata analysis: Checking if the PDF was recently saved in Photoshop.\n- Pixel anomaly detection: Identifying 'cut-and-paste' traces on the document image.\n- NFC Chip validation: If it’s a modern passport, reading the chip is the only way to get near 100% certainty.\n\nDon't build this yourself-integrate a forensic-level vendor. If you need a breakdown of which tech satisfies EU vs. US regulators, I have some resources linked in my profile.",
          "score": 2,
          "created_utc": "2026-02-05 21:52:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3s8wdj",
          "author": "13Morton",
          "text": "[Here](https://identitytechnologist.com) is an industry site you may want to poke around on…",
          "score": 1,
          "created_utc": "2026-02-05 20:52:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v2ypq",
          "author": "Emma_exploring",
          "text": "I’d say most KYC tools already cover the basics you listed, but the real gap is in developer‑friendly integration and smarter automation. A lot of platforms feel clunky when you try to plug them into existing stacks. APIs are limited, webhooks are rigid, and customization usually means hacking around their system. If you want a game changer, make it dead simple to integrate with whatever workflow a company already has.\n\nAnother missing piece is real‑time monitoring and adaptive risk scoring. Most tools just run static checks, but imagine if the system could continuously update a customer’s risk profile based on new data sources or behavioral signals. That would move KYC from a one‑time compliance box‑check to an ongoing intelligence layer.\n\nAnd honestly, UX matters too. Compliance software is notorious for bad dashboards. If you can make reporting and playbooks intuitive, with clear audit trails and human‑readable outputs, you’ll win over both engineers and compliance officers.\n\nSo yeah, the basics are covered by existing players. The differentiator is seamless integration, adaptive intelligence, and a clean user experience.",
          "score": 1,
          "created_utc": "2026-02-06 07:13:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qt4q9i",
      "title": "SOC 2 Compliance - when do you really need it?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qt4q9i/soc_2_compliance_when_do_you_really_need_it/",
      "author": "sgart25",
      "created_utc": "2026-02-01 17:31:04",
      "score": 5,
      "num_comments": 15,
      "upvote_ratio": 1.0,
      "text": "Hi folks - I'm building something to help FinTech CX teams reduce support spend and improve resolution times by referencing real-time account information as opposed to just generic FAQs/KBs. We're working with a few design partners and my question is, when is SOC 2 compliance really going to be needed? I know it's generally a must-have, but as I'm bootstrapping, trying to time this properly as it's also expensive. \n\nPart of me thinks I need it ASAP. Part of me thinks as long as you are demonstrating a path toward SOC 2 compliance and a timeline, companies will be ok with this who are committed to your vision. \n\nThoughts appreciated! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qt4q9i/soc_2_compliance_when_do_you_really_need_it/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o32c1gp",
          "author": "kubrador",
          "text": "you need it the moment your first customer asks for it, which will be immediately if you're touching fintech account data. you're not gonna bootstrap your way out of this one. banks have compliance teams whose entire job is saying no to startups without it.\n\n\n\nthe \"demonstrating a path\" thing only works if your customer is your buddy's side hustle, not an actual fintech company with audit requirements.",
          "score": 3,
          "created_utc": "2026-02-01 23:53:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o345vfx",
              "author": "kayandrae",
              "text": "In addition, ISO compliance is there and since you're a fintech, if you touch cards PCIDSS",
              "score": 1,
              "created_utc": "2026-02-02 06:48:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o30zlud",
          "author": "alicantetocomo",
          "text": "If you plan on selling to enterprises, then get it on your roadmap.",
          "score": 2,
          "created_utc": "2026-02-01 19:48:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38bzzj",
              "author": "Otherwise-Ear1256",
              "text": "To me, no road map speaks of no organization and that's usually the shortest path the failure.",
              "score": 1,
              "created_utc": "2026-02-02 21:41:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o38jfx4",
          "author": "Such-Buy-5749",
          "text": "It is a huge selling point and must-have if you are selling to large companies. The deal can often stop if you do not have it.\n\nI'd suggest to check out some of your would-be competitors and see whether they've got SOC 2. That'll be a good benchmark. \n\nIf you are yet to build a product and get early customers, I'd focus on validating your product and security/risk concerns, then invest in SOC 2 if it seems like a requirement ",
          "score": 2,
          "created_utc": "2026-02-02 22:17:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38tiys",
              "author": "sgart25",
              "text": "Good feedback thank you. We are not targeting large enterprises out of the gate.",
              "score": 1,
              "created_utc": "2026-02-02 23:08:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3944j6",
          "author": "whatwilly0ubuild",
          "text": "The \"path toward compliance\" story works until it doesn't, and in fintech it stops working earlier than most founders expect.\n\nSince you're handling real-time account information and customer PII, prospects will ask about SOC 2 almost immediately. Small design partners might accept a security questionnaire. The moment you're talking to any company with 50+ employees or a regulated entity, their infosec team needs something real.\n\nStart with SOC 2 Type I. It's a point-in-time assessment that's cheaper and faster than Type II. Most buyers will accept it while you work toward Type II which requires a 3-12 month monitoring period. Our clients in fintech have found that Type I is usually needed before closing your first paying customer outside design partners.\n\nCost optimization is using Vanta, Drata, or similar from day one. Few hundred bucks a month but they automate evidence collection so you're not scrambling when the auditor shows up. Starting early means building compliant habits into your infrastructure rather than retrofitting, which is always more expensive.\n\nBudget 2-3 months and $15-25k for the Type I audit itself if you've been using compliance automation.",
          "score": 2,
          "created_utc": "2026-02-03 00:06:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35w3z3",
          "author": "dolcevitahunter",
          "text": "For FinTech touching real-time account data? You need it yesterday!",
          "score": 1,
          "created_utc": "2026-02-02 14:51:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o360bdu",
              "author": "sgart25",
              "text": "Does it matter if aren’t touching the data directly or storing it? We’re merely leveraging APIs.",
              "score": 1,
              "created_utc": "2026-02-02 15:12:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o364m6t",
                  "author": "dennisthetennis404",
                  "text": "Yeah, unfortunately that distinction doesn't matter at all to auditors or your customers.",
                  "score": 1,
                  "created_utc": "2026-02-02 15:33:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o36va12",
          "author": "DeliciousSource5378",
          "text": "Let's level  set on what SOC 2 is. At its core it is a report in which a trusted third -party validates that the risk controls in your environment related to one or more trust criteria are what you say they are. \n\nNot a perfect comparison but think in terms of a home appraisal. That appraisal report is a trusted party reporting on the value of a property. Now can you and should you have the home relatively built before the appraiser comes out? Yes! This gives you the most cost effective experience. \n\nSimilarly if you begin checking off the controls before you engage a third-party auditor, compliance automation tool, consultant, you can have a better control on out of pocket costs. The implementation of many of the controls in your environment is definitely \"bootstrappable.\"  I recommended searching the web for SOC 2 control list just to make yourself familiar with the controls and determine what you can do on your own. \n\nI run TPRM for several companies including fintechs. SOC 2 isn't a silver bullet; although it does expedite the security portion of the due diligence review. If Ops really likes what you are offering, we will do a long form security review (we ask for a bunch of policies / procedures),screenshots of configurations, etc. + a commitment to complete SOC 2 usually within 6 months.\n\n  \nThe key takeaway is SOC 2 is a report that reflects what risk controls you have built into your environment. So the most important thing to do is build the controls.",
          "score": 1,
          "created_utc": "2026-02-02 17:37:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38u4rm",
              "author": "sgart25",
              "text": "Very helpful thank you. May like to pick your brain more if you’re open to chatting. Can I DM you?",
              "score": 1,
              "created_utc": "2026-02-02 23:11:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3940ip",
                  "author": "DeliciousSource5378",
                  "text": "For sure, feel free to DM me.",
                  "score": 2,
                  "created_utc": "2026-02-03 00:06:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o39ki2j",
          "author": "Additional_Aioli7826",
          "text": "For us SOC 2 became necessary once larger fintechs got involved. We used delve because it helped us get audit ready fast without a huge upfront burden while bootstrapping.",
          "score": 1,
          "created_utc": "2026-02-03 01:38:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrvujq",
      "title": "PCI DSS Evolution: How It’s Changed Over the Years",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qrvujq/pci_dss_evolution_how_its_changed_over_the_years/",
      "author": "Mother_Network9453",
      "created_utc": "2026-01-31 07:23:09",
      "score": 4,
      "num_comments": 7,
      "upvote_ratio": 0.75,
      "text": "**PCI DSS 1.0 (2004)**  \nThis was the starting point. The goal was simple: lock things down. Firewalls, encryption, access controls. Do the checklist, pass the audit, move on.\n\n**PCI DSS 2.0 (2010)**  \nPeople started asking real questions like “what’s actually in scope? and “who’s responsible for what?” This version tried to clear that up, especially with third parties. Still very audit centric though.\n\n**PCI DSS 3.0 / 3.2.1 (2013–2018)**  \nThis is where things got more serious. Security stopped being just a formality. Risk based thinking, penetration testing, secure development, stronger passwords. Less “just do it” and more “understand why you’re doing it.”\n\n**PCI DSS 4.0 (2022–Present)**  \nBig mindset shift. Instead of forcing everyone into the same box, it focuses on outcomes. You can choose how you meet the goal, as long as you can prove it works. Continuous monitoring, clear ownership, real accountability.\n\n**The real shift:**  \nFrom “pass the audit once a year”  \nto “stay secure every day”\n\nPCI DSS today feels less like compliance theater  \nand more like ongoing security responsibility.\n\nCurious which version gave you the most pain during audits ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qrvujq/pci_dss_evolution_how_its_changed_over_the_years/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o2rllng",
          "author": "Plus_Cat6736",
          "text": "It's interesting how PCI DSS evolved from just ticking boxes to focusing on real security, isn't it? I remember struggling with 3.0 because it forced us to really understand our systems and not just rely on compliance checklists. It was a wake-up call for many of us in the industry. \n\nI think the move toward continuous monitoring in 4.0 is a game-changer, but it can be tough to implement. It sounds easier than it is, lol.  \n\nWhat version has been the hardest on your team so far?",
          "score": 1,
          "created_utc": "2026-01-31 10:01:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t0dhf",
              "author": "Mother_Network9453",
              "text": "Absolutely. We see this a lot when working with founders on PCI DSS certification. The hardest part isn’t the controls, it’s helping teams really understand their systems, data flows, and shared responsibility.\n\n3.x was often the wake-up call. 4.0 raises the bar further by expecting that understanding to be continuous, not just audit-time. That shift is powerful, but definitely not easy to operationalize.",
              "score": 0,
              "created_utc": "2026-01-31 15:49:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2s2fsu",
          "author": "Plus_Cat6736",
          "text": "Totally agree on the shift from compliance to ongoing security! Honestly, PCI DSS 3.0 had us pulling our hair out at times, especially with the risk-based approach. But I feel like 4.0 is a step in the right direction. It’s more about adapting to how we operate rather than just ticking boxes. What challenges have you guys faced with the newer requirements?",
          "score": 1,
          "created_utc": "2026-01-31 12:30:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t0ldw",
              "author": "Mother_Network9453",
              "text": "Same here. With 4.0, the biggest challenge we see is turning flexibility into something auditors are actually comfortable with. Founders like the outcome-based approach, but it requires much stronger documentation, evidence, and internal ownership than earlier versions.\n\nContinuous monitoring is another tough one. It’s less about tools and more about process and discipline. If teams treat it like a once-a-year exercise, 4.0 becomes painful fast.\n\nIt’s a step forward for sure, but only if security maturity grows along with it.",
              "score": 1,
              "created_utc": "2026-01-31 15:50:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2vba59",
          "author": "PaymentFlo",
          "text": "The shift is from audit compliance to operational security.\nOlder versions let people pass by following rules; 4.0 asks you to prove the rules actually work. That’s why audits feel harder now,they’re testing behavior, not paperwork.",
          "score": 1,
          "created_utc": "2026-01-31 22:30:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34v1cy",
          "author": "RichSwim5209",
          "text": "Totally agree with this framing, especially the shift from annual audit optics to continuous security ownership.\n\nFrom what we see working with fintechs and payment platforms, the biggest pain point wasn’t a specific version of PCI DSS, but the moment teams realized that compliance ≠ security.\n\n3.2.1 hurt because it exposed weak SDLC, poor key management, and “checkbox” pentests\n\n4.0 hurts differently, it forces orgs to actually prove effectiveness, document intent, assign ownership, and keep evidence fresh\n\nThe customized approach in 4.0 is powerful, but only if teams have real security maturity. Otherwise, it’s overwhelming.\n\nBiggest challenge today isn’t passing the audit \n\nit’s operationalizing PCI so it doesn’t slow product, infra, or growth.\n\nCurious how others are handling continuous monitoring and evidence collection without drowning their teams.",
          "score": 1,
          "created_utc": "2026-02-02 10:45:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ktofd",
          "author": "pr0v4",
          "text": "It shifted focus to continuous compliance - that’s why I’ve built https://pcidss-dashboard.com \nIt helps a lot with staying organized and with continuous part, and you get access to ask questions regarding the PCI in general.",
          "score": 1,
          "created_utc": "2026-02-04 18:49:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrd2ta",
      "title": "Looking for early design partners: governing retrieval in RAG systems",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qrd2ta/looking_for_early_design_partners_governing/",
      "author": "vinothiniraju",
      "created_utc": "2026-01-30 18:08:30",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I am building a deterministic (no llm-as-judge) \"retrieval gateway\" or a governance layer for RAG systems. The problem I am trying to solve is not generation quality, but **retrieval safety and correctness** (wrong doc, wrong tenant, stale content, low-evidence chunks).\n\nI ran a small benchmark comparing baseline vector top-k retrieval vs a retrieval gateway that filters + reranks chunks based on policies and evidence thresholds before the LLM sees them\n\n**Quick benchmark (baseline vector top-k vs retrieval gate)**\n\n|**OpenAI (gpt-4o-mini)**|**Local (ollama llama3.2:3b)**|\n|:-|:-|\n|Hallucination score|0.231 → 0.000 (100% drop)|0.310 → 0.007 (\\~97.8% drop)|\n|Total tokens|77,730 → 10,085 (-87.0%)|77,570 → 9,720 (-87.5%)|\n|Policy violations in retrieved docs|97 → 0|64 → 0|\n|Unsafe retrieval threats prevented|39 (30 cross-tenant, 3 confidential, 6 sensitive)|39 (30 cross-tenant, 3 confidential, 6 sensitive)|\n\n>small eval set, so the numbers are best for comparing methods, not claiming a universal improvement. Multi-intent queries (eg. \"do X and Y\" or \"compare A vs B\") are still WIP.\n\nI am looking for **a few teams building RAG or agentic workflows** who want to:\n\n* sanity-check these metrics\n* pressure-test this approach\n* run it on non-sensitive / public data\n\nNot selling anything right now - mostly trying to learn where this breaks and where it is actually useful.\n\nWould love feedback or pointers. If this is relevant, DM me. I can share the benchmark template/results and run a small test on public or sanitized docs.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qrd2ta/looking_for_early_design_partners_governing/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o2p8od3",
          "author": "kubrador",
          "text": "this is actually solid work but you're gonna hate when you hit multi-document reasoning queries where your gateway becomes a bottleneck trying to predict what the llm actually needs. the 87% token reduction is impressive until someone asks \"compare our Q3 projections against competitor X's earnings\" and now you're playing 4d chess with chunk dependencies.",
          "score": 1,
          "created_utc": "2026-01-30 23:52:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32ydny",
              "author": "vinothiniraju",
              "text": "Yes, agreed. This is exactly where single-pass filtering starts to struggle.\n\nFor compare or multi-doc questions, guessing everything upfront is hard. I am looking at GraphRAG-style traversal so the system can pull related docs together instead of relying on top-k chunks.\n\nMy focus is making sure retrieval is still safe and explainable, regardless of whether it comes from vector search or graph traversal. Still early work.",
              "score": 1,
              "created_utc": "2026-02-02 01:58:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2vc41k",
          "author": "PaymentFlo",
          "text": "This is solving the part most RAG systems ignore: retrieval failures, not generation errors.\nIf the wrong docs get in, the model will confidently answer wrong no matter how good it is.\nThe real test will be multi-intent queries and edge cases where “relevance” isn’t obvious.",
          "score": 1,
          "created_utc": "2026-01-31 22:34:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32sui3",
              "author": "vinothiniraju",
              "text": "Thanks, exactly. Most of the issues I see are retrieval issues, not the model. If the wrong docs get into the context, the LLM will sound confident and still be wrong.\n\nThe real test is multi-intent and tricky edge cases, I agree. I am still working on that.\n\nAlso curious, in your experience what hurts more in production: tenant safety at retrieval time (RBAC, cross-tenant leakage) or plain retrieval correctness (wrong doc, stale content, multi-intent)? I am trying to prioritize what to harden first.",
              "score": 1,
              "created_utc": "2026-02-02 01:26:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qva3j0",
      "title": "Fintech Sales vs Wholesaling — Which Path Wins Long Term?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qva3j0/fintech_sales_vs_wholesaling_which_path_wins_long/",
      "author": "Spiritual-Level9909",
      "created_utc": "2026-02-04 00:57:37",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Deciding between staying in fintech sales or moving into a wholesale role selling model portfolios.\n\nFor those who’ve done either:\n\n\t•\tWhich path has better long-term upside?\n\n\t•\tIs wholesaling still worth it today?\n\n\t•\tAny regrets choosing one over the other?\n\nAlso concerns that AI meaningfully compress or replace advisor software over time?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qva3j0/fintech_sales_vs_wholesaling_which_path_wins_long/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o3g7rg2",
          "author": "itsdrmario515",
          "text": "What do sell now?",
          "score": 1,
          "created_utc": "2026-02-04 01:20:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3g9hv1",
              "author": "Spiritual-Level9909",
              "text": "Morningstar Advisor Software",
              "score": 2,
              "created_utc": "2026-02-04 01:30:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3gcca8",
                  "author": "itsdrmario515",
                  "text": "I spent years at Orion selling tech. Now I’m at a TAMP building AI tools that help advisors place clients into models faster and easier. Basically they don’t have to look at Fact Sheets or comb through dozens of models and strategies anymore; they just need to know their clients a little bit (5 questions lol). I’d stay in FinTech sales till you’re old. Keep learning what’s out there, hone in your investment knowledge on your own portfolios. You can wholesale or get into wholesaling later in life. Fintech you will eventually be phased out by younger, smarter, and cheaper. \n\nHere’s the truth: AI isn’t coming for relationships/fintech sales. It’s coming for busywork.\n\nIn moments of uncertainty around money or health, people don’t need more AI generated, fluffy data. They need steadiness, judgment, and real presence. That human core can’t be automated.\n\nAI will run the workflows. Advisors, doctors, and therapists will still own the meaning calming fear, building trust, and guiding better decisions when it counts.\n\nYour role doesn’t shrink in an AI world. It gets clearer, faster, and more valuable.",
                  "score": 1,
                  "created_utc": "2026-02-04 01:46:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3m923t",
          "author": "Broke___boii",
          "text": "Following",
          "score": 1,
          "created_utc": "2026-02-04 22:55:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ojp9i",
          "author": "TrioDeveloper",
          "text": "Both have their perks. Fintech sales are fast-paced and, for me, exciting, but deal flow can be hit-or-miss. Wholesaling model portfolios for me is steadier with recurring relationships, but slower. Agree, AI's creeping in, sure, but people want a human touch. Mix tech smarts with relationship skills, and you'll be solid long term.",
          "score": 1,
          "created_utc": "2026-02-05 07:48:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu75tv",
      "title": "How to Find Social Media Collaborators as a FinTech",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qu75tv/how_to_find_social_media_collaborators_as_a/",
      "author": "Lanzerillo",
      "created_utc": "2026-02-02 20:47:32",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "Hi - How could a FinTech business find other influencers here on Reddit to collaborate with? I've tried reaching out in various influencer type of Reddit groups but I keep getting my posts removed and marked as Spam. I must be doing something wrong because multiple have said I was Spam.. but I'm genuinely trying to not only learn but also collaborate in mutually beneficial ways with others. In fact, I suspect my following is far larger than those who I'd collaborate with. I just don't get it. Any advice would be appreciated.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qu75tv/how_to_find_social_media_collaborators_as_a/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qu58xh",
      "title": "how do you capture cross sell signals buried in routine service calls",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1qu58xh/how_do_you_capture_cross_sell_signals_buried_in/",
      "author": "Select-Print-9506",
      "created_utc": "2026-02-02 19:39:00",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "P&C agency here, we route routine intake through sonant so staff can focus on complex stuff, but here's what's bugging me… we pull reports showing clients with auto but no umbrella, or homeowners with outdated coverage limits, and the data is right there but actually turning that into a conversation is the hard part. CSRs are too busy with servicing to make outbound cross sell calls, and by the time a producer follows up the moment has passed.\n\nExperienced agents catch this stuff instinctively but they can't be on every call. Anyone figured out how to flag these moments systematically, or is this just one of those things where you accept some opportunities slip through?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1qu58xh/how_do_you_capture_cross_sell_signals_buried_in/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o39383k",
          "author": "whatwilly0ubuild",
          "text": "The \"data is right there but the moment passes\" problem is exactly right and it's fundamentally a workflow timing issue, not a data issue.\n\nThe experienced agents who catch it instinctively are doing real-time pattern matching during the conversation. They hear \"yeah we just bought a boat\" while processing a homeowners claim and their brain immediately flags the cross-sell. The gap is that this pattern matching lives in their heads and dies when the call ends.\n\nWhat actually works is injecting the signal at the point of interaction rather than trying to follow up later. If your intake system or CRM can surface a simple flag during the active call saying \"this client has auto but no umbrella, coverage gap of X,\" even a junior CSR can say \"by the way, I noticed you don't have umbrella coverage, want me to have someone reach out about that?\" That's a warm handoff while the client is already engaged and thinking about their insurance.\n\nThe outbound follow-up model fails for exactly the reason you described. The moment is gone, the client is busy, and a cold call about umbrella coverage two weeks after they called about a billing question feels disconnected and salesy.\n\nOur clients automating customer-facing workflows have found that the highest conversion signals come from life change indicators buried in routine interactions. Someone adding a vehicle, updating an address, adding a household member. These are moments where coverage gaps naturally become relevant and the client is already in \"insurance mode.\"\n\nThe systematic approach is tagging these trigger events in your system and generating the prompt for whoever is on the call right then, not queuing it for later. Even a simple rules engine that matches current coverage against standard recommendations based on the client profile and surfaces it as a one-liner during the interaction converts way better than any outbound campaign.\n\nThe CSRs being too busy concern is valid but the ask isn't \"sell them a policy,\" it's \"say one sentence and warm transfer if interested.\" That's 30 seconds, not a sales call.",
          "score": 1,
          "created_utc": "2026-02-03 00:01:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}