{
  "metadata": {
    "last_updated": "2026-02-20 03:06:13",
    "time_filter": "week",
    "subreddit": "fintech",
    "total_items": 20,
    "total_comments": 100,
    "file_size_bytes": 125342
  },
  "items": [
    {
      "id": "1r5c9ll",
      "title": "The high-risk merchant problem nobody in fintech wants to solve",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r5c9ll/the_highrisk_merchant_problem_nobody_in_fintech/",
      "author": "Much-Veterinarian399",
      "created_utc": "2026-02-15 11:21:47",
      "score": 23,
      "num_comments": 17,
      "upvote_ratio": 0.96,
      "text": "I work in payment processing for high-risk merchants - peptides, supplements, CBD, stuff that Stripe and PayPal ban on sight.\n\nNot the sexy side of fintech. No AI, no blockchain, no disruption narratives. Just businesses that cant accept payments normally and the mess that creates.\n\nWanted to share some perspective because this corner of fintech is basically invisible, but the money moving through it is not.\n\nThese are legitimate businesses selling legal products. But they cant get a normal merchant account. Stripe auto-rejects. PayPal bans them after a few weeks. The alternatives? Offshore processors with slow payouts, crypto-only checkouts that kill conversion, or sketchy setups that disappear overnight.\n\nMost merchants end up in a cycle: get approved somewhere, process for a few months, get shut down, lose $20-50k in held funds, start over with a new processor. Repeat until they give up or figure out how to make it work long term.\n\nThe gap is massive. Big processors dont want the compliance headache. Sketchy processors take advantage. Merchants are stuck with bad options.\n\nSome merchants figure out how to stay on mainstream rails long-term. Others cycle through processors forever. The difference usually isnt compliance - its infrastructure and how the accounts are structured.\n\nCurious if anyone else here works in or around this space. Theres almost no discussion about it despite the volume involved.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r5c9ll/the_highrisk_merchant_problem_nobody_in_fintech/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5i3ts1",
          "author": "madoff1503",
          "text": "I owned a peptide company and the amount of shady high risk merchant processing companies was insane. It's legitimate theft. They would charge $500-5000 for a \"set up\" fee and then would never deliver. \"That solution got shutdown but we have another one we're finalizing.\" One of them tried telling me they had a private solution yada yada thought it was weird they sent me credit card terminals and told me to do one transaction a month for compliance on it. Low and behold I got put on a matchlist as their underwriting team put me down as an online gardening tool ecom shop.",
          "score": 5,
          "created_utc": "2026-02-15 13:17:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5lhwpe",
              "author": "economickk",
              "text": "Yo that is actually insane. I imagine it’s because of the people who were actually doing shady shit. I wouldn’t call the cops and say “bro I tried importing steroids from China and this guy at moolahmovaz.com burned me $5k!”",
              "score": 1,
              "created_utc": "2026-02-15 23:54:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5louy5",
                  "author": "madoff1503",
                  "text": "Gray area quasi legal peptide sites last thing you want to do is bring any kind of legal attention to yourself. They know this and exploit it.",
                  "score": 1,
                  "created_utc": "2026-02-16 00:35:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5i05ss",
          "author": "Fibonatix",
          "text": "What you’re describing - repeated shutdowns, rolling reserves, held funds, and constant re-approval cycles - typically reflects a mismatch between business model structure and acquiring infrastructure.Risk is not only about compliance; it also includes transaction volume, subscription mechanics, geographic exposure, and how accounts are structured within the acquiring framework .\n\nHigh-risk payment processing requires:\n\n* Strong compliance alignment (PCI DSS, KYC, AML)\n* Advanced fraud prevention tools\n* Transparent customer communication to reduce disputes\n* Proper gateway integration and infrastructure planning\n\nWhen these elements are weak or misaligned, merchants can enter the cycle you described, approvals followed by shutdowns.\n\nManaging high-risk payment processing is not about eliminating risk, but structuring it correctly and working with experienced providers who understand the industry’s regulatory and operational nuances.",
          "score": 4,
          "created_utc": "2026-02-15 12:51:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5iv5t5",
          "author": "NPSALLEN",
          "text": "High risk is about compliance \nMost of merchants have no clue and just look for fast approvals\nAlso you have fda - Dea and ftc to deal with their rules \nWe have a compliance product that merchants can use - its helps them be compliant and stay that way",
          "score": 2,
          "created_utc": "2026-02-15 15:50:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5k15dp",
          "author": "quadrapay1",
          "text": "The core issue here is not that high-risk merchants are too risky. It's actually that most acquiring stacks were not architected for the volatility in dispute ratio, regulatory scrutiny, subscription continuity, or cross-border exposure. \n\nSo basically, they rely on blunt risk triggers instead of nuanced portfolio management. Sustainable setups in the space usually involve multi-mid redundancy, traffic segmentation by geographies and product line, controlled scaling of volume velocity, disciplined refund workflow to preempt chargeback, clean descriptor strategy, and underwriting alignment from day one, rather than post-approval patchwork.\n\nI would say that merchants who basically survive long term treat payments as an infrastructure engineering, not just a play and plug utility. And the gaps you are describing exist because very few providers are actually willing to invest in a level of structural risk design instead of just monetizing the churn cycle.\n\nThank you for highlighting this critical scenario here.",
          "score": 1,
          "created_utc": "2026-02-15 19:14:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s7xqw",
          "author": "No_Argument_1709",
          "text": "We provide our clients with multiple solutions for redundancy, both domestic and international, for debit and credit processing. Additionally, we offer them both an ACH solution and Google and Apple Pay, ensuring that if one system goes down, they can still process payments.",
          "score": 1,
          "created_utc": "2026-02-17 00:43:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63zwuk",
          "author": "Worth_Geologist4643",
          "text": "The high-risk problem isn't just about what is being sold, but how the traffic is filtered before it ever touches the payment gateway.",
          "score": 1,
          "created_utc": "2026-02-18 19:38:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67ugcb",
          "author": "Chaolik",
          "text": "Work in non-US FX/CFD for like \\~10 yrs, finding a proper PSP is not this big of a deal, most of them has like 6-10% MDR and 10% RR for 180 days (add 1-2% for settlements in USDT) - this is kind of an industry standard, so if you wish to deal with these rates it is always possible to find 3-4 decent CC/Googlepay/applepay PSPs and live long and prosper  ",
          "score": 1,
          "created_utc": "2026-02-19 10:06:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hutph",
          "author": "FarAwaySailor",
          "text": "I work in that field. I built a stablecoin checkout with chargeback protection. The major difference for high-risk merchants is that (EVM)Blockchain has smart contracts, which means all the processing can be done without the processor taking custody of the funds, or taking on the chargeback risk. This means that the risk profile of the merchant is completely irrelevant to the processor,.so I can take on any merchant regardless of their business",
          "score": 0,
          "created_utc": "2026-02-15 12:08:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hvi7v",
              "author": "Much-Veterinarian399",
              "text": "Interesting approach. How does the chargeback protection work on your end like is it escrow-based or something else?\n\nMy concern with crypto/stablecoin checkout is always conversion. Most merchants I work with see 30-40% drop when they remove PayPal/card options. Customers trust what they know.\n\nDo you have data on how your checkout converts compared to traditional rails? Curious if the gap is closing or if its still a hard sell for merchants who want mainstream customers.",
              "score": 1,
              "created_utc": "2026-02-15 12:14:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5hxujy",
                  "author": "FarAwaySailor",
                  "text": "The chargeback is handled through escrow smart-contracts on the chain. The tech is good and the fraud protection is an order of magnitude better than current solutions. The processing is cheaper. I reckon there's a lot of friction for users in having to hold different coins to pay 'gas' (transaction fees), and also choosing the right network and wallet, so my checkout pays the gas fees for you and automatically selects the right target wallet on the right chain. The conversion gap will close once people get used to it. There are many many advantages to paying (and receiving) this way. There was a time when people didn't want to use credit cards because they were happy with cash and cheques. There was a time when people didn't want phones because they were happy with letters and telegrams.\n\nI should also say: you don't have to remove other checkouts (eg PayPal) to install mine, so you don't have to risk an immediate drop in conversions!",
                  "score": -1,
                  "created_utc": "2026-02-15 12:33:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5hwk0q",
          "author": "kubrador",
          "text": "the fintech equivalent of being a talented plumber who specializes in unclogging toilets at 3am. nobody wants to admit they need you until they're desperately googling your number.",
          "score": 0,
          "created_utc": "2026-02-15 12:23:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hwqbh",
              "author": "Much-Veterinarian399",
              "text": "hahahahhaha, you could not describe it better.. ",
              "score": 1,
              "created_utc": "2026-02-15 12:24:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ibnoc",
          "author": "Any-Inevitable-2724",
          "text": "Ugh, I know exactly what you mean, there are nights I'm so brain-dead that just popping one of those frozen orange chicken meals from Trader Joe's into the oven is the absolute peak of my culinary ambition, lol.",
          "score": 0,
          "created_utc": "2026-02-15 14:06:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r62ubv",
      "title": "stablecoins vs. banks... who wins the 2026 settlement war?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r62ubv/stablecoins_vs_banks_who_wins_the_2026_settlement/",
      "author": "RecordDue9421",
      "created_utc": "2026-02-16 07:06:21",
      "score": 22,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "just saw a report that stablecoins are starting to rival the actual interbank settlement layer for cross-border payments. its not just for buying 'dog coins' anymore lol.\n\nim trying to track which specific protocols are getting the most 'wholesale' adoption from traditional banks. i feel like the alpha isnt in the coins themselves, but in the infrastructure that connects them to the old-school banking world.\n\nr u guys looking at the settlement plays or still chasing 100x moonshots??",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r62ubv/stablecoins_vs_banks_who_wins_the_2026_settlement/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5n9swk",
          "author": "TrioDeveloper",
          "text": "Totally, the real action isn't in the coins themselves, it's in the plumbing that connects them to traditional banks. A lot of stablecoin talk is hype, but the banks quietly adopting the infrastructure are where the alpha is. Personally, I'm watching settlement plays more than chasing 100x moonshots. That's where the long-term wins are. Curious to hear what others think.",
          "score": 5,
          "created_utc": "2026-02-16 07:23:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nxnp3",
          "author": "Visa5e",
          "text": "Banks.\n\nBecause stablecoins only solve a small part of the overall picture, so the benefit to moving to them for settlement is marginal, yet involves a lot of work.\n\nIf it aint broke, why fix it?",
          "score": 3,
          "created_utc": "2026-02-16 11:07:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zk4a5",
          "author": "Ocampo-Mark",
          "text": "this infrastructure play is way more sustainable than just chasing a moonshot since that is where the real value is hiding.  \n  \nto capitalize on this move, i suggest that you use gemini or trylattice to filter through the noise and track which protocols are actually landing institutional partnerships in real time. it will help you see the actual settlement volume and bank adoption data without having to dig through separate news cycles or sketchy reports. honestly it is a game changer for finding the bridge between old school finance and the crypto world.\n\nto",
          "score": 3,
          "created_utc": "2026-02-18 03:06:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nk2mn",
          "author": "kayandrae",
          "text": "EVM still dominates this settlement layer from what I can see, as for who wins, I believe banks will rely more and more on stablecoins. \n\nI've also been seeing a lot more companies prop up to offer stablecoins issuance so that finorgs can use an open market to transfer funds between each other.. think JPMusd to CHASEusd on a Dex.\n\nI don't see how efficient this is vs say USDC/USDT, but I do believe we are in the exploration phases of what stablecoins settlements will look like going forward.",
          "score": 1,
          "created_utc": "2026-02-16 09:00:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ogi34",
          "author": "Commercial-Track-854",
          "text": "Banks will rely more and more on stablecoins for settlement.  \nStablecoins have everything you'd want a money to be: instant settlement, on-chain transparency for real-time tracking, low fees, no need for correspondant banking, programmability (for future Agents/MCP interactions).  \nEverything is booming in the sector. Stripe acquired Bridge for 1Bn, everyone wants a stablecoin settlement layer.  \nAlso, the stablecoin payment solution market is consolidating around heavy compliance since US (Genius act)/EU (MiCA) are setting up. Only a handful of players will likely remain and develop their offer. In Europe the leader in stablecoin payment solution is called Fipto, they have all the licenses to operate.",
          "score": 1,
          "created_utc": "2026-02-16 13:26:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ohalm",
          "author": "PassionImpossible326",
          "text": "Well the real battle isn’t stablecoins vs banks. It’s who owns the settlement layer with trust baked in.Stablecoins can move value faster and cheaper, but wholesale adoption won’t happen without deterministic counterparty verification and pre-transaction risk controls. Banks care less about speed and more about certainty.The alpha might not be in the coin — it’s in the identity + safety infrastructure that makes institutions comfortable using them.\nWatching that layer closely:)",
          "score": 1,
          "created_utc": "2026-02-16 13:31:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o609exy",
              "author": "Open_Priority_7991",
              "text": "pro tip: next time you copy past from an LLM, ask it to remove the emdashes.",
              "score": 1,
              "created_utc": "2026-02-18 05:57:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ti4wl",
          "author": "hhannis",
          "text": "For USA: trump coins, and crypto will be the solution for everything. For the rest of the world and smart people: Banks.",
          "score": 1,
          "created_utc": "2026-02-17 05:41:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5oh8wy",
          "author": "Pwog2",
          "text": "There are a few stablecoin infrastructures that seem to win the market for stablecoin settlement. Traditional payment companies and banks are certainly going to have to adapt. I've seen a comment about Fipto, I've also heard about Fipto as being the best all-round stablecoin payment infrastructure, pretty cool business model.",
          "score": 1,
          "created_utc": "2026-02-16 13:31:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8kk8u",
      "title": "Quick DLP Software reality check, what’s working for SaaS/cloud and source code?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r8kk8u/quick_dlp_software_reality_check_whats_working/",
      "author": "herereallygone00",
      "created_utc": "2026-02-19 00:34:36",
      "score": 19,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Hey folks, I’m trying to get a reality check from practitioners who’ve evaluated or deployed DLP Software recently (endpoint, network, and especially cloud/SaaS).\n\nA few things I’m specifically curious about:\n\nSource code protection:\n\nWhich DLP Software approaches actually work for repos, CI/CD artifacts, and dev laptops?\n\nAre you relying more on classification + policies, or secrets scanning + repo controls, or both?\n\nCloud/SaaS coverage:\n\nFor Microsoft 365 / Google Workspace / Slack / Salesforce / Box, etc., what’s been the best path: CASB-style controls, native SaaS controls, API-based DLP, or endpoint-first?\n\nAny big gaps you didn’t expect until rollout?\n\nBypass reality (the stuff users do):\n\nHow do common bypasses shake out in practice: password-protected archives, client-side encryption, screenshots, copy/paste into personal accounts, “shadow” upload tools, etc.?\n\nDo you treat DLP as “detect + deter,” or do you successfully block a meaningful % without breaking workflows?\n\nOperational pain:\n\nWhere do you spend most of your time: tuning rules, classification, exceptions, false positives, policy drift, or incident triage?\n\nAny “must-have” features for reducing noise (workflows, incident enrichment, integrations)?\n\nAlso: in the broader cloud data security conversation, I keep seeing Cyera mentioned alongside DSPM / data discovery + classification. From what I’ve read, teams sometimes pair discovery/classification with DLP Software controls (since finding and labeling sensitive data is half the battle). If anyone’s evaluated that “DSPM + DLP” combo, I’d love to hear what the decision criteria looked like (even if you didn’t pick Cyera).\n\nWhat vendors or patterns have you worked with, and what are the honest tradeoffs?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r8kk8u/quick_dlp_software_reality_check_whats_working/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o683qc7",
          "author": "Iron-Horde",
          "text": "We use Cyberhaven. Covers source code tracking from repos to wherever devs paste it, catches AI tools, personal accounts, etc.\n\nEndpoint approach works better than trying to integrate with every SaaS tool separately. Gets screenshots and copy/paste too.\n\nTuning took time upfront but investigations are way faster now you see the full story instead of digging through logs.",
          "score": 1,
          "created_utc": "2026-02-19 11:29:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a97a6",
          "author": "whatwilly0ubuild",
          "text": "Source code protection is where traditional DLP falls apart fastest. The tools built for detecting credit card numbers in emails don't understand code context at all. A function named `get_secret_key()` isn't sensitive, but the actual AWS credentials hardcoded three lines below it are. Most teams end up splitting this into two separate problems. Secrets scanning with tools like GitLeaks, TruffleHog, or GitHub's native scanning handles the credentials and API keys. Repo access controls and audit logging handle the \"who can see what code\" problem. Trying to force endpoint DLP to understand source code sensitivity is painful and generates endless false positives.\n\nFor cloud and SaaS coverage the honest answer is that no single approach covers everything well. Native controls in M365 and Google Workspace work reasonably for their own ecosystems but the policies don't translate across platforms. CASB-style inline inspection catches uploads but struggles with API-based access and sanctioned app usage. API-based DLP can scan content at rest but can't block in real-time. Most production deployments end up layering multiple approaches and accepting gaps. The big surprise for teams at rollout is usually how much sensitive data already exists in places they didn't know about, so discovery has to happen before enforcement or you're flying blind.\n\nThe bypass reality is humbling. Password-protected archives defeat most inspection. Client-side encryption before upload works if users are motivated. Screenshots and photos of screens are basically undetectable. Copy-paste into personal browser sessions or webmail is hard to block without aggressive endpoint lockdown that kills productivity. Our clients running DLP programs have generally landed on \"detect and deter\" rather than \"block everything\" because the blocking approach creates so much friction that users find workarounds or productivity tanks. The deterrence value comes from users knowing their actions are logged even if not blocked.\n\nOperational time distribution in my experience is roughly 40% false positive tuning and exception handling, 30% policy drift as business processes change and new tools get adopted, 20% incident triage, 10% actual new policy development. The classification problem dominates everything because if you can't accurately identify what's sensitive, your policies are either too broad and noisy or too narrow and miss things.\n\nOn the DSPM plus DLP combination, the logic is sound. You can't protect data you don't know exists. Discovery and classification tools like Cyera, Varonis, or BigID find where sensitive data actually lives, then DLP policies enforce controls based on those classifications. The decision criteria usually come down to whether your primary gap is visibility or enforcement. If you don't know where your sensitive data is, DSPM first. If you know but can't control it, DLP first. Most teams that try to deploy DLP without good discovery end up drowning in false positives or missing their actual high-risk data.",
          "score": 1,
          "created_utc": "2026-02-19 18:31:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aaf8s",
          "author": "NewZealandTemp",
          "text": "One thing I keep seeing in comparisons is that “DLP Software” can mean totally different things depending on where enforcement happens:\n\nEndpoint DLP (agents controlling copy/paste, printing, uploads, removable media)\n\nNetwork DLP (egress inspection, proxies)\n\nSaaS/API DLP (scanning content inside apps like M365/Drive/Slack)\n\nCloud data security / DSPM (discovery/classification across cloud data stores)\n\nFrom what I’ve read in vendor bakeoffs and analyst-style writeups, a lot of misses come from assuming one category covers all. Curious how people here map “what we’re trying to stop” → “where we enforce,” especially for dev workflows and SaaS sprawl.",
          "score": 1,
          "created_utc": "2026-02-19 18:36:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ce0px",
          "author": "Ok_Interaction_7267",
          "text": "We went through this recently in a SaaS-heavy environment.\n\nBig takeaway: DLP without good data context is rough. On its own it turned into regex tuning + false positives. Once we had continuous data discovery/classification in place (we use Sentra for cloud/SaaS), DLP got more precise because policies were tied to actual sensitivity and exposure, not just content patterns.\n\nFor source code, traditional DLP wasn’t the main control. It’s mostly secrets scanning in repos/CI, tight repo permissions, and monitoring obvious exfil paths on endpoints.\n\nFor M365/Google Workspace, API-level visibility into the data was key. Endpoint-only didn’t cut it. AI assistants just amplify whatever permission mess already exists.\n\nYou’re never going to block every bypass without breaking workflows. We block clear high-risk cases, detect/escalate the gray area, and focus heavily on reducing overexposed sensitive data upstream.",
          "score": 1,
          "created_utc": "2026-02-20 01:10:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7mr46",
      "title": "The hidden problem with AI agents in finance: making them audit-ready",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r7mr46/the_hidden_problem_with_ai_agents_in_finance/",
      "author": "InspectionWrong4177",
      "created_utc": "2026-02-17 23:40:59",
      "score": 16,
      "num_comments": 17,
      "upvote_ratio": 0.88,
      "text": "The hidden problem with AI agents in finance: making them audit-ready...\n\n\n\nI've been knee-deep in AI agent deployments in fintech, and I've hit a wall that many others might be facing, too. Building the agents themselves? Challenging, but doable. The real headache, though, is making them audit-ready.\n\n\n\nThe core issue is that AI models are inherently probabilistic. They can spit out different answers for the same input based on a bunch of variables – model version, temperature, token limits, even API response times. But financial regulators demand determinism. They want to replay a transaction approval from months ago and get the exact same reasoning path every single time.\n\n\n\nThis creates a huge compliance gap. Simply logging AI outputs isn't enough. Auditors will inevitably ask, 'Why did your agent approve this loan?' and 'Can you prove it would make the same decision today?' If you can't answer with certainty and a clear, repeatable process, you're not going to pass muster.\n\n\n\nMy approach has been to build a validation layer that sits between the AI agent and the production environment. It's designed to capture the agent's reasoning chain, validate it against a set of deterministic rules, and then create an immutable audit trail. This way, the agent can still be probabilistic during development and exploration, but any decision pushed to production has a deterministic, auditable validation behind it.\n\n\n\nThis layer needs to ensure:\n\n\\- Reproducibility: The same input always yields the same validation outcome.\n\n\\- Explainability: A clear, step-by-step reasoning path for every decision.\n\n\\- Auditability: Immutable logs that regulators can easily review.\n\n\\- Version control: Tracking exactly which model version was involved in each decision.\n\n\n\nIs anyone else in r/fintech grappling with this challenge of making probabilistic AI compliant with deterministic financial regulations? How are you bridging this gap?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r7mr46/the_hidden_problem_with_ai_agents_in_finance/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5yybc3",
          "author": "KimchiCuresEbola",
          "text": "Why would you ever have a loan validation done by an LLM?!\n\n\\*If\\* you want to implement ML (which tbh I'm not sure most people should), you should be doing decision trees or at most some SVM model...\n\nLLM can perhaps do some automation, but it should have \\*absolutely\\* nothing to do with the actual approval model!",
          "score": 3,
          "created_utc": "2026-02-18 01:10:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zozm1",
              "author": "InspectionWrong4177",
              "text": "I completely agree with your skepticism about handing over loan approvals to LLMs. This caution is exactly why we've produced such a value-added service in finance! Machine Learning is a very specialized process that most likely could be applicable if training private-client frontier models. LLMs are inherently stochastic. Finance requires reproducible outcomes for audits, backtesting, and regulatory sign-off. Our emphasis on deterministic environments for the agent layer (i.e., exact replay, seeded randomness, fixed tool mocks) is key.",
              "score": 0,
              "created_utc": "2026-02-18 03:35:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5zt3tl",
          "author": "Plus_Cat6736",
          "text": "Honestly, this is a tough issue. We've been trying to tackle similar concerns with AI in our audits. The challenge of reproducibility and explainability is real. \n\nLast year, we faced some pushback on our automated processes because they weren't transparent enough for the auditors. We started logging decision-making processes more meticulously, and it helped a lot. Instead of just recording outputs, we captured the reasoning as well. It cut down on audit queries, probably by 30% since we could clearly show how decisions were made. \n\nThat said, it's still a work in progress. We're looking into more robust solutions for version control and immutable logging. Have you considered implementing any auditing frameworks or tools that help with this? It'd be great to hear what others are doing to bridge the gap between AI and compliance.",
          "score": 2,
          "created_utc": "2026-02-18 04:01:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5yk3hb",
          "author": "kubrador",
          "text": "the real problem is you've built a system that requires you to explain your black box to regulators who also don't understand black boxes, so you're essentially creating a fake deterministic layer that's just theater for compliance. might work until it doesn't.",
          "score": 1,
          "created_utc": "2026-02-17 23:52:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60gvph",
          "author": "Plus_Cat6736",
          "text": "This is such an interesting topic, and I can see how tricky it gets with AI being so probabilistic. Not sure how much I can help, but have you looked into some tools that help with audit trails in general? It sounds like you’re already on a solid path with that validation layer, but I wonder if there are industry standards or frameworks that can support your process. What kind of regulations are you primarily dealing with? It’d be cool to hear what others in the community are doing about this!",
          "score": 1,
          "created_utc": "2026-02-18 07:00:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o63zrub",
              "author": "InspectionWrong4177",
              "text": "There is so much competition! I could give you more info in a technical demo. For now, check out this research paper on a new Financial industry AI Agent benchmark: [https://arxiv.org/pdf/2507.17186](https://arxiv.org/pdf/2507.17186)\n\nOur strategy so far has been to codify various financial industry ontologies (like FinGAIA) into \"programmable logic gates\" executed during simulation and production runtimes, depending on business requirements.",
              "score": 1,
              "created_utc": "2026-02-18 19:38:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o60k6bv",
          "author": "KarinaOpelan",
          "text": "I think the key distinction is this: regulators don’t need the model to be deterministic, they need the decision process to be controlled and reviewable. The safer pattern in fintech is letting the LLM produce analysis, while a deterministic policy engine and/or human sign-off makes the binding decision. Then your audit surface becomes clear: immutable input snapshots, model/version pinning, fixed inference configs, full tool logs, and explicit rule triggers. Most failures happen when generative reasoning gets mixed directly with financial approvals without that structural separation.",
          "score": 1,
          "created_utc": "2026-02-18 07:30:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o613t30",
          "author": "xaic",
          "text": "In highly regulated financial environments, LLM agents should function as advisory systems within deterministic governance frameworks, not as autonomous decision makers. The compliance problem you’re describing may actually be a signal that we’re assigning the wrong role to the technology.",
          "score": 1,
          "created_utc": "2026-02-18 10:31:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o635vny",
          "author": "whatwilly0ubuild",
          "text": "The problem is real but I'd push back slightly on the framing. Regulators don't actually demand perfect reproducibility in most cases, they demand explainability and defensibility. Those are related but not identical.\n\nThe distinction matters because chasing perfect determinism from LLM-based systems is often the wrong goal. You can pin model versions, set temperature to zero, fix seeds where possible, and still get slight variations due to batching, hardware differences, or API provider changes. Building compliance architecture around the assumption of perfect reproducibility sets you up for failure when it inevitably drifts.\n\nWhat actually satisfies auditors in practice. Comprehensive input/output logging with timestamps and model version metadata. The reasoning chain captured at decision time, not reconstructed later. Clear documentation of what the AI recommended versus what was actually actioned, since many compliant systems have human approval gates that make the AI advisory rather than decisioning. Validation rules that are themselves versioned and logged so you can show what checks were applied.\n\nThe validation layer approach you're describing is solid but the framing should be \"we validated this decision against these deterministic rules at this time\" rather than \"the AI would make the same decision today.\" The first is provable and sufficient, the second is a promise you can't keep.\n\nOur clients deploying AI in regulated finance have found that the architectural pattern that works is treating AI outputs as proposals that pass through deterministic policy gates. The AI is explicitly non-deterministic and that's fine. The policy layer is deterministic and auditable. The decision record captures both.\n\nThe version control point is often underestimated. Model version, prompt version, validation rule version, and any retrieval corpus version if you're doing RAG, all need to be captured together.",
          "score": 1,
          "created_utc": "2026-02-18 17:24:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63o6du",
          "author": "GitPushGoogly",
          "text": "I’m aware that there are software platforms that help with this, such as:\n\n Arize AI – https://arize.com/llm-evaluation/\n\n Corridor Platforms (GenguardX) – https://ggx.corridorplatforms.com/",
          "score": 1,
          "created_utc": "2026-02-18 18:45:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64s4hx",
          "author": "dennisthetennis404",
          "text": "The AI can be unpredictable under the hood and that's fine. What matters is that every decision it makes in production has a clear, traceable explanation attached to it. That's what auditors actually need.",
          "score": 1,
          "created_utc": "2026-02-18 21:49:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o655p0e",
          "author": "into_fiction",
          "text": "If you're dealing with global tax compliance challenges, you might want to look into Getsphere. It automates a lot of the tedious parts of sales tax, VAT, and GST, integrating directly with your systems. It's been quite efficient for my team.",
          "score": 1,
          "created_utc": "2026-02-18 22:54:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65mgow",
          "author": "skinnydill",
          "text": "So a rules engine? Why use ai other than write the rules?",
          "score": 1,
          "created_utc": "2026-02-19 00:25:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o680u62",
          "author": "ItinerantFella",
          "text": "Give the same loan application to 1000 people and you wouldn't get 100% consistency. Why do regulators expect AI to be 100% consistent?\n\n\nObservable, explainable, trainable? Yes yes yes.",
          "score": 1,
          "created_utc": "2026-02-19 11:05:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ylshp",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 0,
          "created_utc": "2026-02-18 00:01:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ythzf",
              "author": "InspectionWrong4177",
              "text": "Small team here, thinking about going open source. I can say we've implemented a low-level execution tracing of Agent-related tasks in context, for later replay verification.   \n  \nWe've discovered that different agents produce different results even when using the same model! Thus, our platform is more agentic-focused to address this obvious trust gap in the market.  \n\n\nWhat tools or frameworks do you use?",
              "score": 0,
              "created_utc": "2026-02-18 00:44:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r7b6hv",
      "title": "Fintech security architectures: where they break and why",
      "subreddit": "fintech",
      "url": "https://www.cerbos.dev/blog/fintech-security-architectures-where-they-break-and-why",
      "author": "West-Chard-1474",
      "created_utc": "2026-02-17 16:41:38",
      "score": 12,
      "num_comments": 1,
      "upvote_ratio": 0.94,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r7b6hv/fintech_security_architectures_where_they_break/",
      "domain": "cerbos.dev",
      "is_self": false,
      "comments": [
        {
          "id": "o5xlxy5",
          "author": "quovest",
          "text": "Great breakdown. From building in the investment analytics space, the two biggest security gaps I've seen in early-stage fintech are:\n\n1. **Over-relying on API gateway auth without per-service authorization.** When you have a single gateway but multiple internal services, a compromised service can access other services' data. Zero-trust between services matters even at small scale.\n2. **Treating compliance as a post-hoc layer instead of a design constraint.** If you're operating under any regulatory framework (publisher's exclusion, RIA, etc.), your security architecture needs to enforce those constraints automatically. We built automated guardrails that prevent our AI from crossing from \"general research\" into \"personalized advice\" territory but this should be in the architecture, not in a manual review process.\n\nAlso: secrets management. The number of fintech startups I've seen with API keys hardcoded or in .env files that get committed to git is terrifying.",
          "score": 1,
          "created_utc": "2026-02-17 21:00:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8bof7",
      "title": "Fintech history timeline",
      "subreddit": "fintech",
      "url": "https://i.imgur.com/1aEdLPp.jpeg",
      "author": "boppyblice25",
      "created_utc": "2026-02-18 18:51:23",
      "score": 12,
      "num_comments": 4,
      "upvote_ratio": 0.94,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r8bof7/fintech_history_timeline/",
      "domain": "i.imgur.com",
      "is_self": false,
      "comments": [
        {
          "id": "o65ed06",
          "author": "Nanine18",
          "text": "I wish to be a fintech founder in 1866. Powdered wigs and VC lunches.",
          "score": 1,
          "created_utc": "2026-02-18 23:40:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67ag1y",
          "author": "PassionImpossible326",
          "text": "This is very much detail graph. And I dint know world's first ATM was launched by Barclys bank",
          "score": 1,
          "created_utc": "2026-02-19 06:56:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69lcj8",
          "author": "rain_malanix",
          "text": "Neat, but I feel like Ethereum is notable and relevant enough to make the timeline too",
          "score": 1,
          "created_utc": "2026-02-19 16:37:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o658kgu",
          "author": "ploesdrupl",
          "text": "I dont think Google Wallet is significant enough to be on that timeline",
          "score": 0,
          "created_utc": "2026-02-18 23:09:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r50w2u",
      "title": "KYC integration is taking 3 months and our mobile app gained 40MB. Is this normal?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r50w2u/kyc_integration_is_taking_3_months_and_our_mobile/",
      "author": "Only_Helicopter_8127",
      "created_utc": "2026-02-15 00:43:50",
      "score": 11,
      "num_comments": 15,
      "upvote_ratio": 0.93,
      "text": "We're a Series A fintech adding identity verification and it's been a nightmare. Three months in, still not live. The SDK added massive bloat to our mobile app, documentation is impossible to follow without enterprise dev experience, and every customization needs a support ticket.\n\nOur app load time tanked and we're seeing 18% user drop off during the verification flow. The verification itself works when people finish it, but getting there is brutal.\n\nIs this just how KYC works or did we mess up our vendor selection? Need something that's developer friendly without destroying our app performance.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r50w2u/kyc_integration_is_taking_3_months_and_our_mobile/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5fks5z",
          "author": "Logical-Professor35",
          "text": "40MB SDK and 3 month integration timeline? vendor selection was definitely the problem here not KYC in general.",
          "score": 9,
          "created_utc": "2026-02-15 00:49:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5fm846",
          "author": "Unique_Buy_3905",
          "text": "KYC integration shouldn't take three months or add 40MB unless something went sideways. \n\nTypical timeline is 2-4 weeks for mobile SDK with decent documentation. \n\nSounds like vendor either has bloated SDK or implementation hit complications neither side anticipated upfront.",
          "score": 5,
          "created_utc": "2026-02-15 00:58:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5fvwsj",
          "author": "JaseDoom",
          "text": "Definitely should not work like that. I am genuinely curious who your vendor is and what specifically you integrated and if it includes any step-up auth flows.",
          "score": 2,
          "created_utc": "2026-02-15 02:03:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5fokm4",
          "author": "ImpressiveProduce977",
          "text": "The combination of massive SDK, unclear docs, and long timeline points to vendor mismatch for startup environment. Enterprise-focused providers optimize for feature breadth over developer experience because their buyers are banks with large engineering teams. \n\nFintech startups need different tradeoffs lighter SDKs, clear documentation, responsive support, fast integration. 18% drop off during verification is recoverable but requires both technical optimization and UX improvements. \n\nBefore investing more time optimizing current vendor might be worth quick evaluation of alternatives to understand if switching saves time versus continuing to fight current implementation.",
          "score": 1,
          "created_utc": "2026-02-15 01:14:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5g8sbo",
          "author": "kubrador",
          "text": "you picked the wrong vendor. 40mb for identity verification is genuinely embarrassing and 3 months for integration should have triggered a pivot at month 1.\n\n\n\ngood news is most decent kyc providers (jumio, onfido, etc) integrate in 2-3 weeks and add maybe 5-10mb. your 18% dropoff is probably half bloat, half friction from wrestling their docs. look at anyone using web-based verification instead of an sdk monster and you'll see the difference immediately.",
          "score": 1,
          "created_utc": "2026-02-15 03:32:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5h1vek",
          "author": "Delicious-Letter-318",
          "text": "I helped a company at similar point as you guys, fintech, series B had to completely redo and improve identity verification as similar users tanking when it came to KYC and their experience sucked on mobile. After I finish with them they went on to exit at £41m.\n\nIt’s basically just forms on the experience so really shouldn’t be adding so much to the build, does your team have a design system in place.\n\nI think your 18% drop-off highlights it’s an experience problem. Forms sound easy but they can be easily over complicated and with KYC people need to know where they are, what they require before heading into the process, how far through they are and if they can return one entered.\n\nI also supported a major high street retail bank in the UK with this exact same process and once they shipped, we increased the mobile conversion for their onboarding by 156% in the first week.\n\nHappy to take a look and confirm if it’s an experience issue over the loading speed, just DM me and we can setup a call.",
          "score": 1,
          "created_utc": "2026-02-15 07:34:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5i5158",
          "author": "Cryptolooser777",
          "text": "\nDefinitely not normal. 3 months and 40MB for a KYC SDK is a red flag — sounds like one of the legacy enterprise vendors that bolt on features without caring about bundle size.\n\nFor consumer identity verification, a modern integration should take 2-4 weeks max. Look for vendors that offer a web-based flow you can embed via iframe or redirect link rather than a native SDK — eliminates the app bloat entirely and your mobile performance stays intact.\n\nA few things to evaluate when switching:\n\n• SDK size (should be <5MB or ideally zero with a web redirect approach)\n\n• Documentation quality — if you need a support ticket for basic customization, run\n\n• Drop-off analytics built into their dashboard\n\n• Sandbox environment that actually mirrors production\nI run a compliance tech company (Recomply.ai) and we deliberately went web-first for our B2B onboarding forms for exactly this reason — forcing a heavy SDK on clients is a non-starter. Different use case than yours but the principle is the same: the verification UX shouldn't be the bottleneck.",
          "score": 1,
          "created_utc": "2026-02-15 13:25:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5inzx6",
          "author": "DizzyGold6618",
          "text": "40MB SDK bloat and 3 months integration is not “normal” anymore. That is legacy compliance architecture leaking into product experience.\nMost KYC vendors optimize for regulatory completeness, not app performance or developer ergonomics.\nA few questions worth examining:\nIs the SDK fully embedded, or can parts be modular / server-side?\nAre you coupling identity verification too tightly with your core app bundle?\nIs the drop-off happening due to load time or verification friction?\nAre you measuring time-to-verification or just completion rate?\n18% drop-off in verification is not a small UX issue. That is revenue leakage.\nThe bigger structural issue is this:\nMost compliance layers are designed as external add-ons.\nThey are not designed to feel native inside the product journey.\nCurious, are you evaluating alternatives or trying to optimize within the current vendor stack?\nWould love to understand how others are handling KYC without destroying performance.",
          "score": 1,
          "created_utc": "2026-02-15 15:14:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mi4ev",
          "author": "arpand",
          "text": "You have not shared enough context. \n\n* If you are building a short-term loan application, the SDK is utilised. \n* Depending on the KYC type, different APIs & SDKs to be considered. \n* On average, KYC take less than a week. \n* Someone I knew used Prove SDK and spent more than 2 months. This was a different sort of use case.\n* On average, using OnFido, Persona, and SumSub has been much faster. \n\nThanks\n\n",
          "score": 1,
          "created_utc": "2026-02-16 03:44:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rzp52",
          "author": "Ok-Office-6564",
          "text": "3 months is not acceptable. You should use orchestrations workflow's solutions",
          "score": 1,
          "created_utc": "2026-02-16 23:55:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u14zs",
          "author": "ETP_Queen",
          "text": "Yeah this reads like an enterprise-first vendor shoved into a startup UX.\n\n40MB on mobile + 3 months usually means the SDK is doing way too much on-device (and the docs/support model assumes a bank-sized eng team). KYC is hard, but it shouldn’t feel like you’re shipping a second app.\n\nIf I were you I’d do two things in parallel: instrument the flow end-to-end to see exactly where the 18% drop happens, and run a quick “switch vs fix” comparison with a lighter hosted/webview or more modular provider. If the vendor can’t meet you halfway on footprint + DX, you’re basically paying in churn.",
          "score": 1,
          "created_utc": "2026-02-17 08:29:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gafwf",
          "author": "bamboofighter",
          "text": "Yeah your vendor is not doing you justice. Hire my team & we’ll get you done ✅ PM for details",
          "score": 0,
          "created_utc": "2026-02-15 03:44:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5scv1",
      "title": "Innovation",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r5scv1/innovation/",
      "author": "ResponseCheap2755",
      "created_utc": "2026-02-15 22:39:04",
      "score": 6,
      "num_comments": 20,
      "upvote_ratio": 0.88,
      "text": "Finance being the most boring area. \n\nSeems like all major players build on integrations only. Until established innovation seems impossible, take stripe for example.\n\nOther than blockchain, is there something that fintechs are looking at for innovation? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r5scv1/innovation/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5ldk3l",
          "author": "Nowhere-Man-Nc",
          "text": "There are still plenty of opportunities for innovation in fintech: from KYC and compliance automation to shifting from old-school technical trading toward more social and experience-driven models. But in practice, most visible experimentation today seems concentrated in crypto. The rest of fintech often behaves as if it is “good enough,” leaning toward conservative optimization rather than real innovation.\n\nMaybe that’s the result of increasing compliance pressure. Maybe it reflects broader uncertainty in the market. But after a few decades in this industry, my impression is that the drive for innovation is much lower than it was during the golden fintech decade of the early 2000s. That period felt like expansion. Today feels more like preservation.",
          "score": 3,
          "created_utc": "2026-02-15 23:28:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5na117",
              "author": "ResponseCheap2755",
              "text": "Agree !!\nAt least at surface level innovation seems to very slow. \n\nMaybe there is nothing for startups to enter but I wanted to understand from people who are at big companies. \n\nAre they looking at some innovation to solve problems in finance area as you said Risk and KYC/KYB with advent of AI and LLMs?",
              "score": 1,
              "created_utc": "2026-02-16 07:25:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5lr4hb",
          "author": "KimchiCuresEbola",
          "text": "Guess it depends on what your definititon of \"fintech \"is.\n\nWhat VCs call FinTech is limited in scope: payment processing, blockchain, etc.\n\nIf you're talking about tech in finance, some of the most cutting edge tech comes from finance.\n\nRentech started using AI in the 1990's, Pandas was created at AQR, XTX has more GPUs than most tech companies, Citadel has an army of FPGA engineers, prop desks/hedge funds work with petabytes worth of data, etc.",
          "score": 3,
          "created_utc": "2026-02-16 00:49:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5q9unk",
              "author": "ResponseCheap2755",
              "text": "Completely agree, the definition matters a lot, when i was writing the post i was focused on payments industry primarily but fintech is definitely much wider.\n\nAnd as I understand finance in general used to look for optimisation and heavy processing but do we still see any outrageous or disruptive outcomes from the same companies or institutions?",
              "score": 1,
              "created_utc": "2026-02-16 18:45:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5rbjxq",
                  "author": "KimchiCuresEbola",
                  "text": "I mean Alex Gerko at XTX has literally been UK's largest tax payer for several consecutive years from earnings.\n\nDepends on what you consider to be \"outrageous or disruptive outcomes\"?",
                  "score": 2,
                  "created_utc": "2026-02-16 21:47:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ly34f",
          "author": "JimmieLenz",
          "text": "You need to start investigating more, there is no area of innovation that even approaches finance. Time value of money, fractional banking, credit derivative swaps, other areas are constrained by physical properties (think Moore's Law) Finance is only constrained by what we can imagine. \n\nThere is no end to the innovation here, and don't be fooled by the technology aspect, this is only the means by which we implement ideas.",
          "score": 3,
          "created_utc": "2026-02-16 01:33:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qbvi4",
              "author": "ResponseCheap2755",
              "text": "This seems a bit abstract for simpletons like me, professor, but I definitely understand what you are pointing towards.\n\nDo you have any white papers to recommend to learn a bit more about the possibilities?\nNot just the mathematics but other aspects too, let’s say sociological. Until the financial solution works well with society the math alone won’t work.",
              "score": 1,
              "created_utc": "2026-02-16 18:54:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5mqdph",
          "author": "0xSmartMoney",
          "text": "you simply don’t need anything more… with the rise of Agents and smartcontracts the whole embedded finance stack can be streamlined now. Furthermore the assets can manage their own life cycles themselves = programmable embedded finance\n\nin simple terms embedded finance’s SHOPIFY moment is fast approaching. companies will tailor and offer financial services themselves…",
          "score": 2,
          "created_utc": "2026-02-16 04:42:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qcgit",
              "author": "ResponseCheap2755",
              "text": "Sounds fascinating!!\n\nCan you explain a bit more on this and explain the implications of this?\n\nWhere do you see this happening ?",
              "score": 2,
              "created_utc": "2026-02-16 18:57:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5tkqr3",
                  "author": "0xSmartMoney",
                  "text": "It is fascinating…\n\nImagine it’s 1994 and some random guy tells you that merchants will turn into global commerce companies, managing everything from listing products and setting prices dynamically to running sales campaigns, handling export/import logistics, warehousing, last-mile delivery, and returns, all orchestrated by software. It would have sounded fascinating, yet not very convincing, right? 🙂\n\nBut e-commerce is reality today. Merchants became digital brands with exclusive user networks, selling directly to those users. They operate with one ultimate North Star: maximize revenue per user.\n\nI’m telling you the same transformation is inevitable in finance. Merchants will take control of the remaining piece, financial services. Their North Star won’t change, and they won’t stop looking for ways to increase revenue per user. That’s why they’ve been embedding financial services into their stack, embedded finance (EF). Over the last decade, EF has increased revenues, but much of that upside has been captured by third parties. And merchants will always look for ways to remove those extra hands from the cookie jar.\n\nWith the rise of AI agents, this becomes far more doable. Our embedded BNPL stack is built AI-native. Very soon, we’ll be able to run Klarna’s playbook with 20 key employees and agents, not an army of 4,000. Our knowledge base is unified, not siloed like Revolut’s. We’ve streamlined the entire flow from origination to recovery. Our asset securitization infrastructure is digitally native, compliant smart contracts originating assets that are matched with instant on-chain liquidity, delivery vs. payment.\n\nAll that’s left is packaging this into SaaS: enabling merchants to list BNPL offers, set pricing, run campaigns, originate and securitize loans instantly; essentially tailor and offer BNPL directly to users.\n\nThat’s the Shopify moment for embedded finance <-fireworks emoji>\n\nThe implications mirror those of e-commerce. We’ll see massive consolidation in traditional finance; most banks won’t catch up. Many will become forward-flow providers underwriting merchant-originated loans. Trillion-dollar on-chain marketplaces will emerge around this activity. Smart merchants will obtain banking licenses to further maximize revenue per user. We may even see Amazon competing with JPMorgan Chase over auctioned receivables.\n\nEven smarter merchants will turn their exclusive user networks into closed-loop financial ecosystems, where users invest in the brands they love via tokenized bonds financing inventory and growth. Savings accounts become brand-native, “save $50 with Cleveland Clinic and get your teeth fixed anytime.” A new layer of utility apps will emerge, robo-advisors bidding at receivable auctions, leverage looping apps, and more.\n\nAt the bottom line, trillions in capital will shift from bank balance sheets to merchant balance sheets. The startups leading this shift will become the new Amazons, the new Shopifys.\n\nI’m proud that we’re not just following this path with the right recipe; we’re bold enough to choose the vertical with the strongest PMF and carve out a niche to make it ours. Just like Amazon started with books, transforming an ancient trillion-dollar model requires finding the path of least resistance 😉",
                  "score": 1,
                  "created_utc": "2026-02-17 06:02:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5nj7ck",
          "author": "xaic",
          "text": "Asking if there’s innovation in fintech is like asking if there’s innovation in plumbing because the pipes are already installed.\n\nFintech *is* continuous innovation. Blockchain is just one loud corner of it.\n\nEverything from embedded finance, real time payments, AI driven fraud detection, smarter KYC, alternative underwriting, open banking, programmable money, better onboarding UX, retention mechanics, vertical SaaS + payments stacks… that is all innovation.\n\nStripe building on integrations is not a lack of innovation. It is platform strategy. The boring part is the rails. The value is what you build on top.\n\nIf anything, fintech is one of the few industries where shaving 20 seconds off onboarding can be worth millions. If that is boring, then so is oxygen.",
          "score": 2,
          "created_utc": "2026-02-16 08:52:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qd984",
              "author": "ResponseCheap2755",
              "text": "Yes, oxygen is boring despite being a necessity, I understand components are improving but that can be considered incremental not disruptive.\n\nFinance had many such disruptive moments historically, last one close to this was the blockchain idea which was a paradigm shift.\n\nI don’t read about anything which has similar impact. \nEven if we consider adoption of blockchains a failure or slower than expected",
              "score": 1,
              "created_utc": "2026-02-16 19:00:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5rgpxm",
                  "author": "xaic",
                  "text": "You don’t need headlines for something to be transformative. \n\nA lot of fintech evolution happens in 5–20 second improvements in onboarding, better ML driven KYC, lower fraud false positives, smarter underwriting, smoother end to end flows. At scale, those “boring” gains are huge.\n\nYes, there are paradigm shifts. Card networks were one. Blockchain was one. Crypto is just one application built on top of that architectural shift.\n\nBut most real impact comes from infrastructure quietly getting better. Disruption is not only new rails. It is also making existing rails radically more efficient.",
                  "score": 2,
                  "created_utc": "2026-02-16 22:13:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5uban1",
          "author": "PassionImpossible326",
          "text": "Tons of innovation is happening in fintech space. Fintech is not just Rails , payment,access etc , it is a ecosystem,  a vastly segregated ecosystem. \nThere are lot of things which needs improvement in Identity and safety paradigm in fintech space.",
          "score": 2,
          "created_utc": "2026-02-17 10:06:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o648w0w",
              "author": "ResponseCheap2755",
              "text": "Interesting, what do you identify as innovation in Identity and Risk management space ?",
              "score": 1,
              "created_utc": "2026-02-18 20:20:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5mm6mo",
          "author": "tornavec",
          "text": "AI-agents",
          "score": 1,
          "created_utc": "2026-02-16 04:12:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qc657",
              "author": "ResponseCheap2755",
              "text": "I hear a lot about agentic commerce but that is a level up of APIs with LLMs, that can be considered orchestration at best not innovation.\nThe innovation happened in the LLM level agents are just users of that.",
              "score": 2,
              "created_utc": "2026-02-16 18:55:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r6y0g3",
      "title": "Wise blocked both of personal account and business account without a prior notice. Don't trust them.",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r6y0g3/wise_blocked_both_of_personal_account_and/",
      "author": "pooquipu",
      "created_utc": "2026-02-17 05:55:08",
      "score": 6,
      "num_comments": 11,
      "upvote_ratio": 0.8,
      "text": "Today wise blocked both of my personal and business accounts. The business account was unused for several years, because my business is closed, but the wise business account was never closed.\n\nThey blocked the business account for this reason. This is fair and expected.\n\nWhat I didn't see coming, however, is a few days later they've blocked my regular account where l store a lot of money. Reason: they had to close all accounts associated with the business account.\n\nI'm abroad and wise is my main payment method, I have only a small backup but won't last for more than a few days. I'll get around it and get my money refunded, but they basically screwed me without a notice, despite I have been using their services for nearly a decade now and was trusting them.\n\nI think lately wise customer service has greatly degraded, and this is the ultimate proof that something is wrong with their services.\n\nIt's time to move away to a better alternative.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r6y0g3/wise_blocked_both_of_personal_account_and/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5u5leu",
          "author": "TrioDeveloper",
          "text": "Thanks for sharing this really helpful heads-up. I've been using Wise too, so it's good to know about situations like this before it becomes a problem.",
          "score": 2,
          "created_utc": "2026-02-17 09:12:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5udl07",
              "author": "pooquipu",
              "text": "yes, I eventually got my personal account unlocked after providing various documents. Going forward I'll use wise only as a transfer pipe and only keep small amount of money in it, and always have a reliable backup payment method with me.",
              "score": 2,
              "created_utc": "2026-02-17 10:27:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5u7xyk",
          "author": "ItinerantFella",
          "text": "I've heard similar stories about customers of major banks, PayPal, Stripe, Wise, Revolut, Airwallex, etc. \n\n\nWhich bank/transfer service guarantees they won't do it?",
          "score": 2,
          "created_utc": "2026-02-17 09:35:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5udy0b",
              "author": "pooquipu",
              "text": "None, other than the good old national banks that come with national guarantees and a banker who make sure you feel loved as a customer. Main reason I use wise is because the national banks are not good for international transfers, but after this experience I started to value even more my reliable banker.",
              "score": 2,
              "created_utc": "2026-02-17 10:30:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5w15cz",
          "author": "0rbus",
          "text": "Wise banned me completely from using their platform as they tried holding onto 5 figures in my business account and only let it go when I threatened legal action against them. I can't even send a personal transaction as they've completely banned me from their systems. Seriously shady company they are.",
          "score": 2,
          "created_utc": "2026-02-17 16:30:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ygf11",
              "author": "RocheleAveruiz",
              "text": "This is actually the first time I've heard anything bad about Wise, not that I can't believe it. They just keep such a squeaky clean reputation that you wouldn't imagine it. ",
              "score": 1,
              "created_utc": "2026-02-17 23:31:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5yiog7",
                  "author": "0rbus",
                  "text": "There's much worse out there, PayPal for example, but wise seem to think they can hold tens of thousands of your funds for no genuine reason at all.",
                  "score": 2,
                  "created_utc": "2026-02-17 23:44:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5zagfa",
                  "author": "pooquipu",
                  "text": "yeah I thought the same until they blocked my account and searched online about it. Many testimonials online indicate that the quality of wise regarding their clients has degraded in recent years.",
                  "score": 2,
                  "created_utc": "2026-02-18 02:12:47",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5to46a",
          "author": "FieldNoticing",
          "text": "So I’m understanding you properly, Wise found out your business was closed on their own, so they closed all your accounts? How long was your business closed for? And was your business account opened before the personal account? I have both as well and I’m wondering if this is something I need to be proactive about now.",
          "score": 1,
          "created_utc": "2026-02-17 06:30:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tpvfc",
              "author": "pooquipu",
              "text": "My business was closed for 2\\~3 years. They closed the wise business account first and a few days later the personal wise account living on the same global account, that was effectively my daily account, I use with the wise card everyday.\n\nThe personal account existed for much longer than that business account.\n\nI recommend using wise only for transfers and moving the money immediately to a safe account. If you need to use your card, just transfer the money from your safe account as you need it. They proved to be unreliable.",
              "score": 2,
              "created_utc": "2026-02-17 06:45:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r5g8ja",
      "title": "Wise permanently offboarded me after phone theft and unauthorized transactions – is this proportionate under EU risk policy?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r5g8ja/wise_permanently_offboarded_me_after_phone_theft/",
      "author": "Icy_Smile6481",
      "created_utc": "2026-02-15 14:40:31",
      "score": 5,
      "num_comments": 16,
      "upvote_ratio": 0.86,
      "text": "In October 2025, I was assaulted while travelling and my phone was stolen. Shortly after, unauthorized transactions occurred on my EU-based Wise business account (approximately €1,400).\n\nI reported the incident immediately and filed a police report. Wise investigated and declined reimbursement, stating that the transactions were properly authenticated under strong customer authentication (SCA).\n\nFollowing this, Wise permanently closed all my accounts (both personal and business). I went through their internal complaints process and submitted an appeal, which was rejected.\n\nFrom a fintech risk and compliance perspective, I’m trying to better understand:\n\n• In cases where a customer is a documented fraud victim of a single theft incident, is permanent offboarding considered proportionate?\n\n• How do EU fintech institutions balance PSD2 protection principles with risk-based account termination?\n\n• Is this becoming a standard risk management approach across EU-regulated institutions?\n\nI’m genuinely interested in how this is viewed from an industry and regulatory standpoint.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r5g8ja/wise_permanently_offboarded_me_after_phone_theft/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5kk6sg",
          "author": "monkey6",
          "text": "How’d they get into your phone?",
          "score": 1,
          "created_utc": "2026-02-15 20:52:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n4njx",
              "author": "Icy_Smile6481",
              "text": "The phone was stolen while unlocked during the assault.\n\nShortly after, unauthorized access occurred. I immediately reported it and filed a police report.",
              "score": 1,
              "created_utc": "2026-02-16 06:37:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ovxur",
                  "author": "monkey6",
                  "text": "Sorry to hear that. Does the Wise app need to look at your face or have a password entered to open it/sign in?",
                  "score": 1,
                  "created_utc": "2026-02-16 14:50:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5kypis",
          "author": "rubenknol",
          "text": "It doesn’t matter if it’s proportionate or not - they can choose freely who they do business with",
          "score": 1,
          "created_utc": "2026-02-15 22:06:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n5539",
              "author": "Icy_Smile6481",
              "text": "Sure, they can choose their clients.\n\nBut when someone is the victim of a documented theft, loses funds, and reports it immediately, permanently terminating all accounts raises a legitimate question about proportionality for a regulated EU institution.\n\nEspecially when alternative risk measures — such as temporary restrictions or enhanced monitoring — could also have been considered.",
              "score": 1,
              "created_utc": "2026-02-16 06:41:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5njyxo",
                  "author": "rubenknol",
                  "text": "can you recite me the exact part of the regulation under the belgian (where wise has their EU banking license) banking laws where you think this is in breach of? ",
                  "score": 1,
                  "created_utc": "2026-02-16 08:59:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5pzil3",
          "author": "RevolutionaryRush717",
          "text": "Tell you what. By installing the app of your phone, you accepted the risk of not being able to protect your account and your phone sufficiently.\n\nAnyway, that's the pitch Wise will make: *you* bore the risk, not them.\n\nYou disagreeing is enough for them to terminate your contract.\n\nPeople, let this be a reminder of the downsides of banking apps and 2FA on the same device.\n\nIt's like the thieves taking cash from your wallet.\n\nCash is gone, and so is the transaction.",
          "score": 1,
          "created_utc": "2026-02-16 17:57:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tvpmm",
              "author": "Icy_Smile6481",
              "text": "I understand the point about user responsibility.\n\nBut this isn’t comparable to physical cash. Wise operates under EU financial regulation and supervision. Electronic payment institutions are subject to specific consumer protection and risk-management standards.\n\nIn this situation, the customer is already the victim of a documented assault and financial loss. When reimbursement is refused and all accounts are permanently terminated, it effectively compounds the impact of the fraud.\n\nThe question is whether that combined outcome aligns with the spirit of EU consumer protection and proportionality principles.",
              "score": 1,
              "created_utc": "2026-02-17 07:38:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5tkx0a",
          "author": "pooquipu",
          "text": "I experience a slightly different problem with similar outcome, they closed my account without delay. I used it as my main and business account so there is quite a bit of money on it. I had to ask relatives to send money to my revolut account.\n\nI think it's time to move away from them.\n\nTheir customer services became terrible lately. Few times I had to deal with them in the last two years, they were totally garbage.\n\n  \nFact is now my money is fully blocked, and they can do that without a notice, in under a second. That's sketchy, isn't it?",
          "score": 1,
          "created_utc": "2026-02-17 06:03:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tw5ea",
              "author": "Icy_Smile6481",
              "text": "It’s concerning to see similar experiences. When sudden account closures or fund restrictions affect customers who rely on these accounts for personal and professional use, the impact can be severe.\n\nWhen a company like Wise operates under EU financial supervision, customers reasonably expect more predictability and safeguards than what feels like an instant shutdown.",
              "score": 2,
              "created_utc": "2026-02-17 07:42:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5txs16",
                  "author": "pooquipu",
                  "text": "Right. This experience takes me back to reality.\n\nI’ve started looking for alternatives and I’m currently comparing them. I’ll continue using these neobank services, but only with a small buffer of money. I’m shifting my trust back to long-established traditional banks.\n\nOn a personal note, I really enjoyed these fully online, lower-cost companies. But now, I realize how much of a game changer it is to have a real human who genuinely cares about you as a customer, even if you have to pay a more. I'll never underestimate this again.",
                  "score": 1,
                  "created_utc": "2026-02-17 07:57:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5iouu0",
          "author": "Individual-Artist223",
          "text": "Wise don't care about their customers!\n\nReading Reddit, lots of customers are being kicked off.\n\nI'm wondering whether the company is now on a death spiral.\n\nThey IPO, people made money and left, Wise broke.\n\nThoughts?",
          "score": 0,
          "created_utc": "2026-02-15 15:19:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ivmae",
              "author": "Icy_Smile6481",
              "text": "I’ve seen similar reports too.\n\nIn my case, it was a documented theft, police report filed, one fraud event — then permanent closure of all accounts.\n\nI’m trying to understand whether that kind of response is considered proportionate under EU risk management and PSD2 principles, especially when the customer is the victim of a single incident.\n\nI’d genuinely appreciate input from people familiar with fintech risk or EU regulatory practice.",
              "score": 0,
              "created_utc": "2026-02-15 15:53:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r8j1q8",
      "title": "Saw these guys promising to replace compliance teams. How many times are we going to fall for this?",
      "subreddit": "fintech",
      "url": "https://www.linkedin.com/posts/alexandreberkovic_yesterday-we-announced-our-71m-seed-round-activity-7430027952643432449-2nU4?utm_source=share&utm_medium=member_desktop&rcm=ACoAACc5Fz0BOlOIh6vul9nrOfEyyFXnpwIoNjs",
      "author": "AinaPapaya",
      "created_utc": "2026-02-18 23:30:00",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r8j1q8/saw_these_guys_promising_to_replace_compliance/",
      "domain": "linkedin.com",
      "is_self": false,
      "comments": [
        {
          "id": "o65u7nc",
          "author": "meninblck9",
          "text": "This all breaks down when you have complicated names. NICE has been around forever and not cracked the code. Uipath just acquired Workfusion who uses AI agents for AML / KYC sanction screening. The space is a mess still.",
          "score": 2,
          "created_utc": "2026-02-19 01:08:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65z92z",
          "author": "13Morton",
          "text": "I’ve been in identity / AML long enough to have seen a few “this replaces compliance” waves come and go.\n\nThe pattern is usually the same: we treat AML like a detection or pattern-matching problem when in reality it’s a judgment, defensibility, and governance problem.\n\nTransaction monitoring? Sure; models can (and should) improve signal quality. Screening? Automate it. Triage? Optimize it.\n\nBut a SAR narrative isn’t just an output. It’s a position. It’s something you may have to defend to regulators months later with documented rationale, policy alignment, and an audit trail that holds up under scrutiny.\n\nRegulators don’t examine “model confidence scores.” They examine controls, governance, explainability, escalation paths, and documented human accountability.\n\nAI can absolutely make compliance teams more effective.\n“Your last compliance hire” is a very different claim.\n\nIf anything, the vendors who win long-term are the ones who understand they’re augmenting risk judgment, not replacing it.",
          "score": 2,
          "created_utc": "2026-02-19 01:38:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65yug1",
          "author": "lodavo",
          "text": "There are some things that humans should be behind. Security is one of them. Either the AI is too stupid to do it properly or you have a super intellectual black box whose reasoning/intention isn't fully understood controlling your security system.",
          "score": 1,
          "created_utc": "2026-02-19 01:36:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66pvbb",
          "author": "PassionImpossible326",
          "text": "Those all are flashy demos created by Cloude , kids of age 16-17 trying to take on messy fintech problems , c'mon NICE,ACTIMIZE and player like them been here more than your age and still not able to Crack that.\nSuch demos kicked out of the room when compliance team start reviewing them.",
          "score": 1,
          "created_utc": "2026-02-19 04:18:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r626r3",
      "title": "Card as a Service and BIN Sponsorship Are Quietly Taking Over Fintech",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r626r3/card_as_a_service_and_bin_sponsorship_are_quietly/",
      "author": "Mother_Network9453",
      "created_utc": "2026-02-16 06:29:30",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "\n\nMost people still associate fintech with consumer apps and flashy wallets. But behind the scenes, the real momentum is shifting toward infrastructure, especially Card as a Service and BIN sponsorship.\n\nInstead of building a bank from scratch or waiting years for licenses, startups and enterprises are launching card programs through CaaS platforms. These providers handle issuing, processing, compliance, and network connectivity, while the business focuses on distribution and use cases.\n\nWhat’s driving the trend is scale and speed.\n\nCaaS platforms now support  \n• Startup and enterprise grade card issuing  \n• Multi region BIN sponsorship for cross border programs  \n• Built in KYC AML and transaction monitoring\n\nThis means companies can launch prepaid, debit, or virtual cards across multiple geographies without becoming a regulated bank.\n\nWhy this matters is simple. Time to market used to be measured in years. Now it’s months or even weeks. Compliance is embedded into the infrastructure instead of being an afterthought. And fintech teams can iterate on products without constantly renegotiating with banks.\n\nConsumer fintech might get the headlines, but infrastructure is where the long term value is being built.\n\nCurious to hear thoughts from people working on issuing, payments, or embedded finance.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r626r3/card_as_a_service_and_bin_sponsorship_are_quietly/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5n7k49",
          "author": "TrioDeveloper",
          "text": "Really interesting breakdown, totally agree the real value shift is happening behind the scenes. CaaS and BIN sponsorship let companies scale fast without banking headaches. Consumer apps get the headlines, but the real advantage is in the infrastructure.",
          "score": 1,
          "created_utc": "2026-02-16 07:03:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nhugb",
              "author": "Mother_Network9453",
              "text": "Appreciate that. The “without banking headaches” part is exactly it, though I think it also creates a new set of challenges. Teams move faster, but now they’re dependent on issuer banks, processors, and scheme rules they don’t fully control. The winners long term will be the ones who treat CaaS as leverage, not a black box.",
              "score": 1,
              "created_utc": "2026-02-16 08:39:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r675ow",
      "title": "Large funds stuck on Payeer – 14 business days deadline almost over. Anyone else? Possible collective action?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r675ow/large_funds_stuck_on_payeer_14_business_days/",
      "author": "RichRemarkable138",
      "created_utc": "2026-02-16 11:26:58",
      "score": 5,
      "num_comments": 11,
      "upvote_ratio": 0.86,
      "text": "Hi everyone,\n\nI’m posting here because I honestly don’t know what else to do.\n\nI have a large amount of money currently frozen on Payeer. I was officially told to wait 14 business days. I submitted my request on February 1st (which was a weekend), and now it’s been 11 business days already. My deadline expires in 3 days, but nothing is happening so far.\n\nThey are not responding to the financial support email at all. Zero communication.\n\nWhen I checked Trustpilot and other reviews, I saw a lot of similar complaints. The whole situation looks extremely confusing, especially with mentions of Paraguay and unclear regulation.\n\nSo I want to ask:\n\n* Did anyone actually receive their funds back after the 14 business days?\n* Is anyone else currently waiting?\n* Has anyone contacted a regulator or taken legal steps?\n* Would it make sense to organize some kind of collective legal action if this continues?\n\nIf there are multiple people in the same situation, maybe we should coordinate and escalate this properly.\n\nPlease share your experience.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r675ow/large_funds_stuck_on_payeer_14_business_days/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5ojgrh",
          "author": "PassionImpossible326",
          "text": "Freezing funds is one thing. Silence is another. Clear timelines and communication should be standard in financial services. Hope you get clarity soon — transparency matters.",
          "score": 1,
          "created_utc": "2026-02-16 13:43:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5onki0",
              "author": "RichRemarkable138",
              "text": "thanks brother, im too hope because ask documents, adress , give me 14 work day and hope its not all lie ",
              "score": 1,
              "created_utc": "2026-02-16 14:06:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5t5ui0",
          "author": "False_Help5603",
          "text": "I'm in the same situation as you.  \n",
          "score": 1,
          "created_utc": "2026-02-17 04:11:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5t65dy",
          "author": "False_Help5603",
          "text": " I think it's a good idea to make collective legal action.  \nIt is unfair, i'm waiting to finance payeer mail last week but still no response\n\n",
          "score": 1,
          "created_utc": "2026-02-17 04:13:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6xurl",
      "title": "What are the biggest technology trends in financial services today?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r6xurl/what_are_the_biggest_technology_trends_in/",
      "author": "Specialist-Pie1714",
      "created_utc": "2026-02-17 05:46:27",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 0.83,
      "text": "The biggest technology trends in **financial services** today are **cloud computing**, artificial intelligence (AI)/machine learning, automation/robotic process automation (RPA), and open banking/API ecosystem. These technologies enable financial institutions to increase efficiency, reduce operational costs, and provide more personalization in their offerings.\n\nAnother significant technology trend in **financial services** today is advanced data analytics, which allows for better risk management and customer understanding. Another significant technology trend in the **financial services** industry today is the adoption of robust cybersecurity and compliance technology. Financial institutions today are collaborating with technology companies that offer integrated solutions, bringing together various technology trends in a single offering. For example, **Arcus Partners** provides cloud computing and AI/ML solutions.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r6xurl/what_are_the_biggest_technology_trends_in/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5y81oa",
          "author": "layolandat",
          "text": "Is this an seo play from arcus partners? Whats with the bolding? Screams ai output",
          "score": 2,
          "created_utc": "2026-02-17 22:46:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uen9y",
          "author": "goodkarma789",
          "text": "Agreed. Still waiting for a trend of traditional finance mechanisms upgrading their systems to be more up to date with today's market needs though. Like Letters of Credit going onchain, or prepayment/BNPL leveraging digital assets as collateral instead. Just some ideas",
          "score": 1,
          "created_utc": "2026-02-17 10:37:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5yqecw",
          "author": "kubrador",
          "text": "lmao \"another significant technology trend\" appears twice in your own response, which is peak irony for an article about efficiency",
          "score": 1,
          "created_utc": "2026-02-18 00:27:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3int2",
      "title": "Whats the best payment processor for high risk merchants",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r3int2/whats_the_best_payment_processor_for_high_risk/",
      "author": "InternationalSun4095",
      "created_utc": "2026-02-13 07:14:39",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 0.83,
      "text": "Im in a high risk insdustry (peptides) and have just been banned from stripe. What high risk payment processor can i use in Australia? Looking for options ASAP",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r3int2/whats_the_best_payment_processor_for_high_risk/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o55rjiq",
          "author": "dangercoder",
          "text": "Hey, maybe [https://paymentproviders.io/](https://paymentproviders.io/) could be useful - you can filter on: Browse all providers - high risk. The website currently covers 1k+ provides. \n\nI'd recommend a provider such as https://paymentproviders.io/providers/coinremitter if you just want to accept crypto (fast path).\n\nGetting accepted by a provider that accepts high risk merchants requires legal work and can take time and a bunch of back and forth with their compliance department.",
          "score": 1,
          "created_utc": "2026-02-13 13:23:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5kthx9",
          "author": "quadrapay1",
          "text": "Peptide is a problem. In Australia its a bigger problem. I suggest you explore alternative options.",
          "score": 1,
          "created_utc": "2026-02-15 21:39:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o559nc3",
          "author": "crystalblogger",
          "text": "I would recommend Ivno.io as it supports your geo and works with multiple high risk businesses without issues. The approval and onboarding is also instant. You may want to have a look at https://ivno.io",
          "score": 0,
          "created_utc": "2026-02-13 11:19:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6untg",
      "title": "I’m a Fund Accounting professional working on a way to open up Hedge Fund investing to the average investor. Am I crazy?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r6untg/im_a_fund_accounting_professional_working_on_a/",
      "author": "Low_Lunch_172",
      "created_utc": "2026-02-17 03:07:28",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 0.72,
      "text": "Hey everyone,\n\nI’ve spent my career in the \"guts\" of the hedge fund world as a fund accountant. One thing has always bothered me: Tier-1 managers (think Citadel, Millennium, etc.) are essentially locked away from anyone who isn't an ultra-high-net-worth \"Accredited Investor.\"\n\nI’m working on a platform to \"wrap\" these funds and offer daily liquidity to the average investor. I have already worked out the setup of this and know it's possible, while also giving retail investors similar returns (if not better) than the HF investors being able to utilize preferrential fee classes. From a tax perspective, I've also worked out a way to get this launched without having to issue K-1s and issue plain old 1099s.\n\nThere's a lot of gnitty gritty that would go into launching something like this, but my general question is would you actually move a portion of your portfolio into this? If you could invest in Tier 1 HFs would you?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r6untg/im_a_fund_accounting_professional_working_on_a/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5t6gh7",
          "author": "cxavierc21",
          "text": "You sound naive to the regulatory hurdles of your plan. You can’t possibly think you’re the first to have this idea, right?",
          "score": 5,
          "created_utc": "2026-02-17 04:15:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5swzv2",
          "author": "alicantetocomo",
          "text": "Figure out if you can get licensed before going down the technology path.",
          "score": 3,
          "created_utc": "2026-02-17 03:13:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tevra",
          "author": "RealDapper",
          "text": "I’m very curious about how you intend to sell these “wrapped” funds to retail investors. Is the company owning your platform regulated under ICA issuing ETFs to track these funds? Unsure how else you’d do it, so you’re looking at some heavy compliance and licensure.\n\nRegulation aside, your question is: “would retail investors purchase your securities” (correct me if I’m wrong in my reading of your post). I can’t speak for every retail investor out there, but my understanding is that many don’t know about alternative investment options (which are already limited because it’s a regulatory challenge to sell to the public) because it’s complex to advertise for and many people are risk averse.\n\nI think you’d have a market for your platform but seek counsel.",
          "score": 2,
          "created_utc": "2026-02-17 05:15:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tkuj0",
          "author": "Why_StrangeNames",
          "text": "Interesting that you chose this problem. Could you explain your journey that led you to this?\n\nReason being if I was in FA for many years I would go down the path of providing something to funds. Selling hedge funds to retail wouldn’t be something I’d be interested in because there’s a reason hedge funds only serves the AI - they can afford the risk. I wouldn’t invest in a HF myself because the amount of capital I’m offering wouldn’t move a needle for the HF, and the risk they take is way more than I can accept when I put money in someone else’s hands. It generally doesn’t make sense for retail to go into these alternative funds because the best we can do is either buy the market or just invest ourselves.",
          "score": 2,
          "created_utc": "2026-02-17 06:02:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ug2w6",
          "author": "KimchiCuresEbola",
          "text": "The top pod-shops are so capacity constrained that they're returning capital to clients and regularly turning away sovereign wealth funds.\n\nWhy would they give allocation to retail and ruin their brand?\n\nAlso skeptical about your background as there are a ton of issues with your setup that someone with even a few years of experience in the space would immediately spot.",
          "score": 2,
          "created_utc": "2026-02-17 10:50:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tzf6c",
          "author": "ETP_Queen",
          "text": "You’re not crazy, but the hard part isn’t the tech, it’s the structure regulatory perimeter.If the underlying isn’t daily liquid, “daily liquidity” has to be engineered and that’s where most models break.The key question isn’t *can you wrap it?*  it’s *who holds the assets, who’s liable, and how do you keep it nonmisleading for retail?*",
          "score": 1,
          "created_utc": "2026-02-17 08:13:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vyx8s",
          "author": "fuggleruxpin",
          "text": "Master feeder is the norm here.  Maybe some way to marry that to what the likes of forge etc are doing?  If you can get it to market my company's tech stack could be very helpful to scale marketing.... Good luck.  Tough space. Many bodies on the highway.  But no one's really cracked it .",
          "score": 1,
          "created_utc": "2026-02-17 16:18:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3xxkf",
      "title": "PhD in finance+senior consultant in fintech, applied for 100+ jobs but haven't landed any second interview so far",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r3xxkf/phd_in_financesenior_consultant_in_fintech/",
      "author": "Independent_One9236",
      "created_utc": "2026-02-13 19:03:10",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "I applied for over 100 jobs but haven't landed any second interview so far. Would appreciate any advice on possible directions, salary expectations, etc.!\nBackground: PhD in finance, 7 years of research + 2 years of industry experience as a senior consultant in a Chinese fintech company. I'm familiar with fintech, data analytics and digital transformation. I also worked in projects valued at 2M+. I'm really confused about what's happening",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r3xxkf/phd_in_financesenior_consultant_in_fintech/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o57xpgu",
          "author": "meninblck9",
          "text": "It’s a bad job market. Keep at it. Write a blog. Make some interesting posts on LinkedIn. Network. Network.",
          "score": 3,
          "created_utc": "2026-02-13 19:49:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ayvrb",
              "author": "RocheleAveruiz",
              "text": "Communities is where it's at! ",
              "score": 1,
              "created_utc": "2026-02-19 20:34:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5bipg3",
          "author": "KimchiCuresEbola",
          "text": "Fintech is very broad as is the roles within specific niches. What specifically did you do?",
          "score": 1,
          "created_utc": "2026-02-14 10:28:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r73xkh",
      "title": "Most BFSI apps don’t need more features. They need orchestration.",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r73xkh/most_bfsi_apps_dont_need_more_features_they_need/",
      "author": "DizzyGold6618",
      "created_utc": "2026-02-17 11:50:38",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "Hot take.\n\nBFSI does not have a feature problem.\n\nIt has an orchestration problem.\n\nEvery modern banking app today has:\n\n* Chatbots\n* Help centers\n* KYC providers\n* Fraud engines\n* CRM systems\n* Notification layers\n* Call centers\n\nOn paper, it looks advanced.\n\nIn reality, none of these systems truly talk to each other in a way that resolves intent inside the app.\n\nThey coexist.  \nThey don’t coordinate.\n\nSo what happens?\n\nUser tries to resolve a failed transaction.\n\nThe app shows the transaction.  \nThe chatbot gives generic guidance.  \nThe FAQ explains policy.  \nSupport asks for the same details again.  \nCompliance reviews manually.\n\nEverything exists. Nothing orchestrates.\n\nWe keep adding automation layers, but no intelligence layer.\n\nIf an authenticated user is inside the app and the system can already see:\n\n* Account history\n* Transaction state\n* KYC status\n* Risk flags\n\nWhy is resolution still external?\n\nWhy is escalation the default design pattern?\n\nIn 2026, is it acceptable that most “AI” in BFSI cannot:\n\n* Retain context\n* Coordinate backend actions\n* Trigger safe multi-system workflows\n* Resolve without human relay\n\nOrchestration is not a buzzword.\n\nIt simply means:\n\nThe system understands intent and coordinates the right systems in the right order without pushing the user out.\n\nYet most apps still operate like layered silos glued together.\n\nSerious question to people building in BFSI:\n\nAre we building digital banks  \nor just digital wrappers around legacy processes?\n\nIs the industry actually moving toward in-app intelligence  \nor are we still optimizing for ticket deflection?\n\nCurious to hear from product and engineering leaders.\n\nAre orchestration layers becoming real,  \nor is this still slideware?\n\nLet’s debate.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r73xkh/most_bfsi_apps_dont_need_more_features_they_need/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o5x9zvj",
          "author": "whatwilly0ubuild",
          "text": "The diagnosis is correct but the implied solution is harder than the post suggests.\n\nThe reason these systems don't orchestrate isn't technical ignorance. It's that each system was bought, built, or integrated at different times with different owners who had different incentives. The chatbot vendor optimized for deflection metrics. The fraud engine optimized for false positive rates. The KYC provider optimized for verification throughput. None of them were architected to participate in a coordinated resolution workflow because that wasn't what they were purchased to do.\n\nThe \"just add an orchestration layer\" framing underestimates the organizational problem. To orchestrate across systems you need write access and action authority across all of them. The teams that own those systems don't want to cede control to a new coordination layer they don't understand. Every integration becomes a negotiation. Our clients attempting this kind of unified orchestration have found that the political work exceeds the technical work by a significant margin.\n\nWhere orchestration is actually happening is in narrow, high-value workflows rather than general-purpose intelligence layers. Dispute resolution for specific transaction types. Fraud alert handling with pre-authorized remediation actions. Account recovery flows. These work because scope is limited enough that you can get all stakeholders aligned and the ROI is clear.\n\nThe \"digital wrapper around legacy processes\" observation is accurate for most institutions but it's not necessarily wrong. Replacing core systems is expensive and risky. Wrapping them and gradually building coordination capabilities on top is often the rational path even if it's slower and uglier.\n\nThe real question is whether the orchestration layer gets built internally or whether a vendor eventually cracks it. Right now most vendor attempts are slideware, but that doesn't mean the problem isn't real.",
          "score": 1,
          "created_utc": "2026-02-17 20:03:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r844re",
      "title": "Vibe-coded tools in financial advisor ops: what guardrails are non-negotiable?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r844re/vibecoded_tools_in_financial_advisor_ops_what/",
      "author": "obchillkenobi",
      "created_utc": "2026-02-18 14:16:00",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I’m seeing more teams vibe code  internal tools with AI (Replit/Cursor/ChatGPT-style), the kind that usually work well in a demo.   \n  \nFrom conversations with a few advisor-ops teams, a pattern I see is  that drafts + pre-flight checks are fine, but anything that starts behaving like a system of record (or complex workflows) is where things get messy.\n\nExamples  (from advisor/RIA ops POV):  \n\\- billing/fee checks (“does billed rate match the signed schedule/discounts?”)  \n\\- marketing/comms pre-checks (flag promissory language / missing disclosures  \n\\- onboarding/paperwork preflight \n\nFor anyone who has shipped similar tools in production:  \n\\- what’s safe to build this way vs a hard no?  \n\\- what guardrails actually mattered (approvals, evidence/logging, tests/goldens, access control, monitoring/rollback)?  \n  \nLooking for real patterns and any lessons you can share.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r844re/vibecoded_tools_in_financial_advisor_ops_what/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o62dimm",
          "author": "kubrador",
          "text": "the honest answer is \"all of it breaks the second a client calls their lawyer.\" you're basically asking which parts of compliance can be handled by vibes and the answer is none of them.\n\nthat said, the actual pattern i've seen work: treat ai-assisted tools like a really good intern who needs to get everything initialed. drafts and flags are fine because humans still decide. the moment it starts \\*deciding\\* (auto-billing adjustments, regulatory sign-offs, document finalization) you've moved from \"helpful\" to \"liability with a gpu.\"\n\nthe guardrails that mattered in practice were dumber than they sound. audit trails matter way more than you think because regulators don't care if your claude instance was right 99% of the time, they care that you can prove what happened. version control for prompts. separate staging/prod entirely. and honestly, the access control piece is underrated; not letting the tool touch prod databases",
          "score": 3,
          "created_utc": "2026-02-18 15:15:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6314g0",
              "author": "KimchiCuresEbola",
              "text": "Using AI to build proper system much more quickly with good engineers and domain experts = OK\n\nThrowing everything into AI and having it be \"the system\" != OK",
              "score": 1,
              "created_utc": "2026-02-18 17:03:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o62bgqz",
          "author": "oedividoe",
          "text": "Partner with teams/startups who are willing to co-build and co-evolve in AI ",
          "score": 2,
          "created_utc": "2026-02-18 15:06:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a9hh1",
          "author": "whatwilly0ubuild",
          "text": "The \"works in demo\" to \"works in production\" gap is exactly where vibe-coded tools fall apart in regulated contexts. The pattern you're seeing is correct, and the line you drew around system of record behavior is roughly the right place.\n\nWhat's generally safe to build this way. Read-only checks and flagging are the sweet spot. Fee schedule validation that surfaces discrepancies for human review, marketing copy scanners that flag potential compliance issues, document completeness checklists before submission. These tools can be wrong without catastrophic consequences because a human makes the final call. The AI is doing triage, not decisions.\n\nWhat's a hard no. Anything that writes to a system of record without human approval. Anything that generates client-facing content that goes out without review. Anything that calculates fees or billing amounts that flow directly into invoices. The moment the tool's output becomes the source of truth rather than an input to human judgment, you've crossed into territory where vibe-coded quality isn't acceptable.\n\nThe guardrails that actually mattered for our clients shipping similar tools. Logging everything with immutable audit trail was non-negotiable. Not just what the tool output, but what inputs it received, which version of the logic ran, and what the human did with the recommendation. When a regulator asks why a disclosure was missing, \"the AI said it was fine\" isn't an answer. Evidence that a human reviewed and approved is what matters.\n\nApproval gates with explicit sign-off are essential for anything beyond pure advisory output. The tool flags, a human reviews, the human clicks approve, that approval is logged. This sounds obvious but teams skip it because it adds friction, then regret it when something goes wrong.\n\nGolden test suites covering known edge cases saved teams from embarrassing failures. Vibe-coded tools break in weird ways when inputs drift from what the developer tested against. A set of regression cases that must pass before any deployment catches the obvious stuff.\n\nAccess control scoped tightly from day one. Internal tools tend to accumulate permissions over time. Start restrictive.\n\nRollback capability that's actually tested. When the tool starts producing garbage, can you revert in minutes or does it require an engineer to debug and redeploy?\n\nThe monitoring question is underrated. Most teams don't instrument internal tools well, so they don't notice degradation until someone complains. Even basic metrics like \"flagging rate over time\" catch model drift or logic bugs before they become incidents.\n\nThe honest pattern is that vibe-coded tools work fine for the 80% case but regulated environments are defined by the 20% edge cases that matter disproportionately.",
          "score": 2,
          "created_utc": "2026-02-19 18:32:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7x65y",
      "title": "What actually slows down a fintech MVP the most?",
      "subreddit": "fintech",
      "url": "https://www.reddit.com/r/fintech/comments/1r7x65y/what_actually_slows_down_a_fintech_mvp_the_most/",
      "author": "Sarah_Shephard",
      "created_utc": "2026-02-18 08:05:57",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "From what I’ve been seeing across different fintech product builds, the biggest delays aren’t caused by feature development they usually come from things that aren’t visible in the initial product plan.\n\nThe most common ones:\n\n• KYC & AML flow complexity  \n• compliance requirements changing mid-build  \n• payment/banking API limitations  \n• handling real-time transaction states  \n• security architecture decisions made too late\n\nA lot of teams plan timelines based on UI + core features, but in fintech, the non-visible layers take equal (or more) effort.\n\nFor people here who’ve worked on fintech products\n\n  \nWhat ended up impacting your launch timeline the most?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/fintech/comments/1r7x65y/what_actually_slows_down_a_fintech_mvp_the_most/",
      "domain": "self.fintech",
      "is_self": true,
      "comments": [
        {
          "id": "o61159m",
          "author": "KimchiCuresEbola",
          "text": "It's always lack of domain knowledge that hinders fintech startups from what I've seen.",
          "score": 3,
          "created_utc": "2026-02-18 10:07:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6168od",
          "author": "kubrador",
          "text": "banking integrations will humble you faster than any feature ever could. we planned 6 weeks, the bank's api docs were \"call us\", we launched 4 months later wondering why we didn't just build a sandwich shop instead.",
          "score": 2,
          "created_utc": "2026-02-18 10:52:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o63eak3",
              "author": "kayandrae",
              "text": "I've been part of an integration that took 1 year 3 months.\nThe docs said one thing, the apis did another thing. Took many many months to properly edge case this particular company",
              "score": 1,
              "created_utc": "2026-02-18 18:02:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o61bbf1",
          "author": "Patelsiddhi",
          "text": "Most fintech MVPs get slowed by compliance + integrations: KYB/KYC, bank/payment rails, vendor contracts, and edge-case testing . Building UI is rarely the bottleneck.",
          "score": 2,
          "created_utc": "2026-02-18 11:34:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o680fb9",
          "author": "Organic_Act7411",
          "text": "Compliance requirements changing mid-build  this one absolutely wrecked my timeline. Thought I had MiCA figured out, started building, then realized halfway through that regulators don't just want \"the AI flagged it\" they want the exact article of law cited. Had to rebuild the entire decision layer. The domain expert comment is real. I came from financial crime investigations and still underestimated how different \"technically works\" is from \"passes an audit. Biggest lesson: whatever time you budget for compliance infrastructure, triple it. It's invisible work that nobody sees but if you skip it early, you're retrofitting later which is 10x worse. Also learned the hard way that \"we'll make it compliant later\" is basically choosing pain.",
          "score": 1,
          "created_utc": "2026-02-19 11:01:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o692hqe",
          "author": "SellSideShort",
          "text": "This is why I hate the word *Fintech.*   \n  \nDifferent areas of finance are regulated in different ways, by different entities, finance isnt the same across the board.\n\nLets say you get all the regulatory and legal aspects sorted, you'll have a hell of a time getting real customers.",
          "score": 1,
          "created_utc": "2026-02-19 15:05:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}