{
  "metadata": {
    "last_updated": "2026-01-27 16:59:04",
    "time_filter": "week",
    "subreddit": "GrowthHacking",
    "total_items": 20,
    "total_comments": 97,
    "file_size_bytes": 116103
  },
  "items": [
    {
      "id": "1qikjat",
      "title": "This is the quiet reason most growth experiments don’t compound",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qikjat/this_is_the_quiet_reason_most_growth_experiments/",
      "author": "freebie1234",
      "created_utc": "2026-01-21 01:45:24",
      "score": 51,
      "num_comments": 2,
      "upvote_ratio": 0.93,
      "text": "Most growth doesn’t stall because people lack ideas or tools.  \nIt stalls because **experiments aren’t documented properly**.\n\nHypotheses live in heads.  \nResults are shared once, then forgotten.  \nLearnings don’t compound.  \nA month later, the same tests get run again.\n\nSo teams feel “active”, but growth stays flat.\n\nI ran into this myself and realized the problem wasn’t velocity, it was memory. I started treating documentation as part of the experiment loop. I’ve been keeping hypotheses, results, and decisions in one place using **Notion**, and I also have access to a **free 3-month startup trial that includes Notion AI**, which I mainly use to summarize experiment outcomes and clean up thinking between iterations.\n\nThis didn’t magically create growth.  \nBut it stopped us from wasting cycles.\n\nIf you’ve run experiments that didn’t move the needle, what do you think actually broke?  \nI’d like to hear how others make learnings compound.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qikjat/this_is_the_quiet_reason_most_growth_experiments/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o0vyz3k",
          "author": "Due-Truth-385",
          "text": "This is an AI LinkedIn post most likely upvoted by bots. I just joined this sub and in 30 seconds, already cancer and AI slop.",
          "score": 2,
          "created_utc": "2026-01-21 17:16:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1e8xm7",
          "author": "AdOutrageous7442",
          "text": "That's why I created Hypotize, the Only growth platform that combines the power of Notion with AI",
          "score": 1,
          "created_utc": "2026-01-24 08:38:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnmxd2",
      "title": "Is anyone actually happy with their GTM setup",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qnmxd2/is_anyone_actually_happy_with_their_gtm_setup/",
      "author": "EnvironmentalCar761",
      "created_utc": "2026-01-26 17:40:29",
      "score": 38,
      "num_comments": 7,
      "upvote_ratio": 0.97,
      "text": "Serious question.  \nEvery team I talk to seems at least mildly unhappy with their GTM setup. Either the data is messy, workflows are fragile, sales and ops are misaligned, or everything takes too long to change.  \nEven teams with solid revenue numbers seem to be duct taping systems together behind the scenes.  \n  \nIs anyone here genuinely happy with how their GTM works today.  \nIf yes, what does your setup look like and how long did it take to get there.  \nIf not, what is the biggest thing that feels broken right now.  \n  \nMostly asking because I am trying to figure out whether this is just normal or if good GTM systems actually exist.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qnmxd2/is_anyone_actually_happy_with_their_gtm_setup/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o204mcx",
          "author": "IcebergPoet115",
          "text": "From what I have seen, teams that feel ok about their GTM usually have a simple core. Salesforce or HubSpot as the source of truth, then a small number of systems doing very specific jobs.\n\nA common pattern is using the CRM for record keeping, something like Clay for enrichment, research, and signals, and then letting sales tools focus purely on execution. The happier teams avoid having five different places modifying data. Most of the pain comes from data being enriched, scored, and “interpreted” in multiple tools at once. Once that happens, reporting and alignment fall apart. I still do not think anyone is truly done. The teams that feel good just have fewer moving parts and touch their system less often.",
          "score": 10,
          "created_utc": "2026-01-27 12:18:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uyora",
          "author": "Live-Peanut-7647",
          "text": "I don’t think anyone is ever fully happy — the best GTM setups I’ve seen just minimize decision lag and accept tradeoffs instead of chasing a “perfect” stack.",
          "score": 1,
          "created_utc": "2026-01-26 17:58:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uzw7g",
          "author": "No-Subject-1428",
          "text": "The 'duct tape' feeling usually happens because native integrations between CRM and sales tools are super limited and break easily. You can fix this by moving your logic into a workflow engine like n8n or Make.com, which lets you build a centralized 'brain' that handles your lead routing and data syncing properly without the fragile workarounds.",
          "score": 1,
          "created_utc": "2026-01-26 18:04:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1v5nhj",
              "author": "agin_",
              "text": "Do you have any interesting reading on this to recommend?",
              "score": 1,
              "created_utc": "2026-01-26 18:28:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1w930s",
          "author": "OkDependent6809",
          "text": "no ones happy with it\n\nweve been at it 4 years and still messy. attribution is guessing, sales and marketing blame each other, data never matches across systems\n\nbiggest issue is everything takes forever to change. by the time you ship something the strategy already shifted\n\ndont think anyone has it actually figured out tbh",
          "score": 1,
          "created_utc": "2026-01-26 21:19:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20voo9",
              "author": "EnvironmentalCar761",
              "text": "It really is that kind of environment, constantly shifting, it's getting pretty hard to try and catch up to everything ALL THE TIME!",
              "score": 1,
              "created_utc": "2026-01-27 14:48:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o20ix2u",
          "author": "Maleficent_Craft_774",
          "text": "Totally get where you’re coming from, I’ve chatted with dozens of founders in the same boat. Even teams pulling decent revenue often feel like their GTM is held together with hope and spreadsheets. \n\nThe “duct tape” vibe is real, attribution fights, slow iteration, sales/marketing silos, or just everything moving at glacial speed.\n\nThe setups that feel solid tend to come from forcing clarity early and shipping fast to get real signals.",
          "score": 1,
          "created_utc": "2026-01-27 13:44:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qod97r",
      "title": "Stop doing what Twitter tells you works and start measuring what converts.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qod97r/stop_doing_what_twitter_tells_you_works_and_start/",
      "author": "Unique-Persimmon2291",
      "created_utc": "2026-01-27 13:03:25",
      "score": 22,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "\nFollowed every growth hack thread on Twitter for 6 months. Implemented 12 different tactics everyone said were \"game changers.\" Webinars, lead magnets, exit popups, chatbots, retargeting, influencer outreach, podcast guesting, cold email, LinkedIn automation, Twitter threads, TikTok content, newsletter swaps. Spent 600+ hours and $4,200 implementing everything. Only 2 tactics actually drove meaningful growth. The rest was noise. Webinars brought 12 signups from 3 sessions requiring 40 hours prep and promotion. Lead magnets got 340 downloads, 8 converted to customers. Exit popups annoyed users, increased bounce rate 12%. Chatbot got 89 conversations, zero conversions. Retargeting ads burned $800 for 4 customers. Influencer outreach got ignored 47 times, responded 3 times, zero partnerships.\n\nPodcast guesting landed 2 appearances after 30+ pitches. Got 6 trial signups total. Cold email had 2.1% response rate, zero customers. LinkedIn automation got account restricted. Twitter threads brought engagement but zero paying customers. TikTok required learning new platform, made 15 videos, got 340 views combined. Newsletter swaps with 3 creators brought 23 signups, 1 customer. The only 2 tactics that actually worked were SEO content and community engagement. Wrote 25 helpful articles targeting specific problems my customers searched. Ranked for 18 keywords within 8 weeks. Brought 280 organic signups over 6 months converting at 18%. Posted valuable insights in 9 subreddits and 4 Slack communities daily. Built reputation over 4 months. Brought 190 signups converting at 24%.\n\n[Studied FounderToolkit data comparing growth tactics across 1,000+ founders](http://foundertoolkit.org). SEO and community engagement had highest ROI for bootstrappers because they compound monthly without ongoing cost. Every other tactic required constant effort or budget. Write one good article, it brings traffic for years. Build one community relationship, it brings referrals forever. The controversial reality is most growth hacks work for funded startups with teams and budgets. For solo founders or small teams, only compounding organic channels matter. Everything else is distraction dressed as strategy. SEO takes 3-6 months to work. Community building takes 4-8 months. Nobody wants to hear that timeframe. Everyone wants viral growth hack.\n\nStop chasing tactics. Start doubling down on what compounds. Measure actual conversions, not vanity metrics.\n\nWhat growth tactic actually worked for you? Be honest about conversions, not engagement.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qod97r/stop_doing_what_twitter_tells_you_works_and_start/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o20citw",
          "author": "kubrador",
          "text": "yeah this is the real one. everyone's selling you their sexy tactic because \"here's my 69-slide framework\" gets more retweets than \"i wrote boring articles for 6 months and it quietly worked.\" seo and community don't have a snappy name so nobody threads about them.",
          "score": 1,
          "created_utc": "2026-01-27 13:09:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20dc6h",
          "author": "Any_Butterscotch_610",
          "text": "\n\ndo you think SEO and communities always win, or is that just because you stuck with them longer?",
          "score": 1,
          "created_utc": "2026-01-27 13:13:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20ljwj",
              "author": "Impossibu",
              "text": "partly time, but mostly intent. people searching or actively discussing a problem are already halfway to buying. everything else felt like interrupting strangers.",
              "score": 1,
              "created_utc": "2026-01-27 13:57:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o20g91l",
          "author": "Easy-Extension-6917",
          "text": "the amount of hours people sink into “trying everything” without tracking conversions is wild. engagement feels productive until you check revenue and nothing moved.",
          "score": 1,
          "created_utc": "2026-01-27 13:30:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkp5rg",
      "title": "How do you reliably measure visibility in ChatGPT?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qkp5rg/how_do_you_reliably_measure_visibility_in_chatgpt/",
      "author": "oh_kayeee",
      "created_utc": "2026-01-23 12:11:38",
      "score": 21,
      "num_comments": 33,
      "upvote_ratio": 0.97,
      "text": "As more and more people are searching for answers in ChatGPT rather than the usual\r\nsearch engines like Google, how is everyone tracking brand mentions inside ChatGPT\r\nresponses? There are no OpenAI analytics (that I’m aware of at least), so how are you\r\ntracking this? Is it even possible to track?\n\r\nIt feels crazy to not know how to optimize for something like this, when we spend so\r\nmuch time on SEO and Google rankings.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qkp5rg/how_do_you_reliably_measure_visibility_in_chatgpt/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o185irx",
          "author": "Kortopi-98",
          "text": "There are definitely some visibility tools out there, but I think it’s important to recognize tracking isn’t going to look the same for AI responses as it will look for search engine ranking. It’ll take time, and clients are going to have to be patient! We’ve tried out a few different third-party tools to track this data, and we landed on Peec. Really, it’s not a ranking system we’re finding to be useful, but rather source of influence. I think in the future we’ll care less about where our client’s sites rank, and more about being a site that these AI models trust enough to pull answers from. I know we all want the data now, but I don’t think OpenAI is going to offer those analytics anytime soon, so third parties are where it’s at.",
          "score": 9,
          "created_utc": "2026-01-23 12:22:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o187gw9",
              "author": "Far-Idea689",
              "text": "I agree with this take. Teams and clients need to let go of this idea that there's a single way to rank or something concrete to optimize towards, because times are changing.",
              "score": 2,
              "created_utc": "2026-01-23 12:35:12",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o18as16",
              "author": "SkyOne5846",
              "text": "\\+1 for Peec AI. Significantly better than the stuff slapped on to Ahrefs imo.",
              "score": 1,
              "created_utc": "2026-01-23 12:56:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o187cq5",
          "author": "fran_canete",
          "text": "Honestly, this is one of those emerging problems where nobody has a perfect answer yet.\nA few approaches I've seen people try:\nManual spot-checking - Running variations of queries your customers might ask and documenting when/how your brand shows up. Tedious but gives you qualitative insight.\nTracking referral traffic - If ChatGPT links to your site, you can sometimes catch it in analytics (though it's inconsistent since many responses don't include links).\nBrand monitoring tools - Some of the newer ones are starting to add \"AI mention tracking\" but it's early days and most are just doing the manual approach at scale.\nThe frustrating truth is ChatGPT responses aren't indexed anywhere public, so there's no equivalent to checking your Google rankings. You're essentially trying to measure a black box.\nWhat seems to matter more (based on what people are finding) is whether your brand shows up in the training data and gets cited in authoritative sources that LLMs pull from. So traditional SEO, PR mentions, and being referenced in high-quality content still helps indirectly.\nCurious what others have found - definitely feels like we're all figuring this out in real time.",
          "score": 1,
          "created_utc": "2026-01-23 12:34:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18r1mj",
              "author": "mayankreal",
              "text": "I think part of the frustration here is we’re trying to measure AI visibility the same way we measured Google rankings. That model doesn’t really map.\n\nFrom what I’ve seen, the more actionable signal isn’t how often you’re mentioned, but how you’re framed when you are. \nTwo startups can show up equally often, but one is introduced as a clear category leader and the other as a generic alternative buried in a list.\n\nThat framing seems to be surprisingly consistent across prompt variations, even though the exact wording changes. Which makes it less about perfect tracking and more about understanding the default mental model the AI has built around you.\n\nStill very early days, but it feels like perception precedes measurement here, not the other way around.\n\nHappy to share specifics in DM, still refining the process.",
              "score": 1,
              "created_utc": "2026-01-23 14:25:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o187x9v",
          "author": "hatkinson1000",
          "text": "Right now optimizing for ChatGPT is closer to PR than SEO. Be referenced in places the model already trusts and hope that leaks through",
          "score": 1,
          "created_utc": "2026-01-23 12:38:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o189lby",
          "author": "Spacmonitor",
          "text": "Create content systematically with a tool like [https://wpautoblog.com](https://wpautoblog.com)",
          "score": 1,
          "created_utc": "2026-01-23 12:48:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18cmgn",
          "author": "akash_09_",
          "text": "we use Amadora AI to track & optimize AI visibility.",
          "score": 1,
          "created_utc": "2026-01-23 13:07:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18hg44",
          "author": "Carmela185",
          "text": "Following bc I'm stuck on this too. We have some fixed prompts we test, but I don't know if it means much considering how answers can change for really any reason at all (region, time of day, wording, etc).",
          "score": 1,
          "created_utc": "2026-01-23 13:34:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18lnox",
              "author": "Potato-shiro",
              "text": "Best solution for us is just tracking how much traffic is coming from LLM in our GA. It's still very much a blackbox and we have no idea what queries are sending them but we can at least see some directional data. The more frustrating part is we know a big chunk of the times our brand gets mentioned we're not even being linked to and here is no way to measure that.",
              "score": 1,
              "created_utc": "2026-01-23 13:57:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o18r52n",
              "author": "mayankreal",
              "text": "I think part of the frustration here is we’re trying to measure AI visibility the same way we measured Google rankings. That model doesn’t really map.\n\nFrom what I’ve seen, the more actionable signal isn’t how often you’re mentioned, but how you’re framed when you are. \nTwo startups can show up equally often, but one is introduced as a clear category leader and the other as a generic alternative buried in a list.\n\nThat framing seems to be surprisingly consistent across prompt variations, even though the exact wording changes. Which makes it less about perfect tracking and more about understanding the default mental model the AI has built around you.\n\nStill very early days, but it feels like perception precedes measurement here, not the other way around.\n\nHappy to share specifics in DM, still refining the process.",
              "score": 1,
              "created_utc": "2026-01-23 14:25:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o18jpgh",
          "author": "OrganicClicks",
          "text": "Honestly, you can't really track it reliably right now. Even the optimizing for LLMs thing is still a developing concept unlike SEO where we have decades of knowledge. Some people try to get mentioned in high-authority sources that LLMs likely trained on, but it's all guesswork right now. You can test prompts related to your niche periodically and see if your brand comes up, but that's too manual and not scalable.",
          "score": 1,
          "created_utc": "2026-01-23 13:47:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18r89f",
              "author": "mayankreal",
              "text": "I think part of the frustration here is we’re trying to measure AI visibility the same way we measured Google rankings. That model doesn’t really map.\n\nFrom what I’ve seen, the more actionable signal isn’t how often you’re mentioned, but how you’re framed when you are. \nTwo startups can show up equally often, but one is introduced as a clear category leader and the other as a generic alternative buried in a list.\n\nThat framing seems to be surprisingly consistent across prompt variations, even though the exact wording changes. Which makes it less about perfect tracking and more about understanding the default mental model the AI has built around you.\n\nStill very early days, but it feels like perception precedes measurement here, not the other way around.\n\nHappy to share specifics in DM, still refining the process.",
              "score": 1,
              "created_utc": "2026-01-23 14:26:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o18m3rd",
          "author": "AEOfix",
          "text": "I can help it's my specialty. For AI visibility I use 8 agent actions. there is no way curantly to know when a LLM renders your info. What you can track is how they see you and how you compair to your competitors. You can also set up aa system to know when a LLM visits your site. but llm mentioning you and visiting your site do not correlate. the llm typically grab training data first. no way to know.",
          "score": 1,
          "created_utc": "2026-01-23 13:59:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18qfh0",
          "author": "mayankreal",
          "text": "One thing I’ve noticed while looking into this: tracking mentions is only half the problem.\n\nThe more interesting (and uncomfortable) part is how models introduce you when you do show up, what category they drop you into, which competitors they name first, or whether they treat you as interchangeable.\n\nIn a few cases I’ve seen, founders were technically “visible” but framed so generically that the model basically did the competitor’s positioning for them.\n\nFeels like before we optimize measurement, we need to understand the default framing AI is already applying.",
          "score": 1,
          "created_utc": "2026-01-23 14:22:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18rznm",
          "author": "useomnia",
          "text": "It’s trackable, just not like classic SEO. Instead of “rank,” you track presence: do you show up for the same decision prompts, how often, and are you cited. \n\nIf you keep the prompt pack stable and run it weekly, you get a clean trend line.",
          "score": 1,
          "created_utc": "2026-01-23 14:30:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18y7no",
          "author": "CayoPerican",
          "text": "The best video I've watched on this subject is this one:  \n[https://youtu.be/iT7kq-R3Gjc?si=oXiHjglirFJqIIl3](https://www.linkedin.com/safety/go?url=https%3A%2F%2Fyoutu.be%2FiT7kq-R3Gjc%3Fsi%3DoXiHjglirFJqIIl3&trk=flagship-messaging-web&messageThreadUrn=urn%3Ali%3AmessagingThread%3A2-OTljOGU3MjYtYTg3My00MWRkLWEwNTYtNWJlMDE4YTQzNzlmXzEwMA%3D%3D&lipi=urn%3Ali%3Apage%3Ad_flagship3_messaging_conversation_detail%3BYaTXSNS7SLOiiWfN3GO6Wg%3D%3D)",
          "score": 1,
          "created_utc": "2026-01-23 15:01:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1982su",
          "author": "ChodeMcGee",
          "text": "[Aeo Dog](https://aeodog.com) was built to do this",
          "score": 1,
          "created_utc": "2026-01-23 15:47:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ar011",
          "author": "CakesRacer522",
          "text": "Profound is the current leader in this space, and their platform is quite powerful, albeit on the expensive side. I’ve had demos with others like Peec, Scrunch, and SEMRush, but Profound has a much better interface. Note that With all AI visibility tools, much of the data is sampled due to privacy constraints.\n\nWith Profound, we track 500+ prompts, organize them into topics, apply tags/filters to look across topics etc. That’s for viability monitoring into the prompts you care about. They can also let you see agent analytics to monitor both human and bot traffic and citations on your site so that you can know what pages/content are performing best",
          "score": 1,
          "created_utc": "2026-01-23 19:57:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1bo9b4",
          "author": "Drumroll-PH",
          "text": "You really can’t measure it reliably right now. I treat ChatGPT more like word of mouth than SEO and focus on clear positioning and content elsewhere. For now it’s influence without analytics.",
          "score": 1,
          "created_utc": "2026-01-23 22:35:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1c1eic",
          "author": "Mrmez_",
          "text": "[flygne.ai](http://flygne.ai) is killing it with action first GEO",
          "score": 1,
          "created_utc": "2026-01-23 23:44:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cdpqb",
          "author": "Vixtrolla",
          "text": "This is exactly the blind spot right now.\n\nYou’re right! There’s no native analytics from OpenAI, so you can’t “track” ChatGPT mentions the same way you track Google rankings. Most teams doing this seriously are triangulating instead of relying on a single signal.\n\nWhat actually works in practice is:  \nManually querying models with high-intent prompts and competitors included, then tracking consistency over time.  \nMonitoring how AI *describes* your brand, not just whether it names you.  \nWatching downstream signals like higher-quality conversions, branded searches, and referral patterns from AI tools.  \nAuditing whether your site is even structured in a way that AI can confidently extract and cite.\n\nThat last part is where most sites fall down. They’re optimized for crawling, not for extraction and synthesis.\n\nThis is why AEO is emerging alongside SEO. You’re optimizing for how machines understand and frame you, not just where you rank.\n\nIt feels uncomfortable because we’re used to dashboards and exact numbers. But early SEO felt the same way before Search Console existed. The teams learning how AI “sees” them now will have a massive edge when real analytics finally arrive.",
          "score": 1,
          "created_utc": "2026-01-24 00:50:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1d1bwk",
          "author": "Mrmez_",
          "text": "Recently I’ve been using flygen.ai",
          "score": 1,
          "created_utc": "2026-01-24 03:08:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fijgu",
          "author": "WhoAmI6589",
          "text": "you're def not alone in thinking about this, it's becoming a real blindspot for marketing teams. Brandlight is built specifically for tracking how your brand shows up in AI responses like ChatGPT, and from what I've read it also helps you figure out what content changes actually move the needle. I've seen it come up a few times when poeple ask about monitoring AI visibility and it seems like one of the few tools actually tackling this problem directly.",
          "score": 1,
          "created_utc": "2026-01-24 14:32:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1g6fhi",
          "author": "resonate-online",
          "text": "Citation tracking is a false flag and doesn’t mean anything.  The same person could run the same prompt 5 times in a row and get different answers.  Different people can run the same prompt at the same time and get different answers.  The results you get are point in time results that mean nothing to the run time you run a prompt.  It can give you directional sense of what’s happening, but it is not comparable to impressions and page rank like in SEO and people have got to stop chasing after that.  Unless the models fundamentally change the way they operate.\n\nThe only measure that can be counted on is referral traffic.\n\nWith the introduction of paid - there will have to be  some type of view metric, but I suspect it won’t be that closely tied to answers.",
          "score": 1,
          "created_utc": "2026-01-24 16:29:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gba7k",
          "author": "One_Title_6837",
          "text": "You can’t really measure it yet - most 'ChatGPT visibility tracking' is educated guesswork. Best you can do is spot-check prompts, watch OpenAI referral traffic, n see if branded searches lift after you publish authoritative content. Feels like early SEO all over again: optimize to be the obvious answer, measure impact later...",
          "score": 1,
          "created_utc": "2026-01-24 16:50:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1i8xxy",
          "author": "GroMach_Team",
          "text": "You can't track it via analytics (no referral headers), so you have to track \"share of voice\" instead. we usually automate a set of 20-30 prompts related to our niche and record how often our brand is mentioned in the answer compared to competitors.",
          "score": 1,
          "created_utc": "2026-01-24 22:04:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1lv8oh",
          "author": "phb71",
          "text": "For top of the funnel visibility, you can track individual prompts important to your brand e.g. buying intent but you can also track LLM crawlers  through server logs to see the overall 'exposure' of your content into LLMs. We're using [getairefs.com](http://getairefs.com) for both.",
          "score": 1,
          "created_utc": "2026-01-25 12:26:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sf7iq",
          "author": "Pale_Performance_697",
          "text": "Currently, there’s no direct way to track brand mentions in ChatGPT responses. Some use surveys, monitoring social media, or testing prompts manually.",
          "score": 1,
          "created_utc": "2026-01-26 09:12:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ts9up",
          "author": "_ngnix",
          "text": "Bit of a biased plug, but I'm the founder of [https://pelucid.app/](https://pelucid.app/) \\- you can give it a go for 30-days & see if it does what you're looking for, happy to chat if you have any questions.",
          "score": 1,
          "created_utc": "2026-01-26 14:52:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zbcpu",
          "author": "gigikie",
          "text": "in wix, they have a SEO & GEO panel to measure your brand's visibility in gpt / gemini / etc.  \nhow it works be like: generate a list of questions related to your brand, and then ask a few AIs to answer, lastly check how many of the answers reference your brand/site to provide a score.\n\noverall it's okie. I'd say focusing on SEO first (access/understand/trust-bility), and GEO would come naturally",
          "score": 1,
          "created_utc": "2026-01-27 08:04:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qn2v9h",
      "title": "How I made half Billion views in 30 days and replaced 10 hours of manual work",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qn2v9h/how_i_made_half_billion_views_in_30_days_and/",
      "author": "Difficult-Cap-6950",
      "created_utc": "2026-01-26 02:04:23",
      "score": 12,
      "num_comments": 8,
      "upvote_ratio": 0.88,
      "text": "**The Problem:** I've been in this space for nearly a decade. For years, my workflow was a high friction loop of 10 hour days:\n\n\\-Finding trending hooks\n\n\\-Manual editing in CapCut\n\n\\-Thinking about titles and descriptions\n\n\\-Managing multiple accounts and posting on them. \n\nI was hitting a ceiling. I couldn’t scale because I was the bottleneck.\n\n\n\n**Building an Autonomous Content Engine** \n\nI decided to stop being a creator and started being a systems architect. \n\nI spent a month  building a fully automated AI workflow.\n\n\n\n**The Stack (High Level):**\n\n**-Generation:** AI-driven scripts that handle 100% of the creative (Visuals + Audio).\n\n**-Face/Faceless Hybrid:** Half the accounts are fully faceless, and half use my face/clients faces using AI sync/cloning tech.\n\n**-Logic:** The system scans for high-performing trends, generates catchy titles, and monitors issues automatically.\n\n**-The \"Check-in\":** My only daily task is a **20** **minute coffee session** where I check the analytics dashboard and tweak the high-performers.\n\n\n\n**The Results (Past 28 Days):** The numbers are honestly scary when you stop relying on human speed:\n\n* **Total Views (on All Accounts):** \\~500 M\n* **IG (Best Account):** 130 M views\n* **YT (Best Account):** 65 M views\n* **TT (Best Account):** 80 M views\n\n\n\n**3 Key Lessons for Growth Hackers in 2026:**\n\n1. **Quantity leads to Quality:** By posting at a volume no human can match, the algorithm has \"more bites at the apple.\" The AI learns which hooks work and doubles down on them.\n2. **The \"Faceless\" Scale:** Faceless accounts are the ultimate leverage. They don't get tired, and you can launch 5 of them in the time it takes to record 1 video of yourself.\n3. **Monitoring > Creation:** Spend your time on the *infrastructure*. If your automation is solid, you aren't a creator anymore, you're something like a portfolio manager.\n\n**My honest recommendation to everyone: stop working hard, work smart!** I’ve been in this game for nearly a decade, and this is the first time I’ve had so much time for other things while seeing better results than ever before.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qn2v9h/how_i_made_half_billion_views_in_30_days_and/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o1qrzyc",
          "author": "vaporeonlover6",
          "text": "funny, I'm here wondering if it's gonna pan out my videos and find this post...\nI made an automatic video generator from short funny chat conversations.\nare you doing short or long videos?\nwhat's the daily limit for new accounts?\nany tips appreciated\n\nmy channel is \nhttps://m.youtube.com/@waifuDungeon",
          "score": 3,
          "created_utc": "2026-01-26 02:20:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1r1b88",
              "author": "Difficult-Cap-6950",
              "text": "Doing both short and long format.   \nWhat you mean by daily limit for new accounts - like a posting limit?  \nWould wait 3-5 days after creation before posting anything, then start slowly with 1 post and increase every few days for +1.",
              "score": 2,
              "created_utc": "2026-01-26 03:07:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1rgti3",
          "author": "stovetopmuse",
          "text": "These numbers always make me pause unless there’s some normalization behind them. Views at that scale usually hide a massive long tail of zero engagement posts plus a few breakout clips doing all the lifting. Not saying the system idea is wrong, but I’d be more interested in retention curves, follower growth, and how many of those views translate into anything durable. Volume is easy to flex, signal quality is the hard part.",
          "score": 2,
          "created_utc": "2026-01-26 04:40:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1riz38",
              "author": "Difficult-Cap-6950",
              "text": "I posted proof-of-work (screenshots) on my profile. Engagement is good as well, the IG acc made around +150K new followers, around 20K messages through manychat.",
              "score": 1,
              "created_utc": "2026-01-26 04:54:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1tqf9k",
          "author": "bolerbox",
          "text": "quick question, for the ai generated videos, are you using any specific tool for the avatar/talking head parts? or is it all b-roll style content?\n\ni've been using videotok .app for ugc style ads and curious how it compares to what you're using for the content engine",
          "score": 1,
          "created_utc": "2026-01-26 14:44:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1u8hsf",
              "author": "Difficult-Cap-6950",
              "text": "Yes to generate content I only use APIs to access the tools directly (saves time and is usually cheaper) - regarding the tool it always depends on the type of content. But if it’s about “talking heads” training an own Lora is the way In combination with Kling / Veo with a voiceover or a professional lypsync tool (don’t recommend the cheap ones)",
              "score": 1,
              "created_utc": "2026-01-26 16:05:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qmyehg",
      "title": "Your \"ideal customer\" might be completely wrong — case studies that broke my brain",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qmyehg/your_ideal_customer_might_be_completely_wrong/",
      "author": "grayfoxlouis",
      "created_utc": "2026-01-25 22:57:13",
      "score": 10,
      "num_comments": 3,
      "upvote_ratio": 0.86,
      "text": "So I went down a rabbit hole this week after hearing a marketer friend mention that **fishing enthusiasts convert incredibly well on insurance offers.**\n\nMy first thought: \"That makes zero sense.\"\n\nMy second thought: \"Wait... does it though?\"\n\nTurns out there's a mountain of documented cases where advertisers discovered their highest-converting audiences had absolutely nothing to do with their product category. And honestly, some of these findings are wild.\n\n\n\n**The George Foreman Grill was supposed to be for boxing fans.**\n\nMakes sense, right? Boxing legend endorses a grill, target male boxing enthusiasts. Except when they actually tested it, 60-70% of buyers were college-educated women. They completely retooled the infomercials to show family grilling scenes instead of boxing references. Result: 100+ million units sold.\n\nThe audience that \"should\" convert wasn't even close to the audience that actually did.\n\n\n\n**A bicycle company's best customers were music fans.**\n\nState Bicycle Company started targeting people who liked specific music genres on Facebook — zero connection to cycling whatsoever. $500K in incremental annual sales. Their cost-per-click was 1/5th of other platforms. Music taste predicted bicycle purchases better than interest in... bicycles.\n\n\n\n**Luxury travel converts better when you target Chanel fans, not travel enthusiasts.**\n\nLuxury Link discovered that targeting people interested in Chanel, Prada, and Fendi drove a 100% increase in travel package sales versus targeting people who liked travel pages. Cross-category luxury affinity was the signal, not the product category itself.\n\n\n\n**Chicago Cubs fans convert on everything apparently.**\n\nBonobos (men's pants) ran ads to Cubs fans that said \"Pants for Wrigley\" — 10% of entire site traffic. Arizona Office of Tourism targeted Cubs fans (spring training angle) — 27% conversion rate on visitor guide requests, 8x more clicks than paid search.\n\nSports team loyalty as an identity signal is weirdly powerful.\n\n\n\n**Here's the one that really got me:**\n\nA real estate company running Gmail campaigns for apartment rentals found that targeting \"luxury travelers\" and \"green-living enthusiasts\" delivered the lowest cost-per-lead — **better than targeting people actually looking for apartments.**\n\nPeople with certain lifestyle affinities who weren't actively searching converted better than high-intent searchers.\n\n\n\n**The pattern I keep seeing:**\n\n* Lifestyle identity > product interest\n* Life stage > purchase intent (people moving or getting married convert better on mattresses than people searching \"best mattress\")\n* Algorithms find audiences humans never would have picked (Google's auto-generated audiences hit 3x higher engagement than manually selected ones)\n* Gender assumptions invert constantly (products with male endorsers often convert better with women)\n\n\n\nI'm not saying throw out your customer personas entirely. But maybe the fishing → insurance thing isn't that weird after all.\n\nPeople are complex. A 45-year-old guy who fishes on weekends might also be a homeowner thinking about his family's financial security. The fishing interest is a signal about lifestyle, values, and life stage — not just \"this person likes fish.\"\n\nThe takeaway for me: test audiences that feel completely unrelated. The \"logical\" targeting might be leaving money on the table.\n\nAnyone else discovered weird audience overlaps that worked way better than expected? Would love to hear what's worked for you.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qmyehg/your_ideal_customer_might_be_completely_wrong/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o1qdm4h",
          "author": "kubrador",
          "text": "the george foreman grill thing is just \"what if we marketed to people with disposable income instead of people who watched boxing\" but dressed up as a revelation lol",
          "score": 3,
          "created_utc": "2026-01-26 01:06:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1rnbd0",
              "author": "grayfoxlouis",
              "text": "lol in many ways yes, I guess I respect the hustle and the flexibility to go hey this is working and should do this. Too many stay stubborn and tank their own success with tunnel vision. I'm an old school wrestling fan and I just think of WCW and what they did to crash and burn",
              "score": 1,
              "created_utc": "2026-01-26 05:23:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1rvmem",
          "author": "ChestChance6126",
          "text": "This lines up with what I’ve seen. Interests are rarely about the thing itself, they’re signals for lifestyle, stability, and habits. Once you stop arguing with the data and just test the “wrong” audiences, a lot of assumptions fall apart fast. The sideways audiences are often cheaper and less competitive, too.",
          "score": 1,
          "created_utc": "2026-01-26 06:25:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjes96",
      "title": "Growth experiments fail when email is unreliable",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qjes96/growth_experiments_fail_when_email_is_unreliable/",
      "author": "Puzzleheaded_Bug9798",
      "created_utc": "2026-01-22 00:00:22",
      "score": 9,
      "num_comments": 6,
      "upvote_ratio": 0.76,
      "text": "We test new growth ideas weekly, but results are inconsistent. Eventually realized half the test emails weren’t even delivered consistently. Hard to optimize when data is skewed.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qjes96/growth_experiments_fail_when_email_is_unreliable/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o10hw7v",
          "author": "_magvin",
          "text": "Deliverability comes first. I think a tool like warmy fixes that base layer so experiments are valid.",
          "score": 6,
          "created_utc": "2026-01-22 08:25:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zgmg0",
          "author": "stovetopmuse",
          "text": "This is a super common blind spot. If deliverability is noisy, every downstream metric becomes junk, so you end up optimizing ghosts instead of behavior.\n\nIn my tests, inbox placement variance alone can swing results more than the experiment itself. Before calling a growth idea dead, I usually baseline send volume vs actual opens across a few providers to see how unstable it is. Once email is flaky, it stops being a growth channel and turns into a measurement problem. Fixing that usually makes experiments look way less random.",
          "score": 1,
          "created_utc": "2026-01-22 03:40:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o111pqm",
              "author": "Puzzleheaded_Bug9798",
              "text": "I can't help but agree with your pov and assessment. Also your tests offer an interesting method and perspective which on further thought promises better results. I am definitely taking that into consideration going forward. Thanks for sharing this mate.",
              "score": 1,
              "created_utc": "2026-01-22 11:26:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o16n302",
                  "author": "stovetopmuse",
                  "text": "No worries mate!",
                  "score": 1,
                  "created_utc": "2026-01-23 04:50:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o10aevp",
          "author": "EnvironmentalFact945",
          "text": "you need real time data to experiment growth.",
          "score": 1,
          "created_utc": "2026-01-22 07:18:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10ml8t",
          "author": "kubrador",
          "text": "yeah you can't a/b test your way out of a broken delivery system, that's just expensive guessing with extra steps.",
          "score": 1,
          "created_utc": "2026-01-22 09:09:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qk2kzj",
      "title": "Burnt $1000 on ads and didn't make a single sale",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qk2kzj/burnt_1000_on_ads_and_didnt_make_a_single_sale/",
      "author": "PaulineP383",
      "created_utc": "2026-01-22 18:32:25",
      "score": 8,
      "num_comments": 14,
      "upvote_ratio": 0.73,
      "text": "Launched [our SaaS](https://predictent.ai/) 6 months ago and thought we'd try paid ads as an easy way to get traffic / sales....\n\nResults from $1000 in ads (3682 clicks): [https://imgur.com/a/4kXWYaN](https://imgur.com/a/4kXWYaN)\n\n47 signups, 0 paid conversions. 90% were either trial abusers extracting data, developers copying our product, or tire-kickers who ghosted after demo calls. Complete waste.\n\nWe initially had a $2500 budget for GTM between tooling + ads, so with the remaining money we bought quarterly subscriptions to the following:\n\n* Predictent for leads & intent signal tracking\n* Heyreach for LinkedIn automation\n* Instantly for cold emails\n\nSame $1000, but this time we generated real revenue, 50+ paying customers, and 3%+ reply rates on cold outreach over 4 months.\n\nHonestly wasn't expecting that big of a difference. Ads brought us people who didn't care. Outbound brought us people already talking about the problem we solve - way easier conversations, way higher close rates.\n\nNot saying ads never work, but for us at this stage they were just burning cash on the wrong audience. Direct outreach to people showing intent was just... way more efficient.\n\nAre we just bad at setting up / optimising ads or is this the normal situation for startups? It seems logical that it can't be that simple to just 'run ads = make money'",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qk2kzj/burnt_1000_on_ads_and_didnt_make_a_single_sale/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o14fhko",
          "author": "RegisterConscious993",
          "text": "Are you gonna spam your product now or later? \n\n\nBtw your comment history is obviously hidden for a reason, but Reddit has a search bar, and Google still works.",
          "score": 4,
          "created_utc": "2026-01-22 21:32:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18m3to",
              "author": "ProgrammerForsaken45",
              "text": "he already did 'Predict..'",
              "score": 2,
              "created_utc": "2026-01-23 13:59:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o14vzi1",
              "author": "PaulineP383",
              "text": "Do you have any valid input on ads or just this to comment?",
              "score": -1,
              "created_utc": "2026-01-22 22:57:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o14zc3h",
                  "author": "RegisterConscious993",
                  "text": "Do you have a valid input here or just to spam?",
                  "score": 2,
                  "created_utc": "2026-01-22 23:14:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o17adto",
          "author": "sech8420",
          "text": "Low effort spam",
          "score": 2,
          "created_utc": "2026-01-23 07:53:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17yzc1",
          "author": "Hopeful-Candle-8442",
          "text": "Your split test results mirror what I’ve seen with early-stage SaaS: ads cast too wide, while outbound hits the ‘already looking’ crowd. The Predictent + Heyreach combo is smart - most founders don’t realize intent tools work best when layered (e.g., use Predictent to find active buyers, then Heyreach to engage them 1:1). Alternative route: try a hybrid approach with retargeting \\*only\\* to demo call no-shows. Ever experiment with that middle ground?",
          "score": 1,
          "created_utc": "2026-01-23 11:33:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o183o3t",
          "author": "Hopeful-Candle-8442",
          "text": "Oof, been there with the ad burn - especially when 90% of signups are just tire-kickers. The intent data angle makes total sense though. One thing that helped me: running tiny ad tests ($50/day max) against \\*very\\* specific pain point keywords (not just product features). Did you notice any patterns in the 10% who weren’t abusers? Maybe there’s a niche audience hiding in that data",
          "score": 1,
          "created_utc": "2026-01-23 12:09:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fal8u",
          "author": "Goran-CRO",
          "text": "different metrics at different growth stage - keep this in mind : \n\nYou've just killed paid search because payback is 24 months.\n\nBut you're 6 weeks into the campaign. And you're pre-PMF.\n\nOf COURSE payback looks bad:\n• Google Ads needs 3-6 months to stabilize (you're in learning mode)\n• Your NRR is 65% (it'll improve as product matures)\n• You're early stage — payback always lags retention development\n\nThe real question isn't \"is 24 months acceptable?\"\nIt's \"are we evaluating this channel with the right metrics for OUR stage?\"\n\nI've run paid search at B2B SaaS companies for the last 8 years. Here's what actually matters:\n\n📍 EARLY STAGE (Pre-PMF)\n✅ Critical: Can you generate volume at reasonable CAC?\n⏸️ Can lag: LTV:CAC, Payback, NRR (will improve with retention)\n❌ Don't kill it because unit economics look rough\n\n📍 GROWTH STAGE (PMF validated)\n✅ Critical: Volume + positive LTV:CAC (≥1:1)\n⚠️ Important: Payback ≤18 months\n⏸️ Can lag: NRR (still optimizing)\n\n📍 SCALE STAGE (Efficient growth)\n✅ Critical: ALL fundamentals must work\n❌ Any underperforming metric limits your ability to scale profitably\n\nSame channel. Different stages. Different success criteria.\n\nBut here's the problem: you're using scale-stage metrics to evaluate an early-stage test. Your Growth Lead is projecting Month 1 performance as if it's steady state. Your CMO forgot to account for brand overlap.\n\nSo I built a calculator that:\n• Adapts evaluation criteria to YOUR growth stage\n• Shows each stakeholder what matters to THEM\n• Accounts for ramp time, incrementality, bidding constraints\n• Gives you a clear GO / PILOT / FIX recommendation\n\nOne tool. Shared decision framework. No more \"let's circle back.\"",
          "score": 1,
          "created_utc": "2026-01-24 13:46:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1l18wc",
          "author": "devhisaria",
          "text": "For early stage SaaS ads are often a huge money sink. Direct outreach to people already looking for solutions is almost always better.",
          "score": 1,
          "created_utc": "2026-01-25 08:07:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1na4si",
          "author": "jeannen",
          "text": "Because you're comparing a channel targeting warm or qualified leads (Outbound) with a channel meant to reach out to cold audiences. \n\n  \nAds work, else it would not be a billion $ industry. \n\n  \nIt's impossible to pinpoint what is wrong exactly fron your results, but based on the super low CPM and low CTR, it's a mix of bad audience + bad creatives.\n\nThe UI looks like X or Reddit Ads, which are notorious for being low quality overall, so this doesn't helps either. Meta or Google ads are usually better. \n\nBut no, run ads = make money is a myth, it's run ads = get data = optimise = maybe make money\n\nIt's a very iterative process, especially if you've never ran ads before\n\nSaying this as someone who used ads as my main channel for multiple SaaS and used to work in advertising before :)",
          "score": 1,
          "created_utc": "2026-01-25 16:52:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yxnf3",
          "author": "InternationalFly7921",
          "text": "Hey, spot on, $1k ads giving you 47 signups but 0 sales vs outbound landing 50+ paying customers with 3% replies is such a classic early SaaS story. Paid traffic just floods you with low-intent noise at this stage, especially when bots eat 20-40% of B2B clicks and double your real CAC (norms are $500-2k for startups if even optimized, but good luck pre-PMF without 6 months of tweaking). Your switch to Predictent/Instantly was genius, hitting intent signals and cold email skips the ad mess and gets you in front of buyers already chatting about your problem. As someone working in an ad fraud solution company, I've seen simple audits filter out 90% of that junk traffic upfront so your budget actually hits humans. If you need help spotting those fraud signals, feel free to reach out.",
          "score": 1,
          "created_utc": "2026-01-27 06:09:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15ibjf",
          "author": "boricuajj",
          "text": "Outreach is great when lean but doesn't scale as well as paid ads. \n\nYour ad performance looked fine on the campaign with more spend. There's a disconnect between your ads and your monetization strategy for that traffic. \n\nDid it just send them to a free trial? Did you communicate with them?",
          "score": 0,
          "created_utc": "2026-01-23 00:54:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16mci9",
          "author": "ggn0r3",
          "text": "You need less budget and more optimization to generate profitable ad campaigns.",
          "score": 0,
          "created_utc": "2026-01-23 04:45:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ql6u7j",
      "title": "Found a blue ocean acquisition channel hiding in plain sight - LLM visibility explained",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1ql6u7j/found_a_blue_ocean_acquisition_channel_hiding_in/",
      "author": "arifemrey",
      "created_utc": "2026-01-23 23:40:20",
      "score": 7,
      "num_comments": 7,
      "upvote_ratio": 0.89,
      "text": "Our SaaS does project management for creative agencies. CAC through Google Ads? $340. Organic? Takes 9-12 months to gain traction. We were bleeding budget like everyone else, right?\n\nThen something weird happened in November. Sales guy comes to our weekly and goes \"Yo, had three demos yesterday. All three said they found us through ChatGPT.\" We're like... what? Checked the previous week. Same thing. People literally typing questions like \"best PM tool for creative teams\" into ChatGPT and our name keeps popping up in the responses.\n\nWe weren't even trying. We just existed on the internet.\n\nSo obviously I went down the rabbit hole. Spent two weeks testing every AI engine I could find - ChatGPT, Claude, Perplexity, Gemini. Asked hundreds of variations of buyer-intent questions in our niche.\n\nThe companies getting recommended aren't always the ones dominating Google and it blew my mind. Sometimes they're on page 2 or 3. What matters is completely different signals - how you're referenced across the web, your structured data, even how other sites contextualize your brand.\n\nThis is what people are starting to call LLM visibility - when your brand's discoverability in AI-generated responses. And right now? It's the wild west. Most companies have NO idea they're even being recommended (or ignored) by these engines.\n\nThe growth hack part. We started deliberately optimizing for this channel. Not throwing money at ads. Just strategic content + technical tweaks to make our brand \"legible\" to AI systems.\n\nAnd in 60 days our ChatGPT referral traffic went from basically zero to our third-highest demo source. CAC: $23. Yeah, you read that right.\n\nThe best part? Your competitors probably aren't even tracking this yet. They're still dumping budget into the same saturated channels while this blue ocean is sitting wide open.\n\nHas anyone else stumbled into this, or am I just getting lucky with timing?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1ql6u7j/found_a_blue_ocean_acquisition_channel_hiding_in/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o1ceon3",
          "author": "Mysterious-Story7657",
          "text": "The question is how to ? And what s the stack of your saas - I m struggling with mine now - build on lovable ( Vite React SPA ) … can’t handle seo and gea as you’re presenting… Our platform: https://mawthouk.pro",
          "score": 1,
          "created_utc": "2026-01-24 00:56:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cspob",
          "author": "stovetopmuse",
          "text": "I’ve seen hints of this too, but the attribution part still feels messy. A lot of people ask tools for shortlists, then go Google the names, so it can look like a new channel when it is really assist plus search combined. The interesting bit is what signals actually drive inclusion, because it does not line up cleanly with classic SEO metrics. Did you notice any correlation with review sites, docs, or third party mentions vs your own content? I’m curious how stable it is over time once more people start chasing it. Feels promising, but also fragile if the models shift.",
          "score": 1,
          "created_utc": "2026-01-24 02:17:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1l2pj1",
          "author": "devhisaria",
          "text": "It's a blue ocean now but AI models update constantly so this might not last forever.",
          "score": 1,
          "created_utc": "2026-01-25 08:19:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1lkgd1",
          "author": "kubrador",
          "text": "the classic \"we did nothing and got results\" followed by \"here's everything we did\" post. also your $23 cac math doesn't account for the two weeks you spent testing, but sure, blue ocean energy.",
          "score": 1,
          "created_utc": "2026-01-25 10:56:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mhfcj",
          "author": "resonate-online",
          "text": "You didn’t explain llm visibility at all or say what you did.  All I see is a reply mentioning a product.",
          "score": 1,
          "created_utc": "2026-01-25 14:41:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qixfg9",
      "title": "I spent $10k on an onboarding flow that users loved in interviews, but 70% dropped off in reality. Here is the math on why I failed.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qixfg9/i_spent_10k_on_an_onboarding_flow_that_users/",
      "author": "Great_Employment_871",
      "created_utc": "2026-01-21 13:08:23",
      "score": 5,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "Most founders (including me) fall into the \"Gut Feel\" trap. We do user interviews, people are polite, and we spend months building. But recently, after a product launch wet soothsays , I understand that, Code is reversible, but Belief is not.\n\nOnce you ship a bad core experience, you don't just lose money; you lose the user's trust forever.I realised that current tools like Mixpanel, they tell you how you died after you're already dead. To solve this for my current project, I built a user simulation layer for our team. We used Claude Code to run synthetic personas through the flow before writing code. It found the exact failure point in 48 hours that took us 1 month to find manually.\n\nHas anyone else found a way to stress-test a product strategy without burning live traffic? Looking for feedback on how you guys handle high-stakes pivots.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qixfg9/i_spent_10k_on_an_onboarding_flow_that_users/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o0w037d",
          "author": "mehdiweb",
          "text": "For your current situation - Mixpanel or Hotjar can show you the exact drop-off step, but my guess? The flow worked in interviews because people were polite and you were there. In reality, users bail the second something feels like work.\n\nOne thing that always works: give them value BEFORE asking for effort. Let them see the \"aha moment\" of your product first, then collect the data. Duolingo does this perfectly - you start learning immediately, profile setup comes after you're hooked.\n\nWhat's your product?",
          "score": 2,
          "created_utc": "2026-01-21 17:21:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1175vq",
              "author": "Great_Employment_871",
              "text": "credit card recommendations for Indian users, quite personalised to their use case i.e. travel, day-to-day,etc\n\nWhat card to take & how to properly use it",
              "score": 1,
              "created_utc": "2026-01-22 12:07:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ukja6",
          "author": "sarkhem",
          "text": "this hits hard. interviews lie, funnels don’t... polite feedback ≠ real behavior. most people won’t tell you they’re confused, they’ll just leave... synthetic testing before shipping actually makes sense. cheaper to break fake users than real trust... curious how close those personas matched real drop-offs though.",
          "score": 1,
          "created_utc": "2026-01-21 13:10:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ul9m2",
              "author": "Great_Employment_871",
              "text": "Yeah, exactly this, interviews are stories.  \nAnd “looks good 👍” is often just a softer version of “I’m out.”Synthetic testing feels obvious in hindsight but the real test is what you said at the end: how closely those personas mirrored actual drop-offs. If they caught even 60–70% of the failure points, that’s already doing real work.",
              "score": 1,
              "created_utc": "2026-01-21 13:15:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0uyxyu",
          "author": "fotowork3",
          "text": "This is where you earned your chops.  If you believe in something you have the choice of listening to everyone else or not.  And you shouldn’t be a founder if you can’t sort out who’s lying to you",
          "score": 1,
          "created_utc": "2026-01-21 14:29:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vriw9",
          "author": "Gullible_Brother_141",
          "text": "That phrase **'Code is reversible, but Belief is not'** hits hard. Most of us focus so much on the technical debt that we completely ignore the 'trust debt' we build with a buggy or confusing first experience.\n\nThe synthetic persona approach via Claude is interesting. One of the biggest issues with traditional user interviews is the 'Social Desirability Bias'—people want to be nice to the founder. AI, if prompted correctly, doesn't care about your feelings.\n\nCurious about how you structured your personas: did you feed them specific 'pain points' and 'friction thresholds' to make them drop off, or did you give them a goal and let them find the friction themselves?\n\nI feel like the next stage of growth hacking is definitely going to be about these pre-code simulations to protect the brand's 'trust equity'.",
          "score": 1,
          "created_utc": "2026-01-21 16:43:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qin1yb",
      "title": "Anyone else frustrated with competitor monitoring tools like me?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qin1yb/anyone_else_frustrated_with_competitor_monitoring/",
      "author": "kiruthivarma",
      "created_utc": "2026-01-21 03:36:54",
      "score": 5,
      "num_comments": 18,
      "upvote_ratio": 1.0,
      "text": "**The problem I keep seeing:**\n\nMost competitor monitoring tools are just send **dumb “page changed” alerts**.\n\nAnd the *good* AI insights are locked behind expensive enterprise plans with heavy limits on checks.\n\nI care about **what changed, why it matters, and what move I should take next.**\n\nSo the idea is a **competitor monitoring tool built specifically for startups, marketers & agencies**, not enterprises.\n\n**What it would do differently:**\n\n* AI-generated **actionable insights** when competitors change:\n   * Pricing pages\n   * Feature/docs\n   * Landing pages\n* Instead of “page updated”, you get: “Competitor increased price on Pro plan → opportunity to undercut or push value-led messaging.”\n* Auto-generated **sales battle cards** (field updates) based on competitor weaknesses\n* **Weekly client-ready reports** agencies can directly send (white-labeled)\n* Built for **higher monitoring frequency at affordable plans**\n\nBefore I sink months into building this, I want  **honest feedback from people like you guys**.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qin1yb/anyone_else_frustrated_with_competitor_monitoring/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o1of1xz",
          "author": "Similar_Run_7493",
          "text": "i can feed into your pain, possibly help you solve it.  \nget a licence for SEO spider the one with green frog.  \nnext discuss with claude, or chat or what not how to set up weekly monitoring of selected URLs on different domains, with screenshots, preserving HTML, JS rendering and tracking changes.\n\nThis might cost you \\~250 eur. and a day of research fun. But you get comparisons over time.\n\ni bet you can even use the LLM to make a script for you to export the HTML to some csv format and ask LLM what changed since last week",
          "score": 8,
          "created_utc": "2026-01-25 19:45:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1z21vd",
              "author": "kiruthivarma",
              "text": "Great Insights! I am also working on it, join the waitlist to stay tuned https://competitor.hywik.com",
              "score": 1,
              "created_utc": "2026-01-27 06:44:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1zfldi",
                  "author": "Similar_Run_7493",
                  "text": "i'm not that much in the issue anymore :)",
                  "score": 1,
                  "created_utc": "2026-01-27 08:43:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0svrmw",
          "author": "stovetopmuse",
          "text": "The frustration is real, but I think the hard part is not detecting changes, it is deciding which ones actually matter. Most teams drown in alerts because the signal to noise ratio is awful, even with AI summaries. The moment you promise “what move to take next,” you are implicitly making assumptions about positioning, market context, and goals that vary a lot by company.\n\nIf I were validating this, I would test whether people even trust automated recommendations versus just wanting cleaner diffing plus better context. A lot of operators I know still want to make the call themselves, they just want less junk and faster understanding. If that core problem is not nailed, the rest becomes expensive polish.",
          "score": 1,
          "created_utc": "2026-01-21 04:48:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0sxzpb",
              "author": "kiruthivarma",
              "text": "Thanks for your great insight man! It's a lot for me!",
              "score": 1,
              "created_utc": "2026-01-21 05:03:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0zen78",
                  "author": "stovetopmuse",
                  "text": "No worries!",
                  "score": 1,
                  "created_utc": "2026-01-22 03:28:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o10qs84",
          "author": "PlantainEasy3726",
          "text": "been there with those surface level tools and can’t stand them either, you should check out similarweb since it pulls in real actionable competitor insights and pairs market movements with recommendations, way more useful when you’re deciding next steps not just looking at raw changes, maybe worth a trial for your use case if you’re sick of dead-end alerts.",
          "score": 1,
          "created_utc": "2026-01-22 09:49:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1z2bmn",
              "author": "kiruthivarma",
              "text": "If you are interested, join the waitlist - https://competitor.hywik.com",
              "score": 1,
              "created_utc": "2026-01-27 06:46:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10t36s",
          "author": "Latter-Article1882",
          "text": "This hits home. A lot of monitoring tools stop at telling you something changed, but not whether it actually matters. For us, combining competitor changes with things like sentiment and brand mentions has been way more useful than raw alerts. Tools like Social Verdict helped add that context layer, but there’s still a big gap in turning competitor moves into clear next actions  so this idea definitely resonates.",
          "score": 1,
          "created_utc": "2026-01-22 10:11:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1z2i7u",
              "author": "kiruthivarma",
              "text": "Got your POV! Do companies have agencies to do track competitors? BTW, If you are interested, join the waitlist - https://competitor.hywik.com",
              "score": 1,
              "created_utc": "2026-01-27 06:48:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ieuty",
          "author": "GroMach_Team",
          "text": "Totally agree, knowing that they changed a page is useless; you need to know why (e.g., did they add a new h2 to target a specific entity?). I switched to running weekly gap analyses instead of daily alerts—it filters the noise and focuses on actual content strategy shifts.",
          "score": 1,
          "created_utc": "2026-01-24 22:33:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1z4bcg",
              "author": "kiruthivarma",
              "text": "If you are interested, join the waitlist - https://competitor.hywik.com",
              "score": 1,
              "created_utc": "2026-01-27 07:03:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1l1f5j",
          "author": "juliarmg",
          "text": "The frustration is real, many tools are gated. It need not be complex to run this, frankly. [humrun.io](http://humrun.io) can do this easily. The example page has many use cases, you can just set up a new monitor by describing in plain English.\n\nI tried:\n\n\"Check WEBSITE/pricing, focus on the pricing section.\n\nAlert me if prices, plans, or important text changes, and include a short summary of the impact, use AI.\"\n\nIt set up a code in no time and I set it to run every day.\n\nDisclaimer: I am the founder of the app. The app is in its early days, so would appreciate your feedback.",
          "score": 1,
          "created_utc": "2026-01-25 08:08:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1z4omz",
              "author": "kiruthivarma",
              "text": "Your product is GREAT! In my POV, you are trying to do more things in one product. It's good but seems like there is some miss in product focus. BTW, If you are interested, join the waitlist - https://competitor.hywik.com\n\nI AM SORRY, IF I AM HUNT YOU!",
              "score": 2,
              "created_utc": "2026-01-27 07:06:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1yuvqu",
          "author": "extracaramelplease",
          "text": "Yeah, that frustration is real, most tools just tell you something changed without telling you what to do next. With ads, I’ve seen this done better with GetHookd AI, where it doesn’t just show competitor ads but explains what’s working and helps you act on it, but there's still more to improve with these tools.",
          "score": 1,
          "created_utc": "2026-01-27 05:47:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1z562u",
              "author": "kiruthivarma",
              "text": "Yow, That's a big guy there! Thanks for your insights, BTW, If you are interested, join the waitlist - https://competitor.hywik.com",
              "score": 2,
              "created_utc": "2026-01-27 07:10:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qmp3r8",
      "title": "Help Needed to Grow my AI Self-Improvement Platform.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qmp3r8/help_needed_to_grow_my_ai_selfimprovement_platform/",
      "author": "Green_Illustrator101",
      "created_utc": "2026-01-25 17:18:47",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Hello everyone,   \nLooking at the current generation where people are suffering Emotionally, Mentally, Financially, Relationship etc.  \n   \nI have created an AI ED-Tech platform which helps people to grow by consuming summarised books and small wisdom content.   \n(The platform is completely free, link in my profile)\n\nI do have limited budget and mostly investing on building the platform and platform expenses. \n\nI am looking for, how to get my first customers.  \nIf anyone can guide me out that will be very helpful.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qmp3r8/help_needed_to_grow_my_ai_selfimprovement_platform/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o1oaudy",
          "author": "GrrasssTastesBad",
          "text": "Most founders burn cash on ads when they should be doing direct outreach. For this, you want hyper-targeted communities: mental health reddit threads, productivity discord servers, self-help facebook groups.\n\nYour real strategy is finding where your exact target user already congregates, then providing genuine value before mentioning your platform. I built Boost to help founders map these exact acquisition channels systematically at [aboo.st](https://aboo.st).",
          "score": 1,
          "created_utc": "2026-01-25 19:26:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1t7mh9",
          "author": "Spirited_Lunch3647",
          "text": "If you need beta testers, do let me know",
          "score": 1,
          "created_utc": "2026-01-26 13:02:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qo5tnc",
      "title": "Profound vs Promptwatch vs Peec for AEO?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qo5tnc/profound_vs_promptwatch_vs_peec_for_aeo/",
      "author": "Academic_Way_293",
      "created_utc": "2026-01-27 06:08:52",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I'm currently trying to research whether I go with either of the tree for tracking brand visibility and LLM performance. I tried Profound for two weeks but the cost seems a bit too steep for my business (growth costs 400 per month) and it feels like it's not worth the operational costs for what they do... Peec doesn't seem bad and Promptwatch has also been good so far.  \n  \nIf it matters, I run a midsize clothing store which is doing quite well, so I'm trying to make sure we're not invisbible to AI. The reason why I am looking into AEO/GEO specifically is because one customer said that they found our landing page after Claude cited us, so I'm looking to replicate that. Lmk your thoughts if you've tried any of these",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qo5tnc/profound_vs_promptwatch_vs_peec_for_aeo/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o1yy1kt",
          "author": "Background_Neck9690",
          "text": "Tbh the most I would pay for an AEO tool is 100-200, Profound costs way too much. Did you ever manage to ask the customer about which prompt you appeared in? That could be a good baseline for you.",
          "score": 1,
          "created_utc": "2026-01-27 06:12:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20gu7s",
          "author": "akash_09_",
          "text": "$400/mo can be pretty expensive, if I be honest... \n\nI'm not promoting here, but maybe you can checkout Amadora AI for free to test it as much more cheaper with better optimization details and action points. \n\nhttps://preview.redd.it/3zmbtzoi9wfg1.png?width=2490&format=png&auto=webp&s=dcd4e4f10bbcefc176cde59746460c7a707b40f1\n\nthe feature is ready but yet to launch which we'll be doing this week or next and might be immensely useful.",
          "score": 1,
          "created_utc": "2026-01-27 13:33:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qntqq8",
      "title": "Removed credit card requirement from trial signup. Signup up 340%. Conversion down 60%.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qntqq8/removed_credit_card_requirement_from_trial_signup/",
      "author": "whyismail",
      "created_utc": "2026-01-26 21:34:23",
      "score": 5,
      "num_comments": 2,
      "upvote_ratio": 0.86,
      "text": "I recently built a [personal branding tool ](https://brandled.app/)for founders.\n\nIn the first few months I struggled to get visitors.\n\nBut then my content started working and visitors were now longer a problem.\n\nBut now I wanted to do experiments to land on to best config or best conversions.\n\nHad credit card required upfront for free trial.\n\nConventional wisdom said this filters to serious buyers.\n\nSignups were low.\n\nConversion to paid was almost 38%.\n\n**Removed the credit card requirement.**\n\nMonth 1 results:\n\n* Signups: up by 340%\n* Conversions to paid: 15%\n* Net new customers: More users than trials that required credit card\n\nMore customers in absolute terms.  \nBut the math gets complicated.\n\nBut the math gets complicated. What I noticed: Support load exploded. Tire-kickers asking questions about things they'd never pay for. Trial abuse appeared. People creating multiple accounts to extend free usage forever. Most users were \"just looking around\" type.\n\nAnd as a product that use AI apis, it's pretty hard to sustain costs if you are bootstrapping.\n\nThe 15% who converted were often lower-intent. Higher churn in first 90 days.\n\nAfter understanding that I immediately shifted to card required 7 day trial.\n\nI am still figuring out some experiements,\n\nMaking the 7 day trial to 3 days or removing the trial itself.\n\nPlease share your thoughts and experiences with this...",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qntqq8/removed_credit_card_requirement_from_trial_signup/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o1zns23",
          "author": "Tommohawk",
          "text": "It's very typical for AI products.\n\nI wouldn’t recommend removing the credit card requirement unless you have a lot of money to burn, instead, implement a hard paywall.\n\nIf a user can’t convert, it’s likely an issue with your offer or product.",
          "score": 1,
          "created_utc": "2026-01-27 10:00:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zo143",
              "author": "whyismail",
              "text": "Yup, I feel that as a bootstrapped founder , it's a pretty bad decision.",
              "score": 1,
              "created_utc": "2026-01-27 10:02:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qnisrw",
      "title": "anyone else feel like AI video tools are just making us lazier?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qnisrw/anyone_else_feel_like_ai_video_tools_are_just/",
      "author": "InevitableSea5900",
      "created_utc": "2026-01-26 15:17:33",
      "score": 5,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "so i spent the last few months testing every AI video editor under the sun for my side hustle. figured i’d share the ones i’m actually gonna keep using in 2026, since most of them were either overhyped or straight-up useless.\n\nfirst off, if you’re still editing videos manually, you’re wasting time. but not all AI tools are created equal. some just slap a filter on your footage and call it a day. here’s what i’m sticking with:\n\n* **runway ml**: yeah, it’s pricey, but the green screen and rotoscoping tools save me hours. the AI cuts aren’t perfect, but they’re close enough to clean up fast.\n* **cliptalk pro:** this is my go-to for talking videos and short-form content. you drop in a script or product image, pick a format, and it generates a fully edited video with captions, b-roll, and a realistic AI voice in seconds. i used it for YouTube Shorts, TikTok, and Reels.\n* **pictory**: turns blog posts into videos in like 10 minutes. the voiceovers sound robotic, but it’s good enough for social clips.\n* **capcut**: free, fast, and actually decent for quick cuts. the AI captions are hit or miss, but it’s hard to complain when it’s free.\n\nwhat’s everyone else using?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qnisrw/anyone_else_feel_like_ai_video_tools_are_just/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o1u4113",
          "author": "OldDepartment9591",
          "text": "Yeah, honestly… kinda? I’ve been using one of those AI video tools and it’s wild how fast stuff comes together. But then I sit there like… okay, what do I actually want to say?\nIt’s like my brain has all these half-baked ideas popping up, but I don’t really bother turning them into anything, because the AI will do it for me. So maybe I’m “lazy,” but also… some of these half-thoughts are kinda genius if I just figure out how to shape them.\nMaybe AI isn’t killing creativity. It’s just giving us the freedom to be chaotic and messy and hope something sticks.",
          "score": 1,
          "created_utc": "2026-01-26 15:46:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1u6d9n",
              "author": "InevitableSea5900",
              "text": "Yes, I guess when we have the power to make anything we end up creating nothing because we have so many options now we don't focus on one.",
              "score": 1,
              "created_utc": "2026-01-26 15:56:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1u729x",
                  "author": "OldDepartment9591",
                  "text": "Yes… I guess it’s like when we can make anything now, we just… don’t. There’s too much. Too many options. And then we just stare at all of it and do nothing. Maybe we’d actually get somewhere if we just picked one thing. Or maybe not… who even knows.",
                  "score": 1,
                  "created_utc": "2026-01-26 15:59:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1ubdjp",
          "author": "Old-School8916",
          "text": "I use remotion, since it works with claude code. it works different than the others since it's very programatic.",
          "score": 1,
          "created_utc": "2026-01-26 16:18:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ul24s",
              "author": "InevitableSea5900",
              "text": "what kind of videos do you make with it?",
              "score": 1,
              "created_utc": "2026-01-26 16:59:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1vrgoa",
          "author": "DaniLatin",
          "text": "Is there any such AI tool that's good for videos in other, smaller languages?  \nFor example Slovenian?\n\nI tried Capcut but it doesn't really cut it.",
          "score": 1,
          "created_utc": "2026-01-26 20:00:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1wip5d",
              "author": "InevitableSea5900",
              "text": "I have used cliptalk and I think is supports most of languages including Slovenian.",
              "score": 2,
              "created_utc": "2026-01-26 22:01:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1wkad9",
                  "author": "DaniLatin",
                  "text": "Oh thank you, I must really try it then.",
                  "score": 1,
                  "created_utc": "2026-01-26 22:09:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1xk1mk",
          "author": "nikhilnarkhede",
          "text": "Yes AI tools do help in making videos. But my problem is they have to be fed with huge prompts to get the desired video.\n\nIt delivers 80% but we are not satisfied with the output. I make videos with invideo but now I am sure that I need to try other tools too as it's not giving me the desired results.",
          "score": 1,
          "created_utc": "2026-01-27 01:08:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1y9tkm",
          "author": "Latter-Law5336",
          "text": "runway is solid but yeah the price adds up\n\ncapcut for quick edits, creatify for product videos and ad creative. drop an image or script and it handles the rest\n\nare we getting lazier? maybe but these tools let you test way more ideas faster which is kinda the point\n\nwhat's your side hustle? curious what kind of content you're making",
          "score": 1,
          "created_utc": "2026-01-27 03:30:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zvyzh",
          "author": "ProgrammerForsaken45",
          "text": "I am using Truepix AI space agent for making space videos for my channel. I do my research , create script and then drop it in the agent , it creates full video with visual ,music , VoiceOver.",
          "score": 1,
          "created_utc": "2026-01-27 11:11:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qo8q4s",
      "title": "How do you reset your workload when everything is a mess?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qo8q4s/how_do_you_reset_your_workload_when_everything_is/",
      "author": "hardikrspl",
      "created_utc": "2026-01-27 08:59:06",
      "score": 5,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "When your backlog looks like a crime scene…  \nWhat’s your reset ritual?  \nA clean slate? A priority audit? A full day of cleanup?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qo8q4s/how_do_you_reset_your_workload_when_everything_is/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o2003jx",
          "author": "No_Boysenberry_6827",
          "text": "When everything's a mess, I do this:\n\n1. **Brain dump** - Write down literally everything that's on your plate. Don't organize, just dump.\n\n2. **Kill half the list** - Be ruthless. What actually matters for the next 2 weeks? Everything else gets deleted or delegated.\n\n3. **One thing per day** - Pick the ONE thing that moves the needle most. Do that first, before email, before Slack.\n\n4. **Timeblock recovery** - Block 2-3 hours of 'no meetings, no calls' time. Protect it like it's a meeting with your biggest investor.\n\nThe mess is usually a symptom of saying yes to too much. The reset is saying no to almost everything for a week.\n\nWhat's making your workload spiral right now?",
          "score": 2,
          "created_utc": "2026-01-27 11:44:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2069j3",
              "author": "hardikrspl",
              "text": "This is a strong reset framework. Killing half the list is the hardest but most freeing step. And protecting focus time like it’s non-negotiable is usually what stops the spiral from coming back. Saying no for a week often fixes months of chaos.",
              "score": 1,
              "created_utc": "2026-01-27 12:29:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o205a1p",
          "author": "Practical_Chicken889",
          "text": "My reset is plain and simple: stop everything.\n\nThen I put the backlog into one list and ask myself:\n\n- Does this move a metric I actually care about (sales, lead sign ups?)\n\n- Can this be automated, delegated, or deleted?\n\nThen I prioritize them in terms of Impact and ease of resolution, pack into siloed projects to finish and focus on only one of them.",
          "score": 2,
          "created_utc": "2026-01-27 12:22:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20p90q",
          "author": "pantrywanderer",
          "text": "When it gets that bad, I usually stop trying to be productive and just aim for clarity. I dump everything into one list, even the half baked stuff, then ruthlessly mark what actually moves the needle versus what just feels urgent. After that, I block a short window to knock out a few easy wins so momentum comes back. It is not a perfect reset, but it turns chaos into something I can reason about again.",
          "score": 1,
          "created_utc": "2026-01-27 14:17:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjyo90",
      "title": "What do you guys measure when AI makes the buying shortlist before traffic exists?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qjyo90/what_do_you_guys_measure_when_ai_makes_the_buying/",
      "author": "SonicLinkerOfficial",
      "created_utc": "2026-01-22 16:12:08",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 0.84,
      "text": "Something I’ve been thinking about more after watching how people around me actually use AI now.\n\nNot for broad stuff like **“best android phone.”**  \nFor **specific questions**. Things like:\n\n* “Are there ride-on lawn mowers in a mid-range price?”\n* “Which standing desk brands will ship replacement parts?”\n* “Is there a version of this product that works without a subscription?”\n\nThese are **narrowing questions**, not discovery.  \nThe kind people used to answer by opening 10 tabs but now just ask AI directly.\n\nAnd in a lot of those cases, **the user never clicks anything**.  \nThey just get an answer.\n\nThat’s where my head starts hurting a bit, because almost all of our KPIs assume a click happens somewhere.\n\nCTR, impressions, sessions, bounce rate. All of that only exists if someone lands on your site.  \n  \n**With AI in the mix:**\n\n* You can be evaluated without being visited.\n* You can be compared without being clicked.\n* You can be excluded without ever knowing.\n\nIf an AI decides your pricing is unclear, your variants are confusing, or your policies aren’t explicit, **you just don’t show up**.\n\nThere’s no obvious drop in impressions.  \nNothing looks broken in GA.\n\nThere’s a **selection step happening before traffic exists at all**.\n\nSo if SERP matters less here, **what the hell am I supposed to be looking at instead?**\n\nHonestly, I don’t have a great answer yet.\n\nMost of what I’m doing right now feels like rough spot checks and none of it scales well:\n\n* Asking very specific buyer-style questions and seeing if the store shows up at all\n* Checking whether pricing, shipping, or returns get stated clearly or come back as “unclear”\n* Noticing whether the product is framed as a real option or just mentioned as an alternative\n\nIt’s easy to read too much into a handful of examples, so I don’t love any of this as a metric.\n\nThe only thing that’s felt even mildly concrete is looking at **server logs**.\n\nNot as a performance KPI, more as a sanity check.  \nThings like a weekly or monthly look at:\n\n* Are AI-related crawlers hitting the site at all?\n* Which URLs are they actually requesting?\n* Do they reach product and category pages, or mostly bounce off JS-heavy routes?\n\nIt doesn’t tell you what the model understood.  \nBut if those crawls dry up, or never touch the pages that matter, that could be an early sign before it shows up in traffic or revenue.\n\nIn one case we noticed AI crawlers hitting blog pages regularly but never touching product pages.\n\nRight now this feels like the only experiment I can run before traffic actually moves.\n\nObviously traffic will always be important, humans still buy things.\n\nBut it seems like there’s now a **layer above SEO** that is separate from being clicked.\n\n**How are others handling this?**\n\n* Are you guys introducing new KPIs for this?\n* What else can I do to make sure this doesn't become the reason traffic drops in 3 months?\n\nPosting mostly because it feels like we’re still measuring the wrong part of the funnel and acting like nothing changed.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qjyo90/what_do_you_guys_measure_when_ai_makes_the_buying/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o15ohrc",
          "author": "kubrador",
          "text": "you're basically describing getting evaluated by an invisible jury that never visits your site. the server log thing is smart, at least you know if you're even in the room.\n\nbut yeah the real answer probably sucks: you'd need to actually monitor what these models return about you, which means either paying for access to their APIs or just... manually asking questions and hoping you're in the answer. there's no scalable metric here yet because the thing doing the selecting doesn't publish its reasoning.\n\nthe traffic drop in 3 months will just look normal until it doesn't.",
          "score": 1,
          "created_utc": "2026-01-23 01:29:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o171ld4",
          "author": "FixWide907",
          "text": "You touch an important part which most teams overlook.  With AI in the loop and as it continues to get better,  majority of growth strategy from a site perspective is no longer relevant.\n\nMy perspective is it will lead to the purchase happening using ai tools without even user visiting the site.  Chatgbt / Gemini may build on demand UI within chat showing all essential dynamic data so most users wouldn't even need to visit your site in the future primarily for self serve products. For high value most decision and comparison will happen using ai . No one going so sit and read those case studies or testimonials as all that will be ai summarized.\n\nSo focus should be on the technical side of the site and holistic marketing.",
          "score": 1,
          "created_utc": "2026-01-23 06:37:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qlr4mv",
      "title": "Our anonymous video chat platform hit 8k daily users yesterday",
      "subreddit": "GrowthHacking",
      "url": "https://i.redd.it/jodmhdqaobfg1.jpeg",
      "author": "Mental_Payment_941",
      "created_utc": "2026-01-24 16:16:59",
      "score": 4,
      "num_comments": 14,
      "upvote_ratio": 0.75,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qlr4mv/our_anonymous_video_chat_platform_hit_8k_daily/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o1gw68j",
          "author": "Dear-Aspect-6969",
          "text": "That's wild growth. I have my own startup too and SEO helped me gain a lot of footfalls. So many entrepreneurs ignore it, but it's the only thing that works for me. Congratulations to you",
          "score": 1,
          "created_utc": "2026-01-24 18:22:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1i5gnf",
              "author": "Mental_Payment_941",
              "text": "\nYeah if you get the correct backlinks, your platform can blow up like crazy.",
              "score": 1,
              "created_utc": "2026-01-24 21:48:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1h0nkf",
          "author": "Frustrated_Spirit",
          "text": "\n\nAll these 23k bans are IP bans or just account bans?",
          "score": 1,
          "created_utc": "2026-01-24 18:41:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1i41yq",
              "author": "Mental_Payment_941",
              "text": "\nIP bans. All offenders on Vooz are perm banned on their IPs",
              "score": 1,
              "created_utc": "2026-01-24 21:41:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1h70tt",
          "author": "Wooden-Ad-9894",
          "text": "I like online chats. But I get mad if someone skips me for no reason lol",
          "score": 1,
          "created_utc": "2026-01-24 19:08:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hay4o",
          "author": "harxuu",
          "text": "It's impressive that you've scaled your video chat platform to 8k new daily users! The use of AI moderation is a smart way to ensure a safe and engaging environment, which is crucial for maintaining user trust. Tailoring experiences by connecting users from the same city can enhance community-building and make the interactions feel more local and personal. To keep momentum, consider introducing unique features or events that encourage existing users to invite friends, thereby expanding your base through word of mouth. What challenges are you currently facing as you continue to scale?",
          "score": 1,
          "created_utc": "2026-01-24 19:26:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1i4lyi",
              "author": "Mental_Payment_941",
              "text": "\nModeration issues mainly. As we scale, more perverts come through too. We are currently amping up our AI filters and making them more efficient to filter and ban these perverts and keep people safe from obscenity",
              "score": 1,
              "created_utc": "2026-01-24 21:44:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1hb956",
          "author": "Alternative_Pilot786",
          "text": "\nThis motivated me to scale my app too. My app is declining in userbase recently. Thanks for this post, am gonna hustle harder",
          "score": 1,
          "created_utc": "2026-01-24 19:27:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1i4xnz",
              "author": "Mental_Payment_941",
              "text": "\nEvery platform hits a plateau at some point. You gotta do something new to spike again. Look into SEO, helped us a lot",
              "score": 1,
              "created_utc": "2026-01-24 21:46:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1hnerb",
          "author": "meowbhou",
          "text": "\n\nImpressive. How are you making sure you don't go down like Omegle? Anonymous chat space is filled with weirdos trying to show their dicks the first chance they get. How do you plan to keep them out?",
          "score": 1,
          "created_utc": "2026-01-24 20:22:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1i54mf",
              "author": "Mental_Payment_941",
              "text": "\nOmegle had zero moderation. We have super strict AI moderation. If someone doesn't show their face on cam in a video chat, we redirect them to the homepage, and if you show your dong, we ban you permanently. Simple",
              "score": 1,
              "created_utc": "2026-01-24 21:46:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1j8861",
          "author": "NoCoconut5085",
          "text": "That’s incredible! Congratulations!",
          "score": 1,
          "created_utc": "2026-01-25 01:05:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1g6u0b",
          "author": "Mental_Payment_941",
          "text": "https://vooz.co \n\nHustling hard to make this the best social chat site on the internet!",
          "score": 0,
          "created_utc": "2026-01-24 16:31:17",
          "is_submitter": true,
          "replies": [
            {
              "id": "o1ilb5k",
              "author": "medazizln",
              "text": "Just opened the website from here and instantly got hit with this? lol\n\nhttps://preview.redd.it/fvuywc99pdfg1.png?width=495&format=png&auto=webp&s=bb790361a2a267a08de5e7057732a0c7f142dad4",
              "score": 1,
              "created_utc": "2026-01-24 23:06:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qj89i2",
      "title": "Most cold outreach advice is outdated",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qj89i2/most_cold_outreach_advice_is_outdated/",
      "author": "Kim-Tan-2991",
      "created_utc": "2026-01-21 19:52:39",
      "score": 4,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Cold outreach has changed. A lot. And most advice i see still sounds like it was written in 2018. Here’s what i had to stop doing to actually get replies:\n\n1. Stop leading with your product\n\nPeople don’t care about features. They care about what keeps them up at night. Once i reframed my intros to talk about a specific challenge, not the tool / service, replies went up.\n\nFor example, instead of:\n\n“Hi, we help you scale X”\n\nI tried:\n\n“Noticed your team added 3 new AEs - curious how you’re handling onboarding bottlenecks”\n\n2. Stop asking for a meeting in the first email\n\nPeople scroll past a demo ask faster than a cat video. The first touch now is about context + curiosity - a one-sentence nugget, smth valuable or specific. Ask for a call later when they’ve replied.\n\nOr “worth a chat?” could work.\n\n3. Stop blasting broad lists\n\nSending more doesn’t mean better. We shifted to meaningful signals - recent funding, hiring trends, pricing updates, product launches. and prioritized quality over volume.\n\nMy tech stack rn:\n\nApollo + Clay for leads\n\nPlusvibe for warmup + sending + followups.\n\nAre you still doing cold outreach in 2026?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qj89i2/most_cold_outreach_advice_is_outdated/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o0x3evy",
          "author": "PearlsSwine",
          "text": "spamming people always was, and still is, a lazy, short-sighted approach to marketing. unless you're selling fake cock pills.",
          "score": 1,
          "created_utc": "2026-01-21 20:16:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10bvhb",
          "author": "xffffkk",
          "text": "Strong take — especially the shift from “pitching” to leading with a real trigger.\n\nBut what finally moved replies for me wasn’t the contextual emails, but being much stricter about who I was emailing and why now.\n\nCurious how you’re tightening lead quality on your side, because that’s where most cold outreach still quietly breaks.",
          "score": 0,
          "created_utc": "2026-01-22 07:31:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qobaw7",
      "title": "starting out as a tour guide looking for tips from experienced guides how to sell tours online",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qobaw7/starting_out_as_a_tour_guide_looking_for_tips/",
      "author": "Potential_Force_4136",
      "created_utc": "2026-01-27 11:27:50",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "hi everyone! i am 28 and have spent last few years working as a guide at historic sites in lisbon, portugal, helping school groups and tourists explore the city. recently, i got my national tour guide license and want to start full time, running half day cultural walking tours and maybe themed food or small group tours.\n\nmy sister and i plan to do this together we share the same vision, motivate each other and brainstorm ideas as a team.\n\ni would love advice from experienced guides:\n\nwhich booking platforms work best tripadvisor, getyourguide, airbnb experiences, etc.?\n\nunexpected costs or lessons you wish you knew when starting?\n\nthanks in advance for sharing your experience!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qobaw7/starting_out_as_a_tour_guide_looking_for_tips/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o206aut",
          "author": "kubrador",
          "text": " your best bet is just listing on multiple platforms and seeing what sticks. getyourguide and viator are the obvious ones. unexpected cost: you'll spend weeks optimizing photos only to realize people just book based on price and reviews.",
          "score": 1,
          "created_utc": "2026-01-27 12:29:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}