{
  "metadata": {
    "last_updated": "2026-02-11 03:30:00",
    "time_filter": "week",
    "subreddit": "GrowthHacking",
    "total_items": 20,
    "total_comments": 139,
    "file_size_bytes": 164062
  },
  "items": [
    {
      "id": "1qvpwkp",
      "title": "I’ve hired over 1,000 influencers and spent millions. Here is the no-bs playbook.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qvpwkp/ive_hired_over_1000_influencers_and_spent/",
      "author": "borjafat",
      "created_utc": "2026-02-04 14:24:50",
      "score": 91,
      "num_comments": 34,
      "upvote_ratio": 0.94,
      "text": "If you want to scale your marketing with influencers but dont want to burn cash on bad deals, get scammed by fake bot views, or waste months listening to \"gurus\" who have never actually booked a sponsorship... then you might enjoy this.\n\nI work as a Marketing Director for a pretty big brand and I also run my own SaaS on the side. \n\nBetween the two, I've hired over a thousand influencers and spent millions in partnership dollars.\n\nHere is the brain dump on what actually works:\n\nYouTube longform first until you max out on youtube longform, dont do any other format. \n\nNothing beats the power of the attention spam and the direct CTA with link in description as longform does. \n\nIgnore all the gurus telling you to hire one million micro influencers on TikTok, even if you’re target audience is on TikTok/Reels, I guarantee there are also channels on youtube with longform videos for that same audience, dont waste your time don’t lose your sanity, do longform until there’s none else to partner with on that format.\n\nYou need to have a solid proven offer before you try influencers. Have scarcity in the CTA, like “First 1,000 people to click the link get this special offer”\n\nTest 60 second integrations vs fully dedicated videos (more expensive). Have them put the 60 second promo in the first 5 minutes of the video to maximize eyeballs on your offer.\n\nBeware of scammers, several channels inflate their views and engagement with bots, look for suspiciously consistent high views across all videos, look for repeated and sometimes identical comments praising the influencer, too many emojis, and celebrities in the profile pictures even.\n\nIf you’re a startup strap for cash, you will want to push for commission only deals, for my startup Rebelgrowth, that’s 30% on every generated subscription for life, but in my experience most influencers don’t like performance deals even when they would be making more money in the long term, they dont know this so its your job to explain the math on why this is the case, make a simple spreadsheet, make a loom video, praise their last video, explain why you think your startup would be a great fit and explain why the commission offer is better than flat rate.\n\nHowever, if you’re an established startup/company with a budget, you’ll want to do flat rate deals because YOU will make more money in the long term as opposed to having to pay 30% of your revenue forever.\n\n30% of deals will succeed, those are the channels you will want to nurture and repeat and that will carry the whole effort, another reason why you need to stay away from flat rate as a bootstrapped startup, you can’ afford to have your first 10 deals fail looking for the 3 that will work. This is a numbers game.\n\nWhat I look for in a channel (this is less important when doing performance deals): Audience affinity; how relevant is the topic to your business, what are audience demographics (age, location, genre), how consistent are views across the last 12 videos, how often does the channel publish, what’s the engagement rate (high engagement = high conversions), I can afford more on a channel with 7,000 views but 15% engagement rate than a channel with 10,000 views but 5% engagement rate. Engagement is comments to subs (or views) rate.\n\nOn flat rates, always negotiate down aggressively, argue why with the channels using your analysis from the above paragraph. I personally look for sub $50 CPMs when doing flat rate (irrelevant when doing commission deals).\n\nTo find channels, ask your favorite AI chat to do “Deep Research” and find the top 100 channels that meet your preferred criteria. If doing commissions, aim for small channels to improve your chances of getting a “yes”, so channels with under 10k subs. You can also simply search youtube, or one of the millions of apps out there that have a youtubers database. Gather the list and then it's time to find the emails. I pay a guy on upwork $50 per 100 researched channels because youtube only lets you unlock 5 emails per day. This guy has a bunch of accounts he uses to unlock emails quicker.\n\nOnce you have the emails, use your favorite outreach tool to schedule 4 - 7 emails (the money is in the followups). Keep it simple, lead with “Paid sponsorhip?...” in the subject and first line of email copy so the influencer knows you’re down to business.\n\nHave dedicated landing pages per influencer or dedicated coupon codes or if you’re doing affiliate commissions it doesn’t really matter since they will have their affiliate link to your product anyways.\n\nYou’ll want to stay compliant if you’re a big company, which means making sure the influencer clearly discloses its a sponsorship when the Ad begins, have them put your logo as soon as they say the video is sponsored by your company.\n\nCheers,  \nBorja",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qvpwkp/ive_hired_over_1000_influencers_and_spent/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3jg8qe",
          "author": "Otherwise_Wave9374",
          "text": "This is a really solid brain dump, especially the part about longform first and having a proven offer before you pour money into creators. The performance vs flat-fee tradeoff is so real, most people dont do the math.\n\nCurious, when youre evaluating a channel, do you have a minimum view consistency threshold (like last 10 vids within X percent of avg)?\n\nAlso, weve been documenting a few SaaS marketing experiments and channel tests on our side if anyone wants extra reading: https://blog.promarkia.com/",
          "score": 3,
          "created_utc": "2026-02-04 15:01:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jiga3",
              "author": "borjafat",
              "text": "Yeah, I want to see views steady or trending up",
              "score": 1,
              "created_utc": "2026-02-04 15:12:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ldtlg",
          "author": "jf_sourced",
          "text": "Super helpful. We started this on LinkedIn and are now building out Youtube database / quotes / outbound. Only issue I've run into so far is that YT influencer prices are crazy high. Can you provide any estimates around, for instance, click through rate (website visitor per X views) so I can better understand the economics? Hard to justify some of these investments",
          "score": 3,
          "created_utc": "2026-02-04 20:23:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4nmt4x",
              "author": "pjbeans",
              "text": "What's your industry/ niche? Asking because I work for an influencer payments platform and dove into $1B in spend across brands/ agencies in 2025 and saw average payments by channel at:\n\n* **YouTube**: $2,228 average per payment\n* **TikTok**: $2,049 average per payment\n* **Instagram**: $1,429 average per payment\n\nSo YouTube was definitely right in line with other channels. That said, there are some YouTubers that command $50K a video (e.g. specialized tech influencers) but lots are charging $1K - $2K for an integration.\n\nHere's the full breakdown/ writeup: [https://www.lumanu.com/blog/breaking-down-1-billion-in-creator-payouts-2025-influencer-compensation-insights](https://www.lumanu.com/blog/breaking-down-1-billion-in-creator-payouts-2025-influencer-compensation-insights)",
              "score": 2,
              "created_utc": "2026-02-10 18:14:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4oa9bh",
                  "author": "jf_sourced",
                  "text": "Thanks - in the scholarly research space. Any metrics in that report that indicate unit economics (e.g. cpm)? Cheers",
                  "score": 1,
                  "created_utc": "2026-02-10 20:01:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3p1f8q",
          "author": "Alarming_Bluebird648",
          "text": "this is actually a goldmine for anyone starting out with creators. performance vs flat fee is such a massive debate in every growth channel i've worked in tbh. thanks for the real numbers man.",
          "score": 2,
          "created_utc": "2026-02-05 10:37:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jav8t",
          "author": "bubbascrub9793",
          "text": "Great share op! Quick question on the outreach emails do you follow up manually or are you using a tool for that? I feel like my follow ups always end up in spam.",
          "score": 1,
          "created_utc": "2026-02-04 14:33:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jb5k5",
              "author": "borjafat",
              "text": "Any of the famous tools will work. These emails are asking for money, they're not sales pitches so they shouldn't end in spam. Just dont include links until you're asked for it.",
              "score": 1,
              "created_utc": "2026-02-04 14:35:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jilqi",
          "author": "Then-Emphasis-3439",
          "text": "DM for all in one solution",
          "score": 1,
          "created_utc": "2026-02-04 15:12:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3joei5",
          "author": "Own-Moment-429",
          "text": "Solid advice man",
          "score": 1,
          "created_utc": "2026-02-04 15:40:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3josf9",
          "author": "professorhummingbird",
          "text": "Damn cheers mate. It’s been so long since I’ve seen actual good advice on Reddit. I’m used to AI slop everywhere. Great info and comes in timely. \n\nI’m experimenting with a different growth engine, easy to make short form videos related to my product. I wonder how it compares with working with longform influencers",
          "score": 1,
          "created_utc": "2026-02-04 15:42:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jtuxe",
              "author": "borjafat",
              "text": "Thank you, tel me about your shortform strategy",
              "score": 1,
              "created_utc": "2026-02-04 16:05:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jxl8v",
          "author": "MaxGarrod",
          "text": "Thanks for the post. What about instagram? That’s one I never managed to get my head around",
          "score": 1,
          "created_utc": "2026-02-04 16:22:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jxwd5",
              "author": "borjafat",
              "text": "Nope, stick to youtube longform until you can't grow there anymore.",
              "score": 2,
              "created_utc": "2026-02-04 16:24:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3kn9cq",
          "author": "Key-Boat-7519",
          "text": "Leaning hard into YouTube longform is the move here, especially for anything with a real consideration cycle or demo story to tell. The “max out longform before you touch other formats” rule lines up with what I’ve seen: one solid 60–90s mid-roll with a tight CTA in the first 5 minutes can beat a whole swarm of scattered shorts.\n\nOne thing I’d add is to track creator-level LTV, not just ROAS on the first campaign. The 30% of channels that work usually keep working if you treat them like a true sales channel: share conversion data back with them, test new hooks together, let them see which angles land.\n\nFor discovery, I’ve used things like Grin and Upfluence plus AI helpers like Pulse for Reddit to surface niche communities and talking points before I ever reach out, so the pitch feels way more “I get your audience” and way less copy-paste. This is all a volume game, but the compounding effect of a small stable of proven creators is where the real upside lives.",
          "score": 1,
          "created_utc": "2026-02-04 18:20:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mu9mw",
          "author": "Routine-Menu1950",
          "text": "Nice",
          "score": 1,
          "created_utc": "2026-02-05 00:51:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nnryd",
          "author": "skyler_outx",
          "text": "Great breakdown especially the longform-first approach and creator-level LTV point. Totally agree that treating proven creators like a real sales channel (and compounding relationships) is where the real upside is.",
          "score": 1,
          "created_utc": "2026-02-05 03:42:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3olch0",
          "author": "Branch_Live",
          "text": "So. I am making a SAAS. Are you suggesting I do a lot of my own long form videos to gain client trust ? \n\nSorry for the basic question .",
          "score": 1,
          "created_utc": "2026-02-05 08:03:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pmopc",
          "author": "Major_Fill_670",
          "text": "The \"30% success rate\" metric for influencer marketing is honestly brutal for bootstrapped teams. I learned this the hard way burning cash on partnerships where the creator was great, but my offer/angle just didn't land.",
          "score": 1,
          "created_utc": "2026-02-05 13:17:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q8gi3",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 15:15:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3s57fr",
          "author": "broduding",
          "text": "Great write up. Can you elaborate more on being wary of consistent high views across all videos? What would a normal channel look like to you?",
          "score": 1,
          "created_utc": "2026-02-05 20:34:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zipin",
          "author": "fur-seal",
          "text": "Wow, that’s very comprehensive. Thank you so much!",
          "score": 1,
          "created_utc": "2026-02-06 22:53:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42v1oy",
          "author": "jjd1226",
          "text": "Excellent insight. Do you have any recommendations for a 3rd largest community college in the us that is looking to expand in the southwest region? I’d love to hear your thought.",
          "score": 1,
          "created_utc": "2026-02-07 13:50:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nm5j4",
          "author": "pjbeans",
          "text": "This is a great brain dump and could definitely see it being the right playbook for the right brand/ industry\n\nI do not think: \"YouTube longform first until you max out on youtube longform, dont do any other format\" is a successful strategy for all verticals. However I do think it's a great strategy for many verticals - mind sharing which verticals you've had success with? ",
          "score": 1,
          "created_utc": "2026-02-10 18:11:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j9ynt",
          "author": "RealOrdinary1344",
          "text": "I need help on this let's connect",
          "score": 1,
          "created_utc": "2026-02-04 14:29:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ja40h",
              "author": "borjafat",
              "text": "Sure, Dm or [x.com/borja\\_obeso](http://x.com/borja_obeso) works for me",
              "score": 1,
              "created_utc": "2026-02-04 14:29:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3ksdvv",
                  "author": "Realistic_Extent283",
                  "text": "Followed you if that’s okay. I’ll need the help in future",
                  "score": 1,
                  "created_utc": "2026-02-04 18:43:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3p13fh",
          "author": "Ambitious_Mail_3392",
          "text": "This is a solid breakdown, especially on longform economics and deal structure. One thing I would add from the agency side is that the format matters less once creators stop being treated only as distribution.\n\nI work in growth at Darkroom, and a big shift we see is using creators as performance inputs, not just influencer placements. We run creator programs where UGC is produced specifically for paid media, TikTok Shop, and social commerce, not just posted once on a channel and forgotten. The same creator video can live as a YouTube integration, a TikTok Spark Ad, a Shop PDP asset, and a retargeting unit. That changes the math entirely.\n\nThis is why our work at Darkroom ends up sitting between influencer, creative, and paid media. We help brands build creator programs that are designed for scale, not one off posts. That includes sourcing and managing creators, producing UGC that is optimized for performance, integrating it into paid media and TikTok Shop flows, and using AI systems to speed up testing without removing human judgment. It does not feel like influencer marketing when it is done right. It feels like a growth engine that compounds over time.\n\nYouTube longform is still powerful for direct response, agreed. But TikTok creators become extremely valuable when they are paired with a strong offer, fast iteration, and paid amplification. That is where AI actually helps. We use it to scale creator sourcing, test hooks, and analyze which creators convert, but humans still decide who to double down on and why.\n\nThe biggest mistake brands make is thinking influencer marketing is about reach. The brands that win treat it like a performance channel with creative systems, repeatable creators, and tight feedback loops. Whether that starts on YouTube, TikTok Shop, or UGC for ads depends on the business model, not the trend.",
          "score": 0,
          "created_utc": "2026-02-05 10:34:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p1cpm",
              "author": "Ambitious_Mail_3392",
              "text": "Actually, our CEO - Lucas DiPietrantonio - once made a post about what most TikTokShops fail, I think it's worth a read, can give some more clarity on the creator/influencer side: [https://www.linkedin.com/posts/lucasdipietrantonio\\_brands-look-at-tiktok-shop-as-just-another-activity-7421593205340688384-LAen?utm\\_source=share&utm\\_medium=member\\_desktop&rcm=ACoAAC13iBsBzrXGhOnFWLK2TePNJmVuu9\\_ic0Q](https://www.linkedin.com/posts/lucasdipietrantonio_brands-look-at-tiktok-shop-as-just-another-activity-7421593205340688384-LAen?utm_source=share&utm_medium=member_desktop&rcm=ACoAAC13iBsBzrXGhOnFWLK2TePNJmVuu9_ic0Q)",
              "score": 0,
              "created_utc": "2026-02-05 10:36:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qxgg5a",
      "title": "1.9 Million Impressions from pSEO Tactics I learned from Pieter Levels",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qxgg5a/19_million_impressions_from_pseo_tactics_i/",
      "author": "Comfortable-Tell-192",
      "created_utc": "2026-02-06 12:36:09",
      "score": 38,
      "num_comments": 19,
      "upvote_ratio": 0.93,
      "text": "  \n\n\ni saw pieter levels talk about his seo strategy years ago and it completely changed how i think about organic growth.\n\nif you’re still manually researching every single keyword and staring at a blank screen wondering how to scale your organic traffic, you are likely struggling with a bottleneck that doesn't need to exist.\n\ni used to believe that the only way to get real results from SEO was to move slowly and handle every piece of the puzzle myself.\n\nFor my previous startup, i spent a massive amount of time coordinating with experts to build out a content library, and while the quality was there, the speed was not.\n\nToday, i use a more tactical programmatic approach to scale high-quality content without losing my mind.\n\nThe secret is building a \"variables\" spreadsheet.\n\nThink about a search term like \"best \\[tool\\] for \\[industry\\] in \\[location\\]\".\n\ni create a master template for the page structure and then swap out those variables.\n\nOne day i might generate 50 pages for \"Best SEO software for plumbers in Austin\" or \"Best SEO software for dentists in Miami\".\n\nThe content stays high quality because the core value proposition remains the same, but the specifics are tailored to the user's local intent.\n\nTo make this work, you have to help Google find all those pages.\n\ni always create a dedicated directory page with basically a simple index or \"hub\" that links out to every single one of these programmatic pages.\n\nThis allows crawlers to navigate the site easily without getting lost in a flat architecture.\n\nThen, i add the main pages of that directory to my sitemap.\n\nYou need to take the bots by the hand to help them learn your site\n\ni also focus on high-intent clusters, like comparison pages, where the structure of the information is just as important as the words on the page.\n\nGoogle and AI search engines are looking for clear, structured, and authoritative answers.\n\nThe strategy that changed everything for me was automating the keyword research and topical mapping first.\n\nOnce you have a map of every relevant \"how-to\" and \"alternative\" keyword in your niche, you can use AI to generate the first drafts of that content at a level of quality that used to take weeks to produce.\n\nOn every one of these pages, i track the performance with utm parameters and make sure the call to action is clear and low-friction.\n\nIt is much easier to grow a business when you have a predictable stream of organic traffic feeding into a proven offer.\n\nAnd if you mix this with \"free tools\" you can probably rank much faster\n\nHave you tried programmatic SEO or building free tools? i would love to check out your implementation\n\nMuch love\n\nAria",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qxgg5a/19_million_impressions_from_pseo_tactics_i/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3wfcw3",
          "author": "kubrador",
          "text": "\"i used ai to generate 50 variations of the same page and now i have 1.9m impressions\" is a wild flex but okay. pretty sure google's been actively penalizing this exact play for like 3 years but what do i know.",
          "score": 3,
          "created_utc": "2026-02-06 13:44:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w5z3x",
          "author": "gandalfthesupagrey",
          "text": "Can I see your implementation?",
          "score": 2,
          "created_utc": "2026-02-06 12:50:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w633d",
              "author": "Comfortable-Tell-192",
              "text": "sure [rebelgrowth.com](http://rebelgrowth.com/?utm_source=reddit)",
              "score": 1,
              "created_utc": "2026-02-06 12:51:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3w6s4h",
                  "author": "gandalfthesupagrey",
                  "text": "Thx",
                  "score": 1,
                  "created_utc": "2026-02-06 12:55:28",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3zp1le",
                  "author": "who_am_i_to_say_so",
                  "text": "Needs an http to https redirect, but thx.",
                  "score": 1,
                  "created_utc": "2026-02-06 23:29:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3w5vz2",
          "author": "gandalfthesupagrey",
          "text": "i’ve been staring at a blank content calendar for my app for 3 weeks and this just made it click for me. i was overcomplicating the \"high quality\" part thinking every post had to be a 3,000 word essay. The \\[tool\\] + \\[industry\\] template is a game changer. Thanks for the breakdown!",
          "score": 1,
          "created_utc": "2026-02-06 12:49:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xr6ak",
          "author": "Alarming_Bluebird648",
          "text": "pseo is such a gamble now with how fast google updates indexing. i’m surprised half of these pages even stick long enough to hit those numbers tbh",
          "score": 1,
          "created_utc": "2026-02-06 17:39:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3y39o1",
          "author": "AlexeyUniOne",
          "text": "nice one, but I don't really understand, when scaling pSEO pages how do you prevent keyword cannibalization and avoid Google seeing those pages as low value once you have hundreds of similar urls",
          "score": 1,
          "created_utc": "2026-02-06 18:36:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42qyi4",
              "author": "yl18",
              "text": "Are you seriously worried about \"keyword\" cannibization in 2026. No man.",
              "score": 1,
              "created_utc": "2026-02-07 13:25:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3zauk3",
          "author": "Used-Guarantee4431",
          "text": "Looks nice",
          "score": 1,
          "created_utc": "2026-02-06 22:11:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4290qa",
          "author": "PearlsSwine",
          "text": "If what you are saying works, why haven't you done it for your own site?\n\nLooking at your results in SEMRush, let's be honest, it's embarrassing. \n\nYou rank 1 for one keyword. \n\nYour organic traffic is awful. Your backlink profile is just spam. \n\nI'd fix up your own shop before you start making claims about how amazing this approach is. ",
          "score": 1,
          "created_utc": "2026-02-07 11:02:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4e4cp5",
          "author": "Fearless_Fox45",
          "text": "What I have observed that even well designed pSEO pages can rank well but never be cited by chatgpt or perplexity.. I have seen top ranking templated get ignored while using tools like RankPrompt, I have seen lower ranking pages with unique data are mentioned. If you want AI to truly see you content you must combine pSEO with well defined structure",
          "score": 1,
          "created_utc": "2026-02-09 06:23:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w6932",
          "author": "Background-Pay5729",
          "text": "pseo is a beast once it starts clicking but those \"best \\[x\\] in \\[y\\]\" templates are getting so saturated. google is for sure getting pickier about what they actually index vs what they just crawl and ignore these days.\n\nhub strategy is huge for this, but honestly adding actual unique data points to the variables is what makes the difference now. if every page is 95% the same text with just 3 words swapped it eventually gets flagged as thin content.\n\nalso tbf ai search like perplexity or searchgpt is changing the game since they actually parse the content to cite it. those programmatic pages gotta sound way more natural than they used to just to get picked up as a source. it's basically ai visibility optimization at this point lol.",
          "score": 1,
          "created_utc": "2026-02-06 12:52:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3w6lj4",
              "author": "Comfortable-Tell-192",
              "text": "Yes exactly, its why we distribute our content EVERYWHERE to build \"consensus\"",
              "score": 1,
              "created_utc": "2026-02-06 12:54:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3w6tom",
                  "author": "gandalfthesupagrey",
                  "text": "what's consensus?",
                  "score": 0,
                  "created_utc": "2026-02-06 12:55:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o42ydzc",
          "author": "Spacmonitor",
          "text": "I am using [https://wpautoblog.com](https://wpautoblog.com) and whoever said AI content doesn't rank is crazy",
          "score": 12,
          "created_utc": "2026-02-07 14:09:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyg5wu",
      "title": "Built 9 different product types in 2 years. Only 2 made real money. Here's what actually works for solo builders in 2026.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qyg5wu/built_9_different_product_types_in_2_years_only_2/",
      "author": "Emotional-Yak-8426",
      "created_utc": "2026-02-07 15:08:37",
      "score": 24,
      "num_comments": 11,
      "upvote_ratio": 0.92,
      "text": "Everyone says \"just build something.\" Spent 2 years testing 9 different product types to see what actually generates revenue for solo builders. Directories, templates, newsletters, courses, blogs, boilerplates, services, micro SaaS, and communities. Only 2 consistently made money without burning out. The rest either took too long or had terrible margins. Tested curated directories first after seeing Cyberleads make $500K annually and Theresanaiforthat monetize through listing fees. Built 3 directories in different niches. Revenue after 6 months was $340 total. The problem is everyone can copy your curation in hours. No moat. Listings dried up fast. Moved on.\n\nTried Notion templates next because Easlo makes over $1M annually selling them. Created 12 template packs. Made $890 in 4 months then sales stopped. Canva and Notion's built-in galleries made discovery impossible. Template marketplaces are saturated. Unless you have massive audience, templates don't work anymore. Started newsletter thinking I'd get sponsorships like others making $2K monthly. Grew to 2,400 subscribers over 8 months. Got zero sponsorship offers. Realized you need 10K+ subscribers minimum for brands to care. Quit because effort-to-revenue ratio was terrible. Built online course because Max Haining runs successful ones. Spent 6 weeks creating content. Sold 8 copies for $1,120 total. Course creation takes forever and selling requires huge audience or paid ads budget I didn't have. Not viable for bootstrappers starting from zero.\n\nWhat actually worked was micro SaaS and productized services. Built simple micro SaaS solving specific problem using boilerplate from FounderToolkit in 4 weeks. Hit $4,200 monthly revenue by month 3. Launched productized design service at fixed $2,500 per project. Booked 5 projects in 2 months making $12,500. Both had clear value propositions and customers willing to pay immediately.​ [Studied patterns in FounderToolkit database comparing 1,000+ builders across these product types](http://foundertoolkit.org). Micro SaaS and productized services had highest success rates for solo builders because they solve immediate painful problems, customers pay real money upfront, margins stay high, and moats exist through execution quality. Directories and templates are races to the bottom.​\n\nThe controversial truth is most product types work only if you already have audience. Micro SaaS and services work even starting from zero because you're selling solutions, not attention. Build products that solve problems customers pay for today, not products hoping for traffic someday.​\n\nStop copying product types that work for influencers with 50K followers. Build what works for solo builders with zero audience.\n\nWhat product type are you building? Does it actually work without existing audience?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qyg5wu/built_9_different_product_types_in_2_years_only_2/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o43b0r4",
          "author": "Mayur_Botre",
          "text": "This lines up with what I’ve seen too. Products that sell outcomes beat products that sell hope. Micro SaaS and productized services work because someone feels the pain today and is willing to pay now, even without an audience. Templates and directories only look easy because distribution is hidden in the success stories. Execution and speed matter more than the format.",
          "score": 1,
          "created_utc": "2026-02-07 15:18:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43bjzg",
          "author": "centurytunamatcha",
          "text": "The influencer copycat trap is real. people copy the output without copying the inputs (audience, credibility, timing).",
          "score": 1,
          "created_utc": "2026-02-07 15:21:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43c45k",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-07 15:24:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o43i124",
              "author": "Emotional-Yak-8426",
              "text": "Not dead, just audience-dependent. They work great after you have distribution, not before.",
              "score": 1,
              "created_utc": "2026-02-07 15:53:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o43d9r2",
          "author": "desisevil",
          "text": "$4.2k mrr in 3 months vs $340 in 6 months tells the story better than any opinion ever could.",
          "score": 1,
          "created_utc": "2026-02-07 15:30:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a5t5s",
          "author": "Existing-Board5817",
          "text": "I build in B2B space and I use outbound as main distribution channel  \nI use Starnus & Claude to do it on autopilot and at scale",
          "score": 1,
          "created_utc": "2026-02-08 17:16:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d51e6",
          "author": "Slight_Tutor1790",
          "text": "Something I rarely see mentioned here is how much faster learning happens when money changes hands early. Even small payments force clearer scope, tighter feedback, and fewer fantasy features. The formats that worked here are basically paid discovery loops. You get signal from day one instead of guessing for months. That alone can be the difference between momentum and burnout.",
          "score": 1,
          "created_utc": "2026-02-09 02:31:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0umiq",
      "title": "$1.3 Per Visitor with Zero Ad Spend",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r0umiq/13_per_visitor_with_zero_ad_spend/",
      "author": "Vegetable-Feed-9305",
      "created_utc": "2026-02-10 07:43:11",
      "score": 24,
      "num_comments": 13,
      "upvote_ratio": 0.94,
      "text": "For the past few months, I’ve been building my SaaS product completely solo. That means nights and weekends spent coding, marketing, and everything in between. No team, no virtual assistants, and no agencies, just me, my laptop, and plenty of coffee.\n\nThis past month felt like a real turning point for me. I got 2,150 organic visitors to my site, which led to 31 trial signups and ultimately 7 paying customers. That brought in $2,795 in revenue, which averages out to about $1.3 per visitor. And the best part is, I didn’t spend a single dollar on ads.\n\nSo, what made the difference? Let me walk you through the tools and strategies that really moved the needle.\n\nI used [Typedream](http://typedream.com/) to build my homepage and pricing pages quickly. It only took me about two hours, and everything was SEO-friendly and mobile responsive without any complicated coding or design headaches.\n\nFor backlink building, I relied on [GetMoreBacklinks.org](http://getmorebacklinks.org/). Manually submitting my website to hundreds of startup directories would have taken me around 20 hours, but with this tool, I did it in one click. My domain rating jumped from zero to six, and Google indexed my site in just four days, which gave me some crucial early momentum.\n\nTo support content marketing, I used [PostKit](http://postkit.pro/) to post two blog articles targeting keywords with low competition. One of those posts ranked in the top 30 search results within 10 days. I also kept a public changelog to show that the project is alive and active, which helped build trust and conversions.\n\nFor onboarding, I set up a simple five-step drip email sequence using [MailMaestro](https://www.maestrolabs.com/). I welcomed new users, shared helpful tips on features, highlighted testimonials, showcased a mini case study, and asked for feedback. This sequence played a big role in turning 31 trial users into paying customers.\n\nThe biggest lessons I learned are not to chase flashy tools but to pick simple, reliable ones that help you work without friction. Despite not being glamorous, directory backlinks are still effective. Slow and consistent growth beats flashy viral hacks. And most importantly, your goal should be revenue per visitor, not just traffic.\n\nIf you want, I’m happy to share email templates, blog outlines, and even the keywords I focused on. This month was my first time making real profit as a solo founder, and I’m finally starting to feel momentum.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r0umiq/13_per_visitor_with_zero_ad_spend/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o4kwsh2",
          "author": "Otherwise_Wave9374",
          "text": "Nice work, especially keeping it focused on revenue per visitor vs vanity traffic. The drip sequence + a couple low-comp SEO posts is such a repeatable combo.\n\nQuick question, what kind of intent were the two keywords (problem-aware vs product-aware), and did you see most trials come from those posts or from directories?\n\nIf its useful, we have a few SaaS content and onboarding notes here too: https://blog.promarkia.com/",
          "score": 2,
          "created_utc": "2026-02-10 07:59:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kvqfb",
          "author": "wprimly",
          "text": "That’s a strong solo stack.",
          "score": 1,
          "created_utc": "2026-02-10 07:49:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kw42o",
          "author": "bala523",
          "text": "$1.3 per visitor with zero ad spend is solid.",
          "score": 1,
          "created_utc": "2026-02-10 07:53:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kwu0j",
          "author": "Top-Statement-9423",
          "text": "What your trial-to-paid conversion rate was after the drip sequence kicked in? Did most upgrades happen early or near the end of the trial?",
          "score": 1,
          "created_utc": "2026-02-10 08:00:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ky7wb",
          "author": "Crescitaly",
          "text": "Solid breakdown and congrats on the first real revenue month. The $1.3 per visitor number is interesting because it highlights something most people overlook -- when you're not spending on ads, your traffic quality tends to be much higher because those visitors are finding you through intent-based searches.\n\n\n\nCouple things I'd add from similar experience:\n\n\n\nThe drip email sequence is doing more heavy lifting than most people realize. Seven paying customers from 31 trials is a 22% conversion rate, which is actually quite strong for SaaS. That tells me your onboarding emails are probably nailing the timing on when to showcase value vs when to ask for the upgrade. Would be curious what your email open rates look like across the sequence.\n\n\n\nOn the SEO side, the low competition keyword strategy is exactly right at this stage. Too many founders waste months trying to rank for competitive terms when there are hundreds of specific long-tail queries nobody is targeting. Two posts ranking in top 30 within 10 days is proof of that.\n\n\n\nOne thing I'd think about as you scale: the directory backlink approach works great for the initial authority boost, but it has diminishing returns. As you hit DA 10-15, you'll want to shift toward earning links from content partnerships and guest contributions on industry blogs. That's where the compounding really kicks in.",
          "score": 1,
          "created_utc": "2026-02-10 08:13:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l1ylx",
          "author": "Extra-Motor-8227",
          "text": "The $1.3 per visitor is actually solid for organic traffic. Most people obsess over vanity metrics like page views, but you nailed the one that matters. That conversion rate from trial to paid (23%) tells me you're solving a real problem people will pay for",
          "score": 1,
          "created_utc": "2026-02-10 08:50:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l3czg",
          "author": "Otherwise_Wave9374",
          "text": "Nice work, $1.3/visitor purely organic is solid.\n\nCurious, what % of those 2,150 visitors came from directories vs the 2 SEO posts, and did you see any meaningful trial-to-paid lift from the drip sequence (like pre vs post emails)?\n\nAlso +1 on focusing on revenue per visitor, way more grounding than vanity traffic. Weve been writing about simple SaaS marketing levers like onboarding emails and content here too: https://blog.promarkia.com/",
          "score": 1,
          "created_utc": "2026-02-10 09:03:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lhg2v",
          "author": "ArmOk3290",
          "text": "Not gonna lie, ranking top 30 for low-comp keywords in 10 days with just 2 posts is impressive. What's your content velocity plan? Because at this stage, consistency beats perfection - I'd rather see you ship 4 posts per month than obsess over 1 perfect one.",
          "score": 1,
          "created_utc": "2026-02-10 11:15:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lhz1q",
          "author": "Soft-Dragonfruit6447",
          "text": "Really solid breakdown love the focus on revenue per visitor over vanity metrics. The combo of low-comp SEO + a simple drip sequence feels very repeatable. Curious what kind of intent those keywords had and whether most trials came from the posts or directories.",
          "score": 1,
          "created_utc": "2026-02-10 11:20:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m764h",
          "author": "Lonely_Mark_8719",
          "text": "We’ve had better luck treating growth ideas as disposable experiments. Most ideas fail fast, a few show promise, and only one or two are worth scaling. Keeping tests small made it easier to stay honest about what was actually working.",
          "score": 1,
          "created_utc": "2026-02-10 14:06:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4noshx",
          "author": "Loschcode",
          "text": "Hey man, just a quick question, what tools do you use to spam Reddit with the fake upvotes and comments? I'm really curious because You're clearly that guy from GetMoreBacklinks that come and go all the time, but it seems it's actually working for you.\n\nDon't hesitate to DM, i'm genuinely curious.",
          "score": 1,
          "created_utc": "2026-02-10 18:23:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p3vyh",
          "author": "Key-Boat-7519",
          "text": "Focusing on revenue per visitor instead of “more traffic” is the real unlock here, and your numbers prove it.\n\nWhat you’ve basically built is a tight little funnel: intent-based traffic (low-comp keywords + directories), proof you’re alive (changelog), then a clean drip that does the selling. I’d double down by:\n\n1) Tagging trial users by source (directory vs blog vs direct) so you can see which channel actually produces those 7 payers.\n\n2) Testing one small upgrade in the drip: a “day 2” email that asks a single question like “what were you hoping this would fix?” – I’ve seen that one reply turn into better onboarding and upsell ideas.\n\n3) Spinning your best-performing email into a short Reddit-style post and seeing if it pulls similar intent here.\n\nI’ve used F5bot and SparkToro for this kind of “find people already in motion” approach, and pairing those with something like Pulse has helped me catch and reply to threads where folks are describing the exact pain my product solves.\n\nMain thing: you’ve got a working engine now, so it’s about instrumenting it, not adding more shiny stuff.",
          "score": 1,
          "created_utc": "2026-02-10 22:20:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwfabj",
      "title": "how we got 700 organic visitors in our first quarter",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qwfabj/how_we_got_700_organic_visitors_in_our_first/",
      "author": "Easy-Extension-6917",
      "created_utc": "2026-02-05 07:53:47",
      "score": 21,
      "num_comments": 11,
      "upvote_ratio": 0.83,
      "text": "Launched our startup in Amsterdam three months ago with typical EU bootstrap constraints. Small budget, no funding yet, competing against established players with years of SEO investment. Had maybe €500 total for marketing in Q1. Couldn't afford paid ads at European CPCs. Couldn't hire an agency at €2K+ monthly retainers. Needed a growth channel that would work on a tiny budget and compound over time instead of requiring constant spend. Put €100 into SEO foundation as the only realistic option. Used [directory submission tool to establish domain authority through directory submissions](http://getmorebacklinks.org) across EU and country-specific business directories. This was the cheapest way to build baseline trust without months of manual outreach. Then created 12 blog posts targeting problem-based searches in English and our local market language. Not promotional content but actual answers to questions our target customers were searching for. Things like \"how to solve X in Netherlands\" or \"best way to handle Y for EU businesses.\"\n\nMonth one looked discouraging. Directory listings went live slowly and no traffic appeared. This is the scary part of bootstrapping because you're watching your entire budget produce zero visible results while competitors are running ads. Month two is when things shifted. Domain authority moved from zero to 19. A few blog posts started appearing on page two for longtail keywords. Got our first 8 customers from organic search without spending another euro on acquisition.\n\nMonth three hit 700 organic visitors and 22 total customers from search. The €100 investment created a channel that keeps producing without ongoing spend. Compare that to paid ads where €100 might get 30 clicks that disappear immediately. The unit economics work completely differently. Customer acquisition cost from organic is basically zero after initial setup. Lifetime value is higher too because they found us through research instead of being interrupted by ads they didn't trust. Now four months in and organic is the primary growth channel. Still bootstrapped and lean but the SEO foundation means new content gets discovered without paid promotion. The budget constraint forced us into a channel with better long-term economics.\n\nThe EU startup lesson is you can't out-spend competitors but you can out-patience them. Work on channels that compound even if they're slower to start. When bootstrapping in Europe, optimize for leverage over immediate gratification.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qwfabj/how_we_got_700_organic_visitors_in_our_first/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3qh891",
          "author": "inboundmage",
          "text": "How is this link insert for a service is legit here? Just wondering. ",
          "score": 2,
          "created_utc": "2026-02-05 15:56:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3olyvp",
          "author": "ProfessionalLast4311",
          "text": "Nice call targeting both English and local language searches.",
          "score": 1,
          "created_utc": "2026-02-05 08:09:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3omi6e",
          "author": "Unlucky_Abroad7440",
          "text": "now that organic is working, are you planning to go deeper in NL first or expand into other EU markets next?",
          "score": 1,
          "created_utc": "2026-02-05 08:14:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pttjf",
              "author": "Easy-Extension-6917",
              "text": "we’re going deeper in NL first. once we really understand what converts locally and have those pages dialed in, expanding to other EU markets will be much smoother.",
              "score": 1,
              "created_utc": "2026-02-05 13:58:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ozo08",
          "author": "BrightMindFlow",
          "text": "Was the translation to local language worth the effort? Can you share the % of local language leads you got from that versus english?",
          "score": 1,
          "created_utc": "2026-02-05 10:21:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pi3i2",
          "author": "eventregistration",
          "text": "Its not looking safe at all. I think manual seo optimization and marketing will help a lot. Hire SEO professionals and get quality organic results.",
          "score": 1,
          "created_utc": "2026-02-05 12:48:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q51pz",
          "author": "Background-Pay5729",
          "text": "The problem with directory tools is usually the quality of the backlink profile long-term. You might see a quick jump in DR, but Google eventually catches on to those low-effort links if they aren't maintained or relevant.\n\nFocusing on those specific local problem-based keywords was definitely the smarter move of the two. In the EU everyone tends to over-optimize for English keywords and ignores the massive gap in local language search volume.",
          "score": 1,
          "created_utc": "2026-02-05 14:57:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q7l9h",
          "author": "sandropuppo",
          "text": "Smart move targeting problem-based searches in both English and Dutch - that dual-language approach probably helped you capture less competitive local keywords.   \n  \nCurious what your bounce rate looked like on those bilingual posts?",
          "score": 1,
          "created_utc": "2026-02-05 15:10:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p2rl9",
          "author": "PearlsSwine",
          "text": "It's sweet you think getting 700 people in three months is good.",
          "score": 0,
          "created_utc": "2026-02-05 10:49:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r12gkh",
      "title": "Using Meta Ads to hit $321,000 ARR in 6 months",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r12gkh/using_meta_ads_to_hit_321000_arr_in_6_months/",
      "author": "bubbascrub9793",
      "created_utc": "2026-02-10 14:38:34",
      "score": 16,
      "num_comments": 11,
      "upvote_ratio": 0.61,
      "text": "I sold my previous startup after growing it to 7 figures with Facebook ads.\n\nNow I am doing it again with my new project\n\nWe just hit $321,000 ARR.\n\nThe secret wasn't a complex algorithm hack or a magical audience list.\n\nIt was the offer.\n\nMost SaaS founders are stuck on the standard 14 day free trial.\n\nI think that is a mistake because there is no urgency.\n\nIn my previous company I used a free plus shipping model.\n\nI gave away crafting supplies and charged small shipping fees.\n\nThen I upsold them immediately.\n\nIt is easier to convince 10 people to pay a small amount than to get users to convert from a boring free trial.\n\nIt changes the relationship from a user to a buyer.\n\nFor Rebelgrowth I adapted this into two types of offers.\n\nThe first is the price hook: a 3 day free trial and the first month for just $9.\n\nThe regular price is $97 and kicks in on month two.\n\nThis works because it stops the scroll and catches people off guard.\n\nBut it doesn't have to be about discounting. In most cases you will actually want to avoid discounting because it attracts lower quality customers.\n\nThe second approach is a key differentiator.\n\nOur platform repurposes content into 13 social media platforms automatically. Something none of our competitors do.\n\nWhen your product solves a massive pain point like that, your ad becomes an easy sell.\n\nWhile we use programmatic SEO and YouTube influencers, Meta ads are our main engine.\n\nBut I see people overcomplicating them every day.\n\nHere is my exact setup.\n\nFirst, get your tracking right.\n\nYou need the Conversion API setup with a score of at least 6 out of 10.\n\nOptimize for the Subscription Paid event so Facebook finds actual buyers.\n\nSecond, stop messing with targeting.\n\nYour creative is your targeting.\n\nThe algorithm is smart enough to find your people if your ad speaks to them.\n\nI target broad.\n\nI start with the US and Tier A countries like the UK, Australia and Canada.\n\nI run only two campaigns.\n\nOne main campaign for cold traffic and one retargeting campaign to address specific objections.\n\nThe best ads for us are UGC style, 15 to 30 seconds max.\n\nThe hook is everything.\n\nI use AI tools to iterate on the hooks and reuse the core video.\n\nIf you have a winning ad just change the first 3 seconds.\n\nI have upsells in place like a $299 plan for higher service levels.\n\nEnough people take the upsell to cover the cost of the ads.\n\nYou need to know your numbers.\n\nI track everything in a spreadsheet: CPM, CPC, conversion rates, and churn.\n\nThis gives me the confidence to spend money because I know exactly when I will make it back.\n\nMost founders focus on the product and treat marketing as an afterthought.\n\nI think the offer and the funnel are king.\n\nFix the offer and the ads will work.\n\nCheers,  \nBorja from [rebelgrowth.com](http://rebelgrowth.com/?utm_source=reddit)\n\nP.s. if you need help figuring out a good offer or differentiating angle drop your project and I'll do my best to give some ideas",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r12gkh/using_meta_ads_to_hit_321000_arr_in_6_months/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o4n92x3",
          "author": "Crafty-Round7976",
          "text": "BRO IS THIS SUB LITERALLY JUST MOLTBOOK NOW?\n\nAre there any actual humans in this post or replies?",
          "score": 3,
          "created_utc": "2026-02-10 17:11:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4nponb",
              "author": "Loschcode",
              "text": "I'm human, all of the guys replying are bots, wondering what SaaS they use to spam the shit out of the subs like that though.\n\nMy eyes are bleeding since I joined this sub specifically, like there's basically no human and the posts are all fake.",
              "score": 2,
              "created_utc": "2026-02-10 18:27:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4pqn66",
          "author": "cuteman",
          "text": "lol bruh\n\n/u/ArmOk3290 \"Solid breakdown Borja...especially\"\n\n/u/Exotic-Ad-1573 - \"Super solid breakdown, Borja. Especially\"\n\nMy favorite part was how you used a couple of astroturfed accounts",
          "score": 3,
          "created_utc": "2026-02-11 00:25:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4moplw",
          "author": "c0ncorde25",
          "text": "Thats a solid run, hitting that kind of ARR in six months shows how powerful paid channels can be when dialed in. The key takeaway is how fast testing and iteration can compound results.",
          "score": 1,
          "created_utc": "2026-02-10 15:36:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mz6ql",
          "author": "Exotic-Ad-1573",
          "text": "Super solid breakdown, Borja. Especially the part about \"Creative is targeting.\"\n\nI took the complete opposite route for my SaaS (**Fyndr**) because I'm bootstrapping with $0 ad budget.\n\nInstead of creating demand with Ads (interrupting the scroll), I built a tool to capture existing demand (finding people on Reddit/X who are already asking \"What is the best alternative to X?\"). It uses AI to draft the reply, but I validate it manually to keep it human.\n\n**I'd love your take on the Offer:** Currently, I just do a standard SaaS subscription (Free Tier -> Paid Tier). Since my tool requires \"work\" from the user (they have to approve the replies), do you think a \"Paid Trial\" model like yours ($9 setup fee?) would work to filter out lazy users? Or does that only work for \"Done-For-You\" products?\n\nCheers!",
          "score": 1,
          "created_utc": "2026-02-10 16:25:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nrygw",
          "author": "Spacmonitor",
          "text": "Are you targeting desktop and mobile users or only desktop?",
          "score": 1,
          "created_utc": "2026-02-10 18:37:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ojatp",
          "author": "Old_Lab1576",
          "text": "The price Hook changed my mind actually",
          "score": 1,
          "created_utc": "2026-02-10 20:44:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pdk06",
          "author": "Sadpatte",
          "text": "I believe my product solves a massive pain point - but the issue is getting 3+ parties onto a platform to actually make the mvp work. + the audience is basically way to vroad in almost everOne who has an idea or business that supports it to become reality.  So my take is building it in public, vommunicating a big vision to attract top talent and then build it together, figuring everything out along the way. But toally open for ada that I can use to find the right talent as Its not that attractive to solve a issue for no money in the beginning so I really have to find a core emotional trigger that makes them want to build it",
          "score": 1,
          "created_utc": "2026-02-10 23:11:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ml8xv",
          "author": "ArmOk3290",
          "text": "Solid breakdown Borja - offer as the unlock is spot on, especially flipping trial fatigue to paid commitment early. $9 hook + $97 ramp is smart psychology (loss aversion post-low entry). Quick add: layer in LTV/CAC math upfront - our Meta campaigns targeted sub-paid too, but we cut creatives if ROAS <3x week 1. Churn spiked 15% from discounts initially, fixed with usage-gated upsells ($299 tier unlocked post-7 days active).\n\nFor retargeting objections, test 'problem-agitate-solve' hooks: 'Trials wasting your time? Here's why $9/mo closes faster'. Hit 4.2x ROAS broad US/CA/UK w/ UGC testimonials.\n\nCongrats on $321k ARR - what's your churn % on hooked users vs standard? [rebelgrowth.com](http://rebelgrowth.com) repurposing to 13 platforms sounds killer for agencies.",
          "score": 1,
          "created_utc": "2026-02-10 15:19:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4mlhd6",
              "author": "bubbascrub9793",
              "text": "Should I create white label plan for agencies?",
              "score": 1,
              "created_utc": "2026-02-10 15:20:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4mit87",
          "author": "Otherwise_Wave9374",
          "text": "The offer point is underrated, people obsess over targeting when the hook + promise is really doing the work.\n\nQuestion, how are you thinking about churn with the $9 first month angle, do you see a meaningful drop-off right after month 1, and do you handle it with onboarding or with a step-up offer?\n\nAlso +1 on tracking the boring stuff (CPM, CVR, churn) in a sheet. Thats usually what separates the folks who can scale from the ones guessing.\n\nIf anyone wants more SaaS marketing/offer examples, weve been collecting notes here: https://blog.promarkia.com/",
          "score": 0,
          "created_utc": "2026-02-10 15:07:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r04a8g",
      "title": "My learnings on cold email after sending 500k – in case helpful to any founders",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r04a8g/my_learnings_on_cold_email_after_sending_500k_in/",
      "author": "Acceptable-Essay-558",
      "created_utc": "2026-02-09 13:31:52",
      "score": 14,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "**NOTE**: You must have a product that someone wants. Otherwise none of this will work.\n\nWe run a cold email for a few Saas and service businesses, Ycom funded as well.\n\nIf done right, cold email can be the most reliable and predictable sales channel. Would love to share my lessons/tips if they can give anyone a head start.\n\nSome of this was obvious, a lot less so.\n\n**Offer**\n\nFriction is the death - reduce as much as possible. Dont as for people time - give them value. Something like \"Here's a free tool that solves your exact problem. Reply 'yes' and I'll send you the signup link\"\n\n**Warm-Up**\n\nBuy 6-10 separate domains just for outreach. Use variations of your brand. Warm them up on Instantly (keep this simple) - for more scale run 2 separate infrastructure sets, odd set and even set - they send on alternate days- but each has the ability to take on the full load if needed.\n\nWithout good deliverability - all the other effort goes to zero\n\n**Data**\n\nYou need good data and a lot of it.\n\nA. Export large set of filtered data from data source (e.g. Pitchbook, Crunchbase)  \nB. Identify key decision makers via Apollo  \nC. Cleanse email data with Reoon\n\nThen scrape each website and give it to ai to check ICP fit for the company and your offering - more than 10% of companies in your list will be mis-tagged by Apollo - it's important to weed them out at this stage to better deliverability and PMF. You can use clay here.\n\n**Some Quirks**\n\nThese are not make or break, rather they are all good to have - \n\nPlain text only. No HTML, no images, no fancy formatting.\n\nUse spintax for variety: {Hey|Hi|Hello} {{first\\_name}},\n\nTesting insight: Subject lines matter way less than you think for cold email, the first line matters 10x more.\n\nOnly metrics that matter - +ve reply rate and Inbox delivery rate\n\n**Start small. Test. Scale what works.**\n\nhopefully this helps (please upvote and comment so others can see)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r04a8g/my_learnings_on_cold_email_after_sending_500k_in/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o4fp8yu",
          "author": "Gullible_Brother_141",
          "text": "This is a masterclass in reducing **'Systemic Noise.'** Most people think cold email is a volume game, but your 500k send-run proves it’s actually a **Digital Logistics** problem.\n\nThe most underrated point here is using AI to verify ICP-fit by scraping websites. In my research on the **'Retrieval Loop,'** I’ve found that over 10% of entities are 'misunderstood' by automated databases (like Apollo) because their **Summary Integrity** has collapsed. By using AI to check the *actual* site content vs. the database tag, you’re essentially performing a manual **'Entity Triangulation'** before hitting 'send.' This is why your deliverability stays high—the relevance is mathematically solid.\n\nAlso, your 'Plain Text' rule is a great nudge toward **Asymmetric Firmness**. AI-driven inbox filters are becoming as sophisticated as LLM search engines; they’re trained to sniff out 'marketing posture' (HTML/images). Factual, boring, declarative text isn't just a choice—it’s a survival strategy to stay out of the 'Spam/Ignored' bucket.\n\n**Quick question on the 'Mis-tagged' data:** When the AI flags a company as a bad fit despite the database saying otherwise, is it usually because of **'Adjective Creep'** (the company uses vague language on their site) or just outdated 'dark data' in the source?\n\nAppreciate the 500k-scale reality check!",
          "score": 1,
          "created_utc": "2026-02-09 14:16:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fpl0g",
              "author": "Acceptable-Essay-558",
              "text": "It's usually because companies like Apollo would have multiple tags for the same company. For example, we are looking for manufacturing firms, companies that do IT services will also show up purely because of mis-tagged and mismanaged data. To weed that out, we use AI and a website scrape of theirs. If you keep your prompt tight enough, you usually weed out the bad data with great accuracy. ",
              "score": 2,
              "created_utc": "2026-02-09 14:18:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4gm7lj",
          "author": "Fun-Permission-2717",
          "text": "Biggest unlock you’re hinting at here is: treat cold email like an ops system, not a copywriting exercise. Most people obsess over clever lines while sending junk data from a burnt domain to a half–relevant ICP.\n\n\n\nOne thing I’d add to your data flow: after Apollo + Reoon, tag prospects by “moment in time” (just raised, just hired X role, just launched feature, etc.) and tailor the offer to that trigger. Same script, different angle, reply rates jump.\n\n\n\nAlso worth building a ruthless disqualification loop: if a segment underperforms after 2–3 micro-tests, kill it and re-route volume instead of “fixing” copy forever.\n\n\n\nFor finding fresh pockets of pain to turn into offers, I’ve used Clay plus LinkedIn Sales Nav, and lately tools like PhantomBuster; Pulse for Reddit is handy for surfacing threads where target buyers are already ranting about the exact problem you’re solving, which makes the “here’s a free tool” angle land way harder.\n\n\n\nSo yeah, ops + data discipline beats clever writing here.",
          "score": 1,
          "created_utc": "2026-02-09 17:01:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4izgj8",
          "author": "ultrathink-art",
          "text": "Technical infrastructure question: at 500k volume, what was your sending reputation management setup? Curious about:\n\n- Domain warming strategy (did you rotate domains, or build rep on a single one?)\n- IP pool management (shared vs dedicated, how many IPs?)\n- Bounce/complaint rate thresholds that triggered deliverability issues\n\nCold email at scale is as much infrastructure engineering as copywriting. The technical foundation (SPF/DKIM/DMARC, feedback loops, list hygiene automation) determines whether your message even reaches the inbox.",
          "score": 1,
          "created_utc": "2026-02-10 00:06:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jaq7t",
          "author": "ultrathink-art",
          "text": "The personalization at scale piece is the hardest part to crack. \n\nWhat worked for us: building a lightweight data pipeline that enriches leads before they hit the email sequence. Instead of generic \"I noticed your company\" lines, we pull actual signals—recent blog posts, tech stack changes (from BuiltWith/Wappalyzer), hiring patterns.\n\n**Technical tip**: If you're sending volume, set up proper SPF/DKIM/DMARC and warm your domain gradually. Start at 50/day for 2 weeks, then scale. We've seen teams burn through domains by going 0→500/day immediately.\n\nAlso: reply detection matters more than opens. If you're tracking engagement, monitor reply rates and time-to-reply. Those correlate with actual interest way better than open rates (which are increasingly unreliable post-iOS privacy changes).\n\nWhat was your tech stack for the sends? Curious if you rolled your own or used something like Lemlist/Smartlead.",
          "score": 1,
          "created_utc": "2026-02-10 01:10:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jknls",
          "author": "ultrathink-art",
          "text": "Solid learnings. The domain warming point can't be overstated - we've seen deliverability tank when people try to scale too fast.\n\nOne thing to add: **SPF/DKIM/DMARC is table stakes now**. If you're not set up properly, you won't even make it to the spam folder with Gmail/Outlook.\n\nAlso found that reply detection matters way more than open rates. Opens can be faked, replies are real signal. Build your enrichment pipeline to enable actual personalization (not just {{first_name}}), and watch for reply patterns.\n\nWhat's your tech stack for sending at that volume? Custom SMTP pool or service like Mailgun/SendGrid?",
          "score": 1,
          "created_utc": "2026-02-10 02:08:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jwdqq",
          "author": "ultrathink-art",
          "text": "500k emails is serious volume - great insights on the deliverability side.\n\nFor anyone trying to scale cold email, the infrastructure matters as much as the copywriting:\n\n**Deliverability at scale:**\n- SPF/DKIM/DMARC are table stakes (without them you're in spam)\n- Reply detection is the real signal (not open rates - those are mostly fake with privacy features)\n- Enrichment pipeline for genuine personalization - {{first_name}} is worthless, but mentioning their blog post or tech stack isn't\n\n**The question most people skip:** What's your actual tech stack for this volume? SMTP pools, Mailgun/SendGrid, dedicated IPs? And how do you handle reply routing at scale?\n\nThe 'send more emails' advice misses the engineering work needed to actually deliver 500k without getting blacklisted.",
          "score": 1,
          "created_utc": "2026-02-10 03:18:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k5tmj",
          "author": "ultrathink-art",
          "text": "500k cold emails is serious volume - curious about your deliverability infrastructure at that scale. What worked for you?\n\nThe standard advice (SPF/DKIM/DMARC, domain warming, dedicated IPs) is table stakes, but at 500k you're likely dealing with:\n\n- Reply detection as the real signal (not open rates, which are gamed/blocked)\n- Enrichment pipeline for actual personalization beyond {{first_name}}\n- Segment-specific messaging (not one blast to everyone)\n\nThe biggest lever I've seen: finding people with an urgent problem vs people casually browsing. Same copy, 10x different response rate depending on list quality.\n\nWhat's your tech stack? SMTP pools, Mailgun/SendGrid, or something custom?",
          "score": 1,
          "created_utc": "2026-02-10 04:19:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lm1x0",
          "author": "skyler_outx",
          "text": "This is gold. The big takeaway for me: cold email works when you treat it like an ops + data problem, not a copy problem. Clean targeting, real signals, and solid deliverability beat clever lines every time.",
          "score": 1,
          "created_utc": "2026-02-10 11:53:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pcxd2",
          "author": "rsvistel",
          "text": "Long time ago ran a cold outreach asking people for an advice/feedback on my saas\nReply rate was surprisingly high",
          "score": 1,
          "created_utc": "2026-02-10 23:08:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvz0e6",
      "title": "300 videos in 10 months and all of them failed at 300 views. Here's the execution flaw I couldn't see.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qvz0e6/300_videos_in_10_months_and_all_of_them_failed_at/",
      "author": "Leading_Leading_2114",
      "created_utc": "2026-02-04 19:55:37",
      "score": 13,
      "num_comments": 2,
      "upvote_ratio": 0.79,
      "text": "Ten months of daily posting. 300 videos. Every single one stuck between 200 and 400 views. Not one breakthrough. Not one that performed differently. Just the same dead result 300 times in a row.\n\nI'm completely burned out. Ten months of consistent effort and I'm still in the exact same place I started. Started thinking maybe I'm just fundamentally not cut out for content creation.\n\nWhat's destroying me is not understanding what's wrong. I watch my videos and they look fine. I watch successful creators and mine doesn't look drastically worse. But they're hitting 50k and I'm dying at 300 and I cannot see the difference.\n\nStarted thinking maybe the algorithm hates my account. Maybe I'm shadowbanned. Maybe I need to delete everything and start fresh because this account is clearly broken.\n\nTried changing everything over ten months. Different topics. Different formats. Different niches. Different editing styles. Nothing broke the pattern. Still 300 views regardless of what I changed.\n\nTen months of daily content with zero breakthrough and I couldn't identify what was actually killing me. Finally figured it out two weeks ago and everything changed. Now averaging 21k views. Here's what I learned.\n\n**300 failures means one pattern repeated 300 times not 300 different mistakes.** You have an execution issue you keep repeating because you can't see it. Mine was pausing for 2 seconds at second 9 in every video. That's one problem done 300 times. Find your one repeating pattern.\n\n**The algorithm isn't suppressing you your execution pattern is creating suppression-level results.** The algorithm would push your content if people watched it. People don't watch because something specific you're doing makes them leave. Fix that thing and distribution comes back immediately. You're not shadowbanned. Your execution is broken.\n\n**What you're repeating feels invisible because it's your natural creation rhythm.** Those 2 second pauses were just how I naturally spoke. My cadence. I couldn't see them as problems because they felt like me. To viewers they felt like the video stopping or dead air. That's your blind spot. What feels natural to you reads as broken to viewers.\n\n**Changing topics or styles doesn't fix execution timing issues.** I spent ten months changing content strategy when I needed to fix content execution. My topics were fine. My pause timing was broken. Changing topics 50 times didn't fix pause length. I was solving the wrong layer of the problem.\n\n**This is what finally broke me out after ten months and 300 failures.** I found [this app](https://taap.it/3WSYvTJ) and it showed me what I couldn't see for ten months. It analyzes your videos and tells you what's broken at exact timestamps with specific fixes. Second 9 pause 2.0 seconds visual static people left cut to under 1 second add movement. That diagnostic precision is what changed everything after ten months of guessing. Regular analytics showed retention dropping. It showed me the 2 second pause was why and exactly how to fix it. That's when I went from 300 views to 21k overnight.\n\n**One micro-execution fix can undo ten months of plateau.** Cut my pauses to under 1 second. Everything else stayed identical. Same topics. Same style. Just fixed the pause timing. Breakthrough happened immediately. Those 300 failures weren't wasted. They taught me everything except the one broken thing. Fixed that and everything clicked.\n\nLast 9 videos all over 19k. Same person who failed 300 times over ten months. Just stopped repeating the execution flaw I was blind to.\n\nIf you've been stuck for months with hundreds of failed videos you have one execution blind spot. Find it and everything shatters.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qvz0e6/300_videos_in_10_months_and_all_of_them_failed_at/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3qhev5",
          "author": "inboundmage",
          "text": "Thanks GPT for the very long post with link",
          "score": 1,
          "created_utc": "2026-02-05 15:57:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qw3ln6",
      "title": "The Free Tool Growth Hack",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qw3ln6/the_free_tool_growth_hack/",
      "author": "ChodeMcGee",
      "created_utc": "2026-02-04 22:44:45",
      "score": 13,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "I've been in growth for 8 years, and I just realized something that should be obvious but isn't: we've been solving the wrong problem.\n\nEveryone talks about driving more traffic. More ads, more content, more channels. But the real bottleneck isn't traffic, it's intent. You can drive 10,000 visitors to a landing page and get a 1% conversion rate. Or you can build something that makes people want to give you their email.\n\nHere's what changed my perspective: free tools convert 5-10x better than landing pages.\n\nI'm not talking about lead magnets (PDFs, guides, etc.). I'm talking about actual tools that solve a real problem and deliver value before asking for anything.\n\n# The Problem with Static Landing Pages\n\nLet's be honest. A landing page is a promise. \"Use our product and you'll get X result.\" But people don't trust promises anymore. They trust proof.\n\nWhen you land on a page that says \"We'll help you optimize your landing pages,\" you scroll. You're skeptical. You've heard it before.\n\nBut when you land on a page that says \"Enter your landing page URL and we'll audit it in 30 seconds,\" something shifts. You're not reading a pitch, you're experiencing the value.\n\nThat's the gap. And it's massive.\n\n# The Free Tool Framework\n\nThe pattern I've seen work repeatedly follows this sequence:\n\nValue → Proof → Data → Relationship\n\nYou start by delivering something useful immediately. No signup required. The user gets a report, a score breakdown, an action plan based on their data. Something tangible.\n\nThen, you gate the detailed results behind an email. Now you have a lead who has already experienced the value of what you do. They're not a cold email—they're a warm, intent-rich prospect.\n\nFinally, you have enriched data about them (what they searched for, what their results were, what problems they have). This becomes your sales conversation starter.\n\n# Two Case Studies That Prove This Works (which I built for clients)\n\nCase Study 1: ai-pact.com (Compliance Audit Tool)\n\nI built a tool for a compliance consulting firm that audits websites for regulatory risks. Users enter their business email, the tool scans their site, and delivers a report in 30 seconds.\n\nResults:\n\n•1,000+ leads generated in 3 months\n\n•20%+ conversion rate (vs. 1-3% on their landing page)\n\n•30+ daily organic views (the tool became a SEO asset)\n\nThe tool was so useful that people started sharing it. Organic growth kicked in. The firm didn't need to pay for traffic because the tool became the traffic driver.\n\nCase Study 2: GrowthTrack.ai (Performance Audit)\n\nAn agency built a tool that analyzes landing page speed, revenue and conversion potential. It's a simple input (URL) → output (performance score + recommendations).\n\nResults:\n\n•1,500+ leads in 6 months\n\n•25% conversion rate\n\n•$0 spent on marketing\n\nThe tool was so useful that it became their #1 lead source. They didn't build it to make money—they built it to prove their expertise and capture high-intent leads.\n\n# Why This Works (And Why Most Companies Don't Do It)\n\nThe reason this isn't more common is psychological. It feels risky to give away value for free. But here's the thing: you're not giving away your product. You're giving away a sample of your expertise.\n\nWhen someone uses your free tool and gets real value, they understand what you're capable of. They've experienced your thinking. They trust you more than any sales pitch could ever create.\n\nThe second reason is execution. Most companies think \"free tool\" and immediately think \"lead magnet.\" They build a calculator or a template. But those don't work because they don't deliver real value—they deliver information.\n\nA real tool delivers an outcome. It solves a problem. It gives you something you didn't have before.\n\n# The Mechanics\n\nHere's what makes a free tool work:\n\n1. It solves a real, specific problem. Not \"improve your marketing\" but \"find out if you're underfunding maintenance\" or \"see how your landing page compares to competitors.\"\n\n2. It delivers value immediately. No signup required to see results. The user gets something useful before you ask for anything.\n\n3. It captures enriched data. You're not just getting an email—you're getting behavioral data about what they care about, what their problems are, what their metrics look like and you can send that all into your CRM.\n\n4. It's built to be shared. If the tool is genuinely useful, people will share it. This becomes your organic growth engine.\n\n5. It creates a natural sales conversation. Once someone has used your tool and seen their results, they want to know \"what do I do about this?\" That's your sales opening.\n\n# The Growth Flywheel\n\nOnce you have a tool, you can distribute it through multiple channels:\n\n•Launch: Product Hunt, Hacker News, relevant communities\n\n•Owned: Your email list, your website, your blog\n\n•Earned: People share it because it's useful (organic growth)\n\n•Paid: Retargeting people who bounced on your site, stale leads, or paid ads to drive initial traffic\n\nThe beautiful part is that each channel feeds the others. Organic growth reduces your paid costs. Paid traffic increases organic reach. Your email list becomes a distribution channel.\n\n# The Math (Conservative Estimate)\n\nLet's say you build a tool that gets 100 visitors per month (very conservative for something useful).\n\n•Conversion rate: 20% (people who use it and give their email)\n\n•Leads per month: 20\n\n•Leads per year: 240\n\nNow, let's say 10% of those leads eventually become customers (also conservative for warm, intent-rich leads).\n\n•Customers per year: 24\n\nThat's 24 customers from a single tool. If your average deal is $10K, that's $240K in annual revenue. If your average deal is $50K, that's $1.2M.\n\nAnd this is from a single tool. Most companies could build 2-3 of these.\n\n# Why This Matters Right Now\n\nThe growth landscape has changed. Paid acquisition costs are up. Ad platforms are less effective. Organic reach is harder to come by.\n\nBut the one thing that hasn't changed is that people will engage with something that's genuinely useful. A free tool that solves a real problem is one of the few things that still breaks through the noise.\n\n# The Challenge\n\nHere's the challenge: building a free tool requires a different skillset than running ads or writing content. It requires product thinking. It requires understanding your customer's problem deeply enough to build a solution.\n\nBut if you can do it, the payoff is enormous. You're not just acquiring customers—you're building a permanent asset that generates leads on its own.\n\n# Final Thought\n\nThe best growth hacks aren't about finding a new channel or a clever tactic. They're about understanding what people actually want and giving it to them.\n\nA free tool that solves a real problem is the closest thing to a growth hack that actually works long-term.\n\nWhat free tools have you built or seen work? Would love to hear what worked for you in the comments.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qw3ln6/the_free_tool_growth_hack/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qvdxsq",
      "title": "Best AI Visibility Company Recommendations Real-World Results?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qvdxsq/best_ai_visibility_company_recommendations/",
      "author": "sophiaturquoise7201",
      "created_utc": "2026-02-04 03:48:23",
      "score": 11,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "Lately, I’ve been seeing a lot of talk about AI visibility how brands can get mentioned or recommended inside AI tools like ChatGPT, Perplexity, and others, instead of just relying on Google search.\n\nHas anyone actually seen results from this like leads, brand mentions, or interest from customers?\n\nAlso, has anyone worked with companies like SearchTides, Zupo, or Bastion?\n\nI’m not looking for pitches, just honest experiences: what’s working, what’s hype, and if AI is actually influencing buying decisions yet.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qvdxsq/best_ai_visibility_company_recommendations/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o4ccq3q",
          "author": "Silent-Warthog-3192",
          "text": "The whole shift towards AI is a bit scary, but it's the future of marketing whether we like it or not. I started experimenting almost a year ago now, as I don't want to miss out on it. I did a few impressive hacks, but they only lasted a few weeks, and then I lost the AI rankings. I had a good month, so I risked it and partnered up with Ranketize to help me take it to the next level and focus on the long-term game, not quick wins that don't last. Now, they are handling it for me and I focus on my main priorities.",
          "score": 2,
          "created_utc": "2026-02-08 23:55:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hh6k8",
          "author": "Key_Data_4416",
          "text": "11 upvotes and 0 comment. I think all ppl are eager to know the answer lol",
          "score": 1,
          "created_utc": "2026-02-04 06:06:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hr5nd",
          "author": "Awkward_Ad_9605",
          "text": "That's an interesting question! When it comes to AI visibility specifically within Reddit, I've noticed that brands engaging directly with communities tend to see better results than those relying solely on traditional search methods.\n\nBy participating in relevant subreddits, sharing valuable content, and building karma, brands can organically create awareness and interest without the risk of being flagged for promotion. The key is to genuinely engage with the community rather than just push your product.\n\nI’ve worked on a project that focuses on automating this process while adhering to Reddit's rules. It's pretty eye-opening how much community engagement can enhance visibility on platforms like Reddit! If you're curious about specific tactics, I’d be happy to share what I've learned.",
          "score": 1,
          "created_utc": "2026-02-04 07:31:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jop6r",
          "author": "getcited",
          "text": "I've been tracking AI visibility shifts with [outwrite.ai](http://outwrite.ai), and it’s helped me see exactly where my brand gets cited or recommended within AI tools like ChatGPT. It’s not hype - using their platform, you can target the real questions driving AI answers and watch your presence grow beyond just Google searches.",
          "score": 1,
          "created_utc": "2026-02-04 15:41:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jykme",
          "author": "Alex00120021",
          "text": "yeah this is pretty real, AI visibility is definitely starting to matter for demand gen. I came across Brandlight (https://brandlight.ai) recently and it seems built specifically for this, gives you visibility into what AI tools are saying about your brand and helps you actually influence those mentions. From what I've read it's more than just monitoring, they help you figure out what content changes actually move the needle on getting recommended in AI answeres.",
          "score": 1,
          "created_utc": "2026-02-04 16:27:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kcx2e",
          "author": "hboregio",
          "text": "My honest opinion - you can't improve what you cannot track, so start tracking how you rank against your competitors, play around trying to find prompts your real users would use, see which generate more/less mentions, etc. For this, you have plenty of tools like [Cartesiano.ai](http://Cartesiano.ai), [Peec.ai](http://Peec.ai), [Otterly.ai](http://Otterly.ai), etc. - they pretty much offer the same.\n\nThe real struggle is that, just like SEO, influencing their results takes time and comes from honest, good, content, and this takes time.",
          "score": 1,
          "created_utc": "2026-02-04 17:33:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kfov8",
          "author": "trekkingsolo",
          "text": "I think you just need to be writing articles in the format that people are asking questions. You used to be able to search for shared chats from chatgpt to get an idea of what people are asking and how they are asking but openai locked down a couple of months ago. I'm curious as well on the results but case studies are hard to find",
          "score": 1,
          "created_utc": "2026-02-04 17:46:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3x2pd0",
          "author": "Background-Pay5729",
          "text": "tbf most of this \"ai visibility\" talk is just rebranded seo. perplexity and chatgpt aren't magic, they're just glorified scrapers that prioritize high-authority sites and structured data. if you aren't already ranking in the top 5 for a query, the ai is probably going to ignore you or cite a competitor instead.\n\nthe real results come from being the \"source\" of specific data. if you publish a unique study or a very clear \"how-to\" that gets indexed, you'll start seeing those citations pop up in answers. it's less about \"optimizing for ai\" and more about just having the most crawlable, authoritative answer on the web. i've seen some interest from it but it's definitely not a primary channel yet, more like a nice bonus if your content game is already solid.\n\nthose agencies you mentioned usually just do heavy content marketing and pr. it works because it builds the digital footprint the llm needs to see to trust you. i wouldn't expect a magic button where you pay a retainer and suddenly chatgpt is your biggest salesperson, it's a long game of just being everywhere at once lol",
          "score": 1,
          "created_utc": "2026-02-06 15:44:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a3f2v",
          "author": "TemporaryKangaroo387",
          "text": "haven't worked with those specific companies but been deep in this space for a while now\n\ntbh the biggest thing i've learned is that most \"AI visibility\" services are basically doing what you could do yourself -- just running prompts, checking if your brand shows up, and then trying to figure out what content changes influence it. the hard part is that there's no real feedback loop yet. like with SEO you had search console, you could see impressions and clicks. with AI mentions you're kinda flying blind on actual impact.\n\nthat said, i have seen real signals. ran an audit on ~150 saas brands recently and the ones showing up in chatgpt/perplexity responses had a few things in common: super clear positioning language on their site, consistent entity descriptions across the web, and a lot of them were mentioned in comparison/listicle content that LLMs seem to love citing.\n\nthe companies charging $5k+/month for this feel premature to me. you can start tracking it yourself with a spreadsheet and 30 min a week of running prompts. save the money until the measurement layer actually matures\n\nis your brand b2b or b2c? that changes a lot about which AI models matter",
          "score": 1,
          "created_utc": "2026-02-08 17:05:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dqjrh",
          "author": "xtomleex",
          "text": "Full disclosure I work on GeoRamp so take this with a grain of salt.\n\nGeoRamp tracks mentions across ChatGPT, Claude, Perplexity, AI Overviews. Shows trends over time so you can see if your visibility is growing or dropping.\n\nThere's also Profound and Otterly in the space with different approaches. Depends what you're optimizing for.\n\nWhat's your main goal? Tracking mentions or actually improving where you show up?",
          "score": 1,
          "created_utc": "2026-02-09 04:37:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gqpi6",
          "author": "TemporaryKangaroo387",
          "text": "so ive been tracking this for a few months now with actual client data and heres what i can say\n\nthe short answer: yes its real, but its early. most of the \"results\" people talk about are brand mention tracking, not direct lead attribution yet. like you can see your brand getting recommended by perplexity in a specific category, but tying that to actual revenue is still messy\n\nhavent used SearchTides or Zupo specifically but ive tested a bunch of the monitoring tools. the ones that actually work let you track mentions across multiple AI engines (chatgpt, perplexity, gemini, claude etc) and show you sentiment + accuracy of what the AI says about you. thats the part people miss -- its not just \"are you mentioned\" but \"is the AI saying correct stuff about you\"\n\nwe ran a report on 150 SaaS brands recently and found that like 73% are basically invisible to AI assistants. the ones that do show up tend to have strong structured data and citation authority, not just good SEO\n\nhonestly the biggest thing thats working right now is just knowing WHERE you stand. most brands have no idea what chatgpt says about them and then theyre surprised when competitors get recommended instead\n\nwhat industry are you in? the results vary a ton by vertical",
          "score": 1,
          "created_utc": "2026-02-09 17:23:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4obhz1",
          "author": "TemporaryKangaroo387",
          "text": "been testing a few of these over the past couple months. tbh most of the \"AI visibility\" agencies are just reselling dashboards and charging 5k/mo for it\n\nwhat actually moved the needle for us was tracking which LLMs mention our brand vs competitors, then reverse engineering why. like we found out Perplexity was citing a competitor 3x more just because they had better structured data on their site\n\ntools wise -- vectorgap.ai has a solid free audit if you just want to see where you stand. peec ai is decent for tracking but pricey. otterly is more prompt-focused\n\nhonestly the space is still super early, most companies dont even know this is a thing yet. whats your use case, are you b2b saas or more ecomm?",
          "score": 1,
          "created_utc": "2026-02-10 20:07:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pbxn5",
          "author": "TemporaryKangaroo387",
          "text": "been testing a few of these over the past couple months. honestly the space is still pretty early but some tools are legit\n\nwhat actually matters imo:\n- multi-LLM coverage (chatgpt alone isnt enough, you need perplexity gemini claude etc)\n- prompt-level tracking, not just \"are you mentioned\" but for WHICH queries\n- competitor comparison so you can see where you show up vs them\n\nive been using vectorgap.ai and its been solid for the monitoring side -- tracks across like 6-7 models and gives you a breakdown of how each one talks about your brand. the perception analysis is interesting too, like it shows you what adjectives/sentiments the LLMs associate with you\n\nfor actually improving visibility tho, the big levers are still content quality + being cited by authoritative sources + structured data. no tool is gonna magically make chatgpt recommend you if your content isnt there\n\nre: SearchTides and Zupo -- havent used them personally so cant speak to those. whats your use case exactly? like are you trying to monitor or actively optimize?",
          "score": 1,
          "created_utc": "2026-02-10 23:02:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzky4m",
      "title": "11 months and 330 videos stuck at 295 views. Turned out the fix was simpler than I thought",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qzky4m/11_months_and_330_videos_stuck_at_295_views/",
      "author": "Leading_Leading_2114",
      "created_utc": "2026-02-08 21:10:05",
      "score": 11,
      "num_comments": 1,
      "upvote_ratio": 0.79,
      "text": "Posting for eleven months straight. 330 videos live. Every one stuck between 210 and 380 views. Never breaking through. Started thinking maybe growth on this platform just isn't meant for me.\n\nI'm completely exhausted. Eleven months of daily effort and nothing's changed. Started believing maybe I'm missing some critical understanding that everyone else has.\n\nConvinced myself my account was permanently suppressed. That the algorithm flagged me as low quality early on. That maybe wiping everything and starting over was my only shot.\n\nThen I stopped guessing randomly and learned what actually kills retention. Went from 295 average to 84k in just under three weeks. These are the things I learned that made me improve my content:\n\n**Technical:**\n\n* Lighting has to be really good for the video to look professional. I was using natural light from windows thinking it was fine. It wasn't. Invested in actual lighting equipment and the quality difference was massive.\n* Clean audio is essential for credibility. Fuzzy or inconsistent audio makes people click away immediately. Upgraded my recording setup and people started watching longer.\n* Something visual needs to change every few seconds. I was using static shots for way too long. People got disinterested and scrolled. Started adding constant visual variety and they stayed engaged.\n\n**Social:**\n\n* Your first 2 seconds determine everything. I was starting with intros and context. People scrolled before I said anything worthwhile. Led with immediate value and they stayed.\n* Cut every pause shorter than comfortable. I was leaving gaps that felt natural in conversation. People lost interest during those moments. Tightened everything and retention jumped.\n* Deliver your point within the first 10 seconds. I was taking too long to get there. People didn't stick around. Front-loaded the value and they watched through.\n\n**Algorithmic:**\n\n* More uploads don't fix broken retention. I was posting twice daily hoping volume would help. It didn't change anything. Fixed retention first and then frequency started working.\n* Hashtags are nearly useless compared to retention. I researched tags carefully every time. Total waste. If the test audience doesn't watch your video hashtags can't save it.\n* The algorithm tests every video on a small batch first. If they leave early it stops there. Everything else you optimize is pointless until that batch watches.\n\nWhat helped me the most was using [this app](https://taap.it/liyjQBu). In 30 seconds, it tells me exactly what's wrong with my videos and what to change to get more views. Changed everything for me. Regular analytics showed problems but never how to actually solve them.\n\nLast 9 videos all over 81k. Same content style. Just fixed what was actually breaking retention.\n\nIf you've been stuck at low views for nearly a year you're solving the wrong problems.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qzky4m/11_months_and_330_videos_stuck_at_295_views/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qvkyn5",
      "title": "I wasted 6 months split-testing email copy. Turns out my targeting was garbage.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qvkyn5/i_wasted_6_months_splittesting_email_copy_turns/",
      "author": "Soft-Dragonfruit6447",
      "created_utc": "2026-02-04 10:22:52",
      "score": 10,
      "num_comments": 10,
      "upvote_ratio": 0.86,
      "text": "For 6 months I obsessed over email copy. Subject lines. First sentences. CTAs. I A/B tested everything.\n\nMy reply rate stayed at 1.2%.\n\nThen I looked at WHO I was emailing. I was targeting \"marketing managers\" at any B2B company. Completely generic.\n\nThe moment I switched to tracking specific buying signals (people posting about their current tools, complaining about competitors, asking for recommendations), my reply rate jumped to 8%.\n\nSame email. Same offer. Different audience.\n\nNow I only reach out to people who've shown intent in the last 30 days - either on LinkedIn, in communities, or via job changes.\n\nI use OutX to track keywords like \"looking for \\[tool category\\]\" or \"frustrated with \\[competitor\\]\" on LinkedIn. But you could also manually search LinkedIn, set Google Alerts, or lurk in relevant communities.\n\nThe real test: If you can't explain WHY this specific person needs your thing RIGHT NOW, your targeting sucks.\n\nWhat's your experience? Is your targeting tight enough or are you still spray-and-praying like I was?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qvkyn5/i_wasted_6_months_splittesting_email_copy_turns/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3ib1h9",
          "author": "PearlsSwine",
          "text": "if you think 8% is good, try not spamming people, but only mailing people you have permission to contact!\n\nI realise you're just spamming reddit to try and get the shitty spam tool cited, but I just had to let you know that if you stop spamming people, you'll get much better results.",
          "score": 2,
          "created_utc": "2026-02-04 10:37:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3icr0s",
          "author": "Developer_Akash",
          "text": "yeah this is the move. most people waste months optimizing the wrong variable. targeting beats copy every single time, and honestly it sounds like you cracked the code.\n\nthe intent angle is huge. one thing that helps us is catching those signals across more platforms at once. like Reddit and Hacker News have folks asking for tool recs all the time, and job postings mention pain points before LinkedIn does. manually tracking it gets messy fast though. if you're still doing a lot of manual searching, automating the keyword monitoring across communities saves a ton of time so you can focus on actually reaching out to the right people.",
          "score": 1,
          "created_utc": "2026-02-04 10:52:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ipo3f",
          "author": "e_ai_gabriel",
          "text": "This is the biggest trap in reach marketing. You can have the best text in the world, but if the timing is bad, it's no different from a spam strategy.\n\nLately, I've been applying this same logic to Reddit. People here tend to be more expressive about their specific problems than on LinkedIn, but finding these posts manually is a huge waste of time. I ended up creating a tool that automates this. It uses AI to track conversations with high engagement intent and alerts me the instant they happen. By the way, I found your post through one of my alerts just now. It's been a lifesaver for getting into discussions while they're still trending, instead of finding them three days later. It greatly speeds up the prospecting, approach, and sales cycle.",
          "score": 1,
          "created_utc": "2026-02-04 12:33:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ipscr",
          "author": "ruibranco",
          "text": "The 80/20 of cold outreach is always audience selection, not copy. Most people spend weeks wordsmithing subject lines when they should spend that time building better lists. Your intent signal approach is solid - job changes are another gold mine (new VP of Marketing in first 90 days is way more likely to evaluate new tools than someone who's been in the role for 3 years).",
          "score": 1,
          "created_utc": "2026-02-04 12:34:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jpe6b",
          "author": "ActivitySmooth8847",
          "text": "Targeting is everything. I had similar issues until I started using tools to find leads based on real signals like job changes or tool complaints.",
          "score": 1,
          "created_utc": "2026-02-04 15:44:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jyl8z",
          "author": "Humble-Food8889",
          "text": "def relate to this... went thru the same phase thinking the unlock was the copy when the real issue was who i was emailing to. what has clicked for me was moving to signal-based targeting instead of role-based e.g. generic title = generic problems. once i started filtering for \"why now\" with recent hirings, launches, role changes etc, replies went up. i don't track keywords on Linkedin tho but i use tools like Databar AI to pull in signals across org and contacts and to enrich leads first before outreach. big takeaways imo, copy can optimize conversion but targeting is the decider if conversion is even possible",
          "score": 1,
          "created_utc": "2026-02-04 16:27:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3klf9e",
          "author": "AlexeyUniOne",
          "text": "is this case about cold outreach via email or newletters?",
          "score": 1,
          "created_utc": "2026-02-04 18:12:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oihg5",
          "author": "stephan85",
          "text": "The main impact often comes from who you're talking to, not just how you say it. had a similar experience focusing on general \"SMB owners\" where reply rates were stuck.\n\n\n\nIt took a while to realize the broadness of the audience, not the pitch, was the problem. you could narrow down by looking for specific pain points mentioned in online forums or recent job changes that signal a need. Focusing on those intent signals usually makes a big difference.",
          "score": 1,
          "created_utc": "2026-02-05 07:36:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3palxo",
          "author": "Electronic_coffee6",
          "text": "this is such an important lesson and most people never figure it out. Chasing perfect copy when you're emailing the wrong people is like polishing a turd. One thing that helped me beyond intent signals was also focusing on *timing* with business lifecycle stages.\n\nNew businesses are usually in active buying mode for tools, services, contractors, etc. They don't have legacy vendors yet and they're actually looking for solutions right now instead of being locked into 3-year contracts. I stumbled onto SMB Sales Boost (https://smbsalesboost.com/) which gives you contacts for newly registered businesses.\n\nIt's basically a database of fresh SMB leads so you're reaching people who just started and are actively building their stack. The targeting becomes way tighter because you know they're in setup mode rather than just guessing based on job titles. Combining that kind of lifecycle timing with the intent signals you mentioned sounds like it would be pretty powerful.\n\nWay better than spray and pray for sure.",
          "score": 1,
          "created_utc": "2026-02-05 11:55:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3iaksq",
          "author": "PastComprehensive815",
          "text": "This is such a good reminder. Copy matters, but targeting matters way more. If you can’t explain why this person needs your product right now, you’re guessing. Intent beats personas every time.",
          "score": 0,
          "created_utc": "2026-02-04 10:33:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvvgl1",
      "title": "Growth hackers: cold email agency or automation stack?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qvvgl1/growth_hackers_cold_email_agency_or_automation/",
      "author": "grand001",
      "created_utc": "2026-02-04 17:50:09",
      "score": 10,
      "num_comments": 8,
      "upvote_ratio": 0.92,
      "text": "I love automation, but cold email has become more fragile than ever. Domains burn fast, spam filters evolve, and personalization at scale is hard. For those focused on growth experiments, is a cold email agency still a viable lever?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qvvgl1/growth_hackers_cold_email_agency_or_automation/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3nxrqq",
          "author": "forklingo",
          "text": "cold email still works, but it is way less forgiving than it used to be. whether you use an agency or your own stack, the real bottleneck is strategy and list quality, not tooling. agencies can help if you want speed and pattern matching, but they often run the same playbooks everyone else is running. automation stacks give more control, but only pay off if you are disciplined about testing, warming, and stopping fast when signals go bad. for experiments, i have seen better results treating cold email as one small channel and validating demand elsewhere first, rather than expecting it to carry growth on its own.",
          "score": 3,
          "created_utc": "2026-02-05 04:48:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kp9bd",
          "author": "Strange_Feedback_442",
          "text": "It really depends on your risk tolerance and how much time you have.\n\nIf you're burning domains fast, that suggests something's off with either your list quality, your email content, or your sending practices. Agencies *can* help with that, but you're paying a premium for their expertise.\n\nAutomation stacks give you more control, but also more responsibility. You gotta be willing to tinker and troubleshoot. What stack are you using? Maybe some tweaks there could improve deliverability.",
          "score": 1,
          "created_utc": "2026-02-04 18:29:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pgqa4",
          "author": "Infamous_Spite_7715",
          "text": "you're right that cold email is way more fragile now, but that's exactly why managed services can be worth it. I'd check out sales dot co at since they handle all the domain health and deliverability stuff so you dont have to babysit your stack.",
          "score": 1,
          "created_utc": "2026-02-05 12:39:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qikar",
          "author": "ActivitySmooth8847",
          "text": "Cold email agencies can still work but yeah, domains burn fast and filters get tougher. If you wanna keep testing fast, try building your own lists with tools like Socleads to get fresh leads from socials and maps. That way you control the data and can switch up your outreach without relying on an agency.",
          "score": 1,
          "created_utc": "2026-02-05 16:02:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3svzif",
          "author": "erickrealz",
          "text": "A good cold email agency can absolutely work if you find a trusted one that handles infrastructure properly. The deliverability challenges are real as hell, but they're not unsolvable. Our clients who succeed with agencies picked ones that manage the full technical stack including domain rotation, proper warmup, and constant deliverability monitoring.\n\nThe fragility you're describing usually comes from rushing infrastructure or cutting corners on list quality. Agencies that know what they're doing don't burn domains every few weeks because they're not blasting shit data at maximum volume. They ramp slowly, verify everything, and target tightly so the campaigns actually perform without trashing sender reputation.\n\nDIY automation stacks can work too but you're taking on all the complexity yourself. Most growth focused founders waste more time troubleshooting deliverability than the agency cost would've been. The decision comes down to whether your time is better spent building product or managing email infrastructure. If cold email is a core channel for you, paying experts usually makes more sense than becoming an expert yourself while trying to run everything else.",
          "score": 1,
          "created_utc": "2026-02-05 22:45:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vk5zm",
          "author": "pantrywanderer",
          "text": "Cold email can still work, but only if you treat it like a system, not a magic lever. Personalization, domain hygiene, and pacing matter way more than blasting lists. An agency can help with volume and compliance, but you lose control over testing and learning. For experiments, I usually prefer building a small in-house workflow first, prove the concept, track everything, then scale or bring in outside help if needed.",
          "score": 1,
          "created_utc": "2026-02-06 09:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zgm9u",
          "author": "Extra-Pomegranate-50",
          "text": "neither will save you if your domain authentication is broken. ive seen people burn through domains blaming the tool or the agency when the real issue was misconfigured SPF/DKIM/DMARC from the start\n\nbefore choosing agency vs automation, check your foundation first. most domains \"burn fast\" because the DNS records were never set up properly, not because cold email is dead\n\nonce the authentication is solid, automation stack makes more sense for growth hackers imo. you want control over the experiments, and agencies add a layer of abstraction that slows down iteration",
          "score": 1,
          "created_utc": "2026-02-06 22:42:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o493b0m",
          "author": "benandsons",
          "text": "Cold emailing “spray and pray” is a waste of time. Your conversion rate to an actual sale is effectively \\~0, and the downside is real: you burn domains, wreck deliverability, and poison inbox placement for future outreach.\n\nWhat works is targeted outreach. Do real research, write like a human, and email maybe **1–10%** of the volume you’d send with spray-and-pray—but with a **20–40% conversion rate to a meaningful next step** (reply, intro call, referral, or qualified meeting), because the message is relevant and credible.\n\nIt’s basically a digital version of the **traveling salesman problem**: you’re not trying to hit every door on the street. You’re trying to choose the smallest set of stops that produces the highest total return, with the lowest cost. High-volume cold email optimizes for motion. Targeted email optimizes for outcomes.",
          "score": 1,
          "created_utc": "2026-02-08 13:55:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r05dtq",
      "title": "I vibe coded and open sourced an SEO-optimized blog generator that goes from keyword to published post in a couple of minutes",
      "subreddit": "GrowthHacking",
      "url": "https://i.redd.it/u6ribkgq9hig1.png",
      "author": "Neither_Alfalfa6922",
      "created_utc": "2026-02-09 14:18:39",
      "score": 9,
      "num_comments": 4,
      "upvote_ratio": 0.91,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r05dtq/i_vibe_coded_and_open_sourced_an_seooptimized/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o4fys3h",
          "author": "Ok_Feed2000",
          "text": "Automation going crazy",
          "score": 2,
          "created_utc": "2026-02-09 15:08:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fz48r",
              "author": "Neither_Alfalfa6922",
              "text": "Yup these tools are getting scary good haha",
              "score": 1,
              "created_utc": "2026-02-09 15:10:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4j7izi",
          "author": "vaporeonlover6",
          "text": "dude, I was looking into this 2 days ago, couldn't reach a conclusion on what's the way to go for getting the keywords.\n\nso, does serpa works reliably? how it's been the results so far?\nthanks for sharing, I was about to pay the $40 subscription for another tool, guess I'm not xD",
          "score": 2,
          "created_utc": "2026-02-10 00:52:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4j9sla",
              "author": "Neither_Alfalfa6922",
              "text": "yeah serper is the best from the ones that i was looking into for a google search api (i also wanted to use them cus they have a generous free trial haha). i made a [youtube video](https://www.youtube.com/watch?v=g2Q__7Di4yg) walking through the whole process, maybe it will be helpful to you because i show how i use serper :)",
              "score": 2,
              "created_utc": "2026-02-10 01:05:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r0txna",
      "title": "What exactly is AEO and are there any good tools for it without huge costs?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r0txna/what_exactly_is_aeo_and_are_there_any_good_tools/",
      "author": "FoodFine4851",
      "created_utc": "2026-02-10 07:00:31",
      "score": 8,
      "num_comments": 18,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,\n\ni have been hearing AEO tossed around a lot lately in SEO circles, especially with all the ai search stuff picking up steam. from what i can tell it has to do with showing up in answer engines or something like that, but im still fuzzy on the details.\n\nour agency is trying to figure out visibility, the tools we have looked at so far are asking for $500+ a month just to track a handful of domains. \n\nhas anyone broken down what AEO really means in practice and more importantly, what tools give decent insights on month to month without locking you in? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r0txna/what_exactly_is_aeo_and_are_there_any_good_tools/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o4kruu0",
          "author": "Awkward-Chemistry627",
          "text": "great question. this is one of those areas where shared experiences are more helpful than blog posts.",
          "score": 3,
          "created_utc": "2026-02-10 07:13:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kqywv",
          "author": "Altruistic-Meal6846",
          "text": "would love to see more transparency from tool vendors on what data they’re actually using.",
          "score": 2,
          "created_utc": "2026-02-10 07:05:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lft7c",
          "author": "BeardedWiseMagician",
          "text": "AEO is basically just about making your content easy for AI systems to understand, trust and quote. In practice that means clear question-answer structure, tight definitions, up to date pages, strong internal linking and real brand mentions across the web. You do not need expensive tools early. You can track trends with Search Console, basic AI mention trackers and manual checks in ChatGPT/Perplexity. Most gains come from content structure and authority not tooling.\n\n\\-Jacob from Flowout",
          "score": 2,
          "created_utc": "2026-02-10 11:01:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ksap0",
          "author": "Head-Opportunity-885",
          "text": "the pricing issue you mentioned is real. a lot of platforms are positioning themselves as aeo first tools, but under the hood, many are repackaging existing data with a new label. paying $500+ a month only makes sense if you already have clear use cases and clients asking for this specifically.",
          "score": 1,
          "created_utc": "2026-02-10 07:17:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ksepk",
          "author": "Crescitaly",
          "text": "AEO is basically about optimizing your content so AI tools and answer engines pull from it when users ask questions. Think of it as SEO but instead of ranking on page 1, you're trying to be the source that AI cites in its responses.\n\n\n\nFrom what I've seen working with clients, the biggest shift is moving from keyword-stuffed content to clear, direct answers structured in a way that machines can easily parse. FAQ sections, structured data, concise definitions at the top of articles - that kind of stuff.\n\n\n\nFor tools, honestly most of the expensive ones are overkill for small agencies. I'd start by just tracking whether your content shows up in AI overviews manually, and use something like Semrush or Ahrefs (which you probably already have) to monitor featured snippet performance since there's a lot of overlap. The dedicated AEO tools charging $500+/month are still super early stage and most of them are just repackaging data you can get elsewhere.",
          "score": 1,
          "created_utc": "2026-02-10 07:18:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4la9ob",
              "author": "Semos-Cloud-21",
              "text": "Ahref only shows number of citations if you don't pay $7000 yearly... we still haven't found something that will give us good insights without paying so much...",
              "score": 1,
              "created_utc": "2026-02-10 10:11:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ksmb5",
          "author": "Consistent_Buddy_698",
          "text": "we have been treating it more like an extension of content strategy rather than a separate discipline, at least for now",
          "score": 1,
          "created_utc": "2026-02-10 07:20:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l0mdm",
          "author": "crawlpatterns",
          "text": "AEO is basically about structuring content so it can be pulled cleanly into answers, not just ranked as a blue link. In practice it looks a lot like good SEO fundamentals: clear questions, concise answers, strong internal context, and obvious topical authority. Most of the expensive tools are just repackaging SERP and feature tracking with new labels. You can get pretty far by manually tracking queries, watching how AI answers change, and tightening your content around intent clusters instead of chasing a new dashboard. I suspect tooling will catch up, but right now the strategy matters more than the software.",
          "score": 1,
          "created_utc": "2026-02-10 08:36:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l9gp0",
          "author": "TemporaryKangaroo387",
          "text": "so AEO is basically GEO (generative engine optimization) rebranded, depending who you ask. the core idea is the same though -- making sure AI systems like chatgpt, perplexity, gemini actually reference your brand when someone asks about your category\n\nthe $500+/mo tools are mostly doing one thing: querying LLMs with prompts related to your space and tracking whether you show up in the responses. some do it better than others but thats basically the game\n\nhonestly for an agency starting out you can do a lot manually. just ask chatgpt and perplexity your target queries once a week and track who gets mentioned. tedious but free, and itll tell you fast whether you even have a visibility problem worth solving\n\nthe things that actually move the needle in my experience: getting mentioned on third party sites (reddit threads, comparison articles, industry roundups), having original data that LLMs can cite, and making sure your site isnt accidentally blocking AI crawlers at the CDN level (more common than people think)\n\nwhat kind of clients are you tracking this for?",
          "score": 1,
          "created_utc": "2026-02-10 10:03:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lcq1o",
          "author": "PuzzleheadedWeb4354",
          "text": "AEO is essentially optimization for answers, not clicks. you structure content so that LLM and search AI can easily extract direct, verifiable fragments (FAQ blocks, clear definitions, diagrams, entities, brand authority). In practice, many people overestimate \"new AEO tools\" - a basic stack like GSC + Bing Webmaster + log analysis + brand mention/citation tracking already gives you strong monthly views without spending $500+. Paid trackers now sell \"narrative\" more than unique data, so first build your own visibility metrics in AI responses, and only then decide if you need expensive software",
          "score": 1,
          "created_utc": "2026-02-10 10:33:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4llrey",
          "author": "skyler_outx",
          "text": "AEO feels like good SEO with a new name. Focus on clear answers, strong structure, and real brand mentions. You don’t need $500 tools to get started manual checks + Search Console go a long way.",
          "score": 1,
          "created_utc": "2026-02-10 11:51:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lw8ev",
          "author": "decebaldecebal",
          "text": "AEO is basically SEO but more conversation focus\n\nFor example, if your tool/product etc is mentioned as a helpful comment on Reddit in a relevant thread, it will be included by AI more easily than if you just made a blog post on some other platform mentioning your product.\n\nNot sure if there are any good tools for this yet. The best way would be to tell your customers to leave reviews and talk about your product...",
          "score": 1,
          "created_utc": "2026-02-10 13:04:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m71es",
          "author": "Lonely_Mark_8719",
          "text": "AEO is Answer Engine Optimization ... Instead of ranking, the goal is to have your brand or content chosen as the \"answer\" Google Search Console, AnswerThePublic, F5bot are some good tools without huge costs",
          "score": 1,
          "created_utc": "2026-02-10 14:05:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mc6ci",
          "author": "tv_rulesthenation",
          "text": "Using one wont make you no. 1 automatically tho, I hope the boss know that. Id recommend the one with the most features, like  Semrush AI visibility tool, Athena, Farse or Aiclicks. They are the ones that Ive used and helped me",
          "score": 1,
          "created_utc": "2026-02-10 14:33:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4midjk",
          "author": "getcited",
          "text": "I totally get how confusing AEO can be when AI search is evolving so fast. We've been using [outwrite.ai](http://outwrite.ai) to actually see which questions and prompts our brand is showing up for in AI answers without breaking the bank. It helped us create content that gets cited and track just how visible we really are month to month, which sounds exactly like what your agency needs!",
          "score": 1,
          "created_utc": "2026-02-10 15:05:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ngfn8",
          "author": "haiku-monster",
          "text": "AEO basically means audience/engagement/optimization stuff. One tool you can check out is AEO Engine AI, I've personally used it, they started out as an agency doing geo/AEO reporting for clients, and then built the software version so companies can track those reports themselves much faster instead of waiting on manual spreadsheets. I think AEO tools are still new and pricey at the moment.",
          "score": 1,
          "created_utc": "2026-02-10 17:45:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q3qgf",
          "author": "FoxtownMarketing",
          "text": "I’m sure there are some brilliant people who will chime in with more sophisticated approaches, but our clients are doing well by first focusing on traditional SEO and the AEO naturally follows without much extra effort. Don’t skip step one.",
          "score": 1,
          "created_utc": "2026-02-11 01:42:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qw1c58",
      "title": "OpenAI is giving up to $100K in free API credits (here’s how to get them)",
      "subreddit": "GrowthHacking",
      "url": "https://jpcaparas.medium.com/openai-is-giving-up-to-100k-in-free-api-credits-heres-how-to-get-them-3c06eb968c12?sk=80a7358dbbde5ea652a99e2504a38541",
      "author": "jpcaparas",
      "created_utc": "2026-02-04 21:19:34",
      "score": 7,
      "num_comments": 0,
      "upvote_ratio": 0.88,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qw1c58/openai_is_giving_up_to_100k_in_free_api_credits/",
      "domain": "jpcaparas.medium.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1qzd90s",
      "title": "ZoomInfo vs Apollo vs PDL (and a few others): Quick take for B2B prospecting in 2026",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qzd90s/zoominfo_vs_apollo_vs_pdl_and_a_few_others_quick/",
      "author": "Existing-Board5817",
      "created_utc": "2026-02-08 16:24:17",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I keep seeing “which data provider is best?” and honestly it depends on how you sell and how you plan to use the data. Here’s the short version after comparing the common options.\n\n**ZoomInfo**  \nBest if you’re running a more enterprise GTM/ABM motion and want deeper company intel.  \nDownside: pricing and contracts can be heavy for smaller teams.\n\n**Apollo**  \nGood if you want something that’s easy for reps to use and you also want outreach in the same place.  \nDownside: data quality can be hit or miss depending on market, and per-seat costs add up as you grow.\n\n**People Data Labs (PDL)**  \nStrong if you’re technical and want an API-first data source for automation, custom ICP filters, enrichment, and building your own workflows.  \nDownside: not really a “nice UI” tool. You need engineering/automation to get the most value.\n\n**Cognism**  \nWorth a look if you sell in EU/UK and care a lot about compliance and verified phone numbers.  \nDownside: tends to be priced for bigger teams.\n\n**Lusha**  \nUseful for quick enrichment when you already have a lead and want contact details fast (often via extension).  \nDownside: not ideal for building large lists from scratch.\n\n**Breeze Intelligence (Clearbit/HubSpot)**  \nMakes sense if you live inside HubSpot and want inbound enrichment and scoring.  \nDownside: less useful if your main goal is outbound list building.\n\nQuick rule of thumb I ended up with:  \n\\- Enterprise ABM: ZoomInfo  \n\\- Outbound + reps want a simple workflow: Apollo  \n\\- API + automation + custom filters: PDL  \n\\- EU/UK phone data: Cognism  \n\\- Quick enrichment: Lusha  \n\\- HubSpot inbound enrichment: Breeze\n\nSmall note: there are tools starting to sit on top of these providers and combine sources so you can do ICP search, enrichment, and scoring in one flow. Starnus is one of those and the one I've been using in the past few weeks.\n\nCurious to know about your perspective and which data sources you use for your outbound sourcing?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qzd90s/zoominfo_vs_apollo_vs_pdl_and_a_few_others_quick/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o4ez7t3",
          "author": "Not_Average78",
          "text": "Running outbound for multiple clients, we lean heavily on automation, and we’ve been using limadata alongside pdl in a few workflows. from a volume perspective, what mattered most to us was data cleanliness and consistency, not a fancy ui. titles, seniority, and company context were more reliable for our use cases, which made downstream scoring and routing way easier. it also helped that it was lightweight and cost efficient compared to some of the heavier providers.",
          "score": 1,
          "created_utc": "2026-02-09 11:18:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ncn65",
              "author": "Existing-Board5817",
              "text": "I use [starnus.com](http://starnus.com/), it manages everything for me",
              "score": 1,
              "created_utc": "2026-02-10 17:27:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4g4nds",
          "author": "ActivitySmooth8847",
          "text": "Good breakdown. One thing I’d add is for local SMB or niche list building, these databases can feel like overkill or just miss a lot of small business data. I’ve had better luck using SocLeads for pulling leads from Google Maps and socials when I need fresher lists by city and category, then running a separate verifier. Apollo is convenient, but I only trust it after I sanity check the segment and bounce rate.",
          "score": 1,
          "created_utc": "2026-02-09 15:38:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ncl0h",
              "author": "Existing-Board5817",
              "text": "I use [starnus.com](http://starnus.com), it manages everything for me",
              "score": 1,
              "created_utc": "2026-02-10 17:27:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qyapic",
      "title": "210 videos in 7 months stuck at 320 views then exploded to 6M followers in 4 weeks",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qyapic/210_videos_in_7_months_stuck_at_320_views_then/",
      "author": "Achroo",
      "created_utc": "2026-02-07 10:43:26",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 0.65,
      "text": "Seven months of daily posting. 210 videos. Every single one stuck between 230 and 410 views. Not one that broke through. Just the same failure repeated 210 times.\n\nI'm completely exhausted. Seven months of consistent daily content and I'm still in the exact same place. Started thinking maybe I'm just not good enough at this.\n\nWhat's killing me is I can't see what's broken. My videos look okay. I watch creators succeeding and mine doesn't look drastically different. But they're at 150k and I'm dying at 320.\n\nStarted thinking maybe my account is shadowbanned permanently. Maybe the algorithm has me flagged as low quality forever. Maybe I need to delete everything and start completely fresh because this account clearly doesn't work.\n\nTried everything over seven months. Different content types. Different topics. Different styles. Different approaches. Nothing changed the baseline. Still 320 views every single time.\n\nSeven months of daily effort with zero breakthrough and I couldn't identify what was keeping me stuck. Finally figured it out two weeks ago and everything exploded. Now averaging 94k views. Here's what I learned.\n\n1. **210 failures means one execution pattern repeated 210 times.** You don't have 210 different problems. You have one pattern you're completely blind to. Mine was pausing for 3.0 seconds at second 9 while my visual stayed totally static. That's one flaw I repeated 210 times without knowing. Find your repeating pattern.\n2. **The account isn't shadowbanned your execution is creating shadowban-level results.** The algorithm would push your content if people watched it. People don't watch because something specific you're doing makes them leave instantly. Fix that and distribution returns immediately. You're not suppressed. Your execution pattern is creating suppressed-level performance.\n3. **What's killing you feels like your natural voice.** Those 3.0 second pauses felt like normal rhythm to me. My authentic personality. My style. To viewers deciding whether to scroll it felt like nothing happening or the video freezing. They left. I couldn't see it because it felt like being myself.\n4. **Changing content strategy doesn't fix execution timing flaws.** I changed topics, niches, formats repeatedly for seven months. Complete waste of time. The problem wasn't my strategy or content type. It was a 3.0 second pause at second 9. Strategy changes don't fix execution problems. Wrong layer entirely.\n5. **This is what finally broke me out after seven months stuck at 320 views.** I found [this app](https://taap.it/liyjQBu) and it showed me exactly what was killing every video. It analyzes your content and tells you what's broken at exact timestamps with specific fixes. Second 9 pause 3.0 seconds visual static people left cut to under 1 second add movement. That diagnostic precision changed everything. Regular analytics showed retention dropping. It showed me the 3.0 second pause was why and exactly how to fix it. That's when I went from 320 views to 94k overnight.\n6. **One micro-fix can undo seven months of plateau immediately.** Cut my pauses to under 1 second. Made sure something moved visually constantly. Everything else stayed identical. Same topics. Same style. Just fixed the pause timing. Breakthrough happened in one video. Those 210 failures taught me everything except the one broken thing. Fixed that and everything exploded.\n\nLast 8 videos all over 91k. Same person who failed 210 times over seven months. Just stopped repeating the execution flaw I was completely blind to.\n\nIf you've posted hundreds of videos stuck at low views you have one execution blind spot killing everything.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qyapic/210_videos_in_7_months_stuck_at_320_views_then/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o435gr5",
          "author": "artisare",
          "text": "Why didn't you check your video analytics? There you can see the exact info - how long do they watch, at what point they drop off, etc.",
          "score": 1,
          "created_utc": "2026-02-07 14:49:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o43771n",
              "author": "maxneato",
              "text": "Because this is an ad.",
              "score": 6,
              "created_utc": "2026-02-07 14:58:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o43c7ln",
                  "author": "erikslicis",
                  "text": "so all this dummy text just to promote a thing that does what TikTok already does? LOL",
                  "score": 1,
                  "created_utc": "2026-02-07 15:24:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r0bido",
      "title": "$10K MRR solo feels better than $2M seed and stress",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r0bido/10k_mrr_solo_feels_better_than_2m_seed_and_stress/",
      "author": "whyismail",
      "created_utc": "2026-02-09 18:05:01",
      "score": 5,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I’m a founder of a SaaS company, which I built solo, bootstrapped, no investors. It helps founders grow their personal brand on X & LinkedIn and drive inbound. Simple tool, solves a real problem and makes money from day one.\n\nAnd honestly, the more I build, the more I believe micro SaaS > venture-backed startups. I’ve seen too many stories like \"raised $700K pre-seed → burned through it → now stressed out trying to raise again.\" Meanwhile, I just fix bugs, ship small features, talk to customers and grow at my own pace.\n\nWith micro SaaS, you can get to $5K–$20K MRR with high margins, no pressure and total control over your time. You don’t need a team of 20 or a slide deck for every decision. Just a useful product, a few customers who pay and a feedback loop that actually works.\n\nWould love to hear from others building solo or small- how’s it going for you? And if you’re still debating startup vs micro SaaS, happy to share more behind the scenes if helpful",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r0bido/10k_mrr_solo_feels_better_than_2m_seed_and_stress/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o4h3ep9",
          "author": "Key-Boat-7519",
          "text": "Micro SaaS winning over “raise then pray” is the whole story here. You’re basically describing what most founders actually want: control of time, clear feedback loops, and money that shows up because something works, not because a deck sold a dream.\n\nWhat helped me was treating it like a craft, not a rocket ship: keep CAC stupid simple (DMs, niche communities, cold email), obsess over activation/onboarding, and only build features that connect straight to revenue or retention. Everything else is a distraction.\n\nIf you ever feel stuck at a plateau, dig into where word of mouth is already happening and double down there instead of adding yet another channel. I bounce between tools like Fathom and Plausible for understanding behavior, plus Pulse with things like SparkToro to spot real conversations and language people use. Micro SaaS beats chasing the next round, start to finish.",
          "score": 1,
          "created_utc": "2026-02-09 18:23:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzlyig",
      "title": "I spent 30 days engaging manually on Twitter vs 14 days using my AI agent. The difference is insane (436k Impressions)",
      "subreddit": "GrowthHacking",
      "url": "https://i.redd.it/utnwogyuacig1.png",
      "author": "CTurE1",
      "created_utc": "2026-02-08 21:48:47",
      "score": 5,
      "num_comments": 28,
      "upvote_ratio": 0.65,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qzlyig/i_spent_30_days_engaging_manually_on_twitter_vs/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o4bsebv",
          "author": "coderqi",
          "text": "But what if everyone else is just using bots?",
          "score": 4,
          "created_utc": "2026-02-08 22:00:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4bt9w6",
              "author": "CTurE1",
              "text": "That's the 'Dead Internet Theory' in action. And honestly, 90% of bots right now are just spamming 'Great project!' or 🚀",
              "score": 1,
              "created_utc": "2026-02-08 22:05:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4e11br",
                  "author": "Far-Tension2696",
                  "text": "it's 99.9%. x, insta, fb, linkedin is already dead. reddit is not there yet but theres a lot of AI content lately...",
                  "score": 1,
                  "created_utc": "2026-02-09 05:56:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4no3l8",
          "author": "TworLabs",
          "text": "Good stuff it is no effort but you have to pay chatgpt rest api i guess.",
          "score": 2,
          "created_utc": "2026-02-10 18:20:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4noshj",
              "author": "CTurE1",
              "text": "True, quality inference isn't free. But I actually deliberately avoid standard ChatGPT.\n\nI use a different model stack because the default GPT tone is too easy to spot these days. I'd rather pay a bit for the API to get replies that actually sound human and convert, rather than saving pennies on robotic spam",
              "score": 1,
              "created_utc": "2026-02-10 18:23:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4budcz",
          "author": "Otherwise_Wave9374",
          "text": "That is a big delta. The part I keep coming back to is quality and safety, like how you keep the replies on-topic and not obviously botty, and how you avoid getting accounts flagged.\n\nDo you do any retrieval (pulling context from the tweet thread, author history, etc) before generating the reply, or is it prompt-only? I have been collecting patterns for agentic engagement systems here: https://www.agentixlabs.com/blog/",
          "score": 1,
          "created_utc": "2026-02-08 22:11:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4bvgzb",
              "author": "CTurE1",
              "text": "Good question! To keep it efficient, I don't retrieve the author's full history or bio yet (no RAG on the user profile).\n\nInstead, the agent focuses 100% on the **semantic context of the target tweet**. It analyzes the tone (is it a joke? a rant? a serious insight?) and the core argument of the post to generate a reply that actually adds value to that specific conversation.\n\n**Safety/Flagging:** That's mostly handled by randomized sleep intervals and 'human-like' typing delays. If you act like a human, the algo treats you like one.\n\nWill check out your blog, thanks.",
              "score": 1,
              "created_utc": "2026-02-08 22:16:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4c77bo",
          "author": "Admirable_Swim_6856",
          "text": "Is this not just bots talking to bots, did you get any actual conversion from this? ",
          "score": 1,
          "created_utc": "2026-02-08 23:22:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4c80a4",
              "author": "CTurE1",
              "text": "Ahah, no, but that would be funny. In fact, thousands of people still do this regularly by hand. I personally know of communities where people do this by hand and help each other. ",
              "score": -1,
              "created_utc": "2026-02-08 23:27:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4cwjz5",
          "author": "pbalIII",
          "text": "436K impressions with a 0.3% CTR to profile visits is doing a lot of heavy lifting here. No mention of signups, sales, or conversations that actually started. Impressions are the most gameable metric on X... bots inflate them, algorithmic boosts inflate them, and none of it tells you whether a real person stopped scrolling.\n\nThe other thing worth watching is survivorship bias. A 14-day window doesn't account for X's visibility filtering, which catches automated reply patterns on a lag. Plenty of accounts show similar early numbers and then go quiet once the shadowban kicks in a month later.\n\nNot saying automation can't work, but conversions per hour invested would be the honest benchmark.",
          "score": 1,
          "created_utc": "2026-02-09 01:47:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4naozc",
              "author": "ZoranS223",
              "text": "Well, at 0 hours invested, it's practically infinite, so I would say conversion has to be dollar to whatever metric. Yeah, that's a very low click-through rate. Knowing well myself how difficult it is to get people to visit your profile on X, these are some pretty good results. Today the impressions are maxing out, but over time, the algorithm will place the content where it should go, and it's going to show it to people even after some time has passed. Combine all of this with also creating some threads, even though OP thinks it's not a good idea, and then you have a very good strategy. When people actually do visit your profile, they should be able to see something else, something different. Preferably also something useful for them. But that's, you know, besides the point. If you are unable to get impressions, you won't be able to get visits. If you're unable to get visits, you won't be able to get traffic. If you're unable to get traffic, you won't be able to get signups. If you're unable to get signups, you're not going to get users, etc. etc. etc. ",
              "score": 1,
              "created_utc": "2026-02-10 17:18:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4cy5cj",
          "author": "HarjjotSinghh",
          "text": "i gave up hope my ai agent got replaced by a robot.",
          "score": 1,
          "created_utc": "2026-02-09 01:55:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4egg5a",
          "author": "vanshbuilds",
          "text": "i have done both approaches. Manual replies taught me a lot early on, but I eventually mixed in tools (I used Cliqo for part of it) just to stay consistent without burning out eventually",
          "score": 1,
          "created_utc": "2026-02-09 08:15:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ehve7",
              "author": "CTurE1",
              "text": "100%. Manual replies are great for learning the 'vibe', but it's impossible to scale without burning out.\n\nSince you've used Cliqo, I would actually love your feedback on my tool. I tried to make it feel less 'robotic' than existing solutions.\n\nIf you have a sec to compare them, let me know what you think! (Link in bio)",
              "score": 1,
              "created_utc": "2026-02-09 08:29:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4g6fww",
          "author": "unicorn69love",
          "text": "yo thats nuts, been using xbeast for auto-replies and scheduling on my accounts - gets solid impressions w/o the burnout if you dial in the prompts right. manual sucks but ai like this hijacks traffic smart, just test small to dodge flags first.",
          "score": 1,
          "created_utc": "2026-02-09 15:46:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gdk0j",
          "author": "Rudy_Ravelin",
          "text": "That is crazy",
          "score": 1,
          "created_utc": "2026-02-09 16:20:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4j0yn1",
          "author": "arte-theguy",
          "text": "how did you get the post data? no way you're using X api, theyre so expensive\n\ndid you just scrape or something?",
          "score": 1,
          "created_utc": "2026-02-10 00:14:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lrrdj",
              "author": "CTurE1",
              "text": "Haha, you caught me =)\n\nThe official Enterprise API starts at $5000/mo, which is insane for indie hackers. No way I'm paying that.\n\nSo yes, basically I'm automating the browser session directly. It acts exactly like a real user scrolling the web version of X. It’s harder to maintain than the official API, but it's free and allows us to offer this tool at a normal price.",
              "score": 1,
              "created_utc": "2026-02-10 12:34:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ccxc9",
          "author": "subaru_kun33",
          "text": "Do you mind open sourcing this so people can run this on their devices as I can see it asks for cookies which have all the login access it can raise security issues kinda,  and if you open source then there's a high chance that this tool becomes a community success project. And as of 30 credits and all for free users it's kind of low ? Or you can give usetrs option to put their own api key and model and change the system prompt through telegram api, I have the same automation for one of my clients. \n\nHappy to discuss if you want any contributions.",
          "score": 0,
          "created_utc": "2026-02-08 23:56:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4cegbw",
              "author": "CTurE1",
              "text": "Hey, thanks for the feedback!\n\nRegarding Open Source:\nSince this relies on a custom browser fingerprinting engine to bypass X's anti-bot detection, making it open-source would burn the method instantly. X would patch it in a week. Keeping it closed ensures longevity and safety for current users.\n\nRegarding Security:\nCookies are AES-256 encrypted and run in isolated containers. I treat security as priority #1 because I use it for my own accounts too.\n\nRegarding the 30 Free Credits:\nIt's not just about LLM costs. The real cost is high-quality Residential Proxies and browser emulation resources to keep accounts safe from shadowbans. Running that infrastructure is expensive, so the free tier is a trial to prove it works.\n\nP.S. Valid point on the BYOK (Bring Your Own Key) model though, I might add a 'Power User' tier later for those who want to use their own API keys.",
              "score": 3,
              "created_utc": "2026-02-09 00:05:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4cg6f2",
                  "author": "subaru_kun33",
                  "text": "I think this reply is also AI generated? Isn't it.",
                  "score": 1,
                  "created_utc": "2026-02-09 00:15:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}