{
  "metadata": {
    "last_updated": "2026-02-21 16:49:58",
    "time_filter": "week",
    "subreddit": "GrowthHacking",
    "total_items": 20,
    "total_comments": 201,
    "file_size_bytes": 184831
  },
  "items": [
    {
      "id": "1r8bh5r",
      "title": "How do resellers move beyond one off finds and build consistency?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r8bh5r/how_do_resellers_move_beyond_one_off_finds_and/",
      "author": "No-Lettuce9313",
      "created_utc": "2026-02-18 18:44:15",
      "score": 63,
      "num_comments": 12,
      "upvote_ratio": 0.81,
      "text": "Been reselling for a while now and the one thing I can't seem to crack is consistency. Like I'll have a genuinely great week find good stuff, flip it fast margins are solid. Then the next week feels like everything dried up and I'm driving around for hours coming back with basically nothing worth listing. The one off finds are fun but they're not a business. I know that. The problem is I'm still not sure how to get from this is going well sometimes to this is actually reliable. Because right now it still feels more like luck than a system.  \n  \nI've tried being more intentional about sourcing, hitting the same spots consistently, learning certain categories better, paying attention to what actually sells versus what just looks good in the moment. That stuff has helped a little but I still feel like I'm missing something structural that more experienced resellers probably figured out a while ago. Part of me wonders if consistency at this level just comes down to volume, like the more you're out there the more it evens out over time. But I also don't want to just grind harder without actually getting smarter about it because that's just burning yourself out for the same results. Curious how people handle the sourcing side when their usual spots stop producing. Do you have backup channels, relationships with certain sellers, specific categories you always fall back on? Or does everyone just hit dry spells and push through it.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r8bh5r/how_do_resellers_move_beyond_one_off_finds_and/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o63w3rg",
          "author": "Weird_Excuse_1249",
          "text": "I hit that same wall after a while, thrift stores alone just aren’t enough if you want consistency. What helped me was starting to look into wholesalers and also searching online for suppliers. There’s more out there than people realize you just have to dig a bit.",
          "score": 13,
          "created_utc": "2026-02-18 19:20:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64827b",
              "author": "OutsideTicket1672",
              "text": "Yes this was my experience, I love thrifting but it just doesn’t scale long term. I’ve been sourcing through Fleek lately and it’s made things way more predictable.",
              "score": 12,
              "created_utc": "2026-02-18 20:16:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o63q7uu",
          "author": "FormalDelay8560",
          "text": "What changed everything for me was moving away from relying purely on random finds and focusing more on repeatable sources. One off pieces are great but consistency comes from having suppliers or channels you can go back to regularly.",
          "score": 1,
          "created_utc": "2026-02-18 18:54:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63qf4f",
          "author": "Full_Ad_3124",
          "text": "Dry spells happen to everyone but relying only on thrift runs makes it hard to scale. What helped me was diversifying where I source from so I’m not dependent on one method. Even if one channel slows down others keep things moving.",
          "score": 1,
          "created_utc": "2026-02-18 18:55:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63wb1w",
          "author": "VarietyWeird909",
          "text": "The real shift is finding repeat suppliers, plenty of wholesalers exist online if you spend time searching.",
          "score": 1,
          "created_utc": "2026-02-18 19:21:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6458la",
          "author": "sainkunal_13",
          "text": "The shift from “good week / bad week” to consistency usually comes from turning sourcing into a system instead of an event.\n\nRight now it sounds like you’re still operating on opportunity. You find something good, margins are there, great week. Then you’re back hunting again. That’s normal early on.\n\nThe resellers I’ve seen build consistency usually do 3 things:\n\n1. They specialize harder than they think they need to. One or two categories max. That way you recognize value instantly and move faster than generalists.\n2. They build repeat sources. Instead of random one-off finds, they create relationships with specific sellers, liquidation spots, or even small local businesses that offload regularly.\n3. They track data obsessively. Not just “what sold” but sell-through time, margin after fees, return rate, etc. Patterns start to show up after 30–50 flips.\n\nVolume does smooth things out, but only if it’s repeatable volume. Otherwise it’s just more chaos.\n\nOut of curiosity — are your best weeks coming from the same type of item each time or totally different finds?",
          "score": 1,
          "created_utc": "2026-02-18 20:03:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66hvjz",
          "author": "amberjletang",
          "text": "It feels like luck because you are hunting for items instead of building a pipeline. One-off finds are fine for a hobby, but they don’t scale because you have to be there for every win.\n\nTo break this, you need to find repeatable loops. Stop hitting the same thrift spots and start looking at bulk sources (like wholesalers or liquidators) where you can buy 10 of the same thing at once. Treat it like a data problem: if you can automate the sourcing alerts for digital auctions or bulk lots, the inventory starts coming to you while you sleep.",
          "score": 1,
          "created_utc": "2026-02-19 03:28:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68kfxu",
          "author": "pantrywanderer",
          "text": "From what you’re describing, it sounds like a mix of luck and system. Even the most experienced resellers hit dry spells, it’s part of the game.\n\nWhat separates the consistent ones is having backup channels and routines that don’t rely on a single source. That could mean cultivating relationships with multiple suppliers, knowing a few categories inside out so you can pivot quickly, or even setting aside time for online sourcing when physical spots run dry. Volume helps, but smarter systems prevent burnout and make the wins more predictable instead of random.",
          "score": 1,
          "created_utc": "2026-02-19 13:26:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69c2ix",
          "author": "Ok_Tart5733",
          "text": "I get this. It often takes time to turn reselling into a consistent system rather than relying on luck. Experienced sellers usually build multiple sourcing channels, focus on categories they know sell, and develop relationships with reliable sellers so dry weeks don’t derail their business.",
          "score": 1,
          "created_utc": "2026-02-19 15:52:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9wsv4",
      "title": "I grew a site from 0 to 130K organic visits/month in 14 months. Here's the unsexy playbook no one talks about",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r9wsv4/i_grew_a_site_from_0_to_130k_organic_visitsmonth/",
      "author": "PhilosopherLeft6814",
      "created_utc": "2026-02-20 14:28:27",
      "score": 42,
      "num_comments": 18,
      "upvote_ratio": 0.84,
      "text": "\nNo AI-generated fluff. No $2,000 course upsell. Just the actual stuff that moved the needle.\n\n**Background:** Mid-2024 I launched a B2B SaaS content site in a competitive niche (marketing analytics). By late 2025, we hit 130K monthly organic sessions and it now drives 80% of our qualified pipeline. Here's what actually worked — and a few things I wasted months on.\n\n\n**1. We killed our blog strategy and rebuilt it around pain points, not keywords**\n\nOur first 3 months we did what everyone does: plugged seed keywords into Ahrefs, sorted by volume, and started writing.\n\nThe result? 40 posts. Almost zero conversions. Decent traffic on a handful, but the wrong people.\n\nThe shift: We started interviewing our sales team and pulling questions from customer support tickets. We built content around what people were *actually confused about* — not what a tool told us had volume.\n\nExample: \"how to track competitor share of voice\" had almost no search volume. We published it anyway. It's now our #2 converting page because the people searching it are exactly who we sell to.\n\n**Takeaway: Low-volume, high-intent keywords will outperform high-volume vanity keywords almost every time for business outcomes.**\n\n\n**2. Internal linking is stupidly underrated**\n\nI'm not talking about throwing random links in your posts. I mean building a disciplined topic cluster architecture.\n\nWe created 6 pillar pages (2,500-4,000 words each) and linked 8-15 supporting articles to each one. Every supporting article links back to the pillar and to 2-3 siblings.\n\nAfter restructuring our internal links, one pillar page went from position 14 to position 3 in about 6 weeks — with zero new backlinks. Google could finally understand what we were actually about.\n\n**Takeaway: Before you build more backlinks, audit your internal linking. It's the highest-ROI SEO activity most people ignore.**\n\n\n**3. We stopped publishing 3x/week and started publishing 1x/week at 3x the quality**\n\nHot take: publishing frequency is a vanity metric.\n\nWe cut our output from 12 posts/month to 4. But each one got:\n\n- A custom diagram or chart (made in Figma, takes 30 min)\n- Real examples, not hypothetical ones\n- An original data point or survey stat when possible\n- A genuinely helpful structure (not just H2s stuffed with keywords)\n\nOur average time-on-page went from 1:20 to 4:45. Pages started ranking faster. And we stopped cannibalizing our own keywords.\n\n**Takeaway: One post that becomes THE resource on a topic > four forgettable posts that rank on page 3.**\n\n\n**4. Technical SEO basics compound more than you think**\n\nNot the sexy stuff. The boring stuff:\n\n- Fixed 400+ broken internal links (Screaming Frog, took a weekend)\n- Compressed images site-wide (saved 2.1s avg load time)\n- Added proper schema markup to all posts (FAQ, HowTo, Article)\n- Fixed orphan pages — 30+ posts had ZERO internal links pointing to them\n- Submitted a clean XML sitemap and pruned 80 thin/outdated pages\n\nNone of this individually was a game-changer. Together, over 3-4 months, we saw a ~25% lift in indexed pages ranking in the top 20.\n\n**Takeaway: Technical SEO isn't a one-time audit. Treat it like hygiene — do a little every month.**\n\n\n**5. Distribution > creation (the thing I learned way too late)**\n\nFor the first 6 months, we'd hit publish and... wait. Maybe share it on LinkedIn once.\n\nNow every piece of content gets:\n\n- Repurposed into a LinkedIn carousel (our best channel for B2B reach)\n- Submitted to 2-3 relevant niche communities (not spam — genuine answers that link to the full post)\n- Turned into a short email to our list with a \"here's why this matters to you\" angle\n- Quoted in responses on Quora/Reddit where someone is asking exactly what the post answers\n\nThis alone 3x'd our first-week traffic on new posts and improved early engagement signals that (I believe) helped ranking velocity.\n\n**Takeaway: If you're spending 8 hours writing and 0 hours distributing, flip that ratio to at least 50/50.**\n\n\n**6. Things that were a waste of time (for us)**\n\nBeing honest here:\n\n- **Obsessing over DA/DR scores** for link building. Some of our best-converting referral traffic comes from niche sites with DA 25.\n- **Programmatic SEO** before we had topical authority. We tried auto-generating 500 location pages. Google ignored most of them.\n- **Hiring cheap freelance writers** to scale output. We burned ~$6K on content we either rewrote entirely or unpublished.\n- **Chasing featured snippets specifically.** They came naturally once the content was genuinely the best answer. Trying to reverse-engineer them was a time sink.\n\n\n**The honest truth about timelines**\n\nMonths 1-3: Basically nothing. A few posts trickling in 10–50 visits/month.\n\nMonths 4-6: Slow compounding. A couple posts hit page 1 for long-tails. ~5K/month.\n\nMonths 7-10: The hockey stick starts. Pillar pages climb. Internal linking kicks in. ~40K/month.\n\nMonths 11-14: Everything compounds. New content ranks faster because site authority is there. Hit 130K.\n\n**SEO is a slow game that rewards patience and consistency. If you need results in 30 days, run ads. If you're building for 12+ months, SEO will be the single best investment you make.**\n\n\nHappy to answer questions about any of this. What's working (or not working) for you all right now? Drop your biggest SEO challenge and I'll give you my honest take.\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r9wsv4/i_grew_a_site_from_0_to_130k_organic_visitsmonth/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6flbwf",
          "author": "sajacen",
          "text": "I get the scepticism. Could you share screenshots from GA?",
          "score": 5,
          "created_utc": "2026-02-20 15:05:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ftf0l",
          "author": "goldgravenstein",
          "text": "“No AI-generated fluff” haha oh man, what a lie right off the bat",
          "score": 10,
          "created_utc": "2026-02-20 15:43:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kehi1",
              "author": "CautiousBobcat2622",
              "text": "Haha 100% the whole post is 100% generated. Hot take, AI generated fluff. Who are they kidding 🤣",
              "score": 1,
              "created_utc": "2026-02-21 07:24:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fgup8",
          "author": "AcanthaceaePitiful26",
          "text": "Again chat gpt text! Why do you make this AI hell from reddit?",
          "score": 10,
          "created_utc": "2026-02-20 14:42:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k7w8e",
              "author": "olliekod",
              "text": "it kills me seeing it too brother",
              "score": 2,
              "created_utc": "2026-02-21 06:24:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6fij1k",
              "author": "PhilosopherLeft6814",
              "text": "lol fair enough, i get the skepticism. this is from my actual experience for the past year+ ...happy to get specific on anything if you have questions",
              "score": 2,
              "created_utc": "2026-02-20 14:51:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6flhxk",
                  "author": "adjei7",
                  "text": "Tbh I don't see a problem with AI generated posts if the source is from the author. The message is there, but just in a form that is clear, concise and easier to understand. If it helps you get your point across, go for it.",
                  "score": 13,
                  "created_utc": "2026-02-20 15:06:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6gg4us",
          "author": "Just-A-Boyyy",
          "text": "The 'distribution > creation' insight is gold - most teams publish then ghost hoping Google finds it. Your LinkedIn + niche communities strategy 3x'd early traffic because social signals and niche authority compound faster than organic crawl. Technical SEO as hygiene is underrated too. Saw sites with 0% CTR improvement from design changes but 40% from fixing internal link structure. Long-term wins come from consistency, not hacks.",
          "score": 3,
          "created_utc": "2026-02-20 17:28:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6h9kgf",
              "author": "ulmekerp",
              "text": "yeah this is the part people refuse to do. when you say \"niche communities\" what actually worked for you, like specific Slack/Discords or just targeted linkedin comments?",
              "score": 1,
              "created_utc": "2026-02-20 19:43:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6h8n5k",
          "author": "Bendecx",
          "text": "Fantastic article, I'm exactly as in your early days. Worked hard and  ranked number one for industries most competitive keyword, results almost no traffic, then started targeting less volume but pain related keywords and already getting results. I would need further research to identify more pain points. Great inspiration. thanks for sharing.",
          "score": 2,
          "created_utc": "2026-02-20 19:39:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6h5cf0",
          "author": "Artic_funky",
          "text": "great, what was your conversion rate once you hit those numbers?",
          "score": 1,
          "created_utc": "2026-02-20 19:23:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ilsjz",
              "author": "PhilosopherLeft6814",
              "text": "Jumped to around 3.6% after the 10th month",
              "score": 1,
              "created_utc": "2026-02-20 23:52:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6iwlka",
          "author": "_SeaCat_",
          "text": "Well even if the first sentence sounds as AI-generated, the following text all makes sense. I've sent you DM with a question on your post. Thanks!",
          "score": 1,
          "created_utc": "2026-02-21 00:55:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6j4fp9",
          "author": "Analytics-Maken",
          "text": "Having a central place to actually see what is happening is a game changer, a dashboard that shows GA4, GSC, Facebook Ads, Google Ads, and the CRM, lets us see what strategies work, what is hurting, and what our clients want. It's a little bit of work upfront, but it's worth it: using ETL tools like Windsor.ai to consolidate the data sources into Power BI or a data warehouse like BigQuery, cleaning, transforming, and joining the data. ",
          "score": 1,
          "created_utc": "2026-02-21 01:44:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jdbcg",
          "author": "Alarming_Bluebird648",
          "text": "Targeting pain point keywords over high-volume vanity metrics is the right play for B2B. What was the specific conversion rate from that 130k organic traffic to actual MQLs?",
          "score": 1,
          "created_utc": "2026-02-21 02:40:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k5ovq",
              "author": "Munib_raza_khan",
              "text": "He mentioned it in comments 3.6%",
              "score": 1,
              "created_utc": "2026-02-21 06:05:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6k95v5",
          "author": "Clear_Emotion_8715",
          "text": "Did gamification ever work for you?",
          "score": 1,
          "created_utc": "2026-02-21 06:35:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ku5yo",
          "author": "Confident_Box_4545",
          "text": "Most people read this and think write better content\n\nThe real lever is you aligned content with sales questions and then pushed distribution hard\n\nTraffic is nice but pipeline is the metric that matters",
          "score": 1,
          "created_utc": "2026-02-21 09:59:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r84h8z",
      "title": "What are you using to manage email marketing campaigns?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r84h8z/what_are_you_using_to_manage_email_marketing/",
      "author": "Latter_Ordinary_9466",
      "created_utc": "2026-02-18 14:30:01",
      "score": 37,
      "num_comments": 21,
      "upvote_ratio": 1.0,
      "text": "I'm trying to improve how we handle our marketing campaigns and right now we're juggling emails, socials, ads and it's a total total mess from a time management stand point. That said I don't want to hire/outsource to an agency to do all this for me. Just looking to find a management platform that will free up some time and workload for our team  \n  \nLooking for something that can help:  \n• Keep all contacts in one place  \n• Schedule emails and automation sequences  \n• Track performance and ROI easily  \n• Build forms  \n  \nThere are tools like activecampaign, hubspot, mailchimp ... but wanted to hear from real ppl what really works. What do you use and what's your experience?? I'm happy to invest in it as long as it really does the job.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r84h8z/what_are_you_using_to_manage_email_marketing/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o629c7d",
          "author": "Small-Ad-2708",
          "text": "We use ActiveCampaign! The interface is clean, you can schedule emails, manage contacts etcand it plays nice with other tools we use. Great option to really cover all your marketing efforts and we've benefitted from their AI features that they keep adding",
          "score": 5,
          "created_utc": "2026-02-18 14:55:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63p24b",
          "author": "Numbersevenonly",
          "text": "I started with mailchimp but quickly switched to ActiveCampaign once we scaled. I found it better for managing multiple campaigns and doing easy 'fancy' automations. If you grow and need to do more it is a great tool to start and will save you time further down the line.",
          "score": 3,
          "created_utc": "2026-02-18 18:49:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64lwlv",
              "author": "Organic-Hall1975",
              "text": "+1 moved from Mailchimp to ActiveCampaign too. So glad we did. We have been floored with the improvements we've seen to our email deliverability",
              "score": 1,
              "created_utc": "2026-02-18 21:21:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6chb3m",
          "author": "Hot-Juggernaut-506",
          "text": "You could try Getsitecontrol. They are a popup builder and email marketing tool with good automation / workflow functionality. The cost isn't very high either as a lot of the features come with the free plan.\n\nI had a good experience managing email campaigns through their service, and their form / popup building tools are excellent too. \n\nI also heard good things about Brevo and Mailerite for email marketing but I don't have that much experience with them myself.",
          "score": 2,
          "created_utc": "2026-02-20 01:30:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6262fh",
          "author": "Open_Article8347",
          "text": "Zoho campaogns",
          "score": 1,
          "created_utc": "2026-02-18 14:39:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62iox8",
          "author": "Fred_TastefulGift",
          "text": "I use Brevo for sending mails but they also have some CRM and campaign capabilities. Quite good free plan from my POV.",
          "score": 1,
          "created_utc": "2026-02-18 15:39:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62t8dg",
          "author": "Emotional-Bee-967",
          "text": "For multi-channel check out ActiveCampaign. The automations are great and it's not crazy expensive considering what it can do. Worth every $$ in my books.",
          "score": 1,
          "created_utc": "2026-02-18 16:27:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63cs39",
          "author": "Confident-Tank-899",
          "text": "The platform choice really depends on your workflow complexity. For teams dealing with volume like yours, a unified platform can save tons of time versus switching between tools. ActiveCampaign is solid, but also worth considering based on your specific needs:\n\n\n\nIf you need pure email automation with segmentation, Klaviyo excels. For CRM integration, HubSpot's ecosystem is powerful. The key is making sure your platform integrates with your other tools and scales with you.",
          "score": 1,
          "created_utc": "2026-02-18 17:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63ufmr",
          "author": "theroimaniac",
          "text": "Always loved ActiveCampaign. It has more than just email marketing.",
          "score": 1,
          "created_utc": "2026-02-18 19:13:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66bfny",
          "author": "Far_Move2785",
          "text": "Been there with the marketing chaos. Juggling all those channels is brutal.\n\nQuick recommendation on email platforms: check out Klaviyo. Super clean UI and does everything you want. But real talk, that's not even the biggest conversion killer I've seen.\n\nThis might not be your exact problem but I discovered something massive with in-app browsers killing marketing performance. When people click ads on Instagram/Facebook/TikTok they land in these garbage browsers that destroy checkout conversion.\n\nMy conversion was 1.2% in those in-app browsers vs 4% in Safari. Total nightmare. The problem? No credit card autofills, no Apple Pay, everything's slower.\n\nFix was routing people to their real browser before checkout. Saw a 15% revenue lift from same ad spend. Massive difference.\n\nPro tip: Check your analytics for conversion by browser. If Instagram or Facebook browser numbers are way lower than Safari, that's your hidden leak.\n\nhttps://tryhoox.com handles the redirect automatically if you want to test it. Saved my team tons of headache.",
          "score": 1,
          "created_utc": "2026-02-19 02:49:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66j3g5",
          "author": "amberjletang",
          "text": "The mess usually happens because people buy a tool before they actually map out their workflow. \n\nHubSpot is the gold standard for keeping everything in one place, but you definitely pay a massive premium for that convenience as you scale. If your primary pain point is ROI tracking and complex automation sequences, ActiveCampaign often handles the logic better for a much lower price point. \n\nFor a team that's currently overwhelmed, look into setting up a Lead Scoring system within whichever platform you choose. It'll automatically flag which leads are actually worth your time based on their interactions, so your team stops chasing dead ends and focuses only on the high-ROI activity.",
          "score": 1,
          "created_utc": "2026-02-19 03:35:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67b0z1",
          "author": "Bendecx",
          "text": "Try mailerlite",
          "score": 1,
          "created_utc": "2026-02-19 07:01:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67uo0l",
          "author": "Free_Ninja7616",
          "text": "If you want the simplest setup that actually works, go with HubSpot.\n\nYeah it’s more expensive, but it replaces 3 tools and you stop wasting time duct-taping stuff together.\n\nIf you’re early and budget matters:\n\n* ActiveCampaign is great for email automation\n* Mailchimp is fine but gets messy once you need real workflows\n\nBiggest mistake I see is picking cheap and then spending 6 months fighting integrations.\n\nWe see this a lot with clients at BriskFab too. The tool matters way less than having one clean system everyone actually uses.",
          "score": 1,
          "created_utc": "2026-02-19 10:08:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69m3go",
          "author": "Dxstinity",
          "text": "i feel you on the email chaos, it gets overwhelming. i use mailly for my outreach stuff and it really helps streamline things. it keeps everything organized and makes tracking performance a lot easier. might be worth checking out!",
          "score": 1,
          "created_utc": "2026-02-19 16:41:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bgqls",
          "author": "erickrealz",
          "text": "You listed the main contenders already so you clearly know the market. Pick whichever has the best automation builder for your use case and stop overthinking it. They all do basically the same crap at the core level.\n\nThe real difference comes down to how complex your automations need to be. If you're just doing basic sequences and newsletters, go with the simplest and cheapest option. If you need advanced segmentation and lead scoring, step up to a mid tier platform.\n\nTbh most people overpay for features they never use.",
          "score": 1,
          "created_utc": "2026-02-19 22:01:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6di24k",
          "author": "Kaumudi_Tiwari",
          "text": "Honestly I’ve been through the same chaos 😅 — emails, ads, socials everywhere and nothing connected.\n\nFrom what you described, here’s the real talk based on what I’ve used / seen others use:\n\n* **ActiveCampaign** → probably the best balance. Automation is solid, contacts stay organized, and you can build pretty advanced sequences without losing your mind. Reporting is decent too. If you actually want to save time, this is a strong pick.\n* **HubSpot** → amazing but $$$ once you scale. Everything is in one place (CRM, emails, forms, ads tracking). If budget isn’t a big issue, it does remove a lot of operational mess.\n* **Mailchimp** → good for basic newsletters and simple automations, but teams usually outgrow it once campaigns get more complex.\n\nOne thing I learned the hard way: no tool fixes chaos unless you set up workflows properly (lifecycle stages, triggers, naming conventions, etc.). The platform just amplifies whatever system you build.\n\nIf your main goal is:  \n👉 save time + avoid hiring an agency  \nI’d personally start with ActiveCampaign.",
          "score": 1,
          "created_utc": "2026-02-20 05:35:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r74jir",
      "title": "Built side project nights. Launched weekends. Failed. Full Saturday focus won.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r74jir/built_side_project_nights_launched_weekends/",
      "author": "Expensive-Treacle-88",
      "created_utc": "2026-02-17 12:21:12",
      "score": 25,
      "num_comments": 11,
      "upvote_ratio": 0.97,
      "text": "Started side project April 2025 building directory submission tracker. Worked two hours nightly after day job. Weekends launched on Reddit and directories. Five months in had nineteen users. Two hundred twelve dollars MRR. Killed it. Restarted dedicating full Saturdays only to building and distribution. Same tool hit four thousand MRR in four months. Nightly grinding destroyed focus. Saturday blocks created momentum.\n\nNightly sessions felt productive. Two hours coding after nine hour workday. Brain already fried. Wrote messy code. Fixed same bugs twice. Thirty minutes productive max per session. Weekends rushed launch posts. No energy left for quality distribution. Burnout hit month three. Took two week break. Momentum died. \n\nRestart changed everything. Saturdays only. Eight AM to six PM. Ten focused hours. Planned week distribution Monday lunch breaks. Coded features Saturday morning fresh. Launched Reddit posts Saturday afternoon when communities active. Submitted twenty directories per Saturday using [FounderToolkit](http://unicornmaking.com/) lists. Responded to comments real time. Energy matched audience energy.​ \n\nWeek one Saturday launch grabbed twenty-three customers. Month one hit twelve hundred MRR from forty-one users. Month four reached four thousand MRR serving one hundred thirty-two customers. Same hours weekly. Different distribution. Saturdays let me ride Reddit momentum. Nightly posts died in low-traffic hours. [FounderToolkit](http://unicornmaking.com/) tracked eighty-nine side projects. Saturday launchers averaged four point one percent conversion. Nightly launchers zero point nine percent. Timing matched audience availability. Side projects need focused blocks not scattered hours. Daily discipline sounds good. Weekly momentum works better. \n\nProtect one full day. Build and distribute same day. Let feedback compound while momentum hot. Nightly coding creates exhaustion theater not progress. Side projects win on energy management not daily streaks. \n\nStop grinding nights. Block Saturdays. Launch fresh when audience awake. \n\nBurning out on nightly side project grind?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r74jir/built_side_project_nights_launched_weekends/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5v793d",
          "author": "Crypto_Ping",
          "text": "The Saturday distribution block is smart. I batched my Reddit prospecting the same way used Reppit AI to find the right conversations to jump into instead of manually scrolling subreddits hoping to get lucky.\n\nFocused blocks + right timing beats grinding every time.",
          "score": 9,
          "created_utc": "2026-02-17 13:58:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5usbu3",
          "author": "7_Eagles",
          "text": "This is such a real takeaway. I tried the nightly grind for months and most of it was just fixing rushed work later. When I moved everything into one long focused day, I shipped cleaner features and actually promoted properly instead of throwing links into dead hours. Audience timing is underrated. And of course momentum comes from depth and not squeezing work into exhaustion.",
          "score": 1,
          "created_utc": "2026-02-17 12:27:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5usi33",
          "author": "MuslimKhan3040",
          "text": "The momentum point is real. when you build and distribute same day, it actually feels alive.",
          "score": 1,
          "created_utc": "2026-02-17 12:29:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ut1gg",
          "author": "buratnanakakaurat",
          "text": "Did you ever feel like you were losing progress by not working on it during weekdays?",
          "score": 1,
          "created_utc": "2026-02-17 12:32:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5uu889",
              "author": "Expensive-Treacle-88",
              "text": "Initially yes, but the quality of output on Saturdays was so much higher that it more than compensated for the gap.",
              "score": 1,
              "created_utc": "2026-02-17 12:40:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5utkw3",
          "author": "bala523",
          "text": "side projects need intensity, not just consistency.",
          "score": 1,
          "created_utc": "2026-02-17 12:36:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vebt8",
          "author": "Far_Move2785",
          "text": "Solid pivot from scattered to focused work. Those nightly sessions always feel productive but kill real momentum.\n\nThis might not be your exact problem but I had huge conversion issues too. Turned out most of my drop off was from in-app browsers.\n\nWhen people click ads on Instagram/Facebook/TikTok they land in those app browsers and those things are terrible for checkout. No credit card autofills, no Apple Pay, and way slower.\n\nMy conversion was 1.2% in those browsers vs 4% in Safari.\n\nFix was routing people to their real browser before checkout. Saw 15% revenue lift from same ad spend.\n\nCheck your analytics for conversion by browser. If Instagram or Facebook is way lower than Safari that's your leak.\n\nhttps://tryhoox.com handles the redirect automatically if you want to test it",
          "score": 1,
          "created_utc": "2026-02-17 14:36:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vhcww",
          "author": "Pineapplebook",
          "text": "Maybe you can try this app of mine? Its a free stock research tool: https://www.omnistockapp.com/",
          "score": 1,
          "created_utc": "2026-02-17 14:52:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5x57uj",
          "author": "schuylerwhet",
          "text": "“This is a great case study on focused execution. The conversion rate difference (4.1% vs 0.9%) is huge.\n\nOne thing that can amplify those Saturday launches even more is design quality. I’ve found that directories with premium design convert significantly better because they signal authority from the first impression. That’s why I built Swiss Directory (swissdirectory.vercel.app) - to give directory builders a foundation that looks like a brand, not a template. When you’re doing focused Saturday launches, having that design quality can really boost those conversion numbers you’re tracking.”",
          "score": 1,
          "created_utc": "2026-02-17 19:40:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5y0eb2",
          "author": "HalfEmbarrassed4433",
          "text": "same experience. used to do the 2 hour nightly thing and most of that time was just remembering where i left off the night before. switching to longer blocks on weekends made a massive difference, especially for distribution since you can actually respond to comments and ride the momentum in real time instead of posting at midnight and waking up to a dead thread",
          "score": 1,
          "created_utc": "2026-02-17 22:07:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ykjff",
          "author": "kubrador",
          "text": "grinding at 11pm after work is just paying to feel tired. one focused saturday beat five months of zombie coding.",
          "score": 1,
          "created_utc": "2026-02-17 23:54:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6es2y",
      "title": "Google Overview is crediting the wrong brand for my product. What actually moves the needle?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r6es2y/google_overview_is_crediting_the_wrong_brand_for/",
      "author": "MarcusUranus",
      "created_utc": "2026-02-16 16:48:03",
      "score": 25,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "I run a small business and something weird is happening.\n\nIf I search my business name, Google Overview it recommends a competitor instead of me. It’s like it thinks they’re the “best option” for my own brand query.\n\nWhat I’ve done so far:\n\n* Updated homepage + About page with clearer wording\n* Fixed basic stuff (titles, headers, internal links)\n* Added schema (Organization/LocalBusiness)\n* Claimed/cleaned Google Business Profile\n* Got a couple new local citations and mentions\n\nStill happens.\n\nFor anyone who’s actually fixed this, what moved the needle?\n\n* More backlinks? From where?\n* More brand mentions across the web?\n* Specific pages you created \\\\?\n* PR/local press?\n* Time and consistency?\n\nI’m not looking for hacks. I just want to stop losing customers to an answer that’s wrong. If you had 30 days to correct it, what would you do first?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r6es2y/google_overview_is_crediting_the_wrong_brand_for/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5plbgw",
          "author": "gandalfthesupagrey",
          "text": "i used this tool [rebelgrowth](https://youtu.be/ln-YbvOZnbk) and has been doing well for me",
          "score": 1,
          "created_utc": "2026-02-16 16:51:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5plk2v",
              "author": "MarcusUranus",
              "text": "I'll check it out thx",
              "score": 1,
              "created_utc": "2026-02-16 16:52:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5pltk9",
                  "author": "chuchu83688",
                  "text": "yeah you have to try and show up in youtube and reddit and any other platforms the search engines like to cite and summarize",
                  "score": 1,
                  "created_utc": "2026-02-16 16:54:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5pliaw",
          "author": "-listnr",
          "text": "I just got a text because this says ‘brand mentions’ in it, I think brand mentions are huge and being able to monitor them properly. \n\nI just added a collab support feature too so that you can have groups of people engaging when you brand is mentioned.",
          "score": 1,
          "created_utc": "2026-02-16 16:52:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qkec3",
          "author": "Adcero_app",
          "text": "this is a Knowledge Graph entity problem, not really a traditional SEO problem. Google's Overview pulls from its understanding of *what your brand is*, and if a competitor has stronger entity signals, Google associates your brand query with their category.\n\nthe things that actually moved the needle for me in a similar situation: making sure every directory listing (Crunchbase, industry directories, social profiles) uses the exact same brand name and description. Google triangulates from all of these to build its entity understanding. if your LinkedIn says one thing and your GBP says another, you're diluting signals.\n\nalso, branded content on third party sites matters more than your own site for this. guest posts, interviews, or even just getting mentioned in a listicle with your brand name clearly attributed to your product category.",
          "score": 1,
          "created_utc": "2026-02-16 19:34:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r4vhf",
          "author": "Old_Lab1576",
          "text": "I had this exact thing happen Google didnt trust my brand entity yet not a backlink problem more an entity understanding problem what fixed it was consistency everywhere same business name same description same category repeated across profiles directories socials and especially pages about the brand I also created a dedicated about the company page and a founder page and linked them everywhere after a few weeks Google stopped showing competitors on my brand query basically you need to teach Google that your name is a thing not just a keyword",
          "score": 1,
          "created_utc": "2026-02-16 21:15:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r7he3",
          "author": "useomnia",
          "text": "Google’s probably mixing up your brand entity. Tighten the same name and description everywhere, publish one stupidly clear what is Brand page, then get 2 real third party mentions that spell out Brand does X. Give it a couple weeks.",
          "score": 1,
          "created_utc": "2026-02-16 21:27:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s00j5",
          "author": "amberjletang",
          "text": "Google has an identity conflict in its Knowledge Graph. Because your brand signals overlap with a competitor, the algorithm treats you as a secondary entity.\n\nMetadata and headers won't fix this. You need to focus on Data Integrity by using aggressive schema nesting to create a unique digital footprint. This builds an architectural wall between your brand and theirs.\n\nI focus on building these deterministic identity layers so search engines stop guessing. You need to prove your business is the primary authority for its own name.",
          "score": 1,
          "created_utc": "2026-02-16 23:57:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sricf",
          "author": "HarjjotSinghh",
          "text": "wow google's got it wrong - let's make them see the light!",
          "score": 1,
          "created_utc": "2026-02-17 02:40:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9xjcl",
      "title": "How I Generated $2,795 from 2,150 Organic Visitors",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r9xjcl/how_i_generated_2795_from_2150_organic_visitors/",
      "author": "sg-21",
      "created_utc": "2026-02-20 14:57:53",
      "score": 24,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "For the past few months, I’ve been building my SaaS product completely solo. That means nights and weekends spent coding, marketing, and everything in between. No team, no virtual assistants, and no agencies, just me, my laptop, and plenty of coffee. \n\nThis past month felt like a real turning point for me. I got 2,150 organic visitors to my site, which led to 31 trial signups and ultimately 7 paying customers. That brought in $2,795 in revenue, which averages out to about $1.3 per visitor. And the best part is, I didn’t spend a single dollar on ads. \n\nSo, what made the difference? Let me walk you through the tools and strategies that really moved the needle. \n\nI used [Typedream](http://typedream.com/) to build my homepage and pricing pages quickly. It only took me about two hours, and everything was SEO-friendly and mobile responsive without any complicated coding or design headaches. \n\nFor backlink building, I relied on the [directory submission service](http://getmorebacklinks.org/). Manually submitting my website to hundreds of startup directories would have taken me around 20 hours, but with this tool, I did it in one click. My domain rating jumped from zero to six, and Google indexed my site in just four days, which gave me some crucial early momentum. \n\nTo support content marketing, I used [PostKit](http://postkit.pro/) to post two blog articles targeting keywords with low competition. One of those posts ranked in the top 30 search results within 10 days. I also kept a public changelog to show that the project is alive and active, which helped build trust and conversions. \n\nFor onboarding, I set up a simple five-step drip email sequence using [MailMaestro](https://www.maestrolabs.com/). I welcomed new users, shared helpful tips on features, highlighted testimonials, showcased a mini case study, and asked for feedback. This sequence played a big role in turning 31 trial users into paying customers. \n\nThe biggest lessons I learned are not to chase flashy tools but to pick simple, reliable ones that help you work without friction. Despite not being glamorous, directory backlinks are still effective. Slow and consistent growth beats flashy viral hacks. And most importantly, your goal should be revenue per visitor, not just traffic. \n\nIf you want, I’m happy to share email templates, blog outlines, and even the keywords I focused on. This month was my first time making real profit as a solo founder, and I’m finally starting to feel momentum.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r9xjcl/how_i_generated_2795_from_2150_organic_visitors/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6fpdxl",
          "author": "Top-Statement-9423",
          "text": "$1.3 per visitor with zero ad spend is solid.",
          "score": 2,
          "created_utc": "2026-02-20 15:24:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fnekw",
          "author": "Bubalis_Bubalus",
          "text": "That’s a strong solo stack.",
          "score": 1,
          "created_utc": "2026-02-20 15:15:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6frc5j",
          "author": "bala523",
          "text": "what your trial-to-paid conversion rate was after the drip sequence kicked in? Did most upgrades happen early or near the end of the trial?",
          "score": 1,
          "created_utc": "2026-02-20 15:34:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gfwkq",
          "author": "Just-A-Boyyy",
          "text": "The $1.3 per visitor LTV is excellent because it required zero paid spend - that's the metrics nobody talks about. The real win here is the drip sequence converting 23% of trial users. Most people obsess over top-of-funnel velocity but don't invest in the nurture sequence that actually moves the needle. Your email strategy probably drove more value than all the blog posts combined.",
          "score": 1,
          "created_utc": "2026-02-20 17:27:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gobgu",
          "author": "Alarming_Bluebird648",
          "text": "A 22.5% trial-to-paid conversion on organic traffic is massive for a solo project. Are you running a credit-card-required trial, or is that conversion rate coming from a friction-less signup flow?",
          "score": 1,
          "created_utc": "2026-02-20 18:05:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6ava4",
      "title": "Which Link Building Service Actually Delivers Quality Links?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r6ava4/which_link_building_service_actually_delivers/",
      "author": "MuslimKhan3040",
      "created_utc": "2026-02-16 14:20:55",
      "score": 23,
      "num_comments": 12,
      "upvote_ratio": 0.97,
      "text": "We’ve been scaling SEO as a primary acquisition channel over the past year, and link building has easily been the hardest piece to get right.\n\nContent and technical SEO were straightforward. But links? Completely different story.\n\nWe tested a mix of approaches:\n\n- Hiring freelancers for outreach\n\n- Doing manual outreach in-house\n\n- Using a few well-known agencies\n\n- Even tried some PR-style campaigns\n\nMixed results overall. Some decent placements, but also a lot of overpriced links on sites that didn’t move rankings at all.\n\nRecently, I’ve been seeing people in growth and SEO communities mention [GetMoreBacklinks](http://getmorebacklinks.org), especially in the context of contextual placements and niche-relevant outreach.\n\nBefore committing more budget, I wanted to ask here:\n\n- Has anyone used them (or similar services) and seen actual ranking or traffic impact?\n\n- What should I realistically expect in terms of cost vs ROI?\n\n- Are agencies worth it, or is in-house outreach still the best route for growth-stage companies?\n\nNot looking for spammy guest posts or PBNs - only real placements that drive authority and growth.\n\nWould appreciate honest experiences, good or bad.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r6ava4/which_link_building_service_actually_delivers/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5ou6qf",
          "author": "aviclrz",
          "text": "We used GetMoreBacklinks early when our domain was still new. It didn’t magically rank pages overnight, but it helped get us out of the invisible phase and crawl frequency picked up a lot.",
          "score": 2,
          "created_utc": "2026-02-16 14:41:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qndmn",
              "author": "Space-Possible",
              "text": "how do you know if your website is crawled or not? (sorry if it’s a stupid question)",
              "score": 1,
              "created_utc": "2026-02-16 19:49:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5oso3z",
          "author": "centurytunamatcha",
          "text": "Agencies can work, but only if you’re clear about which pages they’re building links to. Random placements to the homepage didn’t do much for us.\n\n",
          "score": 1,
          "created_utc": "2026-02-16 14:33:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5oti0i",
          "author": "Bubalis_Bubalus",
          "text": "Tbh the biggest ROI came when we combined directory/foundation links with internal linking fixes. Links alone weren’t enough until structure was solid.",
          "score": 1,
          "created_utc": "2026-02-16 14:37:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ouk2m",
          "author": "AcadPhM",
          "text": "For quality links you should stay away of link marketplaces. Today quality in link building means genuineness and relevance of the link. If you don't have the resources (or availability) for manual outreach, I recommend HARO-type platforms and CBALB (Citation-Based Academic Link Building). ",
          "score": 1,
          "created_utc": "2026-02-16 14:43:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zw4zh",
              "author": "mikkel2022",
              "text": "Sounds  pricey",
              "score": 1,
              "created_utc": "2026-02-18 04:21:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qwmbp",
          "author": "decebaldecebal",
          "text": "Honestly you can do this yourself, but it does take like 3-4 hours once you have all the logos, descriptions etc prepared.\n\nThere is a list of directories/sties you can submit at [listingcat.com](http://listingcat.com) (not affiliated)\n\nThere are honestly a lot of products on the market, used one myself but can't recommend since DR (domain rating) didn't go up much and I ended up doing the manual work anyway.\n\nIf you do need other options there is also [www.uneed.best/auto-submit](http://www.uneed.best/auto-submit) and [www.startupsubmit.app](http://www.startupsubmit.app), haven't tried these so I can't vouch for though.\n\nThere is also [www.outrank.so/](http://www.outrank.so/) which is a slightly different service",
          "score": 1,
          "created_utc": "2026-02-16 20:34:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zwg1i",
              "author": "mikkel2022",
              "text": "Have you used outrank.so ?",
              "score": 1,
              "created_utc": "2026-02-18 04:23:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o607wpp",
                  "author": "decebaldecebal",
                  "text": "Personally no, just their free trial for the free tools functionality to  get keywords from it :)",
                  "score": 1,
                  "created_utc": "2026-02-18 05:46:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5u7v85",
          "author": "Numerous-Fox-112",
          "text": "but how you know the platforms will give good website lists, I guess it is much more reseller platforms. I guess better to search contextual link building services so they handle your internal linking too",
          "score": 1,
          "created_utc": "2026-02-17 09:34:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r67edw",
      "title": "How do you audit 200+ prompts across chatgpt/perplexity/claude?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r67edw/how_do_you_audit_200_prompts_across/",
      "author": "SquareDesperate4003",
      "created_utc": "2026-02-16 11:40:06",
      "score": 20,
      "num_comments": 9,
      "upvote_ratio": 0.96,
      "text": "I’m in the middle of a project where I need to see how our brand (and five other competitors) show up across 200+ prompts in chatgpt, perplexity, claude, maybe gemini too.\n\nI made the mistake of starting manually. As in, opening chatgpt, pasting a prompt, copying the answer, switching tabs, repeat. I’m currently on prompt #12 and already staring at my screen like this cannot be how people are actually doing this in 2026.\n\nThere's gotta be a smarter way to do this that doesn't involve manually checking hundreds of queries across multiple platforms. What are people actually using? Agency folks especially, how are you tracking this at scale for multiple clients without losing entire weeks to it? Hire a VA? Is there like a script someone has made that they could share? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r67edw/how_do_you_audit_200_prompts_across/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5ob364",
          "author": "phantom_midnight",
          "text": "We had an intern volunteer to do it for one client before we quickly realized how nonsensical the approach was. Turns out there are LLM visibility trackers and we just never bothered to search for them because we’re collectively stupid lol. I can’t really make a recommendation because we’ve only used one (peec ai). It automates the whole nightmare. Upload your prompt list and it runs everything across chatgpt, perplexity, gemini, claude over and over and track the results.",
          "score": 7,
          "created_utc": "2026-02-16 12:52:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5og43y",
          "author": "Charming-Commander",
          "text": "This is one of those \"the tool pays for itself immediately\"  situations. Even if you're solo, the time you save not manually checking hundreds of prompts or building out a quick software solution is worth whatever the subscription costs. Your time has value.",
          "score": 1,
          "created_utc": "2026-02-16 13:24:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ok619",
          "author": "Real_Bit2928",
          "text": "Manually pasting prompts will not scale, so script against the APIs, normalize outputs into structured data, and diff responses automatically instead of burning weeks tab switching.",
          "score": 1,
          "created_utc": "2026-02-16 13:47:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5or94r",
          "author": "Fit-Donkey-3181",
          "text": "Yeah, we've also been messing with some of the Al features from the bigger SEO tools. Hella expensive though.",
          "score": 1,
          "created_utc": "2026-02-16 14:25:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s1a84",
          "author": "amberjletang",
          "text": "Auditing 200+ prompts manually is a systemic failure in data collection. You aren't just losing time; you are losing the ability to compare versions across models accurately.\n\nYou need an 'Automated Audit Layer' that pulls API responses into a centralized dashboard for side-by-side analysis. Most agencies fail here because they treat AI as a chat interface rather than an API data source.\n\nMy approach involves building deterministic audit systems. If you don't have a script to batch process these queries, you're paying for human error. Once you shift to an API-first architecture, this task moves from a week of work to a few minutes of processing.",
          "score": 1,
          "created_utc": "2026-02-17 00:05:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u1l0b",
          "author": "Sirius-ruby",
          "text": "yeah manual checking is brutal, I feel your pain on that. I've done similar audits and by prompt 15 you start questioning your life choices. For what it's worth, I came across Brandlight (https://brandlight.ai) recently and it seems built specifically for this.\n\nFrom what I understand it monitors brand mentions across all the major AI platforms automatically and can track competitors too, which sounds like exactly what you're trying to accomplish manually right now",
          "score": 1,
          "created_utc": "2026-02-17 08:33:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uqavm",
          "author": "phb71",
          "text": "Use a prompt tracking tool e.g. airefs (not ahrefs) or promptmonitor. It's overkill to do it on multiple llms - focus on chatgpt, that's what most people use.",
          "score": 1,
          "created_utc": "2026-02-17 12:13:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vy34l",
          "author": "pbalIII",
          "text": "Build a tiny eval runner, it's basically SEO rank tracking for LLM answers. You want repeatable runs with metadata, then a scoring layer, not a pile of copied text.\n\n- Put prompts in a CSV with IDs and tags\n- Run across vendors via APIs, promptfoo for CLI, LangSmith or Langfuse for UI and history\n- Perplexity: Sonar API, others: OpenAI, Anthropic, Google\n- Store outputs as JSONL with model, params, timestamp, retrieval mode\n- Score: mention yes or no, who gets recommended, and what domains get referenced\n\nPaid LLM brand-monitor dashboards exist, but you still need reruns and diffs, answers drift with model updates and search. Spend humans on the rubric, not execution.",
          "score": 1,
          "created_utc": "2026-02-17 16:14:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7vniq",
      "title": "A/B testing manual edits vs akool aI video variations for paid ad",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r7vniq/ab_testing_manual_edits_vs_akool_ai_video/",
      "author": "Maximum_Mastodon_631",
      "created_utc": "2026-02-18 06:34:51",
      "score": 18,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I ran a small experiment over the past two weeks comparing short form video ads we edited manually vs a few variations generated using an AI tool **akool** just to see if speed would translate into decent performance. \n\nWe tested 6 creatives total across Meta. The AI versions took way less time to produce, which honestly helped us push iterations faster instead of waiting on edits. \n\nPerformance wise, the difference wasn’t dramatic. CTR and retention were slightly stronger on the manually edited ones, but not by a huge margin. The real advantage was how quickly we could test new hooks and angles. For early-stage growth, that speed alone made it worth trying.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r7vniq/ab_testing_manual_edits_vs_akool_ai_video/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o60ruz6",
          "author": "crawlpatterns",
          "text": "That’s kind of what I’d expect. The hand edited stuff usually has a bit more polish or nuance, so slightly better CTR doesn’t surprise me. But if the gap isn’t huge, speed is a real edge.\n\nEarly stage especially, volume of testing can matter more than squeezing out a tiny lift on one creative. If AI lets you test 3 to 4 hooks in the time it takes to polish one manually, that compounds fast.\n\nI’d probably use AI for rapid iteration and then double down with manual edits on the angles that prove they work. Best of both worlds.",
          "score": 0,
          "created_utc": "2026-02-18 08:41:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r945d8",
      "title": "I will create a free launch video for the first 50 startup/projects that comment",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r945d8/i_will_create_a_free_launch_video_for_the_first/",
      "author": "Different-Coat-652",
      "created_utc": "2026-02-19 16:42:33",
      "score": 17,
      "num_comments": 65,
      "upvote_ratio": 0.91,
      "text": "Hello founders and builders,\n\nI'm the creator of Ozor, a tool that converts your product ideas, URLs, or descriptions into simple videos in about 60 seconds. No editing required, just basic videos to promote your project.\n\nTo support the community and keep improving my product, I'll make a free custom launch video for the first 50 startups or side projects that comment below.\n\nHere's how it works:\n\n* Leave a comment with a brief description of your project (e.g., \"Recipe generator app for busy parents\") and a link to your site or landing page if available.\n* I'll create a 30-60 second video based on that, with standard visuals, and elements to help with sharing.\n* It will be sent within 48 hours. No obligations, but a mention would be appreciated if you like it.\n\nWhy? Starting a project can be challenging, and a video can help increase visibility on platforms like X or LinkedIn.\n\nCheck Ozor AI for examples.\n\nLimited spots! comment now if interested. Thanks!\n\n  \n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r945d8/i_will_create_a_free_launch_video_for_the_first/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o69n9ym",
          "author": "Scott_Jaeggi",
          "text": "Really nice way to promote your tool :)  \n  \n[usefeedback.dev](http://usefeedback.dev)\n\nIs a SaaS tool to help gather feedback from early customers easier and with matching UI",
          "score": 2,
          "created_utc": "2026-02-19 16:46:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6afs4u",
              "author": "Different-Coat-652",
              "text": "Thanks! Hey, I'm interested! Just messaged you",
              "score": 1,
              "created_utc": "2026-02-19 19:01:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o69qdfc",
          "author": "PoemCivil7458",
          "text": "Original idea to promote your business, kudos\nInterested to see what you can do with ours\n\nhttps://www.sublineapp.com\n\nSubline is a fashion discovery/shopping platform for finding pieces from small, independent, and/or sustainable brands. It uses a tinder-like UI where users swipe right or left on items and our algorithm learns from user preferences and recommend them stuff they might like.",
          "score": 2,
          "created_utc": "2026-02-19 17:01:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6alie6",
              "author": "Different-Coat-652",
              "text": "Thanks! I will be happy to create a video for your company. Just messaged you",
              "score": 1,
              "created_utc": "2026-02-19 19:29:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o69rirw",
          "author": "TooOldForShaadi",
          "text": "Am gonna add you to [my list](https://github.com/zupcode-com/awesome-free-services-for-your-next-startup-or-saas?tab=readme-ov-file) this week. Hope you don't mind",
          "score": 2,
          "created_utc": "2026-02-19 17:07:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6anyu9",
              "author": "Different-Coat-652",
              "text": "Go ahead, my feelings are still intact 🙂",
              "score": 1,
              "created_utc": "2026-02-19 19:41:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o69x4ur",
          "author": "Glass_Scar4888",
          "text": ">",
          "score": 2,
          "created_utc": "2026-02-19 17:34:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a1d1v",
          "author": "shivangibedi",
          "text": "Going to add you list as well",
          "score": 2,
          "created_utc": "2026-02-19 17:54:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ao2f7",
              "author": "Different-Coat-652",
              "text": "No worries, take care!",
              "score": 1,
              "created_utc": "2026-02-19 19:41:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6a32u8",
          "author": "Practical_Fruit_3072",
          "text": "Awesome",
          "score": 2,
          "created_utc": "2026-02-19 18:02:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6aluel",
              "author": "Different-Coat-652",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-02-19 19:30:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6a6oqc",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-02-19 18:19:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6alyy9",
              "author": "Different-Coat-652",
              "text": "Nice! Just DMed you",
              "score": 1,
              "created_utc": "2026-02-19 19:31:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6a7fv9",
          "author": "RecognitionHot9149",
          "text": "Journal Scroll - Write/journal to Doom Scroll. Uses camera to watch/ensure the user is writing/journaling before being able to use social media.   \nSite is only available locally so not available to public yet;",
          "score": 2,
          "created_utc": "2026-02-19 18:22:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6amd05",
              "author": "Different-Coat-652",
              "text": "Perfect. It'll be great to share some screenshots of your website so the agent has more context about your branding. I just dropped you a DM",
              "score": 1,
              "created_utc": "2026-02-19 19:33:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ab61s",
          "author": "Certain_Lion_6643",
          "text": "Hoppin is a live foot traffic monitoring business for businesses, we install discreet hardware at entranceways and then use AI to analyze and provide recommendations to business owners, helping them reduce costs and increase revenue.",
          "score": 2,
          "created_utc": "2026-02-19 18:40:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6amglm",
              "author": "Different-Coat-652",
              "text": "Look's interesting! Just DMed you",
              "score": 1,
              "created_utc": "2026-02-19 19:33:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ab7m6",
          "author": "ChainAccomplished425",
          "text": "You got me curious!  \nI build the app [Qota](https://www.getquota.app).  \nHere's my \"elevator pitch\" about what it does:\n\nSplitting expenses with your partner or roommate shouldn't cause arguments. Qota lets you scan any receipt and our AI instantly recognizes every item — then you split each one individually with a slider, not just a flat 50/50. No subscription: you only pay when you scan, from as little as 3 cents. Available on Android and as a PWA, GDPR-compliant, servers in Germany.Splitting expenses with your partner or roommate shouldn't cause arguments. Qota lets you scan any receipt and our AI instantly recognizes every item — then you split each one individually with a slider, not just a flat 50/50. No subscription: you only pay when you scan, from as little as 3 cents. Available on Android and as a PWA, GDPR-compliant, servers in Germany.\n\nScan the receipt. Split it fairly. Done.",
          "score": 2,
          "created_utc": "2026-02-19 18:40:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ampqa",
              "author": "Different-Coat-652",
              "text": "Amazing! I'll be happy to create a video for you. I just sent you a message",
              "score": 1,
              "created_utc": "2026-02-19 19:34:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6aduoo",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-02-19 18:52:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6amt6j",
              "author": "Different-Coat-652",
              "text": "Hey! DMed you!",
              "score": 1,
              "created_utc": "2026-02-19 19:35:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ag5os",
          "author": "prashant_b",
          "text": "Arokiyam – A healthcare booking platform that lets patients instantly book verified doctors, labs, and hospitals with live token tracking, emergency priority access, and transparent ₹10 appointment fees. It also helps providers grow with zero-cost promotion and in-app discovery.  \n[https://arokiyam.in/](https://arokiyam.in/?utm_source=chatgpt.com)  \n[https://play.google.com/store/apps/details?id=com.marchehealthcare.doctorapp](https://play.google.com/store/apps/details?id=com.marchehealthcare.doctorapp)",
          "score": 2,
          "created_utc": "2026-02-19 19:03:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aha28",
          "author": "redit-ed",
          "text": "[Lampzi.com](http://lampzi.com) - A resume builder platform.",
          "score": 2,
          "created_utc": "2026-02-19 19:08:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ai7rp",
          "author": "atceb",
          "text": "We are building an AI-powered app that helps people stay present in the lives of those they care about.\nYou write a simple sentence like “My friend has an exam next Friday” or “My sister is starting a new job,” and the app turns it into gentle, well-timed reminders to check in, wish them luck, or ask how it went.\n\nIt’s not a to-do list or a social network — just a private tool designed to help you remember important moments and show up more consistently for the people that matter.\nwww.trywhisp.app",
          "score": 2,
          "created_utc": "2026-02-19 19:13:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aoqxl",
          "author": "andrebravado",
          "text": "I'll bite - quotecraft.co - conversational quoting app for uk tradesmen with live pricing lookup",
          "score": 2,
          "created_utc": "2026-02-19 19:44:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aorxp",
          "author": "pawreserve",
          "text": "super interesting! [pawreserve.pro](http://pawreserve.pro) \\- PawReserve helps independent pet care businesses manage bookings, clients, and revenue, without the complexity of enterprise software. It learns how your business operates and adapts to you.",
          "score": 2,
          "created_utc": "2026-02-19 19:44:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6arvvo",
          "author": "EnvironmentalCap1492",
          "text": "Interesting proposal.I'm building my newsletter documenting my journey from 0 to Growth Marketer. I don't have my own landing page yet (just Substack), but once I have one in a few weeks, this could be useful for distribution.Do videos perform better on LinkedIn or Twitter in your experience?",
          "score": 2,
          "created_utc": "2026-02-19 19:59:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6eehds",
              "author": "Nolan_Hatiya",
              "text": "yeah video usually pops more on LinkedIn from what ive seen, especially native uploads. Twitter/X is way more hit or miss unless u already have an audience. whats ur newsletter niche on Substack?",
              "score": 1,
              "created_utc": "2026-02-20 10:32:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ayzg3",
          "author": "dertobi",
          "text": "Love this initative, [https://lobsterlair.xyz](https://lobsterlair.xyz) \\- a hosted AI Agent based on OpenClaw",
          "score": 1,
          "created_utc": "2026-02-19 20:34:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b0q9m",
          "author": "blitztask",
          "text": "That's really cool! Definitely interested in this :D\n\n[blitztask.com](https://blitztask.com)\n\nhelps increase productivity using the Timeboxing method, as we like to put it this way: Brain Dump, Prioritize, Schedule.",
          "score": 1,
          "created_utc": "2026-02-19 20:43:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b1hlz",
          "author": "TheseMajor5418",
          "text": ">",
          "score": 1,
          "created_utc": "2026-02-19 20:47:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b5czs",
          "author": "runthetic",
          "text": "[runthetic](https://runthetic.com) Garmin focused Daily suggested workouts tailored to your goal and recent training data.",
          "score": 1,
          "created_utc": "2026-02-19 21:05:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bbbc4",
          "author": "Gullible-Concept2561",
          "text": "Nice :)  \n  \n[https://zapisowo.pl/](https://zapisowo.pl/)\n\nZapisowo helps extracurricular activity organizers replace spreadsheets, cash payments and manual coordination with a modern enrollment and payment system.\n\nOrganizers can manage classes, participant lists, payments and communication from one dashboard.\n\nWe’re building a two-sided marketplace that will connect parents with trusted local activity providers.",
          "score": 1,
          "created_utc": "2026-02-19 21:34:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bev0d",
          "author": "pvfakten",
          "text": "https://www.oidapost.com/\nSocial media on autopilot for vibe coders. \nLaunch in 2 weeks. Waitlist is open :)",
          "score": 1,
          "created_utc": "2026-02-19 21:52:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bukqa",
          "author": "ApartNote2940",
          "text": "Hey , nice to meet you . Message number 41: my app is https://libretti.app/ ( book tracker with social platform in it )",
          "score": 1,
          "created_utc": "2026-02-19 23:16:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bvnvi",
          "author": "mattfrasernz",
          "text": "[https://www.octero.app](https://www.octero.app)\n\nStrava for musicians. ",
          "score": 1,
          "created_utc": "2026-02-19 23:22:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6c7333",
          "author": "BestDay8241",
          "text": "Voice Sheet lets you add entries to your Google Sheets with simple voice. \n\nhttps://voicesheet.app",
          "score": 1,
          "created_utc": "2026-02-20 00:28:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cmwy3",
          "author": "Ali729",
          "text": "Hello - seems like a good idea - hopefully it works out for you \nBasically I have the only brand in Pakistan providing renewed laptops and Chromebooks with 1-year warranty, A+ grading, and premium packaging (as nearly 95% of the population can't buy new, and remain stuck with low-quality used ones without any warranty).\nHere is my website: www.acetech.pk",
          "score": 1,
          "created_utc": "2026-02-20 02:05:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cs40y",
          "author": "deadfire55",
          "text": "Thanks for doing this! An app to get notified when the aurora is visible near you or on flights that you're going to be on https://apps.apple.com/us/app/aurora-buddy/id6757205504",
          "score": 1,
          "created_utc": "2026-02-20 02:36:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ctm48",
          "author": "subaru_kun33",
          "text": "This is web application to tailor your resume for every job description using Ai. And also it keeps tracks of your applications and everything. With a built-in job board so that you guys can share job opportunities with each other. We can really use one..\n\nhttps://moltjobs.lovable.app/",
          "score": 1,
          "created_utc": "2026-02-20 02:46:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d2tok",
          "author": "Icy_Mud5419",
          "text": "I’m interested! https://rewardsbunny.com",
          "score": 1,
          "created_utc": "2026-02-20 03:44:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d3uyf",
          "author": "pchalita",
          "text": "I'm interested! My site in Spanish but soon also in English https://blstherapy.com",
          "score": 1,
          "created_utc": "2026-02-20 03:51:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d6lyp",
          "author": "Indigenous_HUSLR",
          "text": "ScanWerx 3D - AI-powered construction documentation and progress monitoring utilizing autonomous drones serving heavy civil/infrastructure general contractors and owners. \n\nWww.sw3d.com",
          "score": 1,
          "created_utc": "2026-02-20 04:10:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dk4tm",
          "author": "ShukantPal",
          "text": "I'm building Sonar, a AEO tool that helps you track and improve your visibility in AI search.\n\nWe're not just a simple tracking tool — our workflow lets you quickly generate content, ask for backlinks, do guest posts, etc.\n\n[https://trysonar.ai](https://trysonar.ai)",
          "score": 1,
          "created_utc": "2026-02-20 05:53:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dpgmp",
          "author": "pn2327",
          "text": "nVariant lets SaaS teams create interactive product demos that prospects can explore instantly via a shared link or embedded directly on the company’s website.\n\nInstead of walking someone through complex workflows over a call, you can let them click through the actual product flow step by step on their own.\n\nFor workflow-heavy products, this helps buyers understand how the system actually works before a deeper sales or technical conversation.\n\nBeyond basic views, nVariant shows exactly how users moved through the demo, where they slowed down, skipped steps, or dropped off, with full session timelines and navigation paths, so teams can see what actually happened during the exploration.\n\nhttps://nvariant.ai/",
          "score": 1,
          "created_utc": "2026-02-20 06:39:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dsq5w",
          "author": "alphaxtitan",
          "text": "AI native all in one edu platform for engineers\n\nhttps://coderden.in\n\nJust launched private beta, looking for a launch video for the platform, have no idea where to start",
          "score": 1,
          "created_utc": "2026-02-20 07:08:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6e10u3",
          "author": "Crazy_Patient4364",
          "text": "Thats tough",
          "score": 1,
          "created_utc": "2026-02-20 08:25:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6e4zf1",
              "author": "Crazy_Patient4364",
              "text": "Bro i just tried it for like 30mins, nice graphics but the sound lagging and it deletes scenes i never ask to delete would prefer to have a drag around function to reorder scenes ourself. Send u a dm!",
              "score": 1,
              "created_utc": "2026-02-20 09:03:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6e905p",
          "author": "Visible-Mix2149",
          "text": "WOW! I've been procrastinating this task for so long.\n\n[https://predflow.ai/](https://predflow.ai/) \\- building predflow, it's AI Agent for D2C brands who spend heavily on performance marketing, it tells them which ads are not working, why they are not working and what exactly to fix ",
          "score": 1,
          "created_utc": "2026-02-20 09:41:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ekkex",
          "author": "Busy_Trouble9769",
          "text": "www.stoxii.com",
          "score": 1,
          "created_utc": "2026-02-20 11:24:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gt0t8",
          "author": "dev_addicted",
          "text": "Road trip planner app, invite friends, discover places in the route, split expanses, select vehicles, see multiple vehicles location etc.",
          "score": 1,
          "created_utc": "2026-02-20 18:26:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6h11tp",
          "author": "Xenopica",
          "text": "X profile customization tool. It shows live banner that updates as the data changes. It can display wide range of infographics including github activity, tweeting activity, earning over time from stripe, moon phase on the day, or some beautiful gradient patterns on the banner with auto updating quotes. \n\nWould appreciate if you could make a video for it using the website graphics as reference. Here is the link. https://xenopic.us",
          "score": 1,
          "created_utc": "2026-02-20 19:03:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6hs8v",
      "title": "SaaS & App founders/owners: how do you reach real users?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r6hs8v/saas_app_foundersowners_how_do_you_reach_real/",
      "author": "Holiday_Respect9583",
      "created_utc": "2026-02-16 18:34:44",
      "score": 16,
      "num_comments": 30,
      "upvote_ratio": 1.0,
      "text": "Not other builders.\n\nNot devs.\n\nNot people hanging out in SaaS/indie hacker subreddits.\n\nI mean **actual end users**.\n\nHow do you find them **organically** — in relevant communities that aren’t necessarily tech-focused — both on Reddit and social media?\n\nHow do you do it without breaking rules or sounding spammy?\n\nAnd how do you avoid falling for “marketing experts” who promise users but mostly sell hype?\n\n\n\nWould genuinely appreciate your advice.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r6hs8v/saas_app_foundersowners_how_do_you_reach_real/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5qewd8",
          "author": "wandrhealth",
          "text": "Following. We are a medical startup that is B2C so looking to improve end-user reach.",
          "score": 2,
          "created_utc": "2026-02-16 19:08:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qmig5",
              "author": "Holiday_Respect9583",
              "text": "Good luck to you too.",
              "score": 1,
              "created_utc": "2026-02-16 19:44:57",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o5rak61",
              "author": "useomnia",
              "text": "B2C medical is extra spicy because trust is everything",
              "score": 1,
              "created_utc": "2026-02-16 21:42:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5rbxdb",
                  "author": "wandrhealth",
                  "text": "We are founded by a physician and physician assistant so we both have a medical background and both currently work in the ED 🏥 \n\nI believe it gives us a lot of legitimacy! You’re absolutely on the mark when it comes to trust (especially in this day and age)",
                  "score": 2,
                  "created_utc": "2026-02-16 21:49:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5qfrv9",
          "author": "Pristine-Farm7249",
          "text": "I’ve built multiple tools for myself I don’t want to spam here so I won’t be dropping links and stuff but one tool I use to grow my X/Twitter account which is integrated ai assistant and other one I’ve built an analytics tool for Reddit that searches through posts and replies to find you leads with problems you’ve solved. But also I use it for posting on Reddit and being helpful. I guess key is doing organic content and being really helpful. Like that you naturally attract interested people but it takes time an effort and luck. Depends if you are willing to put the work for quite some time",
          "score": 2,
          "created_utc": "2026-02-16 19:12:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5s6scf",
              "author": "MusicTechGearhead",
              "text": "Did you create a profile for your product to reply or did you reply from your personal account?",
              "score": 1,
              "created_utc": "2026-02-17 00:36:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qg2bc",
          "author": "Confident_Box_4545",
          "text": "Reddit and x are the only real platforms. And don't think your gonna post once and get the user no. You post daily a lot give value non stop and the users come.",
          "score": 2,
          "created_utc": "2026-02-16 19:13:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qlgpr",
              "author": "Holiday_Respect9583",
              "text": "What about the others social networks?",
              "score": 1,
              "created_utc": "2026-02-16 19:39:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5twnuo",
                  "author": "Confident_Box_4545",
                  "text": "I would say make your first few sales on the 2 i mentioned and only later branch out when you have sales rolling in and have doubled down.",
                  "score": 1,
                  "created_utc": "2026-02-17 07:47:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5qnoeb",
          "author": "kubrador",
          "text": "you go where they already hang out solving the problem manually. a project management saas founder doesn't fish in r/startups, they lurk in r/projectmanagement or niche subreddits where people are complaining about their current workflow.\n\nreddit's anti-spam rules actually help here. just don't pitch. answer questions in character as someone who uses your thing. drop it naturally when relevant. mods will nuke you if you're obvious about it but \"i built this and it's free to try\" buried in genuine help usually passes.\n\nfor social, tiktok and youtube comments in non-tech niches are goldmines because nobody's marketing there yet. instagram in specific communities too.\n\nif a \"growth expert\" promises users without you naming your specific target community, they're selling placebo. real growth is boring. it's just showing up in the right place consistently and being useful first",
          "score": 2,
          "created_utc": "2026-02-16 19:50:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qt3y2",
          "author": "e_ai_gabriel",
          "text": "I use an AI-powered lead generation tool. I find people who are already requesting the solution I offer and approach them. This tool alerts me very early, within the first few minutes of the post, so I can approach the lead and capture views from the post's readers, which is strongest in the first 2 hours here on Reddit. I'm even the creator of such a tool, and the return is incredible. I even found your post through it while I was monitoring my own leads. This is just proof that there are truly interesting tools for finding qualified leads.\n\nhttps://preview.redd.it/uzgyb3n30xjg1.jpeg?width=2113&format=pjpg&auto=webp&s=01fe89e7b5de9fcb20632578030d7083bbf23944",
          "score": 1,
          "created_utc": "2026-02-16 20:17:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5racp1",
              "author": "Playful_Outcome5435",
              "text": "I also use a lead generation tool for reddit, leadmatically. t scans for those request posts and lets me jump in while the conversation’s fresh.",
              "score": 1,
              "created_utc": "2026-02-16 21:41:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5u4xeh",
              "author": "mikkelatbonnie",
              "text": "Can you send me a link?",
              "score": 1,
              "created_utc": "2026-02-17 09:05:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5uktev",
                  "author": "e_ai_gabriel",
                  "text": "I sent the link via DM so as not to violate the sub's rules.",
                  "score": 1,
                  "created_utc": "2026-02-17 11:30:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5qvprh",
          "author": "decebaldecebal",
          "text": "The trick is you stop thinking like a founder and start thinking like your user.\n\nYour users don't hang out in r/SaaS. They hang out wherever their problem lives. If you built something for real estate agents, they're in Facebook groups complaining about lead follow-up.\n\nThen lurk before you post. Read what people complain about. Use their exact words. When you do contribute, be useful first. \"I built X\" gets ignored. \"I was dealing with Y problem and here's what worked\" gets read.\n\nFor avoiding marketing hype, if someone promises a specific number of users, run. Early growth is ugly and manual. DMing people, joining calls, getting feedback that hurts. It takes a lot of time but I don't think there is another \n\nI struggled with this across multiple products and ended up building a structured framework around it, but the core is simple: go where your users are, listen first, be useful.",
          "score": 1,
          "created_utc": "2026-02-16 20:30:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vwfit",
              "author": "RoleHot6498",
              "text": "I'm a prize for the most useful comment goes to... You. This is solid advice, the changing of the perception from developer to user makes all the difference",
              "score": 1,
              "created_utc": "2026-02-17 16:06:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5r1snk",
          "author": "Zealousideal-Mood469",
          "text": "the biggest shift for me was realizing  \nYour users don’t hang out where builders hang out.\n\nThey hang out where their problems are discussed.\n\nInstead of searching SaaS communities, search\n\n* Industry-specific subreddits\n* Facebook groups tied to professions\n* Niche Discord/Slack groups\n* Local/regional associations\n\nThen don’t sell Observe language first",
          "score": 1,
          "created_utc": "2026-02-16 21:00:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r4mws",
          "author": "greyzor7",
          "text": "Start with organic channels and outbound/DMs (warm).Channels where your ICP is.\n\nTry launching your app on a combo of social media: X/Twitter, Reddit + launch platforms: Product Hunt, Microlaunch. And any channel relevant to your ICP.\n\nRun campaigns, measure all ROIs, then simply double down on what worked. Then keep doing this until you get users & customers.\n\nFix conversions, channel selection, targeting when necessary.",
          "score": 1,
          "created_utc": "2026-02-16 21:13:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ra8m9",
          "author": "useomnia",
          "text": "Builders tend to hang out with other builders because it feels productive. But then the actual users are hanging out in communities where they're frustrated, looking for solutions, and talking about their daily challenges.\n\nPick one specific pain point and position yourself in the places where that pain shows up every single day. I'm not talking about the typical SaaS subreddits. I mean the boring industry-specific communities where real professionals are venting about real problems. Spend a solid week just reading and absorbing. Pay attention to their exact phrasing, the words they use, the way they describe their frustrations. Then start answering questions like a helpful peer who genuinely understands their situation, not like a founder trying to push a product.\n\nif you can't name at least 10 communities where your users complain in plain English about the problem you solve you have a targeting problem. That's a fundamentally different challenge to solve first.\n\nRun the questions your users actually ask through ChatGPT or Google's AI features. When the answers keep citing the same sites and threads over and over, those are your real watering holes. That's where you need to show up first.",
          "score": 1,
          "created_utc": "2026-02-16 21:41:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s0pdq",
          "author": "amberjletang",
          "text": "Actual users aren't in builder subreddits - they are in niche communities solving specific pain points. To find them organically, you have to stop pitching and start auditing. \n\nIdentify a non-tech subreddit where your tool solves a primary friction point. Provide a high-signal diagnostic of their problem without mentioning your link. If your insight proves you understand their workflow better than they do, they will seek out your solution.\n\nI focus on building these organic discovery loops by mapping the 'Cost of Friction' for the end user. When you solve a bottleneck, you aren't a spammer; you are essential infrastructure.",
          "score": 1,
          "created_utc": "2026-02-17 00:01:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5scwkc",
          "author": "No-Common1466",
          "text": "For me, simple DM first in Reddit, X, Facebook Group on communities where your ICP hangs out. Get initial users first and get feedback. The. Switch to inbound lead through SEO and content. I post 3 articles per day in LinkedIn, Substack and medium, and X threads. I use my own tool to get ideas based on users pain points and signals. My site is getting 300 unique visitors daily and I just started doing it consistently 3 days ago. It's a long term process. Articles and SEO not only get your Saas search from Google, it also gets recommended by AIs Like ChatGPT to recommend your tool.",
          "score": 1,
          "created_utc": "2026-02-17 01:12:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tyyuc",
          "author": "Forsaken_Lie_8606",
          "text": "Biggest mistake is starting on Reddit. Your actual users are on Facebook groups, Discord servers for specific niches, and where they complain about existing tools. Search Twitter for people frustrated with competitors - thats your gold mine.",
          "score": 1,
          "created_utc": "2026-02-17 08:08:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5u59k3",
              "author": "mikkelatbonnie",
              "text": "What's the best way to find the discords?",
              "score": 1,
              "created_utc": "2026-02-17 09:09:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5us3qx",
          "author": "sawaisingh",
          "text": "Most founders look for users on platforms.\n\nReal users don’t gather around platforms. They gather around problems.\n\nIf your app solves a specific pain, the question isn’t “where do users hang out?” It’s:\n\nWhere do they complain?  \nWhere do they ask for workarounds?  \nWhere do they compare tools?  \nWhere do they describe frustration?\n\nThose spaces are rarely SaaS subreddits. They’re niche forums, Slack groups, industry communities, local Facebook groups, Discord servers, even comment sections under relevant YouTube videos.\n\nThe second shift is intent. Instead of entering with “how do I promote this?”, enter with “can I understand this problem better?”\n\nThe founders who avoid sounding spammy are usually the ones not trying to sell immediately. They answer questions, share useful breakdowns, and mention their tool only when it genuinely fits.\n\nAs for avoiding hype marketers: if someone promises “users,” ask how they define qualified demand and how they measure retention, not just signups.\n\nUsers are rarely acquired in bursts organically. They compound from repeated visibility inside the right micro-communities.",
          "score": 1,
          "created_utc": "2026-02-17 12:26:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uzh57",
          "author": "Different_Dinner9267",
          "text": "That's the real question honestly. Most founders market to other founders and wonder why they have no real users.\n\nWhat works: find nano/micro creators who already talk to YOUR end users. Not tech influencers, but people in the niche your product actually serves. A budgeting app? Find personal finance creators. A fitness SaaS? Find workout YouTubers. These creators already have the trust of the exact people you're trying to reach.\n\nStart with 10-15 creators, small fixed fee + commission per signup. You get authentic content in front of real users, not other builders scrolling Reddit.\n\nAnd to avoid the \"marketing experts\" selling hype, only work with people who accept performance-based deals. If they won't tie their pay to results, that tells you everything you need to know.",
          "score": 1,
          "created_utc": "2026-02-17 13:13:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o607npi",
          "author": "PageQR",
          "text": "I'm also finding this a huge challenge. Especially as a first-time SaaS/doing-your-own-thing builder. I think the outreach part is definitely a much harder pull than building these days since we have LLMs/AI to build for us. ",
          "score": 1,
          "created_utc": "2026-02-18 05:44:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60cyrp",
          "author": "Bendecx",
          "text": "For B2B we use mainly SEO & GEO also Linkedin.",
          "score": 1,
          "created_utc": "2026-02-18 06:27:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o616dmk",
          "author": "Popular-Penalty6719",
          "text": "Start by identifying where your target audience spends their time. Look beyond tech forums and go to places related to their interests or pain points. Join relevant Facebook groups, subreddits related to specific hobbies or needs, and online communities that align with your product.\n\nEngage authentically. Provide useful insights related to your area. Answer questions, share knowledge, and be a part of the conversation without forcing your product into every discussion. \n\nCreate content that genuinely solves problems for your audience. Focus on forums or platforms where they look for help, not where they consume promotional material. \n\nWatch out for \"marketing experts\" who oversell promise. Many of these strategies sound good but often don’t translate to real users. Instead, aim for clear, actionable steps that foster connection over empty marketing jargon. \n\nFinally, never underestimate word of mouth. It's powerful!! Build a product that people **want to talk about**, then let them spread the word.",
          "score": 1,
          "created_utc": "2026-02-18 10:53:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6337yi",
          "author": "Kpow_636",
          "text": "I built my social media presence first before I built my apps.",
          "score": 1,
          "created_utc": "2026-02-18 17:12:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7yigg",
      "title": "Best AI content moderation tools for detecting coordinated brand attacks & fake reviews on social media",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r7yigg/best_ai_content_moderation_tools_for_detecting/",
      "author": "Aggravating_Log9704",
      "created_utc": "2026-02-18 09:31:03",
      "score": 14,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "I work on marketing and trust & safety for a mid-sized ecommerce platform selling lifestyle products online, and we've seen a clear surge in coordinated disinformation campaigns targeting our brand. Fake posts, misleading reviews, impersonator accounts, and attacks on social media are spreading much faster than we can respond. Manual monitoring is completely overwhelmed and always one step behind.\n\nWe're looking for smarter, proactive solutions using AI content moderation to detect, flag, and contain these campaigns before they damage customers or reputation. The goal is consistent enforcement across platforms without drowning in false positives or over-flagging legitimate user content.\n\nFor other brands or platforms dealing with similar coordinated attacks, has anyone implemented AI systems that actually stay ahead of the curve?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r7yigg/best_ai_content_moderation_tools_for_detecting/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o60y77h",
          "author": "NSRPAIN",
          "text": "If you want AI moderation that actually stays ahead think systems not tools. Use AI for detection across text and behavioral patterns social listening for spread mapping and human review for enforcement. Pure moderation tools will not stop coordinated campaigns because those are distribution problems not just content problems. The brands doing this well treat it like growth analytics in reverse tracking how narratives spread and shutting them down early instead of just deleting bad posts.",
          "score": 7,
          "created_utc": "2026-02-18 09:41:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o610bt4",
          "author": "MetKevin",
          "text": "One reality check... false positives will happen and if you over automate enforcement you will anger legit users fast. Most mature teams keep AI as the triage layer then route edge cases to humans. The real ROI is response speed not full automation.",
          "score": 4,
          "created_utc": "2026-02-18 10:00:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o610xnn",
          "author": "Efficient_Agent_2048",
          "text": "The biggest shift is moving from keyword filtering to behavior analysis. Fake reviews and coordinated attacks usually show weird timing patterns account clusters and amplification loops. AI is actually decent at spotting that.",
          "score": 2,
          "created_utc": "2026-02-18 10:06:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64ci0f",
          "author": "Witty_Habit8155",
          "text": "The accounts and fake reviews is fairly doable with Cotera (think ChatGPT but with tools) - basically you have an AI agent that can go and read reviews (it has a google shopping search and review tool), plus search twitter and stuff. There's also a \"Detect AI Text\" tool that can check to see what percent of the text in the review/post is AI generated. \n\n  \nThis agent prompt gets you most of the way there, just add the \"Detect AI Text\" tool: [https://cotera.co/solutions/marketing/prompts/brand-monitoring](https://cotera.co/solutions/marketing/prompts/brand-monitoring)",
          "score": 1,
          "created_utc": "2026-02-18 20:37:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o665woe",
          "author": "BuildingIncomeDaily",
          "text": "You’re describing a problem a lot of mid-sized platforms are hitting now — coordinated disinformation spreads faster than any manual team can keep up with. AI can help, but it’s about combining detection, context, and proactive moderation, not just keyword flags. Here’s a framework based on what others in ecommerce and social media have successfully done:\n\n1. Real-Time Content Monitoring\nAI-powered NLP models can scan posts, reviews, comments, and user profiles for patterns typical of coordinated campaigns (repeated language, unnatural posting cadence, duplicate media).\nUse embeddings and semantic similarity, not just keywords, so subtle misinformation doesn’t slip through.\nSome teams feed this into streaming analytics (Kafka, Snowflake, or similar) to flag spikes immediately.\n\n2. Coordinated Behavior Detection\nBeyond single posts: look for behavioral fingerprints across accounts.\nRed flags include:\nAccounts created recently posting similar content\nMultiple accounts sharing the same links/media\nRapid comment/review bursts\nGraph-based AI (network analysis) helps detect clusters of suspicious activity even if individual posts look normal.\n\n3. Cross-Platform Intelligence\nSocial media attacks often span multiple channels.\nAggregating data from Instagram, Twitter/X, Reddit, and review sites into one AI pipeline allows the system to spot trends before they peak.\nSome brands use cloud-based content moderation APIs that integrate multiple platforms (Azure, Google, AWS) with their own ML models.\n\n4. Reduce False Positives\nCombine AI signals with confidence thresholds and human-in-the-loop review for high-risk cases.\nTrain your model with historical data of false flags vs true attacks — supervised fine-tuning dramatically reduces over-flagging legitimate users.\nImplement feedback loops: flagged content that is later confirmed as legitimate feeds back into retraining.\n\n5. Proactive Containment\nSome teams automatically quarantine posts for review, limit reach, or temporarily restrict suspicious accounts.\nPrioritize high-impact content: posts with high engagement, high brand mentions, or virality potential.\nAutomation should focus on speed, while critical judgement is reserved for nuanced cases.\n\n6. Integrating With Existing Trust & Safety Workflows\nAPI-first moderation pipelines let you inject AI flags directly into your CRM or platform dashboard.\nAlerts + dashboards = visibility without drowning your team.\n\nUse AI models trained specifically on your brand’s content; generic models often miss subtle attacks or create unnecessary noise.\n\nAI works best when you combine semantic content analysis, coordinated behavior detection, cross-platform intelligence, and human-in-the-loop review. Start by mapping your high-risk vectors, then deploy models that flag suspicious clusters, not just individual posts. Over time, retraining on confirmed attacks vs false positives is what keeps AI ahead.",
          "score": 1,
          "created_utc": "2026-02-19 02:17:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7wwis",
      "title": "Had an awful experience with an AEO tracking platform, what's a good alternative?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r7wwis/had_an_awful_experience_with_an_aeo_tracking/",
      "author": "Academic_Way_293",
      "created_utc": "2026-02-18 07:49:46",
      "score": 13,
      "num_comments": 9,
      "upvote_ratio": 0.9,
      "text": "So I finally had enough with my first AEO tracking tool (Profound) Their support team was really unhelpful and kept putting off my requests for weeks, even though I was subbed to their most premium subscription..\n\nAnyway, I'm done with them and now I'm trying to look at alternatives. I wanted to go with Airops at first but I saw several bad reviews, so now I'm leaning towards something like Promptwatch.\n\nBut before making a decision, I wanna know if you guys have better alternatives? (Bonus points if it has content generation too, not just tracking)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r7wwis/had_an_awful_experience_with_an_aeo_tracking/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o60mshr",
          "author": "Used_Rhubarb_9265",
          "text": "Been there, stuck with a lame tool is the worst.\n\nPromptwatch is solid for tracking + gen, but also check out GrowTool and TrackerAI — both have way better support and actually ship features fast.\n\nIf content gen matters, TrackerAI’s built-in prompts are worth it. Make sure to test support before committing again.\n\nGood luck 👌",
          "score": 1,
          "created_utc": "2026-02-18 07:54:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60mu9y",
          "author": "Background_Neck9690",
          "text": "nice to see it isn't just me, luckily i cancelled my Profound way before the next bill payment. I swear by Promptwatch, and since it looks like you're looking for a responsive support team, that's exactly what they offer. I had an issue at 2am and I got a response within 5 mins (not a generic AI chatbot but a real tech support staff)",
          "score": 1,
          "created_utc": "2026-02-18 07:54:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o61yzqd",
          "author": "Forsaken_Lie_8606",
          "text": "ngl ive been in a similar situation before, switched from a crappy aeo tracking tool to something way better, so i feel you. i used to pay like 500 bucks a month for a tool that was supposed to help me optimize my ad campaigns, but the support was trash and it didnt even deliver the results they promised. anyway, i ended up switching to adplexity and its been a game changer, their support team is actually helpful and the tool itself is way more intuitive. ngl, i was a bit skeptical at first, but they have a free trial so you can test it out before committing to a paid plan, might be worth checking%sout just my 2 cents",
          "score": 1,
          "created_utc": "2026-02-18 14:03:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62vace",
          "author": "Ranocyte",
          "text": "man that sucks about the support issues. hate when tools ghost you after taking the money\n\nfull disclosure: i'm actually building a competitor called getspotted specifically cause i wasn't happy with the current data accuracy in other tools\n\nto answer your point on content gen -> we don't generate the text (i honestly just use claude/gpt for that), BUT we focus on the outreach part\n\nbasically instead of just tracking rankings, my tool finds the emails of the authors/sites that do rank so you can actually contact them. feel like that's the missing link in most AEO tools right now\n\nhappy to hook you up with some free credits if you wanna test it out vs profound. no pressure though",
          "score": 1,
          "created_utc": "2026-02-18 16:37:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6334xz",
          "author": "cheerioskungfu",
          "text": "Profound demos are great, but the actual product is less so. We moved to limy and the difference in data quality was immediate. Its llms traffic attribution actually works, unlike the others. ",
          "score": 1,
          "created_utc": "2026-02-18 17:12:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66jehb",
          "author": "amberjletang",
          "text": "The lack of support is usually a sign that a tool is scaling too fast for its own infrastructure. If you're looking for AEO tracking that doesn't just give you raw data but actually helps with the content side, you might want to look into tools that focus on entity-based SEO. \n\nThe shift from standard keyword tracking to AEO means you need a platform that understands how LLMs are sourcing their citations. Instead of just Promptwatch, look for something that maps your topical authority. It makes the content generation side much more effective because you’re building for the knowledge graph rather than just a search result page.",
          "score": 1,
          "created_utc": "2026-02-19 03:37:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o670by6",
          "author": "botapoi",
          "text": "honestly if you're looking to build your own tracking setup instead of relying on another third party, i've seen people build custom dashboards on blink that track whatever metrics they need, gives you way more control than dealing with support tickets. might be worth exploring before committing to another platform with the same issues",
          "score": 1,
          "created_utc": "2026-02-19 05:33:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o677uuu",
          "author": "o1got",
          "text": "this is a tough spot because the AEO tooling space is still super early and fragmented.  \n  \nFrom what I've seen, most of the current platforms are really just starting to figure out what metrics even matter for AI answer optimization. Like, are you tracking citation appearances? Brand mentions? Position in responses across different AI engines? The problem is every tool seems to measure slightly different things, so switching means you're kind of starting your baseline over.  \n  \nI don't have personal experience with Promptwatch but I'd be careful about going all-in on something that combines tracking + content generation. Those tend to do both things in a mediocre way instead of one thing really well. Might be worth using separate tools even if it's a bit more annoying to manage.  \n  \nThe real question is what you actually need from tracking. If you're trying to measure brand visibility in AI responses, you probably want something different than if you're trying to optimize for specific product queries. I'd figure that out first before committing to another annual plan or whatever.",
          "score": 1,
          "created_utc": "2026-02-19 06:34:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kzddp",
          "author": "InfiniteCobbler2073",
          "text": "I got an awful experience with Profound too. It suddenly track unrelevant queries. They told me to wait but nothing fixed. By the way do you have a budget in mind?",
          "score": 1,
          "created_utc": "2026-02-21 10:50:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7j644",
      "title": "How are you storing long-term context for agents?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r7j644/how_are_you_storing_longterm_context_for_agents/",
      "author": "Kabhishek92",
      "created_utc": "2026-02-17 21:21:02",
      "score": 12,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Anyone else feel like most AI agents + automations are just… fancy goldfish? \n\nThey look smart in demos.  \nThey work for 2–3 workflows.  \nThen you scale… and everything starts duct-taping itself together.\n\nWe ran into this hard.\n\nAfter processing 140k+ automations, we noticed something:\n\nMost stacks fail because there’s no persistent context layer.\n\n* Agents don’t share memory\n* Data lives in 5 different tools\n* Workflows don’t build on each other\n* One schema change = everything breaks\n\nIt’s basically running your business logic on spreadsheets and hoping nothing moves.\n\nSo we built [Boost.space v5](https://www.producthunt.com/posts/boost-space-v5), a shared context layer for AI agents & automations.\n\nThink of it as:\n\n* A scalable data backbone (not just another app database)\n* A true Single Source of Truth (bi-directional sync)\n* A “shared brain” so agents can build on each other\n* A layer where LLMs can query live business data instead of guessing\n\nInstead of automations being isolated scenarios…  \nThey start compounding.\n\nThe more complex your system gets, the more fragile it becomes, hence you need a shared context for your AI agents and automations. \n\nWhat are you all using right now as your “source of truth” for automations? Airtable? Notion? Custom DB? Just vibes? 😅",
      "is_original_content": false,
      "link_flair_text": "ToolSet",
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r7j644/how_are_you_storing_longterm_context_for_agents/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5xqin4",
          "author": "Kabhishek92",
          "text": "If you resonate with the context and memory problem while scaling complex automations, check out Boostspace v5 and share your feedback >> [https://www.producthunt.com/posts/boost-space-v5](https://www.producthunt.com/posts/boost-space-v5) ",
          "score": 1,
          "created_utc": "2026-02-17 21:21:33",
          "is_submitter": true,
          "replies": [
            {
              "id": "o5y59jw",
              "author": "Conscious_Sock_4178",
              "text": "Yeah, the \"fancy goldfish\" analogy is pretty spot on. We've been leaning heavily into custom DBs tied to specific workflows, but that sounds like what Boost.space is trying to solve.",
              "score": 1,
              "created_utc": "2026-02-17 22:32:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o63bob1",
          "author": "Confident-Tank-899",
          "text": "This context persistence challenge is huge. I've found that most scaling failures happen because agents lose context across sessions. The vector DB approach helps, but you also need a runnable workflow that can retrieve and apply historical context effectively.\n\n\n\nWe've had success using a hybrid approach where frequently accessed context is cached in-memory and historical context is fetched on-demand. The key is making sure your agent workflows are runnable across multiple context windows without degradation.",
          "score": 1,
          "created_utc": "2026-02-18 17:50:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aksem",
          "author": "Alarming_Bluebird648",
          "text": "That 'duct-taping' usually happens because standard vector retrieval isn't a replacement for actual state management. If you're hitting six-figure automation volumes, you need a graph-based memory layer or a dedicated key-value store to maintain logic across disparate nodes.",
          "score": 1,
          "created_utc": "2026-02-19 19:25:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g0zqj",
          "author": "Obvious_Initiative72",
          "text": "Hi, I need help. My husband is cheating on me and I need evidence of that, could someone show me how to hack into a couple Ig accounts?",
          "score": 1,
          "created_utc": "2026-02-20 16:19:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5ep3p",
      "title": "I automated my lead generation process for under 2$. Heres what i built.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r5ep3p/i_automated_my_lead_generation_process_for_under/",
      "author": "Confident_Box_4545",
      "created_utc": "2026-02-15 13:31:15",
      "score": 10,
      "num_comments": 39,
      "upvote_ratio": 0.92,
      "text": "I have been running automated linkedin prospecting using Apify the cost is 1$ per 1K results posts scrapes scores and in the end in delivers valuable leads that i then outreach to. Happy to share if anyone wants the stack!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r5ep3p/i_automated_my_lead_generation_process_for_under/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5ijw7c",
          "author": "sprchrgd_adrenaline",
          "text": "Dude's selling a course to teach it 🤣 that's why the DM",
          "score": 2,
          "created_utc": "2026-02-15 14:53:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5jjgvi",
              "author": "frontier-seo",
              "text": "classic. just share here you grifter",
              "score": 1,
              "created_utc": "2026-02-15 17:49:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5iony4",
              "author": "Confident_Box_4545",
              "text": "I get why you think that but this isn't a course at all. Even with a course it would take ages for a person to build the system!",
              "score": 0,
              "created_utc": "2026-02-15 15:18:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ldck7",
                  "author": "cj1080",
                  "text": "Ian trying to build something like this with Python, playwright and Gemini\n\nSo far I have gotten it to post on LinkedIn and on my companies profile\n\nBut now looking at making it do lead generation with intense human like activities \n\nI have built one that posts and shares viral videos on x,Instagram and LinkedIn.",
                  "score": 1,
                  "created_utc": "2026-02-15 23:27:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5v23jc",
          "author": "Beautiful_Acadia_460",
          "text": "Share please",
          "score": 2,
          "created_utc": "2026-02-17 13:29:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5w3zra",
              "author": "Confident_Box_4545",
              "text": "dm me.",
              "score": 1,
              "created_utc": "2026-02-17 16:45:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ifzsl",
          "author": "Accurate-Geologist12",
          "text": "Sure please do share.",
          "score": 1,
          "created_utc": "2026-02-15 14:31:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ig4on",
              "author": "Confident_Box_4545",
              "text": "Dm me! we can talk more in depth.\n\n",
              "score": 1,
              "created_utc": "2026-02-15 14:32:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ig4dx",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-15 14:32:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ig6s8",
              "author": "Confident_Box_4545",
              "text": "Dm me!",
              "score": 1,
              "created_utc": "2026-02-15 14:32:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5j0nns",
          "author": "No_Boysenberry_6827",
          "text": "we hit this exact wall two years ago. built systems for clients, watched them collapse at scale. finally rebuilt from scratch with automated context tracking and intent signals. went from manual chaos to 3x pipeline with half the team size. the shift wasn't more features, it was smarter automation in the right places. what's your biggest bottleneck when things start to break?",
          "score": 1,
          "created_utc": "2026-02-15 16:17:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5j1iw1",
              "author": "Confident_Box_4545",
              "text": "I don't see it breaking any time soon under the load we are at currently maybe over 100 concurrent users would break it in some way but i don't really see that happening. We can scale pretty nicely the main part is just time now using the product to sell the product!",
              "score": 1,
              "created_utc": "2026-02-15 16:21:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5jc6pn",
                  "author": "No_Boysenberry_6827",
                  "text": "the scaling question is the right one to be asking early. we hit that wall around 80 concurrent users and the fix wasn't what we expected. it wasn't infrastructure, it was the lead scoring layer bottlenecking everything. once we redesigned how the system prioritizes and routes leads in real time, it scaled way beyond what we thought possible. are you selling this as a product or using it internally?",
                  "score": 1,
                  "created_utc": "2026-02-15 17:13:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5j93dd",
          "author": "Competitive_Star2448",
          "text": "Could u share it",
          "score": 1,
          "created_utc": "2026-02-15 16:58:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n5kvt",
              "author": "Confident_Box_4545",
              "text": "Yeah i could dm me we'll talk!",
              "score": 1,
              "created_utc": "2026-02-16 06:45:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5jkaby",
          "author": "unicorn69love",
          "text": "yo thats dope for cheap linkedin scrapes but if you want full automation clienthunter crushes it ai hunts b2b leads everywhere crafts killer personalized emails and follows up smart saved my ass scaling outreach without the manual grind",
          "score": 1,
          "created_utc": "2026-02-15 17:53:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n5pid",
              "author": "Confident_Box_4545",
              "text": "Is that for email? linkedin dm's have a 3x reply rate if done well.",
              "score": 1,
              "created_utc": "2026-02-16 06:46:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5kuzez",
          "author": "bigpurpleoctopus",
          "text": "Instagram wale idhar bhi agaye kya 😂 comment “dm” and I’ll dm 😝",
          "score": 1,
          "created_utc": "2026-02-15 21:47:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5m61dm",
          "author": "Significant_Key6021",
          "text": "Please share.",
          "score": 1,
          "created_utc": "2026-02-16 02:24:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n5qde",
              "author": "Confident_Box_4545",
              "text": "Dm me we can talk!",
              "score": 1,
              "created_utc": "2026-02-16 06:47:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5my6o7",
          "author": "Adventurous_Ice1481",
          "text": "Sure please share 😀",
          "score": 1,
          "created_utc": "2026-02-16 05:42:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n5rca",
              "author": "Confident_Box_4545",
              "text": "If you wanna learn more just dm me!",
              "score": 1,
              "created_utc": "2026-02-16 06:47:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5n54ta",
          "author": "Less-Advertising4580",
          "text": "Scraping cheap is cool.  \nThe real bottleneck usually isnt cost though its signal quality.1,000 scraped profiles 1,000 inmarket buyers.The lift happens when automation is tied to real intent triggers.",
          "score": 1,
          "created_utc": "2026-02-16 06:41:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n5e7o",
              "author": "Confident_Box_4545",
              "text": "It is pretty hard to get real signal targeting is where it's at. You cant scrape random posts that just doesn't work.",
              "score": 1,
              "created_utc": "2026-02-16 06:44:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5o3cpf",
          "author": "thijspeter",
          "text": "Nice!",
          "score": 1,
          "created_utc": "2026-02-16 11:55:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wixgh",
          "author": "djcincos",
          "text": "Hi u/Confident_Box_4545 \\- I'm curious, what line of business are you in. I am interested in what you are sharing.l  \nRegards,  \nDonna",
          "score": 1,
          "created_utc": "2026-02-17 17:57:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wvvgl",
              "author": "Confident_Box_4545",
              "text": "Hey Donna, just sent you a DM with more details so I do not derail the thread.",
              "score": 1,
              "created_utc": "2026-02-17 18:56:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r8b1us",
      "title": "Stuck at 290 views for months then jumped to 16k after finding these 5 patterns",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r8b1us/stuck_at_290_views_for_months_then_jumped_to_16k/",
      "author": "Leading_Leading_2114",
      "created_utc": "2026-02-18 18:28:58",
      "score": 9,
      "num_comments": 1,
      "upvote_ratio": 0.74,
      "text": "I’ve been totally consumed by short form video for nearly two years now. I am talking \"legitimately concerning levels of consumed\" where it is pretty much all I think about.\n\nI have been putting in 10 to 14 hour days dissecting what makes videos blow up, testing every hook variation possible, endlessly rewriting scripts, and experimenting with every editing approach I could find.\n\nWhy this level of dedication? Because I am fully convinced short form video is the backbone of absolutely everything moving forward. Growing audiences, marketing anything, building opportunities, or creating brands all comes down to whether you can capture someone’s focus for 30 seconds.\n\nBut here is what almost made me quit entirely: despite working relentlessly every day, nothing was working. I would spend 6 to 7 hours on one video just to watch it die at 290 views. I tried every technique from every creator claiming to know the secret, bought their programs, and applied their \"proven\" blueprints. Still completely stuck.\n\nI seriously started believing maybe I am just not one of the people this works for. Like maybe there is some natural wiring I completely lack.\n\nThen something clicked. I am putting in massive effort, but I am operating completely blind. I do not actually know what is broken. I was just trying random things hoping for different results.\n\nSo I stopped hunting for some viral shortcut and started looking at cold hard data. I reviewed my last 50 videos frame by frame, tracked every single drop off point, and found 5 repeating patterns that were absolutely destroying my performance:\n\n1. **Generic vague hooks are totally invisible to someone scrolling their feed.** \"This is crazy...\" gets bypassed every time. But \"I stopped eating after 6pm for 70 days and my energy crashed\" stops people dead. Specific concrete details obliterate vague mystery without fail.\n2. **Seconds 5 through 7 are the critical window for keeping a viewer.** Most viewers leave between 4 and 7 seconds if you have not demonstrated value yet. I was slowly building anticipation like a total amateur. Now my strongest visual or most compelling stat drops exactly at second 5. That is the hook that genuinely matters.\n3. **Any silence past 1 second drains retention and kills your reach.** I was genuinely obsessed over measuring this, and anything over 1.2 seconds makes people assume nothing is happening. What feels like perfectly natural rhythm to you reads as the video stalling to someone scrolling. Cut significantly tighter than feels comfortable.\n4. **Visual movement is completely non-negotiable if you want to hold attention.** If nothing moves on screen for more than 3 seconds, attention vanishes instantly. I started constantly rotating camera positions, cutting to b-roll, or moving text placement to maintain visual momentum. I went from losing 50% at the halfway mark to retaining 70%.\n5. **Rewatch rate is massively more important than anyone actually thinks.** Videos people watch more than once get amplified exponentially by the algorithm. I started embedding small details that are not obvious the first time or adding elements worth catching on rewatch. My rewatch percentage jumped from 8% to 31% and distribution went absolutely through the roof.\n\nThe real breakthrough was ditching all guesswork and actually tracking what happened at every single second.\n\nI discovered this one tool that goes way beyond showing where people drop off, it literally tells you why and exactly how to correct it. That is when everything transformed. I went from averaging 290 views to hitting 16k in roughly 3 weeks. Standard analytics tell you people are leaving. this one shows the exact moment, the real reason behind it, and what to change next time.\n\nIf you are uploading regularly but cannot break 1k views, your content is not the issue. You simply do not know what is genuinely working versus what you assume is working.\n\nLook, I am putting this out there because figuring this out was honestly one of the most draining things I have experienced. I genuinely wish someone had just walked me through exactly what needed fixing when I was stuck there. It would have saved months of confusion and doubt. So that is what I am doing now for whoever needs it.\n\nEDIT: Getting a flood of DMs asking about the tool, it’s [this one ](https://taap.it/liyjQBu)(works for Reels and Shorts too). Not affiliated with anything, just easier to drop the link than answer everyone separately haha",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r8b1us/stuck_at_290_views_for_months_then_jumped_to_16k/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1r60u8b",
      "title": "Beginner in Digital Marketing confused About Where to Start with AI",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r60u8b/beginner_in_digital_marketing_confused_about/",
      "author": "Sol_ce",
      "created_utc": "2026-02-16 05:16:17",
      "score": 9,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Hi everyone,\nI’m a beginner in digital marketing and honestly feeling a bit overwhelmed. There’s so much information out there that I don’t know where to start.\nI really want to learn AI and use it in marketing, but I’m confused about a few things:\nWhich AI tools should I learn first?\nWhat kind of projects should I do to build a strong portfolio?\nHow do experienced marketers actually use AI in their daily workflow?\nWhich websites or platforms should I follow to stay updated on AI trends in marketing?\nI don’t want to randomly learn 10 different tools without understanding how they’re practically used. I’d rather focus on a few important ones and build real, portfolio worthy projects (like campaigns, content strategies, automation setups, etc.).\nIf you’re an experienced marketer who has successfully integrated AI into your workflow, I would genuinely love to know:\nWhat tools do you use daily?\nWhat would you suggest a beginner master first?\nWhat projects helped you stand out?\nWhere do you get reliable information about AI + marketing trends?\nI’m really curious and motivated, just need some direction so I don’t waste time learning things that aren’t relevant.\nWould appreciate any guidance 🙏",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r60u8b/beginner_in_digital_marketing_confused_about/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5mwiom",
          "author": "stovetopmuse",
          "text": "If you’re just starting, ignore the hype cycle and focus on where AI actually improves leverage.\n\nIn most real workflows it shows up in three places: research, production, and optimization. Research means faster audience analysis, keyword clustering, offer angles. Production means drafting ads, emails, landing page variants. Optimization means analyzing performance data and generating new test hypotheses.\n\nInstead of learning 10 tools, pick one core LLM and one execution layer. Then build projects around outcomes, not tools. For example, create a mock funnel for a niche SaaS. Use AI to generate keyword clusters, write ad variations, draft a 5 email nurture, and outline a simple automation flow. Then document your thinking and expected metrics. That is portfolio worthy because it shows strategy plus implementation.\n\nAnother strong project is taking a small dataset, even public ad library data, and using AI to extract patterns and propose new creative angles. That demonstrates you understand iteration, not just prompting.\n\nDaily use for most experienced marketers is not “push button growth.” It is speeding up first drafts, summarizing call transcripts, generating test variants, and helping interpret messy data. The edge comes from knowing what to test, not just how to prompt.\n\nI would master prompt structuring, basic analytics literacy, and one automation platform before chasing every new AI wrapper. Tools change fast. Fundamentals compound.\n\nWhat area of marketing are you leaning toward right now, paid, SEO, lifecycle, something else?",
          "score": 3,
          "created_utc": "2026-02-16 05:29:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5oijfv",
          "author": "Fit-Donkey-3181",
          "text": "Follow industry leaders like Rand Fishkin, Ann Handley, or Neil Patel on LinkedIn and their blogs. They often discuss AI trends practically. Also, marketingaiinstitute.com is a great dedicated resource. Focus on the \"how\" AI enhances marketing, not just the \"what\" it can do.",
          "score": 2,
          "created_utc": "2026-02-16 13:38:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ntvc1",
          "author": "SquareDesperate4003",
          "text": "I felt the same way when I started. Don't try to learn everything at once. Focus first on using AI for content creation, basic copywriting, simple automation, and data analysis. Then build small projects like a mock campaign, an email sequence, or a content calendar using AI to show your process. What matters more than tools is understanding marketing fundamentals and how AI supports them. Keep it simple and build as you go. ",
          "score": 1,
          "created_utc": "2026-02-16 10:33:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ntz8x",
          "author": "schilutdif",
          "text": "honestly just pick one ai tool and actually use it for a real campaign first, the rest clicks after that",
          "score": 1,
          "created_utc": "2026-02-16 10:34:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nxbk3",
          "author": "Majestic_Hornet_4194",
          "text": "Start with learning AI tools that help automate tasks like lead gen and content scheduling. Focus on projects where you use AI to find real leads or automate parts of a campaign, that stuff stands out more than just playing with random tools.",
          "score": 1,
          "created_utc": "2026-02-16 11:04:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nyc5h",
          "author": "Wonderful-Shame9334",
          "text": "Trying to get started with AI in digital marketing? Honestly, start with the basics focus on a couple of solid tools you can actually implement, not the shiny ones that end up gathering dust when something more urgent breaks in your workflow.",
          "score": 1,
          "created_utc": "2026-02-16 11:13:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qrmp1",
          "author": "botapoi",
          "text": "start by building actual marketing tools with ai rather than just learning theory, like a lead scorer or email campaign generator to put in your portfolio. i built a few marketing dashboards on blink and it forced me to learn how to actually wire up claude or gpt to real workflows instead of just watching tutorials",
          "score": 1,
          "created_utc": "2026-02-16 20:09:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s1gh1",
          "author": "amberjletang",
          "text": "The most common mistake is chasing 10 different tools instead of mastering one core logic. AI in marketing is only as valuable as the automation architecture it sits on. \n\nInstead of learning features, focus on building 'Automation Setups' that bridge the gap between data and execution. A strong portfolio isn't a collection of AI-generated images; it is a series of deterministic workflows that solve specific business bottlenecks.\n\nStart by mastering an API-first approach. When you stop using AI as a chat interface and start using it as a data source, you move from being a beginner to an architect. Reliable trends follow utility, not hype.",
          "score": 1,
          "created_utc": "2026-02-17 00:06:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8t27l",
      "title": "What tools track geo performance and ai search rankings accurately?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r8t27l/what_tools_track_geo_performance_and_ai_search/",
      "author": "Altruistic-Meal6846",
      "created_utc": "2026-02-19 07:41:10",
      "score": 8,
      "num_comments": 13,
      "upvote_ratio": 0.91,
      "text": "We have started optimizing content for llm visibility and ai overviews alongside traditional seo, but figuring out if it’s actually working is a nightmare search console shows some ai overview impressions, yet nothing clearly explains how we rank inside chatgpt, perplexity, or claude responses for our target queries, or whether competitors are pulling ahead in citations and overall generative engine optimization performance.\n\nright now we rely on manual prompt testing across different ai tools, which takes a lot of time and still feels unreliable because answers change so often what we really need is something that can track rankings across multiple ai engines, surface citation sources, and benchmark visibility against competitors without a huge learning curve.\n\nare there keyword tracking or visibility tools built specifically for llm seo and ai search? what’s actually giving people dependable data on brand mentions, citations, or true visibility scores?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r8t27l/what_tools_track_geo_performance_and_ai_search/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o67guds",
          "author": "Awkward-Chemistry627",
          "text": "The hardest part with llm seo tracking is that the models like chatgpt or perplexity do not expose a public index or ranking system like Google does, so most tools are improvising",
          "score": 3,
          "created_utc": "2026-02-19 07:53:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67k6ln",
          "author": "crawlpatterns",
          "text": "short answer is there’s no truly “accurate” rank tracker for llms yet the way we have for google.\n\nmost teams i’ve seen are mixing a few things:  \nmanual prompt testing with structured prompts  \nbrand mention monitoring tools  \nand scraping citation sources from ai overviews where possible\n\nsome newer tools claim to track ai visibility or generative search presence, but they’re usually proxy metrics. they run standardized prompts at scale and measure mention frequency, not real ranking positions. and because outputs are dynamic and personalized, it’s directional at best.\n\nif you want dependable signals, i’d focus on:  \nconsistent prompt sets you control  \ntracking citation overlap across competitors  \nmonitoring referral traffic from ai sources where available  \nand watching which pages get pulled into ai overviews in search console\n\nright now it’s more about trend lines than precise ranks. anyone selling exact ai rankings is probably oversimplifying a messy system.",
          "score": 2,
          "created_utc": "2026-02-19 08:25:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67g30g",
          "author": "Used_Rhubarb_9265",
          "text": "Manual prompt testing is a grind.\n\nUse actual AI visibility tools. Meridian or Profound track prompts, citations, competitors across ChatGPT, Perplexity, AI Overviews, etc.\n\nThere’s no stable “rank #1” in LLMs. Track citation frequency + reference rate instead of positions.\n\nSearch Console alone won’t cut it.",
          "score": 1,
          "created_utc": "2026-02-19 07:46:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67h2zq",
          "author": "Consistent_Buddy_698",
          "text": "One technical challenge with generative search is that even when you get cited in an answer, the model might summarize or paraphrase your content, so brand detection is tricky. ",
          "score": 1,
          "created_utc": "2026-02-19 07:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67hxog",
          "author": "FoodFine4851",
          "text": "From my experience nothing beats combining traditional seo with ai specific monitoring but its hard to find reliable data. ",
          "score": 1,
          "created_utc": "2026-02-19 08:03:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68lxgs",
          "author": "morningdebug",
          "text": "yeah the manual testing approach doesn't scale, you'd need to build some kind of monitoring dashboard that tracks your content across different ai models over time. i've been using blink to prototype stuff like this where you can hook up multiple ai apis and log the responses automatically, might save you from having to manually prompt test everything",
          "score": 1,
          "created_utc": "2026-02-19 13:35:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ch1mc",
          "author": "xtomleex",
          "text": "Honest answer: there's no single tool that nails this perfectly yet, but a few are getting close.\n\nMeridian and Profound are the ones getting the most attention for prompt-level tracking across ChatGPT, Perplexity, and AI Overviews. They let you set up branded queries and see how often you're cited vs competitors. \n\nGeoRamp is another one worth looking at  it tracks mentions across the major LLMs and gives you share-of-voice style data so you can actually see movement over time, not just a snapshot.",
          "score": 1,
          "created_utc": "2026-02-20 01:28:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d1rgv",
          "author": "o1got",
          "text": "Yeah, this is a pain point everyone's dealing with right now. The tools are super immature compared to traditional SEO platforms.  \n  \nFrom analyzing a ton of AI agent traffic, I can tell you the challenge is that these models don't \"rank\" like Google does. They're doing retrieval and synthesis, which means your visibility depends on: (1) whether you get crawled and indexed by the systems feeding these models, (2) how authoritative/cited your content appears in their training data or RAG sources, and (3) whether your content actually answers the query in a way the model finds useful for synthesis.  \n  \nManual testing is actually more reliable than people think, but you need to be systematic about it. Rotate through different phrasings of your target queries, test at different times (responses do shift), and keep a spreadsheet of citation frequency. It's tedious but you'll spot patterns your competitors miss.\n\nAlso, a different and interesting approach - [IsYourWebsiteReady.ai](http://IsYourWebsiteReady.ai)",
          "score": 1,
          "created_utc": "2026-02-20 03:37:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eq6up",
          "author": "Lemonshadehere",
          "text": "Honestly the tooling for this is still pretty rough. we've been dealing with the same problem and there's no clean solution yet\n\nwhat's out there right now:\n\n* rankprompt - tracks brand mentions across AI engines but the data can be inconsistent. better than nothing though\n* glimpse - has some AI overview tracking but it's more focused on traditional SERP features\n* manual testing - still the most reliable option unfortunately. we track 20-30 core prompts our ICP would actually use and check them weekly across ChatGPT, Perplexity, Claude\n\nthe problem with all of these: AI responses are insanely volatile. same prompt, different day, completely different citations. so even if a tool shows you're being mentioned, that could change next week for no clear reason\n\nwhat we've found works better than obsessing over rankings: tracking external signals instead. monitor your G2 review count, track mentions in comparison content, watch for reddit/forum discussions. those are leading indicators of AI visibility more than any tool can measure\n\nsearch console's AI overview data is basically useless right now. impressions don't tell you if you're actually being cited or just showing up in the background somewhere\n\nthe real gap in the market: nobody has built reliable competitor benchmarking for AI citations yet. everything is directional at best\n\nare you seeing patterns in which queries you show up for vs don't? that's been more useful for us than trying to track overall visibility scores",
          "score": 1,
          "created_utc": "2026-02-20 12:07:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g9va3",
          "author": "Guruthien",
          "text": "Manual testing can be a headache and unreliable. You need actual llms traffic data to see what's working. I have been testing this with limy- it tracks llms agent visits and shows which prompts trigger citations of my content.  ",
          "score": 1,
          "created_utc": "2026-02-20 16:59:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6k97jb",
          "author": "Odd_Control_5324",
          "text": ">",
          "score": 1,
          "created_utc": "2026-02-21 06:36:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ll09p",
          "author": "jkbruhhehe",
          "text": "You've hit the exact problem we spent 6 months troubleshooting. The short answer: no tool gives \"\"accurate rankings\"\" because LLMs don't have rankings, they have probabilistic citation patterns that shift with every model update, web crawl, and even time of day.\n\nWhat you can track directionally:\n- Citation frequency across a fixed prompt set\n- Which specific URLs get cited (source-level data)\n- Competitor presence in the same prompts\n- Sentiment/context around your mentions\n\nThe tool gap comes down to methodology. API-based tools (faster, cheaper) give you trend data. Browser-based tools (slower, more expensive) show you what actually renders. We need both, trends for reporting, UI data for diagnosis.\n\n*For UI-level tracking on our core 50 prompts, we use RankPrompt. Their scans take longer (30-60 seconds per prompt) but catching a competitor hijack that API tools miss pays for itself. The learning curve is real (took me a week to map the dashboard) but the citation source view is the only way we've found to answer \"\"why did we lose that spot.\"\"*\n\nyu running manual validation alongside whatever tool u pick? That's the only way to know if the data lines up with what users actually see.",
          "score": 1,
          "created_utc": "2026-02-21 13:44:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6k2fd",
      "title": "Built an app. Now what?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r6k2fd/built_an_app_now_what/",
      "author": "Space-Possible",
      "created_utc": "2026-02-16 19:56:44",
      "score": 7,
      "num_comments": 17,
      "upvote_ratio": 0.9,
      "text": "Hi. I wanted to give it a try to vibecoding (with no prior code knowledge) and I built an app (it’s a simple plank habit app). \n\nTbh, I was very excited and hyped to the fact that I was able to do that in about 20 hours (what a time to be alive), but what do I do now? How to reach people to see if it’s actually useful to a handful of people?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r6k2fd/built_an_app_now_what/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5qv4q0",
          "author": "decebaldecebal",
          "text": "The \"built it, now what?\" moment is where most projects die, even non vibe coded ones. The building was the easy part.\n\nStart simple. Find 5-10 people who actually do exercies regularly. Fitness subreddits, Facebook groups, even friends who work out. Show it to them, watch them use it, ask what's missing. You don't need thousands of users right now, you need 5 honest opinions.\n\nThen post it in a few places where your audience already hangs out. r/fitness, r/bodyweightfitness, maybe a few habit tracking communities. Don't just drop a link. Share what you built, why, and ask for feedback. People respond to that.\n\nI went through this exact problem with my own products. Built stuff for months, had no clue how to get it in front of people. I ended up building a whole framework for myself using Claude Code, not sure if you are comfortable with that. It does researching ICPs, writing outreach, figuring out where buyers actually hang out. If you want a structured approach to this I put it together [here](https://beyondfolder.com/distribution), but honestly for a habit app the above steps are your best starting point.",
          "score": 3,
          "created_utc": "2026-02-16 20:27:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qpddk",
          "author": "kubrador",
          "text": "you built a plank timer, the market's already got like 50 of those. post it on twitter/product hunt, get your mom to download it, realize nobody cares about planks, then pivot to something people actually want.",
          "score": 2,
          "created_utc": "2026-02-16 19:58:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u9izr",
          "author": "OptimizmSolutions",
          "text": "Welcome to the misery of go to market. You vibed, you had fun. Now spam like crazy or spend thousands in ads. After that maybe somebody will like it enough to spend 5$ on it. Most likely not. Good luck.",
          "score": 2,
          "created_utc": "2026-02-17 09:50:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uai87",
          "author": "demijane_way",
          "text": "Go to a couple of local gyms and talk to people, as long as you're not creepy people are likely to try it and give you real feedback. Seems difficult but it's much easier than getting people to try it online.\n\nPs. If your app is going to let users create accounts or you collect any kind of data, make sure you have security in place. I see a lot of these vibe coded apps pop up that don't have this in place and it's a nightmare.",
          "score": 2,
          "created_utc": "2026-02-17 09:59:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5uddet",
              "author": "Space-Possible",
              "text": "thank you!",
              "score": 1,
              "created_utc": "2026-02-17 10:25:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5udea3",
                  "author": "exclaim_bot",
                  "text": ">thank you!\n\nYou're welcome!",
                  "score": 1,
                  "created_utc": "2026-02-17 10:25:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5umzed",
          "author": "dawedev",
          "text": "Congrats on finishing the MVP! The 'now what' phase is where most projects live or die.\n\nBefore you spend a dime on ads or heavy marketing, make sure you have a **frictionless feedback loop**. Most founders just share a link and get 'ghosted' by installers.\n\nI actually built **TesterBuddy** to solve this exact problem for iOS devs. It’s a community based on **reciprocity**—we test each other's apps and use direct chat/polls to get real signals fast. We are in the **pre-launch phase** and just went live on Product Hunt today to grow the cohort!\n\nMy advice: find 10-20 people who will give you 'brutal' honesty, not just 'it looks good.' That’s the only way to refine the UX before you go big.\n\nFeel free to check us out if you need that initial signal: [**https://www.producthunt.com/products/testerbuddy-beta-feedback-exchange**](https://www.producthunt.com/products/testerbuddy-beta-feedback-exchange)",
          "score": 2,
          "created_utc": "2026-02-17 11:48:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xs593",
          "author": "Commercial_Quote_320",
          "text": "keep shipping!!",
          "score": 2,
          "created_utc": "2026-02-17 21:29:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ran2l",
          "author": "Dependent_Slide4675",
          "text": "Now sell it to others. Go to market means that you are the one going to meet your market.",
          "score": 1,
          "created_utc": "2026-02-16 21:43:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s0iwb",
          "author": "amberjletang",
          "text": "The gap between building and finding users is a lack of Distribution Infrastructure. Vibecoding is great for prototyping but it rarely accounts for how a tool integrates into a user's daily friction points.\n\nInstead of hunting for users focus on systemic feedback. Map the 'Cost of Friction' for people building habits. If your app doesn't solve a specific failure point in their routine it will be abandoned. \n\nI focus on building logic layers that make tools essential. Shift from reaching people to auditing their workflow. Once you identify the bottleneck the distribution path becomes deterministic.",
          "score": 1,
          "created_utc": "2026-02-17 00:00:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5siet9",
          "author": "Sea_Inflation_2881",
          "text": "what is that app\nsend me the link",
          "score": 1,
          "created_utc": "2026-02-17 01:45:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tmvqx",
              "author": "Space-Possible",
              "text": "it’s called Planked (iOS only)",
              "score": 1,
              "created_utc": "2026-02-17 06:19:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5sifcx",
          "author": "Sea_Inflation_2881",
          "text": "what is that app\nsend me the link",
          "score": 1,
          "created_utc": "2026-02-17 01:45:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u7zdd",
          "author": "Euphoric_Movie2030",
          "text": "Building fast is the easy part now, learning if anyone actually cares is the real work. The next step isn't more features, it's talking to users, testing real behavior, and validating pain before polishing the product.",
          "score": 1,
          "created_utc": "2026-02-17 09:35:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5v0whm",
          "author": "Different_Dinner9267",
          "text": "Building is the easy part now yeah. The hard part is getting it in front of real people. Before spending money on adsor anythink, try reaching out to 10-15 nano/micro fitness creators on TIKTOK or Instagram. A simple plank app is perfect for short demo content. Pay them a tiny fixes fees or even just give them free access and ask for honest feedback. You'll get real users and real feedback at the sema time. But next time, valdiate the idea before building > Talk to people on Reddit, X, forums, see if there's actual demande first. Saves you a lot of time and energy",
          "score": 1,
          "created_utc": "2026-02-17 13:22:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6051sh",
          "author": "Janeneinhaus",
          "text": "Congratulations",
          "score": 1,
          "created_utc": "2026-02-18 05:23:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60v19e",
          "author": "takescaketechnology",
          "text": "Start inbound marketing on techne.blog",
          "score": 1,
          "created_utc": "2026-02-18 09:11:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8us18",
      "title": "interactive product walkthroughs boost activation… so why do some teams regret adding them?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r8us18/interactive_product_walkthroughs_boost_activation/",
      "author": "Gdonadi2",
      "created_utc": "2026-02-19 09:28:48",
      "score": 7,
      "num_comments": 10,
      "upvote_ratio": 0.9,
      "text": "\n\n\n\nI’m researching interactive product walkthrough tools for SaaS and would love real-world feedback from people who’ve actually used them for onboarding, sales demos, or product marketing. I’m not talking about simple screen recordings, but clickable, guided product tours where users can explore flows, follow tooltips, and understand how the product works without jumping on a live call. The goal is to reduce repetitive demos, improve onboarding, and help prospects or users reach value faster.\n\nThe tools I keep seeing mentioned are Navattic, Storylane, Supademo, Product Fruits, WalkMe, and even open-source options like GuideChimp. Navattic is known for no-code, website-embedded tours that simulate real product interactions. Storylane supports persona-based branching demos. Supademo focuses on speed and quick updates when your UI changes. Product Fruits and WalkMe lean more toward in-app onboarding and digital adoption, while GuideChimp is attractive for teams that want full control and customization without SaaS pricing.\n\nWhat I’m trying to understand is what holds up after three to six months of real use. Did maintenance become painful after product updates? Did these tools genuinely improve activation, demo-to-meeting conversion, or feature adoption, or did they just look impressive on landing pages? If you’ve implemented interactive product walkthrough software, what metrics did you track and what would you do differently if you were starting again?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r8us18/interactive_product_walkthroughs_boost_activation/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o67rzmf",
          "author": "Extra-Motor-8227",
          "text": "the biggest issue is maintenance hell after 6 months, your UI changes and suddenly half your walkthroughs are broken pointing to buttons that moved or don't exist. we saw 40% higher activation initially but spent 2 hours every week fixing tours, eventually just went back to loom videos and scheduling more demos",
          "score": 2,
          "created_utc": "2026-02-19 09:43:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67tkwd",
              "author": "GL103",
              "text": "that’s real, the activation bump is great until the upkeep eats your time. did you try limiting it to just one core flow that rarely changes, or was the product evolving too fast for even that to work?",
              "score": 1,
              "created_utc": "2026-02-19 09:58:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o67tfjb",
          "author": "GL103",
          "text": "a lot of teams add interactive walkthroughs expecting higher activation, but without tight scoping and clear value they often just create more clicks instead of more outcomes.",
          "score": 1,
          "created_utc": "2026-02-19 09:57:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69snhj",
          "author": "Outside_Economy9924",
          "text": "I've seen consensus mentioned as a good option for this",
          "score": 1,
          "created_utc": "2026-02-19 17:12:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a3jdb",
          "author": "Cumbrian1970",
          "text": "Most people say walkthroughs work best when they answer one clear question instead of trying to replace the whole demo or onboarding. Tools like Navattic and Storylane are good for early exploration, and some teams use Consensus to qualify interest before a live call. The problems usually start when companies build too many flows and have to keep fixing them after every UI change. The teams that see results focus on 2–3 key paths and track real activation tied to revenue, not just tour clicks.",
          "score": 1,
          "created_utc": "2026-02-19 18:04:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6btc79",
          "author": "KoalaInPain",
          "text": "The fact that some many tools exist is imo validation in itself that the tools work and provide actual value. Most of these tools are also stupidly expensive so they must be doing something right.\n\nMaintenance can be difficult if your UI is constantly changing, but you can combat that by using good stable selectors for example IDs, or data selectors. But for example, Produktly makes this easy by providing a visual selector tool that automatically finds the best selector for the element you want to highlight / action on.",
          "score": 1,
          "created_utc": "2026-02-19 23:08:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6c06ry",
          "author": "supportingthedogs",
          "text": "the regret usually comes from maintenance hell. your UI changes, your tours break, and suddenly someone on the team owns this never-ending job of fixing selectors and updating steps. that's the dirty secret none of the landing pages talk about.\n\nthe tools that hold up long-term tend to be the ones that either screenshot-based so changes don't break them or are smart enough to adapt when your UI shifts. most of the ones you listed aren't really either.\n\nfull transparency: i'm a co-founder at Frigade which is in this space, so take this with a grain of salt, but the reason we built it was specifically because of that 3-6 month cliff you're describing. we went AI-native so guides actually self-update instead of breaking. still early but the teams using it aren't babysitting their tours anymore.\n\nthe metric i'd actually track btw isn't activation rate in week 1, it's what % of users complete the guide AND come back. most tools optimize for the former and ignore the latter.",
          "score": 1,
          "created_utc": "2026-02-19 23:49:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g3gt3",
          "author": "ProductFruits",
          "text": "Hey user onboarding platform here. I have some insight that may help you.\n\nMost teams regret interactive walkthroughs for one of two reasons: they shipped a “tour of the UI” instead of a fast path to a first result, and then they got stuck maintaining a bunch of steps that nobody actually needed.\n\nWhat holds up long-term is usually not the walkthrough itself. It’s whether you can keep a single first-success path working as the product changes.\n\nWhere it goes wrong in practice:  \n1. you overproduce it. You build a 10 step guided flow that explains everything. It demos well. In the real app it’s friction. Users skip, click off, or follow it once and still do not reach a meaningful outcome.\n\n2. it’s not tied to intent. A great walkthrough for persona A is noise for persona B. If you do not segment by “what are you here to do today”, you end up with a generic flow that helps nobody.\n\n3. maintenance becomes a tax.  Every UI change breaks selectors or the logic of the steps. The worst part is not fixing the tour. It’s losing trust internally because the tour is now wrong and support starts apologizing for it. \n\n1 and 2 is on you. This requires a deep knowledge of the app and the user intent plus some rudimentary UX. 2 is easily achievable with segmentation.  \n3 is on us (meaning the vendors in general). A good example is Product Fruits text-targeting or the newly released AI-fingerprinting. This will never be 100% bulletproof, but the 80% we're getting is a huge improvement over it breaks-with-every update.\n\nHope it helps, it's only a tool and the power of the tool is in the hand of the user. ",
          "score": 1,
          "created_utc": "2026-02-20 16:30:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}