{
  "metadata": {
    "last_updated": "2026-01-21 17:20:00",
    "time_filter": "week",
    "subreddit": "GrowthHacking",
    "total_items": 20,
    "total_comments": 126,
    "file_size_bytes": 144984
  },
  "items": [
    {
      "id": "1qdhj5v",
      "title": "Raised $7M, then the AI wave made our product obsolete. We have 8 months of cash left and I can't code",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qdhj5v/raised_7m_then_the_ai_wave_made_our_product/",
      "author": "Ok-Weekend-2343",
      "created_utc": "2026-01-15 11:53:44",
      "score": 313,
      "num_comments": 86,
      "upvote_ratio": 0.93,
      "text": "I wanted to share our story, because the last year has been one of the hardest of my life.\n\n  \nBack in 2023, things were looking great. We'd raised a $7M Series A for our IoT business. I’m the non-technical founder (my background is in finance and comms), and my co-founder is the tech lead. We had a solid product, real revenue, and happy customers. I thought we were on the right track.\n\n  \nThen, in late 2024, the market just... changed.\n\n  \nEvery investor meeting suddenly became an interrogation about our AI strategy. We didn't have one. We were an infrastructure company, and overnight, that wasn't interesting anymore. The excitement for what we were building just vanished.\n\n  \nWe looked at our burn rate and the bank account: 8 months of cash left.  \nThe toughest part of being the non-technical founder in a situation like this is the specific kind of helplessness you feel. I can't jump into the code. I can't help build our way out of the problem. My job is to find the answers and steer the ship, but I was watching the clock tick down, feeling like I was failing my team.\n\n  \nTo make it worse, we couldn't just shut down the old business. We have long-term contracts with enterprise clients, and walking away would mean getting sued into oblivion. So we had to do this crazy balancing act: keep the old lights on to pay the bills, while pivoting the entire team to build a new AI hardware product for devs.\n\n  \nI honestly thought we wouldn't make it.\n\n  \nWe didn't raise a single dollar in 2025. VCs wouldn't touch us. We had to cut costs brutally. I had to tell the team: look, we have until August, if this new thing doesn't work, we're done.\n\n  \nSomehow, we’re still here. It’s Jan 2026 and we're about to launch the new product. I’m currently trying to figure out how to spin this off into a new entity so our original investors don't get screwed, which is a whole other nightmare.\n\n  \nJust wanted to share this for anyone else who feels like they're drowning in this AI shift. Pivoting a 40-person company with no new money is the hardest thing I've ever done.\n\n  \nIf anyone has experience spinning off a new product while keeping legacy investors happy, I’d love to hear how you handled the equity split.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qdhj5v/raised_7m_then_the_ai_wave_made_our_product/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzq6lhj",
          "author": "zenitr0",
          "text": "If the new product succeeds massively, would a reasonable original investor say “we were fairly treated”?\n\nIf the answer isn’t an immediate yes, fix the structure now. Because time will not make it better.",
          "score": 19,
          "created_utc": "2026-01-15 13:47:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzrdb19",
              "author": "bdegroodt",
              "text": "I believe this is the most important advice here right now. Think a couple steps down the board. Investors are pre-disposed to a lot of losses. It's portfolio theory. That said, they remember how they were treated through those losers (and winners) and I'd rather live to fight another day, in another battle, than to burn bridges here.\n\nGood luck, OP. This is a moment of both huge upside and some serious reckonings.  If you got this far, you likely have what it takes to make it under the new dynamics..",
              "score": 8,
              "created_utc": "2026-01-15 17:10:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o03rrz3",
              "author": "Fit-Signature4125",
              "text": "OP can offer share or warrants in the new company not exceeding 40%, so as to retain a controlling stake in the new company.",
              "score": 1,
              "created_utc": "2026-01-17 13:51:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0klwz1",
                  "author": "mountains-sun-water",
                  "text": "I didn’t get why you need to spin it off. Early stage  companies pivot all the time without creating a new entity",
                  "score": 1,
                  "created_utc": "2026-01-19 23:49:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzq8yfk",
          "author": "professorhummingbird",
          "text": "Refreshing seeing what looks like an actual story and not a sales pitch. Good luck with the pivot. I would personally rather se a new infrastructure company than a new AI company but the bills have to be paid. I imagine your situation is stressful. What have your early adopters said about this new product?",
          "score": 8,
          "created_utc": "2026-01-15 14:00:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqd01b",
              "author": "Ok-Weekend-2343",
              "text": "Thanks, I appreciate it. Early adopter feedback has been pretty mixed, so we’re iterating fast — and it’s not easy. Our original business was a classic B2B model, which I’m familiar with.This new product is much more developer-centric. While it reuses a lot of our existing tech, the go-to-market motion is completely different, so there’s a lot of on-the-job learning for me right now.",
              "score": 1,
              "created_utc": "2026-01-15 14:21:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o03inrq",
                  "author": "DrasticIndifference",
                  "text": "Developer-centric pivots need fanatical users who don't care about the flow of profitability upstream.  If an ounce of \"we dialed this part in\" is experienced, it's hard to overcome.  Thinking of all the digital assistants and products that were well-positioned but didn't succeed...  I would love to imagine the problem being solved by your product is unique enough to ride out the strongly indicated bubble for both AI and infra, and that a pivot back to the original (with contracts) is not out of the realm of possibility.  It's remarkable that you have a potential for success in either scenario.  Well done.",
                  "score": 1,
                  "created_utc": "2026-01-17 12:53:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqcxj5",
          "author": "agin_",
          "text": "How could the “AI wave” make a IoT product obsolete? Considering you raised that much money, I would assume you had already PMF to iterate on, rather than trashing the entire strategy just to follow investor money",
          "score": 7,
          "created_utc": "2026-01-15 14:21:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqezy3",
              "author": "Ok-Weekend-2343",
              "text": "Fair question. The IoT product itself didn’t fail — it still generates some cash flow today.\n\nThe real issue was scale and timing. Going into the AI shift, our IoT team was intentionally built for aggressive growth, which assumed continued access to capital. When funding dried up almost overnight, the organic growth of the business couldn’t sustain a cost structure designed for hypergrowth. That put us in a very tough position.\n\nOn top of that, the way we’re financed means time matters. Waiting things out or slowly iterating wasn’t really an option.",
              "score": 5,
              "created_utc": "2026-01-15 14:32:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzqwnxe",
                  "author": "w4nd3rlu5t",
                  "text": "I’m so curious why you didn’t just sprinkle some AI on top of your IoT offering. Super vague but AI + hardware seems to be where the smart money is going these days",
                  "score": 4,
                  "created_utc": "2026-01-15 15:56:17",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzxtx4l",
                  "author": "bazkin6100",
                  "text": "You seem to be adept at using AI to generate this response! :)",
                  "score": 1,
                  "created_utc": "2026-01-16 15:54:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzrxcet",
          "author": "elevarq",
          "text": "What does IoT Business mean, what is it? IoT and AI go really well together, so I don’t understand how AI had a negative impact on your business",
          "score": 4,
          "created_utc": "2026-01-15 18:40:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqfujy",
          "author": "kubrador",
          "text": "damn, you're speedrunning every founder's worst nightmare at once. can't code, investors only speak AI now, ticking clock, and somehow the solution is \"build a whole new product with the same broke team\" - that's actually insane.\n\nthe equity split thing though? you basically need a corporate restructure where the old business stays its own entity (keeps original investors whole) and the new ai thing is a separate subsidiary where they can participate or dilute depending on what you negotiate. talk to a startup lawyer because this is the kind of thing that costs $30k now or $3M later in a lawsuit.\n\nbut real talk, if you actually launch this in january 2026 and it doesn't immediately crater, you've basically already won just by surviving. most companies fold before month 6.",
          "score": 14,
          "created_utc": "2026-01-15 14:36:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqkyvb",
              "author": "Ok-Weekend-2343",
              "text": "Appreciate the advice. And yeah, that last bit actually cheered me up a lot.",
              "score": 3,
              "created_utc": "2026-01-15 15:01:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o04tuzi",
                  "author": "SSObserver",
                  "text": "Yeah the restructuring is absolutely necessary, but the good news is you’re probably still eligible for the QSBS. If you want to dm me I’ve got a few good recs for startup lawyers in California and New York",
                  "score": 1,
                  "created_utc": "2026-01-17 17:01:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0fzakz",
              "author": "mikjey",
              "text": "Ts is so ai generated💀",
              "score": 1,
              "created_utc": "2026-01-19 08:15:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0gv77u",
              "author": "BL1860B",
              "text": "The the irony of this being an AI generated comment",
              "score": 1,
              "created_utc": "2026-01-19 12:54:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzqyl62",
          "author": "vikkey321",
          "text": "You have not mentioned details about your product or service at all. How does someone give ideas based on the abstracted detail. Being in IoT industry for so long and its hard to understand where you failed despite iot being a matured field. I have worked in similar teams. Pivoting is painful but you really need to chart out the plan. Perhaps run a design sprint with 2-4 weeks of prototyping and feedback sessions. This will rapidly cut down pivot time. If you can share more details, I can help in more deeper recommendations.\n\nAlso you not knowing coding is irrelevant here.",
          "score": 4,
          "created_utc": "2026-01-15 16:04:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr4sit",
          "author": "SweetDreams3268",
          "text": "Hopefully you’re treating your cofounder well and realizing their value. Most non technical cofounders treat their CTOs like cost centers",
          "score": 3,
          "created_utc": "2026-01-15 16:32:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzv32dh",
          "author": "jaytonbye",
          "text": "It sounds like downsizing the team is what was needed, but I hope your pivot works out. It's stressful to be a leader responsible for so many others. You seem like you're trying to do right. I wish you the best.",
          "score": 3,
          "created_utc": "2026-01-16 04:25:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqxji9",
          "author": "Artistic_Irix",
          "text": "A great story of difficult struggle and hopefully future success!\n\nThat said, did I understand it correctly that you built the new thing with the old company's resources, employees and funds?  If so, you need to take care of this now.",
          "score": 2,
          "created_utc": "2026-01-15 16:00:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvewvj",
          "author": "coolth0ught",
          "text": "It really suck to be in your position but I think there is always a silver lining to every difficult situation. It has forced you to be laser focused on things that really matter and adapt quickly. Good job surviving and getting to launching new product despite the circumstances.",
          "score": 2,
          "created_utc": "2026-01-16 05:46:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvquey",
          "author": "Informal_Piglet_1067",
          "text": "I've been in a similar position, venture backed business £10m+ raised, that went \\*bang\\* in a sense within 3 months of it's last raise. \n\nThe biggest thing I wish I'd made sure of is to of returned capital instead of burning through it trying to pivot. If investors have fallen out of love, don't wait to call in liquidators as it is horrific. I'm nearly 3+ years later and still going through the process with litigation. \n\nMake sure to get shareholder feedback prior to the pivot/foresight, especially if you have any US based investors. For some, if you switch it up, you might as well open an Ice Cream Shop to them as they will see it as misuse of capital. \n\nNot meaning to sound pessimistic, but unless this new product can hit it out the park, seriously make sure all directors/major shareholders (anyone over £25k investment) is in the loop. Also if you're EIS/SEIS raised make sure whatever you're doing still keeps your qualifying as that can also be effected.\n\nHappy to chat 1:1 as been through this personally.",
          "score": 2,
          "created_utc": "2026-01-16 07:22:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzxlqyd",
              "author": "Ok-Weekend-2343",
              "text": "Thank you for sharing this — seriously. This hits very close to home.\n\nI’m really sorry you’re still dealing with litigation years later. That’s brutal, and it’s exactly the outcome I’m trying hard to avoid. Your point about returning capital versus burning it on a pivot is something I’ve wrestled with, and hearing it from someone who’s lived through the consequences carries a lot of weight.\n\nYou’re absolutely right that hesitation — whether half-pivoting or delaying liquidation — can be just as damaging as making the wrong call. Drifting under pressure is often the worst outcome.\n\nI genuinely appreciate you taking the time to write this. It’s clear you’ve raised real money, made real decisions, and paid a real price for them. That perspective means a lot.",
              "score": 1,
              "created_utc": "2026-01-16 15:17:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0a5vzy",
                  "author": "Informal_Piglet_1067",
                  "text": "Feel free to DM me if you feel the need, its a complex web to navigate but the golden rule - over communicate with everyone at this point. But when you do, have conviction on the \"why\" you're making the decision you are.",
                  "score": 1,
                  "created_utc": "2026-01-18 12:43:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzygalv",
              "author": "MotherCash3583",
              "text": "Funding environment is very different in the U.K. / Europe. A U.S. startup can explode spectacularly and it is water off a ducks back — nobody litigates. Most startups are expected to do whatever to make things work, “misuse of capital” is absurd. I’d love to know your company name so I can look at the insolvency documents.",
              "score": 1,
              "created_utc": "2026-01-16 17:32:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzvwat1",
          "author": "poopsmith27",
          "text": "I loved this story almost exactly as well, you’re not alone!",
          "score": 2,
          "created_utc": "2026-01-16 08:11:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvxabt",
          "author": "Agitated-Board-4579",
          "text": "Share more about this new product.",
          "score": 2,
          "created_utc": "2026-01-16 08:19:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw16n9",
          "author": "Acceptable-Pin-1602",
          "text": "Interesting story, and respect for being this open about it. I’ve been through some hard periods in tech myself, not as a founder, but in senior leadership roles where the pressure, uncertainty, and responsibility still sit on your shoulders.\n\nI’m from the more technical side, and while building new things is exciting, reading this it feels less like a technical problem and more like a go-to-market and risk management one.\n\nThe AI “interrogation” phase you describe definitely caught a lot of companies off guard, you don’t really need to have an AI strategy, as others have said you can label any intelligence you’ve built as AI.\n\nI’m probably more risk-averse than most startup leaders, but relying on the next VC round as a core part of survivability is a big gamble, especially once you’re carrying enterprise contracts, a 40-person team, and real obligations you can’t walk away from.  You should also be looking to leverage these relationships to increase your recurring revenue through upsells and new pipeline.\n\nAI-assisted development can also help the velocity and productivity of your team massively.  I’m not saying to rely solely on AI to develop your products, but it sounds like you still need to make cuts to remain viable in addition to your new product launch.",
          "score": 2,
          "created_utc": "2026-01-16 08:56:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxyge4",
          "author": "NathanSupertramp",
          "text": "Good luck man, may the force be with you",
          "score": 2,
          "created_utc": "2026-01-16 16:14:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03nnkt",
          "author": "Popular-Stay-2637",
          "text": "Damn, this is one of the clearest “AI whiplash” stories I’ve seen. Appreciate you sharing it.\n\nA few things you actually did right (that most founders in your position don’t):\n\nYou didn’t nuke the legacy business even though investors stopped caring. You kept the contracts and cashflow instead of “burn the boats” LARPing.\nYou were honest with the team about the August deadline instead of pretending everything was fine.\nYou didn’t chase some vague “AI strategy deck” – you picked a specific new product (AI hardware for devs) and moved the org, which is insanely hard with ~40 people.\nStill, there are some brutal lessons in here for the rest of us:\n\nTheme risk is real. You built a legit infra company, real revenue, happy customers – and the narrative still killed your ability to raise. Anyone building now needs to assume the market mood can flip again in 12–18 months.\n\nBurn is the gun to your head. 40 people + 8 months of runway is a ticking time bomb. The real constraint wasn’t “no AI story”; it was lack of optionality. With a 10-person team and the same revenue, this is a very different story.\n\nNon-technical founders need a “crisis plan”. You described that helplessness perfectly. In calm times it’s fine; in a pivot, it’s a tax. The counter-move is:\n\nKeep the team as small and senior as possible.\nBuild direct customer access + distribution as your superpower so you’re not “just” steering.\nOn the spin-out / equity split question (the nightmare you’re in now):\n\nNot legal advice, but patterns I’ve seen that don’t blow everything up:\n\nSpin-out NewCo, but don’t pretend OldCo never existed.\nLegacy investors usually get some carry into NewCo (e.g. a small % of common or a “shadow” class) in exchange for:\n\nLetting the team move over.\nNot blocking IP transfer / license.\nAgreeing not to sue when you basically starve OldCo.\nTie economics to who’s actually doing the work now.\nFounders & team building the new product should own the bulk of NewCo. Legacy investors participate, but they don’t get to double-dip at the same price as before. Typical levers:\n\nNew option pool heavily weighted to the current/lean team.\nLegacy investors get a discounted SAFE or a fixed % that reflects risk they already took, not “we own 60% again.”\nClean story for future investors.\nNew investors will ask: “Who controls what, and what obligations does NewCo have to OldCo?”\nRed flags that kill deals:\n\nIP is ambiguous (OldCo maybe owns everything).\nLegacy investors have veto rights / weird ratchets.\nCap table is so crowded that there’s no room for new equity.\nPractically, if I were in your shoes and had to keep everyone (team + legacy investors) minimally sane:\n\nGet a brutally honest board-level meeting.\nPut three options on the table in writing:\n\nA) Run OldCo to cashflow + modest growth, no spin-out.\nB) Spin-out NewCo with clear cap table, legacy investors get X% and first check rights.\nC) Wind down in an orderly way.\nForce everyone to confront reality instead of hand-waving “we’ll see after launch.”\nDesign NewCo like you learned from this.\n\nMinimal team.\nRuthless burn controls.\nDon’t build “AI infra for infra’s sake” – pick a wedge devs would actually miss.\nProtect your own time and sanity.\nYou’re effectively running:\n\nA distressed infra business,\nA seed-stage deep-tech startup,\nAnd a legal/structuring mess. That’s three full-time jobs. Decide what only you can do (likely: narrative, key customers, and the spin-out deal) and delegate or kill everything else.\nIf you’re willing to share anonymously: I’d be very curious what you wish you’d done differently in 2023 when things looked great. My guess: slower hiring, tighter burn, and a product wedge closer to the AI/dev stack earlier.\n\nEither way, respect for fighting through this. Most companies just quietly die and pretend it was “a soft landing.” You actually tried to steer the ship while the market moved the ocean underneath you.",
          "score": 2,
          "created_utc": "2026-01-17 13:26:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ap4c5",
              "author": "Ok-Weekend-2343",
              "text": "First of all, respect like that from someone who’s clearly been through similar battles means a lot. Thank you! \n\nAnd, you’re right on timing. I’m already planning a board-level discussion, and this is very much a “sooner rather than later” decision, not something to defer until after launch. I’m genuinely going to sit with this and think it through. I’ve already decided to write a follow-up once things are a bit clearer, partly because comments like this deserve a proper response rather than a quick reply :)",
              "score": 1,
              "created_utc": "2026-01-18 14:43:02",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o0ls1aw",
              "author": "Select-Ad-1883",
              "text": "Very AI response",
              "score": 1,
              "created_utc": "2026-01-20 03:39:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o04xmoq",
          "author": "quizzs",
          "text": "I read similar situation in book called hard thing about hard thing, it might help",
          "score": 2,
          "created_utc": "2026-01-17 17:19:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr19hh",
          "author": "luckycat81",
          "text": "Was “success” after Series A clearly defined at the time of the raise?",
          "score": 1,
          "created_utc": "2026-01-15 16:16:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr55me",
          "author": "getoutlonnie",
          "text": "You don’t need to build your way out of a problem, you need to sell your way out of a problem. I just read ten paragraphs and not a single word about sales. ",
          "score": 1,
          "created_utc": "2026-01-15 16:34:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04kzbq",
              "author": "BeKindBeBrave",
              "text": "This jumped out at me too. And not a word about customer/buyer needs. Alarm bells when they said the market changed and described the investment landscape. That isn't the market.",
              "score": 1,
              "created_utc": "2026-01-17 16:20:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzshpbp",
          "author": "tastychaii",
          "text": "What are you guys doing to get funding? Which organisations are you approaching? I’ve never understood this part about raising seed capital for Start ups.\n\nI can’t help you all that much. All I can say is good luck!",
          "score": 1,
          "created_utc": "2026-01-15 20:12:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzta3e1",
          "author": "AlejandraH411",
          "text": "I’m not American but wouldn’t the company be legally and financially delegate from yourself if things don’t work out?",
          "score": 1,
          "created_utc": "2026-01-15 22:25:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0386pz",
              "author": "s733vo",
              "text": "I wondered that too, Alejandra.  However,  in some cases the veil of security between the corporate and personal can be pierced if mal-intent can be proved.  ( I’m not accusing the OP of any wrongdoing - just speaking hypothetically). Plus,  he’s worried about his team’s welfare .  That would keep me up at night too.\nBTW,  inspirational story, OP! 😄",
              "score": 1,
              "created_utc": "2026-01-17 11:29:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzue9zh",
          "author": "stepperbot6000",
          "text": "Hey I was looking for a remote job as an intern and iam mostly looking to learn let me know if u want another hand to help you out , I might be of some help in code and product development.",
          "score": 1,
          "created_utc": "2026-01-16 02:01:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzuqyjg",
          "author": "johnhas61",
          "text": "Get lean and Launch an Ai initiative that ties in with your product - you’re bootstrapping now",
          "score": 1,
          "created_utc": "2026-01-16 03:12:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzv1c90",
          "author": "Galaxy-Hitchhiker-42",
          "text": "The answer is definitely \\_not\\_ to build your way out.\n\nIt feels productive because you get instant, tangible results — but building without validating the market is exactly how founders tunnel deeper into the wrong direction. It’s a trap. It burns time, money, and emotional energy without getting you any closer to product–market fit. And as a technical founder, I’ve been there.\n\nInvestors asking about AI may not actually be about AI.  It can be their way of testing your understanding of where your market is headed, your ability to articulate long-term strategy, and your sense of future moat. It’s a question about vision, not features. A vision test, not a buzzword test.\n\nIf you’re still figuring out who you’re serving and why they’d pay, building won’t magically solve that. Strategy, customer discovery, and positioning are the uncomfortable parts — and they’re the things that determine whether anything you build actually matters.\n\nTBH, the risk here isn’t that the product is obsolete — it’s that you, the founder, might be reacting to investor pressure by building instead of thinking. And that’s the wrong direction to double down on.\n\nFrom your post, it’s not even clear that your product is “obsolete.”  It actually sounds like you’ve had some traction with customers, and some traction with fundraising - which means the foundation is there. What you’re feeling now is the pressure of needing to steer, not code.\n\nDon’t get lost in the noise. Don’t follow the sirens. Do what you need to do to keep the business afloat - and steer it toward a market that genuinely needs what you can offer.",
          "score": 1,
          "created_utc": "2026-01-16 04:14:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvizwi",
              "author": "Ok-Weekend-2343",
              "text": "Really appreciate this perspective. Looking back, I think at the end of 2024 I was probably reacting too much to investor pressure, and that pushed us into a pivot under a lot of stress. It’s a bit like an athlete whose form breaks down under extreme pressure.\n\nThat said, I do feel like we’ve since found more clarity and regained some calm around the direction. The main thing I need to sort out now is the leftover complexity around investors as we transition between the old and new efforts.\n\nThanks again — this was genuinely helpful.",
              "score": 1,
              "created_utc": "2026-01-16 06:17:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzw3e3e",
                  "author": "Galaxy-Hitchhiker-42",
                  "text": "Good to hear - and it’s encouraging that you’ve been able to regain some clarity. That can be incredibly hard in the fog of startups, especially while managing multiple (and often conflicting) investor expectations.\n\nKeep your eye on the prize: building a business that meets a real, growing demand. Investors might disagree with you in the short term, but if you can deliver that, they’ll come around quickly.\n\nKeep going. It sounds like you’re on the right track.\n\nIf you’re open to sharing more, I’m all ears - happy to listen.",
                  "score": 1,
                  "created_utc": "2026-01-16 09:16:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzv4dvj",
          "author": "Severe_Promise717",
          "text": "this is the part nobody warns you about as a non technical founder\n\nyour leverage is not code, it is clarity  \nwhen things went sideways for me, the only way out was brutal focus  \none bet  \none narrative  \none way the company survives\n\ntrying to hedge killed more startups than bad tech ever did  \nonce the team knew the real clock and the real goal, morale actually improved\n\npanic hides options  \nclear constraints create them",
          "score": 1,
          "created_utc": "2026-01-16 04:33:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvawmh",
          "author": "0utkast_band",
          "text": "I didn’t quite get one thing. Did you make the AI product using the original team? How did you pay for the new product dev expenses? \n\nAsking because I don’t understand, are you leaving the original investors behind?",
          "score": 1,
          "created_utc": "2026-01-16 05:17:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvkiut",
          "author": "adspendagency",
          "text": "good thing Claude knows how to code…",
          "score": 1,
          "created_utc": "2026-01-16 06:29:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw9o0n",
          "author": "QuantumWolf99",
          "text": "Hmmm brutal reality is you probably shouldn't have pivoted... keeping 40 people on 8 months runway while rebuilding guarantees you run out of cash before finding product-market fit in a saturated AI hardware market with zero differentiation.\n\nYour best move was aggressive cost cutting to 12-15 people extending runway to 18+ months, then validating demand before building... because now you've burned capital on a product nobody asked for while legacy contracts still drain focus.",
          "score": 1,
          "created_utc": "2026-01-16 10:14:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwkvq6",
          "author": "Specific_Cow_4246",
          "text": "What kind of IoT? I think there a ton of things you can do with that data.\n\n  \nI worked as a data engineer in some IoT companies, and there is massive value yo can give with that data. There is an oportunity. Sometimes to add \"IA\" you can just say: we will give value to that data through ia. Bullshit, it could be a model, a chatbot, a script that sends an email. The important thing is to trigger actionable to add value to clients = to reach more clients and add more value to the current ones.\n\nOne of the unicorns that Europa had in 2025 was a one that can do predictable maintenance to industrial machines. How do you do that? connecting IoT to them and measuring the ton the data they give.\n\nIf you want to dm me happy to help or a little talk about what i did",
          "score": 1,
          "created_utc": "2026-01-16 11:48:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzws2k5",
          "author": "DotAccording8872",
          "text": "I don’t understand the non-coding issue: can’t you help get more customers? That’s as valuable as coding (and sometimes more valuable).",
          "score": 1,
          "created_utc": "2026-01-16 12:39:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxac48",
          "author": "Green-Setting5062",
          "text": "Maybe start buying printed circuit board laminating equipment and hire some smart computer engineers and make motherboards for data centers in the United States and sell them to the defense contractors who have to use all American made stuff. And also do Roger's boards for high end government RF. Seem like how musk got Rich was government contracts. SaaS is dead. Vc needs to start funding critical infrastructure.",
          "score": 1,
          "created_utc": "2026-01-16 14:22:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzy2v12",
          "author": "IseeAlgorithms",
          "text": "They asked for an AI strategy, and now that you have one you need to hide it from them?",
          "score": 1,
          "created_utc": "2026-01-16 16:33:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzors1",
          "author": "No_Detail_9093",
          "text": "I’ve had to shut down my old company. I tried to pivot it while keeping old contracts alive. Failed. In hindsight, I would never again try to “chase two rabbits at once.” Looking back, I think many of my decisions were not radical enough. Today I try to make binary decisions.​​​​​​​​​​​​​​​​",
          "score": 1,
          "created_utc": "2026-01-16 20:54:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00i39m",
          "author": "Special-Style-3305",
          "text": "Sticking AI into everything doesn't mean much unless it serves as an actual utility to the end user. Glad you've got a new product in the works. The best stuff is usually borne out of necessity! Good luck.",
          "score": 1,
          "created_utc": "2026-01-16 23:19:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o010kfl",
          "author": "metamorphyk",
          "text": "Start moving cash and assets into your own name and liquidate",
          "score": 1,
          "created_utc": "2026-01-17 01:05:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o016k9c",
          "author": "OldFisherman8",
          "text": "In my experience, people invest in people, not in a product. No matter how good the ideas are, people simply don't invest unless they believe in you. In the end, it is the trust and commitment you make on their trust.\n\nI frankly don't understand your point about being non-tech in this age of AI. In the past, even if you understood the business processes and identified the problems and solutions, you simply couldn't code because you lacked coding syntax and grammar. But that is what AI excels at, coding grammar and syntax. In fact, what AI lacks is the understanding of business processes underneath. \n\nIn the end, AI is a tool just like any other thing in business. And if you are committed to solving a certain business problem and offering solutions, AI is a tool that can be used as a part of the solution. Nothing more, nothing less.",
          "score": 1,
          "created_utc": "2026-01-17 01:43:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o017y8d",
          "author": "Few-Mud-5865",
          "text": "you don't need to pivot,  you just change your mindset to see how you can rebuild your business with a AI+ mindset, like said in this article [AI+ business ](https://www.ai-sympathy.com/2025/12/ai-vs-ai-why-large-language-models.html)",
          "score": 1,
          "created_utc": "2026-01-17 01:52:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01w0g3",
          "author": "desexmachina",
          "text": "Unfortunately, one idea alone isn’t enough, at least you can be bought with this new idea. Don’t be afraid to bring in outside ideas because what happens is it starts generating other ideas. If you have a 40 person company, you have the people to make it happen. I’ve known of $Billion companies that couldn’t ideate their way out of a problem and they brought in outsiders to help make that happen.",
          "score": 1,
          "created_utc": "2026-01-17 04:29:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o020gzu",
          "author": "commentinator",
          "text": "I’m calling bullshit on this. Can’t jump ship because you’ll be sued into oblivion… ahh no, that is really not how it works. Are you IOT or infrastructure? You explain nothing about what you actually do or how AI affects your business. Complete crap",
          "score": 1,
          "created_utc": "2026-01-17 05:01:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02bldg",
          "author": "Loose_Historian",
          "text": "Been there done that. Raised similar money initially and built first product (B2B SaaS), initial success but then the market proved to be smaller than we thought and super crowded. Decided to build a second product within the same company, which was also an initial success (Enterprise B2B SaaS). We had to raise more money for sales and marketing, but the complexity of having 2 products with different target groups in a relatively early stage company (60 people) spooked all future investors. \nMy advice is: don't do it. Close the first business by giving money back to investors or just resign and let someone else lead that one. Start the second business with a small trusted team, clean cap table and new investors. Old investors won't trust you anymore and your goal should be to avoid any litigation (which will wear you down). \nHappy to talk and share my advice!",
          "score": 1,
          "created_utc": "2026-01-17 06:29:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02qd4f",
          "author": "robsantos",
          "text": "What category is the IOT device in? No chance for it to succeed?",
          "score": 1,
          "created_utc": "2026-01-17 08:42:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04zc9p",
          "author": "shoedy",
          "text": "Launching the new product paid for by your legacy investors that won’t see any returns by putting it in a new entity is going to bring its own lawsuits for sure. You can’t just transfer that intellectual property without consequence, especially if it will prove to be valuable",
          "score": 1,
          "created_utc": "2026-01-17 17:27:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09eu8g",
          "author": "Medium_Web_1122",
          "text": "Why not learn to code? The learning curve is super easy these days with Claude ",
          "score": 1,
          "created_utc": "2026-01-18 08:43:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09s4yl",
          "author": "Advanced-Lake-7354",
          "text": "Just say your new features are the same but put the word AI in front of it. \n\nLiterally it’s what every other company is doing…. Just say it’s AI infrastructure that does AI dynamic IoT management and boom you’re back in the game.",
          "score": 1,
          "created_utc": "2026-01-18 10:46:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09v2j4",
          "author": "rt2828",
          "text": "Knowing everything you know today, would you organize your company the way it exists today? Can you reduce cost while still serving your current customer base to increase your runway for a pivot? Instead of fighting AI, can you find a way to lean in and leverage it for growth and reducing cost? If you cannot find a way to change the current situation, shut it all down now because it won’t be easier when you completely run out of $.",
          "score": 1,
          "created_utc": "2026-01-18 11:13:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09zdv7",
          "author": "szymon-slowik-seo",
          "text": "Is there any potential for a new low effort income generating business line? What your company actually does?",
          "score": 1,
          "created_utc": "2026-01-18 11:51:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0a51hn",
          "author": "SomedaysDog",
          "text": "Look to calibrate the market and see what M&A advisors say. There are plenty of buyers out there who will buy as a bolt on. Speak to tech mid market advisors who will tell you straight. A few are run by ex-CEOs who have been there and know the way out of the hole.",
          "score": 1,
          "created_utc": "2026-01-18 12:37:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f20ni",
          "author": "bihwhou",
          "text": "You will not fail",
          "score": 1,
          "created_utc": "2026-01-19 03:57:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g6mqo",
          "author": "gordo1223",
          "text": "Multiple teams that I advise have had to do similar - find an off-ramp from the VC treadmill.   \n  \nFunding rounds (especially follow-on priced rounds like yours) now are very much a dumbbell distribution unless you've got AI under the hood and exponential growth driving topline.\n\nMost of my teams have figured out a path to default alive and a way off of the VC juice. Honestly, I think that on a 2-4 year timescale, they'll be much healthier and have better economic outcomes for their teams than those who chose to stay on the VC juice.",
          "score": 1,
          "created_utc": "2026-01-19 09:25:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jjx3b",
          "author": "Wingman602",
          "text": "Man, this hit close to home.\n\nI ran an IoT company, started it in 2016, we monitored IoT products in the field. We didn’t raise $7M, but we scaled to \\~$75k MRR with real customers and traction. Then my technical co-founder pulled us deep into an AI rabbit hole, chasing what might be possible instead of protecting what was already working. Long story short: we lost the company... There's a lot more that led up to this but in the end that's what happened. Still cleaning up the mess today and we basically shut down in Oct. 2024. \n\nA few things I wish someone had told me earlier, especially as a non-technical founder:\n\n* The helplessness is real, but it’s not useless. You may not write code, but you own framing, sequencing, and constraints. In pivots, the most dangerous thing isn’t bad code, it’s unclear decision logic. Your value right now is forcing the tech team to choose what not to build.\n* AI didn’t kill your company, narrative whiplash did. Most infrastructure businesses didn’t become obsolete overnight; they became harder to explain. Investors moved the goalposts faster than products could adapt. That’s a mismatch of timing, not a failure of execution.\n* The “keep the lights on + pivot” phase breaks founders quietly. You’re running two companies with one balance sheet and no applause, man. The fact you’re still standing in Jan 2026 puts you in rare territory.\n\nOn the spin-off question (learned this the hard way):\n\nTo keep legacy investors happy:\n\n1. Be surgical about IP: Be explicit about exactly what IP belongs to the legacy entity vs. the NewCo\n2. Separate Value from Control: Give legacy investors a path to upside (equity in NewCo) without giving them the ability to choke the new pivot's agility.\n3. Document the \"Failure State\": Write down now what happens if NewCo stalls. “We’ll figure it out later” breeds resentment faster than dilution ever will.\n\nYou didn’t fail your team. You carried them through the hardest possible version of a pivot: no money, no hype, and no safety net. What you’re doing right now is founder-level leadership, even if it feels like drowning.\n\nHang in there.",
          "score": 1,
          "created_utc": "2026-01-19 20:38:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ky94r",
          "author": "Lareinadelsur99",
          "text": "Ai Is turning the internet to trash unfortunately VC are mostly stupid so that’s what they focus on.\n\nMost VC only care about short term profitability and they know Ai is the latest thing \n\n\n\nCould be worth outsourcing to an Ai expert to take over that part until people realise it’s ruining  the user experience and erasing trust  which are fairly crucial with online businesses",
          "score": 1,
          "created_utc": "2026-01-20 00:55:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l4jur",
          "author": "Opposite-Depth6163",
          "text": "Sorry that you're going through this. This brought back some sad memories for me. Best of luck, stranger. 🙏",
          "score": 1,
          "created_utc": "2026-01-20 01:30:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0njqtd",
          "author": "VividPraline5886",
          "text": "In this era you can build an app without coding experience/knowledge. I don’t know if I can mention “how” here or what platforms, but I have a business background and MBA and have built 4 apps since Xmas giving unbelievable results ….. secure data at the backend…. Camera functions, upload functions, voice functions. You’re right, your investors will be upset if you don’t use this opportunity in time to secure your competitive advantage and get a return on their money. I think it’s against Community rules to share business details, otherwise I’d give you a free consult to help out of this bind….. best bet, ask your favourite AI tool how they can help you…..and then ask some other AI tools. Shop the advice…",
          "score": 1,
          "created_utc": "2026-01-20 12:10:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tv07n",
          "author": "Odd_Brother_5635",
          "text": "This honestly gave me chills. The helplessness you described as the non-technical founder is so real and so rarely talked about.\n\nKeeping enterprise contracts alive while pivoting an entire team with no new money sounds insanely hard. Huge respect for getting the company to launch again under those conditions.\n\nWishing you luck with the spin-off — that part alone is a minefield even without everything else you’ve been carrying.",
          "score": 1,
          "created_utc": "2026-01-21 09:52:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr6kw4",
          "author": "PoopSmoothies",
          "text": "I’ve started and run a 40+ person venture-backed iot company with a few pivots and eventually an exit that made some money. I’m also deep into ai-driven development now. Happy to chat whether you want a shoulder to cry on or a second look at your strategy/pivot/whatever.",
          "score": 1,
          "created_utc": "2026-01-15 16:40:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqds7g",
          "author": "Revolutionary_Task59",
          "text": "Dm for scaling up",
          "score": 0,
          "created_utc": "2026-01-15 14:25:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qikjat",
      "title": "This is the quiet reason most growth experiments don’t compound",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qikjat/this_is_the_quiet_reason_most_growth_experiments/",
      "author": "freebie1234",
      "created_utc": "2026-01-21 01:45:24",
      "score": 52,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "Most growth doesn’t stall because people lack ideas or tools.  \nIt stalls because **experiments aren’t documented properly**.\n\nHypotheses live in heads.  \nResults are shared once, then forgotten.  \nLearnings don’t compound.  \nA month later, the same tests get run again.\n\nSo teams feel “active”, but growth stays flat.\n\nI ran into this myself and realized the problem wasn’t velocity, it was memory. I started treating documentation as part of the experiment loop. I’ve been keeping hypotheses, results, and decisions in one place using **Notion**, and I also have access to a **free 3-month startup trial that includes Notion AI**, which I mainly use to summarize experiment outcomes and clean up thinking between iterations.\n\nThis didn’t magically create growth.  \nBut it stopped us from wasting cycles.\n\nIf you’ve run experiments that didn’t move the needle, what do you think actually broke?  \nI’d like to hear how others make learnings compound.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qikjat/this_is_the_quiet_reason_most_growth_experiments/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qdzjeu",
      "title": "How I document growth experiments so learnings don’t disappear",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qdzjeu/how_i_document_growth_experiments_so_learnings/",
      "author": "freebie1234",
      "created_utc": "2026-01-15 23:30:19",
      "score": 42,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Most growth experiments fail not because of bad ideas, but because learnings get lost.\n\nI started documenting everything in a simple Notion system:\n\n* Hypotheses and assumptions\n* Channel-specific experiments\n* Results and insights\n* Follow-up actions\n\nIt’s helped me avoid repeating the same tests without realizing it.\n\nFor teams working seriously on growth, Notion also offers a 3-month free Business plan for companies with a website and domain email.\n\nYou can benefit here : [Apply Now!](https://affiliate.notion.so/3month)[](https://www.reddit.com/submit/?source_id=t3_1qdzenv)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qdzjeu/how_i_document_growth_experiments_so_learnings/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzv4rcb",
          "author": "Severe_Promise717",
          "text": "i ran into this exact issue and the docs were the fix\n\nthe insight was writing learnings like rules, not notes  \nwhat worked  \nwhat failed  \nwhat to never test again  \nthat stopped me from looping\n\ni picked this up the hard way and later saw it framed simply in NoFluffWisdom, where they treat experiments like systems you refine over time, not ideas you forget [here](https://NoFluffWisdom.com/Subscribe)\n\nif a test teaches nothing you can reuse, it was just motion",
          "score": 1,
          "created_utc": "2026-01-16 04:36:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gehy1",
          "author": "Inevitable_Hour_7366",
          "text": "Nice system. What is typical time length that you make one experiment for meaningful results?",
          "score": 1,
          "created_utc": "2026-01-19 10:38:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u6nwo",
          "author": "feliceyy",
          "text": "Nice one! Do you document the results of your follow-up actions?",
          "score": 1,
          "created_utc": "2026-01-21 11:34:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qehxmm",
      "title": "Tried every growth hack for 6 months. Revenue grew 800% when I stopped and focused on one boring channel",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qehxmm/tried_every_growth_hack_for_6_months_revenue_grew/",
      "author": "Fun_Description_308",
      "created_utc": "2026-01-16 14:48:51",
      "score": 41,
      "num_comments": 20,
      "upvote_ratio": 1.0,
      "text": "January through June: tried viral loops, referral programs, gamification, growth Twitter threads, partnership outreach, influencer collaborations, every tactic from growth blogs. Revenue fluctuated between $400-700 monthly. Constant effort, zero compound effect. Each tactic worked briefly then died.\n\nJuly: gave up on growth hacks, went all-in on the most boring channel possible SEO blog content. Published 3 posts weekly targeting specific long-tail keywords. Nothing clever, just solving actual problems people search for. First 6 weeks got maybe 200 total visitors. Almost quit because growth hacks felt more exciting.​\n\nEight months later: SEO brings 15-20 signups daily on autopilot, zero ongoing effort. Revenue at $3,600 monthly, up 800% from growth hacking phase. All from boring consistent content compounding. Best part: can stop writing new posts and traffic keeps growing. Growth hacks required constant effort, SEO compounds.\n\nThe uncomfortable truth: growth hacks feel productive but rarely compound. SEO feels boring but creates sustainable growth. Viral loops need existing users. Referrals need happy customers you don't have yet. Partnerships take months negotiating. SEO just requires showing up consistently for 3-6 months while seeing zero results.​\n\nMost growth hackers fail because they lack patience for compound channels. They want this week's tactic to work this week. Real growth comes from boring consistency over months. Found this studying [FounderToolkit's](http://foundertoolkit.org) growth data successful founders dominated 1-2 boring channels, failed founders tried everything weekly.\n\nWhat's your compound channel? Or still jumping between growth hacks hoping one sticks?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qehxmm/tried_every_growth_hack_for_6_months_revenue_grew/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzxgmwu",
          "author": "Same_Violinist8438",
          "text": "published 3 posts weekly targeting long-tail keywords, nothing clever just solving problems people search for demonstrates boring consistency beats clever tactics.",
          "score": 3,
          "created_utc": "2026-01-16 14:53:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxigfw",
          "author": "Aggressive_Doctor496",
          "text": "those 3 posts weekly, how long were they and were you writing everything yourself or using writers?",
          "score": 2,
          "created_utc": "2026-01-16 15:02:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzxjbae",
              "author": "Fun_Description_308",
              "text": "\nPosts were 1,200-1,800 words each, wrote everything myself in 90-minute blocks per post so about 4.5 hours weekly total. Outsourcing content early kills your understanding of what resonates, need to write first 50+ yourself to learn voice and what converts.",
              "score": 2,
              "created_utc": "2026-01-16 15:06:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzxhkie",
          "author": "Quiet_Composer_8622",
          "text": "still jumping between growth hacks hoping one sticks honestly. This week trying Reddit ads, last week was cold email. Need to pick SEO and commit for 6 months straight",
          "score": 1,
          "created_utc": "2026-01-16 14:57:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzynijx",
          "author": "Severe_Promise717",
          "text": "this mirrors what finally worked for me too  \nthe mistake i kept making was chasing exciting feedback  \nboring channels feel dead because they dont clap back\n\none shift that mattered was picking a lane that pays late  \nthen locking a rule to never judge it early  \nno tweaking no hopping no coping\n\nseo email content ops  \nall the same lesson\n\nif it compounds it will feel dumb at first  \nif it feels smart it probably resets tomorrow\n\npick one  \nignore your feelings for 90 days",
          "score": 1,
          "created_utc": "2026-01-16 18:04:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyo5ab",
          "author": "Wrong-Finish7655",
          "text": "this is basically it yeah. most people won’t sit through the 3–6 months of “nothing’s happening???” so they bail early. seo isn’t magic, it just punishes impatience. if someone’s still chasing hacks, they probably haven’t earned a boring channel yet.",
          "score": 1,
          "created_utc": "2026-01-16 18:07:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyytdu",
          "author": "_os2_",
          "text": "I am trying the ”blog route”, at 19 blogs now after 8 weeks of posting so pace not at your level but comparable. Could you have a look at [Skimle’s blogs](https://skimle.com/blog) and give your tips on what to keep/change/add? We’re targeting knowledge professionals starting to dabble into advanced AI tools (beyond simple LLMs) for qualitative analysis. \n\nI am new to the growth game so any advice from experts is welcome!",
          "score": 1,
          "created_utc": "2026-01-16 18:54:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzopi6",
          "author": "2NOA",
          "text": "Yes, organic growth, not growth hacking. I agree that consistency pays off, especially on digital channels.",
          "score": 1,
          "created_utc": "2026-01-16 20:54:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzr1d5",
          "author": "Forward_Proposal_520",
          "text": "Boring channel > shiny tactic. That’s the whole game.\n\n\n\nI had a similar arc: bounced between cold DMs, Product Hunt, affiliates, “build in public” on X, all that. Spikes of attention, zero baseline. What finally worked was picking one channel (for me, targeted SEO + a tiny email list) and doing it every week for a year. Same keyword cluster, same pain points, same call to action. Once a few posts ranked and the list hit 1k, everything else got easier.\n\n\n\nThe underrated part is feedback loops: SEO + a simple CRM + something like Ahrefs/GA4 (and in my case Pulse alongside Clearbit) turns into a system where you can see which specific questions, keywords, and threads drive trials, then keep hammering those instead of chasing trends.\n\n\n\nBoring channel > shiny tactic, every time.",
          "score": 1,
          "created_utc": "2026-01-16 21:05:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzxduu",
          "author": "ArtOverSleep",
          "text": "How are your signups generating income?",
          "score": 1,
          "created_utc": "2026-01-16 21:35:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00qkbq",
          "author": "w4nd3rlu5t",
          "text": "what SEO tool do you use to figure out the right long tail keywords?",
          "score": 1,
          "created_utc": "2026-01-17 00:06:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02t4mn",
          "author": "trainmindfully",
          "text": "this lines up with what a lot of people learn the hard way. most growth hacks are leverage on top of something that already works, not a foundation by themselves. SEO feels slow because feedback is delayed, but that delay is exactly why it compounds when you get it right. the tricky part is sticking through the quiet months without switching channels out of boredom. curious if you narrowed SEO to one intent cluster early or let it stay broad at first.",
          "score": 1,
          "created_utc": "2026-01-17 09:08:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02xtp8",
          "author": "BbWeber",
          "text": "Same here - started in September and now i get 100 landing page visits which convert in <20 mobile app downloads per day.",
          "score": 1,
          "created_utc": "2026-01-17 09:53:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o038y7x",
          "author": "sarkhem",
          "text": "I went through the same phase. Tried everything that *looked* smart and measurable, but nothing stuck. The dopamine of quick tactics is real, even when revenue stays flat.\n\nThe shift for me happened when I realized compound channels only work if you understand how discovery actually happens inside them. SEO isn’t just “write content”. It’s aligning with how search engines interpret intent over time.\n\nWhat surprised me most was how boring consistency feels while it’s working. The first few months look like failure. Then suddenly past work starts doing the heavy lifting.\n\nI also agree that most people fail here because they mix channels too early. One compound engine, fully understood, beats five half-tested hacks.\n\nCurious. When you doubled down on SEO, did you focus more on informational queries first or jump straight into commercial intent?",
          "score": 1,
          "created_utc": "2026-01-17 11:36:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0393zt",
          "author": "dorukgezici",
          "text": "Interesting, how did your domain authority look before starting the SEO efforts? I am curious if that’s a pre-requirement",
          "score": 1,
          "created_utc": "2026-01-17 11:37:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0623xm",
          "author": "Enough-Couple-7215",
          "text": "Use a tool like https://sonarpro.app to find hot leads easier jumping into threads on Reddit",
          "score": 1,
          "created_utc": "2026-01-17 20:32:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f3yzo",
          "author": "Slight_Tutor1790",
          "text": "What stood out to me is how much of this is really about trust in delayed feedback. Most teams are fine with slow product cycles or long sales cycles, but when it comes to growth they expect instant proof. Channels like SEO force you to build conviction without applause. Once that muscle is there, it changes how you evaluate everything else you try.",
          "score": 1,
          "created_utc": "2026-01-19 04:09:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qeen8",
          "author": "john_white100",
          "text": "How are you converting your blog visitors into customers? Lead magnet to get them onto a mailing funnel? Sales info embedded within your blog posts? Something else?",
          "score": 1,
          "created_utc": "2026-01-20 20:40:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyfx95",
          "author": "Legitimate-Net6717",
          "text": "This resonates so much. Growth hacks are exciting because they *feel* like progress, but they rarely build anything that lasts. SEO, email, even niche community engagement—these “boring” channels compound over time. Patience and consistency are underrated superpowers in growth.",
          "score": 0,
          "created_utc": "2026-01-16 17:31:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lznuu",
          "author": "JayOppoy",
          "text": "This is such a good reality check. SEO really is the ultimate \"boring but works\" channel,  that 3-6 month patience gap kills most people.\n\nOne thing I'd add: **comments can compound too.** Not the spammy kind, but consistently showing up in relevant conversations builds familiarity over time. People start recognizing your name before they ever hit your site. \n\nI use **Commentions** to automate that part,  same \"boring consistency\" energy as your SEO approach, just for social visibility. Combined with long-tail content, it's a solid 1-2 punch. It mentions my brands every day on relevant conversation on LinkedIn and X.\n\nBut you're 100% right,  picking a channel and sticking with it beats chasing hacks every time. Congrats on the 800% growth!",
          "score": 0,
          "created_utc": "2026-01-20 04:24:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgs1r5",
      "title": "Faceseek fits well into modern growth strategies",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qgs1r5/faceseek_fits_well_into_modern_growth_strategies/",
      "author": "delhitop_7inches",
      "created_utc": "2026-01-19 02:39:24",
      "score": 34,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "&#x200B;\n\nFaceseek can be a nice addition to any growth stack if used smartly. It focuses more on discovery than hard selling, which is refreshing.\n\n I found it useful for testing visibility without risking much. The platform doesn’t overwhelm you with features, which is a good thing. \n\nIf you’re experimenting with different growth channels and want something low-effort but effective, Faceseek is worth giving a try.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qgs1r5/faceseek_fits_well_into_modern_growth_strategies/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qi0pcx",
      "title": "SMTP server for mass email and transactional emails",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qi0pcx/smtp_server_for_mass_email_and_transactional/",
      "author": "Blue_Flaire_7135",
      "created_utc": "2026-01-20 13:10:48",
      "score": 30,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "I'm currently evaluating SMTP servers and want something that can handle both mass email campaigns and transactional emails reliably. By transactional emails, I mean things like password resets, welcome emails, and notifications that need to hit the inbox consistently. A few questions I have...\n\nWhich SMTP providers do you trust for high deliverability for both transactional and bulk emails?\n\nAre there any pitfalls I should watch out for when using the same service for both types?\n\nBonus: integrations with platforms like Shopify, WordPress, or CRMs are a plus. I'd like to hear your experiences/recommendations!\n\nAppreciate it.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qi0pcx/smtp_server_for_mass_email_and_transactional/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o0nybhe",
          "author": "CompetitivePop-6001",
          "text": "If deliverability is your top concern... we've had great results with postmark. It's built specifically for transactional emails so things like password resets and welcome emails hit the inbox reliably. They also allow sending some bulk messages but their main focus is keeping transactional emails out of spam. The setup is straightforward, and they integrate with most platforms via SMTP or API. Definitely worth checking out if you want your critical emails to actually reach users.",
          "score": 3,
          "created_utc": "2026-01-20 13:43:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0o0b5s",
              "author": "Alternative-Jacket70",
              "text": "Same! Postmark has changed the game for us. Our transactional emails used to get lost or hit spam,but since moving everything over...delivery is almost 100%.\n\nPlus their dashboard makes it easy to track opens, bounces, and spam complaints, which is super helpful if you're managing both transactional and occasional bulk emails.",
              "score": 1,
              "created_utc": "2026-01-20 13:54:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0nyw1n",
          "author": "OkiDokiPoki22",
          "text": "A few practical tips from painful experience: \n\n\\-Separate everything for transactional vs cold/bulk\n\n\\-For transactional, you want boring, predictable traffic with perfect auth. Dedicated domain, SPF, DKIM, DMARC aligned, low complaint rate, zero list risk. Look into SMTP services like Mailtrap, Mailgun, SMT2Go, etc. \n\n\\-Cold outreach is inherently risky. Even if you do it “right,” complaints and bounces happen. Keep that blast radius isolated so it never touches critical emails. Use a different email service provider for that. \n\n\\-Warm up of email: especially if you self-host or use providers that allow custom IPs. Warm transactional slowly and never mix it with promos during warm-up.  \n\nSo, protect transactional at all costs, and assume cold will eventually get you in trouble.",
          "score": 1,
          "created_utc": "2026-01-20 13:46:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ofwo1",
          "author": "Altruistic_Limit118",
          "text": "I was using Sendgrid, but just moved to mailtrap and really enjoy it. I was evaluating postmark and brevo.   \nBrevo isn't as great with deliverability but postmark doesn't scale well in terms of price. Mailtrap focuses on deliverability, has a decent api, good analytics, and scales well over time.",
          "score": 1,
          "created_utc": "2026-01-20 15:15:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0oi9vt",
          "author": "PearlsSwine",
          "text": "The important question is this: are you planning on sending cold email? That matters as to who you can work with.",
          "score": 1,
          "created_utc": "2026-01-20 15:26:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tc6s1",
          "author": "imvish",
          "text": "try [duocircle.com](http://duocircle.com) and [outboundsmtp.com](http://outboundsmtp.com)",
          "score": 1,
          "created_utc": "2026-01-21 06:55:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh76m5",
      "title": "What outbound experiments actually improve reply quality and not just open rates?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qh76m5/what_outbound_experiments_actually_improve_reply/",
      "author": "Bitreous007",
      "created_utc": "2026-01-19 15:28:47",
      "score": 26,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "Most of my early outbound experiments focused on copy. Subject lines, openers, call to actions. I ran test after test and saw small gains, but nothing that really moved the needle.\n\nWhat finally made a noticeable difference was not the message. It was who I was sending it to.\n\nOnce I started filtering leads by actual role and buying relevance, reply quality improved almost immediately. Same copy, same volume, better conversations.\n\nTo support this, I started using SalesTarget  because it lets me narrow leads by real job roles instead of guessing from company size or industry alone. I still test copy and timing, but targeting turned out to be the biggest lever for us.\n\nFor people using outbound as a growth channel, I am curious.\n\nWhat experiments have actually worked for you lately? Copy, targeting, timing, or something else?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qh76m5/what_outbound_experiments_actually_improve_reply/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qe8r4z",
      "title": "From 0 to meaningful organic traffic by focusing on \"relevance over volume",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qe8r4z/from_0_to_meaningful_organic_traffic_by_focusing/",
      "author": "Embarrassed_Poem9556",
      "created_utc": "2026-01-16 06:40:26",
      "score": 25,
      "num_comments": 8,
      "upvote_ratio": 0.95,
      "text": "A lot of growth tactics chase volume: more content, more links, more hacks. The biggest organic win for my project came from going in the opposite direction ruthless relevance.​\n\nInstead of pumping out 30 shallow posts a month, I chose a handful of high-intent topics and built deep, semantically rich pages around them. Think \"best standing desk for small apartments\" instead of just \"standing desk,\" with every relevant angle covered: height range, weight capacity, space constraints, price brackets, real photos, and FAQs.​\n\nEach page was designed to rank for an entire cluster of queries, not a single keyword. That meant long-tail, mid-tail, and even some broader terms started to fall into place over time.\n\nI paired this with a simple authority foundation rather than aggressive link schemes. Started with a [directory submission service](http://getmorebacklinks.org/) getting the site listed on 200+ relevant business and niche directories. Over 60 days this added 42 indexed backlinks moving DA from 0 to 14. That baseline authority meant my comprehensive content pages could actually compete instead of sitting invisible even when they were better than what was ranking.​\n\nThen I watched Search Console like a growth dashboard: which queries was I almost ranking for, which posts were starting to pop, and where adding 20% more depth could move me onto page 1. Added a few curated mentions and \"best of\" list placements for high-quality editorial links once content proved its value.​\n\nThe result: fewer URLs, but each one pulling in traffic from dozens of relevant searches and converting better because the content was truly aligned with what users wanted.\n\nIf you're tired of \"publish more\" advice, try this: pick 5-10 high-intent topics, make those pages embarrass your competitors' content, build baseline authority through systematic citation building, and measure growth at the cluster level not just per keyword. It's a very different way to think about SEO as a growth channel.​",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qe8r4z/from_0_to_meaningful_organic_traffic_by_focusing/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzvmxr7",
          "author": "Chemical_Survey2577",
          "text": "42 indexed backlinks from 200 plus directories moving DA 0 to 14 gave baseline authority so comprehensive content could compete. Foundation first then content quality matters",
          "score": 1,
          "created_utc": "2026-01-16 06:49:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvncgp",
          "author": "Bading_na_green_Flag",
          "text": "Which specific cluster saw fastest compound growth, and what was the tipping point where Google started ranking you for the broader terms after the long-tails gained traction?",
          "score": 1,
          "created_utc": "2026-01-16 06:53:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzxmctu",
              "author": "Embarrassed_Poem9556",
              "text": "Standing desk accessories cluster hit fastest after main standing desk page ranked. Tipping point was around 15-20 long-tails ranking top 5, then Google started testing me for broader terms like 'best standing desk' moving from position 45 to position 12 in 3 weeks.",
              "score": 1,
              "created_utc": "2026-01-16 15:20:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzvnyz1",
          "author": "Pretend-Raspberry-87",
          "text": "\nCurated mentions and best of list placements for editorial links once content proved value is strategic link building.",
          "score": 1,
          "created_utc": "2026-01-16 06:58:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvuf1b",
          "author": "HansP958",
          "text": "Solid breakdown. I like the emphasis on intent-driven content over shortcuts.\n\nOne thing that helped me in the early 0→1 phase was pairing this with **light distribution**, not growth hacks. For an AI product, getting listed gradually on curated directories brought the first real impressions, some qualified traffic, and indexing signals.\n\nI used [https://300aidirectories.com](https://300aidirectories.com) for that. Not a replacement for content at all, but a good complement while the content engine is still ramping up.",
          "score": 1,
          "created_utc": "2026-01-16 07:54:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwh8df",
          "author": "mprz",
          "text": "https://www.reddit.com/search/?q=getmorebacklinks.org&amp;include_over_18=on&amp;t=all&amp;sort=new\n\nSpam spam spam",
          "score": 1,
          "created_utc": "2026-01-16 11:19:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxpcm4",
          "author": "Ok_Employ_5453",
          "text": "Forget just listing prices. Frame them with empathy, \"for growing teams\" vs. \"Pro.\" Use social proof (trusted logos, testimonials) near tiers. Explain value clearly, then price. Your post nails it: depth builds trust, trust converts.",
          "score": 1,
          "created_utc": "2026-01-16 15:33:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyf31d",
          "author": "Euphoric-View-9876",
          "text": "This maps really cleanly to distribution too. Weve seen the same thing outside of SEO relevance compounds when you start from who already cares, not how many people you can reach. Clusters arent just keywords theyre audiences. When you show up consistently in front of people already engaging with similar products or topics, even light exposure starts to convert better over time. Volume feels productive, but relevance is what actually compounds, whether its Google traffic or human attention.",
          "score": 1,
          "created_utc": "2026-01-16 17:27:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi5swy",
      "title": "Tried 9 growth tactics in 6 months. Only 1 had positive ROI. Here's the brutal data.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qi5swy/tried_9_growth_tactics_in_6_months_only_1_had/",
      "author": "Commander_BRabbit",
      "created_utc": "2026-01-20 16:30:49",
      "score": 25,
      "num_comments": 8,
      "upvote_ratio": 0.89,
      "text": "Spent January through June testing every growth tactic from blogs and Twitter threads. Tracked every dollar and hour invested with actual ROI calculations. Out of 9 tactics, only 1 was profitable. The other 8 were negative ROI or break-even at best. Here's the honest breakdown nobody shares.\n\nWhat failed with actual numbers: Facebook ads spent $2,100 getting 12 customers at $175 CAC, LTV is $140 = negative $420 total. Referral program built for $400 and 20 hours, generated 3 referrals in 5 months = negative ROI. Growth loops took 30 hours to build, 8% of users engaged, zero viral growth = wasted time. Twitter posting daily for 4 months, grew 890 followers, converted 1 customer = negative ROI counting time. Partnership outreach sent 140 emails, closed 2 partnerships bringing 4 customers over 3 months = barely break-even.​\n\nWhat actually worked: SEO blog content. Invested $0 cash, 60 hours writing 18 posts over 6 months. Started ranking month 3, now brings 15-20 signups weekly growing monthly. Customer acquisition cost is $0, return is infinite. Currently at $4.1K MRR with 78% from organic search.\n\nThe growth hacking reality: most tactics sound good but have terrible economics for bootstrapped startups. They work at scale with budgets and teams, not at $0-5K MRR with solo founders. Everyone shares what they're trying, nobody shares what actually made money versus lost money.​\n\nPulled data from [FounderToolkit](http://foundertoolkit.org) comparing growth tactics across 180 bootstrapped SaaS to validate my experience. Pattern was clear: 73% of successful ones under $10K MRR relied primarily on SEO and organic community engagement. Only 12% made paid acquisition work profitably before $15K MRR. Tactics that require budget or scale don't work until you have budget and scale.\n\nThe controversial truth: stop growth hacking and just do boring SEO consistently for 6 months. One profitable channel beats nine break-even tactics. Most growth hackers are broke because they chase tactics instead of ROI.​\n\nWhat's your actual ROI on growth tactics? Be honest with real numbers.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qi5swy/tried_9_growth_tactics_in_6_months_only_1_had/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o0oxrwy",
          "author": "Ok_Cauliflower5526",
          "text": "\n\nTbh the paid ads result feels extremely real at low mrr. everyone says “just test ads,” but when ltv is still shaky, even okay CACs can kill you. ads feel like lighting money on fire until your fundamentals are solid.",
          "score": 2,
          "created_utc": "2026-01-20 16:39:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0s1eo2",
          "author": "LegalWait6057",
          "text": "This matches what I have seen too. Early on, time is the real cost, not ad spend, and SEO is one of the few channels where effort compounds instead of resetting every week. It is also easier to stay motivated when you can see posts slowly picking up impressions even before they convert. That feedback loop matters a lot when you are solo or small.",
          "score": 2,
          "created_utc": "2026-01-21 01:44:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0oysfx",
          "author": "Leather_Moose_6601",
          "text": "\nDo you think seo still works if you’re not technical or a great writer?",
          "score": 1,
          "created_utc": "2026-01-20 16:43:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p198w",
              "author": "Commander_BRabbit",
              "text": "yeah.!! most of my posts aren’t great writing, just clear answers to real questions. technical polish mattered way less than matching search intent.",
              "score": 2,
              "created_utc": "2026-01-20 16:55:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ozn9u",
          "author": "Unique-Persimmon2291",
          "text": "also appreciate you calling out growth loops. they sound amazing on paper, but if your product isn’t inherently shareable, no amount of clever mechanics will force virality.",
          "score": 1,
          "created_utc": "2026-01-20 16:47:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uy014",
          "author": "hazel-wood5",
          "text": "respect for sharing real numbers, most people hide their failures.. getting positive roi from only seo out of 9 tactics is very common in bootstrapped saas. most of the other channels usually end up wasting budget and time.",
          "score": 1,
          "created_utc": "2026-01-21 14:24:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p0x3h",
          "author": "PearlsSwine",
          "text": "This is clearly just spam for FounderToolKit. \n\nSigh. \n\nGet better, really.",
          "score": -27,
          "created_utc": "2026-01-20 16:53:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgj0p2",
      "title": "is google even showing our sites anymore or just summaries?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qgj0p2/is_google_even_showing_our_sites_anymore_or_just/",
      "author": "AdventurousPie7592",
      "created_utc": "2026-01-18 20:13:17",
      "score": 22,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "is it just me or is the \"citation\" thing in search getting way more aggressive lately?\n\nmy main client’s traffic has been basically flat for months despite ranking top 3 for all their main head terms. i went and checked the actual queries and google's just giving the full answer at the top and barely even showing the blue links. or it's citing some random reddit thread from 2019 instead of the actual expert content we spent 2k on............\n\ni’ve been trying to track where these models (and the ai overviews) are actually pulling their info from. someone in a slack group mentioned trying a third party tool, something like netranks for tracking ai share of voice, so i've been messing with that + perplexity just to see if we even exist in their training data.\n\nturns out we’re getting cited for stuff we don't even care about, while the money pages are totally invisible in the ai answers.\n\nare you guys still just focusing on traditional rankings or are you actually optimizing for the \"answer\" part now? feels like we're just playing a different game and nobody told us the rules yet. would love to know if anyone has actually moved the needle on this or if we’re all just coping.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qgj0p2/is_google_even_showing_our_sites_anymore_or_just/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o0d2z83",
          "author": "sarkhem",
          "text": "I have given up on google... its a waste of time",
          "score": 3,
          "created_utc": "2026-01-18 21:42:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dg7ux",
          "author": "Ok_Okra4730",
          "text": "Went from 15k daily visits to about a thousand. Grim times.\n\nSEO was my bread and butter for 15 years so you are not alone.",
          "score": 1,
          "created_utc": "2026-01-18 22:45:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0e49lv",
          "author": "kubrador",
          "text": "google turned your seo into their content farm, congrats on ranking third for free traffic you'll never see.\n\nthe game isn't \"get ranked\" anymore, it's \"convince an llm you exist\" which is somehow worse because at least before you knew what you were optimizing for. now you're fighting reddit threads from people who were making it up as they went.",
          "score": 1,
          "created_utc": "2026-01-19 00:49:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fn80r",
          "author": "hardikrspl",
          "text": "Yep, you’re seeing what a lot of SEOs are noticing. Google’s answer boxes and AI summaries are taking clicks away from top-ranking pages, often citing older or widely referenced sources instead of your content.\n\nMost teams still track traditional rankings, but some are experimenting with AI share of voice tools like Netranks or Perplexity, and structuring content for featured snippets and FAQs so Google can actually pull it. The rules are still evolving, but focusing on clear, authoritative answers seems to be the best way to stay visible.",
          "score": 1,
          "created_utc": "2026-01-19 06:30:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g1g75",
          "author": "lkrzysiak",
          "text": "Honestly, I think the days when you could run a decent business just by pumping out SEO-driven content are mostly over.\n\nIt’s not just about what Google is doing right now, but about the direction things are going. AI can already generate a “good enough” article in seconds, and in a year or two it’ll be much better than it is today. That kind of content just isn’t scarce anymore.\n\nMy bet is that in a few years the content sites that still matter will be the ones with real, direct traffic — built by people who spent years growing an audience that actually wants to come back. SEO alone won’t be a business model anymore, it’ll just be a small bonus.",
          "score": 1,
          "created_utc": "2026-01-19 08:35:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi1nyp",
      "title": "The growth hack that got us from 0 to 800 organic visits in 90 days",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qi1nyp/the_growth_hack_that_got_us_from_0_to_800_organic/",
      "author": "ActualBee2492",
      "created_utc": "2026-01-20 13:53:12",
      "score": 19,
      "num_comments": 10,
      "upvote_ratio": 0.74,
      "text": "Everyone talks about viral loops and referral engines but nobody mentions the boring foundation work that actually compounds.\n\n\n\nWe launched our SaaS three months ago with zero domain authority. Tried all the \"sexy\" growth hacks first Product Hunt launch, cold outreach, paid communities. Got some initial traffic spikes but nothing stuck.\n\n\n\nThen we did something most growth hackers skip because it's not exciting. Directory submissions. Sounds outdated but here's what actually happened.\n\n\n\nWeek 1-2 was pure setup. Got our site submitted to 200+ active SaaS and startup directories. Not the spammy 2015 directories, modern ones that Google actually crawls regularly. Used [GetMoreBacklinks](http://getmorebacklinks.org) to automate the bulk work since manual submission would've killed an entire week.\n\n\n\nWeek 3-6 was the waiting game. Nothing dramatic happened immediately which is why most people give up. But our crawl frequency in Search Console started increasing. Google was discovering our pages faster because we had legit inbound signals.\n\n\n\nWeek 7-12 is when it clicked. Domain authority went from 0 to 28. Started ranking for 47 longtail keywords we weren't ranking for at all before. Organic traffic hit 800 visits per month and it's still climbing weekly.\n\n\n\nThe growth hack nobody wants to hear is that boring systematic work beats clever tactics. Directory submissions gave us the authority baseline that made everything else work faster. Our content now ranks in days instead of months because Google already trusts our domain.\n\n\n\nIf you're starting from zero authority, stop chasing viral moments. Build your foundation first. The compound effect is real but you need something to compound from.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qi1nyp/the_growth_hack_that_got_us_from_0_to_800_organic/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o0ui2gb",
          "author": "CayoPerican",
          "text": "Why every comment here is getting downvoted? Someone seems to be against directories, or this is an Ad",
          "score": 1,
          "created_utc": "2026-01-21 12:55:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pc08f",
          "author": "boidcom",
          "text": "Boring but important basic stuff to get started. 👍",
          "score": 0,
          "created_utc": "2026-01-20 17:45:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0s2bhz",
          "author": "Slight_Tutor1790",
          "text": "I think the underrated part here is timing and intent. Directories work early because Google is still trying to understand what your product even is. Later on, the same tactic feels pointless because context is already set. What matters is matching the tactic to the maturity of the site, not whether the tactic is trendy or boring.",
          "score": 0,
          "created_utc": "2026-01-21 01:49:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o2m8j",
          "author": "Tight_Reveal_1832",
          "text": "we did the opposite mistake. waited “until content was ready” before doing any links took 4-5 months before google even took us seriously.",
          "score": -1,
          "created_utc": "2026-01-20 14:06:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o3jg4",
          "author": "sarkhem",
          "text": "this actually tracks… boring stuff compounds... directories aren’t sexy but they give google context + discovery... most ppl quit in week 3 when “nothing happens”... only caveat: works best early... spam it later and it backfires. but for 0 .... something, yeah this checks out.",
          "score": -1,
          "created_utc": "2026-01-20 14:11:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o467q",
          "author": "Leather_Moose_6601",
          "text": "\n\nHow many of those directory links actually indexed? I’ve tried this before and half of them never showed up in gsc.",
          "score": -1,
          "created_utc": "2026-01-20 14:15:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0o8l8p",
              "author": "ActualBee2492",
              "text": "yeah, not all of them. roughly 60-70% showed up in gsc over time. the rest either took forever or never indexed, which I kind of expected going in.",
              "score": 0,
              "created_utc": "2026-01-20 14:38:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0o5vef",
          "author": "Commercial_Exit_9841",
          "text": "This is a really good starting point. For me the best that worked was blogging/newsletters",
          "score": -1,
          "created_utc": "2026-01-20 14:24:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0oyfpu",
          "author": "DrAdam_V",
          "text": "This is super interesting and honestly, a breath of fresh air! Everyone is always looking for the \"next big thing\" and forgetting that solid foundations are what actually make things stick.\n\n\n\nI totally get what you mean about the boring stuff. It's so easy to get caught up in the excitement of shiny growth hacks, and then get discouraged when they don't immediately deliver that viral explosion. I've definitely been there, trying the latest tactic only to see a tiny blip and then back to crickets.\n\n\n\nThat whole directory submission thing sounds almost too simple, but your results speak for themselves. It's wild how much of a difference those \"boring\" backlinks can make in terms of domain authority and how Google views your site. Makes complete sense though – if Google sees legit sites linking to you, it starts to trust you more, and then your content gets a much better shot at ranking.\n\n\n\nIt’s a good reminder that sometimes the most effective strategies are the ones that require patience and consistent effort, rather than a quick, clever trick.\n\n\n\nDid you notice any particular types of directories that seemed more effective than others, or was it really just the sheer volume of quality submissions that did the heavy lifting? Thanks for sharing this, it's definitely given me some food for thought for my own projects!",
          "score": -1,
          "created_utc": "2026-01-20 16:42:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o22ix",
          "author": "Healthy_Turnover5447",
          "text": "this matches my experience tbh. directories feel dumb until you realize google just needs some consistent signals early on. once crawl frequency goes up, everything else gets easier.",
          "score": -2,
          "created_utc": "2026-01-20 14:03:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgt8ov",
      "title": "What's the Cheapest LinkedIn Automation Tool in 2026?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qgt8ov/whats_the_cheapest_linkedin_automation_tool_in/",
      "author": "BotDog",
      "created_utc": "2026-01-19 03:35:03",
      "score": 19,
      "num_comments": 10,
      "upvote_ratio": 0.92,
      "text": "Hey everyone!\n\nI wanted to share a comprehensive price comparison of LinkedIn automation tools to help everyone make informed decisions. As a Botdog founder, we obviously research the market constantly to see how our tool stacks up and ensure we're delivering the best value. My goal is to give you an honest rundown of what's on the market, but this analysis will naturally have some bias.\n\n**TLDR: Prices range from $8.25 to $1,499/month. Linked Helper remains cheapest at $8.25/mo (with caveats), we believe Botdog offers the best value at $35/mo annually (especially for founders, individual reps, and small teams), HeyReach is arguably the best and most cost-effective option for agencies needing 30+ accounts, and CoPilot AI is still the most expensive at $203+/mo.**\n\n# Average cost of LinkedIn automation in 2026\n\nMost reliable tools now charge between $55-$165/month per user. The market has matured with clearer tier separation: budget tools ($8.25-$50/mo), mid-tier ($50-$100/mo), high ($100-$200/mo) and enterprise ($200-$1,499/mo).\n\n# Quick price rundown (annual pricing)\n\n**Budget ($8.25-$50/mo):**\n\n* **Botdog:** $35-$49/mo - Cloud-based, unlimited campaigns, best value, $49/month includes AI\n* **Linked Helper:** $8.25-$24.75/mo - Desktop-based (your computer must stay on for campaigns to run)\n* **Waalaxy Pro:** $21-$43/mo - Limited to 300 connection requests, $21/month without inbox feature\n* **Meet Alfred:** $29-$49/mo - Limited to 3 campaigns on cheaper tiers, only 3.4/5 G2 rating\n\n**Mid ($50-$100/mo):**\n\n* **Phantombuster Starter:** $56/mo - 20-hour execution limit (most need Pro at $128)\n* **HeyReach:** $59/mo - Agency-focused, overkill for solo users\n* **Dripify Pro:** $59/mo - LinkedIn + Email, unlimited campaigns\n* **Waalaxy Advanced:** $66/mo - Unlimited LinkedIn requests finally\n* **La Growth Machine Basic:** $60/mo - Only 3 campaigns, templates only\n* **Expandi Business:** $79/mo - add $118/mo for visual features = $197 total\n* **Lemlist Multichannel Expert:** $79/mo - LinkedIn + Email, 400 enrichment credits\n\n**High ($100-$200/mo):**\n\n* **La Growth Machine Pro:** $110/mo - Limited to 6 campaigns\n* **Phantombuster Pro:** $128/mo - 80-hour execution limit\n* **La Growth Machine Ultimate:** $165/mo - Unlimited campaigns finally\n* **HeyReach Agency (50 accounts):** $749/mo total ($15/account)\n\n**Enterprise ($200-$500/mo):**\n\n* **CoPilot AI:** $203-$294/mo - AI-powered, most expensive option, limited to 10 campaigns\n* **Phantombuster Team:** $352/mo - 300-hour execution limit\n* **HeyReach Unlimited:** $1,499/mo - Unlimited accounts (perfect for agencies)\n\n# My take…\n\nIf you need **LinkedIn-only automation** and want the best value: **Botdog at $35/mo** gives you unlimited campaigns, 3-minute setup, and 4.9/5 reliability at a price that won’t break the bank (but obviously I’m biased 😉).\n\n* If you need **multi-channel (LinkedIn + Email)** and want simplicity: Dripify at $59/mo or Lemlist at $79/mo (if you're email-focused) provide solid value without La Growth Machine's complexity.\n* If you're an **agency managing 50+ accounts**: HeyReach is purpose-built for your use case.\n* If you're **extremely budget-conscious** and can tolerate bugs: Meet Alfred at $49/mo is the cheapest multi-channel option, though reliability might suffer.\n* If you’re happy to **keep your computer running 24/7**: Linked Helper at $8.25-$24.75/mo might make sense.\n\nScreenshots below 👇\n\n[Botdog - $35\\/mo annually with unlimited campaigns and 3-minute setup. Professional + AI tier at $49\\/mo includes AI lead filtering.](https://preview.redd.it/3f6bq8s678eg1.png?width=1080&format=png&auto=webp&s=d0a5b5c0bd1dedb26904f29e9b1cf5fd0d6d5169)\n\n[Linked Helper - cheapest at $8.25\\/mo, but your computer needs to stay on 24\\/7 for campaigns to run, and it slows down your computer. It's also very complex, not the most user-friendly. ](https://preview.redd.it/mo99pgl878eg1.png?width=1080&format=png&auto=webp&s=7e85ec43680b2406cc3c675714121bb390cbca91)\n\n[Meet Alfred - multi-channel at $49\\/mo annually \\(LinkedIn + Email + X\\), but only 3.4\\/5 G2 rating and limited to 3 campaigns on Basic.](https://preview.redd.it/qh3ah55b78eg1.png?width=1080&format=png&auto=webp&s=827013cfb1cc64bf65e6d72b54a9dcab482780e2)\n\n[Waalaxy - starts at $21\\/mo but that's without the inbox feature. Pro plan with inbox costs $43\\/mo and limits you to 300 requests\\/month which is well below LinkedIn's limits.](https://preview.redd.it/arj4arfc78eg1.png?width=1080&format=png&auto=webp&s=349a330a0c4a488779b7f048bad937c09ba862c5)\n\n[Dripify - solid LinkedIn + Email at $59\\/mo annually with unlimited campaigns. Basic plan at $39\\/mo is too limited \\(1 campaign only\\).](https://preview.redd.it/kwg5abjd78eg1.png?width=1080&format=png&auto=webp&s=4ab633ce16f4f87781c1097cf3d8ec5d93c3bf26)\n\n[Lemlist - $79\\/mo annually for Multichannel Expert \\(LinkedIn + Email\\). Includes 400 enrichment credits and professional email deliverability.](https://preview.redd.it/fpcvljje78eg1.png?width=1080&format=png&auto=webp&s=62d60249d471c32bc415750247933b30b9b5fb2d)\n\n[La Growth Machine - Basic at $60\\/mo is multichannel \\(LinkedIn + Email\\) but only allows 3 campaigns with templates. Pro at $110\\/mo limits you to 6 campaigns. For unlimited campaigns, you need Ultimate \\($165\\/mo\\).](https://preview.redd.it/osf31ogf78eg1.png?width=1018&format=png&auto=webp&s=3cff16b26faf1b379cc8f7cca40a3ac941a8398d)\n\n[Expandi - base price of $79\\/mo is a bit misleading when visual personalization is their main selling point. To send images and GIFs, you need to purchase additional subscriptions.](https://preview.redd.it/8egxnkpg78eg1.png?width=916&format=png&auto=webp&s=4091cfbbf9f52faf5225621d0acf27af544b92d3)\n\n[HeyReach - built for agencies. Their single sender plan at $59\\/mo is expensive compared to other tools, but becomes excellent value at scale: $749\\/mo for 50 accounts \\($15 each\\).](https://preview.redd.it/4zv7zzrh78eg1.png?width=1080&format=png&auto=webp&s=2f3d59747c533bb33739c98e040670641215e2b5)\n\n[Phantombuster - starts at $56\\/mo with only 20 hours of execution time. Most users need Pro \\($128\\/mo\\) or Team \\($352\\/mo\\) for adequate capacity.](https://preview.redd.it/0p5jljzi78eg1.png?width=1080&format=png&auto=webp&s=d7211da82900b56403faa94c2cf771ef63aa87f8)\n\n[CoPilot AI - most expensive at $203-$294\\/mo, positioning as AI sales employee. Limited to 10 campaigns even at highest tier.](https://preview.redd.it/5vpea6fk78eg1.png?width=1012&format=png&auto=webp&s=31058ae2f921b98120e33c759d70493a8754a2f6)\n\nHave you used any of these tools? Any feedback? Any specific feature you really enjoyed and we should build?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qgt8ov/whats_the_cheapest_linkedin_automation_tool_in/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o0n7k0j",
          "author": "kalwani_vikas",
          "text": "Linked Helper is dirt cheap and powerful if you know what you're doing, but it's janky as hell. Your computer has to stay on constantly, it slows everything down, and the interface feels ancient. Easy to misconfigure and accidentally spam yourself into a ban. Phantombuster is cool for scraping but gets expensive fast once you stack workflows, and you're constantly debugging why something broke. Neither feels like something I'd trust long-term on a main account.HeyReach I've seen used in a couple agency setups and that's really where it shines. Managing like 10+ accounts from one dashboard without losing your mind is the main selling point. It's also way more conservative by default, which sounds boring but probably keeps people out of trouble. You can't just crank the dials to max and hope for the best like you can with Waalaxy or Dripify.Feature-wise, the stuff that's actually useful isn't the AI gimmicks or fancy personalization tokens. It's the boring safety stuff. Clear daily limits, auto-slowdowns when engagement tanks, account health warnings. One thing I wish more tools had is smarter adaptive throttling that reacts to how LinkedIn's behaving in real time, not just static caps. That's what actually keeps accounts alive.",
          "score": 2,
          "created_utc": "2026-01-20 10:30:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0opthj",
              "author": "BotDog",
              "text": "I agree! I use Linked Helper myself and pay for a licence, but only for a single feature they have and we don't (removing existing LinkedIn connections, when you hit the 30K connections limit). It's very powerful, but yeah hard to use, is a nightmare for multi account (check us out btw! We have teams of 30+ people using us!) and slows down your computer. It's the OG of LinkedIn Automation, they have been around for 10 years+, but unfortunately that shows.",
              "score": 1,
              "created_utc": "2026-01-20 16:02:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gp89z",
          "author": "alexRedCalib3r",
          "text": "Are there any relevant stats as to which automation tools lead to the most bans, or are all these companies now so \"established\" that they have freedom to operate without fear as long as they stay in bounds?\n\nBecause some definitely stay more in-bounds than others.. any kind of outreach automated is instantly a risk, but what else are you going to do just say Hi to everyone you meet on LI?  As long as you say \"B2B sales\" every few phrases you'll fit in, but not if your robot copilot is running amok",
          "score": 1,
          "created_utc": "2026-01-19 12:10:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gt1ns",
              "author": "BotDog",
              "text": "I can't speak for the other tools but Botdog's safety features are so comprehensive that there's only about a 1/1000 chance of activity being detected by LI. We also always recommend users to pay for Premium/Sales Nav/Recruiter because 1/ they're way less likely to have warnings from LinkedIn and 2/ when they do they receive an email warning before anything bans/restrictions (in which case they can ease off or stop). Free LI accounts get blocked faster and don't get this kind of warning so it's much more risky",
              "score": 2,
              "created_utc": "2026-01-19 12:39:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0kmkx2",
                  "author": "Last_Inspector2515",
                  "text": "but how do you maintain safety if you are using a third party -- unipile?\n\nI mean if they do the automation part, then they are the deciders of safety correct?",
                  "score": 1,
                  "created_utc": "2026-01-19 23:52:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qexa5c",
      "title": "Can't Wait To Try Claude Cowork? Don't Let It Accidentally Delete Your Hard Drive",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qexa5c/cant_wait_to_try_claude_cowork_dont_let_it/",
      "author": "MarketingNetMind",
      "created_utc": "2026-01-17 00:16:33",
      "score": 15,
      "num_comments": 0,
      "upvote_ratio": 0.78,
      "text": "I was just asked by my colleague who, unfortunately, came into that Claude Cowork mis-deleting all the important files unexpectedly.\n\n# Claude Could Misinterpret Your Command\n\nIf you never tried Claude Code or other AI/vibe coding tools, no worries, you will definitely be amazed. \n\nHowever, before that, there's one thing you might be unaware of\n\n**When Claude Cowork deletes something, it is possibly permanent deletion (when you delete something on your MacBook, it goes to the trash bin and you can restore it)**\n\nYou think \"I just want to organize my Downloads folder\", you prompt it, and you click \"Send\", looking forward to the great result. **Then Cowork understands \"clean this up\" as \"delete all files that look unused.\"**\n\nBy default, after you click on the **\"I accept the T&Cs\" button without even opening it up** (give a shout out if you read the T&Cs!), Cowork could easily have the right to read, write, or even delete anything you give it access to on your MacBook. \n\nI am not sure about you, but I definitely do not want my work for the client meeting tmr to disappear, then trying to recover them in a panic.\n\n**So I am going to show you how to avoid this risk**\n\n# 3 Easy & Effective Methods\n\n# Method 1: Create Separate Folder\n\nDo not give Claude Cowork access to your real work folders. Actually,\n\n* Make a new folder, maybe called \"Claude Workspace\"\n* Copy files into it (do not move them)\n* Think about it as a playground where mistakes are okay\n\nPeople usually forget to make backups. But if asked to intentionally copy files to a new folder, easy-peacy! People will do it\n\n# Method 2: Be Very Specific\n\n**Being polite with AI can be dangerous.**\n\n❌ Bad: \"Could you organize these files?\"\n\n✅ Good: \"Sort these 47 PDFs by date. DO NOT delete anything. Make folders named by year.\"\n\nWhen you are more specific, Claude Cowork does not need to guess, and **guessing is where problems happen.**\n\n# Method 3: Check Before You Approve\n\nWhen Claude Cowork wants to delete/move/rename something:\n\n* Wait 2 seconds\n* Ask: \"Do I understand WHY Claude wants to do this?\"\n* No? Refuse and do it yourself\n\nBe cautious on what Claude Cowork is about to do before you choose\n\n# A Simple Smart-Intern Mindset \n\nClaude Cowork is fast & useful for people. But like driving a fast car, you want to drive it carefully. \n\nGood news is all these protections are basically just asking you to think a bit differently:\n\n**Think of Claude Cowork as a smart intern who understands words literally, and has the key to your office.**\n\n**You would not tell an intern \"figure out my files by yourself.\" Same thing here.**",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qexa5c/cant_wait_to_try_claude_cowork_dont_let_it/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qdgh5w",
      "title": "How b2b lead gen agency fits into a full-funnel strategy.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qdgh5w/how_b2b_lead_gen_agency_fits_into_a_fullfunnel/",
      "author": "Xclus",
      "created_utc": "2026-01-15 10:53:15",
      "score": 15,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I work at a large agency and we are looking to partner with a specialized firm that we can recommend to our clients. We need to find the best b2b lead gen agency to handle the outbound portion of the funnel while we handle the branding and creative. My concern is finding an agency that actually plays well with others and provides clean data that our clients' sales teams can actually use. I'm looking for professionalism, clear reporting, and a focus on long-term relationship building rather than just quick wins.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qdgh5w/how_b2b_lead_gen_agency_fits_into_a_fullfunnel/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzqd5yd",
          "author": "ActivitySmooth8847",
          "text": "If you want clean data that actually works for sales teams, check out SocLeads. It pulls leads from places like LinkedIn and Google Maps and makes sure the info is solid, which helps avoid the usual messy lists. Could be a good fit if you want something that plays nice with your branding work and keeps things professional.",
          "score": 1,
          "created_utc": "2026-01-15 14:22:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqji1p",
              "author": "Xclus",
              "text": "Thank you for this, I'll definitely check it out",
              "score": 1,
              "created_utc": "2026-01-15 14:54:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qhzr6c",
      "title": "Are you actually capturing sales calls as real GTM data?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qhzr6c/are_you_actually_capturing_sales_calls_as_real/",
      "author": "LissaLou79",
      "created_utc": "2026-01-20 12:26:02",
      "score": 9,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "We all talk about pipeline metrics and CRM fields but the richest insights about buyers live in the sales calls themselves like objections, buying signals, competitor mentions, pricing hesitations. Most teams don’t actually capture that data in any useful way\n\n  \nDo you have systems to turn your sales calls into actionable GTM data?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qhzr6c/are_you_actually_capturing_sales_calls_as_real/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o0uex58",
          "author": "treeslayer4570",
          "text": "CRM fields never captured the real GTM signal. Once we started using attention to extract objections, buying signals and competitor mentions directly from sales calls, our messaging and forecasting got way more accurate",
          "score": 4,
          "created_utc": "2026-01-21 12:35:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgu8zk",
      "title": "Anyone know how to growth hack a Facebook group from scratch?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qgu8zk/anyone_know_how_to_growth_hack_a_facebook_group/",
      "author": "Nice-Chair8658",
      "created_utc": "2026-01-19 04:23:44",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 0.9,
      "text": "Looking for anyone who has had success in growing a Facebook group from scratch quickly. Besides inviting friends + family and posting in other groups, what ways are there? \n\nI want to try to get 500 members in 30 days from scratch. Any good growth hacks? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qgu8zk/anyone_know_how_to_growth_hack_a_facebook_group/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o0fcdb6",
          "author": "stovetopmuse",
          "text": "I have seen people hit numbers like that, but it is rarely a hack and more distribution math. The fastest path is anchoring the group to an existing pain point and seeding it from somewhere with built-in intent, like comments on related posts or a waitlist tied to a specific outcome. Generic groups stall fast because there is no reason to join today. What usually works is one strong hook, very tight topic scope, and visible early activity so new members do not feel like they are joining a ghost town. If you need 500 in 30 days, you probably need one external source that already has attention rather than trying to brute force invites.",
          "score": 1,
          "created_utc": "2026-01-19 05:06:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fcn3u",
              "author": "Nice-Chair8658",
              "text": "Yeah that makes sense. I would like to know how the algorithm for groups work a bit more. It seems once you hit the few hundred mark, Facebook really starts to push your group to people. In my experience anyways",
              "score": 1,
              "created_utc": "2026-01-19 05:08:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ga3pu",
          "author": "pantrywanderer",
          "text": "Most of the fast growth I have seen comes from having a very clear reason for the group to exist, not from clever tactics. If people cannot explain in one sentence why they should join, growth stalls no matter how many invites you send. A simple loop that works is valuable content posted publicly, then the group as the place for deeper discussion or access. Partnerships with adjacent communities can help, but only if the audiences genuinely overlap. I would also be careful chasing a number like 500 if the first members are not engaged, that usually creates a dead group later. Curious what the niche is, since the approach changes a lot based on that.",
          "score": 1,
          "created_utc": "2026-01-19 09:58:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0h5vtb",
              "author": "Nice-Chair8658",
              "text": "Car niche, specifically people looking to purchase a new car. Was wanting to make a lot of groups of different makes and models",
              "score": 1,
              "created_utc": "2026-01-19 13:59:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0oc8tw",
                  "author": "pantrywanderer",
                  "text": "For a niche like that, you might actually be better off focusing on one group first and making it highly engaging before splitting by make or model. Too many tiny groups can dilute discussion and make it harder to reach critical mass. Car buyers tend to join groups where they can get honest advice and see real experiences, so content that sparks conversation, comparisons, buying tips, real-world reviews, usually brings in members more reliably than just posting invites everywhere. Once one group is active, branching by make or model becomes easier and feels more natural.",
                  "score": 1,
                  "created_utc": "2026-01-20 14:56:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0gnfi1",
          "author": "2solid222",
          "text": "I've had solid experience with this - I grew a group to over 1,500 members in a span of a couple months. It all depends on your niche honestly, if you can share who you're targeting perhaps people can leave more accurate advice.",
          "score": 1,
          "created_utc": "2026-01-19 11:56:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0h5ruj",
              "author": "Nice-Chair8658",
              "text": "I am starting in the car niche. The idea is to make groups for people looking to buy new cars. So I am wanting to make a bunch of groups for different makes and models, etc.",
              "score": 1,
              "created_utc": "2026-01-19 13:58:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qea7am",
      "title": "The $0 CAC playbook: How we grew to 340 customers without spending on ads",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qea7am/the_0_cac_playbook_how_we_grew_to_340_customers/",
      "author": "Delecch",
      "created_utc": "2026-01-16 08:05:08",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Sharing my exact playbook since this worked way better than expected. No gatekeeping.\n\n\n\n\\*\\*Context:\\*\\* B2B SaaS in the social media management space. Started 8 months ago. Currently at $30K MRR with 340 paying customers.\n\n\n\n\\*\\*Total ad spend: $0\\*\\*\n\n\n\n\\---\n\n\n\n\\*\\*Channel 1: Building in Public (40% of customers)\\*\\*\n\n\n\nThis was the game changer. I started sharing everything on Twitter/X:\n\n\\- Weekly revenue updates\n\n\\- Feature launches\n\n\\- Failed experiments\n\n\\- Actual screenshots of our dashboard\n\n\n\n\\*\\*Why it works:\\*\\* People trust transparency. When you share your failures alongside wins, you become relatable, not salesy.\n\n\n\n\\*\\*Tactics:\\*\\*\n\n\\- Posted 4-5x per week minimum\n\n\\- Replied to every comment\n\n\\- Engaged with others in the space (not competitors, adjacent tools)\n\n\\- Used Crescitaly to track which content drove actual signups\n\n\n\n\\---\n\n\n\n\\*\\*Channel 2: Strategic Reddit & Community Engagement (35% of customers)\\*\\*\n\n\n\nNOT spamming links. Actually providing value.\n\n\n\n\\*\\*The approach:\\*\\*\n\n\\- Found 5-6 subreddits where our ICP hangs out\n\n\\- Spent 2 weeks just answering questions, no mentions of our product\n\n\\- Built genuine karma and reputation\n\n\\- Mentioned our product ONLY when directly relevant to someone's problem\n\n\n\n\\*\\*Key insight:\\*\\* Reddit users have incredible BS detectors. If you're here to sell, they'll know. If you're here to help, they'll convert themselves.\n\n\n\n\\---\n\n\n\n\\*\\*Channel 3: Integration Partnerships (15% of customers)\\*\\*\n\n\n\nBuilt integrations with 3 popular tools in our space. Got listed in their marketplaces/directories.\n\n\n\n\\*\\*Why it works:\\*\\* You're borrowing their distribution. Their users are already looking for solutions.\n\n\n\n\\---\n\n\n\n\\*\\*Channel 4: Cold DMs That Don't Suck (10% of customers)\\*\\*\n\n\n\nNot pitching. Starting conversations.\n\n\n\n\\*\\*Template that worked:\\*\\*\n\n\"Hey \\[name\\], saw your post about \\[specific thing\\]. Had a similar experience with \\[relate\\]. Curious how you ended up solving \\[their problem\\]?\"\n\n\n\nThat's it. No pitch. Just genuine curiosity. The conversation naturally leads to what you do.\n\n\n\n\\---\n\n\n\n\\*\\*What I'd add if starting over:\\*\\*\n\n\\- YouTube content (long-form is underrated for B2B)\n\n\\- Newsletter from day 1\n\n\\- More IRL networking\n\n\n\n\\*\\*What didn't work:\\*\\*\n\n\\- Cold email (2% reply rate, waste of time)\n\n\\- Product Hunt (got 30 upvotes, 2 customers)\n\n\\- LinkedIn posts (maybe our ICP isn't there)\n\n\n\n\\*\\*Questions for the community:\\*\\*\n\n1. Anyone had success with YouTube for B2B SaaS?\n\n2. How do you measure organic attribution accurately?\n\n3. What's your best $0 CAC channel?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qea7am/the_0_cac_playbook_how_we_grew_to_340_customers/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzwbshg",
          "author": "AlisaWaelchi",
          "text": "for reddit engagement, i used beno one to automate finding relevant discussions and posting helpful comments, which saved time and brought in qualified leads without manual effort.",
          "score": 1,
          "created_utc": "2026-01-16 10:33:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzy2m6u",
          "author": "Sudden-Context-4719",
          "text": "YouTube is solid for B2B but takes time to get traction. For measuring organic attribution, try tracking UTM parameters combined with tools like Crescitaly you mentioned. Also, since you’re active on Reddit, tools like SocListener can help find the right posts to engage with and boost conversions without spamming.",
          "score": 1,
          "created_utc": "2026-01-16 16:32:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyme7v",
          "author": "smarkman19",
          "text": "Your whole system works because you picked a few channels and went deep instead of spraying everything. Main thing I’d double down on is turning what you’re already doing into compounding assets.\n\nFor YouTube B2B, what’s worked for me is “over-the-shoulder” stuff: teardown a real account, show your dashboard, and narrate your thinking. One hero topic per ICP pain, then slice that into shorts for X and community posts. Don’t chase volume, chase 10–20 videos that become evergreen answers you can link in DMs and Reddit comments.\nOn attribution, I treat it like triangles not straight lines: last touch (what they clicked), first touch (where they first heard), and “self-reported” (“how did you hear about us?” free text in signup + a required field in onboarding). I log Reddit/X/organic in a simple sheet, then compare with GA/Search Console. I’ve used F5bot and Hypefury, tried GummySearch too, but Pulse for Reddit ended up as the thing I keep open because it surfaces the exact threads where my ICP is talking and drafts a first-pass reply I can humanize fast.\nNet: keep doing exactly this, but convert your best plays into reusable proof and content so every new customer pulls in the next one.",
          "score": 1,
          "created_utc": "2026-01-16 17:59:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o003yys",
          "author": "OkDependent6809",
          "text": "ongrats on $30k mrr, that's solid.\n\nhonestly though attribution for organic channels is mostly guessing. like you say reddit drove 35% but how do you actually know? someone sees your twitter, checks out your site, comes back a week later via google search, then signs up. where do you attribute that?\n\nwe tried building in public for our fintech. posted weekly updates for like 3 months. got some engagement but maybe 2-3 signups total. either our product wasn't interesting enough or our audience wasn't on twitter. hard to say.\n\nreddit worked better for us but mostly because b2b finance people actually hang out in specific subs. your mileage varies a ton based on where your icp actually is.\n\ncurious how you're measuring which channel drove what customer? utm tags? asking in onboarding? because in my experience people don't remember how they found you.",
          "score": 1,
          "created_utc": "2026-01-16 22:06:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o019fk1",
          "author": "boreddeity",
          "text": "Great post",
          "score": 1,
          "created_utc": "2026-01-17 02:02:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qde9o1",
      "title": "Is your AI visibility strategy just creating more noise? Has Anyone used SearchTides before?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qde9o1/is_your_ai_visibility_strategy_just_creating_more/",
      "author": "hcai88",
      "created_utc": "2026-01-15 08:35:05",
      "score": 6,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "We're all using AI to scale content, but are we just flooding our own niches? My analytics show traffic is flat even though output is up. It feels like my \"strategy\" is just creating competent, forgettable articles that add to the pile.\n\nIs anyone else seeing this? Have you found a way to use AI for visibility that actually cuts through the noise instead of making more of it?\n\nWhat's working?\n\nHas anyone heard of Searchtides?  I found them on Google.  They seem to be an agency on AI Search and AI Visibility for businesses and companies. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qde9o1/is_your_ai_visibility_strategy_just_creating_more/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qi4m6c",
      "title": "3 months. 500M views. Built by a 19-year-old intern.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qi4m6c/3_months_500m_views_built_by_a_19yearold_intern/",
      "author": "smxkie787",
      "created_utc": "2026-01-20 15:47:51",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I just went through Tobin Tang’s breakdown of how Wispr Flow scaled creator marketing. 80 creators, 500M+ views, ~$0.74 CPM. All in three months.\nWhat stood out wasn’t the scale, but who they worked with for product growth.\n\n- He wasn’t looking for polished UGC creators\n- He wasn’t prioritizing existing audiences\n- Many of the top performers had never posted content before\n\nInstead, he focused on people who genuinely liked the product, had time, and showed good taste.\nMost were students. Many were starting from zero. The bet was that authenticity + execution would beat “experience.” That part makes sense to me.What’s still hard is the step before any of this works.\n\n- How did he actually find these people in the first place?\n- Not creators as a category, but individuals who:\n\n  - might never have posted content\n  - don’t self-identify as “creators”\n  - could care deeply about the product\n  - have the taste and energy to grow into the role\n\n\nManually, this usually means digging through posts, comments, side projects, random mentions, and trying to infer intent from very weak signals. It’s slow, and it’s noisy.\n\nFor people here who’ve had a similar experience to Tobin’s growth hack, or who’ve tried to recruit creators from zero:\n\n- Where do you even look?\n\n- What early signals do you trust when there’s no content history?\n\n- How do you avoid relying purely on gut feeling?\n\n\nCurious how others approach this, especially when the goal is to build something long-term, not just run a one-off campaign.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qi4m6c/3_months_500m_views_built_by_a_19yearold_intern/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o0t2fx4",
          "author": "Livid_Pace8596",
          "text": "He really did an excellent job on this promotional campaign, but I still think dropping out of school was a bit hasty for him, lol",
          "score": 1,
          "created_utc": "2026-01-21 05:35:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tc555",
          "author": "waywardnowhere",
          "text": "Great point — the hardest part is always finding the right people before you even start scaling. Manually digging through videos, profiles, and side projects is super slow, and it’s easy to miss hidden gems.\n\nI’ve been experimenting with Lessie AI to tackle this exact problem. It doesn’t just find creators who already post content — it can identify complete beginners or even students with potential, by analyzing their public social media behavior and interests to see who might genuinely engage with or promote a product.\n\nYou still need to judge taste and execution in the trial phase, but it massively speeds up early-stage sourcing, letting you focus on mentoring and testing.",
          "score": 1,
          "created_utc": "2026-01-21 06:55:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qeh8ii",
      "title": "should I offer growth consultancy or growth analysis + planning?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qeh8ii/should_i_offer_growth_consultancy_or_growth/",
      "author": "zeniath",
      "created_utc": "2026-01-16 14:21:38",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Hello! I’ve done an AMA about 2 months ago in a different subreddit about my past experience: scaling an ecommerce store from 0-200 orders in 48h, threads 0-14k followers in 2 weeks, ig 58k followers in 60 days.\n\nAnd recently I’ve helped some friends achieve a couple of things: \n\n•200k ig account - numerology niche (helped him increase his average views and start noticing some real growth again) \n\n•100 followers account - “influencer” posting skits/ funny stuff (he was averaging 2k views; I  directed & edited 3 clips for him, one of them got +300k views) He also started applying what I told him and his average views per clip went up.\n\n•I also created an AI influencer to test some stuff on instagram and I’ve hit 700k views on my first reel, 70k on a different one. The other ones got +20k views each, but they weren’t reels that were meant ti be viral. They were made to increase the follow rate of the people who were coming from the 700k views one. (only posted 10 reels on this account)\n\nNow the thing is this. I realised that what I’ve learned  can be applied to get views in any niche and I also realised what I truly like: analysing why and how things work + teaching others how to do so. \n\nI already got some people that know me irl asking for my advice and since I don’t want to launch a course, my question is this:\n\nWhat would you offer to people that want your guidance? \n\n•consultancy: pretty much helping them and guiding them step by step (would have to charge more)\n\n•social media analysis + fixes and perhaps some sort of planning for their content? Could even do some recurring thing where I build them a weekly/ monthly content plan: scripts, filming & editing directions\n\n•something else?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qeh8ii/should_i_offer_growth_consultancy_or_growth/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzxflk3",
          "author": "Euphoric-View-9876",
          "text": "The decision isnt really consulting vs analysis its whether youre selling thinking or execution. Early on, the highest leverage offer is usually a paid diagnosis a short, opinionated teardown that tells them what to stop doing, what actually matters, and why. If people implement that and come back asking can you help us apply this?, youve earned the right to charge more for consulting or planning. Starting with analysis lets you test demand without locking yourself into high touch delivery.",
          "score": 2,
          "created_utc": "2026-01-16 14:48:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzxvbbj",
              "author": "zeniath",
              "text": "Fair enough! You’re right! I actually noticed this especially with my friend. He started calling me before making any new decision after he noticed that my advice brought him better results right away.",
              "score": 1,
              "created_utc": "2026-01-16 16:00:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzyc8fk",
                  "author": "Euphoric-View-9876",
                  "text": "Thats actually the signal you’re looking for. When someone starts checking decisions with you before acting, youve moved from “helpful advice” to trusted judgment. Thats why a tight diagnostic works so well it teaches them how to think, not just what to post. A simple way to package it is a one time teardown with clear constraints what to ignore, what to double down on, and what experiment would change the outcome fastest. The people who execute will self select into deeper work, and you avoid becoming the on call fixer for everyone else.",
                  "score": 2,
                  "created_utc": "2026-01-16 17:14:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o00clbf",
          "author": "SpudMasterFlash",
          "text": "Be subtle, (not that I am all that much) try to add nuggets of value where you can",
          "score": 1,
          "created_utc": "2026-01-16 22:49:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}