{
  "metadata": {
    "last_updated": "2025-12-31 14:29:57",
    "time_filter": "week",
    "subreddit": "GrowthHacking",
    "total_items": 15,
    "total_comments": 77,
    "file_size_bytes": 96151
  },
  "items": [
    {
      "id": "1pw5ycp",
      "title": "My product barely grew for 5 months, then I started posting helpful content and everything changed",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1pw5ycp/my_product_barely_grew_for_5_months_then_i/",
      "author": "BreadG7",
      "created_utc": "2025-12-26 14:47:10",
      "score": 32,
      "num_comments": 13,
      "upvote_ratio": 0.96,
      "text": "Launched my SaaS in March last year after 4 months of building. Did the whole Product Hunt thing, got 127 upvotes which felt amazing, 34 signups, 2 people actually paid. Then just crickets for months. By August I had maybe 50 total users and was making $180/month, barely enough for my tool costs. Started thinking maybe the market just wasn't there.\n\nI was complaining about it in a Discord group and someone asked if I was doing any content marketing. I said no because I'm not a writer and didn't think anyone would care. They suggested I just answer questions in communities where my target users hang out, be helpful without pitching anything. Seemed pointless but I had nothing to lose.\n\nStarted spending 30 minutes most days just browsing r/freelance and r/solopreneurs looking for questions I could actually answer about the problem my tool solves, which is managing client projects. Wrote genuine helpful comments, shared what worked for me when I was freelancing, mentioned tools I'd used. Didn't mention my product for probably 3 weeks, just helped people. Got some upvotes, people DMing follow-up questions, felt good honestly.\n\nAfter a month of that, someone asked for tool recommendations and I mentioned mine along with two competitors, trying to be honest about when each makes sense. That post got some traction, had 6 signups that week from Reddit. That felt like progress. So I kept doing it, got more comfortable sharing my own experience. Started writing longer posts about specific problems like \"How I organize client feedback without losing my mind\" and people seemed to find them useful.\n\nAround month 4 of doing this consistently, something clicked. SEO started working, my helpful posts were ranking for random searches. Some weeks I'd get 15-20 signups without doing anything new. Built an email list of like 400 people just from those posts who wanted updates. Now 11 months later I'm at $5.6K MRR, most of it from organic search and community referrals. Still adding maybe 25-35 signups weekly. The approach came from reading case studies in [FounderToolkit](http://foundertoolkit.org) about founders who grew through content, seeing their actual timelines which were months not weeks, their struggles with consistency, the fact that most of them almost quit before it started working. Made me realize patient consistency beats desperate promotion every time. Not sexy advice but it's what actually worked after launches and paid ads failed.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1pw5ycp/my_product_barely_grew_for_5_months_then_i/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nw170ci",
          "author": "Unique-Persimmon2291",
          "text": "didn't mention your product for 3 weeks, just helped people that's the trust-building foundation most miss. We jump straight to 'here's my tool' and get ignored.",
          "score": 4,
          "created_utc": "2025-12-26 15:09:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw1a0ug",
          "author": "bala523",
          "text": "400 person email list just from helpful posts is an underrated metric. That's 400 people who trust you enough to want updates because you solved their problems publicly first. Way more valuable than 10K followers who ignore your pitches",
          "score": 3,
          "created_utc": "2025-12-26 15:26:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw15btp",
          "author": "zaryeb-Ahmed",
          "text": "like this story. The part about helping in communities without pitching really hit home. I am Curious about how did you decide which topics were worth writing longer posts about early on\n\n?",
          "score": 3,
          "created_utc": "2025-12-26 14:59:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw18ikt",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2025-12-26 15:18:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw1bf55",
              "author": "BreadG7",
              "text": "Mostly answering existing posts early on (maybe 80/20 split). Way easier to add value to active discussions than create posts from scratch hoping people care. Started posting my own 'how I solved X' content after 6-8 weeks once I'd built some comment karma and credibility.",
              "score": 3,
              "created_utc": "2025-12-26 15:34:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw2pwl4",
          "author": "Escobarneon",
          "text": "Helpful content is killer in my reality. You‘ll get trust, traffic, signals and more and more personas in your bubble. Less spend for more and more effective performance campaigns.",
          "score": 1,
          "created_utc": "2025-12-26 20:02:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw55tv3",
          "author": "SRCMAN",
          "text": "Same theory as the gym, be consistant. Congrats on finding what works for you.",
          "score": 1,
          "created_utc": "2025-12-27 04:57:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw62ylq",
          "author": "LeiraGotSkills",
          "text": "This is helpful.",
          "score": 1,
          "created_utc": "2025-12-27 09:55:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfdj7a",
          "author": "iamderangedwolf",
          "text": "yea i did something similar for my project... started with manual replies in niche communities, then switched to using beno one to automate finding discussions and posting helpful comments, saves a ton of time while keeping it organic.",
          "score": 1,
          "created_utc": "2025-12-28 20:53:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhjtwn",
          "author": "Slight_Tutor1790",
          "text": "What really stands out here is how the content started as a byproduct of solving your own problems, not a growth tactic. That usually shows in the tone. People can tell when advice comes from lived experience versus something written to rank or convert. The slow ramp also matters. It sets more realistic expectations for anyone trying this now. The work compounds quietly for a long time before it looks like momentum, and most people quit right before that curve bends.",
          "score": 1,
          "created_utc": "2025-12-29 03:57:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpjw77",
          "author": "Best-Menu-252",
          "text": "This is such a good example of how growth actually works in practice. Helping first and showing up consistently in the communities where your users already are builds trust long before it drives signups. What stands out is that nothing “magical” happened. You focused on value, learned from real conversations, and stayed consistent long enough for it to compound. That’s how community and content start working together over time. Also love the reminder that this isn’t about hacks or quick wins. Innovation, scalability, and real user connection beat launches and paid ads when there’s patience behind it. Really solid breakdown.",
          "score": 1,
          "created_utc": "2025-12-30 10:33:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwr2ew3",
              "author": "StealthAiEcommCPO",
              "text": "agree",
              "score": 1,
              "created_utc": "2025-12-30 16:16:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pznyvz",
      "title": "Wrote 50 cold emails. Got 2 responses. Both became customers worth $47K combined.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1pznyvz/wrote_50_cold_emails_got_2_responses_both_became/",
      "author": "Several_Function_129",
      "created_utc": "2025-12-30 17:23:44",
      "score": 25,
      "num_comments": 15,
      "upvote_ratio": 0.88,
      "text": "Hated the idea of cold email. Felt spammy. Felt desperate. Avoided it for years because it seemed beneath what a \"real\" company should do. Then I ran out of other ideas and needed customers.\n\nWrote 50 personalized cold emails. Not templates. Actually researched each company and wrote something specific to them. Mentioned something from their website or recent news. Explained specifically why I thought we could help their situation. Took about 2 hours total for all 50 because I batched the research.Created a simple one-pager in Gamma that I could attach showing exactly what we do for companies like theirs.\n\n48 people didn't respond at all. Expected and fine. 2 people responded. Both turned into calls. Both turned into customers. One became a $29K annual contract. The other started at $8K and has expanded twice since then. Those 2 hours of writing cold emails generated more revenue than months of content marketing and social media combined. I was so worried about bothering people that I missed out on helping people who actually needed what we offered.\n\nCold email isn't spam if it's relevant and personalized and offers real value. Spam is irrelevant mass messaging. Taking time to understand someone's situation and explaining how you might help is just sales. And sales is how businesses grow. I still don't love doing it but I stopped pretending it's beneath me.\n\n  \n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1pznyvz/wrote_50_cold_emails_got_2_responses_both_became/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nwttofo",
          "author": "VictorMorgan241",
          "text": "Personalizing your cold emails like you did is key, and it's great to see it paid off for you.",
          "score": 3,
          "created_utc": "2025-12-31 00:18:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nws9paf",
          "author": "who_am_i_to_say_so",
          "text": "IDK how I feel about this. IS this spam?\n\nI get letters in the mail from real estate investors with a picture of my house with a cash offer, and I hate it. Those are essentially personalized, too.\n\nThis is an invitation to change my mind. I’m never opposed to making money 😂.",
          "score": 2,
          "created_utc": "2025-12-30 19:38:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwsmpl1",
              "author": "vx1",
              "text": "yes it’s spam, is written the same and sounds exactly the same as every other post on the business side of reddit, talking about how personalization is somehow the secret key to succeeding in business. \n\nit’s like the videos of a dude in their bedroom talking about how he started sending personalized looms to decision makers and now he’s making 40k MRR. he’s actually making $40 MRR from selling his bullshit",
              "score": 2,
              "created_utc": "2025-12-30 20:41:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwszi3k",
                  "author": "OfAllThatIsElfuego",
                  "text": "Counterpoint, I have a small business (550k in physical retail) and have responded to 3 or 4 cold emails in the last few months that were specifically about a problem I had or something I wanted to do but didn't have the time. Only 1 panned out (SEO-related), but I was hopeful about the others.",
                  "score": 2,
                  "created_utc": "2025-12-30 21:41:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwruqyw",
          "author": "leadg3njay",
          "text": "A 4% response rate is excellent, proof that deep personalization works. 50 emails is a great test, but scaling this with warmed inboxes, AI personalization, and proper cadence turns a one-off win into a repeatable pipeline. Cold email beats months of content when done right, make that $47K the baseline, not the ceiling.",
          "score": 1,
          "created_utc": "2025-12-30 18:28:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwwkga1",
              "author": "ventdivin",
              "text": "A 4% rate on a sample of 50 is not statistically significant to be proof of anything.",
              "score": 1,
              "created_utc": "2025-12-31 12:30:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwsqki4",
          "author": "Strong_Teaching8548",
          "text": "agree the key difference is always personalization, when you actually research the person vs sending 500 templated emails, the numbers shift dramatically",
          "score": 1,
          "created_utc": "2025-12-30 20:59:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvlyc8",
          "author": "Wrong_Ad_11",
          "text": "Good for you. This is inspiring! Doing things that don’t scale are how to jumpstart.",
          "score": 1,
          "created_utc": "2025-12-31 07:15:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrqmy2",
          "author": "novice-at-everything",
          "text": "I’m new to this so this might be a naive question. But does cold emails work for B2C too, since it definitely makes sense for B2B?",
          "score": 0,
          "created_utc": "2025-12-30 18:09:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwrxugr",
              "author": "Morphius007",
              "text": "Illegal in the USA",
              "score": 2,
              "created_utc": "2025-12-30 18:42:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nws21jd",
                  "author": "novice-at-everything",
                  "text": "Nice. As it should be. \n\nAny idea about other countries. Mostly trying to understand if it even works for B2C.",
                  "score": 1,
                  "created_utc": "2025-12-30 19:01:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwstpcc",
                  "author": "nnofficial2414",
                  "text": "It’s not, however it must follow strict email marketing regulations so that it can avoid being classified as spam.",
                  "score": 1,
                  "created_utc": "2025-12-30 21:14:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pwzm0f",
      "title": "$487 paid acquisition vs $11 organic after building backlink foundation (14-month data)",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1pwzm0f/487_paid_acquisition_vs_11_organic_after_building/",
      "author": "Shyn_Shyn",
      "created_utc": "2025-12-27 14:51:58",
      "score": 21,
      "num_comments": 6,
      "upvote_ratio": 0.91,
      "text": "\nGrowth hacker tracking customer acquisition across all channels for 14 months. Started with standard growth playbook of paid ads, referral loops, and viral tactics. Realized compound SEO economics beat all the clever hacks. Sharing complete channel comparison with month-by-month CAC progression.​ Business context is workflow automation SaaS at $89/month pricing. Launched using typical growth hacking playbook. Referral program with incentives, product-led growth mechanics, paid ads for scale. After 6 months realized $487 blended CAC was unsustainable even with viral coefficients. Started investing in organic backlink foundation to fix economics.​\n\nMonths 1-6 was growth hack experimentation spending $31,200 acquiring 64 customers. Referral program added 12% uplift to signups. Viral mechanics worked but didn't compound. Product-led growth helped conversion but didn't solve top-of-funnel. Blended CAC was $487 per customer. At $89/month pricing that's 5.5-month payback with 9-month average LTV barely profitable.​\n\nMonth 7 started backlink foundation while continuing growth experiments. Used [directory submission service](http://getmorebacklinks.org/) establishing domain authority through 200+ directories. Published 3 blog posts weekly targeting buyer-intent keywords like \"workflow automation for X\" and comparison content. Domain authority went from 0 to 15 first month. Growth hacks continued but organic building alongside.​\n\nMonths 7-12 showed organic momentum building while growth hacks plateaued. Domain authority reached 26. Started ranking for 42 keywords. Getting 880 monthly organic visitors by month 12. First organic customers appeared month 9. By month 12 organic delivered 14 customers monthly while referral program and paid continued at similar levels. Growth hacks still working but not scaling.​\n\nMonths 13-14 showed organic scaling past all growth hacks. Traffic reached 1480 monthly visitors. Ranking for 58 keywords with 24 in top 10. Delivering 26-32 organic customers monthly. These customers had better retention with 12-month average LTV versus 9-month for paid and referral suggesting better product fit from organic channel.​\n\nThe CAC comparison after 14 months shows organic economics beat growth hacks. Paid plus growth experiments: $54,800 spent acquiring 112 customers equals $489 CAC. Organic backlinks: $1,380 invested acquiring 148 customers equals $9.32 CAC. Organic is 52x more efficient than growth hacking tactics that stop working when effort stops.​\n\nThe unit economics tell complete story about compound versus one-time tactics. Growth hack customers: $487 CAC, 9-month LTV, $801 lifetime value equals $314 profit per customer. Organic customers: $9 CAC, 12-month LTV, $1068 lifetime value equals $1059 profit per customer. Organic delivers 3.4x more profit per customer with way better margins.​ What worked for sustainable growth economics was targeting buyer-intent keywords not vanity traffic, optimizing conversion since organic visitors were qualified, creating comparison and use case content that converts, building email nurture for prospects not ready immediately, tracking cohort retention showing organic customers stay longer, and being patient through months 7-10 when organic investment wasn't yet paying off.​\n\n\nInvestment breakdown over 14 months was GetMoreBacklinks directory service $127 one-time, Ahrefs $99/month for 6 months then free tools, hosting $22/month, content tools $38/month average. Total $1,380 versus $54,800 on paid ads and growth experiments. The 40x cost difference creates completely different business economics.​ For other growth hackers the strategic lesson is compound tactics beat clever one-time hacks. Referral programs and viral loops provide short-term lift but don't scale sustainably. Backlink foundation built in month 7 still generates customers in month 14 with zero additional spend. Start building organic alongside growth experiments from day one.​ The mistake we made was treating SEO as boring and growth hacks as exciting. Reality is growth hacks are expensive treadmill requiring constant new tactics. Organic is boring compound machine that gets stronger monthly. The economics clearly favor boring fundamentals over sexy hacks.​",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1pwzm0f/487_paid_acquisition_vs_11_organic_after_building/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nw77on0",
          "author": "Witty-Lawyer3989",
          "text": "Organic scaling to 26-32 customers/mo while growth hacks plateaued is the inflection point. Viral coefficients provide short-term lift but don't create sustainable acquisition engine",
          "score": 1,
          "created_utc": "2025-12-27 15:10:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw79aac",
          "author": "No_Barracuda_6098",
          "text": "what your referral program viral coefficient was and if you tested different incentive structures? Wondering if it ever broke 1.0x for true viral growth or just linear boost",
          "score": 1,
          "created_utc": "2025-12-27 15:19:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw79z5n",
              "author": "Shyn_Shyn",
              "text": "\nPeaked at 0.68 viral coefficient with $20 credit for referrer + month free for referred user. Tested higher incentives ($50 credit) but attracted low-quality signups who churned fast never broke 1.0x for true viral growth.",
              "score": 1,
              "created_utc": "2025-12-27 15:23:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw7s52k",
          "author": "PositionSalty7411",
          "text": "This hits hard because it’s real data, not theory. Paid and growth hacks  worked, but SEO quietly kept compounding. $9 CAC vs $487 says everything. Boring, slow, and absolutely worth it.",
          "score": 1,
          "created_utc": "2025-12-27 16:56:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw93gwa",
          "author": "Sadpatte",
          "text": "would love to exchange on the organic content and the testing variations of upfront and cross-selling as well as a clear loyalty program for incentives",
          "score": 1,
          "created_utc": "2025-12-27 21:02:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfel3i",
          "author": "isaaclhy13",
          "text": "Which month did organic finally overtake paid in CAC? I'm a founder too and battled the same insane paid CAC burn. Double down on buyer intent SEO to get qualified traffic that converts better and boosts LTV. Run conversion experiments on landing pages and email nurture to shorten payback and capture hesitant buyers. Reinvest early profits into backlink foundations and consistent content so compounding starts sooner. If you hit scaling friction we built Bleamies that finds relevant Reddit posts and drafts comments and replies to seed conversations and outreach; would love feedback or to connect if you try it, it can help with that painful months 7 to 10 patience gap, good luck",
          "score": 1,
          "created_utc": "2025-12-28 20:58:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1puatev",
      "title": "Can AI run ad accounts for me at this point?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1puatev/can_ai_run_ad_accounts_for_me_at_this_point/",
      "author": "AhNoMiNuS",
      "created_utc": "2025-12-24 01:23:24",
      "score": 20,
      "num_comments": 7,
      "upvote_ratio": 0.92,
      "text": "Hey!\n\nI am a heavy user of n8n automations and AI tools.\n\nWhat automations do you use to automate your paid ads, or at least parts of them?\n\nI manage around 6–8 clients at any given time as a one-man show.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1puatev/can_ai_run_ad_accounts_for_me_at_this_point/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nvnayja",
          "author": "bapuc",
          "text": "Not yet.",
          "score": 1,
          "created_utc": "2025-12-24 01:47:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvpm3gd",
          "author": "Sudden-Context-4719",
          "text": "AI can help with parts of ad management like bid adjustments or creative testing but running full accounts still needs human input. I use n8n to automate reporting and alerts, which saves time.",
          "score": 1,
          "created_utc": "2025-12-24 13:03:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvrsucj",
          "author": "ixitimmyixi",
          "text": "For media buying - AI can automate most of it.\n\nFor content and ad creatives - AI can help with some of it.\n\nThat’s how I see it.\n\nI use AdAmigo AI to automate the media buying part of my ad accounts (Facebook ads). Since it’s an AI, it tends to think and act similarly to how I would, so I feel comfortable working with it.\n\nThey also have a bulk ad launcher to launch ads at scale.\n\nFor ad creation, I love TikTok Creative Studio for AI UGC videos and voiceovers. It’s free and, in my opinion, better than paid options like Arcads, etc.\n\nFor everything else, I use Canva. For more complex videos, I work with video designers from Upwork. I send the exact same project to four different designers and then pick my favorite for future projects 🙂\n\nHope this helped.",
          "score": 1,
          "created_utc": "2025-12-24 20:29:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvtugc1",
          "author": "ChickenSubstantial52",
          "text": "try [adcrafty.ai](http://adcrafty.ai) for video content",
          "score": 1,
          "created_utc": "2025-12-25 05:08:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxvfrb",
      "title": "I fully automated my SEO efforts for 2 sites using AI - The outcome.",
      "subreddit": "GrowthHacking",
      "url": "https://i.redd.it/e4ypxepd1z9g1.png",
      "author": "ThinkyandTheBrain",
      "created_utc": "2025-12-28 16:27:18",
      "score": 10,
      "num_comments": 27,
      "upvote_ratio": 0.68,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1pxvfrb/i_fully_automated_my_seo_efforts_for_2_sites/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nwg0yrz",
          "author": "NecessaryCar13",
          "text": "I request that we enforce stricter moderation against manipulative marketing tactics. Specifically, posts that utilize deceptive methods to drive traffic to external websites should be removed.\n\nThese self-spamming promotional posts are getting ridiculous.",
          "score": 8,
          "created_utc": "2025-12-28 22:50:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwg1i88",
              "author": "ThinkyandTheBrain",
              "text": "I am sorry you feel that way about this post - these are real numbers, and I described how you can build it yourself in the comments (without ever going to my site)",
              "score": -4,
              "created_utc": "2025-12-28 22:53:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwe1994",
          "author": "Salty_Insurance_257",
          "text": "How?",
          "score": 2,
          "created_utc": "2025-12-28 17:01:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwe565r",
              "author": "ThinkyandTheBrain",
              "text": "Here is how I built it:  \nHow I did it. I trained an LLM (RAG) to write like me. I provided over 15 samples, and it got pretty good.\n\nAfter that, I provided a RAG of what my brand looks like to have it mimic image creation.\n\nFrom there, I fed it my pillar pages and target keywords.\n\nEvery morning it writes a new post about my company and keywords in my voice - while also being told to optimize by linking to at least 2 external sites, having 3 images in the post, optimizing alt text, and dropping the keyword into headers. Additionally, I tied it to a network of backlinks, so I naturally trade with other sites.\n\nSo far it is working - will see long-term.",
              "score": 3,
              "created_utc": "2025-12-28 17:21:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwe77t2",
                  "author": "Salty_Insurance_257",
                  "text": "Same fucking. You're a bot?",
                  "score": 2,
                  "created_utc": "2025-12-28 17:31:12",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwh39pq",
                  "author": "libertyfml",
                  "text": "From your description you did no train a llm",
                  "score": 2,
                  "created_utc": "2025-12-29 02:20:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwjfwu1",
          "author": "honeytech",
          "text": "Suggestions : Focus on how you can make this error free, way to manage brand knowledge vault (to train on auto pilot), use sitemap as source to train organisation domain knowledge, verify “people also ask”, integrate schema and make integration for platform. \n\nDo a poc with brands, observe how it helps users , create case study, & scale.",
          "score": 2,
          "created_utc": "2025-12-29 13:13:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjhv7h",
              "author": "ThinkyandTheBrain",
              "text": "Love this. I have the sitemap training - I had to because it kept making up random links and doing a 404. I also integrated analytics to pull pages that way and track within the system.\n\nThe Schema portion is automatic on the WordPress end. But I need to double-check on that.\n\nError Free - this one is a little tougher - link-wise, can test and resolve easily by adding a proofreading layer, but making sure all the facts are correct.. I will take ideas :)",
              "score": 1,
              "created_utc": "2025-12-29 13:26:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwjjo2y",
                  "author": "honeytech",
                  "text": "For error check - do a real user testing, poc will help. A developer can’t find issues as they develop dark spots after working on code for too long. \n\nSchema - include a java script. Example: do you offer faq schema yes no? In the age of ai seo it’s mandatory. \n\nSitemap: you have to scan the root domain, search for possible locations like rootdomain.com/sitemap.xml > render URLs > scan / crawl them to build brand knowledge. \n\nAgain these are just suggestions, do your own real users sit downs..\n\nHave recently deployed https://uttik.com for an enterprise so just sharing the insights…. \n\nAlso, your WP plugin is published? If not: do submit the same on WP directly, it will give you more users.",
                  "score": 2,
                  "created_utc": "2025-12-29 13:37:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwf3i0u",
          "author": "Spacmonitor",
          "text": "I am using [https://wpautoblog.com](https://wpautoblog.com) with similar results",
          "score": -1,
          "created_utc": "2025-12-28 20:04:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwfx19f",
              "author": "jluke251",
              "text": "I tried this and it’s not great and full of bugs. Like most AI coded Sass slop.",
              "score": 4,
              "created_utc": "2025-12-28 22:29:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwfxb2x",
                  "author": "Spacmonitor",
                  "text": "What bugs did you encounter? I didn't see any.",
                  "score": -1,
                  "created_utc": "2025-12-28 22:31:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwf5uiq",
              "author": "ThinkyandTheBrain",
              "text": "did not know about that one - very similar!\n\nAre you training the platform about your company, brand tone, and brand design? Or is it creating more generic posts?",
              "score": 1,
              "created_utc": "2025-12-28 20:15:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwf8llo",
                  "author": "Spacmonitor",
                  "text": "Yep, you can train it!",
                  "score": 2,
                  "created_utc": "2025-12-28 20:29:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwdvf27",
          "author": "ThinkyandTheBrain",
          "text": "How I did it. I trained an LLM (RAG) to write like me. I provided over 15 samples, and it got pretty good. \n\nAfter that, I provided a RAG of what my brand looks like to have it mimic image creation. \n\nFrom there, I fed it my pillar pages and target keywords. \n\nEvery morning it writes a new post about my company and keywords in my voice - while also being told to optimize by linking to at least 2 external sites, having 3 images in the post, optimizing alt text, and dropping the keyword into headers. Additionally, I tied it to a network of backlinks, so I naturally trade with other sites.\n\nSo far it is working - will see long-term.",
          "score": -2,
          "created_utc": "2025-12-28 16:32:36",
          "is_submitter": true,
          "replies": [
            {
              "id": "nwdxgo3",
              "author": "thelastexcursion",
              "text": "What stack of programs u used ?",
              "score": 1,
              "created_utc": "2025-12-28 16:42:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwe52hb",
                  "author": "ThinkyandTheBrain",
                  "text": "I used Loveable, Nana Banana (Gemini), ChatGpt - and that's about it. I am sure you could build it out yourself if you have a little know-how in the space. Building it through just gemini without a platform would be doable, just more manual.  \n  \nThe one I built is [Skail.ai](http://Skail.ai) if you want to give it a shot.",
                  "score": 0,
                  "created_utc": "2025-12-28 17:20:31",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1puchd1",
      "title": "Best free CRM that scales as you grow? Need something that grows with the team",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1puchd1/best_free_crm_that_scales_as_you_grow_need/",
      "author": "Ok-Bar-6014",
      "created_utc": "2025-12-24 02:46:32",
      "score": 9,
      "num_comments": 3,
      "upvote_ratio": 0.92,
      "text": "Hi all, we’re just getting started with tracking leads and outreach, so a free CRM seems perfect. My worry is switching later when our needs get more complex.\n\nSome colleagues suggested HubSpot because you can start simple and then unlock more features without completely migrating. Has anyone actually done this? Does it really grow with you, or are there hidden limitations? I’d love to hear practical thoughts before committing.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1puchd1/best_free_crm_that_scales_as_you_grow_need/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nvpm7h0",
          "author": "Sudden-Context-4719",
          "text": "HubSpot does scale pretty well and you can add features as you grow without switching. The free plan is solid but some advanced stuff gets pricey fast.",
          "score": 1,
          "created_utc": "2025-12-24 13:03:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvtsdrq",
              "author": "Ok-Bar-6014",
              "text": "Got it, thanks! How did you handle adding features as your team grew? Did it feel seamless or did you hit any limitations?",
              "score": 1,
              "created_utc": "2025-12-25 04:51:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvtu3jh",
          "author": "Educational_Jello666",
          "text": "If you already know you’ll need more advanced stuff fairly soon (multiple reps, sequences, real reporting, maybe calling), it can actually be cheaper long‑term to skip **free** and start on a focused sales CRM at a paid tier. Free plans are great for testing, but the real pain usually shows up when you have to rip everything out and migrate once you hit their limits. I’d map out what you realistically need over the next 12–24 months (team size, channels, volume) and pick a tool that fits that journey even if it starts paid, rather than optimizing only for free today and paying in switching costs later.",
          "score": 1,
          "created_utc": "2025-12-25 05:05:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxuap8",
      "title": "We stopped cold outreach and started harvesting live buying intent, here’s what actually worked",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1pxuap8/we_stopped_cold_outreach_and_started_harvesting/",
      "author": "Certain_Special3492",
      "created_utc": "2025-12-28 15:41:05",
      "score": 7,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "Over the past few months, we ran a simple experiment for B2B growth that challenged one assumption we’d internalized for years:\n\n\n\n>“You need to *create* demand through outbound.”\n\n\n\nInstead, we tested what happens when you **only engage people who are already publicly expressing pain** related to your product category.\n\n**What we did (high level)**\n\n* Monitored public conversations across Reddit, X, and niche forums\n* Filtered for **problem-first language** (not keywords, not brand mentions)\n* Reached out only when:\n   * The pain was explicit\n   * The user was actively seeking a solution\n   * Timing was clearly “now”, not someday\n\nNo scraping emails. No spam blasts. No pitch-first messages.\n\n**What surprised us**\n\n1. **Reply rates were 3–5× higher** than our previous outbound\n2. Sales conversations felt collaborative, not adversarial\n3. Many users literally replied with “Thanks, this is exactly what I needed”\n4. We spent *less time* selling and more time qualifying\n\n**What didn’t work**\n\n* Generic keyword alerts → too noisy\n* Automated replies → killed trust instantly\n* Jumping in too early → users hadn’t fully articulated the pain yet\n\n**The key insight**\n\nGrowth doesn’t come from louder distribution — it comes from **better timing**.\n\nPeople announce intent *before* they ever hit your landing page. If you can detect that moment, growth becomes less about persuasion and more about relevance.\n\nWe ended up building internal tooling to systemize this (which later evolved into a product), but the core lesson applies even if you do this manually.\n\n**Curious to hear from the community:**\n\n* Have you experimented with intent-based outreach vs traditional outbound?\n* Where have you found the highest-quality buying signals?\n* Do you think this scales, or is it only effective early-stage?\n\nWould love to compare notes.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1pxuap8/we_stopped_cold_outreach_and_started_harvesting/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nwdr1ii",
          "author": "matixlol",
          "text": "This approach is absolutely correct; we've seen similar results moving away from pure cold outreach. Focusing on expressed pain points makes conversations far more productive and less like pulling teeth.\n\nFor monitoring public conversations, I've tried a few options like Awario for general social listening, some custom scripts, and more recently LeadsRover for Reddit specifically. They all have different strengths, but I've found LeadsRover pretty effective for drilling down into active problem-solving discussions on Reddit.\n\nThe biggest challenge is consistently identifying genuine intent versus just general complaining, so really refining your \"problem-first language\" filters is crucial.",
          "score": 2,
          "created_utc": "2025-12-28 16:10:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwemr3r",
              "author": "Certain_Special3492",
              "text": "Leadsynth is the best in this space it beats the rest by a long shot",
              "score": 0,
              "created_utc": "2025-12-28 18:44:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwe4tno",
          "author": "JohnDoe7789",
          "text": "focusing on real intent beats mass messaging. ScraperCity helped me pull pain point conversations from places like reddit and forums and reach people at the right time.",
          "score": 1,
          "created_utc": "2025-12-28 17:19:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwemtbs",
              "author": "Certain_Special3492",
              "text": "Leadsynth is the best tool out there tbh",
              "score": 1,
              "created_utc": "2025-12-28 18:45:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwe4zff",
          "author": "Shivam5483",
          "text": "Depending on the niche, what do you do once you’ve exhausted the obvious opportunities, meaning you’ve already reached out to everyone who was publicly expressing pain, showing urgency, and actively looking for a solution?\n\nI know this varies by niche and by what you’re selling, but I’m not sure how many new buyers that fit this criteria keep showing up in public forums. I could be wrong though. Happy to be corrected.",
          "score": 1,
          "created_utc": "2025-12-28 17:20:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwemm7q",
              "author": "Certain_Special3492",
              "text": "Good question actually, well that’s gonna take a loooong time for that to happen because there’s so much online literally like millions of posts online and that’s me being minimal with it and if they do run out then there’s always another platform to try and look on",
              "score": 1,
              "created_utc": "2025-12-28 18:44:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwfekzu",
          "author": "isaaclhy13",
          "text": "Have you tracked which exact phrases signal \"now\" intent on each forum? I'm a founder too and fought noisy keyword alerts and awkward timing. Try monitoring forums for problem-first language and filter by urgency to cut noise, craft personal replies that acknowledge the exact pain to build trust, and set a simple prioritization queue so you only engage high-intent posts quickly. If you worry about scaling, we built Bleamies to find relevant Reddit posts and draft replies so you can reply faster and more authentic. Would love feedback or to connect if you try it. Good luck.",
          "score": 1,
          "created_utc": "2025-12-28 20:58:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwpm07b",
              "author": "Certain_Special3492",
              "text": "Thanks for the recommendation but I use LeadSynth for this type of workflow and it’s been amazing",
              "score": 1,
              "created_utc": "2025-12-30 10:52:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwhj1wh",
          "author": "Slight_Tutor1790",
          "text": "One thing I have noticed is that intent often shows up in follow up comments rather than the original post. People start vague, then get more specific when others reply. Watching threads evolve over a few hours instead of reacting instantly can surface much stronger signals and lead to warmer conversations. It feels less like outreach and more like joining an ongoing decision process.",
          "score": 1,
          "created_utc": "2025-12-29 03:53:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwplybv",
              "author": "Certain_Special3492",
              "text": "Agreed, sometimes what gets said in the comments has more intent than the post itself. I’ve tried a tool that’s good with this it’s called LeadSynth",
              "score": 1,
              "created_utc": "2025-12-30 10:52:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwiblp5",
          "author": "gauri_insights",
          "text": "How did you find the people who are actively seeking a solution and not just keywords related to your solution?",
          "score": 1,
          "created_utc": "2025-12-29 07:23:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwplqem",
              "author": "Certain_Special3492",
              "text": "We created our own algorithms for this",
              "score": 1,
              "created_utc": "2025-12-30 10:50:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwjrhxb",
          "author": "Email_Rookie",
          "text": "You are spot on. Intent is basically just a high-quality filter for outreach. Instead of guessing, you are answering a question they already asked.\n\nTo answer your question on scaling, that is the hardest part. Detecting intent manually is great for early traction but hard to hire for. You eventually need tools to listen for those signals automatically or you will burn out reading forums all day.\n\nFor the signals themselves, I find the best ones are hiring posts and \"tech stack\" questions in niche communities. If a founder asks \"what CRM connects to X\", they are ready to buy right now.\n\nI use a good data enrichment tool to close the loop on this. Once I find the person asking for help on LinkedIn, I use it to pull their verified work email. It is helpful here because it lets me take the conversation off a noisy comment section and into a professional inbox where B2B deals actually get signed.",
          "score": 1,
          "created_utc": "2025-12-29 14:23:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwpluva",
              "author": "Certain_Special3492",
              "text": "I’ve been using LeadSynth recently it’s been great you should check it out",
              "score": 1,
              "created_utc": "2025-12-30 10:51:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwk0l3s",
          "author": "Sudden-Context-4719",
          "text": "We tried something similar and found that catching folks right when they vent on Reddit works way better than generic keyword alerts. Tools like SocListener help spot those posts fast and even suggest replies so you don’t waste time. Scaling it is tricky but worth it if you can keep the timing tight.",
          "score": 1,
          "created_utc": "2025-12-29 15:12:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwpltlv",
              "author": "Certain_Special3492",
              "text": "Have you tried LeadSynth, it’s the best in the game imo",
              "score": 1,
              "created_utc": "2025-12-30 10:50:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pw41l7",
      "title": "Traffic flatlined… and I’ve never been happier to see it",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1pw41l7/traffic_flatlined_and_ive_never_been_happier_to/",
      "author": "Hefty-Airport2454",
      "created_utc": "2025-12-26 13:15:41",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Was checking out some view stats on my directory (where you flex your views, ranked) and for once, I smiled watching the numbers *drop*.\n\nUsually, when traffic dips, it’s “sad”. But this time, the charts basically said: everyone took a break for Christmas. It’s nice to see people actually disconnect for once (well, not me, clearly, since I’m here posting about it 😅).\n\nIt resonates perfectly into that eternal \"When to Launch\" debate : weekdays vs. weekends.\n\nWe always say “Don’t push on Friday” because nobody’s around, but it sparked a fun thought about the trade-off we all juggle:\n\n* **Weekdays:** High traffic, but drowning in noise.\n* **Weekends/Holidays:** Quiet, tiny audience, but no competition.\n\nCurious how you all play it. Do you religiously avoid Friday–Sunday launches because of the low volume, or the opposite?\n\nHope the pause was good to you all. Now... back online. 🫡",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1pw41l7/traffic_flatlined_and_ive_never_been_happier_to/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nw0s25i",
          "author": "kylerusby",
          "text": "Yeah checking out trustviews this morning it was definitely interesting seeing the massive dips in traffic to the sites. Like you say though, it's a good thing as it was Christmas haha 😁 It was also surprising to make a sale on onedollarfeedback- I didn't expect it on Christmas day for sure",
          "score": 3,
          "created_utc": "2025-12-26 13:33:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw0s9ts",
          "author": "jonphillips06",
          "text": "I’ll usually launch on a monday, tuesday, or wednesday, but it depends on the platform tbh. Weekend traffic is always slower anyway.",
          "score": 2,
          "created_utc": "2025-12-26 13:35:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw0sh18",
              "author": "kylerusby",
              "text": "Do you put much thought into when you launch? I know for me it's just whenever I think the product is 'pretty much' usable haha",
              "score": 3,
              "created_utc": "2025-12-26 13:36:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw12kha",
                  "author": "jonphillips06",
                  "text": "Not really tbh haha I probably should though.",
                  "score": 1,
                  "created_utc": "2025-12-26 14:42:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nw16gmc",
              "author": "Hefty-Airport2454",
              "text": "Slower but less competition.",
              "score": 2,
              "created_utc": "2025-12-26 15:06:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw16kg0",
                  "author": "jonphillips06",
                  "text": "Yeah there's definitely less competition on the weekends",
                  "score": 2,
                  "created_utc": "2025-12-26 15:06:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw1mjjl",
          "author": "OkDependent6809",
          "text": "Honestly traffic dips during holidays are pretty normal. Everyone checks out, numbers drop, then bounce back in January.\n\nFor launches, weekdays are way better just because more people are actually paying attention. Weekends might have less noise but if nobody's looking at all, doesn't really matter.\n\nWe've tried both and weekday launches consistently get more traction even with more competition. The \"low competition on weekends\" thing sounds good in theory but the volume drop is way worse than the noise increase on weekdays.\n\nThat said, timing your launch probably matters way less than people think. If your product is good and you know how to reach your audience, the day of the week isn't gonna make or break you.",
          "score": 2,
          "created_utc": "2025-12-26 16:34:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw1onxa",
              "author": "Hefty-Airport2454",
              "text": "So you would say : just launch, don't overthink, possibly on weekdays ahah",
              "score": 1,
              "created_utc": "2025-12-26 16:45:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pzcv68",
      "title": "Scaled personalized outreach to 500 accounts monthly without hiring more people",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1pzcv68/scaled_personalized_outreach_to_500_accounts/",
      "author": "singhankit9708",
      "created_utc": "2025-12-30 08:31:48",
      "score": 5,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Growth team of 4 people trying to do personalized outreach to enterprise accounts. The math didn't work, good personalization takes 20-30 min per account and we needed to hit 500 accounts a month to hit our pipeline goals.\n\nWe tried hiring more bdrs but budget wasn't there, tried templates but response rates tanked bc enterprise buyers can smell generic outreach instantly. Felt stuck between scale and quality.\n\nThe breakthrough was separating data work from personalization work. Instead of reps spending half their time researching companies and building context, we automated that entire layer with tapistro.\n\nNow the system automatically pulls company info, tracks all their digital signals, monitors news and team changes, surfaces the relevant context for each account. Reps just get a dossier with everything they need to write intelligent outreach.\n\nCut research time from 25 min per account down to maybe 5 min of reviewing the automated brief. Reps can now hit their 500 account quota in the same amount of time they used to spend on 150 accounts.\n\nReply rates actually went up 31% because the outreach is still personalized and thoughtful, we just automated all the grunt work that was eating our time. Quality at scale without burning people out\n\nThe key insight was you can automate intelligence gathering without automating the human touch part. Most teams try to automate the wrong things.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1pzcv68/scaled_personalized_outreach_to_500_accounts/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nwq2bly",
          "author": "Equal-Direction-8116",
          "text": "What most teams miss is that personalization doesn’t come from typing longer emails, it comes from having the *right context at the moment of writing*. When reps are forced to both research and write, one of those always gets rushed, and it’s usually the thinking part.\n\nIf I were looking at this from the outside, the real win isn’t the 500 accounts. It’s that you protected judgment. Automating intelligence while keeping the final message human is one of the few ways scale doesn’t quietly erode trust or burn people out.",
          "score": 1,
          "created_utc": "2025-12-30 13:02:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqrkkr",
          "author": "EmailTrafficPro",
          "text": "this is the right takeaway. automating the research layer instead of the writing is the only way “personalized at scale” actually works\n\nmost teams try to remove the human part and wonder why response rates die. separating intelligence gathering from judgment is what finally makes the math work\n\nalso +1 on burnout. forcing reps to do deep research hundreds of times a month is a fast way to lose good people\n\nquality at scale comes from removing friction, not removing humans",
          "score": 1,
          "created_utc": "2025-12-30 15:25:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwr8ej6",
          "author": "kprin",
          "text": "how much do they charge? and how is this better than clay?",
          "score": 1,
          "created_utc": "2025-12-30 16:44:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrtcps",
          "author": "joeymoaz",
          "text": "does it only monitor accounts you already have on a target list or it can also help with lead generation? if yes can it match a very specific ICP and triggers? my team is looking to add some growth tools to our stack now, and currently what we're already using is salespeak as our inbound intelligence layer to handle inbound questions (on our site, email, and LLMs). so the inbound questions get to be really good insights for us to take next actions with the lead, and with a specific ICP it helps to qualify the leads so our calendar isn't too packed. we're now looking for a tool thats focused on outbound to complement it",
          "score": 1,
          "created_utc": "2025-12-30 18:21:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwu4ef2",
          "author": "isaaclhy13",
          "text": "How do you currently find high-intent posts in that community? I'm a founder too and struggled with spotting threads that actually convert. Try targeted keyword searches to surface intent posts quickly, engage with clarifying questions to build rapport and reveal needs, and set up saved searches or alerts to catch fresh threads in real time so you act first. If you scale outreach you'll hit bandwidth limits, so I built SignalScouter to surface relevant threads and draft founder-style replies you can review and post. Would love any feedback or happy to connect if you try it out; it can help surface posts where folks seek solutions. Good luck.",
          "score": 1,
          "created_utc": "2025-12-31 01:18:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyiljf",
      "title": "How I turned $1 feedback into a success day 01 with “directory” listings into real visibility & sales",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1pyiljf/how_i_turned_1_feedback_into_a_success_day_01/",
      "author": "Hefty-Airport2454",
      "created_utc": "2025-12-29 10:07:12",
      "score": 5,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "I found a “new wave of directories” has been way more interesting to play with than the classic launch-and-forget lists.\n\nThey feel like actual momentum: you ship once, but the page keeps tracking, updating, and giving you new angles to talk about your product. It lives outside of the product.\n\nIt started with marclou on X, free listing providing value on top of visibility and sales, a real directory with purpose : showacse MRR proving what you earn. He even made a marketplace from it. Free listing brough so many poeple he sells ads for $1500 ish.\n\nSame principle for trustviews, free listing, same for burncach, free showcase (typical indie hackers this one)\\*\n\nTL;DR\n\n* **TrustMRR** : live revenue and credibility for SaaS, great “proof page” to link everywhere + recently a marketplace.\n* **TrustViews** : tracks real traffic and makes your visibility shareable in public (new ish)\n* **BurnCash** – a fun, tongue-in-cheek listing that’s still adding real value while not taking itself too seriously (indie hacker oriented)\n\nI even had what I’d honestly call a mini-viral moment: a post with 50k+ views just from sharing how I track sales and visibility across these platforms, and that tiny spike brought a lovely bump in attention to the project and sales.\n\n50k+ views into 1K website visit into 9 sales. Tracking it all as said ahah.\n\nI think it’s the best moment to build a directory with a usecase like these ones. New generation.\n\nFor people with project it’s free listing so why not take advantage of it like I did.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1pyiljf/how_i_turned_1_feedback_into_a_success_day_01/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nwp7eft",
          "author": "LegalWait6057",
          "text": "This feels less about directories themselves and more about treating distribution like a living asset. The interesting part is how those pages keep evolving and give you new stories to share instead of a one time spike. Feels similar to how early forums or communities worked before everything became launch focused. The numbers also show that even small experiments can surface unexpected channels if you actually track what happens after visibility.",
          "score": 2,
          "created_utc": "2025-12-30 08:37:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwpcddh",
              "author": "Hefty-Airport2454",
              "text": "Feels like it indeed !",
              "score": 1,
              "created_utc": "2025-12-30 09:23:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwj4vac",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-29 11:51:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwkcme2",
              "author": "Hefty-Airport2454",
              "text": "Have you tried / used them ?\n\nInclude in the FAQ is smart, never thought about it ahah",
              "score": 1,
              "created_utc": "2025-12-29 16:11:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwk9z7w",
          "author": "Every_Lake4768",
          "text": "Intersting... 😲",
          "score": 1,
          "created_utc": "2025-12-29 15:58:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwp4ly0",
              "author": "Hefty-Airport2454",
              "text": "Have you tried them ?",
              "score": 2,
              "created_utc": "2025-12-30 08:11:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwq2lop",
                  "author": "Every_Lake4768",
                  "text": "no not yet ..",
                  "score": 1,
                  "created_utc": "2025-12-30 13:04:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwn59wj",
          "author": "isaaclhy13",
          "text": "Have you tried tracking which directory actually drove those 1k visits and 9 sales? I'm a founder too and hit that same surprise bump where it was unclear which listing mattered most. Consider updating listings regularly so the page keeps giving new angles and signals to share, try small paid experiments on the busiest directories to measure ROI and ad interest, and set up automated discovery plus templated founder-style replies to scale outreach without burning time. If manual replies become a bottleneck I built SignalScouter to find relevant Reddit threads and draft personalized responses you can approve, would love feedback or to connect if you try it, could help solve tracking which listing caused the spike, good luck with the directory wave.",
          "score": 1,
          "created_utc": "2025-12-30 00:25:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwp4uz0",
              "author": "Hefty-Airport2454",
              "text": "The big visibility came from a post I made not directories.\n\nI saw the visits with trustviews (not coming from here but as it tracks visits I saw it here).\n\nIs your audience/ICP founders ? Because that's the audience of directories.\n\nGive the link of your signalscouter so I find the correct one ahah",
              "score": 1,
              "created_utc": "2025-12-30 08:13:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pvg3mv",
      "title": "How do I reach my target audience with a small marketing budget? (India)",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1pvg3mv/how_do_i_reach_my_target_audience_with_a_small/",
      "author": "TatyaBichuu0",
      "created_utc": "2025-12-25 15:50:57",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I’m building an early-stage startup called Chefyy.\nWe provide monthly home cooks for working professionals and families who want reliable, quality help at home.\nSo far, all the customers we’ve gotten are through organic reach.\n\nOne thing we’re noticing clearly:\nMost inbound queries right now are from people looking for the cheapest possible option  “yahan itne mein ho jaata hai” kind of requests.\nSome customers are absolutely fine with fair pricing and understand the effort involved, but a large chunk isn’t our real target audience\n\nWe haven’t spent anything on ads or marketing yet.\nNow we want to reach our actual target audience:\nworking professionals\nbusy households\npeople who value reliability and are okay paying for quality\nWe finally have a small marketing budget (₹2k–₹3k) and I want to use it smartly.\nI’d really appreciate advice from people who’ve done this before:\nWhat kind of marketing worked for you at an early stage?\nWhere should we spend first  online, offline, communities, something else?\nAnything we should clearly avoid wasting money on?\nLooking for practical, ground-level ideas,",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1pvg3mv/how_do_i_reach_my_target_audience_with_a_small/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nvzd7qy",
          "author": "ChestChance6126",
          "text": "With a budget that small, the goal is filtering, not scale. Ads that optimize for the cheapest clicks will keep pulling in price shoppers, especially in services. I’d focus on channels where intent and context do the pre-qualification for you. Apartment societies, gated communities, local WhatsApp or Telegram groups, and referrals through existing customers tend to surface people who value reliability over price.\n\nOnline, very tight geo-targeted ads with copy that clearly signals “reliable, vetted, not cheapest” can help, even if volume is low. What I’d avoid is broad awareness ads or discounts. Those usually train the wrong audience. Early on, clarity beats reach. Make it obvious who you are not for, and the right customers start self-selecting.",
          "score": 2,
          "created_utc": "2025-12-26 05:35:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvzco6",
          "author": "BakerTheOptionMaker",
          "text": "I have tons of Indian traffic on my site accidentally due to having the same name as an Indian social media Viral lol … search and my site Virlo comes above it\n\nSo that’s one way to get Indian traffic 😂",
          "score": 1,
          "created_utc": "2025-12-25 16:28:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvwlls5",
          "author": "BusinessStrategist",
          "text": "Make sure to mention that the cost is a only ___________ units of currency. That will silence a lot of marketing noise.",
          "score": 1,
          "created_utc": "2025-12-25 18:39:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw1f116",
          "author": "Majestic_Hornet_4194",
          "text": "Spend your small budget on hyper-targeted Facebook or Instagram ads focusing on busy professionals in your city with interests like working moms or office workers. Also try local WhatsApp groups or community forums where your audience hangs out. Avoid broad ads or discounts that attract bargain hunters who aren’t your real customers.",
          "score": 1,
          "created_utc": "2025-12-26 15:54:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw5f1pr",
              "author": "praveenraj87",
              "text": "How do you reach WhatsApp groups? It's closed and only meant for people in the circle. Please help me out. I am also looking out for these ideas.",
              "score": 1,
              "created_utc": "2025-12-27 06:09:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pw6e7q",
      "title": "Product Manager with 3 yrs experience, strong KPIs, but no job callbacks — founders/PMs, need career advice",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1pw6e7q/product_manager_with_3_yrs_experience_strong_kpis/",
      "author": "Embarrassed_Vast_886",
      "created_utc": "2025-12-26 15:06:54",
      "score": 4,
      "num_comments": 7,
      "upvote_ratio": 0.84,
      "text": "Hi all,  \n  \nI’m a Junior Product Manager with 3+ years of experience in SaaS/startups. I know the tools, have problem solving mindset, and have a proven record of improving KPIs.  \n  \nDespite this, I’m getting no interview callbacks, which is confusing and honestly frustrating.  \n  \nLooking for advice, especially from Startup founders and hiring PMs:  \n  \n\\- How do you evaluate PMs while hiring?  \n\\- Is this a resume/portfolio/branding issue?  \n\\- Should I prioritize networking & cold outreach over job boards?  \n\\- What makes you say, “Yes, let’s talk” to a PM profile?  \n  \nAny honest feedback is appreciated. 🙌\n\nThanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1pw6e7q/product_manager_with_3_yrs_experience_strong_kpis/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nw1lsqm",
          "author": "WorkLoopie",
          "text": "It’s a tough market right now. So don’t give up!\n\nI’d recommend connecting with smaller companies. Just connect with founders on LinkedIn in the industry. Also look at partner eco systems.",
          "score": 3,
          "created_utc": "2025-12-26 16:30:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw22yug",
          "author": "UprightGroup",
          "text": "I'm assuming you're in the US. You should branch out and see if companies in Canada or somewhere in Europe are hiring.",
          "score": 2,
          "created_utc": "2025-12-26 18:01:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw2mia0",
          "author": "BusinessStrategist",
          "text": "Could you expand on the « proven record of improving KPIs? »",
          "score": 2,
          "created_utc": "2025-12-26 19:43:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw28uh5",
          "author": "Key_Photograph_2510",
          "text": "Build something",
          "score": 1,
          "created_utc": "2025-12-26 18:31:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw3nayp",
          "author": "nickakio",
          "text": "Networking for sure. Happy to take a look at your resume and provide tips if you’d like!\n\nIf you didn’t work for a really well known brand, detailing the products you worked on and performance KPIs are crucial on resume and portfolio.",
          "score": 1,
          "created_utc": "2025-12-26 23:07:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw79e09",
          "author": "Ryan_9233",
          "text": "resumes convert better when results are quantified so add metrics and outcomes ScraperCity with the google maps scraper helps gather networking leads and reach the right people faster.",
          "score": 1,
          "created_utc": "2025-12-27 15:20:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwj43rf",
          "author": "YS_askOdin",
          "text": "Without seeing your actual resume, I can't be certain, but I see a specific pattern in almost every 'Junior PM' application I reject.\n\nIt is usually a **Narrative Mismatch.**\n\nMost Junior PM resumes list **'Activities'** (Ran sprints, managed backlog, conducted user interviews).  \nFounders don't care about activities. We care about **'Commercial Physics.'**\n\n**The Fix: Audit your bullet points.**\n\n* **Bad:** 'Managed the roadmap for the mobile app team.' (This is just doing your job).\n* **Good:** 'Prioritized mobile checkout flow optimization, reducing cart abandonment by 15% and adding $20k ARR.' (This is Business Value).\n\n**The 'Founder Filter' Test:**  \nI hire PMs to bring discipline to the vision. When I scan a PM resume, I look for one specific thing: **Can this person say 'No'?**\n\n* If your resume is just a list of features you shipped, I assume you are a 'Feature Factory' manager.\n* If you tell me about a feature you killed because the unit economics didn't make sense, or a pivot you drove based on data, I will call you immediately.\n\nStop selling your ability to use Jira. Start selling your ability to protect engineering resources and drive revenue.",
          "score": 1,
          "created_utc": "2025-12-29 11:45:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1puytzr",
      "title": "Growth_Hacking_101",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1puytzr/growth_hacking_101/",
      "author": "Adventurous_Safe_586",
      "created_utc": "2025-12-24 22:20:10",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 0.81,
      "text": "We are a bootstrapped B2C SaaS company and are trying hard to acquired customers. However, feels like we need to spend a lot of $ to get views or users. Can someone share any 101 advice for us to reach users in Reddit ?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1puytzr/growth_hacking_101/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nvsiz7l",
          "author": "SuspiciousTruth1602",
          "text": "Its a common struggle when youre starting out and every dollar counts. What worked for me with my first app was diving deep into relevant Reddit communities. I found that just showing up whenever there was a thread that related to my app and contributing to the conversation (pitching it only when it made sense otherwise steering the conversation towards it) helped me gain initial users.\n\n  \nIt eventually led my app to rank on GPT search for some queries because Reddit was used as a source. The downside It was incredibly time consuming I would literally F5 search constantly most days I wouldnt even be able to go through all the notifications.\n\n  \nI actually built an internal tool to solve this for myself which has now become my main project. It automatically finds relevant conversations across Reddit X and LinkedIn. Its what brought me here. It lets you engage with your target audience directly and Reddits great because users there are often deep into their niches.\n\n  \nIf you think that kind of thing could help you scale your SaaS Im happy to let you try it out.",
          "score": 2,
          "created_utc": "2025-12-24 23:11:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwc17v1",
              "author": "TicketExpensive1948",
              "text": "I would be intrestead in this tool if you could share",
              "score": 1,
              "created_utc": "2025-12-28 08:25:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwc7ugq",
                  "author": "SuspiciousTruth1602",
                  "text": "Yea sure, its [https://crowdwatch.tech](https://crowdwatch.tech)\n\nFeel free to reach out if you need any help!",
                  "score": 1,
                  "created_utc": "2025-12-28 09:29:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvuu5pv",
          "author": "DrMcBurn01",
          "text": "i'd start with niche subreddits where your target audience hangs out, like this one. share genuine advice in discussions, not just promo. for example, i used to manually comment on relevant posts, which brought some early users. now i use beno one to automate that process.",
          "score": 1,
          "created_utc": "2025-12-25 11:14:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvbyyh",
          "author": "Emotional-Ladder-860",
          "text": "I heard of commenters saying parsestream to get customers from reddit. Haven't tried it though",
          "score": 1,
          "created_utc": "2025-12-25 13:54:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvg7ez",
          "author": "Sudden-Context-4719",
          "text": "If you want to reach users on Reddit without spending much, focus on joining relevant subreddits and genuinely engaging with posts before dropping anything about your product.",
          "score": 1,
          "created_utc": "2025-12-25 14:25:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvzb510",
          "author": "LegalWait6057",
          "text": "Honestly Reddit works best when you treat it like a research channel first. Spend time watching how people describe their problems and the words they use. Then shape your product messaging and posts around that language. Even if you get zero users at first, you come away with much sharper positioning and that pays off everywhere else later.",
          "score": 1,
          "created_utc": "2025-12-26 05:17:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pupnlw",
      "title": "Honest question: Is X organic growth dead for 0-follower accounts?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1pupnlw/honest_question_is_x_organic_growth_dead_for/",
      "author": "WatermelonWOseeds",
      "created_utc": "2025-12-24 15:16:22",
      "score": 3,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "Trying to figure out the actual meta for growing a fresh account right now because the advice is all over the place.\n\nBuy the checkmark just for the reply boost and spend all day commenting on big threads.\n\n**O**r Don't bother with the sub yet, just use that budget to pay established accounts in the niche for RTs/Quotes to bypass the algo entirely. (Heard people do this, idk if it's true)\n\nFor those running accounts right now: Does the \"Reply Boost\" from Premium actually move the needle if you have zero existing followers? Or is the only way to break the noise actually just renting someone else's audience?\n\n(Also, is it just me or are hashtags completely useless now? Feels like nobody uses them anymore.)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1pupnlw/honest_question_is_x_organic_growth_dead_for/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nvqcjer",
          "author": "samc_marketing",
          "text": "I just started mine a couple of days ago, and now I get about 2-3 new followers per day. It's very slow honestly. The reply boost does help to some extent as I get a lot of people reacting and replying to my comments. It seems to me that X is prioritizing the accounts that have already established. We'll have to see how it goes. Many people say getting to the 100 followers is the hardest part, but once you reach 100 and 1k, it'll be easier as your posts will automatically be seen faster, therefore more impressions + engagements which prompts the algorithm to show your posts more.",
          "score": 2,
          "created_utc": "2025-12-24 15:42:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw12ul8",
              "author": "WatermelonWOseeds",
              "text": "2-3 followers per day with premium? How many posts and replies are you doing daily? and about what",
              "score": 1,
              "created_utc": "2025-12-26 14:44:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvqhpv8",
          "author": "ayowarya",
          "text": "generally I would do follow unfollow for the first 1000 followers but elon seems to have limited it to 14 people every 20 minutes or so, which makes things tougher...\n\ndoes the reply boost move the needle at all? yes actually, quite a lot if you're replying early to big creators and you get some engagement (a funny reply etc), however, getting no engagement will harm you\n\nif you look through elons recent posts, he will make the algo 100% opensource soon, it's currently somewhat opensource but a few months behind\n\nby now the algo should be 100% controlled by grok",
          "score": 2,
          "created_utc": "2025-12-24 16:09:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvqq5ye",
          "author": "SuspiciousTruth1602",
          "text": "Honestly organic growth on X is tough these days, especially starting from scratch.\n\n  \nI launched an app a while back and X was basically a ghost town for me, even with hashtags and trying to engage. What did work surprisingly well was Reddit. The problem was finding the right subreddits and threads and constantly refreshing to see if anything relevant popped up it was a time sink.\n\n  \nPaying established accounts for RTs/quotes might give you a temporary boost but it feels kinda artificial doesnt give you the chance to build a community which is super important imo\n\n  \nI ended up building a tool for myself that scans Reddit X and even LinkedIn for relevant conversations and alerts me when something pops up where I can actually add value and potentially find interested customers. I started it as an internal tool but now its what Im working on full time.\n\n  \nCould help you find those conversations organically without spending all day scrolling and refreshing. If its something that you think could help Id be happy to share it.",
          "score": 2,
          "created_utc": "2025-12-24 16:54:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw13bay",
              "author": "WatermelonWOseeds",
              "text": "I agree there are downsides of artificially boosting account, as people can always unfollow if you're posting poor content. I am interesting the tool you build. Would you mind sharing what tech stack did you use to build it?",
              "score": 1,
              "created_utc": "2025-12-26 14:47:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw3ghds",
                  "author": "SuspiciousTruth1602",
                  "text": "Yea sure, I am a 9 YOE backend dev, and we are a team of 3 with similar experience, all with a pretty prestigious path (not trying to hype it up, just trying to say what we did isnt simple) \n\nThat said, tech stack is as simple as it gets.  \nPython, mongodb, RMQ, nextjs/react, microservice architecture, got one node service and one GOlang service, both outliers are due to a specific technical requirement for their implementation.",
                  "score": 2,
                  "created_utc": "2025-12-26 22:27:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvvs0h2",
          "author": "GDbuildsGD",
          "text": "reddit over twitter if you dont already have a big following.\n\ncheckmark kinda works, but doesn't do wonders itself. but if you can afford it, maybe you could try for a few months.",
          "score": 2,
          "created_utc": "2025-12-25 15:43:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw0s5tl",
              "author": "WatermelonWOseeds",
              "text": "Okay. I'll see how it spans out for few months",
              "score": 2,
              "created_utc": "2025-12-26 13:34:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvvsl1e",
          "author": "MoonTownie69",
          "text": "It's pretty tough and feels like a full time job to be a reply-guy. I made a few connections with accounts in my same shoes a few months back (<100 followers), and I saw how religiously a couple of these accounts replied. One of them now has >1k followers (with checkmark). So it definitely works.\n\n  \nMe on the other hand... I do have the checkmark but have been way busier with my actual projects to dedicate that much time to replying - because it does have to be meaningful replies too. I'm finally over 100 followers but I'm not really prioritizing my X growth atm.",
          "score": 2,
          "created_utc": "2025-12-25 15:47:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvt483",
          "author": "Longjumping_Leg3517",
          "text": "Reply boost from Premium doesn’t really help much if you have zero followers, it’s like shouting in an empty room. Renting audience via RTs or quotes is way more effective to get some real eyes on your content fast. Also hashtags are mostly dead unless you use super niche ones.",
          "score": 2,
          "created_utc": "2025-12-25 15:50:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvzffqj",
          "author": "Slight_Tutor1790",
          "text": "Feels like the bigger issue is expectations. X seems less like a place to grow from zero and more like a place to amplify once something already resonates elsewhere. If nobody knows you yet, the algorithm has nothing to learn from. Using other channels to validate ideas and pull a small core audience first might make X feel less dead, because then replies and posts start with some signal instead of pure noise.",
          "score": 2,
          "created_utc": "2025-12-26 05:54:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwofjmy",
          "author": "Accurate-Ad-7944",
          "text": "Honestly it’s brutal starting from zero now. I tried the comment grind with premium for a bit and yeah, the reply boost helps you get seen, but it still feels like shouting into a void if no one follows you back.\n\nWhat finally moved the needle for me was using Reputation-Zilla to get that initial follower spike just so the account doesn’t look dead and then focusing on engaging in comments. Hashtags are pretty useless unless it’s a meme trend.",
          "score": 1,
          "created_utc": "2025-12-30 04:48:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzjgof",
      "title": "Our company is ranking on chatgpt, claude and grok, here's what we updated",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1pzjgof/our_company_is_ranking_on_chatgpt_claude_and_grok/",
      "author": "Frequent-Relation-64",
      "created_utc": "2025-12-30 14:27:01",
      "score": 0,
      "num_comments": 1,
      "upvote_ratio": 0.5,
      "text": "not sure if this'll help anyone but figured i'd share.\n\nso a few months back, we noticed something weird clients suddenly started saying:\n\n\"i found you guys on chatgpt, Grok suggested me, AI recommended me\"\n\nand that's when it clicked.\n\nOur team then updated our calendar page with AI option 2 months ago, and we were shocked to see 30% of the people who scheduled a meeting put \"AI recommended\" option.\n\nAI search is the new SEO, we at [u/offshorewolf](https://www.reddit.com/user/offshorewolf/)  Wolf gave it a fancy name, we call it LMO - Language Model Optimization, nobody's talking about it yet, so just wanted to share what we changed to rank.\n\nhere's how we started ranking across all the big LLMs: chatgpt, claude, grok\n\n\\#1 We started contributing on communities\n\nEvery like, comment, share, links to our website increased the number of meetings we get from AI SEO,\n\nso we heavily started contributing on platforms like quora, reddit, medium and the result? Way more organic meetings - all for free.\n\n\\#2 We wrote content like we were talking to AI\n\n* clear descriptions of what we do\n* mentioned our brand + keywords in natural language\n* added tons of Q&A-style content (like FAQs, but smarter)\n* gave context LLMs can latch onto: who we help, what we solve, how we're different\n\n\\#3 we posted content designed for AI memory\n\nwe used to post for humans scrolling. now we post for AI\n\nstuff like:\n\n* Reddit posts that mention our brand + niche keywords (this post helps AI too)\n* Twitter threads with full company name + positioning\n* guest posts on forums and blogs that ChatGPT scans\n\nwe planted seeds across the internet so LLMs could connect the dots.\n\n\\#4 we answered questions before people even asked them\n\non our site and socials, we added things like:\n\n* \"What companies provide VAs for under $500 a month?\"\n* \"How much do VAs cost in 2025?\"\n* \"Who are the top remote hiring platforms?\"\n\nturns oout, when enough people see that kind of language, AI starts using it too.\n\n\\#5. we stopped chasing google, we started building trust with LLMs\n\nour Marketing Manager says,Google SEO will be cooked in 5-10 years\n\nits crazy to see chatgpt usage growth, in the past 1/2 years, there's some people who now use chatgpt for everything, like a personal advisor or assistant\n\nto rank, we created:\n\n* comparison tables\n* real testimonials (worded like natural convos)\n* super clear \"who we're for / who we're not for\" copy\n\nLLMs love clarity.\n\ntl,dr\n\nWe stopped writing for Google. We started writing for GPTs.\n\nNow when someone asks:\n\n\"Who's the best VA company under $500/month full time?\"\n\nWe come up 50% of the time.\n\nWe have asked our team members in Ukraine, Philippines, India, Nepal to try searching, with cookies disabled, VPN, and from new browsers, we come up,\n\nThank you for staying till the end.\n\nHappy to make a part 2 including a LMO content calendar that we use at our company.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1pzjgof/our_company_is_ranking_on_chatgpt_claude_and_grok/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nwwf8xw",
          "author": "christosis",
          "text": "Content is still king",
          "score": 1,
          "created_utc": "2025-12-31 11:48:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}