{
  "metadata": {
    "last_updated": "2026-03-01 03:29:57",
    "time_filter": "week",
    "subreddit": "GrowthHacking",
    "total_items": 20,
    "total_comments": 149,
    "file_size_bytes": 160688
  },
  "items": [
    {
      "id": "1rdrcby",
      "title": "I built a tool that finds local businesses with bad websites (Need feedback)",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rdrcby/i_built_a_tool_that_finds_local_businesses_with/",
      "author": "salaryscript",
      "created_utc": "2026-02-24 20:16:23",
      "score": 65,
      "num_comments": 9,
      "upvote_ratio": 0.99,
      "text": "Hey everyone\n\nI've been working on a tool called [LeadsByLocation](https://leadsbylocation.com) and I'm looking for honest feedback from people who actually do client outreach to local businesses.\n\nThe problem it solves: if you sell web design, SEO, or any digital service to local businesses, you know how tedious prospecting is. Browsing Google Maps, clicking through listings one by one, checking if they have a website, testing how bad it is, copying contact info into a spreadsheet. It takes hours before you have anyone worth calling.\n\nLeadsByLocation lets you search a keyword and city (like \"plumber in Denver\") and instantly pulls up a list of businesses with their ratings, reviews, contact info, and the part I think is most useful — a website performance score with specific reasons like \"no SSL, 6 second load time, not mobile friendly.\" So you're not just getting a list of names, you're getting a built-in pitch angle for each one.\n\nI'm giving out a  free Solo plan for a full month COUPON to anyone who wants to try it. No credit card, no strings. All I'm asking for is real feedback, what's useful, what's confusing, what's missing.\n\nCOUPON: BETATEST\n\nYou can sign up the page and pick the solo plan, input your promo code and you should have the solo plan 100% free.\n\nNote: this is limited to only 30 people\n\nHappy to answer any questions here too.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rdrcby/i_built_a_tool_that_finds_local_businesses_with/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o777wua",
          "author": "Wooden-Term-1102",
          "text": "This actually solves a real pain. Prospecting local businesses takes way too much time and having clear website issues upfront makes outreach easier. Curious how accurate the performance scores are and how often the data refreshes. Happy to test and share feedback.\n\n",
          "score": 3,
          "created_utc": "2026-02-24 20:19:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77ar72",
              "author": "salaryscript",
              "text": "there is a button for you to re-run the score for each business. The performance scores are quite accurate, we do our own in house testing and compare it with google to ensure the accuracy is there",
              "score": 1,
              "created_utc": "2026-02-24 20:33:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o79zwlc",
          "author": "stovetopmuse",
          "text": "Cool concept. I’ve done the “Google Maps + 47 tabs + messy spreadsheet” grind and it’s brutal.\n\nBig question for me is data accuracy. How fresh are the site checks and performance scores? If I call someone out on a 6s load time and they fixed it last week, that kills credibility fast.\n\nAlso curious how you handle niches where a simple site is intentional, like solo contractors who don’t care about SEO. Do you filter by signals that suggest they actually value inbound?",
          "score": 2,
          "created_utc": "2026-02-25 05:28:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bb89q",
              "author": "salaryscript",
              "text": "there is a button for you to re-run the score for each business. The performance scores are quite accurate, we do our own in house testing and compare it with google to ensure the accuracy is there\n\nas for your second question:  \nreview count and rating are your best filters for this right now. A plumber with 200 reviews and a terrible website clearly cares about their reputation and has real customers, they just haven't invested in their site yet. That's a great lead. A solo contractor with 3 reviews and no website is probably living off referrals and won't care about your pitch. You can filter by min reviews to focus on businesses that are actually active and engaged online. That said, adding more intent signals (Google Ads presence, claimed GMB profile, posting frequency) is definitely on the roadmap",
              "score": 2,
              "created_utc": "2026-02-25 12:18:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7w1wrh",
          "author": "jack-does-tech",
          "text": "Very nice, I think this does fill a strong need and the value proposition is definitely there. A small note here is that in my area quite a lot of businesses - especially restaurants - list their facebook pages as websites, but the app still shows a score for that, and then builds the outreach recommendations based on wrong assumptions. Would be cool to add detection to see if it's actually a website or if it's a social media page, as that changes outreach strategy and customer profile (i.e shit website means they at least care a little because they had it made, a social media page means you'd likely need to also sell \\*why\\* having a website is important in the first place, and \\*how\\* it would drive up their business.",
          "score": 2,
          "created_utc": "2026-02-28 15:13:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbm0ct",
      "title": "I tracked every single thing i did for my business for 30 days. 80% of it was completely useless.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rbm0ct/i_tracked_every_single_thing_i_did_for_my/",
      "author": "Crescitaly",
      "created_utc": "2026-02-22 13:35:15",
      "score": 50,
      "num_comments": 34,
      "upvote_ratio": 0.98,
      "text": "Im gonna be honest this experiment humbled me.\n\n\n\nI run a small online business. Been at it for a few years now. Things are going okay, growing steadily, but i always had this nagging feeling that im busy but not productive. Like im running on a treadmill.\n\n\n\nSo last month i decided to track literally everything. Every task, every hour, every \"quick check\" on analytics, every time i opened instagram to \"monitor engagement,\" every email i wrote, every call i took. All of it. I used a simple spreadsheet, nothing fancy. Just timestamp, what i did, and how long it took.\n\n\n\nAfter 30 days i sat down and categorized everything into three buckets:\n\n\n\n1. Revenue generating - things that directly led to money coming in\n\n2. Foundation building - things that dont make money today but build something for tomorrow (systems, relationships, content)\n\n3. Busywork - everything else\n\n\n\nThe results were honestly embarrassing.\n\n\n\nOut of roughly 240 working hours that month:\n\n\n\n\\- Revenue generating activities: about 28 hours (12%)\n\n\\- Foundation building: about 20 hours (8%)\n\n\\- Busywork: about 192 hours (80%)\n\n\n\nEighty percent. I spent 80% of my time on stuff that didnt matter.\n\n\n\nThe biggest time killers:\n\n\n\n\\- Checking analytics dashboards multiple times a day when nothing was going to change between checks. This alone was eating 1-2 hours daily.\n\n\\- Responding to emails that didnt need a response or could have waited.\n\n\\- \"Researching\" competitors which was really just scrolling their social media.\n\n\\- Redesigning things that were already working fine because i got bored of how they looked.\n\n\\- Attending networking calls that went nowhere.\n\n\n\nThe 20% that actually moved the needle:\n\n\n\n\\- Direct outreach to potential partners and clients\n\n\\- Creating actual content (not planning content, not researching content, actually making it)\n\n\\- Improving the parts of my funnel where people were dropping off\n\n\\- Having real conversations with existing customers about what they needed\n\n\n\nAfter seeing this data i restructured my entire week. Now i block the first 4 hours of every day exclusively for revenue generating or foundation building work. No email, no analytics, no social media. Those things get a 1 hour window in the afternoon.\n\n\n\nIts been 3 weeks since i made the switch. Revenue is up about 15% and i actually feel like i have more free time even though im technically working the same hours.\n\n\n\nThe uncomfortable truth is most of us are addicted to feeling busy because it feels like progress. But activity is not achievement.\n\n\n\nAnyone else done something similar? Curious what other peoples ratios look like. I have a feeling 80/20 busywork might actually be generous compared to some people.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rbm0ct/i_tracked_every_single_thing_i_did_for_my/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6rtcly",
          "author": "Confident_Box_4545",
          "text": "80 percent busywork isn’t surprising. Most small online businesses have the same problem.\n\nThe part that stood out to me wasn’t the analytics checking or the emails. It was that only 28 hours were directly tied to money. That’s basically one week out of a month actually pushing revenue.\n\nIf someone forced you to only work 2 hours a day, you’d immediately cut 90 percent of that busywork without thinking. That’s usually the test I use. If I had to make money in 14 days or I’m broke, what do I do? It’s never redesigning a landing page.\n\nAlso worth tracking next month: which specific revenue actions actually closed. Not all outreach is equal. Not all content is equal. You might find 10 of those 28 hours did almost all the lifting.\n\nMost people don’t have a time problem. They have a courage problem. Revenue work feels exposed. Busywork feels safe.",
          "score": 7,
          "created_utc": "2026-02-22 14:02:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rum8h",
              "author": "Crescitaly",
              "text": "The \"if you could only work 2 hours\" test is brilliant and i wish i had thought of it before spending 30 days tracking everything. You're right that it immediately cuts through the noise. And that last line hit hard - its absolutely a courage problem. Revenue work means putting yourself out there, getting rejected, having hard conversations. Busywork is safe because nobody can judge your email response time. Im planning to track which specific revenue actions closed deals next month, exactly like you suggested. Curious to see if the 80/20 applies within that 28 hours too.",
              "score": 5,
              "created_utc": "2026-02-22 14:10:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6rv2fh",
                  "author": "Confident_Box_4545",
                  "text": "When you track which actions close, also track the emotional resistance before doing them. You’ll probably notice the highest revenue tasks are the ones you procrastinate on the most.\n\nIf 5 of those 28 hours drive most of the money, your real job isn’t time management. It’s protecting those hours like your business depends on it. Because it does.",
                  "score": 2,
                  "created_utc": "2026-02-22 14:12:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6rskkr",
          "author": "Actonace",
          "text": "This is such a powerful reminder that tracking exposes the truth, what gets measured get optimized and most growth comes from ruthlessly protecting the small % that actually drive revenues. ",
          "score": 3,
          "created_utc": "2026-02-22 13:58:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ru1kc",
              "author": "Crescitaly",
              "text": "100%. The protecting part is what i keep coming back to. Its so easy to let busywork creep into those revenue hours because it feels urgent. Like someone emails you during your focused selling time and you think \"let me just quickly respond\" - 45 minutes later youre down a rabbit hole. Now i literally block my calendar for revenue work and treat it like a meeting i cant cancel.",
              "score": 4,
              "created_utc": "2026-02-22 14:06:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6rstq8",
          "author": "trainmindfully",
          "text": "this is painfully relatable, especially the research that’s really just sophisticated procrastination. i did a lighter version of this last year and realized most of my day was reacting instead of initiating, which felt productive but wasn’t.\n\nblocking the first few hours for actual needle movers is such a simple shift but it changes everything. my busywork ratio was probably worse than 80 percent if i’m honest, so props for actually facing the data instead of just feeling guilty about it.",
          "score": 2,
          "created_utc": "2026-02-22 13:59:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ru7fq",
              "author": "Crescitaly",
              "text": "\"Sophisticated procrastination\" is the perfect way to describe it honestly. Thats going in my vocabulary now. The reacting vs initiating distinction is huge too. Most of my busywork was reactive - responding to things that felt important in the moment but werent moving anything forward. The tracking forced me to see that pattern. Uncomfortable but necessary.",
              "score": 1,
              "created_utc": "2026-02-22 14:07:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6vb3qz",
          "author": "Dependent_Slide4675",
          "text": "The real pareto principle 😂 \n20% of your work did lead to 80% of your results.\nIt's courageous of you to auto-analyse your work day",
          "score": 2,
          "created_utc": "2026-02-23 00:29:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rowce",
          "author": "Crescitaly",
          "text": "For anyone curious about the actual tracking method - i literally just made 3 columns in google sheets: time, task, duration. Every time i switched tasks i logged it. The annoying part was the first 3-4 days where you keep forgetting to log stuff. After that it becomes second nature.\n\n\n\nThe hardest part was being honest with myself. When i wrote \"competitor research\" i had to ask... was i actually learning something actionable or was i just doomscrolling their instagram and calling it work? 90% of the time it was the latter.",
          "score": 1,
          "created_utc": "2026-02-22 13:36:43",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o6rozgu",
          "author": "Crescitaly",
          "text": "One thing i should have mentioned in the post - the analytics addiction was the worst offender. I was checking google analytics, social media insights, and email stats probably 8-10 times a day. The data barely changes in a day. Now i check once in the morning and once before wrapping up. Thats it. Freed up probably 8-10 hours a week just from that one change alone.",
          "score": 1,
          "created_utc": "2026-02-22 13:37:14",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o6s28o6",
          "author": "RobertLigthart",
          "text": "the analytics checking thing is so real. I used to open GA like 6 times a day and the numbers literally never changed between checks... just a dopamine loop disguised as work",
          "score": 1,
          "created_utc": "2026-02-22 14:51:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6sdadi",
          "author": "HearthString",
          "text": "I love this experiment because that 80 20 realization is brutal but so necessary. I fell into the exact same trap of spending hours checking analytics and doing manual email follow ups instead of actually building my business. What really helped me flip that ratio was leaning into automation. I have been really impressed prompting ActiveCampaigns AI to suggest and create my automation workflows and pull reporting insights lately. It basically handles that whole busywork bucket for me. Instead of manually digging through data or typing out routine emails the AI handles the plumbing in the background. It makes the marketing run so much smoother and frees up my time to focus strictly on the revenue generating stuff. Have you thought about automating those funnel drop offs you mentioned?",
          "score": 1,
          "created_utc": "2026-02-22 15:46:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6shyr5",
          "author": "adjei7",
          "text": "First of all, thanks for the post! Really insightful! But...\n\n\"Researching\" competitors\n\nAnd\n\nAttending networking calls that\nwent nowhere\n\n... are not busy work. You never know where networking calls go. You have to plan in that some will be a waste, but attending all is important. It only takes one to make a huge difference. \n\nAlso keeping tabs on competition helps keep you on the know.",
          "score": 1,
          "created_utc": "2026-02-22 16:06:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x4ot4",
              "author": "Crescitaly",
              "text": "Fair pushback and you're right that i probably oversimplified those two. Networking absolutely has value - some of my best partnerships came from random calls. The issue was more about the RATIO. I was taking 3-4 networking calls a week with zero criteria for who i talked to. Now i'm way more selective - i only take calls where there's a clear mutual benefit or the person is in my exact niche. Quality over quantity.\n\n\n\nSame with competitor research. Keeping tabs is important but there's a difference between spending 20 minutes reading their latest blog post vs spending 2 hours scrolling their instagram stories. The latter was what i was actually doing most of the time.",
              "score": 2,
              "created_utc": "2026-02-23 08:20:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6sv7s0",
          "author": "Hecker8778",
          "text": "Dude, this is the ultimate reality check. The addiction to feeling busy is the exact same developer trap that keeps founders endlessly tweaking their architecture instead of actually shipping.\n\nWhen you are deep in the weeds deploying a project like SupyMem, it is dangerously easy to spend eighty percent of your time refreshing GCP logs or redesigning a dashboard instead of directly talking to users and validating the pain point. Activity is not achievement.\n\nTo permanently kill that busywork, you have to offload the repetitive foundation building. Since Runable is fully capable of creating full websites and not just running background workflows, you could use it to automatically spin up, host, and test new landing pages for your funnel. That completely removes the technical friction and frees up your core hours strictly for revenue-generating outreach.",
          "score": 1,
          "created_utc": "2026-02-22 17:05:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6swoh9",
          "author": "Confident-Tank-899",
          "text": "lol same pain - tracked for 45 days, 78% waste on low roi like ad creative tweaks when real wins were in sql outreach. axed ig/fb for b2b, went all-in cold linkedin + productled. cac dropped 40%, focus laser sharp now. dead channels kill momentum. biggest cut u made?\n\n",
          "score": 1,
          "created_utc": "2026-02-22 17:12:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x4rm3",
              "author": "Crescitaly",
              "text": "45 days and 78% waste - yeah that tracks with my numbers. Love that you went all-in on the channel that was actually working instead of trying to optimize everything. The biggest cut for me was the analytics checking. Sounds small but when you add up 1-2 hours a day of refreshing dashboards, it's basically a full work week per month doing nothing. After that it was the networking calls - went from 3-4 unfocused ones per week to 1 targeted call. The CAC drop you saw from going cold linkedin + product-led is impressive. That's the move for B2B.",
              "score": 1,
              "created_utc": "2026-02-23 08:21:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6tk6h5",
          "author": "Electrical_Chard3255",
          "text": "Interesting idea, I knocked up an app based on your example test, can only upload one image so made a collage of some of the pages \n\nI guess there are already apps out there that will do this, but I like playing around with ideas\n\nhttps://preview.redd.it/it5p9qhpf3lg1.png?width=2772&format=png&auto=webp&s=ce0ee4d3737882e1c2c4a9267f7d18980878e664\n\n",
          "score": 1,
          "created_utc": "2026-02-22 19:00:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tnwm2",
          "author": "Lonely_Mark_8719",
          "text": "true tbh...",
          "score": 1,
          "created_utc": "2026-02-22 19:18:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6uhw39",
          "author": "_SeaCat_",
          "text": "Not everything can be tracked in just 30 days. Many things like SEO will paid off much later.",
          "score": 1,
          "created_utc": "2026-02-22 21:49:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x4uyk",
              "author": "Crescitaly",
              "text": "Good point. SEO is exactly the kind of thing that falls into my \"foundation building\" bucket - you won't see ROI in 30 days but it compounds massively over 6-12 months. That category only got 20 hours in my tracking which is another problem. I was so busy with busywork that even the long-term investments were getting neglected. The 30-day window was really about identifying what to STOP doing more than what to start.",
              "score": 2,
              "created_utc": "2026-02-23 08:22:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6x1nyk",
          "author": "Snaddyxd",
          "text": "this is a great reminder for everyone who wants to drive more sales. dedicated most of your time to what is bringing in the revenue ",
          "score": 1,
          "created_utc": "2026-02-23 07:51:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xdplj",
          "author": "wantToMakeItBig",
          "text": "Nice op. Is it possible to share the excel sheet. I want to do something similar and may be come up with a software to help me out",
          "score": 1,
          "created_utc": "2026-02-23 09:50:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o705yk3",
          "author": "WorldlinessEastern12",
          "text": "This is just a nice reminder that while activity may seem useful, only concentrated effort moves company forward",
          "score": 1,
          "created_utc": "2026-02-23 19:24:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o710ssw",
          "author": "Commercial_Orchid358",
          "text": "What tool(s) did you use to gather the data points?\n\nAsking bc I have a tendency to get really into systems but then realize tracking, at least the way I’ve been doing it, turns into a mini project rather than a fluid part of operations.",
          "score": 1,
          "created_utc": "2026-02-23 21:52:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71rqa4",
          "author": "Zain_320",
          "text": "You could juts automate most of the stuff here like a email automation that gives summary of every mail you got and tells you to rely to which one or not. People are using n8n to build automation for their business and saving lots of time and revenue you could just search it up for n8n automation",
          "score": 1,
          "created_utc": "2026-02-24 00:16:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71wibp",
          "author": "idyllagency",
          "text": "That 80% number isn't as unusual as it feels. Most business owners would find something similar if they actually looked. I've been there. When I finally audited my own time, the results were uncomfortable. What changed everything wasn't discipline or better habits. It was automation. Removing the tasks that didn't need me and protecting the hours that did.\n\nWhat you've essentially done is a manual time audit that surfaces exactly what automation is designed to solve. The items on your busywork list, analytics checks, routine email responses, repetitive admin, those aren't just time wasters. They're automation candidates. The reason they ate your time isn't a discipline problem. It's a systems problem.\n\nThe ratio you found is also telling you something about where your real value lives. 28 hours of revenue-generating work produced your current results. What happens when that becomes 50 hours because the other 22 are automated away? Your 15% revenue increase in three weeks came from attention, not more hours. That's the proof of concept. Automation just makes it permanent.",
          "score": 1,
          "created_utc": "2026-02-24 00:42:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79s1ja",
          "author": "SmartBizSteve",
          "text": "This mirrors exactly what I saw managing teams at GM, IBM, and HP over 30 years. The ratio was almost identical at every level — most people confused motion with progress.\n\nThe dashboard checking habit you mentioned is one of the worst offenders. At IBM we had managers who spent 2 hours every morning reviewing dashboards that updated weekly. They were looking at the same numbers they saw yesterday. The fix was simple — set a specific day and time for data review and stick to it. Once a week for most metrics, once a day maximum for anything time-sensitive.\n\nYour three-bucket framework is solid. The one thing I'd add is that the busywork category usually disguises itself as urgent. Emails feel urgent. Tweaking your website feels productive. Reorganising your project board feels like progress. None of it moves revenue.\n\nThe blocking strategy you landed on is what every high-performer I ever managed figured out eventually. Protect your first hours for the work that actually generates money. Everything else fits into whatever time is left. Not the other way around.\n\nYour 80/20 ratio is probably generous. In my experience most people are closer to 90/10 and just don't want to admit it.",
          "score": 1,
          "created_utc": "2026-02-25 04:32:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7aeeme",
          "author": "NoSuspect9845",
          "text": "Respect for actually tracking it instead of guessing.\n\nMost people say they’re busy. Very few prove it.\n\nWhat stands out:\n\n1.  80% busywork doesn’t mean you’re lazy it means modern tools make distraction look like work.\n2. Redesigning things that already work is such a common trap. It feels creative, but it’s usually avoidance.\n3. Talking to real customers and fixing drop-offs being in the top 20% makes total sense. That’s where clarity comes from.\n\nI’d bet most founders wouldn’t like their own spreadsheet if they did this.",
          "score": 1,
          "created_utc": "2026-02-25 07:28:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ddxtl",
          "author": "Strong_Teaching8548",
          "text": "We built something for tracking community conversations and the same pattern shows up constantly, people obsessively monitoring dashboards waiting for some magic number to change, when they should be out actually talking to their audience\n\nyour 80% number tracks with what i've seen. most founders get trapped in the illusion of control, like refreshing metrics gives you agency. it doesn't. the real work is the unglamorous stuff nobody wants to admit takes time: having actual conversations, iterating based on feedback, shipping things that might suck\n\nthe 1-hour email window is smart but in my experience i'd go harder. most business communication doesn't need real-time responses no matter how urgent it feels :)",
          "score": 1,
          "created_utc": "2026-02-25 18:32:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hj3h5",
          "author": "CHIRAGGOWDA",
          "text": "Been there myself. Years ago, I ran an agency and felt just like you - constantly busy but not truly productive. A 30-day tracking marathon changed my operations. We realized our team was drowning in busywork. I identified critical tasks that directly moved the needle. One major shift was prioritizing direct client interactions and cutting down on unnecessary meetings (they were energy vampires). For example, email outreach became a key activity, leading us to adopt Lemlist to make our campaigns more personalized and effective. We saw a noticeable uptick in engagement. My takeaway? Ruthlessly cut out the noise and focus on what's generating real value. It's a tough but necessary discipline to adopt.",
          "score": 1,
          "created_utc": "2026-02-26 09:23:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rckz7f",
      "title": "Made $27K this month with my 7-month-old SaaS, here’s what worked (and what didn’t)",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rckz7f/made_27k_this_month_with_my_7monthold_saas_heres/",
      "author": "RealOrdinary1344",
      "created_utc": "2026-02-23 15:47:59",
      "score": 36,
      "num_comments": 4,
      "upvote_ratio": 0.81,
      "text": "I launched [this tool](https://tryrebelgrowth.com) in August, and we generated approximately 27,000 USD in the last 30 days\n\nHere's what worked\n\nFacebook ads: optimize for Purchase, then obsess over your Conversion API plumbing until your event match quality sits above 6.\n\nIf Meta can’t confidently match the purchase back to a person, your “learning” is basically a blindfold.\n\nGet Pixel + CAPI working with deduping, send the right fields (email, phone, external\\_id), make sure your domain is verified, AEM is set, and your purchase event fires cleanly. Then stop spraying 40 adsets.\n\nConsolidate so you get real volume per adset. If your match score is like a 3, you’re paying extra just to confuse the algo. Fix tracking first, then test creative.\n\nGoogle Ads: bid on competitor terms.\n\nMake a separate campaign for competitor names only. Exact match, tight negatives (like the word free), low daily budget, and a landing page that compares in plain English (pricing, features, who it’s for).\n\nYour goal is to catch high intent people who are already shopping.\n\nWatch CPCs, they can get spicy.\n\nAlso, don’t get cute with trademark stuff in ad copy unless you know the rules. You can win this channel with a tiny campaign if your page doesn’t suck.\n\nSEO: target high buying intent keywords and skip the “what is…” fluff\n\nGo after queries that smell like a credit card: “best”, “pricing”, “alternatives”, “vs”, “review”, “software for”, “tool for”, “agency for”, “near me” (if local).\n\nWrite pages that answer the decision. Put the pricing, the screenshots, the comparison table, the objection handling. Update the page every month or two so it stays fresh.\n\nMost people write SEO content like a school essay. That’s why it ranks for nothing and converts like trash.\n\nWe use our own product for this.\n\nOutreach: keep the message stupid simple, no links, and send a guide after the prospect agrees\n\n\"Hey I built a resource on how we achieve XYZ, want to check it out?\" that's it\n\nThen once they resply, you send the guide where your company is mentioned or the \"hero of the guide\n\nSocial: win the first 2 seconds with a real hook, then borrow distribution from bigger accounts.\n\nMost “content strategy” is just posting into the void. You need hooks that slap, and you need existing attention.\n\nComment on big accounts where your buyers already hang out.\n\nReply fast, be helpful, be a little polarizing, and pull people back to your profile. Remix their topics with your angle. Turn one strong idea into 10 posts across formats. Social rewards gravity. If you’re posting great stuff from a dead account with no interactions, it’s like yelling in the garage.\n\nThat's it, it's better to focus on the 80/20 for each growth channel than trying to do everything perfect\n\nCheers!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rckz7f/made_27k_this_month_with_my_7monthold_saas_heres/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o70xpvx",
          "author": "_SeaCat_",
          "text": "You keep spamming reddit, this is your strategy. ok.",
          "score": 6,
          "created_utc": "2026-02-23 21:37:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zvzx6",
          "author": "Huge_Line4009",
          "text": "Riiigghhtt..",
          "score": 4,
          "created_utc": "2026-02-23 18:38:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70hrpo",
          "author": "dropspaceapp",
          "text": "\"stop spraying 40 adsets\" is the one. consolidation before optimization is counterintuitive but it's why most Meta campaigns burn 60% of budget in week one. what does event match quality look like now after the deduping fix?",
          "score": 1,
          "created_utc": "2026-02-23 20:19:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hpkqa",
          "author": "AnnaGrowthOps",
          "text": "Great breakdown! I especially agree on focusing on proper tracking before testing creatives - so often that’s overlooked. Thanks for sharing your insights!",
          "score": 1,
          "created_utc": "2026-02-26 10:25:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbrdzs",
      "title": "We were wasting hours every week and didn’t realize why",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rbrdzs/we_were_wasting_hours_every_week_and_didnt/",
      "author": "freebie1234",
      "created_utc": "2026-02-22 17:13:14",
      "score": 28,
      "num_comments": 3,
      "upvote_ratio": 0.93,
      "text": "We kept trying to optimize execution and productivity, but something still felt off.\n\nNothing obvious was broken.  \nStill, every week, hours were disappearing.\n\nSo we treated our internal workflow like a growth experiment.\n\n**Hypothesis:**  \nThe real bottleneck wasn’t speed, it was **context loss**.\n\n**What we tested:**  \nWe centralized specs, decisions, and lightweight task notes in **Notion**, and deliberately tested it using their [3-month Business + AI trial](https://affiliate.notion.so/Saas) so we could evaluate it properly before paying.\n\nWe focused on:\n\n* keeping all context in one place\n* using permissions once more than one person was involved\n* using AI summaries instead of rereading long docs and threads\n\n**Result:**  \nNo magic growth spike, but a clear drop in execution friction:\n\n* faster handoffs\n* fewer clarification messages\n* less time spent rebuilding context after interruptions\n\nThe trial period mattered because it let us test this with real workflows instead of guessing from demos.\n\nCurious if others here have experimented with internal tooling the same way.  \nWhat internal change had the highest leverage for your team?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rbrdzs/we_were_wasting_hours_every_week_and_didnt/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6tojyl",
          "author": "Lonely_Mark_8719",
          "text": "very useful information",
          "score": 1,
          "created_utc": "2026-02-22 19:21:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rg3c0y",
      "title": "16 Product Hunt alternatives to launch your SaaS in 2026",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rg3c0y/16_product_hunt_alternatives_to_launch_your_saas/",
      "author": "Bottaniud2025",
      "created_utc": "2026-02-27 10:39:39",
      "score": 26,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Product Hunt gives you one day. If it works great. If it doesn't you wasted weeks of prep for nothing. I started spreading my launches across multiple platforms and honestly the results have been way more consistent\n\nHere's a neat list to get you started with your launch\n\n**High DA directories (submit once, backlink forever)**\n\nSaaSHub -- 358K/month, DA 72  \nPeerlist -- 199K/month, DA 64  \nBetaList -- 145K/month, DA 73  \nAlternativeTo -- DA 90  \nPitchwall -- 16K/month, DA 65  \nUneed -- 91K/month, DA 59  \nFazier -- 17K/month, DA 58\n\n**Launch platforms (get featured and compete for visibility)**\n\nMicrolaunch -- 79K/month, DA 58  \nDevHunt -- 62K/month, DA 57  \nStartupBase -- 12K/month, DA 52  \nRankInPublic -- 5K/month, DA 38  \nCtrlAltCC -- 16K/month, DA 37  \nTwelve Tools -- 500/month, DA 16\n\n**Communities (longer game but compounding)**\n\nHacker News -- DA 91. one frontpage Show HN can bring 10-80K visitors overnight  \nIndie Hackers -- 1.6M/month, DA 80. products board plus building in public posts  \nReddit -- posts are evergreen unlike PH which dies in 24h",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rg3c0y/16_product_hunt_alternatives_to_launch_your_saas/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7ol72s",
          "author": "HarjjotSinghh",
          "text": "this is why i finally quit reddit.",
          "score": 2,
          "created_utc": "2026-02-27 11:15:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7q03sc",
              "author": "Bottaniud2025",
              "text": "You need to launch on reddit aswell",
              "score": 1,
              "created_utc": "2026-02-27 16:11:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7p7n5e",
          "author": "Informal_Data5414",
          "text": "Relying on just one Product Hunt day is such a gamble. Spreading across directories + launch platforms + communities is way smarter long term. The compounding from places like Hacker News and Indie Hackers alone can outperform a single PH spike.\nSolid breakdown",
          "score": 2,
          "created_utc": "2026-02-27 13:47:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7q04wb",
              "author": "Bottaniud2025",
              "text": "Exactly thats the best way to do it",
              "score": 1,
              "created_utc": "2026-02-27 16:12:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rdgemw",
      "title": "Dan Kulkov built a free AI tool in 7 days and got it on auto-pilot marketing in 3 months. Here's the exact sequence.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rdgemw/dan_kulkov_built_a_free_ai_tool_in_7_days_and_got/",
      "author": "missy_delenor",
      "created_utc": "2026-02-24 13:35:50",
      "score": 21,
      "num_comments": 8,
      "upvote_ratio": 0.89,
      "text": "Most growth strategies require either money or an existing audience. This one requires neither.\n\nThe approach is called side project marketing. Build a free tool that solves a small problem connected to your paid product. The free tool gets organic traffic, builds your email list, and funnels users toward your main product without ad spend.\n\nDan Kulkov's exact sequence:\n\nFind a problem connected to your paid product with at least 1,000 monthly searches. Build a 2-screen AI wrapper input on screen one, results on screen two. Use GPT-3.5 with a detailed prompt for fast results. Critical: don't gate the results behind an email. Let people use it freely. More trials means more organic sharing. On the results screen, offer a valuable resource that requires an email to unlock. That's your list builder.\n\nThe distribution sequence after building: launch on Product Hunt targeting top 5, submit to AI directories the same day, post on Reddit and HackerNews, start daily short videos showing the tool in action.\n\nFull side project marketing playbook with Dan Kulkov's, Marc Lou's, and Sveta Bay's frameworks three different approaches that complement each other is [inside foundertoolkit](http://unicornmaking.com)..\n\nWithin 3 weeks of this sequence, AI influencers typically discover and feature tools organically. That generates free backlinks that compound for months. Within 3 months, the whole thing runs without active promotion.\n\nSveta Bay's addition that makes a measurable difference: put a CTA button on every single page of your free tool pointing to your paid product. Every visitor is a potential conversion not just an email subscriber.\n\nHas anyone here successfully used a free tool to drive signups for a paid product? What was the conversion rate?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rdgemw/dan_kulkov_built_a_free_ai_tool_in_7_days_and_got/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7849do",
          "author": "Sea-Cut-4178",
          "text": "Is there an example of this in action?",
          "score": 2,
          "created_utc": "2026-02-24 22:52:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74yo4n",
          "author": "Any_Butterscotch_610",
          "text": "I’ve seen this work really well when the free tool solves something super specific instead of trying to be too broad. The narrower the use case, the easier it spreads.",
          "score": 1,
          "created_utc": "2026-02-24 14:04:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74zpaw",
          "author": "desisevil",
          "text": "How closely related does the free tool need to be to the paid product to actually convert well?",
          "score": 1,
          "created_utc": "2026-02-24 14:10:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7548dv",
              "author": "missy_delenor",
              "text": "Very closely related. The free tool should solve a small piece of the same problem so users naturally want the full solution afterward.",
              "score": 2,
              "created_utc": "2026-02-24 14:33:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o751uw2",
          "author": "GreatIdeal1954",
          "text": "Biggest early signal for me was impressions increasing in Search Console before clicks. Rankings followed later.\n\n\n\n",
          "score": 1,
          "created_utc": "2026-02-24 14:21:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77812m",
          "author": "Plus-Stuff-6353",
          "text": "Solid playbook.Most people fail in the no email gate on results part friction makes sharing die. Free tool + CTA on each page is essentially free passive sales funnel which builds up with time.",
          "score": 1,
          "created_utc": "2026-02-24 20:20:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77asbd",
              "author": "Rude-Purple4938",
              "text": "I get what you’re saying — reducing friction definitely helps with sharing, and a free tool with a clear CTA can turn into a solid passive funnel over time. That part makes sense.\n\n\nBut I don’t think removing all friction is always the answer. Sometimes a small amount of friction — like capturing an email before showing full results — can actually increase perceived value and help build a stronger long-term relationship with users.\n\n\nA free tool alone doesn’t guarantee growth. If users don’t see real value or don’t feel connected to the product, they won’t come back — no matter how smooth the funnel is.\n\n\nI think it’s less about “no friction” and more about “intentional friction” — being strategic about when and why you ask for something.\n\n\nIf you’d like, I can also make it:\nMore direct and debate-style\nMore supportive but nuanced\nOr shorter and punchier for Reddit/Twitter tone.",
              "score": 1,
              "created_utc": "2026-02-24 20:33:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7v0a91",
          "author": "Confident_Box_4545",
          "text": "Free tools can work but only if the small problem is painfully connected to the paid one. Most side projects get traffic from curious builders, not actual buyers. If the users of the free tool are not the same people who would pay, it turns into vanity growth.",
          "score": 1,
          "created_utc": "2026-02-28 10:56:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdpcl6",
      "title": "I Built a Google Maps scraper in 2 days",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rdpcl6/i_built_a_google_maps_scraper_in_2_days/",
      "author": "Smart-Total-7099",
      "created_utc": "2026-02-24 19:05:23",
      "score": 21,
      "num_comments": 43,
      "upvote_ratio": 0.75,
      "text": "Someone paid me 2500 dollars for it. I did not overthink it. I just built something obviously useful.\n\nAll it does is scrape Google Maps. You type “plumbers in Chicago” and it spits out a CSV with names, emails, phone numbers and websites. That is it. No complicated SaaS dashboard, no subscription and free to scrape, no API costs.\n\nDay 1: wrote the scraper in Python with Playwright.  \nDay 2: I added a basic interface and recorded a 30 second demo.\n\nWhen I reached out to marketing agencies and lead generation people on LinkedIn and in Facebook groups, I did not try to convince them they needed it. I just explained why it would help them and showed the demo. They already knew they wanted this.\n\nOne agency asked if they could have exclusive use in their niche. They paid 2500 dollars.\n\nLesson learned: boring problems pay if you find the right person. You do not need a platform or a subscription model. Just solve one annoying task for someone who already has the problem.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rdpcl6/i_built_a_google_maps_scraper_in_2_days/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o78ujmb",
          "author": "agin_",
          "text": "Note that Google already sued similar solutions. Even if you just built the tool and not using it, I would not feel on the safe side by doing so.",
          "score": 5,
          "created_utc": "2026-02-25 01:15:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cdgk9",
              "author": "niiks07",
              "text": "If google sued, that means is useful things.",
              "score": 3,
              "created_utc": "2026-02-25 15:46:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7k75oy",
                  "author": "Smart-Total-7099",
                  "text": "and it is useful :)",
                  "score": 1,
                  "created_utc": "2026-02-26 18:40:26",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o7nt0sd",
                  "author": "Gargunok",
                  "text": "It is useful which is why Google sell it as a product.  This product is undercutting or bypassing Google which why people are buying it.\n\nThere is legal action because it is a enforceable break of Google terms of use. Google will protect their product.\n\nIf you can create a rival dataset to Google there is a huge opportunity to be had. A download tool isn't it.",
                  "score": 1,
                  "created_utc": "2026-02-27 06:56:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7p9vkk",
                  "author": "Huge_Leader_6605",
                  "text": "Nobody argued it was not useful.",
                  "score": 1,
                  "created_utc": "2026-02-27 14:00:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7dqx3y",
          "author": "Longjumping-Ad8775",
          "text": "I used to scrape Google years ago.  Trust me, they’ll lock you out.",
          "score": 3,
          "created_utc": "2026-02-25 19:31:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7as5d3",
          "author": "nlomb",
          "text": "Firstly this isn't growth hacking. Secondly, this is against the TOC and you will get sued for it. Might want to get rid of any evidence that you ever worked on this. ",
          "score": 3,
          "created_utc": "2026-02-25 09:36:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7avcd9",
              "author": "Smart-Total-7099",
              "text": "Scraping public data is not illegal, there are many big saas on the internet that have been scraping millions of emails from google maps yet they didn't get anything. rule of thumb, if it's public, you can scrape it. that's how LinkedIn lost that lawsuit. the data was public\n\nbut if you meant something else can you please share what you meant ",
              "score": 3,
              "created_utc": "2026-02-25 10:05:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7axh0j",
                  "author": "nlomb",
                  "text": "You should do some research on what you just said. You're reselling it that's where it's wrong. Read the Terms and Conditions. Those SaaS companies are mining data not reselling a wrapper based on the information. \n\n[https://maps.google.com/help/terms\\_maps/](https://maps.google.com/help/terms_maps/)\n\n* **Prohibited Conduct.** Your compliance with this Section 2 is a condition of your license to use Google Maps. When using Google Maps, you may not (or allow those acting on your behalf to):\n   1. redistribute or sell any part of Google Maps or create a new product or service based on Google Maps;\n   2. copy the content (unless you are otherwise permitted to do so by the [Using Google Maps, Google Earth, and Street View](https://www.google.com/permissions/geoguidelines/) permissions page or applicable intellectual property law, including \"fair use\");\n   3. mass download or create bulk feeds of the content (or let anyone else do so);\n   4. use Google Maps to create or augment any other mapping-related dataset (including a mapping or navigation dataset, business listings database, mailing list, or telemarketing list) for use in a service that is a substitute for, or a substantially similar service to, Google Maps; or\n   5. use any part of Google Maps with other people's products or services for or in connection with real-time navigation or autonomous vehicle control, except through a specific Google-provided feature such as Android Auto.",
                  "score": 2,
                  "created_utc": "2026-02-25 10:25:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7b1mm6",
          "author": "CapMonster1",
          "text": "Some builders running Playwright-based pipelines pair them with CapMonster Cloud to automatically handle verification challenges and keep large scraping runs consistent. It integrates easily into browser automation and helps reduce manual interruptions. If you ever want to test it in your scraper, we can provide a small test balance so you can see how it performs under heavier loads.",
          "score": 1,
          "created_utc": "2026-02-25 11:02:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d4952",
          "author": "drunkenweed",
          "text": "Interesting. So the existing places API + email enrichment?",
          "score": 1,
          "created_utc": "2026-02-25 17:48:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7d6ep2",
              "author": "Smart-Total-7099",
              "text": "No API in the equation, you just input the place, the profession and it finds the leads with their emails, phone numbers and websites",
              "score": 0,
              "created_utc": "2026-02-25 17:58:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ienkh",
          "author": "TodayExcellent9756",
          "text": "2500$? LOL\nI just bought a software that does similar thing for only 35$.",
          "score": 1,
          "created_utc": "2026-02-26 13:31:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ifz81",
              "author": "Smart-Total-7099",
              "text": "you'd be surprised about how many people with big money can throw cash just like that. i had a marketing consultation with someone, actually? it wasn't, i just said \"your tool need to be promoted offline not online\" over a damn text, not even like a call or something and he paid $100 for one piece of advice. another paid $600 for 2 of those scrapers. and guess what? he was a developer and he LITERALLY told me i can make those, i just don't have time for them XD\n\nthat's why devs hire other devs as well lol",
              "score": 1,
              "created_utc": "2026-02-26 13:38:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7j44vg",
          "author": "MajesticBanana2812",
          "text": "I got a three day timeout for trying to build a commute time map from around work. You're going to be railed if you keep that up.",
          "score": 1,
          "created_utc": "2026-02-26 15:41:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7j6f7s",
              "author": "Smart-Total-7099",
              "text": "well, that's using google maps like literally",
              "score": 1,
              "created_utc": "2026-02-26 15:51:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7j7mgq",
                  "author": "MajesticBanana2812",
                  "text": "Yes, if you do it manually through their site, it's fine. The moment you automate something with the intent of aggregating data, that's when they come after you.  I made this back in 2022, before anyone and their mum was spitting out apps for funsies. Don't you think they're going to be more strict about it now that people who don't know what an API is are going to be able to act on their ill-informed business ideas?",
                  "score": 1,
                  "created_utc": "2026-02-26 15:57:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7r5hp8",
          "author": "Empty-Mulberry1047",
          "text": "it's weird to see so many people rush to protect a massive billion dollar corporation built off of public information locked behind a wall of ads, data harvesting, and inane api fees.",
          "score": 1,
          "created_utc": "2026-02-27 19:28:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7vkh3h",
              "author": "Acrobatic-Employer38",
              "text": "How is it weird? Google provides an incredible number of products that are wildly useful for free.\n\nGoogle is one of the few companies that it feels like a worthwhile trade off.",
              "score": 1,
              "created_utc": "2026-02-28 13:33:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7wt9hh",
                  "author": "Empty-Mulberry1047",
                  "text": "Bless your heart my sweet summer child.",
                  "score": 1,
                  "created_utc": "2026-02-28 17:30:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7cddrh",
          "author": "Confident_Box_4545",
          "text": "This is what people miss. The money wasn’t in the scraper, it was in finding someone who already needed it.\n\nYou didn’t build a big vision. You solved one annoying task for a specific buyer and showed them exactly how it helps. That’s why it moved fast.\n\nMost founders overbuild and then go hunting for demand. You found demand first and kept the build simple.",
          "score": 1,
          "created_utc": "2026-02-25 15:46:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcf6gr",
      "title": "How can artificial intelligence reduce manual CRM tasks?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rcf6gr/how_can_artificial_intelligence_reduce_manual_crm/",
      "author": "Kaess-Janetta",
      "created_utc": "2026-02-23 11:39:11",
      "score": 21,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "ok so we use crm obviously and the amount of manual crap we do is insane. like logging calls, updating stages, copy pasting from emails into notes. it's 2025 and i feel like a secretary half the time. been seeing all these ai tools pop up that claim to automate this stuff. like they listen to calls and log everything automatically or pull data from emails without you lifting a finger. sounds too good to be true honestly. has anyone actually used this stuff? does it work or is it just another thing that sounds cool in demos but sucks in real life? would rather just keep doing things manually if the ai thing is half baked. curious what you guys have tried and if any of it actually saved you time.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rcf6gr/how_can_artificial_intelligence_reduce_manual_crm/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7dovb5",
          "author": "harsh02121",
          "text": "it's wild how much time we spend on the mundane, and while ai isn't a silver bullet yet, it's definitely interesting to see how some platforms are integrating it to chip away at those tasks, like hubspot trying to make call logging less of a chore.",
          "score": 7,
          "created_utc": "2026-02-25 19:21:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qyxbb",
          "author": "markie123__",
          "text": "Yeah, the manual stuff is brutal, and honestly, some of the AI tools are still a bit clunky, but we've seen real gains with automated call logging and email parsing, especially since platforms like hubspot started baking more of that functionality directly into their core offerings, which makes a huge difference compared to trying to stitch together a bunch of third-party tools.",
          "score": 11,
          "created_utc": "2026-02-27 18:56:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xvi4z",
          "author": "OracleofFl",
          "text": "There is AI and then there are workflows. If you can define the \"when this happens, do this\" a straightforward workflow can be defined to do those task pretty easily. There are also \"integrations\" that can automatically log phone calls to your CRM available on virtually all CRMs and all phone systems. \n\nAI workflows are best for workflows not easily defined like scoring a lead based on factors like zip code, which ad they responded to and how quickly they respond to emails and calls. AI works best in these less clearly defined areas.",
          "score": 1,
          "created_utc": "2026-02-23 12:26:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71plbp",
              "author": "Kaess-Janetta",
              "text": "this is helpful, thanks. the distinction between ai and workflows makes sense. i think most of what we do is probably just workflow stuff that should already be automated. guess we need to actually set it up instead of complaining lol.",
              "score": 2,
              "created_utc": "2026-02-24 00:04:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6z0lj7",
          "author": "FamlyMemo",
          "text": "Yes, it's called automation and it works. In some cases it works like this:\n\nYou give access to your email to the ai  \nYou setup cron jobs so the ai knows WHEN to look at your email  \nIt pulls data and do whatever you want to do with that  \nIt pushes to google drive\n\nOther solution would be webhooks (when an event has happend is calling an endpoint). That endpoint starts a function like (hey ai, do this or that).  \nHope this helps",
          "score": 1,
          "created_utc": "2026-02-23 16:13:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zwb0h",
          "author": "Wild-Cantaloupe-4548",
          "text": "Once I built an AI agent for a company, you simply talk to and it creates mails & journeys out of templates  you have on sfmc if you're familiar with it. They say it had been pretty life changing",
          "score": 1,
          "created_utc": "2026-02-23 18:39:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zwvej",
          "author": "morningdebug",
          "text": "yeah the call logging stuff actually works pretty well if it's set up right, but the real pain is getting it to talk to your crm without breaking everything. i built something similar on blink that pulls from emails and updates fields automatically, saved us like hours a week on data entry alone",
          "score": 1,
          "created_utc": "2026-02-23 18:42:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o782e2i",
          "author": "Academic-Highlight10",
          "text": "IMO it depends on your workflows. In one of my organizations, we use Gong and there is a lot of stuff that they get right based on the parameters and the testing we have done. There are some things that I wish it did better.  In my other organization we built our own system  and build for others so we can be very specific to what we wanted, how data should be handled, how it can consider our playbooks etc. Gong has saved me time trying to move sales forward, capturing key points from calls, creating follow up emails etc. we have it set up to fill out certain fields from a calls well which saves some time. I will say building custom has been helpful for most of our customers bc of the way they use their CRM and other external applications/systems",
          "score": 1,
          "created_utc": "2026-02-24 22:43:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7baol6",
          "author": "Creepy-Neck6587",
          "text": "It actually works, but only for the repetitive stuff.\n\nAuto call summaries, email to CRM logging, and task creation can save a lot of admin time. Where it fails is nuance. Sometimes you still need to review and tweak.\n\nThe sweet spot isn’t full automation. It’s AI drafting and logging everything so you just approve instead of typing.\n\nWhen set up well, it definitely reduces the “CRM secretary” feeling.\n\nSelect 24 more words to run Humanizer.",
          "score": 1,
          "created_utc": "2026-02-25 12:14:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7z4f9b",
          "author": "Impressive_End1468",
          "text": "tbh, i'm with you on the skepticism, most of these ai things feel like they're trying to fix a problem that could be handled better with just a solid workflow, and for that, hubspot has always been pretty dependable even if the ai stuff is still figuring itself out.",
          "score": 1,
          "created_utc": "2026-03-01 01:00:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdgdy1",
      "title": "Link building service that actually works?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rdgdy1/link_building_service_that_actually_works/",
      "author": "Traditional_Arm_9981",
      "created_utc": "2026-02-24 13:35:01",
      "score": 18,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Been running growth experiments for the past 6 months and SEO has consistently been the hardest channel to crack. Paid acquisition is eating budget and we need organic to start pulling its weight.\n\n\n\nContent and on-page SEO are in decent shape. The bottleneck is clearly authority, we're getting outranked by competitors who have weaker content but stronger backlink profiles. Tried a couple of outreach campaigns in-house and the response rates were terrible. Tried one agency and got overpriced placements that moved nothing.\n\n\n\nRecently started seeing [Link-Building tool](http://getmorebacklinks.org) come up in growth communities, specifically around building foundational authority through directory submissions. The positioning makes sense to me establish baseline credibility first, then layer more aggressive outreach on top. But I haven't seen many growth hackers talk about directory submissions specifically.\n\n\n\nHas anyone used directory submissions as part of a broader growth strategy and seen measurable ranking impact? And what link building approach has genuinely moved organic growth numbers for you rather than just looking good in a report?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rdgdy1/link_building_service_that_actually_works/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o74ypa8",
          "author": "Bubalis_Bubalus",
          "text": "Directory submissions aren’t magic, but they helped establish a baseline for me. After that, outreach links seemed to have way more impact.",
          "score": 1,
          "created_utc": "2026-02-24 14:04:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74zjil",
          "author": "desisevil",
          "text": "Also noticed crawl rate increased after building more foundational links. That alone helped new content get indexed and tested faster.",
          "score": 1,
          "created_utc": "2026-02-24 14:09:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o751ed9",
          "author": "Queasy_Mulberry____",
          "text": "Honestly most agencies sell links that look  impressive but dont move rankings. Relevance and consistency mattered way more than DR numbers in my case",
          "score": 1,
          "created_utc": "2026-02-24 14:19:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7asbuj",
          "author": "jluisseo",
          "text": "Llevo años trabajando en link building para proyectos de e-commerce y SaaS, y lo que describes es el patrón clásico: buen contenido, buen on-page, pero competidores con perfiles de backlinks más potentes que te superan incluso en queries donde tú deberías ganar por relevancia. El problema de fondo es que Google usa los backlinks como proxy de reputación, y sin masa crítica de autoridad externa, el contenido solo llega hasta cierto punto.\n\n\n\nEn cuanto a los envíos a directorios: funcionan, pero como base de diversificación, no como solución principal. Lo que realmente mueve el ranking en nichos competitivos son los enlaces contextuales de sitios de autoridad media-alta en tu sector, los que viene de artículos en publicaciones especializadas, round-ups, colaboraciones editoriales o digital PR bien ejecutado.\n\n\n\nEl outreach manual tiene tasas de respuesta baísimas porque el 90% se hace mal: correos genéricos, propuestas sin valor claro, sin personalización. Lo que sí funciona es el enfoque de \"link insertion\" (ofrecer actualizar un artículo existente con tu recurso relevante) y las estrategias de broken link building en nichos con contenido desactualizado. Ambas tienen tasas de éxito significativamente mejores que el outreach estándar.\n\n\n\nLo de las agencias que dan ubicaciones sobrevaloradas es el problema más común del mercado. Antes de contratar cualquier servicio, exige ver una muestra de sus ubicaciones recientes: DR real (no manipulado), tráfico orgánico del dominio en Ahrefs, y que el contenido tenga relevancia temática real con tu nicho. Si no pueden mostrarte eso, es una señal de alarma clara.",
          "score": 1,
          "created_utc": "2026-02-25 09:38:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd6ov3",
      "title": "Top 10 SEO tips for generative engine optimization",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rd6ov3/top_10_seo_tips_for_generative_engine_optimization/",
      "author": "Fun-Training9232",
      "created_utc": "2026-02-24 04:57:20",
      "score": 17,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "SEO feels completely different now with ai overviews, chatgpt, perplexity, and other assistants shaping what people actually see. a lot of the old playbooks still matter, but they need updates to work in ai-driven search and stronger ai brand visibility.\n\nhere are 10 seo tips that are still working:\n\n1. focus on clear topical authority, not just single keywords\n2. answer real user questions in simple, structured language\n3. build strong internal linking around core themes\n4. earn high-quality backlinks from trusted, relevant sites\n5. optimize for entities and context, not just phrases\n6. publish original data, insights, or expert opinions\n7. keep technical seo clean so content is easy to crawl and parse\n8. update content regularly to stay relevant for ai citations\n9. track visibility beyond google, including ai search mentions\n10. align content with generative engine optimization so llms can easily reference it\n\ncurious what others are seeing work right now. what’s actually moving rankings or getting cited inside ai answers?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rd6ov3/top_10_seo_tips_for_generative_engine_optimization/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7334hz",
          "author": "FoodFine4851",
          "text": "I love the tips you have mentioned, ive been using similarweb to check my sites visibility in ai searches and its eye opening how much traffic comes from there now. helps with that tip on tracking beyond google, shows competitor insights too which is great for building authority. op, have you noticed similarweb picking up ai mentions for your content or other tools you use for that?",
          "score": 3,
          "created_utc": "2026-02-24 05:04:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gjs98",
          "author": "Scary_Bag1157",
          "text": "This is a solid list, and I totally agree with the direction things are heading. For me, the biggest shift I've seen is how AI actually \\*navigates\\* content.\n\n\n\nWe had a pretty big website migration about 18 months ago, and the old playbook of just mapping URLs and calling it a day wasn't cutting it. Even with perfect 301s, we noticed our AI visibility and citations were lagging. What eventually clicked was focusing on that internal linking (point 3) and structuring content (point 2, 7) not just for humans or traditional bots, but for an AI doing a multi-step research journey, like u/o1got mentioned. \n\n\n\nWe started treating internal links like breadcrumbs for an AI agent, making sure related topics were clearly connected. We also broke down complex topics into shorter, self-contained sections. It sounds simple, but seeing our content start appearing in AI overviews and getting cited over competitors who only focused on basic keyword stuffing was a game-changer. Took about 3-4 months of consistent effort to see those results, but it was worth it.",
          "score": 2,
          "created_utc": "2026-02-26 04:26:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o735hyx",
          "author": "kubrador",
          "text": "the irony of posting seo tips on reddit to ask for seo tips is genuinely impressive",
          "score": 1,
          "created_utc": "2026-02-24 05:22:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o735ns1",
          "author": "Altruistic-Meal6846",
          "text": "You hit it with focusing on entities and context, i swear google’s eating that up.",
          "score": 1,
          "created_utc": "2026-02-24 05:23:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73nncr",
          "author": "Cool-Gur-6916",
          "text": "One thing I’ve noticed recently is that AI engines tend to cite tools or platforms that have clear documentation and use-case pages explaining real workflows.\n\nFor example, when experimenting with automation workflows, I’ve seen platforms like Runable get referenced more often when the content clearly explains how something works rather than just promoting the tool. AI systems seem to prefer pages that show step-by-step implementations, comparisons, and practical examples.\n\nSo beyond the usual SEO basics, I think a big part of Generative Engine Optimization right now is creating structured, explainable content around real tasks (automation, integrations, tutorials, etc.). That kind of content is much easier for LLMs and AI search engines to quote or summarize.\n\nCurious if others are seeing the same thing with documentation-driven content getting picked up more by AI answers.",
          "score": 1,
          "created_utc": "2026-02-24 07:58:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73x04m",
          "author": "Maximum-Bit-3848",
          "text": "Solid list. I’d just add one more layer to it.\n\nWe’ve been testing this across a few projects and what’s really helping with AI citations is:\n\n* Clear definitions in the first 2–3 paragraphs\n* Short, self-contained answer blocks that can stand alone\n* Schema markup that reinforces entities and relationships\n* Pages that load fast and have clean HTML (LLMs struggle with messy DOMs more than people think)\n\nAlso noticing that pages with original comparisons, frameworks, or data points get cited way more than generic “10 tips” content. AI systems seem to prefer content that adds something new, not just summarizes what already exists.",
          "score": 1,
          "created_utc": "2026-02-24 09:27:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o747qyz",
          "author": "dianehasolt",
          "text": "Working something on this domain.",
          "score": 1,
          "created_utc": "2026-02-24 11:06:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74qmbw",
          "author": "Temporary-Constant51",
          "text": "Really solid breakdown. SEO now feels more like building true topical authority than chasing keywords. The shift towards structured answers and entity-based optimization is very real. Definitely a wake-up call for anyone still using old playbooks.",
          "score": 1,
          "created_utc": "2026-02-24 13:20:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77sutg",
          "author": "GroMach_Team",
          "text": "old playbooks don't work if you aren't covering the exact entities the ai expects. i usually use a gap analysis tool to find the specific topic clusters competitors rank for and build content around those missing pieces.",
          "score": 1,
          "created_utc": "2026-02-24 21:56:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77swlj",
          "author": "GroMach_Team",
          "text": "content quality doesn't matter if you're answering the wrong questions. i run a competitor gap analysis to find exactly what topic clusters are driving their traffic, then build better content around those specific gaps.",
          "score": 1,
          "created_utc": "2026-02-24 21:56:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7a0h7z",
          "author": "o1got",
          "text": "good tips!  \nI've analyzed a ridiculous amount of AI agent crawl data and one thing that's not talked about enough: the crawl patterns are completely different from traditional search bots.  \nTraditional SEO assumes a bot hits your page, parses it, and leaves. AI agents are doing multi-step research journeys. They'll hit your homepage, follow internal links based on context they're building, sometimes circle back to pages they visited earlier when they find new info. Your internal linking structure matters way more than it used to because you're not just passing PageRank around, you're literally guiding an agent through a research process.\n\nThe other big thing I'm seeing: structured content wins, but not in the schema markup way everyone assumes. It's more about information hierarchy. AI models are really good at extracting from clean HTML with proper heading structures, lists, and tables. The fancy JavaScript-heavy sites that look great to humans are a mess for LLM parsing. I've seen sites with identical content get cited completely differently based purely on how clean their DOM structure is.",
          "score": 1,
          "created_utc": "2026-02-25 05:32:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b11uw",
          "author": "AlisaWaelchi",
          "text": "tracking ai mentions like you mentioned in tip 9 is key, i use aicarma for that - it shows how different llms describe your brand vs competitors, helps spot where your content gets cited or missed.",
          "score": 1,
          "created_utc": "2026-02-25 10:57:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rf8556",
      "title": "How would you grow the first 1,000 paid users for a B2C investing product?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rf8556/how_would_you_grow_the_first_1000_paid_users_for/",
      "author": "Gigantic_Elephant",
      "created_utc": "2026-02-26 11:51:43",
      "score": 16,
      "num_comments": 18,
      "upvote_ratio": 0.77,
      "text": "I’m building a B2C investing tool aimed at retail investors (think 25–40, actively investing, already using tools like screeners/newsletters).\n\nWe currently have a few hundred users and some paid conversions, but I’m trying to think clearly about how to get to the first **1,000 paying customers** without burning a ton on ads.\n\nConstraints:\n\n* Limited budget\n* Early-stage team (mostly founder-led growth)\n* Conversion from free → paid is decent but not optimized yet\n* Still refining ICP positioning\n\nWhat I’m debating:\n\n* Double down on community-driven growth (Reddit, X, niche finance forums)?\n* Partnerships with university investing clubs?\n* Referral loops?\n* Paid search (high intent only)?\n* Some kind of competition / gamified angle?\n\nIf you’ve grown a B2C product from 0 → 1,000 paid:\n\n* What channel actually moved the needle?\n* What did you *stop doing*?\n* What was a waste of time?\n* What surprised you?\n\nWould love tactical advice, especially from people who’ve done this in finance / SaaS.\n\nThanks 🙏",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rf8556/how_would_you_grow_the_first_1000_paid_users_for/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7qic92",
          "author": "Confident_Box_4545",
          "text": "In B2C investing, trust is the bottleneck, not traffic.\n\nThe channels that usually move the needle are the ones where credibility transfers. Niche finance newsletters, respected X accounts, Substack writers, YouTube creators with small but loyal audiences. One trusted mention can outperform weeks of posting.\n\nI would pause broad community posting unless you are adding real insight consistently. Retail investors are skeptical and allergic to generic tools.\n\nAlso, optimize free to paid before chasing more top of funnel. If conversion is decent but not great, improving it from 3 percent to 6 percent is easier than doubling traffic.\n\nBiggest waste early is trying to be everywhere. Pick one high trust channel, build depth there, and turn early paying users into case studies you can show publicly.",
          "score": 2,
          "created_utc": "2026-02-27 17:37:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rlikd",
              "author": "Key-Boat-7519",
              "text": "Trust is the bottleneck, 100%. What helped me with a similar audience was treating “trust” like a funnel, not a vibe.\n\nInstead of chasing big influencers, I went after 10–15 mid-sized creators and newsletters whose readers matched my ICP. I offered them something very specific: a custom walkthrough, a co-branded checklist, or a data deep-dive they could share. The goal wasn’t installs, it was: can we get 20–30 of their readers into a small Zoom session where I demo and answer uncomfortable questions live?\n\nFrom those calls, I pulled two things that moved the needle: 1) exact language they used about fears and goals, which became my landing page and paywall copy; 2) 3–5 anonymous mini case studies with screenshots of how they used the product.\n\nMain point: stack a few high-trust micro-audiences plus live interactions, then recycle that proof (quotes, screenshots, outcomes) everywhere else before touching broader traffic.",
              "score": 2,
              "created_utc": "2026-02-27 20:48:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7qikc5",
              "author": "Gigantic_Elephant",
              "text": "thanks!!",
              "score": 1,
              "created_utc": "2026-02-27 17:39:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hzold",
          "author": "Gigantic_Elephant",
          "text": "here's the link to my product in case you want more info: [www.dinointel.com](http://www.dinointel.com)",
          "score": 1,
          "created_utc": "2026-02-26 11:52:17",
          "is_submitter": true,
          "replies": [
            {
              "id": "o7i2hmr",
              "author": "SERSAINT",
              "text": "I cant help you as ai am struggling with the same issue but your product looks super cool congrats",
              "score": 1,
              "created_utc": "2026-02-26 12:13:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7o2vo6",
                  "author": "Gigantic_Elephant",
                  "text": "thanks!!",
                  "score": 1,
                  "created_utc": "2026-02-27 08:24:26",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7i5czr",
          "author": "Obvious_Jelly_8062",
          "text": "TBH this sounds like a pretty common problem in b2c investment products - what about offering early adopter discounts to incentivize people to sign up? I've seen it work for other similar products with decent success. Can you guys give me more info on your target audience and what kind of incentives they'd be most interested in?",
          "score": 1,
          "created_utc": "2026-02-26 12:33:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jbbzy",
          "author": "Intrepid_Boss9449",
          "text": "Community-driven growth on Reddit and niche forums worked best for me. Focus on adding real value in discussions instead of just promoting. Also, referral loops can help but only if your free users already love the product enough to share it.",
          "score": 1,
          "created_utc": "2026-02-26 16:14:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7o340k",
              "author": "Gigantic_Elephant",
              "text": "thank you for the advise. much appreciate it!",
              "score": 1,
              "created_utc": "2026-02-27 08:26:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7k6pd3",
          "author": "Bubbly-Scarcity-7026",
          "text": "https://play.google.com/store/apps/details?id=com.promptgpt.mobile ask him",
          "score": 1,
          "created_utc": "2026-02-26 18:38:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kzxr2",
          "author": "Cool-Gur-6916",
          "text": "To reach your first 1,000 paying users, focus less on scale and more on trust, positioning, and leverage.\n\n1. Be specific, not broad.\nDon’t market a “better investing tool.” Solve one painful, high-value problem extremely well (e.g., insider signals, small-cap discovery, options flow). Clear positioning converts.\n\n2. Earn trust inside existing communities.\nContribute valuable insights on Reddit, X, and niche finance forums. Teach first. Let your tool power the content subtly.\n\n3. Activate your early users.\nTurn power users into advocates with smart referral incentives tied to investing value (premium features, alerts, deeper analytics).\n\n4. Partner small, not big.\nCollaborate with credible micro-creators (Substack, YouTube, X analysts). Revenue-share beats large influencer spend.\n\n5. Optimize the paywall moment.\nFree users should hit a clear “I need this” point—where deeper data or alerts require upgrading.\n\nAvoid broad ads and generic SEO early. In finance, credibility drives growth more than marketing.",
          "score": 1,
          "created_utc": "2026-02-26 20:57:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7o5lec",
              "author": "Gigantic_Elephant",
              "text": "very helpful, thx!!",
              "score": 1,
              "created_utc": "2026-02-27 08:50:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7meyek",
          "author": "QuestionOwn7886",
          "text": "Having done this for a few SaaS products, here is what moves the needle at your stage:\n\n**Community-led growth is the highest ROI move at sub-1k paid users, but only done right.** Most founders spam subreddits and forums. What actually works: become genuinely useful in the communities where your ICP hangs out. For investing tools, that means r/investing, r/stocks, r/algotrading, finance Twitter/X, specific Discord servers. Answer questions with depth. No links, no self-promotion. After 2-3 weeks of this, you will have DMs asking what tools you use.\n\n**Product-led conversion optimization before you acquire more.** You said free-to-paid conversion is decent but not optimized. Before spending energy getting more free users, define exactly what the \"aha moment\" is. What action correlates most with paying? Get free users to that moment faster. Even small conversion improvements at this stage are worth more than new acquisition.\n\n**Targeted outreach to your existing paying customers' networks.** Ask your current paid users: who else should know about this? Most founders are afraid to ask. Paying customers are already pre-sold on your value — they have friends who invest. A referral incentive (1 month free, extended trial) turns your 100 paid users into a distribution channel.\n\n**Niche content + SEO:** Investing tool users search for things. \"Best stock screener for X\", \"how to find undervalued stocks\", etc. One good piece of content ranking can bring 50-100 qualified visitors/day permanently.\n\nWhat's your current free-to-paid conversion rate? That number determines which of these to prioritize.",
          "score": 1,
          "created_utc": "2026-02-27 01:24:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7n44lr",
          "author": "DoctorBeeIsMe",
          "text": "Cool product but to get to your first 1,000 you need to reduce cognitive load, increase trust, and narrow the audience you're targeting. There's a lot of friction on your landing page. You want to make it as streamlined and simple as possible.\n\nI have a degree in behavioural science and consumer psychology. Here's my two cents. Hopefully it's helpful.\n\n\\- Remove AI from the messaging and focus more on the story, such as \"faster clearer stock decisions\" and \"institutional-grade research in minutes\".\n\n\\- Ask your existing users for specific testimonials and add the social proof preferably above the fold. Right now you have no social proof which decreases your degree of trust.\n\n\\- Continue to sharpen your ICP. \"Investors\" is too broad. Ie. \"for serious retail investors overwhelmed by information overload who want a single, clear score without spending hours in spreadsheets\". It will help your traffic determine if they are in the right place and help you target them.\n\nLet me know if you want more suggestions.",
          "score": 1,
          "created_utc": "2026-02-27 03:52:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7o2urj",
              "author": "Gigantic_Elephant",
              "text": "Thank you so much! This is super helpful. Loved to learn more suggestion from you and explore potential cooperation opportunities.",
              "score": 1,
              "created_utc": "2026-02-27 08:24:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7rvkrp",
                  "author": "DoctorBeeIsMe",
                  "text": "You're welcome. Glad it helped!  \n  \nOne more thing I'd recommend is using loss aversion. People feel losses more strongly than equivalent gains. I.e., if you're backtesting outperforms the S&P, translate that into dollars and frame it as, \"If you had invested $10,000 in the S&P instead of Dino, you would have \\*lost\\* $X by comparison.\"\n\nAlso, highlight the work behind your product, and if you have any particular expertise or credentials, place that somewhere prominent. The more clearly you show the time and expertise, the more people will value your product. \n\nThat said, I think your primary improvement will be to reduce the cognitive load and simplify the landing page. ",
                  "score": 1,
                  "created_utc": "2026-02-27 21:38:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rg6ka7",
      "title": "How Backlinks Helped a Small Fashion Brand Increase Traffic by 38% in 6 Months",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rg6ka7/how_backlinks_helped_a_small_fashion_brand/",
      "author": "Traditional_Arm_9981",
      "created_utc": "2026-02-27 13:24:20",
      "score": 15,
      "num_comments": 7,
      "upvote_ratio": 0.83,
      "text": "\n\nWanted to share an interesting growth lesson from working with a small sustainable fashion brand that was struggling to get traction.\n\n\n\nThey had a great product, handmade, ethically sourced clothing, but almost no organic visibility. When people searched for things like retro fashion or sustainable clothing, they were stuck on page 3-4. Traffic was around **4,900/mont**, and sales were inconsistent.\n\n\n\nAfter digging in, the main issue was obvious: **their backlink profile was weak and mostly irrelevant**, while competitors were getting links from fashion blogs, magazines, and industry sites.\n\n\n\nInstead of publishing more random content, we focused on building authority.\n\n\n\nWe created content around topics that were already trending in their niche things like sustainable fashion guides, ethical wardrobe tips, and commentary on fast fashion. Then we focused on getting those pieces featured on relevant fashion blogs and publications. For execution and outreach scale, we used **a** [**link-building service**](http://getmorebacklinks.org) **alongside internal content efforts to secure placements on niche-relevant sites.**\n\n\n\nNothing changed overnight, but within about two quarters the impact became clear:\n\n\n\n\\- **Traffic grew from** \n\n4,900 to 6,800/month (+38.8%)\n\n\n\n\\- **Overall search visibility increased by** \n\n80%\n\n\n\n\\- **Keywords in** \n\npositions 1-3 increased by 30%\n\n\n\n**- Keywords in** \n\npositions 4-10 increased by 50%\n\n\n\n**The biggest takeaway for me is that content alone wasn’t enough. The turning point was when the brand started earning** relevant backlinks from sites their audience already trusted.\n\nhttps://preview.redd.it/km6dhiedg1mg1.png?width=541&format=png&auto=webp&s=d5b77cc3d7f2dcf1fbe3c43417be142330987eb7\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rg6ka7/how_backlinks_helped_a_small_fashion_brand/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7p4p55",
          "author": "bala523",
          "text": "38% in 6 months is solid, especially in fashion where SERPs are packed with huge publishers. Niche relevance really does seem to matter more than just raw DR.",
          "score": 1,
          "created_utc": "2026-02-27 13:31:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p5evc",
          "author": "Positive_Load1595",
          "text": "This lines up with what I’ve seen too. Once you get links from sites your actual audience reads, rankings and conversions both improve, not just traffic.",
          "score": 1,
          "created_utc": "2026-02-27 13:35:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p5ias",
          "author": "Conscious_Sock_4178",
          "text": "That's a solid jump in traffic and visibility. I've seen similar results focusing on backlinks from niche sites.\n\nThe biggest thing, in my experience, is making sure the content you're pitching is actually valuable to *their* audience, not just a thinly veiled ad for the fashion brand.\n\nAlso, that 38% increase is great, but what was the *quality* of the traffic? Were those visitors actually converting, or were they just bouncing after a few seconds? You might want to dig into that to see if there's room for improvement on the landing page experience.",
          "score": 1,
          "created_utc": "2026-02-27 13:35:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p6hsj",
          "author": "handzs",
          "text": "Did you notice the existing content start climbing faster once those placements went live, or was most of the growth driven by the newer pieces you created for outreach?",
          "score": 1,
          "created_utc": "2026-02-27 13:41:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7p8kb5",
              "author": "Traditional_Arm_9981",
              "text": "It was mostly the existing content that moved first. Pages that were stuck on page 2-3 started climbing within weeks once the placements went live. The new outreach content helped long term, but the quickest gains came from boosting pages that were already aging.",
              "score": 1,
              "created_utc": "2026-02-27 13:52:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7pc7v1",
          "author": "Hecker8778",
          "text": "Damn this is the real distribution channel insight. Most startups think content is the painkiller but it's actually authority. You can't build authority without distribution which is backlinks. The technical debt thing is that people create 100 pieces of mediocre content instead of 5 authoritative pieces that actually get linked. The trick you found is the right one focus on topics your audience already trusts and earn links from those sources. That's the codebase that matters",
          "score": 1,
          "created_utc": "2026-02-27 14:13:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pyv8s",
          "author": "Confident_Box_4545",
          "text": "Solid case study. A lot of small brands miss that part.\n\nMost people think more content fixes ranking issues, but if nobody credible is linking to you, Google has no reason to trust you over competitors. Authority usually beats volume.\n\nCurious though how did you decide which publications to go after first? Was it purely DR based or audience overlap?",
          "score": 1,
          "created_utc": "2026-02-27 16:06:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rf3oz1",
      "title": "I reverse-engineered 6 SaaS launches from $0 to $100K. Here are the 6 playbooks",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rf3oz1/i_reverseengineered_6_saas_launches_from_0_to/",
      "author": "WorthFan5769",
      "created_utc": "2026-02-26 07:21:18",
      "score": 15,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Growth hacking question: What's the ACTUAL playbook that works?\n\nI've been analyzing successful SaaS and there are 6 distinct playbooks:\n\n**1. Weightless Strategy**\n\n* Build demand with content\n* Create scarcity\n* Launch to engaged audience\n* Example: Cleo .so, $61K/month\n\n**2. Wave Surfer Strategy**\n\n* Spot viral trend\n* Ship MVP in 48 hours\n* Ride attention wave\n* Example: TrustMRR, $24K/month\n\n**3. Language Arbitrage**\n\n* Find proven SaaS\n* Localize to different language\n* Dominate SEO in that language\n* Example: TeachEasy, $65K/month\n\n**4. AI Search Strategy**\n\n* Write comprehensive comparison pages\n* Get recommended by ChatGPT/Perplexity\n* 17x better conversion than Google\n* Example: Tally, $338K/month\n\n**5. Signal Search Strategy**\n\n* Ship one feature\n* Test on all channels\n* YouTube dominates (80-90%)\n* Example: Local Rank, $47K/month\n\n**6. High Ticket Ads**\n\n* High price point ($1000+/month)\n* Create video sales letter\n* Run on LinkedIn\n* Example: MailScale, $100K/month\n\nEach works. Pick one. Master it.\n\nWhat's your current channel?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rf3oz1/i_reverseengineered_6_saas_launches_from_0_to/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7h7c50",
          "author": "PhilosophyOpening568",
          "text": "This is a solid breakdown 👍\n\nBut honestly, most of these aren’t “hacks” - they’re just focus.\n\nPick one channel. Go all in. Don’t try to do content + AI SEO + YouTube + LinkedIn ads at the same time. That’s how you burn out.\n\nEvery strategy here works if:\n\n1. You know your audience\n2. You stick with it long enough\n\nMost people quit too early or switch too fast.",
          "score": 2,
          "created_utc": "2026-02-26 07:31:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h6j15",
          "author": "TooOldForShaadi",
          "text": "mind explaining why your profile is hidden?\ni have a hard time trusting anyone on any of these startup related groups with hidden profiles",
          "score": 3,
          "created_utc": "2026-02-26 07:24:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hc4f4",
          "author": "hkpriv",
          "text": "The part about reverse-engineering 6 SaaS launches from $0 to $100K caught my attention, I've tried to do something similar with my own projects but I always seem to get stuck on the marketing side of things, what kind of marketing strategies did you find were most effective for these launches, were they mostly paid ads or more focused on content and SEO?",
          "score": 1,
          "created_utc": "2026-02-26 08:15:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hnmxz",
          "author": "skyler_outx",
          "text": "Good breakdown. I agree this is more about focus than hacks. Pick one channel and stick with it. Most people quit too fast. I’m also curious which worked best ads or content? Real examples would help.",
          "score": 1,
          "created_utc": "2026-02-26 10:07:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hoy67",
          "author": "AnnaGrowthOps",
          "text": "Really interesting breakdown! I especially like the “Signal Search” strategy - focusing on one core feature and testing it across multiple channels seems very efficient for early-stage SaaS.\n\nPersonally, we’ve experimented a lot with content-driven approaches (similar to your “Weightless” strategy) and noticed it helps build an engaged audience over time.\n\nCurious to hear which strategies others found most scalable in the long run!",
          "score": 1,
          "created_utc": "2026-02-26 10:19:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7igkdi",
          "author": "smarkman19",
          "text": "Your list nails the real issue: people mix playbooks and then blame “growth” instead of bad focus. The point is to pick one that matches your product, price, and founder skills, then go uncomfortably deep on it.\n\nFor early-stage B2B, I’ve seen “Weightless” plus “AI Search” work best together: long-form problem content that feeds both Google and ChatGPT/Perplexity, then a very tight CTA into either a waitlist or a demo. It forces you to really understand the language your buyers use, which then powers everything else (landing pages, outbound, even pricing).\n\nI’d also layer in community listening no matter which playbook you pick. I use SparkToro to find where people hang out, F5Bot to track keywords, and Pulse for Reddit to catch those specific threads where your exact ICP is complaining in public so you can join the convo with something useful, not pitchy.\n\n",
          "score": 1,
          "created_utc": "2026-02-26 13:41:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7imwie",
          "author": "Far_Move2785",
          "text": "Dude, your SaaS launch breakdown is insane. Those strategies are gold - especially the Wave Surfer approach.\n\nReal talk though, the thing that changed my online monetization wasn't a launch strategy. It was something WAY more tactical: deep linking. \n\nThe thing nobody tells you is that when someone clicks a regular affiliate link from social media, they land on this clunky mobile web browser — not the actual app. And people just don't buy there. They're already logged into the app, have saved payment info, Prime shipping showing — it's frictionless. The browser version is the opposite.\n\nI switched to magic links that open directly in apps (Amazon, YouTube, Shopify) and my conversion rates went up 300%. Not exaggerating. Same content, same audience, just the link changed.\n\nThe tool I use is https://tryhoox.com — they do app-to-app deep links so your followers land inside the native app instead of some broken mobile web page. Works for basically any platform where you're trying to drive action.\n\nIf you're building SaaS or doing affiliate marketing and using regular links, you're probably losing 2/3 of your potential conversions. Seriously game-changing stuff.",
          "score": 1,
          "created_utc": "2026-02-26 14:15:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nua0w",
          "author": "ernosem",
          "text": "I wonder how do you measure this:\n\n* Get recommended by ChatGPT/Perplexity\n* 17x better conversion than Google\n\nSince many AI results don't end up being a click on your website.   \nThese are likely made up numbers.   \nI'm not defending Google or any other platform, but I'm pretty good with data and have an overview of businesses with $2M monthly ad spend.... \n\n",
          "score": 1,
          "created_utc": "2026-02-27 07:07:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7occuj",
          "author": "Edicez",
          "text": "Thanks ChatGPT",
          "score": 1,
          "created_utc": "2026-02-27 09:55:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1replqv",
      "title": "Launched a SaaS one year ago that have zero traction. Haven’t touched it in 6 months. Now it gets ~600 users/month.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1replqv/launched_a_saas_one_year_ago_that_have_zero/",
      "author": "AppTasticVoyager",
      "created_utc": "2026-02-25 20:56:08",
      "score": 12,
      "num_comments": 12,
      "upvote_ratio": 0.93,
      "text": "I launched my first SaaS product in Feb 2025 (almost to the day). It is just a simple online PDF tool site. Compress PDF, merge PDF, that kind of thing. I kept it simple and boring just to understand and learn the process.\n\nPart of the process was learning sales. I had zero idea how to market or grow. So I spent money on ads, tried social media marketing, etc. And nothing really worked. I didn't have a single sale.\n\nFor the first 8 months, I had around 1,500 users come and go, with no sales. [Link for proof](https://imgur.com/MmMbfZ4). This was spending so many hours each month working to get users with no sales. I basically burned out and gave up on the site and pivoted to a new tool.\n\nThe new tool automatically created blog posts targeting keywords to grow SEO/GEO presence. I figured why not, and set it up for my PDF site. All I did was target keywords I figured people might search for around PDFs. The system publishes 3 posts per day.\n\nThat setup was the last time I touched it. No promotion, not new features, nothing.\n\nSince that setup in Oct 2025, my site averages around 600 users per month - [link to proof](https://imgur.com/VJ5xW3p)\n\nThe best part of it, I've made three sales. I know it isn't groundbreaking, but it covers the cost of the site and is very cool to see still new to building and shipping. It is very ironic that when I stopped working day and night for users is when I got actual paying users lol.\n\nHappy to answer any questions, but figured a post like this might help some of you that are stuck with no customers. One year later after essentially abandoning it and I have actual paying users. Just insane.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1replqv/launched_a_saas_one_year_ago_that_have_zero/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7ejyht",
          "author": "Obvious_Jelly_8062",
          "text": "TBH, I'm kinda surprised you're getting 600 users after not touching your product for months - was that a result of organic traffic or did you do some kind of refresh to get it back in the game?",
          "score": 1,
          "created_utc": "2026-02-25 21:46:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ekxt5",
              "author": "AppTasticVoyager",
              "text": "It was truly just SEO from what I can tell/what the results look like. \n\nI didn't touch anything else in terms of offering or setup. ",
              "score": 1,
              "created_utc": "2026-02-25 21:51:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7fjk5x",
          "author": "Fun_Mycologist_7791",
          "text": "I'd be getting a lifetime value offer on this now, even just $10 to use it forever... Nice little dividend if you have no intention of promoting it more ",
          "score": 1,
          "created_utc": "2026-02-26 00:53:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7frbcz",
              "author": "AppTasticVoyager",
              "text": "That's actually how it is set up. Just a one time payment.",
              "score": 2,
              "created_utc": "2026-02-26 01:37:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7icqxr",
                  "author": "Fun_Mycologist_7791",
                  "text": "Great minds think alike. Congrats on it, bro! ",
                  "score": 1,
                  "created_utc": "2026-02-26 13:20:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7h3quq",
          "author": "Inevitable-Neat-225",
          "text": "This is actually a really interesting case study. You proved that traffic wasn’t the real bottleneck — distribution just needed compounding time. The more interesting question now is monetization design.600 users/month with 3 sales suggests intent mismatch more than visibility problems. PDF tools usually attract high-volume, low-attachment users. The challenge becomes: how do you capture value at the exact moment utility is highest? SEO solved acquisition. Now the leverage is in conversion mechanics.",
          "score": 1,
          "created_utc": "2026-02-26 06:59:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7i8a3g",
              "author": "AppTasticVoyager",
              "text": "All great points. I'd say the offering and the tool while useful maybe isn't a need for most. And to me that is ok. I built it to learn and practice and sharpen my skills.\n\nMaybe I'll change the offering at some point, but definitely want to focus on other things for now.",
              "score": 1,
              "created_utc": "2026-02-26 12:52:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7jzjh5",
          "author": "Key-Boat-7519",
          "text": "Main point: your “set it and forget it” SEO posts are doing more real work than all the grinding you did before, and you should now lean into what’s already working instead of spinning up more tactics.\n\nWhat I’d do next:\n\n\\- Map which posts bring signups vs just visits (landing page, query, country).\n\n\\- Group keywords by intent: “edit/merge/compress pdf” are money, “what is a pdf” is mostly noise.\n\n\\- Take the 10–20 best posts and make them actually good: clearer CTAs, comparison tables vs big players, simple explainer gifs.\n\n\\- Add one super obvious path: “upload file right here” on every high-intent page.\n\nFor more demand, mix your pSEO with places where people already rant about PDF tools being slow or paywalled; stuff like Ahrefs for topics, F5Bot for mentions, and Pulse for Reddit to catch those “need a quick PDF fix” threads can turn a few of those 600/month into steady buyers.\n\nEnd point: double down on the boring SEO that’s already compounding and sharpen the pages that lead to actual payments.",
          "score": 1,
          "created_utc": "2026-02-26 18:05:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h0ha2",
          "author": "Tom-Cruisin",
          "text": "fuck off with this ad. ",
          "score": -1,
          "created_utc": "2026-02-26 06:31:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7i81wp",
              "author": "AppTasticVoyager",
              "text": "Take a deep breath and maybe take a break from Reddit there my guy",
              "score": 1,
              "created_utc": "2026-02-26 12:51:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rg6ijz",
      "title": "Stopped building features. Grew my business without touching the product.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rg6ijz/stopped_building_features_grew_my_business/",
      "author": "miss_raipelarmzz",
      "created_utc": "2026-02-27 13:22:15",
      "score": 12,
      "num_comments": 9,
      "upvote_ratio": 0.93,
      "text": "\nI used to think a flatlined business meant I needed more features. When my directory submission SaaS sat at four hundred MRR for three straight months, I opened VS Code by default. New reports. New filters. New onboarding tweaks. Nothing moved the needle. Traffic was low. Conversions were average. I was polishing a product nobody was really seeing.\n\nThe uncomfortable shift started when I forced myself to stop building for a month and just study how other small founders actually grew. I went through a [bunch of case studies on FounderToolkit](http://unicornmaking.com) and the common thread was brutal. The winners were not the best products. They were the ones that had one or two channels completely dialed in and an offer that made saying yes feel cheap compared to the pain.\n\nSo I treated my business like a growth lab instead of a feature factory. First step was picking a main channel. I chose Reddit because my customers already hang out there. Instead of link dropping, I behaved like a regular user. Answered questions, shared numbers, told exactly what worked and what failed in my own launches. Only after building some trust I started mentioning the product in context. The crazy part was people asked for the link themselves.\n\nAt the same time I realized my “we are on a few sites” directory strategy was a joke. I went all in and listed on every relevant directory and niche showcase I could find, using curated lists instead of guessing. Most of them send tiny trickles individually but stacked together they turned into a predictable stream of visitors. A couple of them hit and keep sending signups months later without me doing anything.\n\nThe last sacred cow was pricing. I stopped pricing based on what felt safe and started thinking like my buyers. Indie founders will try a tool if it is obviously worth more than it costs and the decision feels low risk. Tiny tweaks there had more impact than any feature I shipped last year.​\n\nThe controversial part is this. For a stalled business, opening your editor is often the worst growth move you can make. You probably do not need a better product yet. You need more people seeing it and a clearer reason to buy right now.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rg6ijz/stopped_building_features_grew_my_business/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7p6ycn",
          "author": "After_Diamond2098",
          "text": "A lot of us use feature work as a way to avoid learning growth.",
          "score": 2,
          "created_utc": "2026-02-27 13:43:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p50u2",
          "author": "Vegetable-Feed-9305",
          "text": "Most founders hide in the product because it’s the part they can control.",
          "score": 1,
          "created_utc": "2026-02-27 13:33:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p5iz2",
          "author": "Strange_Feedback_442",
          "text": "Yeah, the \"build more features\" trap is real. I wasted so much time on that early on.\n\nWhat I eventually learned is that nailing the *right* directories is key. It's not just about quantity, it's about quality and relevance. Don't just blindly submit to every directory out there.\n\nInstead, find the niche directories that your target audience actually uses. Look for directories that are specific to your industry, or that cater to a particular demographic. They often have smaller audiences, but the conversion rate is way higher.\n\nTL;DR: Focus on niche directories that are relevant to your target audience instead of blasting your product on every site.",
          "score": 1,
          "created_utc": "2026-02-27 13:35:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7r55ak",
              "author": "ProductLedGrowth",
              "text": "I would love to know which directories have you used ",
              "score": 1,
              "created_utc": "2026-02-27 19:26:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7p9ap1",
          "author": "Famous_War_7057",
          "text": "How did you know it was time to stop building features and focus only on growth?",
          "score": 1,
          "created_utc": "2026-02-27 13:56:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pjt0z",
          "author": "kubrador",
          "text": "he stopped coding and accidentally discovered that more people seeing your thing beats a better thing nobody sees. wild concept.",
          "score": 1,
          "created_utc": "2026-02-27 14:53:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7sgg2t",
          "author": "Odd_Cell_3454",
          "text": "good ol' distribution is king. there is a scary principle which holds true for most.\n\nDo so much volume its unreasonable for you to succeed.\n\n  \nFind your ICP and get at them.",
          "score": 1,
          "created_utc": "2026-02-27 23:30:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tky77",
          "author": "Visual_Block_3768",
          "text": "I’m in same process",
          "score": 1,
          "created_utc": "2026-02-28 03:38:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vut05",
          "author": "BP041",
          "text": "this hits close to home. spent months adding features to our B2B product thinking that was the bottleneck -- turned out our ICP couldn't even find us. the moment we shifted effort from building to distribution (cold outreach, content, partnerships) revenue went from flat to growing.\n\nthe hard part is it feels unproductive. writing code = visible progress. writing 50 cold emails = feels like you're wasting time. but the emails moved the needle way more than any feature ever did.",
          "score": 1,
          "created_utc": "2026-02-28 14:34:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfbk6w",
      "title": "Paid media agency - is it necessary for small business like mine?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rfbk6w/paid_media_agency_is_it_necessary_for_small/",
      "author": "GeneralAd2674",
      "created_utc": "2026-02-26 14:27:06",
      "score": 12,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "Hey! As a small business owner dabbling in the realm of paid media, I'm constantly weighing the costs and benefits and not sure what to do next. \n\nWe sell bedding in US and Canada and are actively trying to expand within these markets. Right now, I really believe in Google and Facebook ads, but I understand that this is a place where you can spend a crazy amount of money on SEO and PPC services without seeing any clear results, and I would like to avoid that at any cost. The first thing that comes to mind is a paid media agency, but wouldn't that be overkill for a small company with a dozen employees and no million-dollar turnover? I also thought about freelancers and SaaS solutions, but see a number of serious difficulties with both so idk.  \n  \nI'm not asking you to recommend any specific names (pls no namedropping here), but I'd like to know what you would trust first when it comes to digital marketing for startups: Google & Facebook ads with pay-per-click or something else? (So far, we don't have much except word of mouth, a poster in Austin, and a couple of spots on local radio stations). If vector is correct and PPC will work well in my situation, would you advise me to look into turnkey performance marketing services from large agencies, or would a freelancer be enough?\n\nThank you.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rfbk6w/paid_media_agency_is_it_necessary_for_small/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7jfz7u",
          "author": "HeTpt",
          "text": "In my experience, the decision isn’t really agency vs freelancer... it’s whether you already have a clear acquisition model.\n\nIf you know your targets, roughly what CAC should look like, and where demand is coming from, external help can absolutely accelerate things.  \nIf you don’t, it often just turns into spend without much learning.\n\nWhat I’m seeing more lately is a kind of middle ground: hands-on growth consulting where the first step is understanding the data, funnel, and historical performance to figure out what’s actually holding growth back and then supporting execution once the picture is clear.\n\nIt tends to work well for smaller teams because you avoid heavy agency overhead but still get a structured approach instead of pure trial and error.",
          "score": 2,
          "created_utc": "2026-02-26 16:35:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nz294",
              "author": "Kaumudi_Tiwari",
              "text": "Honestly, this makes a lot of sense.\n\nI’ve seen the same thing — when there’s no clear acquisition model, it doesn’t really matter whether it’s an agency or a freelancer. It just becomes activity without direction. And that usually means spend without real insight.\n\nThat middle-ground approach feels smarter, especially for smaller teams. Taking time to really understand the data, the funnel, and what’s actually blocking growth before pushing execution saves a lot of wasted effort.\n\nOnce the picture is clear, scaling feels way more intentional instead of experimental.\n\nAppreciate you sharing this — it’s a perspective more teams probably need to hear.",
              "score": 1,
              "created_utc": "2026-02-27 07:49:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7jxeh1",
          "author": "ppcwithyrv",
          "text": "How much are you spending  per day and how much are you trying to sell.\n\n",
          "score": 1,
          "created_utc": "2026-02-26 17:55:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7k85c3",
          "author": "aviral-bhutani",
          "text": "honestly, I wouldn’t jump to a big agency yet.\n\nagencies are great when you already know your numbers and you’re ready to scale. If you’re still figuring out what actually works, that retainer can burn fast.\n\nfor bedding, Google Search (high intent) + some controlled Meta testing makes sense. But before anything, make sure:\n\n* Your margins can handle ads\n* Your site converts well\n* You’re clear on what makes you different\n\ni’d start small , either test it yourself with a tight budget or hire a solid freelancer. Once you know your CAC and what’s working, *then* think about an agency.\n\npaid ads don’t fix positioning ,they just amplify it.",
          "score": 1,
          "created_utc": "2026-02-26 18:44:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nltrf",
          "author": "United_Broccoli_4032",
          "text": "For a small biz with limited budget and a dozen people, spending on a big paid media agency can definitely feel like overkill. Since you’re already leaning into Google and Facebook ads, something that actually automates and tests your Meta ads nonstop could save you a ton of trial and error and wasted spend. Instead of scrambling to figure out the right audience or creatives yourself or managing freelancers, an AI-powered tool that shifts ad spend to what’s working can seriously lower the risk and save time. That way, you get to squeeze more out of your ad dollars without feeling like you’re throwing money in the dark.",
          "score": 1,
          "created_utc": "2026-02-27 05:57:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pbaxz",
          "author": "Funny-Newt622",
          "text": "In my experience, since you're selling bedding, you’re in a \"visual + intent\" category.\n\n* **Google Ads is your \"Safety Net\":** When someone types \"best linen sheets Canada,\" they are ready to buy. If you aren't there, you're literally giving money to your competitors. It's high-intent and very predictable once it's dialed in.\n* **Meta (FB/IG) is your \"Scale Engine\":** Most people aren't searching for sheets every day, but they *are* scrolling. A great video showing the texture of your fabric or a \"sleep hack\" tip can stop the scroll and create a customer who wasn't even looking.\n\n**The \"Something Else\":** Since you've done local radio and posters, I’d look into **Retargeting**. If someone visits your site from that Austin poster but doesn't buy, a consultant can make sure your ads follow them on Google and Meta for the next 7 days. It’s the highest ROI thing you can do.",
          "score": 1,
          "created_utc": "2026-02-27 14:07:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pez6d",
          "author": "Pretend-Raspberry-87",
          "text": "unpopular take but agencies burn through small biz budgets fast because bedding has terrible margins for paid ads. tbh most ecom brands in your position see better roi from organic channels first - reddit posts ranking in google, helpful content in home decor subreddits. build that foundation then layer in paid.\n\nor just skip the whole learning curve with Community Mentions.",
          "score": 1,
          "created_utc": "2026-02-27 14:28:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rg62r5",
      "title": "Are AI employees actually improving customer acquisition or just speeding up busywork?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rg62r5/are_ai_employees_actually_improving_customer/",
      "author": "Prestigious_Rub_9758",
      "created_utc": "2026-02-27 13:02:50",
      "score": 10,
      "num_comments": 15,
      "upvote_ratio": 1.0,
      "text": "Every growth podcast now talks about AI employees. The term sounds impressive, but I don't know how to feel about it yet.  \n  \nIf AI speeds up the work, great but that's cost optimization, not really growth. Are AI employees making an impact on acquisition? Better response times, higher conversion rates, shorter sales cycles? Or are we just dressing up automation with a new label?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rg62r5/are_ai_employees_actually_improving_customer/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7p1xb5",
          "author": "Conscious_Sock_4178",
          "text": "It's a good question. In my experience, the real value of AI right now is in making the *right* work faster, not necessarily automating everything.\n\nFor example, I've been using AI to personalize my outreach emails, and I've seen a bump in response rates. But that only works if the offer is solid to begin with. If the underlying product-market fit isn't there, AI just gets you to \"no\" faster.\n\nAnd yeah, I think there's definitely some marketing fluff around the term \"AI employee.\" It's easy to get caught up in the hype and forget the fundamentals. Are you actually getting better results, or just doing the same stuff faster?",
          "score": 1,
          "created_utc": "2026-02-27 13:15:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p289b",
          "author": "SquareDesperate4003",
          "text": "AI doesn't close deals. It just makes it harder to forget things that help close deals or find extra details that might help.",
          "score": 1,
          "created_utc": "2026-02-27 13:16:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p2bzz",
          "author": "Fantastic_Run2955",
          "text": "Throughput increased for us.Revenue impact followed because the team had more capacity to sell.",
          "score": 1,
          "created_utc": "2026-02-27 13:17:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p2cev",
          "author": "BlueDolphinCute",
          "text": "Some tools integrate AI directly into customer acquisition workflows instead of offering standalone bots. Vendasta is what i see online that embeds AI into prospecting and engagement steps. That feels more tied to growth than random automation plugins.",
          "score": 1,
          "created_utc": "2026-02-27 13:17:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p838p",
          "author": "Informal_Data5414",
          "text": "We're all looking for the connection between ai and growth. There are some decent ai tools around currently but they'll get better over time.",
          "score": 1,
          "created_utc": "2026-02-27 13:50:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p8jao",
          "author": "Designer_Money_9377",
          "text": "something that often gets overlooked is how much \"busywork\" directly impacts the speed of acquisition. i've tried using AI for initial lead qualification and it definitely cut down the time my sales team spent on dead ends.\n\nit's not just about cost savings. faster qualification means they can focus on genuinely interested prospects sooner. that directly shortens the sales cycle.\n\nso, look for areas where AI can remove friction in your existing acquisition funnel, not just add new steps.",
          "score": 1,
          "created_utc": "2026-02-27 13:52:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pcwpe",
          "author": "DisastrousBar7",
          "text": "I've been growing my SaaS for about two years - primarily through paid ads. I got to the point late last year where I just couldn't stomach the paid ads treadmill any more - too expensive for not enough results. So I started going hard on organic channels - tiktok, reddit, seo, X, Linkedin and some PR to support SEO. \n\nI'd been out of the organic game for like 5 years but am pretty deep with claude code and cowork. \n\nI set up 1-2 plugins for each of these channels that scan the channels a few times a day, finds what my customers are saying, and suggests comments/posts to be in the conversation. \n\nIdk if I'd ever pay a person to do this - probably not - but it means that I can spend like 2hrs in the morning doing just about ALL my marketing (save for the days where the TT videos are particularly challenging to film). And then I spend the rest of the day working on products. \n\nSo I guess yes, it's speeding up busywork - but so much of marketing is just busywork, that it can be truly wildly valuable. \n\nNow I'm driving just as much revenue as I was from paid ads, by just spending a few hrs per day - and I expect I can improve and speed up the agents even more.",
          "score": 1,
          "created_utc": "2026-02-27 14:16:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pfr7h",
          "author": "Cool-Gur-6916",
          "text": "“AI employees” are mostly turbocharged busywork right now—faster emails, auto-generated content, basic follow-ups. That’s cost optimization, not real growth. True impact on acquisition comes from AI amplifying human insight: smarter segmentation, predictive targeting, personalized offers, and faster, context-aware responses. Without strategy and judgment, an AI employee is just a fancy robot doing tasks, not actually driving revenue.",
          "score": 1,
          "created_utc": "2026-02-27 14:32:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7phrs4",
          "author": "aviral-bhutani",
          "text": "i think a lot of “AI employees” right now are just automation with a better name.\n\nif it’s writing emails faster, summarizing calls, updating CRM fields, that’s great. It saves time. But that’s cost efficiency, not growth.\n\nit gets interesting when it actually changes the acquisition numbers:\n\n* Faster replies → more booked meetings\n* Better qualification → reps talk to real buyers\n* Consistent follow-ups → fewer deals die\n* Personalization at scale → higher response rates\n\nthat’s not busywork. That’s revenue impact.\n\nthe mistake I see is people plugging AI into a messy funnel and expecting magic. If the process is broken, AI just helps you run it faster.\n\nso yeah, I’m skeptical of the hype, but not of the potential.\n\nhave you seen anyone use it in a way that clearly moved conversion rates, not just productivity?",
          "score": 1,
          "created_utc": "2026-02-27 14:42:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7q7nz6",
          "author": "Fun_Mycologist_7791",
          "text": "its busywork optimization dressed up as growth\n\nreal customer acquisition comes from finding new people who dont know you exist yet. AI cant do that. it can respond faster, qualify leads better, automate follow ups - but thats all efficiency not acquisition\n\nthe conversion rate improvements people talk about are usually just fixing what was already broken. if your response time sucked and now AI fixes it, cool, but you were leaving money on the table anyway\n\nwhere AI actually helps is letting you scale without hiring 10 support people. so you can push more traffic without worrying about response capacity. thats useful but its still supporting growth not creating it\n\neveryone wants the magic bullet. AI employees aint it. theyre just better plumbing",
          "score": 1,
          "created_utc": "2026-02-27 16:47:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qcs2y",
          "author": "ActivitySmooth8847",
          "text": "AI employees mostly speed up busywork but can help with acquisition if they improve lead quality or response times. But if AI just automates tasks without better targeting or faster follow-up, it’s mostly cost saving, not growth.",
          "score": 1,
          "created_utc": "2026-02-27 17:11:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rf6cz",
          "author": "pantrywanderer",
          "text": "Honestly, most of the “AI employees” I’ve seen are just speeding up busywork. Drafting emails, summarizing data, repetitive outreach, stuff that used to eat up hours. That’s efficiency, not real growth.  \n  \nThey actually start making a difference when they help you make smarter decisions, like better targeting, messaging that actually converts, or spotting trends humans might miss. Without that, it’s just automation with a fancy new name.  \n  \nSo yeah, they make the team move faster, but they won’t magically boost conversions on their own. You still need strategy and human judgment.  \n",
          "score": 1,
          "created_utc": "2026-02-27 20:16:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7v2fzg",
          "author": "Amazing_Brother_3529",
          "text": "I think you’re asking the right question. If AI just drafts emails faster or summarizes calls, that’s efficiency. Helpful, but not growth.\n\nThe real impact happens when it’s plugged into acquisition loops: consistent outbound, regular SEO-driven content, fast follow-ups, tighter lead qualification. That’s where you see better response rates and shorter sales cycles.\n\nI’ve been testing one of the AI employee setups like Marblism, and the value wasn’t speed, it was execution without gaps. Fewer missed follow-ups, more consistent publishing. So IMO it improves acquisition only when it owns revenue activities, otherwise it’s just dressed-up automation.",
          "score": 1,
          "created_utc": "2026-02-28 11:16:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rci5qf",
      "title": "Unpopular opinion: \"Content Velocity\" is killing my brand. How do you scale without sounding like a bot?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rci5qf/unpopular_opinion_content_velocity_is_killing_my/",
      "author": "gandalfthesupagrey",
      "created_utc": "2026-02-23 13:59:14",
      "score": 8,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Everyone says \"publish more, rank higher.\" So I tried it. I ramped up from 1 post/week to 5/week using a mix of freelancers and AI tools.\n\nThe result? My traffic graph looks nice (impressions are up), but my engagement and conversions are actually *down*. The content feels... thin. It lacks that \"human\" touch that actually builds trust.\n\nI'm starting to think \"velocity\" is just a trap to sell more AI tools. \n\nBut I can't go back to writing everything myself or I'll never grow. \n\nHow are you guys finding the balance? Is there a way to automate the \"grunt work\" (keywords, formatting, distribution) without outsourcing the actual *thinking*? Or do I just need to hire expensive editors?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rci5qf/unpopular_opinion_content_velocity_is_killing_my/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6yi4s7",
          "author": "MarcusUranus",
          "text": "I had the exact same issue last year. The problem was trying to replace the *human* part (writing) with AI.\n\nWe switched to a hybrid approach: I write the core ideas and outlines, then use [RebelGrowth](https://tryrebelgrowth.com) for the heavy lifting (keywords, E-E-A-T structure, internal linking, etc). It lets me keep the quality but handle the volume. \n\nHonestly, automating the distribution/repurposing saved us more time than the writing part anyway. Maybe focus on automating the grunt work, not the creative work?",
          "score": 1,
          "created_utc": "2026-02-23 14:42:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ynhi2",
          "author": "RobertLigthart",
          "text": "the traffic up but conversions down thing is the tell. impressions are a vanity metric when the content isnt actually resonating with anyone\n\n  \nwhat worked for me was going to 2-3 posts/week instead of 5 but spending the extra time on distribution and repurposing. one solid post turned into linkedin posts, tweets, email content etc. got way more mileage than 5 mediocre blog posts that nobody shared\n\n  \nthe \"publish more rank higher\" advice is technically true but it only works if each piece actually answers a question better than whats already out there",
          "score": 1,
          "created_utc": "2026-02-23 15:10:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcb89o",
      "title": "Finally reached the audiences we actually wanted here’s what worked",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rcb89o/finally_reached_the_audiences_we_actually_wanted/",
      "author": "Boring_Analysis_6057",
      "created_utc": "2026-02-23 07:40:56",
      "score": 8,
      "num_comments": 5,
      "upvote_ratio": 0.91,
      "text": "Just wanted to share this with you guys, for months we were struggling to get our message in front of the right people. We tried multiple channels, ran ads, and experimented with different campaigns but engagement never matched our expectations. Then we tested a streaming CTV approach, and it completely changed the game. Suddenly, we were reaching exactly the kind of audience we had been chasing: people who were genuinely interested, highly engaged, and responsive to our campaigns. The best part was how efficient and accessible it felt. Campaigns launched faster, reporting made sense, and we could see which placements were actually driving results. It wasn’t magic targeting and creative still mattered but finally, it felt like our message wasn’t just floating in the void. \n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rcb89o/finally_reached_the_audiences_we_actually_wanted/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6x1e5b",
          "author": "EyeImpossible4412",
          "text": "Yess so happy for u",
          "score": 1,
          "created_utc": "2026-02-23 07:48:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x2va9",
          "author": "WoodpeckerNo9461",
          "text": "The fact that you mentioned reporting being clearer actually means a lot, since old school TV always felt like just throwing a message out and hoping for the best.",
          "score": 1,
          "created_utc": "2026-02-23 08:02:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x6mwn",
          "author": "KeyChemistry794",
          "text": "You nailed something that gets missed a lot campaigns are only as good as the feedback you get, and most digital platforms still dont lay it out in a way thats easy to connect to actual business outcomes. A programmatic tv advertising Vibeco was so useful for us sorted out our issues with reaching engaged viewers way better than other methods.",
          "score": 1,
          "created_utc": "2026-02-23 08:40:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xjhbj",
          "author": "blitztask",
          "text": "That's cool",
          "score": 1,
          "created_utc": "2026-02-23 10:45:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ak0lm",
          "author": "Former_Tea1131",
          "text": "CTV really is a game changer when you nail the setup. We've seen similar results with clients who switched from traditional digital and the transparency in reporting makes optimization so much cleaner. We are on self serve using vibe co and its made ctv accessible without the usual agency overhead.",
          "score": 1,
          "created_utc": "2026-02-25 08:19:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgus7t",
      "title": "How AI Search Visibility Differs From Traditional SEO",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rgus7t/how_ai_search_visibility_differs_from_traditional/",
      "author": "Ok_Falcon_8796",
      "created_utc": "2026-02-28 05:59:31",
      "score": 7,
      "num_comments": 14,
      "upvote_ratio": 0.9,
      "text": "&#x200B;\n\nI’ve been experimenting with AI tools like ChatGPT and Perplexity to see which pages they actually reference in answers. What surprised me most is how different it feels compared to traditional SEO.Some pages that barely rank on Google still show up consistently in AI answers, while some high‑ranking sites almost never get mentioned. A few patterns that seem to matter:1. Clear, direct answers: AI tends to reference pages that answer directly without filler.2. Structured content: Headings, bullet lists, and short sections help AI parse and reference.3. Community context: Pages mentioned in forums or niche discussions often get more traction in AI responses.4. Consistency over time: Pages that remain accurate and focused tend to be referenced more when patterns are tracked.Manual tracking across models gets messy quickly. I’ve been organizing observations with a small workflow helper (AnswerManiac), which makes trends easier to spot.Has anyone else noticed this disconnect between AI visibility and Google rankings? How are you approaching it?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rgus7t/how_ai_search_visibility_differs_from_traditional/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7u75ge",
          "author": "Goldnetwork101",
          "text": "Yeah, I’ve seen the same thing. It's almost like AI models value different signals than Google's ranking algorithm.\n\nThat \"clear, direct answers\" point is spot on. I've noticed pages that get straight to the point, even if they're not super polished, tend to do well. Also, shorter paragraphs seem to matter more than I thought.\n\nAnd that bit about community context… makes sense. AI probably sees those mentions as endorsements of some kind.",
          "score": 1,
          "created_utc": "2026-02-28 06:25:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7u75hd",
          "author": "Ok-Camera5397",
          "text": "I've noticed the same thing. Some of the blogs I wouldn't even consider \"high authority\" are crushing it in AI summaries.\n\nThat point about clear, direct answers is spot on. I've seen AI completely skip over articles that are well-written but take forever to get to the point. Hammering pain points cuts through the noise, I guess.\n\nStructured content matters a ton too. Big walls of text seem to get ignored, in my experience.",
          "score": 1,
          "created_utc": "2026-02-28 06:25:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ug0ub",
          "author": "17__Mahir",
          "text": "Thats an interesting observation on the disconnect between Google rankings and AI visibility. For mid-size to enterprise teams, this shift is forcing a move toward \"presence\" over just traffic.\nIve noticed some high-level agencies, like Taktical Digital, are calling this \"Brandformance\"-basically focusing on AEO, GEO, and AI Search signals to make sure a brand is consistently cited as an authority entity. It really does seem to favor structured, direct answers over the long-form filler that used to dominate traditional SEO.",
          "score": 1,
          "created_utc": "2026-02-28 07:44:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7uj2qm",
          "author": "talhafakhar",
          "text": "AI search rewards clarity, structure, and contextual relevance, while traditional SEO still leans heavily on backlinks and ranking signals.\n\nThat's the major difference ",
          "score": 1,
          "created_utc": "2026-02-28 08:12:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7uo0j6",
          "author": "AcademicAce",
          "text": "Traditional SEO relied solely on exact keyword matches, which means that if the document contains information you need but lacks the specific keyword or uses a synonym, the document will not appear in the search results. On the other hand, LLMs like ChatGPT use semantic relations, in the sense that they rely on \"intent.\" This means that two documents with different keywords both rank for relevance because LLMs understand their contexts.",
          "score": 1,
          "created_utc": "2026-02-28 08:57:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7uzh7r",
          "author": "Confident_Box_4545",
          "text": "AI tools do not care about who gamed Google best. They pull from pages that answer the question cleanly and get cited in real conversations.\n\nIf you want AI visibility, stop writing for algorithms and start writing the most direct answer on the internet to one specific problem.",
          "score": 1,
          "created_utc": "2026-02-28 10:49:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vlu0c",
          "author": "Rehana27",
          "text": "yeah this gap is getting kinda wild\n\ni've seen pages with almost zero google traffic show up consistently in AI answers just because they're clean *+ direct*\n\nfeels like AI cares more about:  \n– extractability (can it pull a clean answer fast)  \n– clarity over depth  \n– repeated mentions across the web (not just backlinks)\n\nvs google still leaning heavily on authority + links\n\nalso noticed that smaller niche sites get picked more if they \"explain one thing really well\" instead of trying to rank for everything\n\nyour point on community mentions is interesting. i’ve been seeing reddit/forum citations show up a lot in answers too\n\nhow are you tracking across models right now? manually or did you build something for it?",
          "score": 1,
          "created_utc": "2026-02-28 13:42:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vy7cd",
          "author": "Final-Donut-3719",
          "text": "This is exactly what I've been seeing too. The disconnect is real. Pages that crush it on Google sometimes get zero love from AI tools, while smaller niche sites show up constantly because they actually answer questions well. The manual tracking thing is brutal though, you're right. I've been using LLM Relevance Directory to keep tabs on where we show up across different AI platforms. It's been a game changer for spotting patterns we'd totally miss otherwise, especially when you're trying to figure out which content actually moves the needle. Have you tried mapping your content against specific AI models yet, or still just observing for now?",
          "score": 1,
          "created_utc": "2026-02-28 14:53:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wduo7",
          "author": "RobertLigthart",
          "text": "the forum thing is huge and nobody talks about it enough. I've noticed chatgpt pulls from reddit threads way more than from polished blog posts... probably because real conversations have the actual answers people are looking for, not some SEO-optimized fluff. if you want to show up in AI answers just be genuinely helpful in communities where your audience hangs out",
          "score": 1,
          "created_utc": "2026-02-28 16:13:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7zh5xi",
              "author": "jeff-howell",
              "text": "There's a book called They Ask You Answer that shows the value of providing actual answers in website and other content. It's a great book if you're interested",
              "score": 1,
              "created_utc": "2026-03-01 02:18:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7wien4",
          "author": "Easy-Affect-397",
          "text": "I’ve noticed the same thing  pages that rank lower on Google sometimes appear way more in AI answers than big authority sites. Tracking it manually is such a pain, but having a small workflow helper like AnswerManiac makes spotting recurring patterns way easier.",
          "score": 1,
          "created_utc": "2026-02-28 16:36:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wigjx",
          "author": "Alarming_Bluebird648",
          "text": "The fact that high-ranking sites are being skipped by Perplexity shows that semantic relevance is now outperforming traditional domain authority in discovery. We’re focusing on \"citation rate\" as a core metric, since structured data drives more AI references than standard long-form SEO.",
          "score": 1,
          "created_utc": "2026-02-28 16:36:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wj129",
          "author": "Enough_Payment_8838",
          "text": "I’m curious if others are testing multiple AI tools at the same time. Sometimes one AI favors a different set of pages than another, which makes it tricky to track without some kind of organized workflow like AnswerManiac.",
          "score": 1,
          "created_utc": "2026-02-28 16:39:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7z8ky8",
          "author": "xtomleex",
          "text": "The real shift isn't just intent based understanding, it's citation triggers. LLMs need clear, attributable sources with strong entity signals. We've seen cases where restructuring content for better entity recognition increased AI mentions by 40% without touching Google rankings.",
          "score": 1,
          "created_utc": "2026-03-01 01:26:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}