{
  "metadata": {
    "last_updated": "2026-01-20 08:59:57",
    "time_filter": "week",
    "subreddit": "GrowthHacking",
    "total_items": 20,
    "total_comments": 183,
    "file_size_bytes": 189890
  },
  "items": [
    {
      "id": "1qdhj5v",
      "title": "Raised $7M, then the AI wave made our product obsolete. We have 8 months of cash left and I can't code",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qdhj5v/raised_7m_then_the_ai_wave_made_our_product/",
      "author": "Ok-Weekend-2343",
      "created_utc": "2026-01-15 11:53:44",
      "score": 305,
      "num_comments": 84,
      "upvote_ratio": 0.93,
      "text": "I wanted to share our story, because the last year has been one of the hardest of my life.\n\n  \nBack in 2023, things were looking great. We'd raised a $7M Series A for our IoT business. I’m the non-technical founder (my background is in finance and comms), and my co-founder is the tech lead. We had a solid product, real revenue, and happy customers. I thought we were on the right track.\n\n  \nThen, in late 2024, the market just... changed.\n\n  \nEvery investor meeting suddenly became an interrogation about our AI strategy. We didn't have one. We were an infrastructure company, and overnight, that wasn't interesting anymore. The excitement for what we were building just vanished.\n\n  \nWe looked at our burn rate and the bank account: 8 months of cash left.  \nThe toughest part of being the non-technical founder in a situation like this is the specific kind of helplessness you feel. I can't jump into the code. I can't help build our way out of the problem. My job is to find the answers and steer the ship, but I was watching the clock tick down, feeling like I was failing my team.\n\n  \nTo make it worse, we couldn't just shut down the old business. We have long-term contracts with enterprise clients, and walking away would mean getting sued into oblivion. So we had to do this crazy balancing act: keep the old lights on to pay the bills, while pivoting the entire team to build a new AI hardware product for devs.\n\n  \nI honestly thought we wouldn't make it.\n\n  \nWe didn't raise a single dollar in 2025. VCs wouldn't touch us. We had to cut costs brutally. I had to tell the team: look, we have until August, if this new thing doesn't work, we're done.\n\n  \nSomehow, we’re still here. It’s Jan 2026 and we're about to launch the new product. I’m currently trying to figure out how to spin this off into a new entity so our original investors don't get screwed, which is a whole other nightmare.\n\n  \nJust wanted to share this for anyone else who feels like they're drowning in this AI shift. Pivoting a 40-person company with no new money is the hardest thing I've ever done.\n\n  \nIf anyone has experience spinning off a new product while keeping legacy investors happy, I’d love to hear how you handled the equity split.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qdhj5v/raised_7m_then_the_ai_wave_made_our_product/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzq6lhj",
          "author": "zenitr0",
          "text": "If the new product succeeds massively, would a reasonable original investor say “we were fairly treated”?\n\nIf the answer isn’t an immediate yes, fix the structure now. Because time will not make it better.",
          "score": 19,
          "created_utc": "2026-01-15 13:47:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzrdb19",
              "author": "bdegroodt",
              "text": "I believe this is the most important advice here right now. Think a couple steps down the board. Investors are pre-disposed to a lot of losses. It's portfolio theory. That said, they remember how they were treated through those losers (and winners) and I'd rather live to fight another day, in another battle, than to burn bridges here.\n\nGood luck, OP. This is a moment of both huge upside and some serious reckonings.  If you got this far, you likely have what it takes to make it under the new dynamics..",
              "score": 7,
              "created_utc": "2026-01-15 17:10:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o03rrz3",
              "author": "Fit-Signature4125",
              "text": "OP can offer share or warrants in the new company not exceeding 40%, so as to retain a controlling stake in the new company.",
              "score": 1,
              "created_utc": "2026-01-17 13:51:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0klwz1",
                  "author": "mountains-sun-water",
                  "text": "I didn’t get why you need to spin it off. Early stage  companies pivot all the time without creating a new entity",
                  "score": 1,
                  "created_utc": "2026-01-19 23:49:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzq8yfk",
          "author": "professorhummingbird",
          "text": "Refreshing seeing what looks like an actual story and not a sales pitch. Good luck with the pivot. I would personally rather se a new infrastructure company than a new AI company but the bills have to be paid. I imagine your situation is stressful. What have your early adopters said about this new product?",
          "score": 9,
          "created_utc": "2026-01-15 14:00:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqd01b",
              "author": "Ok-Weekend-2343",
              "text": "Thanks, I appreciate it. Early adopter feedback has been pretty mixed, so we’re iterating fast — and it’s not easy. Our original business was a classic B2B model, which I’m familiar with.This new product is much more developer-centric. While it reuses a lot of our existing tech, the go-to-market motion is completely different, so there’s a lot of on-the-job learning for me right now.",
              "score": 1,
              "created_utc": "2026-01-15 14:21:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o03inrq",
                  "author": "DrasticIndifference",
                  "text": "Developer-centric pivots need fanatical users who don't care about the flow of profitability upstream.  If an ounce of \"we dialed this part in\" is experienced, it's hard to overcome.  Thinking of all the digital assistants and products that were well-positioned but didn't succeed...  I would love to imagine the problem being solved by your product is unique enough to ride out the strongly indicated bubble for both AI and infra, and that a pivot back to the original (with contracts) is not out of the realm of possibility.  It's remarkable that you have a potential for success in either scenario.  Well done.",
                  "score": 1,
                  "created_utc": "2026-01-17 12:53:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqcxj5",
          "author": "agin_",
          "text": "How could the “AI wave” make a IoT product obsolete? Considering you raised that much money, I would assume you had already PMF to iterate on, rather than trashing the entire strategy just to follow investor money",
          "score": 5,
          "created_utc": "2026-01-15 14:21:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqezy3",
              "author": "Ok-Weekend-2343",
              "text": "Fair question. The IoT product itself didn’t fail — it still generates some cash flow today.\n\nThe real issue was scale and timing. Going into the AI shift, our IoT team was intentionally built for aggressive growth, which assumed continued access to capital. When funding dried up almost overnight, the organic growth of the business couldn’t sustain a cost structure designed for hypergrowth. That put us in a very tough position.\n\nOn top of that, the way we’re financed means time matters. Waiting things out or slowly iterating wasn’t really an option.",
              "score": 6,
              "created_utc": "2026-01-15 14:32:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzqwnxe",
                  "author": "w4nd3rlu5t",
                  "text": "I’m so curious why you didn’t just sprinkle some AI on top of your IoT offering. Super vague but AI + hardware seems to be where the smart money is going these days",
                  "score": 5,
                  "created_utc": "2026-01-15 15:56:17",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzxtx4l",
                  "author": "bazkin6100",
                  "text": "You seem to be adept at using AI to generate this response! :)",
                  "score": 1,
                  "created_utc": "2026-01-16 15:54:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzrxcet",
          "author": "elevarq",
          "text": "What does IoT Business mean, what is it? IoT and AI go really well together, so I don’t understand how AI had a negative impact on your business",
          "score": 5,
          "created_utc": "2026-01-15 18:40:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqfujy",
          "author": "kubrador",
          "text": "damn, you're speedrunning every founder's worst nightmare at once. can't code, investors only speak AI now, ticking clock, and somehow the solution is \"build a whole new product with the same broke team\" - that's actually insane.\n\nthe equity split thing though? you basically need a corporate restructure where the old business stays its own entity (keeps original investors whole) and the new ai thing is a separate subsidiary where they can participate or dilute depending on what you negotiate. talk to a startup lawyer because this is the kind of thing that costs $30k now or $3M later in a lawsuit.\n\nbut real talk, if you actually launch this in january 2026 and it doesn't immediately crater, you've basically already won just by surviving. most companies fold before month 6.",
          "score": 15,
          "created_utc": "2026-01-15 14:36:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqkyvb",
              "author": "Ok-Weekend-2343",
              "text": "Appreciate the advice. And yeah, that last bit actually cheered me up a lot.",
              "score": 3,
              "created_utc": "2026-01-15 15:01:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o04tuzi",
                  "author": "SSObserver",
                  "text": "Yeah the restructuring is absolutely necessary, but the good news is you’re probably still eligible for the QSBS. If you want to dm me I’ve got a few good recs for startup lawyers in California and New York",
                  "score": 1,
                  "created_utc": "2026-01-17 17:01:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0fzakz",
              "author": "mikjey",
              "text": "Ts is so ai generated💀",
              "score": 1,
              "created_utc": "2026-01-19 08:15:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0gv77u",
              "author": "BL1860B",
              "text": "The the irony of this being an AI generated comment",
              "score": 1,
              "created_utc": "2026-01-19 12:54:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzqyl62",
          "author": "vikkey321",
          "text": "You have not mentioned details about your product or service at all. How does someone give ideas based on the abstracted detail. Being in IoT industry for so long and its hard to understand where you failed despite iot being a matured field. I have worked in similar teams. Pivoting is painful but you really need to chart out the plan. Perhaps run a design sprint with 2-4 weeks of prototyping and feedback sessions. This will rapidly cut down pivot time. If you can share more details, I can help in more deeper recommendations.\n\nAlso you not knowing coding is irrelevant here.",
          "score": 4,
          "created_utc": "2026-01-15 16:04:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr4sit",
          "author": "SweetDreams3268",
          "text": "Hopefully you’re treating your cofounder well and realizing their value. Most non technical cofounders treat their CTOs like cost centers",
          "score": 3,
          "created_utc": "2026-01-15 16:32:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzv32dh",
          "author": "jaytonbye",
          "text": "It sounds like downsizing the team is what was needed, but I hope your pivot works out. It's stressful to be a leader responsible for so many others. You seem like you're trying to do right. I wish you the best.",
          "score": 3,
          "created_utc": "2026-01-16 04:25:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqxji9",
          "author": "Artistic_Irix",
          "text": "A great story of difficult struggle and hopefully future success!\n\nThat said, did I understand it correctly that you built the new thing with the old company's resources, employees and funds?  If so, you need to take care of this now.",
          "score": 2,
          "created_utc": "2026-01-15 16:00:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvewvj",
          "author": "coolth0ught",
          "text": "It really suck to be in your position but I think there is always a silver lining to every difficult situation. It has forced you to be laser focused on things that really matter and adapt quickly. Good job surviving and getting to launching new product despite the circumstances.",
          "score": 2,
          "created_utc": "2026-01-16 05:46:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvquey",
          "author": "Informal_Piglet_1067",
          "text": "I've been in a similar position, venture backed business £10m+ raised, that went \\*bang\\* in a sense within 3 months of it's last raise. \n\nThe biggest thing I wish I'd made sure of is to of returned capital instead of burning through it trying to pivot. If investors have fallen out of love, don't wait to call in liquidators as it is horrific. I'm nearly 3+ years later and still going through the process with litigation. \n\nMake sure to get shareholder feedback prior to the pivot/foresight, especially if you have any US based investors. For some, if you switch it up, you might as well open an Ice Cream Shop to them as they will see it as misuse of capital. \n\nNot meaning to sound pessimistic, but unless this new product can hit it out the park, seriously make sure all directors/major shareholders (anyone over £25k investment) is in the loop. Also if you're EIS/SEIS raised make sure whatever you're doing still keeps your qualifying as that can also be effected.\n\nHappy to chat 1:1 as been through this personally.",
          "score": 2,
          "created_utc": "2026-01-16 07:22:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzxlqyd",
              "author": "Ok-Weekend-2343",
              "text": "Thank you for sharing this — seriously. This hits very close to home.\n\nI’m really sorry you’re still dealing with litigation years later. That’s brutal, and it’s exactly the outcome I’m trying hard to avoid. Your point about returning capital versus burning it on a pivot is something I’ve wrestled with, and hearing it from someone who’s lived through the consequences carries a lot of weight.\n\nYou’re absolutely right that hesitation — whether half-pivoting or delaying liquidation — can be just as damaging as making the wrong call. Drifting under pressure is often the worst outcome.\n\nI genuinely appreciate you taking the time to write this. It’s clear you’ve raised real money, made real decisions, and paid a real price for them. That perspective means a lot.",
              "score": 1,
              "created_utc": "2026-01-16 15:17:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0a5vzy",
                  "author": "Informal_Piglet_1067",
                  "text": "Feel free to DM me if you feel the need, its a complex web to navigate but the golden rule - over communicate with everyone at this point. But when you do, have conviction on the \"why\" you're making the decision you are.",
                  "score": 1,
                  "created_utc": "2026-01-18 12:43:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzygalv",
              "author": "MotherCash3583",
              "text": "Funding environment is very different in the U.K. / Europe. A U.S. startup can explode spectacularly and it is water off a ducks back — nobody litigates. Most startups are expected to do whatever to make things work, “misuse of capital” is absurd. I’d love to know your company name so I can look at the insolvency documents.",
              "score": 1,
              "created_utc": "2026-01-16 17:32:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzvwat1",
          "author": "poopsmith27",
          "text": "I loved this story almost exactly as well, you’re not alone!",
          "score": 2,
          "created_utc": "2026-01-16 08:11:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvxabt",
          "author": "Agitated-Board-4579",
          "text": "Share more about this new product.",
          "score": 2,
          "created_utc": "2026-01-16 08:19:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw16n9",
          "author": "Acceptable-Pin-1602",
          "text": "Interesting story, and respect for being this open about it. I’ve been through some hard periods in tech myself, not as a founder, but in senior leadership roles where the pressure, uncertainty, and responsibility still sit on your shoulders.\n\nI’m from the more technical side, and while building new things is exciting, reading this it feels less like a technical problem and more like a go-to-market and risk management one.\n\nThe AI “interrogation” phase you describe definitely caught a lot of companies off guard, you don’t really need to have an AI strategy, as others have said you can label any intelligence you’ve built as AI.\n\nI’m probably more risk-averse than most startup leaders, but relying on the next VC round as a core part of survivability is a big gamble, especially once you’re carrying enterprise contracts, a 40-person team, and real obligations you can’t walk away from.  You should also be looking to leverage these relationships to increase your recurring revenue through upsells and new pipeline.\n\nAI-assisted development can also help the velocity and productivity of your team massively.  I’m not saying to rely solely on AI to develop your products, but it sounds like you still need to make cuts to remain viable in addition to your new product launch.",
          "score": 2,
          "created_utc": "2026-01-16 08:56:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxyge4",
          "author": "NathanSupertramp",
          "text": "Good luck man, may the force be with you",
          "score": 2,
          "created_utc": "2026-01-16 16:14:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03nnkt",
          "author": "Popular-Stay-2637",
          "text": "Damn, this is one of the clearest “AI whiplash” stories I’ve seen. Appreciate you sharing it.\n\nA few things you actually did right (that most founders in your position don’t):\n\nYou didn’t nuke the legacy business even though investors stopped caring. You kept the contracts and cashflow instead of “burn the boats” LARPing.\nYou were honest with the team about the August deadline instead of pretending everything was fine.\nYou didn’t chase some vague “AI strategy deck” – you picked a specific new product (AI hardware for devs) and moved the org, which is insanely hard with ~40 people.\nStill, there are some brutal lessons in here for the rest of us:\n\nTheme risk is real. You built a legit infra company, real revenue, happy customers – and the narrative still killed your ability to raise. Anyone building now needs to assume the market mood can flip again in 12–18 months.\n\nBurn is the gun to your head. 40 people + 8 months of runway is a ticking time bomb. The real constraint wasn’t “no AI story”; it was lack of optionality. With a 10-person team and the same revenue, this is a very different story.\n\nNon-technical founders need a “crisis plan”. You described that helplessness perfectly. In calm times it’s fine; in a pivot, it’s a tax. The counter-move is:\n\nKeep the team as small and senior as possible.\nBuild direct customer access + distribution as your superpower so you’re not “just” steering.\nOn the spin-out / equity split question (the nightmare you’re in now):\n\nNot legal advice, but patterns I’ve seen that don’t blow everything up:\n\nSpin-out NewCo, but don’t pretend OldCo never existed.\nLegacy investors usually get some carry into NewCo (e.g. a small % of common or a “shadow” class) in exchange for:\n\nLetting the team move over.\nNot blocking IP transfer / license.\nAgreeing not to sue when you basically starve OldCo.\nTie economics to who’s actually doing the work now.\nFounders & team building the new product should own the bulk of NewCo. Legacy investors participate, but they don’t get to double-dip at the same price as before. Typical levers:\n\nNew option pool heavily weighted to the current/lean team.\nLegacy investors get a discounted SAFE or a fixed % that reflects risk they already took, not “we own 60% again.”\nClean story for future investors.\nNew investors will ask: “Who controls what, and what obligations does NewCo have to OldCo?”\nRed flags that kill deals:\n\nIP is ambiguous (OldCo maybe owns everything).\nLegacy investors have veto rights / weird ratchets.\nCap table is so crowded that there’s no room for new equity.\nPractically, if I were in your shoes and had to keep everyone (team + legacy investors) minimally sane:\n\nGet a brutally honest board-level meeting.\nPut three options on the table in writing:\n\nA) Run OldCo to cashflow + modest growth, no spin-out.\nB) Spin-out NewCo with clear cap table, legacy investors get X% and first check rights.\nC) Wind down in an orderly way.\nForce everyone to confront reality instead of hand-waving “we’ll see after launch.”\nDesign NewCo like you learned from this.\n\nMinimal team.\nRuthless burn controls.\nDon’t build “AI infra for infra’s sake” – pick a wedge devs would actually miss.\nProtect your own time and sanity.\nYou’re effectively running:\n\nA distressed infra business,\nA seed-stage deep-tech startup,\nAnd a legal/structuring mess. That’s three full-time jobs. Decide what only you can do (likely: narrative, key customers, and the spin-out deal) and delegate or kill everything else.\nIf you’re willing to share anonymously: I’d be very curious what you wish you’d done differently in 2023 when things looked great. My guess: slower hiring, tighter burn, and a product wedge closer to the AI/dev stack earlier.\n\nEither way, respect for fighting through this. Most companies just quietly die and pretend it was “a soft landing.” You actually tried to steer the ship while the market moved the ocean underneath you.",
          "score": 2,
          "created_utc": "2026-01-17 13:26:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ap4c5",
              "author": "Ok-Weekend-2343",
              "text": "First of all, respect like that from someone who’s clearly been through similar battles means a lot. Thank you! \n\nAnd, you’re right on timing. I’m already planning a board-level discussion, and this is very much a “sooner rather than later” decision, not something to defer until after launch. I’m genuinely going to sit with this and think it through. I’ve already decided to write a follow-up once things are a bit clearer, partly because comments like this deserve a proper response rather than a quick reply :)",
              "score": 1,
              "created_utc": "2026-01-18 14:43:02",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o0ls1aw",
              "author": "Select-Ad-1883",
              "text": "Very AI response",
              "score": 1,
              "created_utc": "2026-01-20 03:39:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o04xmoq",
          "author": "quizzs",
          "text": "I read similar situation in book called hard thing about hard thing, it might help",
          "score": 2,
          "created_utc": "2026-01-17 17:19:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr19hh",
          "author": "luckycat81",
          "text": "Was “success” after Series A clearly defined at the time of the raise?",
          "score": 1,
          "created_utc": "2026-01-15 16:16:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr55me",
          "author": "getoutlonnie",
          "text": "You don’t need to build your way out of a problem, you need to sell your way out of a problem. I just read ten paragraphs and not a single word about sales. ",
          "score": 1,
          "created_utc": "2026-01-15 16:34:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04kzbq",
              "author": "BeKindBeBrave",
              "text": "This jumped out at me too. And not a word about customer/buyer needs. Alarm bells when they said the market changed and described the investment landscape. That isn't the market.",
              "score": 1,
              "created_utc": "2026-01-17 16:20:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzshpbp",
          "author": "tastychaii",
          "text": "What are you guys doing to get funding? Which organisations are you approaching? I’ve never understood this part about raising seed capital for Start ups.\n\nI can’t help you all that much. All I can say is good luck!",
          "score": 1,
          "created_utc": "2026-01-15 20:12:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzta3e1",
          "author": "AlejandraH411",
          "text": "I’m not American but wouldn’t the company be legally and financially delegate from yourself if things don’t work out?",
          "score": 1,
          "created_utc": "2026-01-15 22:25:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0386pz",
              "author": "s733vo",
              "text": "I wondered that too, Alejandra.  However,  in some cases the veil of security between the corporate and personal can be pierced if mal-intent can be proved.  ( I’m not accusing the OP of any wrongdoing - just speaking hypothetically). Plus,  he’s worried about his team’s welfare .  That would keep me up at night too.\nBTW,  inspirational story, OP! 😄",
              "score": 1,
              "created_utc": "2026-01-17 11:29:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzue9zh",
          "author": "stepperbot6000",
          "text": "Hey I was looking for a remote job as an intern and iam mostly looking to learn let me know if u want another hand to help you out , I might be of some help in code and product development.",
          "score": 1,
          "created_utc": "2026-01-16 02:01:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzuqyjg",
          "author": "johnhas61",
          "text": "Get lean and Launch an Ai initiative that ties in with your product - you’re bootstrapping now",
          "score": 1,
          "created_utc": "2026-01-16 03:12:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzv1c90",
          "author": "Galaxy-Hitchhiker-42",
          "text": "The answer is definitely \\_not\\_ to build your way out.\n\nIt feels productive because you get instant, tangible results — but building without validating the market is exactly how founders tunnel deeper into the wrong direction. It’s a trap. It burns time, money, and emotional energy without getting you any closer to product–market fit. And as a technical founder, I’ve been there.\n\nInvestors asking about AI may not actually be about AI.  It can be their way of testing your understanding of where your market is headed, your ability to articulate long-term strategy, and your sense of future moat. It’s a question about vision, not features. A vision test, not a buzzword test.\n\nIf you’re still figuring out who you’re serving and why they’d pay, building won’t magically solve that. Strategy, customer discovery, and positioning are the uncomfortable parts — and they’re the things that determine whether anything you build actually matters.\n\nTBH, the risk here isn’t that the product is obsolete — it’s that you, the founder, might be reacting to investor pressure by building instead of thinking. And that’s the wrong direction to double down on.\n\nFrom your post, it’s not even clear that your product is “obsolete.”  It actually sounds like you’ve had some traction with customers, and some traction with fundraising - which means the foundation is there. What you’re feeling now is the pressure of needing to steer, not code.\n\nDon’t get lost in the noise. Don’t follow the sirens. Do what you need to do to keep the business afloat - and steer it toward a market that genuinely needs what you can offer.",
          "score": 1,
          "created_utc": "2026-01-16 04:14:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvizwi",
              "author": "Ok-Weekend-2343",
              "text": "Really appreciate this perspective. Looking back, I think at the end of 2024 I was probably reacting too much to investor pressure, and that pushed us into a pivot under a lot of stress. It’s a bit like an athlete whose form breaks down under extreme pressure.\n\nThat said, I do feel like we’ve since found more clarity and regained some calm around the direction. The main thing I need to sort out now is the leftover complexity around investors as we transition between the old and new efforts.\n\nThanks again — this was genuinely helpful.",
              "score": 1,
              "created_utc": "2026-01-16 06:17:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzw3e3e",
                  "author": "Galaxy-Hitchhiker-42",
                  "text": "Good to hear - and it’s encouraging that you’ve been able to regain some clarity. That can be incredibly hard in the fog of startups, especially while managing multiple (and often conflicting) investor expectations.\n\nKeep your eye on the prize: building a business that meets a real, growing demand. Investors might disagree with you in the short term, but if you can deliver that, they’ll come around quickly.\n\nKeep going. It sounds like you’re on the right track.\n\nIf you’re open to sharing more, I’m all ears - happy to listen.",
                  "score": 1,
                  "created_utc": "2026-01-16 09:16:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzv4dvj",
          "author": "Severe_Promise717",
          "text": "this is the part nobody warns you about as a non technical founder\n\nyour leverage is not code, it is clarity  \nwhen things went sideways for me, the only way out was brutal focus  \none bet  \none narrative  \none way the company survives\n\ntrying to hedge killed more startups than bad tech ever did  \nonce the team knew the real clock and the real goal, morale actually improved\n\npanic hides options  \nclear constraints create them",
          "score": 1,
          "created_utc": "2026-01-16 04:33:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvawmh",
          "author": "0utkast_band",
          "text": "I didn’t quite get one thing. Did you make the AI product using the original team? How did you pay for the new product dev expenses? \n\nAsking because I don’t understand, are you leaving the original investors behind?",
          "score": 1,
          "created_utc": "2026-01-16 05:17:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvkiut",
          "author": "adspendagency",
          "text": "good thing Claude knows how to code…",
          "score": 1,
          "created_utc": "2026-01-16 06:29:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw9o0n",
          "author": "QuantumWolf99",
          "text": "Hmmm brutal reality is you probably shouldn't have pivoted... keeping 40 people on 8 months runway while rebuilding guarantees you run out of cash before finding product-market fit in a saturated AI hardware market with zero differentiation.\n\nYour best move was aggressive cost cutting to 12-15 people extending runway to 18+ months, then validating demand before building... because now you've burned capital on a product nobody asked for while legacy contracts still drain focus.",
          "score": 1,
          "created_utc": "2026-01-16 10:14:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwkvq6",
          "author": "Specific_Cow_4246",
          "text": "What kind of IoT? I think there a ton of things you can do with that data.\n\n  \nI worked as a data engineer in some IoT companies, and there is massive value yo can give with that data. There is an oportunity. Sometimes to add \"IA\" you can just say: we will give value to that data through ia. Bullshit, it could be a model, a chatbot, a script that sends an email. The important thing is to trigger actionable to add value to clients = to reach more clients and add more value to the current ones.\n\nOne of the unicorns that Europa had in 2025 was a one that can do predictable maintenance to industrial machines. How do you do that? connecting IoT to them and measuring the ton the data they give.\n\nIf you want to dm me happy to help or a little talk about what i did",
          "score": 1,
          "created_utc": "2026-01-16 11:48:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzws2k5",
          "author": "DotAccording8872",
          "text": "I don’t understand the non-coding issue: can’t you help get more customers? That’s as valuable as coding (and sometimes more valuable).",
          "score": 1,
          "created_utc": "2026-01-16 12:39:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxac48",
          "author": "Green-Setting5062",
          "text": "Maybe start buying printed circuit board laminating equipment and hire some smart computer engineers and make motherboards for data centers in the United States and sell them to the defense contractors who have to use all American made stuff. And also do Roger's boards for high end government RF. Seem like how musk got Rich was government contracts. SaaS is dead. Vc needs to start funding critical infrastructure.",
          "score": 1,
          "created_utc": "2026-01-16 14:22:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzy2v12",
          "author": "IseeAlgorithms",
          "text": "They asked for an AI strategy, and now that you have one you need to hide it from them?",
          "score": 1,
          "created_utc": "2026-01-16 16:33:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzors1",
          "author": "No_Detail_9093",
          "text": "I’ve had to shut down my old company. I tried to pivot it while keeping old contracts alive. Failed. In hindsight, I would never again try to “chase two rabbits at once.” Looking back, I think many of my decisions were not radical enough. Today I try to make binary decisions.​​​​​​​​​​​​​​​​",
          "score": 1,
          "created_utc": "2026-01-16 20:54:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00i39m",
          "author": "Special-Style-3305",
          "text": "Sticking AI into everything doesn't mean much unless it serves as an actual utility to the end user. Glad you've got a new product in the works. The best stuff is usually borne out of necessity! Good luck.",
          "score": 1,
          "created_utc": "2026-01-16 23:19:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o010kfl",
          "author": "metamorphyk",
          "text": "Start moving cash and assets into your own name and liquidate",
          "score": 1,
          "created_utc": "2026-01-17 01:05:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o016k9c",
          "author": "OldFisherman8",
          "text": "In my experience, people invest in people, not in a product. No matter how good the ideas are, people simply don't invest unless they believe in you. In the end, it is the trust and commitment you make on their trust.\n\nI frankly don't understand your point about being non-tech in this age of AI. In the past, even if you understood the business processes and identified the problems and solutions, you simply couldn't code because you lacked coding syntax and grammar. But that is what AI excels at, coding grammar and syntax. In fact, what AI lacks is the understanding of business processes underneath. \n\nIn the end, AI is a tool just like any other thing in business. And if you are committed to solving a certain business problem and offering solutions, AI is a tool that can be used as a part of the solution. Nothing more, nothing less.",
          "score": 1,
          "created_utc": "2026-01-17 01:43:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o017y8d",
          "author": "Few-Mud-5865",
          "text": "you don't need to pivot,  you just change your mindset to see how you can rebuild your business with a AI+ mindset, like said in this article [AI+ business ](https://www.ai-sympathy.com/2025/12/ai-vs-ai-why-large-language-models.html)",
          "score": 1,
          "created_utc": "2026-01-17 01:52:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01w0g3",
          "author": "desexmachina",
          "text": "Unfortunately, one idea alone isn’t enough, at least you can be bought with this new idea. Don’t be afraid to bring in outside ideas because what happens is it starts generating other ideas. If you have a 40 person company, you have the people to make it happen. I’ve known of $Billion companies that couldn’t ideate their way out of a problem and they brought in outsiders to help make that happen.",
          "score": 1,
          "created_utc": "2026-01-17 04:29:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o020gzu",
          "author": "commentinator",
          "text": "I’m calling bullshit on this. Can’t jump ship because you’ll be sued into oblivion… ahh no, that is really not how it works. Are you IOT or infrastructure? You explain nothing about what you actually do or how AI affects your business. Complete crap",
          "score": 1,
          "created_utc": "2026-01-17 05:01:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02bldg",
          "author": "Loose_Historian",
          "text": "Been there done that. Raised similar money initially and built first product (B2B SaaS), initial success but then the market proved to be smaller than we thought and super crowded. Decided to build a second product within the same company, which was also an initial success (Enterprise B2B SaaS). We had to raise more money for sales and marketing, but the complexity of having 2 products with different target groups in a relatively early stage company (60 people) spooked all future investors. \nMy advice is: don't do it. Close the first business by giving money back to investors or just resign and let someone else lead that one. Start the second business with a small trusted team, clean cap table and new investors. Old investors won't trust you anymore and your goal should be to avoid any litigation (which will wear you down). \nHappy to talk and share my advice!",
          "score": 1,
          "created_utc": "2026-01-17 06:29:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02qd4f",
          "author": "robsantos",
          "text": "What category is the IOT device in? No chance for it to succeed?",
          "score": 1,
          "created_utc": "2026-01-17 08:42:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04zc9p",
          "author": "shoedy",
          "text": "Launching the new product paid for by your legacy investors that won’t see any returns by putting it in a new entity is going to bring its own lawsuits for sure. You can’t just transfer that intellectual property without consequence, especially if it will prove to be valuable",
          "score": 1,
          "created_utc": "2026-01-17 17:27:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09eu8g",
          "author": "Medium_Web_1122",
          "text": "Why not learn to code? The learning curve is super easy these days with Claude ",
          "score": 1,
          "created_utc": "2026-01-18 08:43:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09s4yl",
          "author": "Advanced-Lake-7354",
          "text": "Just say your new features are the same but put the word AI in front of it. \n\nLiterally it’s what every other company is doing…. Just say it’s AI infrastructure that does AI dynamic IoT management and boom you’re back in the game.",
          "score": 1,
          "created_utc": "2026-01-18 10:46:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09v2j4",
          "author": "rt2828",
          "text": "Knowing everything you know today, would you organize your company the way it exists today? Can you reduce cost while still serving your current customer base to increase your runway for a pivot? Instead of fighting AI, can you find a way to lean in and leverage it for growth and reducing cost? If you cannot find a way to change the current situation, shut it all down now because it won’t be easier when you completely run out of $.",
          "score": 1,
          "created_utc": "2026-01-18 11:13:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09zdv7",
          "author": "szymon-slowik-seo",
          "text": "Is there any potential for a new low effort income generating business line? What your company actually does?",
          "score": 1,
          "created_utc": "2026-01-18 11:51:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0a51hn",
          "author": "SomedaysDog",
          "text": "Look to calibrate the market and see what M&A advisors say. There are plenty of buyers out there who will buy as a bolt on. Speak to tech mid market advisors who will tell you straight. A few are run by ex-CEOs who have been there and know the way out of the hole.",
          "score": 1,
          "created_utc": "2026-01-18 12:37:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f20ni",
          "author": "bihwhou",
          "text": "You will not fail",
          "score": 1,
          "created_utc": "2026-01-19 03:57:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g6mqo",
          "author": "gordo1223",
          "text": "Multiple teams that I advise have had to do similar - find an off-ramp from the VC treadmill.   \n  \nFunding rounds (especially follow-on priced rounds like yours) now are very much a dumbbell distribution unless you've got AI under the hood and exponential growth driving topline.\n\nMost of my teams have figured out a path to default alive and a way off of the VC juice. Honestly, I think that on a 2-4 year timescale, they'll be much healthier and have better economic outcomes for their teams than those who chose to stay on the VC juice.",
          "score": 1,
          "created_utc": "2026-01-19 09:25:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jjx3b",
          "author": "Wingman602",
          "text": "Man, this hit close to home.\n\nI ran an IoT company, started it in 2016, we monitored IoT products in the field. We didn’t raise $7M, but we scaled to \\~$75k MRR with real customers and traction. Then my technical co-founder pulled us deep into an AI rabbit hole, chasing what might be possible instead of protecting what was already working. Long story short: we lost the company... There's a lot more that led up to this but in the end that's what happened. Still cleaning up the mess today and we basically shut down in Oct. 2024. \n\nA few things I wish someone had told me earlier, especially as a non-technical founder:\n\n* The helplessness is real, but it’s not useless. You may not write code, but you own framing, sequencing, and constraints. In pivots, the most dangerous thing isn’t bad code, it’s unclear decision logic. Your value right now is forcing the tech team to choose what not to build.\n* AI didn’t kill your company, narrative whiplash did. Most infrastructure businesses didn’t become obsolete overnight; they became harder to explain. Investors moved the goalposts faster than products could adapt. That’s a mismatch of timing, not a failure of execution.\n* The “keep the lights on + pivot” phase breaks founders quietly. You’re running two companies with one balance sheet and no applause, man. The fact you’re still standing in Jan 2026 puts you in rare territory.\n\nOn the spin-off question (learned this the hard way):\n\nTo keep legacy investors happy:\n\n1. Be surgical about IP: Be explicit about exactly what IP belongs to the legacy entity vs. the NewCo\n2. Separate Value from Control: Give legacy investors a path to upside (equity in NewCo) without giving them the ability to choke the new pivot's agility.\n3. Document the \"Failure State\": Write down now what happens if NewCo stalls. “We’ll figure it out later” breeds resentment faster than dilution ever will.\n\nYou didn’t fail your team. You carried them through the hardest possible version of a pivot: no money, no hype, and no safety net. What you’re doing right now is founder-level leadership, even if it feels like drowning.\n\nHang in there.",
          "score": 1,
          "created_utc": "2026-01-19 20:38:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ky94r",
          "author": "Lareinadelsur99",
          "text": "Ai Is turning the internet to trash unfortunately VC are mostly stupid so that’s what they focus on.\n\nMost VC only care about short term profitability and they know Ai is the latest thing \n\n\n\nCould be worth outsourcing to an Ai expert to take over that part until people realise it’s ruining  the user experience and erasing trust  which are fairly crucial with online businesses",
          "score": 1,
          "created_utc": "2026-01-20 00:55:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l4jur",
          "author": "Opposite-Depth6163",
          "text": "Sorry that you're going through this. This brought back some sad memories for me. Best of luck, stranger. 🙏",
          "score": 1,
          "created_utc": "2026-01-20 01:30:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr6kw4",
          "author": "PoopSmoothies",
          "text": "I’ve started and run a 40+ person venture-backed iot company with a few pivots and eventually an exit that made some money. I’m also deep into ai-driven development now. Happy to chat whether you want a shoulder to cry on or a second look at your strategy/pivot/whatever.",
          "score": 1,
          "created_utc": "2026-01-15 16:40:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqds7g",
          "author": "Revolutionary_Task59",
          "text": "Dm for scaling up",
          "score": 0,
          "created_utc": "2026-01-15 14:25:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qehxmm",
      "title": "Tried every growth hack for 6 months. Revenue grew 800% when I stopped and focused on one boring channel",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qehxmm/tried_every_growth_hack_for_6_months_revenue_grew/",
      "author": "Fun_Description_308",
      "created_utc": "2026-01-16 14:48:51",
      "score": 42,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "January through June: tried viral loops, referral programs, gamification, growth Twitter threads, partnership outreach, influencer collaborations, every tactic from growth blogs. Revenue fluctuated between $400-700 monthly. Constant effort, zero compound effect. Each tactic worked briefly then died.\n\nJuly: gave up on growth hacks, went all-in on the most boring channel possible SEO blog content. Published 3 posts weekly targeting specific long-tail keywords. Nothing clever, just solving actual problems people search for. First 6 weeks got maybe 200 total visitors. Almost quit because growth hacks felt more exciting.​\n\nEight months later: SEO brings 15-20 signups daily on autopilot, zero ongoing effort. Revenue at $3,600 monthly, up 800% from growth hacking phase. All from boring consistent content compounding. Best part: can stop writing new posts and traffic keeps growing. Growth hacks required constant effort, SEO compounds.\n\nThe uncomfortable truth: growth hacks feel productive but rarely compound. SEO feels boring but creates sustainable growth. Viral loops need existing users. Referrals need happy customers you don't have yet. Partnerships take months negotiating. SEO just requires showing up consistently for 3-6 months while seeing zero results.​\n\nMost growth hackers fail because they lack patience for compound channels. They want this week's tactic to work this week. Real growth comes from boring consistency over months. Found this studying [FounderToolkit's](http://foundertoolkit.org) growth data successful founders dominated 1-2 boring channels, failed founders tried everything weekly.\n\nWhat's your compound channel? Or still jumping between growth hacks hoping one sticks?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qehxmm/tried_every_growth_hack_for_6_months_revenue_grew/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzxgmwu",
          "author": "Same_Violinist8438",
          "text": "published 3 posts weekly targeting long-tail keywords, nothing clever just solving problems people search for demonstrates boring consistency beats clever tactics.",
          "score": 3,
          "created_utc": "2026-01-16 14:53:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxigfw",
          "author": "Aggressive_Doctor496",
          "text": "those 3 posts weekly, how long were they and were you writing everything yourself or using writers?",
          "score": 2,
          "created_utc": "2026-01-16 15:02:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzxjbae",
              "author": "Fun_Description_308",
              "text": "\nPosts were 1,200-1,800 words each, wrote everything myself in 90-minute blocks per post so about 4.5 hours weekly total. Outsourcing content early kills your understanding of what resonates, need to write first 50+ yourself to learn voice and what converts.",
              "score": 2,
              "created_utc": "2026-01-16 15:06:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzxhkie",
          "author": "Quiet_Composer_8622",
          "text": "still jumping between growth hacks hoping one sticks honestly. This week trying Reddit ads, last week was cold email. Need to pick SEO and commit for 6 months straight",
          "score": 1,
          "created_utc": "2026-01-16 14:57:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzynijx",
          "author": "Severe_Promise717",
          "text": "this mirrors what finally worked for me too  \nthe mistake i kept making was chasing exciting feedback  \nboring channels feel dead because they dont clap back\n\none shift that mattered was picking a lane that pays late  \nthen locking a rule to never judge it early  \nno tweaking no hopping no coping\n\nseo email content ops  \nall the same lesson\n\nif it compounds it will feel dumb at first  \nif it feels smart it probably resets tomorrow\n\npick one  \nignore your feelings for 90 days",
          "score": 1,
          "created_utc": "2026-01-16 18:04:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyo5ab",
          "author": "Wrong-Finish7655",
          "text": "this is basically it yeah. most people won’t sit through the 3–6 months of “nothing’s happening???” so they bail early. seo isn’t magic, it just punishes impatience. if someone’s still chasing hacks, they probably haven’t earned a boring channel yet.",
          "score": 1,
          "created_utc": "2026-01-16 18:07:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyytdu",
          "author": "_os2_",
          "text": "I am trying the ”blog route”, at 19 blogs now after 8 weeks of posting so pace not at your level but comparable. Could you have a look at [Skimle’s blogs](https://skimle.com/blog) and give your tips on what to keep/change/add? We’re targeting knowledge professionals starting to dabble into advanced AI tools (beyond simple LLMs) for qualitative analysis. \n\nI am new to the growth game so any advice from experts is welcome!",
          "score": 1,
          "created_utc": "2026-01-16 18:54:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzopi6",
          "author": "2NOA",
          "text": "Yes, organic growth, not growth hacking. I agree that consistency pays off, especially on digital channels.",
          "score": 1,
          "created_utc": "2026-01-16 20:54:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzr1d5",
          "author": "Forward_Proposal_520",
          "text": "Boring channel > shiny tactic. That’s the whole game.\n\n\n\nI had a similar arc: bounced between cold DMs, Product Hunt, affiliates, “build in public” on X, all that. Spikes of attention, zero baseline. What finally worked was picking one channel (for me, targeted SEO + a tiny email list) and doing it every week for a year. Same keyword cluster, same pain points, same call to action. Once a few posts ranked and the list hit 1k, everything else got easier.\n\n\n\nThe underrated part is feedback loops: SEO + a simple CRM + something like Ahrefs/GA4 (and in my case Pulse alongside Clearbit) turns into a system where you can see which specific questions, keywords, and threads drive trials, then keep hammering those instead of chasing trends.\n\n\n\nBoring channel > shiny tactic, every time.",
          "score": 1,
          "created_utc": "2026-01-16 21:05:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzxduu",
          "author": "ArtOverSleep",
          "text": "How are your signups generating income?",
          "score": 1,
          "created_utc": "2026-01-16 21:35:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00qkbq",
          "author": "w4nd3rlu5t",
          "text": "what SEO tool do you use to figure out the right long tail keywords?",
          "score": 1,
          "created_utc": "2026-01-17 00:06:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02t4mn",
          "author": "trainmindfully",
          "text": "this lines up with what a lot of people learn the hard way. most growth hacks are leverage on top of something that already works, not a foundation by themselves. SEO feels slow because feedback is delayed, but that delay is exactly why it compounds when you get it right. the tricky part is sticking through the quiet months without switching channels out of boredom. curious if you narrowed SEO to one intent cluster early or let it stay broad at first.",
          "score": 1,
          "created_utc": "2026-01-17 09:08:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02xtp8",
          "author": "BbWeber",
          "text": "Same here - started in September and now i get 100 landing page visits which convert in <20 mobile app downloads per day.",
          "score": 1,
          "created_utc": "2026-01-17 09:53:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o038y7x",
          "author": "sarkhem",
          "text": "I went through the same phase. Tried everything that *looked* smart and measurable, but nothing stuck. The dopamine of quick tactics is real, even when revenue stays flat.\n\nThe shift for me happened when I realized compound channels only work if you understand how discovery actually happens inside them. SEO isn’t just “write content”. It’s aligning with how search engines interpret intent over time.\n\nWhat surprised me most was how boring consistency feels while it’s working. The first few months look like failure. Then suddenly past work starts doing the heavy lifting.\n\nI also agree that most people fail here because they mix channels too early. One compound engine, fully understood, beats five half-tested hacks.\n\nCurious. When you doubled down on SEO, did you focus more on informational queries first or jump straight into commercial intent?",
          "score": 1,
          "created_utc": "2026-01-17 11:36:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0393zt",
          "author": "dorukgezici",
          "text": "Interesting, how did your domain authority look before starting the SEO efforts? I am curious if that’s a pre-requirement",
          "score": 1,
          "created_utc": "2026-01-17 11:37:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0623xm",
          "author": "Enough-Couple-7215",
          "text": "Use a tool like https://sonarpro.app to find hot leads easier jumping into threads on Reddit",
          "score": 1,
          "created_utc": "2026-01-17 20:32:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f3yzo",
          "author": "Slight_Tutor1790",
          "text": "What stood out to me is how much of this is really about trust in delayed feedback. Most teams are fine with slow product cycles or long sales cycles, but when it comes to growth they expect instant proof. Channels like SEO force you to build conviction without applause. Once that muscle is there, it changes how you evaluate everything else you try.",
          "score": 1,
          "created_utc": "2026-01-19 04:09:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lznuu",
          "author": "JayOppoy",
          "text": "This is such a good reality check. SEO really is the ultimate \"boring but works\" channel,  that 3-6 month patience gap kills most people.\n\nOne thing I'd add: **comments can compound too.** Not the spammy kind, but consistently showing up in relevant conversations builds familiarity over time. People start recognizing your name before they ever hit your site. \n\nI use **Commentions** to automate that part,  same \"boring consistency\" energy as your SEO approach, just for social visibility. Combined with long-tail content, it's a solid 1-2 punch. It mentions my brands every day on relevant conversation on LinkedIn and X.\n\nBut you're 100% right,  picking a channel and sticking with it beats chasing hacks every time. Congrats on the 800% growth!",
          "score": 1,
          "created_utc": "2026-01-20 04:24:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyfx95",
          "author": "Legitimate-Net6717",
          "text": "This resonates so much. Growth hacks are exciting because they *feel* like progress, but they rarely build anything that lasts. SEO, email, even niche community engagement—these “boring” channels compound over time. Patience and consistency are underrated superpowers in growth.",
          "score": 0,
          "created_utc": "2026-01-16 17:31:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdzjeu",
      "title": "How I document growth experiments so learnings don’t disappear",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qdzjeu/how_i_document_growth_experiments_so_learnings/",
      "author": "freebie1234",
      "created_utc": "2026-01-15 23:30:19",
      "score": 41,
      "num_comments": 2,
      "upvote_ratio": 0.99,
      "text": "Most growth experiments fail not because of bad ideas, but because learnings get lost.\n\nI started documenting everything in a simple Notion system:\n\n* Hypotheses and assumptions\n* Channel-specific experiments\n* Results and insights\n* Follow-up actions\n\nIt’s helped me avoid repeating the same tests without realizing it.\n\nFor teams working seriously on growth, Notion also offers a 3-month free Business plan for companies with a website and domain email.\n\nYou can benefit here : [Apply Now!](https://affiliate.notion.so/3month)[](https://www.reddit.com/submit/?source_id=t3_1qdzenv)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qdzjeu/how_i_document_growth_experiments_so_learnings/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzv4rcb",
          "author": "Severe_Promise717",
          "text": "i ran into this exact issue and the docs were the fix\n\nthe insight was writing learnings like rules, not notes  \nwhat worked  \nwhat failed  \nwhat to never test again  \nthat stopped me from looping\n\ni picked this up the hard way and later saw it framed simply in NoFluffWisdom, where they treat experiments like systems you refine over time, not ideas you forget [here](https://NoFluffWisdom.com/Subscribe)\n\nif a test teaches nothing you can reuse, it was just motion",
          "score": 1,
          "created_utc": "2026-01-16 04:36:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gehy1",
          "author": "Inevitable_Hour_7366",
          "text": "Nice system. What is typical time length that you make one experiment for meaningful results?",
          "score": 1,
          "created_utc": "2026-01-19 10:38:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbo5yk",
      "title": "What's the play with AI landing pages?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qbo5yk/whats_the_play_with_ai_landing_pages/",
      "author": "Beneficial_Fee_613",
      "created_utc": "2026-01-13 10:43:05",
      "score": 36,
      "num_comments": 32,
      "upvote_ratio": 0.98,
      "text": "Been seeing a lot of hype for AI landing pages but the ones I've made just feel very fake and salesy. Anyone had any success?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qbo5yk/whats_the_play_with_ai_landing_pages/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzilyyp",
          "author": "Fancy_Concern_744",
          "text": "Yeah they feel fake because they're written with the conversion as the goal. The best use I've seen is treating AI as a structuring tool to help you decide what questions to answer, what order they should appear in, and where visuals will do more work than copy. Then you can rewrite everything that actually speaks to the reader. \n\nFor complex products especially visuals matter more than good wrtiting. Visme comes in clutch to turn explanations into diagrams, short walkthroughs, or modular sections. Very important to avoid being salesy and being useful.",
          "score": 6,
          "created_utc": "2026-01-14 10:30:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc191x",
          "author": "Gullible_Brother_141",
          "text": "I've seen better results when AI is used to structure and clarify the message, not to \"sell\". Pages that focus on problem framing, use cases, and plain language tend to feel more credible than conversion - optimized hype. AI works best as editor, not as the voice.",
          "score": 3,
          "created_utc": "2026-01-13 11:13:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzeuxkr",
              "author": "Moming_Next",
              "text": ">AI works best as editor, not as the voice.\n\nThis. \n\n![gif](giphy|8hkBLzKZKcBsQnBpbj)",
              "score": 1,
              "created_utc": "2026-01-13 20:11:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzikrsk",
                  "author": "Gullible_Brother_141",
                  "text": "your welcome",
                  "score": 1,
                  "created_utc": "2026-01-14 10:19:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzip2nm",
              "author": "Beneficial_Fee_613",
              "text": "Editor not voice, gotcha!",
              "score": 1,
              "created_utc": "2026-01-14 10:57:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzc3jni",
          "author": "Delecch",
          "text": "The issue with most AI landing pages is they optimize for what AI thinks converts, not what actually resonates with humans.\n\n\n\nWhat's worked for me:\n\n\n\n1. \\*\\*Use AI for structure, not copy\\*\\* - Let it organize your value props logically, but rewrite the actual words yourself\n\n\n\n2. \\*\\*Add real screenshots/videos\\*\\* - AI can't fake social proof. Real product demos beat any generated image\n\n\n\n3. \\*\\*Test against \"boring\" versions\\*\\* - I've seen simple, straightforward pages outperform fancy AI-generated ones because they feel more trustworthy\n\n\n\n4. \\*\\*Human review everything\\*\\* - AI loves corporate buzzwords. Strip those out ruthlessly\n\n\n\nThe best converting pages I've built use AI as a starting point, then get heavily edited by someone who actually talks to customers.",
          "score": 3,
          "created_utc": "2026-01-13 11:33:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzip4ho",
              "author": "Beneficial_Fee_613",
              "text": "Solid, thank you. The boring versions winning is the play I've seen often!",
              "score": 1,
              "created_utc": "2026-01-14 10:58:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzcx7ej",
          "author": "OrganicClicks",
          "text": "Generic landing pages bombed before AI tools existed too, probably as soon as use of templates became common. So, the problem is more of lazy execution than AI.\n\nUse AI to speed up the structure and first draft, sure. But then you need to inject actual details. Then modify it to highlight the problems your product solves, include screenshots and not stock photos etc.\n\nWhen someone prompts AI once and calls it done, it will definitely seem fake or generic. Same issue as using a wordpress template and just swapping the logo.",
          "score": 3,
          "created_utc": "2026-01-13 14:38:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzip67s",
              "author": "Beneficial_Fee_613",
              "text": "Exactly! AI didn't invent generic pages it just made it easier to produce them faster.",
              "score": 1,
              "created_utc": "2026-01-14 10:58:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzd5gvu",
          "author": "nikhilnarkhede",
          "text": "Yes, I don't like AI landing pages.\n\nJust a small question, which tools do you use for making these, free and paid ones?\n\nI guess the amount of time taken to train the AI or give them the prompt is very time consuming.\n\nIn fact a skilled person can make it faster and better landing pages\n\nWhat are your thoughts?",
          "score": 3,
          "created_utc": "2026-01-13 15:19:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzetvyk",
              "author": "Moming_Next",
              "text": "On top of making them that are time consuming, there's also hosting and storing the email list. As many people said here, the content is extremely important, technical stuff is less. I can DM you a way to put unlimited amount of landing pages up for zero hosting cost. You're the domain expert, get the right words for your ICP.",
              "score": 1,
              "created_utc": "2026-01-13 20:06:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzic9iu",
                  "author": "nikhilnarkhede",
                  "text": "Yes kindly dm me. I am trying to find a way to make landing pages myself without use of any tools like clickfunnels.\n\nFor WordPress how can you make them?",
                  "score": 1,
                  "created_utc": "2026-01-14 08:57:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzip8wg",
              "author": "Beneficial_Fee_613",
              "text": "I don't think tools are the core issue. Prompting and editing usually takes longer than people expect and without customer insight it doesn't matter what you use. A skilled human with context still wins.",
              "score": 1,
              "created_utc": "2026-01-14 10:59:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzbylr6",
          "author": "Used-Location1273",
          "text": "Maybe the early ones feel fake and salesy because the person building them hasn't planned properly. \n\nFeed your AI your entire repository of docs so that it understands your ICP, your business, your processes.   \nFeed your AI your competitor's keyword results. (I use Ubersuggest for this). Then feed it your Google Search Console report.   \nLastly, give it instructions on how to humanize the writing. \n\nYou'll then get something data driven and authentic. However you'll still need to augment the page with rich media of your solution in action.",
          "score": 2,
          "created_utc": "2026-01-13 10:50:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzipbhj",
              "author": "Beneficial_Fee_613",
              "text": "Feeding more context definitely helps but I've still found it needs heavy human rewriting to avoid that AI confidence tone. Real media seems non negotiable.",
              "score": 1,
              "created_utc": "2026-01-14 11:00:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzjan1d",
                  "author": "Used-Location1273",
                  "text": "Claude is king when it comes to writing. Honestly, do not waste your time with ChatGPT when it comes to this. You'll rip your hair out. \n\nGive your Claude this custom instruction in the settings:  \nConnect with readers through authentic and conversational content. \n\n* Use contractions\n* Vary sentence length dramatically\n* Add natural pauses\n* Add occasional tangents\n* Use relatable metaphors\n* Make content slightly messy\n* Include small asides, second thoughts of casual observations. \n\nShow you understand the reader. \n\nRegarding the rest. Yeah. I agree. Real authentic media is crucial. And it also takes the most time to create.",
                  "score": 1,
                  "created_utc": "2026-01-14 13:31:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzbzkq1",
          "author": "History86",
          "text": "Whats your business?\nI think landing pages have become incredibly salesy as google ads likes those signals. They are long, noisy, engaging, lots of relevant keywords and contain conversion signals.\n\nIf your business isn’t eligible to get extreme bofu landingpages you just shouldn’t. \n\nHaving that said, I like landingrabbit.com for landing pages as we as b2b can use it to create product and feature pages at scale. Seo value it drives is enough and there’s a certain uniqueness that makes them stand out.",
          "score": 2,
          "created_utc": "2026-01-13 10:58:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzex8dp",
              "author": "gardenia856",
              "text": "Short answer: don’t force “AI landing page” if your offer doesn’t need a hardcore BOFU funnel. Match page aggression to how aware and ready your visitors are.\n\nIf OP is, say, B2B and mid/upper-funnel, I’d keep it much simpler: one promise, one core proof (case study, metric, or demo), and one low-friction CTA. Use AI for speed, not for voice: draft in Claude/LandingRabbit/etc, then rewrite every key sentence in your own language so it doesn’t read like a template.\n\nOn tools: I’ve used Unbounce and Framer for testing concepts fast; Pulse plus SparkToro has been better for figuring out what language people actually use on Reddit and in niches, then feeding that back into the copy so it feels real instead of generic.",
              "score": 2,
              "created_utc": "2026-01-13 20:22:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzi0bre",
                  "author": "History86",
                  "text": "This guy markets!",
                  "score": 1,
                  "created_utc": "2026-01-14 07:05:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzipsa8",
                  "author": "Beneficial_Fee_613",
                  "text": "Thank you, that's very helpful. \n\nAre you a Malice Mizer fan by any chance?",
                  "score": 1,
                  "created_utc": "2026-01-14 11:04:10",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzippy5",
              "author": "Beneficial_Fee_613",
              "text": "I work for a B2B SaaS marketing company. Good point about BOFU pressure coming from ads. A lot of pages feel agressive because they're built for channels they shouldn't be used for. \n\nThanks, will check it out :)",
              "score": 1,
              "created_utc": "2026-01-14 11:03:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nziyj46",
                  "author": "History86",
                  "text": "Exactly! \nI also think buyers are bored of those aggressive comparison and force-signup pages.\n\nB2b has longer sales cycles and there is always some form of purchasing team",
                  "score": 1,
                  "created_utc": "2026-01-14 12:13:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzdd4uw",
          "author": "Trappedinacar",
          "text": "I think AI isn't there yet for landing pages. It can assist or speed up the process but for building high-converting landing pages you still need people who know what they are doing. \n\nEspecially so for analyzing performance and testing what works.",
          "score": 2,
          "created_utc": "2026-01-13 15:55:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzipsv9",
              "author": "Beneficial_Fee_613",
              "text": "Yeah I agree",
              "score": 1,
              "created_utc": "2026-01-14 11:04:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzdhuz1",
          "author": "Sudden-Context-4719",
          "text": "AI landing pages often feel fake because they try too hard to sell without real value. Instead, focus on clear, simple messaging that speaks like a real person.",
          "score": 2,
          "created_utc": "2026-01-13 16:17:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzetf3u",
          "author": "CIoud9",
          "text": "What would be a good example of a non AI like landing page that people can hopefully gravitate towards?",
          "score": 2,
          "created_utc": "2026-01-13 20:04:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi7nvx",
          "author": "Electrical-Isopod975",
          "text": "AI tools could help you build something quickly to validate an idea, but don't rely 100% on it.   \nYeah, I can smell AI landing page the moment I see it (but I'm a designer).  \nI'd rather recommend to try a no-code tool like Framer and use some landing page template (free or paid). they are easy to customize and are made by really good designers. Use AI for help with the copy and Framer as well.",
          "score": 1,
          "created_utc": "2026-01-14 08:12:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fnkz0",
          "author": "hardikrspl",
          "text": "AI landing pages can work if you use them to draft ideas, copy variations, or speed up production, not as a fully hands-off solution. The ones that feel “fake” usually lack real context or genuine value for the visitor. Best results come from combining AI-generated copy with human tweaks, clear messaging, and real social proof. Think of AI as a productivity booster, not a replacement for strategic content.",
          "score": 1,
          "created_utc": "2026-01-19 06:33:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgs1r5",
      "title": "Faceseek fits well into modern growth strategies",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qgs1r5/faceseek_fits_well_into_modern_growth_strategies/",
      "author": "delhitop_7inches",
      "created_utc": "2026-01-19 02:39:24",
      "score": 33,
      "num_comments": 0,
      "upvote_ratio": 0.98,
      "text": "&#x200B;\n\nFaceseek can be a nice addition to any growth stack if used smartly. It focuses more on discovery than hard selling, which is refreshing.\n\n I found it useful for testing visibility without risking much. The platform doesn’t overwhelm you with features, which is a good thing. \n\nIf you’re experimenting with different growth channels and want something low-effort but effective, Faceseek is worth giving a try.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qgs1r5/faceseek_fits_well_into_modern_growth_strategies/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qe8r4z",
      "title": "From 0 to meaningful organic traffic by focusing on \"relevance over volume",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qe8r4z/from_0_to_meaningful_organic_traffic_by_focusing/",
      "author": "Embarrassed_Poem9556",
      "created_utc": "2026-01-16 06:40:26",
      "score": 25,
      "num_comments": 8,
      "upvote_ratio": 0.95,
      "text": "A lot of growth tactics chase volume: more content, more links, more hacks. The biggest organic win for my project came from going in the opposite direction ruthless relevance.​\n\nInstead of pumping out 30 shallow posts a month, I chose a handful of high-intent topics and built deep, semantically rich pages around them. Think \"best standing desk for small apartments\" instead of just \"standing desk,\" with every relevant angle covered: height range, weight capacity, space constraints, price brackets, real photos, and FAQs.​\n\nEach page was designed to rank for an entire cluster of queries, not a single keyword. That meant long-tail, mid-tail, and even some broader terms started to fall into place over time.\n\nI paired this with a simple authority foundation rather than aggressive link schemes. Started with a [directory submission service](http://getmorebacklinks.org/) getting the site listed on 200+ relevant business and niche directories. Over 60 days this added 42 indexed backlinks moving DA from 0 to 14. That baseline authority meant my comprehensive content pages could actually compete instead of sitting invisible even when they were better than what was ranking.​\n\nThen I watched Search Console like a growth dashboard: which queries was I almost ranking for, which posts were starting to pop, and where adding 20% more depth could move me onto page 1. Added a few curated mentions and \"best of\" list placements for high-quality editorial links once content proved its value.​\n\nThe result: fewer URLs, but each one pulling in traffic from dozens of relevant searches and converting better because the content was truly aligned with what users wanted.\n\nIf you're tired of \"publish more\" advice, try this: pick 5-10 high-intent topics, make those pages embarrass your competitors' content, build baseline authority through systematic citation building, and measure growth at the cluster level not just per keyword. It's a very different way to think about SEO as a growth channel.​",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qe8r4z/from_0_to_meaningful_organic_traffic_by_focusing/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzvmxr7",
          "author": "Chemical_Survey2577",
          "text": "42 indexed backlinks from 200 plus directories moving DA 0 to 14 gave baseline authority so comprehensive content could compete. Foundation first then content quality matters",
          "score": 1,
          "created_utc": "2026-01-16 06:49:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvncgp",
          "author": "Bading_na_green_Flag",
          "text": "Which specific cluster saw fastest compound growth, and what was the tipping point where Google started ranking you for the broader terms after the long-tails gained traction?",
          "score": 1,
          "created_utc": "2026-01-16 06:53:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzxmctu",
              "author": "Embarrassed_Poem9556",
              "text": "Standing desk accessories cluster hit fastest after main standing desk page ranked. Tipping point was around 15-20 long-tails ranking top 5, then Google started testing me for broader terms like 'best standing desk' moving from position 45 to position 12 in 3 weeks.",
              "score": 1,
              "created_utc": "2026-01-16 15:20:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzvnyz1",
          "author": "Pretend-Raspberry-87",
          "text": "\nCurated mentions and best of list placements for editorial links once content proved value is strategic link building.",
          "score": 1,
          "created_utc": "2026-01-16 06:58:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvuf1b",
          "author": "HansP958",
          "text": "Solid breakdown. I like the emphasis on intent-driven content over shortcuts.\n\nOne thing that helped me in the early 0→1 phase was pairing this with **light distribution**, not growth hacks. For an AI product, getting listed gradually on curated directories brought the first real impressions, some qualified traffic, and indexing signals.\n\nI used [https://300aidirectories.com](https://300aidirectories.com) for that. Not a replacement for content at all, but a good complement while the content engine is still ramping up.",
          "score": 1,
          "created_utc": "2026-01-16 07:54:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwh8df",
          "author": "mprz",
          "text": "https://www.reddit.com/search/?q=getmorebacklinks.org&amp;include_over_18=on&amp;t=all&amp;sort=new\n\nSpam spam spam",
          "score": 1,
          "created_utc": "2026-01-16 11:19:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxpcm4",
          "author": "Ok_Employ_5453",
          "text": "Forget just listing prices. Frame them with empathy, \"for growing teams\" vs. \"Pro.\" Use social proof (trusted logos, testimonials) near tiers. Explain value clearly, then price. Your post nails it: depth builds trust, trust converts.",
          "score": 1,
          "created_utc": "2026-01-16 15:33:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyf31d",
          "author": "Euphoric-View-9876",
          "text": "This maps really cleanly to distribution too. Weve seen the same thing outside of SEO relevance compounds when you start from who already cares, not how many people you can reach. Clusters arent just keywords theyre audiences. When you show up consistently in front of people already engaging with similar products or topics, even light exposure starts to convert better over time. Volume feels productive, but relevance is what actually compounds, whether its Google traffic or human attention.",
          "score": 1,
          "created_utc": "2026-01-16 17:27:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh76m5",
      "title": "What outbound experiments actually improve reply quality and not just open rates?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qh76m5/what_outbound_experiments_actually_improve_reply/",
      "author": "Bitreous007",
      "created_utc": "2026-01-19 15:28:47",
      "score": 25,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "Most of my early outbound experiments focused on copy. Subject lines, openers, call to actions. I ran test after test and saw small gains, but nothing that really moved the needle.\n\nWhat finally made a noticeable difference was not the message. It was who I was sending it to.\n\nOnce I started filtering leads by actual role and buying relevance, reply quality improved almost immediately. Same copy, same volume, better conversations.\n\nTo support this, I started using SalesTarget  because it lets me narrow leads by real job roles instead of guessing from company size or industry alone. I still test copy and timing, but targeting turned out to be the biggest lever for us.\n\nFor people using outbound as a growth channel, I am curious.\n\nWhat experiments have actually worked for you lately? Copy, targeting, timing, or something else?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qh76m5/what_outbound_experiments_actually_improve_reply/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qca0z9",
      "title": "Launched my Startup Yesterday - How do I get users?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qca0z9/launched_my_startup_yesterday_how_do_i_get_users/",
      "author": "No_Tooth_4909",
      "created_utc": "2026-01-14 01:35:52",
      "score": 24,
      "num_comments": 44,
      "upvote_ratio": 0.96,
      "text": "I recently launched my startup and have been posting on instagram and other social media consistently but to no avail. It's a b2c ai app, and I know ugc and founder marketing are what blows these apps up, but are there any specific frameworks I should follow to maximize virality. I'm trying X but it seems even harder to grow on there. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qca0z9/launched_my_startup_yesterday_how_do_i_get_users/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzhyc1s",
          "author": "dan_charles99",
          "text": "This amazes me, every time. Where is the business planning. Market identification?",
          "score": 7,
          "created_utc": "2026-01-14 06:47:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhblsv",
          "author": "FitnessfreakBob",
          "text": "what is your app about? can I contact you somewhere because I am also facing the exactly same problem. 1 month and no downloads nothing is working. Maybe connection with you might open ways for both of us.",
          "score": 2,
          "created_utc": "2026-01-14 03:58:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzknpez",
              "author": "Mediocre-Card2726",
              "text": "what is it about? there are tons of hacks you can drive bottom funnel metrics not just vanity-- DM me let's connect",
              "score": 1,
              "created_utc": "2026-01-14 17:29:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzhdgys",
          "author": "stovetopmuse",
          "text": "Most launches stall because they start with distribution tactics instead of a reason to share. Virality frameworks only work if the product creates a moment people want to show or talk about. For b2c AI especially, that usually means a very narrow use case, a fast payoff, and something output driven that makes the user look smart or funny when they post it. Social posting without that hook just becomes background noise. I’d focus less on platforms and more on tightening the loop between first use, wow moment, and a natural share trigger. Once that exists, channels matter a lot less.",
          "score": 2,
          "created_utc": "2026-01-14 04:10:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhvgb7",
          "author": "ChestChance6126",
          "text": "Virality frameworks are usually a distraction this early. What matters is whether a new user hits value fast enough to tell someone else. I would zoom in on activation first. What is the moment when they say, “Oh, this is useful” within the first session?\n\nFor B2C AI apps, I have seen better results treating distribution like a series of small experiments, not a single social channel grind. Pick one surface where your users already hang out, ship one tight use case, and manually watch how the first 50 to 100 people use it. The patterns there usually tell you what content or loop is worth scaling.\n\nFounder content works when it documents learning, not when it tries to perform growth. Short clips or posts showing real prompts, outputs, or mistakes tend to land better than polished launches. X is hard unless you already have a signal, so I would not force it yet.\n\nIf you want virality later, it usually comes from a built-in sharing reason tied to output, not from posting more. Curious what your current activation rate looks like.",
          "score": 2,
          "created_utc": "2026-01-14 06:23:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzir6f8",
          "author": "nocap_361",
          "text": "there's no silver bullet but one thing that helps is listing it in all startup directories. Gets you some eyeballs and a few backlinks so you can start doing SEO. Here are a few good ones: \n\nLaunchIgniter   \nMicro Launch  \nUneed  \nAILaunch  \nAItoolonline   \nBetaList   \nDevHunt   \nDirectoryHunt   \nFazier   \nFirsto   \nFoundrlist   \nHackerNews   \nIndieHackers   \nLaunchDirectories   \nPeerList   \nPeerpush   \nProductHunt   \nProofy   \nReddit   \nSaaSHub   \nShipYard HQ   \nShipsquad   \nSlocco   \nStacker News   \nTinyLaunch  \nToolFame   \nTryLaunch   \nTwelveTools",
          "score": 2,
          "created_utc": "2026-01-14 11:16:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhk3go",
          "author": "aishikacharyya",
          "text": "I run a founder community exactly for these kinds of specific problems. DM if you care to join.",
          "score": 1,
          "created_utc": "2026-01-14 04:55:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhmdar",
          "author": "mo_ahnaf11",
          "text": "theres no shortcut to this, u have to market it daily,talk to users , communicate and network all the time, if u use reddit a lot, join relevant subreddits comment in conversations and just educate people\n\nive been doing that for months on reddit and eventuallu i now use [https://ventureradar.io](https://ventureradar.io) and it works really well in finding my leads from reddit and i just focus on outreach 1 by 1, u can go this route if u can spend some money, it will save u time otherwise do the manual search, its slow but youll have to be consistent\n\nthey have a tutorial as well: [https://youtu.be/mr9mEYMBL7Y?si=ksjfPOe4ZQMhM5zo](https://youtu.be/mr9mEYMBL7Y?si=ksjfPOe4ZQMhM5zo)",
          "score": 1,
          "created_utc": "2026-01-14 05:12:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhw0x0",
          "author": "Frosty_Sir5807",
          "text": "Dm me once",
          "score": 1,
          "created_utc": "2026-01-14 06:28:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi10gj",
          "author": "edoardostradella",
          "text": "Going viral is the last thing you want in the early days; brings in a lot of low-quality users and usually the product is not good enough yet to keep the good ones. Focus instead on what can get you feedback, like cold outreach..",
          "score": 1,
          "created_utc": "2026-01-14 07:11:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi3ai5",
          "author": "amacg",
          "text": "Congrats! Also welcome to launch on our community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 1,
          "created_utc": "2026-01-14 07:31:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi9edw",
          "author": "Sadpatte",
          "text": "have you checked your existing network for people who could try it for free for you to gain feedback and make the product so good people naturally will share it?",
          "score": 1,
          "created_utc": "2026-01-14 08:29:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzidatj",
          "author": "nikhilnarkhede",
          "text": "You need to do Marketing my friend. Also what problem your app solves?\n\nSearch for communities where people mich have the problems your app solves.\n\nAll the best. If you need help in Marketing don't hesitate to dm me 🙂",
          "score": 1,
          "created_utc": "2026-01-14 09:07:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziei3z",
          "author": "asupertram",
          "text": "You might wanna come check [www.preseedme.com](http://www.preseedme.com) \\-> it'a a launchpad where bootstrapped founders share what they’re building and get backed early by micro-investors. You do not need to be looking for raising big amounts now, as it's designed to help you share progress as you build in public. \n\nThink of it as AngelList for pre-revenue builders, where founders showcase their projects early, and investors backing dozens of small experiments instead of one big bet.",
          "score": 1,
          "created_utc": "2026-01-14 09:19:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o09gaqs",
              "author": "kevinbaur",
              "text": "I can see startups list their users? How do you get that number?",
              "score": 1,
              "created_utc": "2026-01-18 08:56:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o09tddx",
                  "author": "asupertram",
                  "text": "At the moment we don’t - we focus on getting founders noticed by investors and matching them proactively. So there’s less chasing from both an investor + founder standpoint. \n\nWe let each side make their own due diligence. If you’re an investor you should contact the founders through our in app messages and ask for proofs once you get to know the founders. We will track that in the future but as per now if you want to invest you gotta make your own due diligence.",
                  "score": 1,
                  "created_utc": "2026-01-18 10:57:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzigcy6",
          "author": "OrganicClicks",
          "text": "Start by talking to users instead of broadcasting to everyone. Pick one narrow audience that actually feels the problem and hang out where they already complain about it. DM people, comment on their posts, and offer help without pitching.\n\nShip small improvements fast and share what you learn publicly. Growth usually comes from tight feedback loops, not viral frameworks. One channel that works beats five that don’t.",
          "score": 1,
          "created_utc": "2026-01-14 09:37:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzikzyv",
          "author": "Both-Notice-6923",
          "text": "Totally get this - launching is exciting, but the silence after hurts.\n\nWhat helped me (and a few others I know) wasn’t posting more, but posting smarter. Early on, virality frameworks didn’t move the needle. Conversations did.\n\nI started hanging out where people were already asking for help (Reddit, X replies, niche communities) and just… talked. No pitching. No links at first. Real answers.\n\nTools like SneakyGuy made this easier by surfacing those exact high-intent conversations so I didn’t have to hunt for hours.\n\nFirst users came from replies, not posts. Feedback came faster. Confidence too.\nYou’re not doing it wrong - distribution is just harder than building. Keep going.",
          "score": 1,
          "created_utc": "2026-01-14 10:21:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzint67",
          "author": "fba",
          "text": "I'd say validate first by manually recruiting people that might be interested in your app. X is a great one BTW. What's your Startup about?",
          "score": 1,
          "created_utc": "2026-01-14 10:46:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzj5h2m",
          "author": "Agile_Hearing_8184",
          "text": "LinkedIn for me is one of work social media and I would recommend to make it with your personal brand like founder) Be simple, clear tell about your success and fails, give tips for other and tell about your product and why it can be useful\n\nbe useful and sincere = people will be drawn to you and support your product\n\ngood luck!)",
          "score": 1,
          "created_utc": "2026-01-14 13:00:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzj9t1n",
          "author": "Unreal_Labs",
          "text": "virality usually comes after clarity, not before it. Most B2C AI apps don’t fail at distribution first, they fail at being instantly understandable.\nA few grounded thoughts:\nStop “posting” and start testing narratives.\nInstead of “here’s my app,” try one sharp problem per post. One pain, one outcome. If people don’t immediately say “oh, that’s for me”, virality won’t kick in no matter the platform.\nFounder marketing works when it’s specific, not inspirational.\nWhat surprised you while building? What didn’t work? What was awkward or wrong? People share insight, not polish.\nX is hard because it rewards opinions, not products.\nDon’t grow an account for the app. Grow it around a point of view related to the problem your app solves.\nEarly growth is usually manual, not viral.\nDMs, small communities, 1:1 conversations, niche subreddits — boring, but that’s where you learn what message actually sticks.",
          "score": 1,
          "created_utc": "2026-01-14 13:26:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjgx90",
          "author": "dorukgezici",
          "text": "One thing that seems to be working for me, find your competitors ads (insta/facebook/…) and check out the comments. Most of the time there is someone complaining about it in some way, just contact those people and they are actually happy for your outreach (your product needs to be solving the issue better for them ofc!)\n\nI am building https://popjam.io btw",
          "score": 1,
          "created_utc": "2026-01-14 14:06:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzn1qld",
              "author": "Euphoric-View-9876",
              "text": "this is underrated advice. early users are almost always hiding in competitor gravity. people commenting, complaining, comparing, or even liking competitor content are already problem aware. instead of guessing where to post, Ive found it works better to watch competitor audiences across platforms and step in when there’s signal. once someone is already reacting to a competitor, the conversation isnt “why should I care” anymore  its “why you vs them”. that’s where early users actually come from.",
              "score": 1,
              "created_utc": "2026-01-15 00:12:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzjix8y",
          "author": "Alternative-Cake3773",
          "text": "Not sure what you have tried before you launched the product but I am trying to grow our waitlist right now so I regularly post on X, LinkedIn and Reddit. With X I am taking a built in public approach where I share our wins and failures. This seems to work a bit. I just don't have any data of where the users are coming from who signs up to our waitlist",
          "score": 1,
          "created_utc": "2026-01-14 14:16:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlruvv",
          "author": "Sudden-Context-4719",
          "text": "Focus on finding the right Reddit communities where your target users hang out and join the conversations genuinely. You can’t just blast posts or comments, you gotta add value first. Tools like SocListener can help spot the best sales-related posts to engage with, so you’re not wasting time guessing where to comment.",
          "score": 1,
          "created_utc": "2026-01-14 20:29:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmdbin",
          "author": "dwainbrowne",
          "text": "This is by far the biggest issue I personally faced for years. Took me a while to come up with some strategies (no silver bullet).\n\nFirst thing... is your app B2B or B2C  \n  \nB2C - honestly, social media content, TikTok, Instagram, etc, test different content, see what takes off, then boost those posts. For everyone who engages with your content, DM them to see if they are interested in trying it. (as first, send link to them after)\n\n  \nB2B - Literally start knocking on doors (cold call, DMs, etc) find the groups they are in and ask questions, engage, then ask to DM and share the link.\n\nKeep a spreadsheet, see what works, then rinse and repeat.\n\nFix bugs, rinse and repeat, get some testimonals from free users, use that to promote.\n\nP.S. I have a vibe coding community where I share more of my experience, feel free to join: [https://dwain.me/skool](https://dwain.me/skool)",
          "score": 1,
          "created_utc": "2026-01-14 22:06:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmgj6c",
          "author": "Enough-Couple-7215",
          "text": "instagram consistency is brutal early on, so it makes sense you are seeing no avail. When you say ugc and founder marketing blow these apps up, the framework I have seen work is pick one tiny outcome, show it in a 15 second demo, then drive a loop where the output is naturally shareable or invites a friend. X feels harder because it is a firehose, so distribution matters more than posting. I stopped guessing and started fishing where people already complain about the problem. I use SonarPro, [https://sonarpro.app](https://sonarpro.app), to track keywords and pull up fresh Reddit and X threads so I can reply fast with real help and a soft invite, that got me my first users. what niche and what is the first wow moment in your app?",
          "score": 1,
          "created_utc": "2026-01-14 22:21:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmqenf",
          "author": "greyzor7",
          "text": "Start with outbound (warmed, first circle), organic only. That's your validation.\n\nThen try launching your app on a combo of social media: X/Twitter, Reddit + launch platforms: Product Hunt, BetaList.\n\nRunning a [platform](https://microlaunch.net/premium), we get 30k+ makers monthly. Solid for first sales, distribution, techie/generalist, founders, makers audience.\n\nGo for paid/UGC later on. Don't neglect SEO, but takes time.\n\nMeasure all ROIs, then simply double down on what worked. Iterate\n\nYou got this.",
          "score": 1,
          "created_utc": "2026-01-14 23:11:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzng6oy",
          "author": "Comfortable-Scar-318",
          "text": "I would suggest testing different content verticals that work for your niche and then to experiment with different hooks. Post 10-20 times a day across multiple accounts until you find something that gains a lot of views and then repeat that content format over and over. \n\nWhen making the content, focus on targeting peoples pain points and providing your startup as a solution to their problems. Don't just utilize X, the best way to go viral organically is through tik tok and reels just because of the way their algorithm works. Test things like ai UGC, slideshows, fake snapstyle content thats a video with a caption \n\nTEST TEST TEST, you don't know what works until you've put the content out there and you can't determine if something works or not by just posting it once. If you need a tool to help with content, I use this free tool that allows you to mass generate slideshows, repurpose your own content (so you can post the same thing over and over to other accounts without getting detected) and it has a lot of other content templates and other cool features [thespectrespoofer.com](http://thespectrespoofer.com) \n\nOther than that I'd just say don't be discouraged if you don't find success right away, it takes time and all it takes is one connection / customer / viral content to snowball you all the way to success. also, if it's your first startup, pat yourself on the back, you created something!",
          "score": 1,
          "created_utc": "2026-01-15 01:32:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzofnjb",
          "author": "Less_Let_8880",
          "text": "million dollar question. i bet u will get a lot of so called marketing experts telling u to DM but the real ones will just comment the tips here. did u launch at ProductHunt? i'm also trying to promote at X but stuck in 0 views. bought X premium but didn't help LOL",
          "score": 1,
          "created_utc": "2026-01-15 05:13:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpql37",
          "author": "Agreeable-Length4041",
          "text": "Here's the uncomfortable question: have you validated that people actually *feel* the problem your app solves? Like, urgently? Because I've seen a ton of AI apps where the founder is more excited about the solution than any user is frustrated by the problem.\n\nB2C AI is brutal right now. The space is so noisy that \"cool AI thing\" isn't enough anymore. People scroll past 10 AI tools a day.\n\nWhat makes them stop isn't your content strategy — it's whether you're hitting a nerve they already have.\n\nBefore optimizing for virality, I'd pressure-test:\n\n* Can you describe the problem in one sentence that makes people say \"holy shit yes\"?\n* Are people actively searching for solutions? What are they typing?\n* Would they pay to make this pain go away *today*?\n\nIf those answers are shaky, no amount of UGC or founder content will save it. You'll just be yelling louder about something people don't care about.\n\nHarsh but I wish someone told me this earlier.",
          "score": 1,
          "created_utc": "2026-01-15 12:06:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqtwo0",
          "author": "Top_Bad8226",
          "text": "Starting a business without having all of these questions and more figured out well enough to be able to lecture people about it with no notes honestly blows mind. Every. Single. Time.",
          "score": 1,
          "created_utc": "2026-01-15 15:43:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrrkam",
          "author": "AlexeyUniOne",
          "text": "I dropped a post yesterday on how to promote your startup with $0 budget",
          "score": 1,
          "created_utc": "2026-01-15 18:14:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzykbke",
          "author": "SeaworthinessReal844",
          "text": "Congrats on the launch! Focus on niche communities where your audience hangs out, engage genuinely, and test viral hooks. UGC works best when it feels organic maybe incentivize early adopters?",
          "score": 1,
          "created_utc": "2026-01-16 17:50:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01jfgk",
          "author": "United_Broccoli_4032",
          "text": "Sounds like you’re grinding the content side hard but not seeing the lift you want. With B2C AI apps, virality often hinges on really dialing in who’s most likely to care and making ads that speak directly to them-not just blasting posts and hoping for shares. I’d actually focus on running Meta ads that learn and optimize for your audience instead of throwing spaghetti at the wall with organic. Something that tests creative angles daily, shifts budget to winners, and scales ads without you babysitting every detail.\n\nThat way, you get fresh hooks figuring out what resonates instead of sinking time into one-off posts that might miss the mark. It feels less “guess and hope” and more smart automation that grows your user base steadily, especially at early stages. Keep that founder marketing, but pair it with data-driven ad testing and watch things pick up.",
          "score": 1,
          "created_utc": "2026-01-17 03:05:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f7e9c",
          "author": "dougie-6020",
          "text": "Early-stage B2C growth is usually less about posting everywhere and more about showing the product in a way that creates an immediate “oh, I get it” moment. The apps that take off quickly tend to do three things well:\n\n1. show the value in under 10 seconds\n2. make the user journey visually obvious\n3. let people try something instantly\n\nOne thing that helped me when I launched was creating a short interactive demo of the core workflow and sharing that instead of static screenshots. Supademo gives you the first five demos free, so that is how I started. Now I use it for website demos, onboarding flows, and even quick sales explainers.\n\nIf you had to show your app’s “magic moment” in five steps, what would you pick?",
          "score": 1,
          "created_utc": "2026-01-19 04:32:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f8fe8",
          "author": "shiny-me",
          "text": "launching is hard fr, getting users takes time and trial...\n\nkeep posting small real updates and talk to people 1:1. sensay it’s more about consistency than going viral fast",
          "score": 1,
          "created_utc": "2026-01-19 04:39:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgj0p2",
      "title": "is google even showing our sites anymore or just summaries?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qgj0p2/is_google_even_showing_our_sites_anymore_or_just/",
      "author": "AdventurousPie7592",
      "created_utc": "2026-01-18 20:13:17",
      "score": 20,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "is it just me or is the \"citation\" thing in search getting way more aggressive lately?\n\nmy main client’s traffic has been basically flat for months despite ranking top 3 for all their main head terms. i went and checked the actual queries and google's just giving the full answer at the top and barely even showing the blue links. or it's citing some random reddit thread from 2019 instead of the actual expert content we spent 2k on............\n\ni’ve been trying to track where these models (and the ai overviews) are actually pulling their info from. someone in a slack group mentioned trying a third party tool, something like netranks for tracking ai share of voice, so i've been messing with that + perplexity just to see if we even exist in their training data.\n\nturns out we’re getting cited for stuff we don't even care about, while the money pages are totally invisible in the ai answers.\n\nare you guys still just focusing on traditional rankings or are you actually optimizing for the \"answer\" part now? feels like we're just playing a different game and nobody told us the rules yet. would love to know if anyone has actually moved the needle on this or if we’re all just coping.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qgj0p2/is_google_even_showing_our_sites_anymore_or_just/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o0d2z83",
          "author": "sarkhem",
          "text": "I have given up on google... its a waste of time",
          "score": 3,
          "created_utc": "2026-01-18 21:42:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dg7ux",
          "author": "Ok_Okra4730",
          "text": "Went from 15k daily visits to about a thousand. Grim times.\n\nSEO was my bread and butter for 15 years so you are not alone.",
          "score": 1,
          "created_utc": "2026-01-18 22:45:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0e49lv",
          "author": "kubrador",
          "text": "google turned your seo into their content farm, congrats on ranking third for free traffic you'll never see.\n\nthe game isn't \"get ranked\" anymore, it's \"convince an llm you exist\" which is somehow worse because at least before you knew what you were optimizing for. now you're fighting reddit threads from people who were making it up as they went.",
          "score": 1,
          "created_utc": "2026-01-19 00:49:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fn80r",
          "author": "hardikrspl",
          "text": "Yep, you’re seeing what a lot of SEOs are noticing. Google’s answer boxes and AI summaries are taking clicks away from top-ranking pages, often citing older or widely referenced sources instead of your content.\n\nMost teams still track traditional rankings, but some are experimenting with AI share of voice tools like Netranks or Perplexity, and structuring content for featured snippets and FAQs so Google can actually pull it. The rules are still evolving, but focusing on clear, authoritative answers seems to be the best way to stay visible.",
          "score": 1,
          "created_utc": "2026-01-19 06:30:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g1g75",
          "author": "lkrzysiak",
          "text": "Honestly, I think the days when you could run a decent business just by pumping out SEO-driven content are mostly over.\n\nIt’s not just about what Google is doing right now, but about the direction things are going. AI can already generate a “good enough” article in seconds, and in a year or two it’ll be much better than it is today. That kind of content just isn’t scarce anymore.\n\nMy bet is that in a few years the content sites that still matter will be the ones with real, direct traffic — built by people who spent years growing an audience that actually wants to come back. SEO alone won’t be a business model anymore, it’ll just be a small bonus.",
          "score": 1,
          "created_utc": "2026-01-19 08:35:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgt8ov",
      "title": "What's the Cheapest LinkedIn Automation Tool in 2026?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qgt8ov/whats_the_cheapest_linkedin_automation_tool_in/",
      "author": "BotDog",
      "created_utc": "2026-01-19 03:35:03",
      "score": 19,
      "num_comments": 4,
      "upvote_ratio": 0.95,
      "text": "Hey everyone!\n\nI wanted to share a comprehensive price comparison of LinkedIn automation tools to help everyone make informed decisions. As a Botdog founder, we obviously research the market constantly to see how our tool stacks up and ensure we're delivering the best value. My goal is to give you an honest rundown of what's on the market, but this analysis will naturally have some bias.\n\n**TLDR: Prices range from $8.25 to $1,499/month. Linked Helper remains cheapest at $8.25/mo (with caveats), we believe Botdog offers the best value at $35/mo annually (especially for founders, individual reps, and small teams), HeyReach is arguably the best and most cost-effective option for agencies needing 30+ accounts, and CoPilot AI is still the most expensive at $203+/mo.**\n\n# Average cost of LinkedIn automation in 2026\n\nMost reliable tools now charge between $55-$165/month per user. The market has matured with clearer tier separation: budget tools ($8.25-$50/mo), mid-tier ($50-$100/mo), high ($100-$200/mo) and enterprise ($200-$1,499/mo).\n\n# Quick price rundown (annual pricing)\n\n**Budget ($8.25-$50/mo):**\n\n* **Botdog:** $35-$49/mo - Cloud-based, unlimited campaigns, best value, $49/month includes AI\n* **Linked Helper:** $8.25-$24.75/mo - Desktop-based (your computer must stay on for campaigns to run)\n* **Waalaxy Pro:** $21-$43/mo - Limited to 300 connection requests, $21/month without inbox feature\n* **Meet Alfred:** $29-$49/mo - Limited to 3 campaigns on cheaper tiers, only 3.4/5 G2 rating\n\n**Mid ($50-$100/mo):**\n\n* **Phantombuster Starter:** $56/mo - 20-hour execution limit (most need Pro at $128)\n* **HeyReach:** $59/mo - Agency-focused, overkill for solo users\n* **Dripify Pro:** $59/mo - LinkedIn + Email, unlimited campaigns\n* **Waalaxy Advanced:** $66/mo - Unlimited LinkedIn requests finally\n* **La Growth Machine Basic:** $60/mo - Only 3 campaigns, templates only\n* **Expandi Business:** $79/mo - add $118/mo for visual features = $197 total\n* **Lemlist Multichannel Expert:** $79/mo - LinkedIn + Email, 400 enrichment credits\n\n**High ($100-$200/mo):**\n\n* **La Growth Machine Pro:** $110/mo - Limited to 6 campaigns\n* **Phantombuster Pro:** $128/mo - 80-hour execution limit\n* **La Growth Machine Ultimate:** $165/mo - Unlimited campaigns finally\n* **HeyReach Agency (50 accounts):** $749/mo total ($15/account)\n\n**Enterprise ($200-$500/mo):**\n\n* **CoPilot AI:** $203-$294/mo - AI-powered, most expensive option, limited to 10 campaigns\n* **Phantombuster Team:** $352/mo - 300-hour execution limit\n* **HeyReach Unlimited:** $1,499/mo - Unlimited accounts (perfect for agencies)\n\n# My take…\n\nIf you need **LinkedIn-only automation** and want the best value: **Botdog at $35/mo** gives you unlimited campaigns, 3-minute setup, and 4.9/5 reliability at a price that won’t break the bank (but obviously I’m biased 😉).\n\n* If you need **multi-channel (LinkedIn + Email)** and want simplicity: Dripify at $59/mo or Lemlist at $79/mo (if you're email-focused) provide solid value without La Growth Machine's complexity.\n* If you're an **agency managing 50+ accounts**: HeyReach is purpose-built for your use case.\n* If you're **extremely budget-conscious** and can tolerate bugs: Meet Alfred at $49/mo is the cheapest multi-channel option, though reliability might suffer.\n* If you’re happy to **keep your computer running 24/7**: Linked Helper at $8.25-$24.75/mo might make sense.\n\nScreenshots below 👇\n\n[Botdog - $35\\/mo annually with unlimited campaigns and 3-minute setup. Professional + AI tier at $49\\/mo includes AI lead filtering.](https://preview.redd.it/3f6bq8s678eg1.png?width=1080&format=png&auto=webp&s=d0a5b5c0bd1dedb26904f29e9b1cf5fd0d6d5169)\n\n[Linked Helper - cheapest at $8.25\\/mo, but your computer needs to stay on 24\\/7 for campaigns to run, and it slows down your computer. It's also very complex, not the most user-friendly. ](https://preview.redd.it/mo99pgl878eg1.png?width=1080&format=png&auto=webp&s=7e85ec43680b2406cc3c675714121bb390cbca91)\n\n[Meet Alfred - multi-channel at $49\\/mo annually \\(LinkedIn + Email + X\\), but only 3.4\\/5 G2 rating and limited to 3 campaigns on Basic.](https://preview.redd.it/qh3ah55b78eg1.png?width=1080&format=png&auto=webp&s=827013cfb1cc64bf65e6d72b54a9dcab482780e2)\n\n[Waalaxy - starts at $21\\/mo but that's without the inbox feature. Pro plan with inbox costs $43\\/mo and limits you to 300 requests\\/month which is well below LinkedIn's limits.](https://preview.redd.it/arj4arfc78eg1.png?width=1080&format=png&auto=webp&s=349a330a0c4a488779b7f048bad937c09ba862c5)\n\n[Dripify - solid LinkedIn + Email at $59\\/mo annually with unlimited campaigns. Basic plan at $39\\/mo is too limited \\(1 campaign only\\).](https://preview.redd.it/kwg5abjd78eg1.png?width=1080&format=png&auto=webp&s=4ab633ce16f4f87781c1097cf3d8ec5d93c3bf26)\n\n[Lemlist - $79\\/mo annually for Multichannel Expert \\(LinkedIn + Email\\). Includes 400 enrichment credits and professional email deliverability.](https://preview.redd.it/fpcvljje78eg1.png?width=1080&format=png&auto=webp&s=62d60249d471c32bc415750247933b30b9b5fb2d)\n\n[La Growth Machine - Basic at $60\\/mo is multichannel \\(LinkedIn + Email\\) but only allows 3 campaigns with templates. Pro at $110\\/mo limits you to 6 campaigns. For unlimited campaigns, you need Ultimate \\($165\\/mo\\).](https://preview.redd.it/osf31ogf78eg1.png?width=1018&format=png&auto=webp&s=3cff16b26faf1b379cc8f7cca40a3ac941a8398d)\n\n[Expandi - base price of $79\\/mo is a bit misleading when visual personalization is their main selling point. To send images and GIFs, you need to purchase additional subscriptions.](https://preview.redd.it/8egxnkpg78eg1.png?width=916&format=png&auto=webp&s=4091cfbbf9f52faf5225621d0acf27af544b92d3)\n\n[HeyReach - built for agencies. Their single sender plan at $59\\/mo is expensive compared to other tools, but becomes excellent value at scale: $749\\/mo for 50 accounts \\($15 each\\).](https://preview.redd.it/4zv7zzrh78eg1.png?width=1080&format=png&auto=webp&s=2f3d59747c533bb33739c98e040670641215e2b5)\n\n[Phantombuster - starts at $56\\/mo with only 20 hours of execution time. Most users need Pro \\($128\\/mo\\) or Team \\($352\\/mo\\) for adequate capacity.](https://preview.redd.it/0p5jljzi78eg1.png?width=1080&format=png&auto=webp&s=d7211da82900b56403faa94c2cf771ef63aa87f8)\n\n[CoPilot AI - most expensive at $203-$294\\/mo, positioning as AI sales employee. Limited to 10 campaigns even at highest tier.](https://preview.redd.it/5vpea6fk78eg1.png?width=1012&format=png&auto=webp&s=31058ae2f921b98120e33c759d70493a8754a2f6)\n\nHave you used any of these tools? Any feedback? Any specific feature you really enjoyed and we should build?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qgt8ov/whats_the_cheapest_linkedin_automation_tool_in/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o0gp89z",
          "author": "alexRedCalib3r",
          "text": "Are there any relevant stats as to which automation tools lead to the most bans, or are all these companies now so \"established\" that they have freedom to operate without fear as long as they stay in bounds?\n\nBecause some definitely stay more in-bounds than others.. any kind of outreach automated is instantly a risk, but what else are you going to do just say Hi to everyone you meet on LI?  As long as you say \"B2B sales\" every few phrases you'll fit in, but not if your robot copilot is running amok",
          "score": 1,
          "created_utc": "2026-01-19 12:10:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gt1ns",
              "author": "BotDog",
              "text": "I can't speak for the other tools but Botdog's safety features are so comprehensive that there's only about a 1/1000 chance of activity being detected by LI. We also always recommend users to pay for Premium/Sales Nav/Recruiter because 1/ they're way less likely to have warnings from LinkedIn and 2/ when they do they receive an email warning before anything bans/restrictions (in which case they can ease off or stop). Free LI accounts get blocked faster and don't get this kind of warning so it's much more risky",
              "score": 2,
              "created_utc": "2026-01-19 12:39:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0kmkx2",
                  "author": "Last_Inspector2515",
                  "text": "but how do you maintain safety if you are using a third party -- unipile?\n\nI mean if they do the automation part, then they are the deciders of safety correct?",
                  "score": 1,
                  "created_utc": "2026-01-19 23:52:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qexa5c",
      "title": "Can't Wait To Try Claude Cowork? Don't Let It Accidentally Delete Your Hard Drive",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qexa5c/cant_wait_to_try_claude_cowork_dont_let_it/",
      "author": "MarketingNetMind",
      "created_utc": "2026-01-17 00:16:33",
      "score": 17,
      "num_comments": 0,
      "upvote_ratio": 0.83,
      "text": "I was just asked by my colleague who, unfortunately, came into that Claude Cowork mis-deleting all the important files unexpectedly.\n\n# Claude Could Misinterpret Your Command\n\nIf you never tried Claude Code or other AI/vibe coding tools, no worries, you will definitely be amazed. \n\nHowever, before that, there's one thing you might be unaware of\n\n**When Claude Cowork deletes something, it is possibly permanent deletion (when you delete something on your MacBook, it goes to the trash bin and you can restore it)**\n\nYou think \"I just want to organize my Downloads folder\", you prompt it, and you click \"Send\", looking forward to the great result. **Then Cowork understands \"clean this up\" as \"delete all files that look unused.\"**\n\nBy default, after you click on the **\"I accept the T&Cs\" button without even opening it up** (give a shout out if you read the T&Cs!), Cowork could easily have the right to read, write, or even delete anything you give it access to on your MacBook. \n\nI am not sure about you, but I definitely do not want my work for the client meeting tmr to disappear, then trying to recover them in a panic.\n\n**So I am going to show you how to avoid this risk**\n\n# 3 Easy & Effective Methods\n\n# Method 1: Create Separate Folder\n\nDo not give Claude Cowork access to your real work folders. Actually,\n\n* Make a new folder, maybe called \"Claude Workspace\"\n* Copy files into it (do not move them)\n* Think about it as a playground where mistakes are okay\n\nPeople usually forget to make backups. But if asked to intentionally copy files to a new folder, easy-peacy! People will do it\n\n# Method 2: Be Very Specific\n\n**Being polite with AI can be dangerous.**\n\n❌ Bad: \"Could you organize these files?\"\n\n✅ Good: \"Sort these 47 PDFs by date. DO NOT delete anything. Make folders named by year.\"\n\nWhen you are more specific, Claude Cowork does not need to guess, and **guessing is where problems happen.**\n\n# Method 3: Check Before You Approve\n\nWhen Claude Cowork wants to delete/move/rename something:\n\n* Wait 2 seconds\n* Ask: \"Do I understand WHY Claude wants to do this?\"\n* No? Refuse and do it yourself\n\nBe cautious on what Claude Cowork is about to do before you choose\n\n# A Simple Smart-Intern Mindset \n\nClaude Cowork is fast & useful for people. But like driving a fast car, you want to drive it carefully. \n\nGood news is all these protections are basically just asking you to think a bit differently:\n\n**Think of Claude Cowork as a smart intern who understands words literally, and has the key to your office.**\n\n**You would not tell an intern \"figure out my files by yourself.\" Same thing here.**",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qexa5c/cant_wait_to_try_claude_cowork_dont_let_it/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qc2ioj",
      "title": "Launching app next month, how do I market",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qc2ioj/launching_app_next_month_how_do_i_market/",
      "author": "psychedelic__cheese",
      "created_utc": "2026-01-13 20:34:25",
      "score": 15,
      "num_comments": 27,
      "upvote_ratio": 1.0,
      "text": "Hey everyone! I’m ready to launch an app I’ve been working on for the past few months, and I have no idea where to start when it comes to getting users. I have friends who can tell other friends, and I’ve also partnered with a few coffee shops and restaurants for the launch. However, I want to bring in as many users as possible. Any tips on how to launch it correctly.\n\nWould be really helpful. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qc2ioj/launching_app_next_month_how_do_i_market/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzhpn3w",
          "author": "mo_ahnaf11",
          "text": "talk to users, find where they hangout, do this daily, comment in conversations, if u use reddit join relevant subreddit and educate people, ive been doing this for months on reddit and its worked after consistency and i now use a service to get me those relevant leads and my outreach has doubled and my times been saved\n\nthats if u can spend some money otherwise do the manual search and do it daily\n\nfor those curious this is what im using now for reddit: [https://ventureradar.io](https://ventureradar.io), they have a tutorial as well [https://youtu.be/mr9mEYMBL7Y?si=ksjfPOe4ZQMhM5zo](https://youtu.be/mr9mEYMBL7Y?si=ksjfPOe4ZQMhM5zo)",
          "score": 2,
          "created_utc": "2026-01-14 05:36:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzunqkf",
              "author": "UpstairsTask8983",
              "text": "When I try to market my post is blocked by moderator. Even if it’s a relevant community but they say not to market. What’s the hack?",
              "score": 1,
              "created_utc": "2026-01-16 02:54:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzup56v",
                  "author": "mo_ahnaf11",
                  "text": "U have to help people, don’t promote. If u want to mention your product just mention the name and no links that’s it… give people knowledge before taking ! \n\nI use the AI drafted replies from VentureRadar and make small tweaks before copy pasting them to Reddit",
                  "score": 1,
                  "created_utc": "2026-01-16 03:02:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzlc8xe",
          "author": "Sudden-Context-4719",
          "text": "If you want more users from Reddit, try finding the right subreddits where your target audience hangs out and join the convo before launching. Since your app helps with sales on Reddit, you could use SocListener to spot good sales posts and engage there to get attention. Also, ask your coffee shop partners to share the app on their social media to widen reach beyond just friends.",
          "score": 2,
          "created_utc": "2026-01-14 19:18:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsu1mz",
          "author": "DevelopmentStock6950",
          "text": "Try to learn with a free customer (friends/family) or with your first paid customer, then learn from them, build your product based on some feedback. \n\nthen raise the bar, with the next ones. \n\nThere are some who are saying pace is everything, but quality will always outperform fast starters I would say. Good Luck!",
          "score": 2,
          "created_utc": "2026-01-15 21:10:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzf6mkb",
          "author": "who_am_i_to_say_so",
          "text": "This is a start.",
          "score": 1,
          "created_utc": "2026-01-13 21:06:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfatkw",
          "author": "WestPromotion6563",
          "text": "I'm having the same problem here. Maybe someone with real experience can join this thread.",
          "score": 1,
          "created_utc": "2026-01-13 21:26:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzsujaz",
              "author": "DevelopmentStock6950",
              "text": "Learn from your first customers, even if it is friends an family!\n\nThen maybe later you could use some leads, but first know your customer, search with ChatGPT and the feedback from your first customers for your ICP!\n\nThen work towards to them, if you know your customer, you will know how to improve your service/product, then you can go and search for possibilities to contact potential customers.",
              "score": 2,
              "created_utc": "2026-01-15 21:12:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzt8mft",
                  "author": "WestPromotion6563",
                  "text": "Would you be willing to try my new app and provide some feedback? It would be much much appreciated!",
                  "score": 1,
                  "created_utc": "2026-01-15 22:17:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzfdddj",
          "author": "greyzor7",
          "text": "Really depends your type of app, category (b2b/b2c). Start with organic for user acquisition.\n\nFor a B2B Saas or AI app, try launching your app on a combo of social media: X/Twitter, Reddit + launch platforms: Product Hunt, Microlaunch.\n\nIf you're building for B2C, then consider Tiktok & UGC as well. Ads later on.\n\nMeasure ROIs, then double down on what worked. Then keep doing it.",
          "score": 1,
          "created_utc": "2026-01-13 21:37:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfshkv",
          "author": "boreddeity",
          "text": "What’s the app, what’s the pricing, and what’s the marketing budget?",
          "score": 1,
          "created_utc": "2026-01-13 22:49:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgcwq8",
          "author": "Slight_Tutor1790",
          "text": "Senior PM here. A simple thing that helps is treating the launch like a learning sprint instead of a big splash. Pick one very narrow audience, talk to them directly, and watch where they drop off or get excited. Even 20 real users who give honest feedback can shape your messaging way better than chasing broad exposure early. Once that clicks, scaling the same message gets much easier.",
          "score": 1,
          "created_utc": "2026-01-14 00:39:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhpetj",
          "author": "pantrywanderer",
          "text": "A lot of launches fail because they try to do everything at once instead of proving one channel works. Before spending energy everywhere, get very clear on who this is actually for and what problem it replaces. Then pick one or two acquisition paths you can control and measure, and run them hard for a few weeks. Friends and local partners are great, but only if you learn what messaging gets people to actually stick around. Treat the launch like the start of testing, not a finish line, and adjust fast based on what users do, not what you hope they do.",
          "score": 1,
          "created_utc": "2026-01-14 05:34:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi0lq1",
          "author": "ConcertTechnical25",
          "text": "Don't just \"launch,\" you need to syndicate. If it's B2B, Product Hunt and Microlaunch are non-negotiable for that initial spike. But the real gold is in what @Slight_Tutor1790 said about the \"learning sprint.\"\nThose coffee shop partnerships are great for local density, but they don't scale. Use those 20 real users to find your \"High-Expectation Customer\" (HXC) profile. Once you identify the specific language they use to describe their pain, that becomes your copy for Reddit and X ads. A big splash with a generic message is just a fast way to burn a small budget. Solve for retention with a tiny group before you solve for acquisition with the masses.",
          "score": 1,
          "created_utc": "2026-01-14 07:07:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzirn5n",
          "author": "Fun-Ingenuity-3953",
          "text": "Personally, I think focusing on doing the marketing yourself is the way to go at the start. I personally recorded every one of my videos for the first few months and generated 10M+ views on TikTok. I used tools like Peerwatch to find viral formats for apps like mine, replicated them 1-for-1 and posted at least 5 on different accounts. Eventually, you figure out what works and can outsource the job to creators you hire",
          "score": 1,
          "created_utc": "2026-01-14 11:19:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzn555f",
          "author": "Euphoric-View-9876",
          "text": "Dont think of this as a “launch,” think of it as finding your first 20 people. Most apps fail because founders guess where users are instead of watching where they already hang out. What worked for me was starting with competitor and adjacent app audiences and joining conversations they were already having, not blasting posts everywhere. Once you know whos already problem aware, messaging and channels get way simpler. Friends + local partnerships are great, but signal beats scale early.",
          "score": 1,
          "created_utc": "2026-01-15 00:30:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvv622",
          "author": "GoMarketish",
          "text": "Firstly congrats on being so close to launching your new app✌🏻\n\nIt is quite a different approach, but it will save you alot of time in marketing on your own.\n\nYou can reach out to influencers, that their fans are interested in your niche, and offer them a commision based collaboration. This way for example you can reach out to 1,000 of them and even if only 5% accept it, it’s still 50 influencers actively promoting your app. Quick tip: instead of reaching out individually, streamline the process by e-mailing them in bulk.\n\nIf you’d need help with sourcing influencers, you can google [GoMarketish](https://gomarketish.com/), or I can even find you some for free.\n\nHope it helps!:)",
          "score": 1,
          "created_utc": "2026-01-16 08:00:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09bnt6",
          "author": "Numbersevenonly",
          "text": "Reach out to small online communities like subreddits or Facebook groups where your target users usually hang out.",
          "score": 1,
          "created_utc": "2026-01-18 08:13:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcevkr",
      "title": "Trying to grow a travel business without burning out",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qcevkr/trying_to_grow_a_travel_business_without_burning/",
      "author": "These_Run_7070",
      "created_utc": "2026-01-14 05:25:31",
      "score": 15,
      "num_comments": 15,
      "upvote_ratio": 1.0,
      "text": "hi yall i run travel as a side business alongside other work, and i realized recently is that experiences matter just as much as flights and hotels… but i wasnt actually treating them that way in my business. id recommend experiences and send clients a few ideas, but since they were booking on their own, i had no visibility into their choices and earned no commission. When time is limited, anything manual or messy just doesnt scale, ive been intentionally looking for ways to make experiences easier to book, easier to manage, and something that actually contributes to revenue without adding more admin or chaos. If I want this side business to grow into something bigger, every part of what i offer needs to work even when im not online 24/7.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qcevkr/trying_to_grow_a_travel_business_without_burning/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzhp750",
          "author": "kubrador",
          "text": "this reads like you're about to pitch something lol\n\nbut real talk - if you're not earning on experiences you're recommending, you're just doing free consulting. affiliate links to viator/GetYourGuide take like 5 min to set up and you get a cut without touching anything.\n\nthe \"i need systems that work while i sleep\" thing is valid but also what everyone says right before they spend 6 months building automations instead of just... getting more clients",
          "score": 2,
          "created_utc": "2026-01-14 05:33:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhrram",
              "author": "These_Run_7070",
              "text": "No, not trying to pitch anything here. I m just trying to see how other side hustle travelers handle the experiences efficiently. making sure clients book, I get visibility. Thats all. Pretty realistic question for anyone juggling this alongside a main job",
              "score": 3,
              "created_utc": "2026-01-14 05:53:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzhrzfe",
          "author": "pantrywanderer",
          "text": "What you are describing is exactly the point where a side business either becomes a system or burns you out. The moment something relies on you being online and coordinating manually, it stops scaling and starts taxing you mentally. I like that you are thinking in terms of visibility and control, not just commission. If you cannot see what is being booked or manage it cleanly, it is basically invisible labor. I would step back and map which parts of the experience flow must be automated versus which ones are truly value-add from you. Once that line is clear, growth decisions get a lot easier and less exhausting.",
          "score": 2,
          "created_utc": "2026-01-14 05:54:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhsf44",
          "author": "Boring_Analysis_6057",
          "text": "Yes im also looking to grow my travel business i dont know what to use",
          "score": 2,
          "created_utc": "2026-01-14 05:58:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhxth1",
          "author": "SpecialistAd7913",
          "text": "Maybe consider partnering with a few local experience providers who offer affiliate or commission options",
          "score": 2,
          "created_utc": "2026-01-14 06:43:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhrtpw",
          "author": "Little-Set1246",
          "text": "You should definitely keep pushing to integrate experiences into your main offering because people remember those unique moments way more than just a smooth flight",
          "score": 1,
          "created_utc": "2026-01-14 05:53:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhswpr",
          "author": "WoodpeckerNo9461",
          "text": "Can i ask what kinda experiences are you thinking of focusing on for your clients to start building that value?",
          "score": 1,
          "created_utc": "2026-01-14 06:02:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhtk2q",
          "author": "NoMacaroon6142",
          "text": "I get what youre saying about making experiences a real part of your business instead of just suggesting them.",
          "score": 1,
          "created_utc": "2026-01-14 06:07:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhv3ci",
          "author": "Sea_Acanthaceae_5659",
          "text": "Sometimes when you contact local people directly you get a direct and higher commission that does not imply other fees to third party companies… it’s very difficult but trust me, it’s worth it",
          "score": 1,
          "created_utc": "2026-01-14 06:20:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhzkrf",
          "author": "Curious-Session4119",
          "text": "setting up a simple booking system or partner network: pick a few reliable experience providers that offer direct booking or commission options, and create a small, organized catalog for your clients. Then, use a shared calendar or lightweight CRM to track who booked what",
          "score": 1,
          "created_utc": "2026-01-14 06:58:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi5qql",
          "author": "coralnetwork-mu",
          "text": "I'm building a website for a travel agent right now - you might want to consider a quizfunnel into a booking page. That way you already know what the client needs.\n\nCan set this up for you if you need.\nAlso, affiliate links from these experiences if they exist, otherwise you can get them to buy from you and then escrow the money to the travel provider, like how getyourguide does.",
          "score": 1,
          "created_utc": "2026-01-14 07:54:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi7xs0",
          "author": "BbWeber",
          "text": "I can see that there are some people who work in travel in here. DM me what you are doing - i might have some collaboration ideas which we should explore.\n\nI own a travel app.",
          "score": 1,
          "created_utc": "2026-01-14 08:15:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzikc0j",
          "author": "Total-Tadpole-3506",
          "text": "Totally feel you! Experiences are where the magic happens, but if clients book on their own, you lose both control and commission.\n\nTo keep it simple and scalable, try using platforms like GetYourGuide or Viator with affiliate links so clients can book directly through you. You get paid, and no extra admin for you. Also, setting up an automated email with tailored experience ideas after they book flights or hotels can save tons of time.\n\nIf you want more control, partner with local providers for exclusive deals. And definitely use a simple CRM or spreadsheet to keep track without stressing.",
          "score": 1,
          "created_utc": "2026-01-14 10:15:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzio1dj",
          "author": "gregb_parkingaccess",
          "text": "Would an AI to answer email and phones help?",
          "score": 1,
          "created_utc": "2026-01-14 10:48:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdgh5w",
      "title": "How b2b lead gen agency fits into a full-funnel strategy.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qdgh5w/how_b2b_lead_gen_agency_fits_into_a_fullfunnel/",
      "author": "Xclus",
      "created_utc": "2026-01-15 10:53:15",
      "score": 15,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I work at a large agency and we are looking to partner with a specialized firm that we can recommend to our clients. We need to find the best b2b lead gen agency to handle the outbound portion of the funnel while we handle the branding and creative. My concern is finding an agency that actually plays well with others and provides clean data that our clients' sales teams can actually use. I'm looking for professionalism, clear reporting, and a focus on long-term relationship building rather than just quick wins.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qdgh5w/how_b2b_lead_gen_agency_fits_into_a_fullfunnel/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzqd5yd",
          "author": "ActivitySmooth8847",
          "text": "If you want clean data that actually works for sales teams, check out SocLeads. It pulls leads from places like LinkedIn and Google Maps and makes sure the info is solid, which helps avoid the usual messy lists. Could be a good fit if you want something that plays nice with your branding work and keeps things professional.",
          "score": 1,
          "created_utc": "2026-01-15 14:22:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqji1p",
              "author": "Xclus",
              "text": "Thank you for this, I'll definitely check it out",
              "score": 1,
              "created_utc": "2026-01-15 14:54:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qbn9cy",
      "title": "How are founders approaching cold outreach in 2026?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qbn9cy/how_are_founders_approaching_cold_outreach_in_2026/",
      "author": "kamlekar",
      "created_utc": "2026-01-13 09:47:12",
      "score": 12,
      "num_comments": 4,
      "upvote_ratio": 0.92,
      "text": "Hello folks, we have been trying to make cold outreach less of a nightmare lately, especially on the B2C side and honestly, it’s been a lot harder than expected. Our team  bounced between IG DMs, X and Reddit  trying to automate and  it  hasn't clicked.\n\n I even tried using VAs in the past but it felt disconnected and the corporate email blast style definitely doesn't work with regular consumers.\nThe only thing that’s actually improved my reply rate was changing how I present the message.\n Instead of sending walls of text, I started using PosterMyWall to create simple visual explainers and quick graphics that show the problem and the solution in about three seconds. \nIt makes the outreach feel way less spammy and much easier to digest. I’m still curious what everyone else is doing to get responses without just playing a volume game that burns people's trust.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qbn9cy/how_are_founders_approaching_cold_outreach_in_2026/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzozt4c",
          "author": "Inevitable-Fly8391",
          "text": "I’ve noticed that when outreach feels like it’s asking for time instead of stealing it, replies go up. Your 3-second explanation idea fits that perfectly. We’ve been leaning on Outreachbloom mostly to test and iterate messaging without burning trust.",
          "score": 6,
          "created_utc": "2026-01-15 08:03:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdh6yy",
          "author": "Sudden-Context-4719",
          "text": "I feel you on the cold outreach struggle. For B2C, visuals help a lot like you said, but also try engaging more naturally in comments before sliding into DMs. If you want to test something on Reddit, SocListener can find relevant posts and help you drop tailored replies that don’t feel spammy.",
          "score": 1,
          "created_utc": "2026-01-13 16:14:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfi85w",
          "author": "haiku-monster",
          "text": "Some suggestions in my mind rn:\n\n* Send fewer emails, but to better-matched ICPs\n* Keep emails super short and personal\n* Lead with smth useful, not a hard pitch\n* Rely on follow ups (2nd-3rd touch is where replies happen)\n\nVolume matters less. Relevance matters more.",
          "score": 1,
          "created_utc": "2026-01-13 21:59:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqt1v9",
          "author": "OrganicClicks",
          "text": "Unfortunately lots of strategies that worked before in sales and marketing are not so productive anymore, not just cold pitching. Keep the messages short. One sentence that shows relevance, one sentence that explains why you reached out, and a soft next step. Anything longer gets ignored no matter how personalized it is. Also time the outreaches to changes and incidents such as job changes, new features, broken workflows, fresh posts so that it the message doesn't feels automated.",
          "score": 1,
          "created_utc": "2026-01-15 15:39:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgu8zk",
      "title": "Anyone know how to growth hack a Facebook group from scratch?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qgu8zk/anyone_know_how_to_growth_hack_a_facebook_group/",
      "author": "Nice-Chair8658",
      "created_utc": "2026-01-19 04:23:44",
      "score": 8,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "Looking for anyone who has had success in growing a Facebook group from scratch quickly. Besides inviting friends + family and posting in other groups, what ways are there? \n\nI want to try to get 500 members in 30 days from scratch. Any good growth hacks? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qgu8zk/anyone_know_how_to_growth_hack_a_facebook_group/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o0fcdb6",
          "author": "stovetopmuse",
          "text": "I have seen people hit numbers like that, but it is rarely a hack and more distribution math. The fastest path is anchoring the group to an existing pain point and seeding it from somewhere with built-in intent, like comments on related posts or a waitlist tied to a specific outcome. Generic groups stall fast because there is no reason to join today. What usually works is one strong hook, very tight topic scope, and visible early activity so new members do not feel like they are joining a ghost town. If you need 500 in 30 days, you probably need one external source that already has attention rather than trying to brute force invites.",
          "score": 1,
          "created_utc": "2026-01-19 05:06:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fcn3u",
              "author": "Nice-Chair8658",
              "text": "Yeah that makes sense. I would like to know how the algorithm for groups work a bit more. It seems once you hit the few hundred mark, Facebook really starts to push your group to people. In my experience anyways",
              "score": 1,
              "created_utc": "2026-01-19 05:08:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ga3pu",
          "author": "pantrywanderer",
          "text": "Most of the fast growth I have seen comes from having a very clear reason for the group to exist, not from clever tactics. If people cannot explain in one sentence why they should join, growth stalls no matter how many invites you send. A simple loop that works is valuable content posted publicly, then the group as the place for deeper discussion or access. Partnerships with adjacent communities can help, but only if the audiences genuinely overlap. I would also be careful chasing a number like 500 if the first members are not engaged, that usually creates a dead group later. Curious what the niche is, since the approach changes a lot based on that.",
          "score": 1,
          "created_utc": "2026-01-19 09:58:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0h5vtb",
              "author": "Nice-Chair8658",
              "text": "Car niche, specifically people looking to purchase a new car. Was wanting to make a lot of groups of different makes and models",
              "score": 1,
              "created_utc": "2026-01-19 13:59:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gnfi1",
          "author": "2solid222",
          "text": "I've had solid experience with this - I grew a group to over 1,500 members in a span of a couple months. It all depends on your niche honestly, if you can share who you're targeting perhaps people can leave more accurate advice.",
          "score": 1,
          "created_utc": "2026-01-19 11:56:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0h5ruj",
              "author": "Nice-Chair8658",
              "text": "I am starting in the car niche. The idea is to make groups for people looking to buy new cars. So I am wanting to make a bunch of groups for different makes and models, etc.",
              "score": 1,
              "created_utc": "2026-01-19 13:58:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qea7am",
      "title": "The $0 CAC playbook: How we grew to 340 customers without spending on ads",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qea7am/the_0_cac_playbook_how_we_grew_to_340_customers/",
      "author": "Delecch",
      "created_utc": "2026-01-16 08:05:08",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 0.88,
      "text": "Sharing my exact playbook since this worked way better than expected. No gatekeeping.\n\n\n\n\\*\\*Context:\\*\\* B2B SaaS in the social media management space. Started 8 months ago. Currently at $30K MRR with 340 paying customers.\n\n\n\n\\*\\*Total ad spend: $0\\*\\*\n\n\n\n\\---\n\n\n\n\\*\\*Channel 1: Building in Public (40% of customers)\\*\\*\n\n\n\nThis was the game changer. I started sharing everything on Twitter/X:\n\n\\- Weekly revenue updates\n\n\\- Feature launches\n\n\\- Failed experiments\n\n\\- Actual screenshots of our dashboard\n\n\n\n\\*\\*Why it works:\\*\\* People trust transparency. When you share your failures alongside wins, you become relatable, not salesy.\n\n\n\n\\*\\*Tactics:\\*\\*\n\n\\- Posted 4-5x per week minimum\n\n\\- Replied to every comment\n\n\\- Engaged with others in the space (not competitors, adjacent tools)\n\n\\- Used Crescitaly to track which content drove actual signups\n\n\n\n\\---\n\n\n\n\\*\\*Channel 2: Strategic Reddit & Community Engagement (35% of customers)\\*\\*\n\n\n\nNOT spamming links. Actually providing value.\n\n\n\n\\*\\*The approach:\\*\\*\n\n\\- Found 5-6 subreddits where our ICP hangs out\n\n\\- Spent 2 weeks just answering questions, no mentions of our product\n\n\\- Built genuine karma and reputation\n\n\\- Mentioned our product ONLY when directly relevant to someone's problem\n\n\n\n\\*\\*Key insight:\\*\\* Reddit users have incredible BS detectors. If you're here to sell, they'll know. If you're here to help, they'll convert themselves.\n\n\n\n\\---\n\n\n\n\\*\\*Channel 3: Integration Partnerships (15% of customers)\\*\\*\n\n\n\nBuilt integrations with 3 popular tools in our space. Got listed in their marketplaces/directories.\n\n\n\n\\*\\*Why it works:\\*\\* You're borrowing their distribution. Their users are already looking for solutions.\n\n\n\n\\---\n\n\n\n\\*\\*Channel 4: Cold DMs That Don't Suck (10% of customers)\\*\\*\n\n\n\nNot pitching. Starting conversations.\n\n\n\n\\*\\*Template that worked:\\*\\*\n\n\"Hey \\[name\\], saw your post about \\[specific thing\\]. Had a similar experience with \\[relate\\]. Curious how you ended up solving \\[their problem\\]?\"\n\n\n\nThat's it. No pitch. Just genuine curiosity. The conversation naturally leads to what you do.\n\n\n\n\\---\n\n\n\n\\*\\*What I'd add if starting over:\\*\\*\n\n\\- YouTube content (long-form is underrated for B2B)\n\n\\- Newsletter from day 1\n\n\\- More IRL networking\n\n\n\n\\*\\*What didn't work:\\*\\*\n\n\\- Cold email (2% reply rate, waste of time)\n\n\\- Product Hunt (got 30 upvotes, 2 customers)\n\n\\- LinkedIn posts (maybe our ICP isn't there)\n\n\n\n\\*\\*Questions for the community:\\*\\*\n\n1. Anyone had success with YouTube for B2B SaaS?\n\n2. How do you measure organic attribution accurately?\n\n3. What's your best $0 CAC channel?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qea7am/the_0_cac_playbook_how_we_grew_to_340_customers/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzwbshg",
          "author": "AlisaWaelchi",
          "text": "for reddit engagement, i used beno one to automate finding relevant discussions and posting helpful comments, which saved time and brought in qualified leads without manual effort.",
          "score": 1,
          "created_utc": "2026-01-16 10:33:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzy2m6u",
          "author": "Sudden-Context-4719",
          "text": "YouTube is solid for B2B but takes time to get traction. For measuring organic attribution, try tracking UTM parameters combined with tools like Crescitaly you mentioned. Also, since you’re active on Reddit, tools like SocListener can help find the right posts to engage with and boost conversions without spamming.",
          "score": 1,
          "created_utc": "2026-01-16 16:32:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyme7v",
          "author": "smarkman19",
          "text": "Your whole system works because you picked a few channels and went deep instead of spraying everything. Main thing I’d double down on is turning what you’re already doing into compounding assets.\n\nFor YouTube B2B, what’s worked for me is “over-the-shoulder” stuff: teardown a real account, show your dashboard, and narrate your thinking. One hero topic per ICP pain, then slice that into shorts for X and community posts. Don’t chase volume, chase 10–20 videos that become evergreen answers you can link in DMs and Reddit comments.\nOn attribution, I treat it like triangles not straight lines: last touch (what they clicked), first touch (where they first heard), and “self-reported” (“how did you hear about us?” free text in signup + a required field in onboarding). I log Reddit/X/organic in a simple sheet, then compare with GA/Search Console. I’ve used F5bot and Hypefury, tried GummySearch too, but Pulse for Reddit ended up as the thing I keep open because it surfaces the exact threads where my ICP is talking and drafts a first-pass reply I can humanize fast.\nNet: keep doing exactly this, but convert your best plays into reusable proof and content so every new customer pulls in the next one.",
          "score": 1,
          "created_utc": "2026-01-16 17:59:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o003yys",
          "author": "OkDependent6809",
          "text": "ongrats on $30k mrr, that's solid.\n\nhonestly though attribution for organic channels is mostly guessing. like you say reddit drove 35% but how do you actually know? someone sees your twitter, checks out your site, comes back a week later via google search, then signs up. where do you attribute that?\n\nwe tried building in public for our fintech. posted weekly updates for like 3 months. got some engagement but maybe 2-3 signups total. either our product wasn't interesting enough or our audience wasn't on twitter. hard to say.\n\nreddit worked better for us but mostly because b2b finance people actually hang out in specific subs. your mileage varies a ton based on where your icp actually is.\n\ncurious how you're measuring which channel drove what customer? utm tags? asking in onboarding? because in my experience people don't remember how they found you.",
          "score": 1,
          "created_utc": "2026-01-16 22:06:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o019fk1",
          "author": "boreddeity",
          "text": "Great post",
          "score": 1,
          "created_utc": "2026-01-17 02:02:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcl88b",
      "title": "How do you find the emails of professional cold emailers / lead gen people?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qcl88b/how_do_you_find_the_emails_of_professional_cold/",
      "author": "Reikoii",
      "created_utc": "2026-01-14 11:46:59",
      "score": 6,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,\n\nI’m in a bit of a weird spot and could use some advice.\n\nI built a B2B product for people who do cold email professionally (lead gen agencies, outbound freelancers, growth marketers, etc.). I know this audience exists, I just struggle with finding their actual email addresses in a clean, legit way.\n\nSo I wanted to ask people who’ve been around longer than me:\n\n* Where do you usually get email lists for *specific roles* like cold emailers or lead gen folks?\n* Do you rely more on LinkedIn → enrichment tools?\n* Communities, directories, marketplaces?\n* Or is it mostly manual + scraping + enrichment?\n\nI’m not trying to spam random people, I’m trying to understand what a **reasonable, ethical workflow** looks like for reaching this niche.\n\nAny guidance, tools, or real-world processes would help a lot!\n\nAppreciate it.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qcl88b/how_do_you_find_the_emails_of_professional_cold/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o05mxm8",
          "author": "Great_Session_4227",
          "text": "Mixing browser extensions with outreach on the same leads can get accounts flagged. Using cloud based multichannel tools like Overloop is safer since the sequences run server-side.",
          "score": 3,
          "created_utc": "2026-01-17 19:16:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlsm9e",
          "author": "Sudden-Context-4719",
          "text": "LinkedIn + enrichment tools like Hunter or Snov work best for me to find specific roles emails. Manual scraping is slow and messy. Also check niche communities or forums where lead gen folks hang out, sometimes they share contact info there.",
          "score": 2,
          "created_utc": "2026-01-14 20:33:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsig5q",
          "author": "DanielShnaiderr",
          "text": "Kinda ironic that you're trying to cold email the cold emailers tbh. Those people have the most finely tuned spam filters and skepticism of anyone.\n\nLinkedIn Sales Nav plus enrichment is the standard workflow. Find people with titles like outbound manager, lead gen specialist, growth marketer, then run them through an enrichment tool to get emails. Just know that this audience gets hammered with pitches constantly so your messaging better be damn good.\n\nCommunities are actually your best bet here. Cold email Twitter, outbound focused Slack groups, subreddits like this one, Facebook groups for agency owners. These people self-identify and hang out in specific places. Building presence there beats scraping emails because you get warm inbound instead of fighting through their filters.\n\nOur users who sell to this market usually find that cold email ironically performs the worst. The audience is too savvy and too annoyed by bad outreach. What works better is content that demonstrates you actually understand their problems, then letting them come to you.\n\nIf you're set on outbound though, keep your list tiny and hyper-relevant. Maybe 50-100 people max that you actually research individually. Personalization needs to be real, not merge field crap they'll spot instantly. Reference something specific they posted or a problem you know they have.\n\nThe ethical workflow you're asking about is basically just don't buy lists, verify everything before sending, and accept that small targeted batches beat mass blasting every time. Especially with this audience.",
          "score": 2,
          "created_utc": "2026-01-15 20:16:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzt9yef",
              "author": "Reikoii",
              "text": "Thanks for the advice! Yeah i’ll keep it relevant and personalized i guess that’s the best shot i have",
              "score": 1,
              "created_utc": "2026-01-15 22:24:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzj5f5d",
          "author": "Calm_Ambassador9932",
          "text": "You’re not wrong .. this niche is oddly hard to reach by email despite being email-native. Most teams I’ve seen start with LinkedIn role + behavior signals (titles, posts, tools in bio), then enrich selectively instead of buying lists. The cleaner path tends to be communities/directories → opt-in → email later, with cold email used sparingly for validation, not scale. Buying “lead gen” lists almost always creates more deliverability problems than traction.",
          "score": 1,
          "created_utc": "2026-01-14 13:00:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzj8qfv",
          "author": "heisty377",
          "text": "this is a tricky one for that specific niche. i've found it's less about finding a generic list and more about identifying where these people actively promote their own services.\n\n\n\ni've often looked at marketplaces or agency directories where they list their cold email or lead gen offerings. their contact info is usually more visible there, or at least a direct path to a public profile. it becomes a more targeted search for those actively selling their expertise.\n\n\n\ndo you see better engagement when you approach service providers directly, versus trying to find their emails from content they've published?",
          "score": 1,
          "created_utc": "2026-01-14 13:20:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjbcjx",
          "author": "Gullible_Brother_141",
          "text": "Most people I’ve seen rely on LinkedIn discovery first, then enrichment, rather than buying pre-made lists. Communities and marketplaces tend to give better signal quality,  while scraping at scale usually creates more noise than value.  The ethical workflows are slower, but the response rates are usually much higher.",
          "score": 1,
          "created_utc": "2026-01-14 13:35:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztdsnq",
          "author": "Euphoric-View-9876",
          "text": "What made this click for us was realizing that finding emails was the wrong starting point. The hard part is first identifying who actually self identifies as a cold emailer or lead gen operator, not just someone with a vague title. Once thats clear, enrichment becomes a secondary, almost mechanical step.",
          "score": 1,
          "created_utc": "2026-01-15 22:43:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzuxg7g",
          "author": "Lower-Instance-4372",
          "text": "Send LinkedIn connection requests to people who are big in the cold email space\n\nAfter these people accept your connection requests, sign up for LinkedIn Sales Navigator\n\nThen, use the “Connections of“ filter in Sales Navigator to see all of the connections of these influencers that you recently connected with\n\nthen use a chrome extension like Emailchaser to extract these leads with their emails from Sales Navigator\n\nall of these leads are people who will be in the cold email space since they are already connected to these big influencers on LinkedIn",
          "score": 1,
          "created_utc": "2026-01-16 03:50:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzljora",
          "author": "WitnessEcstatic9697",
          "text": "the research part is what kills small teams\n\nI had the same problem hours finding prospects, then half of them weren't even a fit\n\nended up automating the research and qualification part. way less time wasted on wrong leads\n\nhappy to share how if useful",
          "score": 0,
          "created_utc": "2026-01-14 19:52:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzmv0fc",
              "author": "Reikoii",
              "text": "i'd love to know more details!",
              "score": 1,
              "created_utc": "2026-01-14 23:35:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qde9o1",
      "title": "Is your AI visibility strategy just creating more noise? Has Anyone used SearchTides before?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qde9o1/is_your_ai_visibility_strategy_just_creating_more/",
      "author": "hcai88",
      "created_utc": "2026-01-15 08:35:05",
      "score": 6,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "We're all using AI to scale content, but are we just flooding our own niches? My analytics show traffic is flat even though output is up. It feels like my \"strategy\" is just creating competent, forgettable articles that add to the pile.\n\nIs anyone else seeing this? Have you found a way to use AI for visibility that actually cuts through the noise instead of making more of it?\n\nWhat's working?\n\nHas anyone heard of Searchtides?  I found them on Google.  They seem to be an agency on AI Search and AI Visibility for businesses and companies. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qde9o1/is_your_ai_visibility_strategy_just_creating_more/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qeh8ii",
      "title": "should I offer growth consultancy or growth analysis + planning?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qeh8ii/should_i_offer_growth_consultancy_or_growth/",
      "author": "zeniath",
      "created_utc": "2026-01-16 14:21:38",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Hello! I’ve done an AMA about 2 months ago in a different subreddit about my past experience: scaling an ecommerce store from 0-200 orders in 48h, threads 0-14k followers in 2 weeks, ig 58k followers in 60 days.\n\nAnd recently I’ve helped some friends achieve a couple of things: \n\n•200k ig account - numerology niche (helped him increase his average views and start noticing some real growth again) \n\n•100 followers account - “influencer” posting skits/ funny stuff (he was averaging 2k views; I  directed & edited 3 clips for him, one of them got +300k views) He also started applying what I told him and his average views per clip went up.\n\n•I also created an AI influencer to test some stuff on instagram and I’ve hit 700k views on my first reel, 70k on a different one. The other ones got +20k views each, but they weren’t reels that were meant ti be viral. They were made to increase the follow rate of the people who were coming from the 700k views one. (only posted 10 reels on this account)\n\nNow the thing is this. I realised that what I’ve learned  can be applied to get views in any niche and I also realised what I truly like: analysing why and how things work + teaching others how to do so. \n\nI already got some people that know me irl asking for my advice and since I don’t want to launch a course, my question is this:\n\nWhat would you offer to people that want your guidance? \n\n•consultancy: pretty much helping them and guiding them step by step (would have to charge more)\n\n•social media analysis + fixes and perhaps some sort of planning for their content? Could even do some recurring thing where I build them a weekly/ monthly content plan: scripts, filming & editing directions\n\n•something else?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qeh8ii/should_i_offer_growth_consultancy_or_growth/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "nzxflk3",
          "author": "Euphoric-View-9876",
          "text": "The decision isnt really consulting vs analysis its whether youre selling thinking or execution. Early on, the highest leverage offer is usually a paid diagnosis a short, opinionated teardown that tells them what to stop doing, what actually matters, and why. If people implement that and come back asking can you help us apply this?, youve earned the right to charge more for consulting or planning. Starting with analysis lets you test demand without locking yourself into high touch delivery.",
          "score": 2,
          "created_utc": "2026-01-16 14:48:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzxvbbj",
              "author": "zeniath",
              "text": "Fair enough! You’re right! I actually noticed this especially with my friend. He started calling me before making any new decision after he noticed that my advice brought him better results right away.",
              "score": 1,
              "created_utc": "2026-01-16 16:00:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzyc8fk",
                  "author": "Euphoric-View-9876",
                  "text": "Thats actually the signal you’re looking for. When someone starts checking decisions with you before acting, youve moved from “helpful advice” to trusted judgment. Thats why a tight diagnostic works so well it teaches them how to think, not just what to post. A simple way to package it is a one time teardown with clear constraints what to ignore, what to double down on, and what experiment would change the outcome fastest. The people who execute will self select into deeper work, and you avoid becoming the on call fixer for everyone else.",
                  "score": 2,
                  "created_utc": "2026-01-16 17:14:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o00clbf",
          "author": "SpudMasterFlash",
          "text": "Be subtle, (not that I am all that much) try to add nuggets of value where you can",
          "score": 1,
          "created_utc": "2026-01-16 22:49:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}