{
  "metadata": {
    "last_updated": "2026-02-05 17:09:59",
    "time_filter": "week",
    "subreddit": "GrowthHacking",
    "total_items": 20,
    "total_comments": 107,
    "file_size_bytes": 122776
  },
  "items": [
    {
      "id": "1qvpwkp",
      "title": "I’ve hired over 1,000 influencers and spent millions. Here is the no-bs playbook.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qvpwkp/ive_hired_over_1000_influencers_and_spent/",
      "author": "borjafat",
      "created_utc": "2026-02-04 14:24:50",
      "score": 68,
      "num_comments": 27,
      "upvote_ratio": 0.92,
      "text": "If you want to scale your marketing with influencers but dont want to burn cash on bad deals, get scammed by fake bot views, or waste months listening to \"gurus\" who have never actually booked a sponsorship... then you might enjoy this.\n\nI work as a Marketing Director for a pretty big brand and I also run my own SaaS on the side. \n\nBetween the two, I've hired over a thousand influencers and spent millions in partnership dollars.\n\nHere is the brain dump on what actually works:\n\nYouTube longform first until you max out on youtube longform, dont do any other format. \n\nNothing beats the power of the attention spam and the direct CTA with link in description as longform does. \n\nIgnore all the gurus telling you to hire one million micro influencers on TikTok, even if you’re target audience is on TikTok/Reels, I guarantee there are also channels on youtube with longform videos for that same audience, dont waste your time don’t lose your sanity, do longform until there’s none else to partner with on that format.\n\nYou need to have a solid proven offer before you try influencers. Have scarcity in the CTA, like “First 1,000 people to click the link get this special offer”\n\nTest 60 second integrations vs fully dedicated videos (more expensive). Have them put the 60 second promo in the first 5 minutes of the video to maximize eyeballs on your offer.\n\nBeware of scammers, several channels inflate their views and engagement with bots, look for suspiciously consistent high views across all videos, look for repeated and sometimes identical comments praising the influencer, too many emojis, and celebrities in the profile pictures even.\n\nIf you’re a startup strap for cash, you will want to push for commission only deals, for my startup Rebelgrowth, that’s 30% on every generated subscription for life, but in my experience most influencers don’t like performance deals even when they would be making more money in the long term, they dont know this so its your job to explain the math on why this is the case, make a simple spreadsheet, make a loom video, praise their last video, explain why you think your startup would be a great fit and explain why the commission offer is better than flat rate.\n\nHowever, if you’re an established startup/company with a budget, you’ll want to do flat rate deals because YOU will make more money in the long term as opposed to having to pay 30% of your revenue forever.\n\n30% of deals will succeed, those are the channels you will want to nurture and repeat and that will carry the whole effort, another reason why you need to stay away from flat rate as a bootstrapped startup, you can’ afford to have your first 10 deals fail looking for the 3 that will work. This is a numbers game.\n\nWhat I look for in a channel (this is less important when doing performance deals): Audience affinity; how relevant is the topic to your business, what are audience demographics (age, location, genre), how consistent are views across the last 12 videos, how often does the channel publish, what’s the engagement rate (high engagement = high conversions), I can afford more on a channel with 7,000 views but 15% engagement rate than a channel with 10,000 views but 5% engagement rate. Engagement is comments to subs (or views) rate.\n\nOn flat rates, always negotiate down aggressively, argue why with the channels using your analysis from the above paragraph. I personally look for sub $50 CPMs when doing flat rate (irrelevant when doing commission deals).\n\nTo find channels, ask your favorite AI chat to do “Deep Research” and find the top 100 channels that meet your preferred criteria. If doing commissions, aim for small channels to improve your chances of getting a “yes”, so channels with under 10k subs. You can also simply search youtube, or one of the millions of apps out there that have a youtubers database. Gather the list and then it's time to find the emails. I pay a guy on upwork $50 per 100 researched channels because youtube only lets you unlock 5 emails per day. This guy has a bunch of accounts he uses to unlock emails quicker.\n\nOnce you have the emails, use your favorite outreach tool to schedule 4 - 7 emails (the money is in the followups). Keep it simple, lead with “Paid sponsorhip?...” in the subject and first line of email copy so the influencer knows you’re down to business.\n\nHave dedicated landing pages per influencer or dedicated coupon codes or if you’re doing affiliate commissions it doesn’t really matter since they will have their affiliate link to your product anyways.\n\nYou’ll want to stay compliant if you’re a big company, which means making sure the influencer clearly discloses its a sponsorship when the Ad begins, have them put your logo as soon as they say the video is sponsored by your company.\n\nCheers,  \nBorja",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qvpwkp/ive_hired_over_1000_influencers_and_spent/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3ldtlg",
          "author": "jf_sourced",
          "text": "Super helpful. We started this on LinkedIn and are now building out Youtube database / quotes / outbound. Only issue I've run into so far is that YT influencer prices are crazy high. Can you provide any estimates around, for instance, click through rate (website visitor per X views) so I can better understand the economics? Hard to justify some of these investments",
          "score": 2,
          "created_utc": "2026-02-04 20:23:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p1f8q",
          "author": "Alarming_Bluebird648",
          "text": "this is actually a goldmine for anyone starting out with creators. performance vs flat fee is such a massive debate in every growth channel i've worked in tbh. thanks for the real numbers man.",
          "score": 2,
          "created_utc": "2026-02-05 10:37:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jav8t",
          "author": "bubbascrub9793",
          "text": "Great share op! Quick question on the outreach emails do you follow up manually or are you using a tool for that? I feel like my follow ups always end up in spam.",
          "score": 1,
          "created_utc": "2026-02-04 14:33:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jb5k5",
              "author": "borjafat",
              "text": "Any of the famous tools will work. These emails are asking for money, they're not sales pitches so they shouldn't end in spam. Just dont include links until you're asked for it.",
              "score": 1,
              "created_utc": "2026-02-04 14:35:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jg8qe",
          "author": "Otherwise_Wave9374",
          "text": "This is a really solid brain dump, especially the part about longform first and having a proven offer before you pour money into creators. The performance vs flat-fee tradeoff is so real, most people dont do the math.\n\nCurious, when youre evaluating a channel, do you have a minimum view consistency threshold (like last 10 vids within X percent of avg)?\n\nAlso, weve been documenting a few SaaS marketing experiments and channel tests on our side if anyone wants extra reading: https://blog.promarkia.com/",
          "score": 1,
          "created_utc": "2026-02-04 15:01:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jiga3",
              "author": "borjafat",
              "text": "Yeah, I want to see views steady or trending up",
              "score": 1,
              "created_utc": "2026-02-04 15:12:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jilqi",
          "author": "Then-Emphasis-3439",
          "text": "DM for all in one solution",
          "score": 1,
          "created_utc": "2026-02-04 15:12:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3joei5",
          "author": "Own-Moment-429",
          "text": "Solid advice man",
          "score": 1,
          "created_utc": "2026-02-04 15:40:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3josf9",
          "author": "professorhummingbird",
          "text": "Damn cheers mate. It’s been so long since I’ve seen actual good advice on Reddit. I’m used to AI slop everywhere. Great info and comes in timely. \n\nI’m experimenting with a different growth engine, easy to make short form videos related to my product. I wonder how it compares with working with longform influencers",
          "score": 1,
          "created_utc": "2026-02-04 15:42:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jtuxe",
              "author": "borjafat",
              "text": "Thank you, tel me about your shortform strategy",
              "score": 1,
              "created_utc": "2026-02-04 16:05:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jxl8v",
          "author": "MaxGarrod",
          "text": "Thanks for the post. What about instagram? That’s one I never managed to get my head around",
          "score": 1,
          "created_utc": "2026-02-04 16:22:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jxwd5",
              "author": "borjafat",
              "text": "Nope, stick to youtube longform until you can't grow there anymore.",
              "score": 1,
              "created_utc": "2026-02-04 16:24:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3kn9cq",
          "author": "Key-Boat-7519",
          "text": "Leaning hard into YouTube longform is the move here, especially for anything with a real consideration cycle or demo story to tell. The “max out longform before you touch other formats” rule lines up with what I’ve seen: one solid 60–90s mid-roll with a tight CTA in the first 5 minutes can beat a whole swarm of scattered shorts.\n\nOne thing I’d add is to track creator-level LTV, not just ROAS on the first campaign. The 30% of channels that work usually keep working if you treat them like a true sales channel: share conversion data back with them, test new hooks together, let them see which angles land.\n\nFor discovery, I’ve used things like Grin and Upfluence plus AI helpers like Pulse for Reddit to surface niche communities and talking points before I ever reach out, so the pitch feels way more “I get your audience” and way less copy-paste. This is all a volume game, but the compounding effect of a small stable of proven creators is where the real upside lives.",
          "score": 1,
          "created_utc": "2026-02-04 18:20:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mu9mw",
          "author": "Routine-Menu1950",
          "text": "Nice",
          "score": 1,
          "created_utc": "2026-02-05 00:51:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nnryd",
          "author": "skyler_outx",
          "text": "Great breakdown especially the longform-first approach and creator-level LTV point. Totally agree that treating proven creators like a real sales channel (and compounding relationships) is where the real upside is.",
          "score": 1,
          "created_utc": "2026-02-05 03:42:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nvpqc",
          "author": "Fun_Ganache_8232",
          "text": "Thanks for the post! Hands down the most useful one I've seen recently.",
          "score": 1,
          "created_utc": "2026-02-05 04:34:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3olch0",
          "author": "Branch_Live",
          "text": "So. I am making a SAAS. Are you suggesting I do a lot of my own long form videos to gain client trust ? \n\nSorry for the basic question .",
          "score": 1,
          "created_utc": "2026-02-05 08:03:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p13fh",
          "author": "Ambitious_Mail_3392",
          "text": "This is a solid breakdown, especially on longform economics and deal structure. One thing I would add from the agency side is that the format matters less once creators stop being treated only as distribution.\n\nI work in growth at Darkroom, and a big shift we see is using creators as performance inputs, not just influencer placements. We run creator programs where UGC is produced specifically for paid media, TikTok Shop, and social commerce, not just posted once on a channel and forgotten. The same creator video can live as a YouTube integration, a TikTok Spark Ad, a Shop PDP asset, and a retargeting unit. That changes the math entirely.\n\nThis is why our work at Darkroom ends up sitting between influencer, creative, and paid media. We help brands build creator programs that are designed for scale, not one off posts. That includes sourcing and managing creators, producing UGC that is optimized for performance, integrating it into paid media and TikTok Shop flows, and using AI systems to speed up testing without removing human judgment. It does not feel like influencer marketing when it is done right. It feels like a growth engine that compounds over time.\n\nYouTube longform is still powerful for direct response, agreed. But TikTok creators become extremely valuable when they are paired with a strong offer, fast iteration, and paid amplification. That is where AI actually helps. We use it to scale creator sourcing, test hooks, and analyze which creators convert, but humans still decide who to double down on and why.\n\nThe biggest mistake brands make is thinking influencer marketing is about reach. The brands that win treat it like a performance channel with creative systems, repeatable creators, and tight feedback loops. Whether that starts on YouTube, TikTok Shop, or UGC for ads depends on the business model, not the trend.",
          "score": 1,
          "created_utc": "2026-02-05 10:34:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p1cpm",
              "author": "Ambitious_Mail_3392",
              "text": "Actually, our CEO - Lucas DiPietrantonio - once made a post about what most TikTokShops fail, I think it's worth a read, can give some more clarity on the creator/influencer side: [https://www.linkedin.com/posts/lucasdipietrantonio\\_brands-look-at-tiktok-shop-as-just-another-activity-7421593205340688384-LAen?utm\\_source=share&utm\\_medium=member\\_desktop&rcm=ACoAAC13iBsBzrXGhOnFWLK2TePNJmVuu9\\_ic0Q](https://www.linkedin.com/posts/lucasdipietrantonio_brands-look-at-tiktok-shop-as-just-another-activity-7421593205340688384-LAen?utm_source=share&utm_medium=member_desktop&rcm=ACoAAC13iBsBzrXGhOnFWLK2TePNJmVuu9_ic0Q)",
              "score": 1,
              "created_utc": "2026-02-05 10:36:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pmopc",
          "author": "Major_Fill_670",
          "text": "The \"30% success rate\" metric for influencer marketing is honestly brutal for bootstrapped teams. I learned this the hard way burning cash on partnerships where the creator was great, but my offer/angle just didn't land.",
          "score": 1,
          "created_utc": "2026-02-05 13:17:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q8gi3",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 15:15:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j9ynt",
          "author": "RealOrdinary1344",
          "text": "I need help on this let's connect",
          "score": 1,
          "created_utc": "2026-02-04 14:29:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ja40h",
              "author": "borjafat",
              "text": "Sure, Dm or [x.com/borja\\_obeso](http://x.com/borja_obeso) works for me",
              "score": 1,
              "created_utc": "2026-02-04 14:29:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3ksdvv",
                  "author": "Realistic_Extent283",
                  "text": "Followed you if that’s okay. I’ll need the help in future",
                  "score": 1,
                  "created_utc": "2026-02-04 18:43:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1quu4ne",
      "title": "Fundraising founders - how do you research which VCs to actually reach out to?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1quu4ne/fundraising_founders_how_do_you_research_which/",
      "author": "Big_Variation_9149",
      "created_utc": "2026-02-03 14:58:32",
      "score": 35,
      "num_comments": 7,
      "upvote_ratio": 0.93,
      "text": "Prepping for our seed round and I'm stuck on investor research. I know the obvious ones in our space, but I want to go deeper - find investors who: Actually invest at our stage, Have portfolio companies similar to ours, Are actively writing checks right now, Might have warm intro paths\n\nDoing this manually through Crunchbase/LinkedIn is taking days per investor. And I still don't know if I'm reaching out to the right people.\n\nSomeone told me about AI tools like Starnus that can automate this research part. Has anyone used something like that for investor outreach?\n\nOr are you all just grinding through the manual research? What's working for you?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1quu4ne/fundraising_founders_how_do_you_research_which/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3cz2sy",
          "author": "RoughClear3467",
          "text": "Starnus founder here, interesting use case! We built it for sales/outbound automation, but you're right that the same mechanics work for investor research we dound our Angel investors like this.\n\nThe platform finds and enriches leads based on your criteria, personalizes outreach, and tracks responses. If you're treating investors as \"leads,\" the workflow is basically the same: define your ICP (stage, sector, check size) then find matching VCs and then personalized outreach.\n\nWe haven't marketed it for fundraising, but a few users have mentioned doing this. The signal-based research and enrichment part translates pretty well.\n\nHappy to answer questions if you go this route. Good luck with your raise!",
          "score": 11,
          "created_utc": "2026-02-03 15:55:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3d32uk",
          "author": "ruibranco",
          "text": "skip the tools for now and reverse-engineer it. go to your 3-5 closest competitors (or adjacent companies) on crunchbase, look at who led their seed rounds, then check those VCs' portfolios for pattern. if they invested in 2+ companies in your space, they already understand the market - that's your shortlist. second hack: search twitter/X for \"\\[your industry\\] + raised\" and you'll find recent announcements. the investors in those rounds are actively deploying in your space RIGHT NOW. warm intros still beat everything though. find the founders in those portfolio companies on linkedin and ask for a 15-min call. most will help - they remember being in your shoes.",
          "score": 1,
          "created_utc": "2026-02-03 16:14:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3db8k7",
          "author": "Awkward_Ad_9605",
          "text": "That's a tough spot to be in, especially when time is of the essence for fundraising. One tactic I've found useful is to leverage Twitter's startup and VC community. Many investors share their thoughts and interests there, so you can find out who’s actively investing and what sectors they're excited about.\n\nAlso, consider using tools for lead detection that filter VCs based on your specific criteria, like stage and industry focus. I went through a similar struggle and ended up building something to streamline that process.",
          "score": 1,
          "created_utc": "2026-02-03 16:52:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dkjhf",
          "author": "Apprehensive-Try9293",
          "text": "What vertical do you operate in? I can show you what I would do. The more detail on this, the better.",
          "score": 1,
          "created_utc": "2026-02-03 17:35:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f7hmd",
          "author": "ruibranco",
          "text": "Skip the spray-and-pray approach with Crunchbase. The highest signal move is working backwards from recent deals in your space. Find 5-10 companies that raised at your stage in the last 6 months, check who led their rounds, then look at those investors' portfolios for pattern matches. If a VC just invested in something adjacent to you, they already understand the space and are 10x more likely to take the meeting. Also don't sleep on the warm intro game - one mutual connection on LinkedIn is worth more than 50 cold emails. The research part should take you a weekend, not weeks.",
          "score": 1,
          "created_utc": "2026-02-03 22:07:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qnekq",
          "author": "FundingConsultant",
          "text": "First of all, you need to set up the criteria.",
          "score": 1,
          "created_utc": "2026-02-05 16:24:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qsz1be",
      "title": "post your app/startup on these subreddits:",
      "subreddit": "GrowthHacking",
      "url": "https://i.redd.it/9rl0uc202wgg1.jpeg",
      "author": "Ok-Engine-172",
      "created_utc": "2026-02-01 13:53:35",
      "score": 28,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qsz1be/post_your_appstartup_on_these_subreddits/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2z2dfc",
          "author": "macromind",
          "text": "This is a helpful list. The biggest win for me has been treating Reddit like conversations, not placements.\n\nAlso +1 to keeping notes on each community (what is allowed, what gets removed, what tone works). That alone can save a ton of time.\n\nIf anyone is trying to systemize this kind of SaaS marketing outreach without turning it into a messy doc pile, we have been using https://www.promarkia.com/ to keep the plan and the links in one place.",
          "score": 1,
          "created_utc": "2026-02-01 14:22:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bmwfh",
          "author": "zemaj-com",
          "text": "I feel like sometimes all you're going to reach on these subreddits is bots",
          "score": 1,
          "created_utc": "2026-02-03 11:08:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3bmx7u",
              "author": "haikusbot",
              "text": "*I feel like sometimes*\n\n*All you're going to reach on*\n\n*These subreddits is bots*\n\n\\- zemaj-com\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
              "score": 1,
              "created_utc": "2026-02-03 11:08:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3bs9a9",
                  "author": "zemaj-com",
                  "text": "Ha, ha, ha! Exactly!",
                  "score": 1,
                  "created_utc": "2026-02-03 11:53:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3m4tf7",
          "author": "Distinct_Poetry2348",
          "text": "Totally get this!",
          "score": 1,
          "created_utc": "2026-02-04 22:33:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qt1m55",
      "title": "Growth hack that's not sexy but works",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qt1m55/growth_hack_thats_not_sexy_but_works/",
      "author": "Bading_na_green_Flag",
      "created_utc": "2026-02-01 15:36:41",
      "score": 27,
      "num_comments": 11,
      "upvote_ratio": 0.89,
      "text": "\nEveryone wants the viral growth hack that 10x's their traffic overnight. Tried all the sexy tactics first. Product Hunt launch, viral Twitter threads, Reddit posting, influencer outreach. Got some spikes but nothing sustainable. The problem with sexy growth hacks is they produce one-time results. You get a spike, then you're back to grinding for the next spike. I needed something that would compound week over week without constant effort. Switched to the unsexy approach that most growth hackers skip because it's boring. Built SEO foundation through directory submissions and consistent content. Used [backlink agency to handle 200+ directory submissions](http://getmorebacklinks.org) in week one while I focused on finding actual growth levers.\n\nWeek one through three looked like nothing was happening. Directory listings went live slowly and traffic stayed flat around 50 visitors. This is why most growth hackers abandon SEO, no immediate dopamine hit like a viral post provides. Week four is when the compound effect started. Domain authority moved from zero to 16. A few blog posts started appearing on page two for longtail keywords. Traffic hit 180 visitors, small but growing consistently without any new effort from me.\n\nWeek five through eight the growth accelerated. Domain authority reached 22 and traffic climbed to 850 visitors. Published 6 blog posts total but the bigger factor was older content moving up in rankings as authority increased. Each post produced more value over time instead of spiking then dying. The growth rate is what changed my thinking. Viral tactics gave me 500 visitors one day then 20 the next. SEO foundation gave me 120 visitors week one, 180 week two, 340 week three. The trajectory was predictable and sustainable. Now eight weeks in and traffic keeps climbing without me chasing new growth hacks. The foundation work compounds while I focus on product and conversion optimization. The visitors coming through organic search convert better too because they have real intent.\n\nThe growth hacking lesson is that boring systematic work beats clever one-time tactics. Directory submissions and content creation aren't exciting to talk about but they produce predictable compounding growth. Viral moments are lottery tickets, foundation work is compound interest. If you're burned out chasing growth hacks that produce temporary spikes, try building something that compounds. It's slower to start but way less exhausting than constantly hunting for the next viral moment.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qt1m55/growth_hack_thats_not_sexy_but_works/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o2zqm66",
          "author": "MuslimKhan3040",
          "text": "viral stuff feels productive because it’s loud, not because it compounds. learned that the hard way.",
          "score": 1,
          "created_utc": "2026-02-01 16:23:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31ixw0",
          "author": "Existing-Board5817",
          "text": "I love to automate my workflows, I use Starnus for my outbound, but was not able to find something good for inbound, any recomms?",
          "score": 1,
          "created_utc": "2026-02-01 21:22:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32pa90",
          "author": "kubrador",
          "text": "\"boring systematic work beats clever one-time tactics\" is just another way of saying \"do your job\" but congrats on discovering that seo exists i guess",
          "score": 1,
          "created_utc": "2026-02-02 01:06:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35fenl",
          "author": "StarLord-LFC",
          "text": "I've had the exact same realization after burning through budget on viral tactics that felt good in the moment but didn't stick.\n\nThe thing nobody talks about is how exhausting the spike-and-crash cycle becomes. You hit a Product Hunt feature or get lucky with a Reddit post, celebrate the traffic bump, then wake up three days later back at baseline wondering what to do next. It's like running on a treadmill where the speed keeps resetting.\n\nWhat shifted things for me was treating growth like infrastructure instead of events. SEO foundation work, consistent publishing, and actual optimization of what was already working. Boring, yes. But predictable.\n\nOne thing that helped me bridge the gap between content and conversions was using Thrive Leads to capture visitors once the traffic started building. SEO brings people in, but if you're not capturing emails or pushing them toward action, you're leaving a ton on the table. I set up targeted opt-in forms based on which posts people were reading, and that turned organic traffic into an actual asset instead of just a number in analytics.\n\nThe compounding effect you're describing is real, but only if you're also compounding the value of each visitor. Traffic that disappears without converting is just a vanity metric. Pairing SEO with lead capture and nurture made the foundation work actually produce revenue, not just charts that go up.",
          "score": 1,
          "created_utc": "2026-02-02 13:19:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3lmp7a",
          "author": "jf_sourced",
          "text": "Great perspective. A few questions:  \n  \n\\-Did you do paid directories or free?  \n\\-To what extent did you do actual on-page SEO in this process? E.g., internal linking, keywords, etc.  \n\\-What industry? Not sure those directories would really reach my users\n\nJohn",
          "score": 1,
          "created_utc": "2026-02-04 21:05:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zmbsp",
          "author": "One_Perspective971",
          "text": "curious, once authority kicked in, did new content start ranking faster or was it still slow at first?",
          "score": 0,
          "created_utc": "2026-02-01 16:03:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30dmt2",
              "author": "PearlsSwine",
              "text": "They have no idea, they are just spammers.",
              "score": 3,
              "created_utc": "2026-02-01 18:07:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o302d0g",
              "author": "Bading_na_green_Flag",
              "text": "it was noticeably faster. once the domain had some trust, new posts started getting indexed and ranking in days instead of sitting there for weeks.",
              "score": 0,
              "created_utc": "2026-02-01 17:16:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qutaqf",
      "title": "Built 9 different product types in 2 years. Only 2 made real money. Here's what actually works for solo builders in 2026.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qutaqf/built_9_different_product_types_in_2_years_only_2/",
      "author": "Bading_na_green_Flag",
      "created_utc": "2026-02-03 14:25:34",
      "score": 25,
      "num_comments": 4,
      "upvote_ratio": 0.97,
      "text": "Everyone says \"just build something.\" Spent 2 years testing 9 different product types to see what actually generates revenue for solo builders. Directories, templates, newsletters, courses, blogs, boilerplates, services, micro SaaS, and communities. Only 2 consistently made money without burning out. The rest either took too long or had terrible margins. Tested curated directories first after seeing Cyberleads make $500K annually and Theresanaiforthat monetize through listing fees. Built 3 directories in different niches. Revenue after 6 months was $340 total. The problem is everyone can copy your curation in hours. No moat. Listings dried up fast. Moved on.​\n\nTried Notion templates next because Easlo makes over $1M annually selling them. Created 12 template packs. Made $890 in 4 months then sales stopped. Canva and Notion's built-in galleries made discovery impossible. Template marketplaces are saturated. Unless you have massive audience, templates don't work anymore.​ Started newsletter thinking I'd get sponsorships like others making $2K monthly. Grew to 2,400 subscribers over 8 months. Got zero sponsorship offers. Realized you need 10K+ subscribers minimum for brands to care. Quit because effort-to-revenue ratio was terrible.​ Built online course because Max Haining runs successful ones. Spent 6 weeks creating content. Sold 8 copies for $1,120 total. Course creation takes forever and selling requires huge audience or paid ads budget I didn't have. Not viable for bootstrappers starting from zero.​\n\nWhat actually worked was micro SaaS and productized services. Built simple micro SaaS solving specific problem using boilerplate from FounderToolkit in 4 weeks. Hit $4,200 monthly revenue by month 3. Launched productized design service at fixed $2,500 per project. Booked 5 projects in 2 months making $12,500. Both had clear value propositions and customers willing to pay immediately.​ [Studied patterns in FounderToolkit database comparing 1,000+ builders across these product types](http://foundertoolkit.org). Micro SaaS and productized services had highest success rates for solo builders because they solve immediate painful problems, customers pay real money upfront, margins stay high, and moats exist through execution quality. Directories and templates are races to the bottom.​\n\nThe controversial truth is most product types work only if you already have audience. Micro SaaS and services work even starting from zero because you're selling solutions, not attention. Build products that solve problems customers pay for today, not products hoping for traffic someday.​\n\nStop copying product types that work for influencers with 50K followers. Build what works for solo builders with zero audience.\n\nWhat product type are you building? Does it actually work without existing audience?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qutaqf/built_9_different_product_types_in_2_years_only_2/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3cmdar",
          "author": "centurytunamatcha",
          "text": "The influencer copycat trap is real. people copy the output without copying the inputs (audience, credibility, timing).",
          "score": 1,
          "created_utc": "2026-02-03 14:53:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cn3x3",
          "author": "DifferentIssue1",
          "text": "Do you think templates and newsletters are basically dead for newcomers?",
          "score": 1,
          "created_utc": "2026-02-03 14:57:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cpptd",
              "author": "Bading_na_green_Flag",
              "text": "\nNot dead, just audience-dependent. They work great after you have distribution, not before.",
              "score": 1,
              "created_utc": "2026-02-03 15:10:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cofyj",
          "author": "ishaammusic",
          "text": "$4.2k mrr in 3 months vs $340 in 6 months tells the story better than any opinion ever could.",
          "score": 1,
          "created_utc": "2026-02-03 15:04:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr2wq8",
      "title": "Pro tip: Infographics work better than slides",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qr2wq8/pro_tip_infographics_work_better_than_slides/",
      "author": "Minimum_Pear9193",
      "created_utc": "2026-01-30 11:28:05",
      "score": 23,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Sharing long winded insights internally or with clients using ling slide decks; almost always ignored. Forwarded once and quickly forgotten. When the same info is presented as a **single infographic or visual summary** we get so much engagement and \"key stakeholders\" actually remember and reference numbers. \n\nLooks like people engage more when they can see the whole story at once instead of clicking through 20 slides. Especially for things like performance summaries, process explanations and high level takeaways. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qr2wq8/pro_tip_infographics_work_better_than_slides/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o2l6nay",
          "author": "FamousTechnology9618",
          "text": "The key differentiator is information density vs audience attention span. Infographics work when you need poeple to retain a complete narrative without your presence. Slides work better when you're there to guide the story and field questions in real-time",
          "score": 2,
          "created_utc": "2026-01-30 11:58:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3bb3of",
              "author": "Key_Data_4416",
              "text": "This is the point!",
              "score": 1,
              "created_utc": "2026-02-03 09:17:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2l96kz",
          "author": "Own_Battle5956",
          "text": "What about interactive dashboards? Especially for performance summaries and ongoing processes. Tools like Visme, Tableau, or even a good old fashioned Notion page let stakeholders explore the data at their own depth level. \n\nInfographics are great for one time comms or fixed narratives but if you're updating monthly or quart the production overheads add up. Slides can be update efficiently but lack engagement dashboards can be both engaging and maintainable. Just food for thought.",
          "score": 2,
          "created_utc": "2026-01-30 12:16:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3bbaoo",
              "author": "Key_Data_4416",
              "text": "A dashboard is quite good, but the setup process at the beginning will require a great deal of effort and resources.",
              "score": 1,
              "created_utc": "2026-02-03 09:19:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2l6vll",
          "author": "Beneficial_Fee_613",
          "text": "Yeah but most teams don't have the design skills/inclination to create effective infos at scale. Slides are easy access and anyone can make them, even if they're not always the best.",
          "score": 1,
          "created_utc": "2026-01-30 11:59:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lzvwt",
          "author": "pantrywanderer",
          "text": " Totally agree. Our team saw the same thing, when we switched to a one-page visual summary for campaign results, people actually remembered the key metrics and asked smarter questions. Slides are fine for deep dives, but if you want action or recall, a clear infographic wins every time.",
          "score": 1,
          "created_utc": "2026-01-30 14:45:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2q2xva",
          "author": "SpareAd8812",
          "text": "How you guys are creating carousel slides/infographics?",
          "score": 1,
          "created_utc": "2026-01-31 02:46:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o351a5n",
          "author": "Federal-Process-6504",
          "text": "I agree. Seeing a multitude of slides almost always turns me off as a client.",
          "score": 1,
          "created_utc": "2026-02-02 11:39:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nan9n",
          "author": "nikhilnarkhede",
          "text": "Yes indeed Infographics is super useful. Stunning visuals showing all the data in a single image making it attractive for the reader.\n\nWell sharing to clients is one thing and using it for organic marketing is like getting awesome results\n\nWhich tools do you use to make infographics?",
          "score": 1,
          "created_utc": "2026-02-05 02:25:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrep5f",
      "title": "Built a tool that turns plain English into email campaigns",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qrep5f/built_a_tool_that_turns_plain_english_into_email/",
      "author": "Natural_System_6973",
      "created_utc": "2026-01-30 19:04:43",
      "score": 21,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "\"Send to users who registered in the last 7 days but profile\\_complete = false, personalize with their name and days\\_since\\_signup\"\n\n\n\nI haven't find any email tool that has this flexibility to turn english to full campaign setup, either can't read your database or handle complex conditions.\n\nA tool that connects directly to your database and lets you describe campaigns in plain English. It handles the querying, personalization, and sending.\n\n\n\nLooking for: Technical founders who face this same problem. Would love to get your feedback and in return you'll get free credits to test it out.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qrep5f/built_a_tool_that_turns_plain_english_into_email/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o2nlw98",
          "author": "Natural_System_6973",
          "text": "Link: [https://elu.dev/](https://elu.dev/)",
          "score": 1,
          "created_utc": "2026-01-30 19:05:29",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o2p7zu0",
          "author": "TheRealJpn",
          "text": "Beautiful. Love it",
          "score": 1,
          "created_utc": "2026-01-30 23:49:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2pc2e4",
              "author": "Natural_System_6973",
              "text": "Give it a try, let me know: [https://elu.dev/](https://elu.dev/)\n\nIt took me exactly 14 seconds to build a complex, data driven \"Power User\" flow.\n\nhttps://preview.redd.it/h26ovs8fukgg1.png?width=2674&format=png&auto=webp&s=360427e4665f4fd9993de7fcac44d3ce3063d4a9",
              "score": 1,
              "created_utc": "2026-01-31 00:11:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qwfabj",
      "title": "how we got 700 organic visitors in our first quarter",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qwfabj/how_we_got_700_organic_visitors_in_our_first/",
      "author": "Easy-Extension-6917",
      "created_utc": "2026-02-05 07:53:47",
      "score": 21,
      "num_comments": 10,
      "upvote_ratio": 0.83,
      "text": "Launched our startup in Amsterdam three months ago with typical EU bootstrap constraints. Small budget, no funding yet, competing against established players with years of SEO investment. Had maybe €500 total for marketing in Q1. Couldn't afford paid ads at European CPCs. Couldn't hire an agency at €2K+ monthly retainers. Needed a growth channel that would work on a tiny budget and compound over time instead of requiring constant spend. Put €100 into SEO foundation as the only realistic option. Used [directory submission tool to establish domain authority through directory submissions](http://getmorebacklinks.org) across EU and country-specific business directories. This was the cheapest way to build baseline trust without months of manual outreach. Then created 12 blog posts targeting problem-based searches in English and our local market language. Not promotional content but actual answers to questions our target customers were searching for. Things like \"how to solve X in Netherlands\" or \"best way to handle Y for EU businesses.\"\n\nMonth one looked discouraging. Directory listings went live slowly and no traffic appeared. This is the scary part of bootstrapping because you're watching your entire budget produce zero visible results while competitors are running ads. Month two is when things shifted. Domain authority moved from zero to 19. A few blog posts started appearing on page two for longtail keywords. Got our first 8 customers from organic search without spending another euro on acquisition.\n\nMonth three hit 700 organic visitors and 22 total customers from search. The €100 investment created a channel that keeps producing without ongoing spend. Compare that to paid ads where €100 might get 30 clicks that disappear immediately. The unit economics work completely differently. Customer acquisition cost from organic is basically zero after initial setup. Lifetime value is higher too because they found us through research instead of being interrupted by ads they didn't trust. Now four months in and organic is the primary growth channel. Still bootstrapped and lean but the SEO foundation means new content gets discovered without paid promotion. The budget constraint forced us into a channel with better long-term economics.\n\nThe EU startup lesson is you can't out-spend competitors but you can out-patience them. Work on channels that compound even if they're slower to start. When bootstrapping in Europe, optimize for leverage over immediate gratification.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qwfabj/how_we_got_700_organic_visitors_in_our_first/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3olyvp",
          "author": "ProfessionalLast4311",
          "text": "Nice call targeting both English and local language searches.",
          "score": 1,
          "created_utc": "2026-02-05 08:09:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3omi6e",
          "author": "Unlucky_Abroad7440",
          "text": "now that organic is working, are you planning to go deeper in NL first or expand into other EU markets next?",
          "score": 1,
          "created_utc": "2026-02-05 08:14:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pttjf",
              "author": "Easy-Extension-6917",
              "text": "we’re going deeper in NL first. once we really understand what converts locally and have those pages dialed in, expanding to other EU markets will be much smoother.",
              "score": 1,
              "created_utc": "2026-02-05 13:58:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3onabq",
          "author": "SizeOk5266",
          "text": "700 visitors in the first quarter feels very realistic, not inflated. refreshing to see that.",
          "score": 1,
          "created_utc": "2026-02-05 08:21:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ozo08",
          "author": "BrightMindFlow",
          "text": "Was the translation to local language worth the effort? Can you share the % of local language leads you got from that versus english?",
          "score": 1,
          "created_utc": "2026-02-05 10:21:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p2rl9",
          "author": "PearlsSwine",
          "text": "It's sweet you think getting 700 people in three months is good.",
          "score": 1,
          "created_utc": "2026-02-05 10:49:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pi3i2",
          "author": "eventregistration",
          "text": "Its not looking safe at all. I think manual seo optimization and marketing will help a lot. Hire SEO professionals and get quality organic results.",
          "score": 1,
          "created_utc": "2026-02-05 12:48:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q51pz",
          "author": "Background-Pay5729",
          "text": "The problem with directory tools is usually the quality of the backlink profile long-term. You might see a quick jump in DR, but Google eventually catches on to those low-effort links if they aren't maintained or relevant.\n\nFocusing on those specific local problem-based keywords was definitely the smarter move of the two. In the EU everyone tends to over-optimize for English keywords and ignores the massive gap in local language search volume.",
          "score": 1,
          "created_utc": "2026-02-05 14:57:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q7l9h",
          "author": "sandropuppo",
          "text": "Smart move targeting problem-based searches in both English and Dutch - that dual-language approach probably helped you capture less competitive local keywords.   \n  \nCurious what your bounce rate looked like on those bilingual posts?",
          "score": 1,
          "created_utc": "2026-02-05 15:10:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qh891",
          "author": "inboundmage",
          "text": "How is this link insert for a service is legit here? Just wondering. ",
          "score": 1,
          "created_utc": "2026-02-05 15:56:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrshyq",
      "title": "I almost killed my SaaS by listening to one power user",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qrshyq/i_almost_killed_my_saas_by_listening_to_one_power/",
      "author": "Listner_Fun_81p",
      "created_utc": "2026-01-31 04:27:38",
      "score": 19,
      "num_comments": 2,
      "upvote_ratio": 0.94,
      "text": "Six months ago, my SaaS finally hit $2,500 MRR and I thought I had finally made it. Then I met a power user from a big agency who paid for the yearly enterprise tier upfront.\n\nHe started emailing me every single morning with these \"essential\" feature requests that sounded smart at the time.\n\nI felt so much pressure to keep him happy since he was my biggest check, so I stayed up until 4 AM coding his specific demands.\n\nI spent three weeks building this insane sub-task dependency system that only his specific workflow required.\n\nDuring that time, I completely ignored the minor bugs that were actually bothering my other 140 users.\n\nMy churn rate hit 18% in a single month. The UI became a bloated mess that nobody else could figure out and the feedback was getting brutal.\n\nI felt like a total failure watching my Stripe dashboard bleed out while I was basically acting as a free consultant for one guy.\n\nIt was a complete nightmare and I was barely sleeping. Seriously, I was so focused on one person that I forgot why I built the app in the first place.\n\nThe absolute kicker is that the power user canceled last week because the tool felt \"too cluttered\" for his team.\n\nI’ve spent the last ten days ripping out half the features I built just to save what's left. Please don't let one loud voice steer your roadmap or you'll end up as miserable as I was.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qrshyq/i_almost_killed_my_saas_by_listening_to_one_power/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o2rd4uu",
          "author": "evo_team",
          "text": "Feature requests are tricky especially in the early stages/ at launch because people ask for what they think they want, not what they actually need. Behavior tells you more than words ever will. What features are your remaining users actually using daily? Where do they get stuck? That data is more valuable than any email request. Your goal is to keep it simple and to bring in as many clients as possible. \n\nOne thing that works well for figuring out what actually matters to users is testing features through content. Make short videos showing different features or use cases, put them out on TikTok or Reels, and see what gets traction. The ones that go viral or get the most engagement are the ones people actually care about. It's like market research but faster and free. If a video about your sub-task dependency system gets crickets but a video about a simple workflow hack blows up, that tells you exactly where to focus.\n\nThe other thing worth considering is how you stay connected to your broader audience going forward. When you go heads down building for one client, you lose touch with the market. Founders who avoid this trap are constantly putting content out, talking to users publicly, seeing what resonates with hundreds of people instead of just whoever emails them that morning.\n\nYour roadmap should be informed by patterns across many users. Even if the loudest one pays more.\n\nWhat does your current user base look like now that you've stripped things back?",
          "score": 3,
          "created_utc": "2026-01-31 08:40:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2zzeap",
              "author": "Listner_Fun_81p",
              "text": "we have 30 subscribers",
              "score": 1,
              "created_utc": "2026-02-01 17:03:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qstl9x",
      "title": "How a B2B company makes millions with their tiny Youtube channel",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qstl9x/how_a_b2b_company_makes_millions_with_their_tiny/",
      "author": "illeatmyletter",
      "created_utc": "2026-02-01 09:05:47",
      "score": 15,
      "num_comments": 4,
      "upvote_ratio": 0.89,
      "text": "I came across this breakdown and it completely flipped how I thought about YouTube. Figured it might be valuable for you as well.\n\nMost founders assume YouTube only works if you go big. Massive subscriber counts, viral videos, influencer-level reach. But this case study proves that's wrong, well at least for B2B.\n\nThere's a small company in immigration + tax optimization. Nothing sexy. Their average client pays around $2,000 though. Their YouTube channel has maybe 1,000 to 1,500 subscribers. And from that channel alone, they've booked 500+ sales calls. That's easily seven figures in revenue from what most people would call a \"dead\" channel.\n\nBut it gets crazier… They get only around 350 to 400 views per day. About 30 videos total. But they close roughly half their calls. They even spun up a second channel in another language with under 30 subscribers, and it already brought in multiple paying clients.\n\nThis is why B2B YouTube is a completely different game.\n\nSubscriber count is a vanity metric. What actually matters:\n\n* Who's watching: are they decision-makers or random browsers?\n* Why they're watching: are they actively looking for a solution?\n* How much one customer is worth: if a client pays $2k, $10k, or more, you don't need scale\n\nThe videos that drive revenue on this channel aren't flashy. They're boring, high-intent, search-driven stuff: \"how to get residency in X,\" \"best tax residency for digital nomads,\" country comparisons etc. These aren't entertainment videos. They're decision-stage videos, which means the viewer is already problem-aware and actively searching for a solution. That's why they convert.\n\nIf you're selling something where one customer is worth a few thousand dollars or more, obsessing over subscriber count makes no sense. A small channel with the right topics can outperform a larger audience watching for entertainment. The leverage comes from intent, not scale.\n\nI’d love to hear form other founders to see if you’ve had similar results? Have any of you tried YouTube as an acquisition channel? What results did you see?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qstl9x/how_a_b2b_company_makes_millions_with_their_tiny/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o32gjgs",
          "author": "GeneralNetwork1318",
          "text": "This is almost exactly what happened with us. We started posting decision-stage videos around topics our ICP was already searching for and the calls just started coming in. Took us a while to figure out what topics to focus on though. \n\nThe team we worked with (Represent Studio) helped us dial that in, and created a strategy for us that made all the difference. Since then we started closing clients consistently through YT.",
          "score": 2,
          "created_utc": "2026-02-02 00:17:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zsilo",
          "author": "CurlyAce84",
          "text": "Worked well for my service business. Probably 90% of our revenue was generated from YT.\n\nNo better way to form relationships than long form content that shows your face. People felt like they knew you long before the sales cycle even started",
          "score": 1,
          "created_utc": "2026-02-01 16:31:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31j6bw",
          "author": "Existing-Board5817",
          "text": "Nice, I'm in B2B and I get 80% of my MRR from outbound pipelines I set and automate, I use a tool called Starnus, and I do all demos myself. This was really cool and I might start looking more seriously into inbound.",
          "score": 1,
          "created_utc": "2026-02-01 21:23:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33zpst",
          "author": "AskPractical9611",
          "text": "This perfectly matches my experience too B2B YouTube isn’t about scale at all, it’s about capturing decision stage intent where even a few hundred hyper relevant views can outperform thousands of passive subscribers.",
          "score": 1,
          "created_utc": "2026-02-02 05:56:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qunitf",
      "title": "Any mobile proxy providers that aren't completely burned for IG/TikTok?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qunitf/any_mobile_proxy_providers_that_arent_completely/",
      "author": "Soft_Temptressss",
      "created_utc": "2026-02-03 09:29:28",
      "score": 14,
      "num_comments": 6,
      "upvote_ratio": 0.95,
      "text": "I feel like I'm running out of options. I've tested Bright Data and IPRoyal recently, and while the pages load fine, my accounts are getting shadowed or hit with verification loops almost immediately after a few actions.  \n  \nIt feels like these premium subnets are already flagged/blacklisted by the platforms. Has anyone found a reliable alternative lately that actually holds up for account management?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qunitf/any_mobile_proxy_providers_that_arent_completely/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3bo5a0",
          "author": "Sin_In_Silks",
          "text": "Switched to VoidMob, they’re running access through a waitlist.   \nThe traffic behaves like normal carrier sessions, not data center traffic. Challenge rates dropped and accounts stopped getting shadowed as quickly",
          "score": 5,
          "created_utc": "2026-02-03 11:19:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3be9to",
          "author": "MuchResult1381",
          "text": "What worked for me in the last 2 years are mobile proxies from Anonymous Proxies combined with AdsPower (antidetect browser). They offer clean IPs and not shared ones like mostly all providers, so you won't get those annoying blocks anymore.",
          "score": 1,
          "created_utc": "2026-02-03 09:48:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3brqlk",
          "author": "HospitalPlastic3358",
          "text": "Proxidize, Coronium, Voidmob. Use dedicated mobile proxies if you want best stability setup + vps. Ofc they are costly but worth all penny. All these providers have them.",
          "score": 1,
          "created_utc": "2026-02-03 11:49:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hszw5",
          "author": "SpecialOil1472",
          "text": "Novada and Voidmob are the top picks for dedicated mobile proxies. Both feature fresh, clean IP pools with rarely overused subnets, effectively avoiding shadowbans, IP blocks and constant verification checks on IG and TikTok. Novada stands out with its massive global IP coverage across 220+ countries, 99.9% uptime and 24/7 technical support, making it ultra-stable for long-term multi-account management and large-scale operations. Voidmob excels in smooth connection speeds and flexible IP rotation modes, ideal for daily account maintenance and content operations. They’re a bit pricey, but the rock-solid reliability is totally worth it—way better than those overhyped big providers with easily flagged IPs.",
          "score": 1,
          "created_utc": "2026-02-04 07:48:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3je3km",
          "author": "Prestigious_Role_397",
          "text": "Have you tried Gridpanel? A friend of mine used it to scale his mobile app to $40k/month and i wanted to start using it for my own app. They seems to offer unique IP (same for proxy-seller), so even them can be shadow banned by tiktok? ",
          "score": 1,
          "created_utc": "2026-02-04 14:50:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jorhd",
          "author": "Subject-Presence-702",
          "text": "Mobile IPv4 is good, if you looking for provider - floppydata is nice. If you're using anti detect, gologin's also fine :)",
          "score": 1,
          "created_utc": "2026-02-04 15:42:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtxev6",
      "title": "How do you measure productive capacity on a growth team?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qtxev6/how_do_you_measure_productive_capacity_on_a/",
      "author": "EnvironmentalRing135",
      "created_utc": "2026-02-02 15:03:25",
      "score": 14,
      "num_comments": 7,
      "upvote_ratio": 0.89,
      "text": "I keep hearing about teams being at capacity but the definition feels kinda vague. On growth teams specifically, what does productive capacity actually mean in practice?\n\nIs it max no. of experiments shipped per week? Revenue or pipeline generated per growth pod? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qtxev6/how_do_you_measure_productive_capacity_on_a/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o362sv3",
          "author": "Infamous_Echidna_133",
          "text": "Measure productive capacity by tracking output per person per sprint or week against blockers - we use a simple sheet with tasks completed vs estimated and flag anything over 50% blocked time. Last quarter we hit 70% capacity average but realized meetings ate 20% so we cut them. Keep it lightweight or it becomes another task",
          "score": 2,
          "created_utc": "2026-02-02 15:24:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o392wgr",
          "author": "Drumroll-PH",
          "text": "Productive capacity on a growth team is how many quality experiments you can run end to end without slowing learning. The best indicators are experiment cycle time, decision rate, and where bottlenecks form usually engineering or analytics. Revenue and pipeline are lagging signals, not capacity measures. You’re at capacity when adding more tests reduces learning quality or increases rework.",
          "score": 2,
          "created_utc": "2026-02-03 00:00:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o362mho",
          "author": "PearlsSwine",
          "text": "It's simple. It means working eight hours a day, there is no room for anything new.",
          "score": 1,
          "created_utc": "2026-02-02 15:23:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36ejxp",
          "author": "DazzlingGreen4368",
          "text": "Do you think of capacity as an activity ceiling? Well done you're WRONG! It's a throughput constraint! Shipping more experiments or running more channels doesn't mean you have spare capacity. Especially if decision making, engineering time, or signal quality becomes the bottleneck. \n\nThink of execution capacity (no. of experiments), decision capacity (no. or results) and revenue impact (no. of efforts that move pipe or retention). You can use tools but only if they connect work to outcomes. Generic PM tools track motion rather than productivity. You need planning and decision interlligence tools like Lative alongside BI or RevOps stacks to model scenarios. \n\nFor example \"If we add 3 more experiments per week what can break?\"",
          "score": 1,
          "created_utc": "2026-02-02 16:19:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36iblo",
          "author": "ruibranco",
          "text": "Experiments shipped per week is the wrong metric on its own because it incentivizes running garbage tests. We track \"experiments with a clear hypothesis and measurable outcome\" per person per sprint, plus the win rate. If your team ships 10 experiments a week but only 1 in 10 moves a metric, you have a prioritization problem not a capacity problem. The best signal I've found is the ratio of experiment ideas in your backlog vs experiments actually completed with learnings documented - that gap tells you where the real bottleneck is.",
          "score": 1,
          "created_utc": "2026-02-02 16:37:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38gvac",
          "author": "ruibranco",
          "text": "The metric that actually matters is experiment velocity with a learning rate attached. Shipping 10 experiments/week means nothing if 8 of them are \"change button color\" tests that teach you nothing. We started tracking \"experiments that changed our understanding of the user\" per week and it completely shifted how the team prioritized. Capacity isn't about hours or throughput - it's about how fast you're reducing uncertainty about what works. If your team is \"at capacity\" but hasn't invalidated a single assumption this month, they're busy, not productive.",
          "score": 1,
          "created_utc": "2026-02-02 22:04:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvz0e6",
      "title": "300 videos in 10 months and all of them failed at 300 views. Here's the execution flaw I couldn't see.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qvz0e6/300_videos_in_10_months_and_all_of_them_failed_at/",
      "author": "Leading_Leading_2114",
      "created_utc": "2026-02-04 19:55:37",
      "score": 13,
      "num_comments": 2,
      "upvote_ratio": 0.88,
      "text": "Ten months of daily posting. 300 videos. Every single one stuck between 200 and 400 views. Not one breakthrough. Not one that performed differently. Just the same dead result 300 times in a row.\n\nI'm completely burned out. Ten months of consistent effort and I'm still in the exact same place I started. Started thinking maybe I'm just fundamentally not cut out for content creation.\n\nWhat's destroying me is not understanding what's wrong. I watch my videos and they look fine. I watch successful creators and mine doesn't look drastically worse. But they're hitting 50k and I'm dying at 300 and I cannot see the difference.\n\nStarted thinking maybe the algorithm hates my account. Maybe I'm shadowbanned. Maybe I need to delete everything and start fresh because this account is clearly broken.\n\nTried changing everything over ten months. Different topics. Different formats. Different niches. Different editing styles. Nothing broke the pattern. Still 300 views regardless of what I changed.\n\nTen months of daily content with zero breakthrough and I couldn't identify what was actually killing me. Finally figured it out two weeks ago and everything changed. Now averaging 21k views. Here's what I learned.\n\n**300 failures means one pattern repeated 300 times not 300 different mistakes.** You have an execution issue you keep repeating because you can't see it. Mine was pausing for 2 seconds at second 9 in every video. That's one problem done 300 times. Find your one repeating pattern.\n\n**The algorithm isn't suppressing you your execution pattern is creating suppression-level results.** The algorithm would push your content if people watched it. People don't watch because something specific you're doing makes them leave. Fix that thing and distribution comes back immediately. You're not shadowbanned. Your execution is broken.\n\n**What you're repeating feels invisible because it's your natural creation rhythm.** Those 2 second pauses were just how I naturally spoke. My cadence. I couldn't see them as problems because they felt like me. To viewers they felt like the video stopping or dead air. That's your blind spot. What feels natural to you reads as broken to viewers.\n\n**Changing topics or styles doesn't fix execution timing issues.** I spent ten months changing content strategy when I needed to fix content execution. My topics were fine. My pause timing was broken. Changing topics 50 times didn't fix pause length. I was solving the wrong layer of the problem.\n\n**This is what finally broke me out after ten months and 300 failures.** I found [this app](https://taap.it/3WSYvTJ) and it showed me what I couldn't see for ten months. It analyzes your videos and tells you what's broken at exact timestamps with specific fixes. Second 9 pause 2.0 seconds visual static people left cut to under 1 second add movement. That diagnostic precision is what changed everything after ten months of guessing. Regular analytics showed retention dropping. It showed me the 2 second pause was why and exactly how to fix it. That's when I went from 300 views to 21k overnight.\n\n**One micro-execution fix can undo ten months of plateau.** Cut my pauses to under 1 second. Everything else stayed identical. Same topics. Same style. Just fixed the pause timing. Breakthrough happened immediately. Those 300 failures weren't wasted. They taught me everything except the one broken thing. Fixed that and everything clicked.\n\nLast 9 videos all over 19k. Same person who failed 300 times over ten months. Just stopped repeating the execution flaw I was blind to.\n\nIf you've been stuck for months with hundreds of failed videos you have one execution blind spot. Find it and everything shatters.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qvz0e6/300_videos_in_10_months_and_all_of_them_failed_at/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3qhev5",
          "author": "inboundmage",
          "text": "Thanks GPT for the very long post with link",
          "score": 1,
          "created_utc": "2026-02-05 15:57:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qttpr2",
      "title": "These outbound sales mistakes are killing your reply rate",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qttpr2/these_outbound_sales_mistakes_are_killing_your/",
      "author": "illeatmyletter",
      "created_utc": "2026-02-02 12:28:14",
      "score": 12,
      "num_comments": 5,
      "upvote_ratio": 0.94,
      "text": "I recently read a solid breakdown of the most common outbound mistakes and realized how many of us are probably tripping over the same issues without knowing it. Thought I’d share a quick, practical list so you can audit your outreach and start getting better results.\n\nSharing a condensed version here so it’s easy to audit your own outreach:\n\n* Targeting the wrong accounts On paper they fit the ICP. In reality, they had no real reason to care.\n* Not segmenting within the ICP A 20-person SaaS and a 200-person company shouldn’t get the same message, even if they buy the same product.\n* Ignoring buyer personas Sending identical outreach to a CEO, a technical decision-maker, and an end user almost always backfires.\n* Generic messaging No context, no relevance. Recent events, tech stack, or actual KPIs make a huge difference.\n* Relying on one channel Cold email alone rarely carries the whole load. LinkedIn and light calls help more than people expect.\n* Volume over fit More messages didn’t help. Better-targeted ones did.\n* Letting the ICP go stale Markets shift. Teams change. If your ICP hasn’t been revisited in a year, it’s probably wrong.\n* Pitching too early Pushing a solution before the buyer recognises the problem kills otherwise good outreach.\n\nOutbound still works, but only when execution is smart and relevant. Let me know which of these you’ve seen most in your own outreach or what fixes helped you the most!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qttpr2/these_outbound_sales_mistakes_are_killing_your/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3b7w4n",
          "author": "GeneralNetwork1318",
          "text": "Solid breakdown. A lot of teams assume outbound is dead when it’s really these small execution gaps compounding over time. I remember reading a blog by ColdIQ that went deeper on this exact issue. When relevance drops even slightly, everything downstream suffers.",
          "score": 2,
          "created_utc": "2026-02-03 08:46:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o359ple",
          "author": "Fantastic_Monk5955",
          "text": "The biggest problem is the false ICP (Individual Potential Client) coupled with generic messaging. We think we're hitting the nail on the head, but we're talking to people who don't have the problem or the urgency, then we compensate with volume… and it doesn't work.\n\n\n\nSecond key mistake: selling too early. Offering a solution before the prospect has clearly identified their problem kills even good prospecting\n\n\n\nLess volume, more context, and real qualification make all the difference haha",
          "score": 1,
          "created_utc": "2026-02-02 12:42:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38rmvd",
          "author": "Existing-Board5817",
          "text": "I'm an automation lover, I use AI for coding, AI for sales, AI for everything :D\n\nI use Starnus for my outbound, here are results from 5 hours ago:  \n1. 50 high intent leads researched and found  \n2. Sent connection requests to all  \n3. 20 accepted  \n4. Messaged all 20  \n5. 10 replied  \n6. 5 meetings booked\n\nI spent 10 min just reviewing the initial list of 50, everything else was done by AI and fully on autopilot",
          "score": 1,
          "created_utc": "2026-02-02 22:58:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cd9lm",
          "author": "smarkman19",
          "text": "Biggest miss I see that sits under all of this: no clear “moment in time” for why you’re reaching out now. If there’s no trigger, it just feels like random spam, even if the ICP is right. Fundraise, hiring sprees, tech migrations, bad reviews, new leadership, churn spikes – pick one or two per segment and make every line in the message hang off that.\n\nSecond, people treat follow-ups like nagging instead of new angles. I’ve had better luck writing a 3–5 step narrative: email 1 = problem, 2 = quick teardown, 3 = tiny win or loom, 4 = objection handling, 5 = clear “I’ll close this out.” Same lead, different lens.\n\nOn tools, I’ve used Clay and Apollo for data and sequencing, and Pulse for Reddit to mine real complaints and language from threads so the emails sound like something the buyer would actually say.\n\nIt’s all about triggers, not templates.",
          "score": 1,
          "created_utc": "2026-02-03 14:05:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qure5o",
      "title": "What’s your go-to way to learn why users drop off, not just where?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qure5o/whats_your_goto_way_to_learn_why_users_drop_off/",
      "author": "AffectionateServe387",
      "created_utc": "2026-02-03 13:04:54",
      "score": 12,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Most of us running experiments can quickly spot the leak in a funnel. The dashboard shows the drop, session recordings hint at friction, but the real reason behind it often turns into guesswork.\n\nI’ve been thinking about this after a few tests where the numbers told me something was wrong, but not what needed fixing. Sending surveys later didn’t help much either since response rates were low and the context was gone.\n\nWhile digging into alternatives, I came across Mopinion and it made me reconsider real-time feedback. Asking a short question right when a user is about to leave or stalls on a key page sounds simple, but it could explain hesitation in a way metrics alone can’t.\n\nThat said, I’m always cautious about adding anything that might hurt conversions.\n\nFor those deep into CRO and experimentation, how are you uncovering the motivation behind user behavior? Are you relying purely on behavioral data, or mixing it with in-the-moment feedback?\n\nInterested to hear what’s actually moving the needle for you.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qure5o/whats_your_goto_way_to_learn_why_users_drop_off/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3ccoeh",
          "author": "Crescitaly",
          "text": "Great question - the \"why\" behind drop-offs is where the real insights are.\n\n\n\nHere's what's worked for me across different contexts:\n\n\n\n\\*\\*1. Session replays + exit intent surveys (combo)\\*\\*\n\n\n\nI use session recordings to spot \\*where\\* the hesitation happens (cursor hovering, scroll rage, back-and-forth behavior), then trigger a micro-survey only at those specific friction points. Generic exit surveys get ignored; contextual ones don't.\n\n\n\nKey: Keep it to ONE question. \"What's stopping you from \\[specific action\\]?\" with 3-4 preset answers + \"Other.\"\n\n\n\n\\*\\*2. The \"almost converter\" segment\\*\\*\n\n\n\nPeople who got 80%+ through your funnel but didn't convert are gold. They wanted it enough to invest time. I'll sometimes reach out directly via email: \"Hey, noticed you got close to \\[action\\] - curious what held you back?\" Surprisingly high response rate, and the answers are brutally honest.\n\n\n\n\\*\\*3. Support ticket mining\\*\\*\n\n\n\nYour support team is sitting on a goldmine of \"why\" data. I built a simple tagging system for support tickets by funnel stage. After 30 days, patterns emerge: \"People at checkout consistently ask about X\" = obvious fix.\n\n\n\n\\*\\*4. Fake door testing for feature validation\\*\\*\n\n\n\nIf I'm not sure \\*why\\* a feature isn't getting adoption, I'll create a \"coming soon\" version of a hypothetical improvement and see who clicks. High click rate = the current version is the problem. Low click rate = people don't care about that feature at all.\n\n\n\n\\*\\*On the Mopinion approach:\\*\\*\n\n\n\nIn-the-moment feedback is powerful but I've found the \\*timing\\* of the prompt matters more than the tool. Triggering on time-on-page or scroll depth alone misses context. Triggering on behavioral signals (rage clicks, form abandonment, etc.) gets much better signal.\n\n\n\nWhat type of funnel are you optimizing? B2B SaaS vs. e-commerce vs. content have pretty different \"why\" investigation playbooks.",
          "score": 1,
          "created_utc": "2026-02-03 14:02:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cnqwc",
          "author": "monsterresearch",
          "text": "You are asking all the right questions! Most of my clients (15yr in user experience) always have loads of quantitative data and can only tell me \"what\" is happening - never the \"why\". IE: \"Bounce rate on /checkout is 65%.\" when you really need to hear: \"I can't find the shipping costs. I'm frustrated.\" Otherwise, how will you know where to plug the whole in your bucket!\n\nYou need what sounds like Mopinion can offer without \"bugging\" your customers. I built a tool where you can run synthetic users through any URL whenever you want. Your home page, your checkout page, competitor's site; see any URL through customers' eyes and have your \"why\" without ever having to hurt your conversions - or build anything new into your flow! DM if you'd like to try the free demo. I really hope it's helpful cuz you're clearly knowledgeable, just need the tool to get there!",
          "score": 1,
          "created_utc": "2026-02-03 15:00:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qw3ln6",
      "title": "The Free Tool Growth Hack",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qw3ln6/the_free_tool_growth_hack/",
      "author": "ChodeMcGee",
      "created_utc": "2026-02-04 22:44:45",
      "score": 12,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "I've been in growth for 8 years, and I just realized something that should be obvious but isn't: we've been solving the wrong problem.\n\nEveryone talks about driving more traffic. More ads, more content, more channels. But the real bottleneck isn't traffic, it's intent. You can drive 10,000 visitors to a landing page and get a 1% conversion rate. Or you can build something that makes people want to give you their email.\n\nHere's what changed my perspective: free tools convert 5-10x better than landing pages.\n\nI'm not talking about lead magnets (PDFs, guides, etc.). I'm talking about actual tools that solve a real problem and deliver value before asking for anything.\n\n# The Problem with Static Landing Pages\n\nLet's be honest. A landing page is a promise. \"Use our product and you'll get X result.\" But people don't trust promises anymore. They trust proof.\n\nWhen you land on a page that says \"We'll help you optimize your landing pages,\" you scroll. You're skeptical. You've heard it before.\n\nBut when you land on a page that says \"Enter your landing page URL and we'll audit it in 30 seconds,\" something shifts. You're not reading a pitch, you're experiencing the value.\n\nThat's the gap. And it's massive.\n\n# The Free Tool Framework\n\nThe pattern I've seen work repeatedly follows this sequence:\n\nValue → Proof → Data → Relationship\n\nYou start by delivering something useful immediately. No signup required. The user gets a report, a score breakdown, an action plan based on their data. Something tangible.\n\nThen, you gate the detailed results behind an email. Now you have a lead who has already experienced the value of what you do. They're not a cold email—they're a warm, intent-rich prospect.\n\nFinally, you have enriched data about them (what they searched for, what their results were, what problems they have). This becomes your sales conversation starter.\n\n# Two Case Studies That Prove This Works (which I built for clients)\n\nCase Study 1: ai-pact.com (Compliance Audit Tool)\n\nI built a tool for a compliance consulting firm that audits websites for regulatory risks. Users enter their business email, the tool scans their site, and delivers a report in 30 seconds.\n\nResults:\n\n•1,000+ leads generated in 3 months\n\n•20%+ conversion rate (vs. 1-3% on their landing page)\n\n•30+ daily organic views (the tool became a SEO asset)\n\nThe tool was so useful that people started sharing it. Organic growth kicked in. The firm didn't need to pay for traffic because the tool became the traffic driver.\n\nCase Study 2: GrowthTrack.ai (Performance Audit)\n\nAn agency built a tool that analyzes landing page speed, revenue and conversion potential. It's a simple input (URL) → output (performance score + recommendations).\n\nResults:\n\n•1,500+ leads in 6 months\n\n•25% conversion rate\n\n•$0 spent on marketing\n\nThe tool was so useful that it became their #1 lead source. They didn't build it to make money—they built it to prove their expertise and capture high-intent leads.\n\n# Why This Works (And Why Most Companies Don't Do It)\n\nThe reason this isn't more common is psychological. It feels risky to give away value for free. But here's the thing: you're not giving away your product. You're giving away a sample of your expertise.\n\nWhen someone uses your free tool and gets real value, they understand what you're capable of. They've experienced your thinking. They trust you more than any sales pitch could ever create.\n\nThe second reason is execution. Most companies think \"free tool\" and immediately think \"lead magnet.\" They build a calculator or a template. But those don't work because they don't deliver real value—they deliver information.\n\nA real tool delivers an outcome. It solves a problem. It gives you something you didn't have before.\n\n# The Mechanics\n\nHere's what makes a free tool work:\n\n1. It solves a real, specific problem. Not \"improve your marketing\" but \"find out if you're underfunding maintenance\" or \"see how your landing page compares to competitors.\"\n\n2. It delivers value immediately. No signup required to see results. The user gets something useful before you ask for anything.\n\n3. It captures enriched data. You're not just getting an email—you're getting behavioral data about what they care about, what their problems are, what their metrics look like and you can send that all into your CRM.\n\n4. It's built to be shared. If the tool is genuinely useful, people will share it. This becomes your organic growth engine.\n\n5. It creates a natural sales conversation. Once someone has used your tool and seen their results, they want to know \"what do I do about this?\" That's your sales opening.\n\n# The Growth Flywheel\n\nOnce you have a tool, you can distribute it through multiple channels:\n\n•Launch: Product Hunt, Hacker News, relevant communities\n\n•Owned: Your email list, your website, your blog\n\n•Earned: People share it because it's useful (organic growth)\n\n•Paid: Retargeting people who bounced on your site, stale leads, or paid ads to drive initial traffic\n\nThe beautiful part is that each channel feeds the others. Organic growth reduces your paid costs. Paid traffic increases organic reach. Your email list becomes a distribution channel.\n\n# The Math (Conservative Estimate)\n\nLet's say you build a tool that gets 100 visitors per month (very conservative for something useful).\n\n•Conversion rate: 20% (people who use it and give their email)\n\n•Leads per month: 20\n\n•Leads per year: 240\n\nNow, let's say 10% of those leads eventually become customers (also conservative for warm, intent-rich leads).\n\n•Customers per year: 24\n\nThat's 24 customers from a single tool. If your average deal is $10K, that's $240K in annual revenue. If your average deal is $50K, that's $1.2M.\n\nAnd this is from a single tool. Most companies could build 2-3 of these.\n\n# Why This Matters Right Now\n\nThe growth landscape has changed. Paid acquisition costs are up. Ad platforms are less effective. Organic reach is harder to come by.\n\nBut the one thing that hasn't changed is that people will engage with something that's genuinely useful. A free tool that solves a real problem is one of the few things that still breaks through the noise.\n\n# The Challenge\n\nHere's the challenge: building a free tool requires a different skillset than running ads or writing content. It requires product thinking. It requires understanding your customer's problem deeply enough to build a solution.\n\nBut if you can do it, the payoff is enormous. You're not just acquiring customers—you're building a permanent asset that generates leads on its own.\n\n# Final Thought\n\nThe best growth hacks aren't about finding a new channel or a clever tactic. They're about understanding what people actually want and giving it to them.\n\nA free tool that solves a real problem is the closest thing to a growth hack that actually works long-term.\n\nWhat free tools have you built or seen work? Would love to hear what worked for you in the comments.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qw3ln6/the_free_tool_growth_hack/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qvdxsq",
      "title": "Best AI Visibility Company Recommendations Real-World Results?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qvdxsq/best_ai_visibility_company_recommendations/",
      "author": "sophiaturquoise7201",
      "created_utc": "2026-02-04 03:48:23",
      "score": 11,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Lately, I’ve been seeing a lot of talk about AI visibility how brands can get mentioned or recommended inside AI tools like ChatGPT, Perplexity, and others, instead of just relying on Google search.\n\nHas anyone actually seen results from this like leads, brand mentions, or interest from customers?\n\nAlso, has anyone worked with companies like SearchTides, Zupo, or Bastion?\n\nI’m not looking for pitches, just honest experiences: what’s working, what’s hype, and if AI is actually influencing buying decisions yet.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qvdxsq/best_ai_visibility_company_recommendations/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3hh6k8",
          "author": "Key_Data_4416",
          "text": "11 upvotes and 0 comment. I think all ppl are eager to know the answer lol",
          "score": 1,
          "created_utc": "2026-02-04 06:06:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hr5nd",
          "author": "Awkward_Ad_9605",
          "text": "That's an interesting question! When it comes to AI visibility specifically within Reddit, I've noticed that brands engaging directly with communities tend to see better results than those relying solely on traditional search methods.\n\nBy participating in relevant subreddits, sharing valuable content, and building karma, brands can organically create awareness and interest without the risk of being flagged for promotion. The key is to genuinely engage with the community rather than just push your product.\n\nI’ve worked on a project that focuses on automating this process while adhering to Reddit's rules. It's pretty eye-opening how much community engagement can enhance visibility on platforms like Reddit! If you're curious about specific tactics, I’d be happy to share what I've learned.",
          "score": 1,
          "created_utc": "2026-02-04 07:31:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jop6r",
          "author": "getcited",
          "text": "I've been tracking AI visibility shifts with [outwrite.ai](http://outwrite.ai), and it’s helped me see exactly where my brand gets cited or recommended within AI tools like ChatGPT. It’s not hype - using their platform, you can target the real questions driving AI answers and watch your presence grow beyond just Google searches.",
          "score": 1,
          "created_utc": "2026-02-04 15:41:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jykme",
          "author": "Alex00120021",
          "text": "yeah this is pretty real, AI visibility is definitely starting to matter for demand gen. I came across Brandlight (https://brandlight.ai) recently and it seems built specifically for this, gives you visibility into what AI tools are saying about your brand and helps you actually influence those mentions. From what I've read it's more than just monitoring, they help you figure out what content changes actually move the needle on getting recommended in AI answeres.",
          "score": 1,
          "created_utc": "2026-02-04 16:27:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kcx2e",
          "author": "hboregio",
          "text": "My honest opinion - you can't improve what you cannot track, so start tracking how you rank against your competitors, play around trying to find prompts your real users would use, see which generate more/less mentions, etc. For this, you have plenty of tools like [Cartesiano.ai](http://Cartesiano.ai), [Peec.ai](http://Peec.ai), [Otterly.ai](http://Otterly.ai), etc. - they pretty much offer the same.\n\nThe real struggle is that, just like SEO, influencing their results takes time and comes from honest, good, content, and this takes time.",
          "score": 1,
          "created_utc": "2026-02-04 17:33:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kfov8",
          "author": "trekkingsolo",
          "text": "I think you just need to be writing articles in the format that people are asking questions. You used to be able to search for shared chats from chatgpt to get an idea of what people are asking and how they are asking but openai locked down a couple of months ago. I'm curious as well on the results but case studies are hard to find",
          "score": 1,
          "created_utc": "2026-02-04 17:46:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtab6i",
      "title": "I need to learn growth/user acquisition DESPARATELY!!",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qtab6i/i_need_to_learn_growthuser_acquisition_desparately/",
      "author": "One-Government-9272",
      "created_utc": "2026-02-01 20:48:33",
      "score": 10,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "I have good amount of experience in gaining app installs from fb campaigns and some experience in YouTube ads. I have been looking up to step up in user acquisition because I have seen my creatives been scaled on platforms like appsflyer, ironsource, mintegral (these are the names I know, I have never used it. I don't know how to either).  Can anybody tell me from where should I start. I don't have much idea about GTM as well, actually never used it in my job ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qtab6i/i_need_to_learn_growthuser_acquisition_desparately/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o31o7db",
          "author": "OscillianOn",
          "text": "You already have the channel muscle from FB and YouTube, the next jump is measurement plus post install reality. AppsFlyer is attribution, not a place to buy traffic, ironSource and Mintegral are supply pipes. Pick one conversion event that actually matters, build a simple D1 and D7 retention and ROAS view, then only add new networks once you can see where users fall off\n\nBefore you scale spend, tighten the first 5 minutes so external view matches your internal view of the flow. Run this topic with a few people who have never seen the app and you’ll get structured signal fast: [https://oscillian.com/topics/onboarding-clarity-first-use-ease](https://oscillian.com/topics/onboarding-clarity-first-use-ease?utm_source=chatgpt.com) More channels wont fix a leaky first 5 minutes. What’s the app category and the exact event you want to optimize for",
          "score": 1,
          "created_utc": "2026-02-01 21:48:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o322k80",
          "author": "OkMetal220",
          "text": "If you’re starting from zero like I did with my own web services and early SaaS products, the first thing I learned was that user acquisition isn’t a magic channel, it’s a process you build slowly by learning about your users. You can read all the frameworks and funnels you want, but until you start talking directly to people who actually use or might use your product, you’re guessing. I’d start by having simple conversations with users or potential users, even if it’s just a few short calls or messages, asking what problem they’re trying to solve, what they expected when they signed up, and where they dropped off.\n\nOnce you have that insight, you can start experimenting with specific tactics rather than random popups or ads. Segmenting users based on what content they consume or behavior they show on your site helps tailor offers instead of treating everyone the same, and that often improves acquisition and retention. Growth isn’t just about traffic, it’s about turning people who interact with what you built into people who stick around and tell others about it. The sooner you validate your assumptions with real feedback, the faster you’ll see what actually works for your funnel.",
          "score": 1,
          "created_utc": "2026-02-01 23:00:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34ri6m",
              "author": "happyhappymoon16",
              "text": "Totally agree the important point is the first users",
              "score": 1,
              "created_utc": "2026-02-02 10:12:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o32fbkr",
          "author": "UnusualDisaster6715",
          "text": "DM me if you want :)",
          "score": 1,
          "created_utc": "2026-02-02 00:11:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32j0dd",
          "author": "ruibranco",
          "text": "You're closer than you think. FB and YouTube campaigns are already UA - you just need to connect the dots to measurement and optimization. Start with one MMP (AppsFlyer or Adjust) and learn how postbacks work. That's the gap between running ads and doing UA. For IronSource, Mintegral, Unity Ads - those are mostly relevant for gaming apps with rewarded ads or offerwall monetization. Don't learn them unless your app is in that space. GTM in the UA context means: pick 2-3 channels, set up proper attribution, optimize toward one clear downstream event (not installs - something like purchase or Day 7 retention), and scale what works. Reforge has the best structured content on this if you want frameworks instead of random YouTube tutorials.",
          "score": 1,
          "created_utc": "2026-02-02 00:31:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34k716",
          "author": "Existing-Board5817",
          "text": "I guess you're selling B2C, right? or B2B?",
          "score": 1,
          "created_utc": "2026-02-02 09:01:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35c4os",
          "author": "pantrywanderer",
          "text": "Start by building a foundation in one platform at a time rather than trying to jump into all of them. For user acquisition, understanding tracking is key, so getting comfortable with something like GTM early will pay off. Play around in a sandbox or test account, learn how events fire and conversions track, and then map that knowledge to a UA platform like AppsFlyer. Once you see the data flow end-to-end, scaling campaigns becomes more predictable. Focus on learning the mechanics first, then the creative and optimization strategies will make a lot more sense.",
          "score": 1,
          "created_utc": "2026-02-02 12:59:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36pelu",
          "author": "gardenia856",
          "text": "You already have the hardest part: you’ve actually spent money and made installs happen. The next step is turning that into a real “growth stack,” not just more channels.\n\nMain thing: learn measurement. Set up one simple funnel first: ad click → install → key action (signup, level 3, first payment). Use Firebase or AppsFlyer docs to understand how events/attribution work, then map your current FB + YouTube flow onto that.\n\nFor GTM, don’t overthink it. Take one app or web landing page and just track 3 events with tags: pageview, CTAclick, and signup\\_complete. Once you see them in GA4, it’ll click why everyone obsesses over tracking.\n\nOn UA networks (ironSource, Mintegral, Unity/Applovin), start by reading their playbooks on creative formats and event optimization. Run tiny tests, one variable at a time. I use Meta’s Ads Library and Sensor Tower for ideas; friends lean on Similarweb, and one uses Pulse alongside those to mine Reddit for real user language that turns into better hooks. Main point: build a basic analytics + event setup first, then spread into more networks off that foundation.",
          "score": 1,
          "created_utc": "2026-02-02 17:09:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3836io",
          "author": "Strong_Teaching8548",
          "text": "Yo so fb and youtube ads are solid foundations, but yeah networks like ironsource and mintegral are a different beast, they're more about programmatic mobile ad placement than direct campaign management. tbh though, before jumping into those platforms, i'd nail down your gtm fundamentals first because that's kinda the backbone for understanding how users actually flow through your funnel. \n\nwhat specific metric are you trying to improve right now, cost per install, retention, or just raw volume? that'll help point you in the right direction instead of learning everything at once :)",
          "score": 1,
          "created_utc": "2026-02-02 20:59:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvkyn5",
      "title": "I wasted 6 months split-testing email copy. Turns out my targeting was garbage.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qvkyn5/i_wasted_6_months_splittesting_email_copy_turns/",
      "author": "Soft-Dragonfruit6447",
      "created_utc": "2026-02-04 10:22:52",
      "score": 9,
      "num_comments": 10,
      "upvote_ratio": 0.91,
      "text": "For 6 months I obsessed over email copy. Subject lines. First sentences. CTAs. I A/B tested everything.\n\nMy reply rate stayed at 1.2%.\n\nThen I looked at WHO I was emailing. I was targeting \"marketing managers\" at any B2B company. Completely generic.\n\nThe moment I switched to tracking specific buying signals (people posting about their current tools, complaining about competitors, asking for recommendations), my reply rate jumped to 8%.\n\nSame email. Same offer. Different audience.\n\nNow I only reach out to people who've shown intent in the last 30 days - either on LinkedIn, in communities, or via job changes.\n\nI use OutX to track keywords like \"looking for \\[tool category\\]\" or \"frustrated with \\[competitor\\]\" on LinkedIn. But you could also manually search LinkedIn, set Google Alerts, or lurk in relevant communities.\n\nThe real test: If you can't explain WHY this specific person needs your thing RIGHT NOW, your targeting sucks.\n\nWhat's your experience? Is your targeting tight enough or are you still spray-and-praying like I was?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qvkyn5/i_wasted_6_months_splittesting_email_copy_turns/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o3ib1h9",
          "author": "PearlsSwine",
          "text": "if you think 8% is good, try not spamming people, but only mailing people you have permission to contact!\n\nI realise you're just spamming reddit to try and get the shitty spam tool cited, but I just had to let you know that if you stop spamming people, you'll get much better results.",
          "score": 2,
          "created_utc": "2026-02-04 10:37:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3icr0s",
          "author": "Developer_Akash",
          "text": "yeah this is the move. most people waste months optimizing the wrong variable. targeting beats copy every single time, and honestly it sounds like you cracked the code.\n\nthe intent angle is huge. one thing that helps us is catching those signals across more platforms at once. like Reddit and Hacker News have folks asking for tool recs all the time, and job postings mention pain points before LinkedIn does. manually tracking it gets messy fast though. if you're still doing a lot of manual searching, automating the keyword monitoring across communities saves a ton of time so you can focus on actually reaching out to the right people.",
          "score": 1,
          "created_utc": "2026-02-04 10:52:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ipo3f",
          "author": "e_ai_gabriel",
          "text": "This is the biggest trap in reach marketing. You can have the best text in the world, but if the timing is bad, it's no different from a spam strategy.\n\nLately, I've been applying this same logic to Reddit. People here tend to be more expressive about their specific problems than on LinkedIn, but finding these posts manually is a huge waste of time. I ended up creating a tool that automates this. It uses AI to track conversations with high engagement intent and alerts me the instant they happen. By the way, I found your post through one of my alerts just now. It's been a lifesaver for getting into discussions while they're still trending, instead of finding them three days later. It greatly speeds up the prospecting, approach, and sales cycle.",
          "score": 1,
          "created_utc": "2026-02-04 12:33:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ipscr",
          "author": "ruibranco",
          "text": "The 80/20 of cold outreach is always audience selection, not copy. Most people spend weeks wordsmithing subject lines when they should spend that time building better lists. Your intent signal approach is solid - job changes are another gold mine (new VP of Marketing in first 90 days is way more likely to evaluate new tools than someone who's been in the role for 3 years).",
          "score": 1,
          "created_utc": "2026-02-04 12:34:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jpe6b",
          "author": "ActivitySmooth8847",
          "text": "Targeting is everything. I had similar issues until I started using tools to find leads based on real signals like job changes or tool complaints.",
          "score": 1,
          "created_utc": "2026-02-04 15:44:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jyl8z",
          "author": "Humble-Food8889",
          "text": "def relate to this... went thru the same phase thinking the unlock was the copy when the real issue was who i was emailing to. what has clicked for me was moving to signal-based targeting instead of role-based e.g. generic title = generic problems. once i started filtering for \"why now\" with recent hirings, launches, role changes etc, replies went up. i don't track keywords on Linkedin tho but i use tools like Databar AI to pull in signals across org and contacts and to enrich leads first before outreach. big takeaways imo, copy can optimize conversion but targeting is the decider if conversion is even possible",
          "score": 1,
          "created_utc": "2026-02-04 16:27:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3klf9e",
          "author": "AlexeyUniOne",
          "text": "is this case about cold outreach via email or newletters?",
          "score": 1,
          "created_utc": "2026-02-04 18:12:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oihg5",
          "author": "stephan85",
          "text": "The main impact often comes from who you're talking to, not just how you say it. had a similar experience focusing on general \"SMB owners\" where reply rates were stuck.\n\n\n\nIt took a while to realize the broadness of the audience, not the pitch, was the problem. you could narrow down by looking for specific pain points mentioned in online forums or recent job changes that signal a need. Focusing on those intent signals usually makes a big difference.",
          "score": 1,
          "created_utc": "2026-02-05 07:36:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3palxo",
          "author": "Electronic_coffee6",
          "text": "this is such an important lesson and most people never figure it out. Chasing perfect copy when you're emailing the wrong people is like polishing a turd. One thing that helped me beyond intent signals was also focusing on *timing* with business lifecycle stages.\n\nNew businesses are usually in active buying mode for tools, services, contractors, etc. They don't have legacy vendors yet and they're actually looking for solutions right now instead of being locked into 3-year contracts. I stumbled onto SMB Sales Boost (https://smbsalesboost.com/) which gives you contacts for newly registered businesses.\n\nIt's basically a database of fresh SMB leads so you're reaching people who just started and are actively building their stack. The targeting becomes way tighter because you know they're in setup mode rather than just guessing based on job titles. Combining that kind of lifecycle timing with the intent signals you mentioned sounds like it would be pretty powerful.\n\nWay better than spray and pray for sure.",
          "score": 1,
          "created_utc": "2026-02-05 11:55:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3iaksq",
          "author": "PastComprehensive815",
          "text": "This is such a good reminder. Copy matters, but targeting matters way more. If you can’t explain why this person needs your product right now, you’re guessing. Intent beats personas every time.",
          "score": 0,
          "created_utc": "2026-02-04 10:33:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu559f",
      "title": "Day 3 of building a business from scratch as a 22 year old.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qu559f/day_3_of_building_a_business_from_scratch_as_a_22/",
      "author": "Beginningpen52",
      "created_utc": "2026-02-02 19:35:23",
      "score": 9,
      "num_comments": 8,
      "upvote_ratio": 0.92,
      "text": "Hi, as I said earlier I have never had my own house and my goal is to buy a house in Delhi, India asap.\n\nI am a writer professionally but not earning much. I have run a drop shipping business for 6 months at the age of 17. And now I am trying to build a content writing agency and to keep posting my progress here.\n\nSo today i went on Upwork and fiver to understand the best agencies/individual writers prices, services and portfolio. how here's how I am planning to go about it.\n\nI decided 2 sevices that I want to give: LinkedIn posts and linkedin page handling and Printerest pins as of now. Since I'm professionally a LinkedIn lead and I have had experience in designing aesthetic pins for my own pinterest. \n\nI also went to Apollo on one of  your suggestios but could not find the best way to use it. Can you help me figure it out. \n\nOne thing I'm struggling with is creating a plan, my mind diverts to 50 thing, I want to focus on one thing at a time. Should i start with researching best writing agencies or talking to potential customers or something else?\n\nI'll be posting my progress here everyday. Do drop down anu suggestions or plans you have. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qu559f/day_3_of_building_a_business_from_scratch_as_a_22/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o39njhw",
          "author": "Drumroll-PH",
          "text": "Focus on talking to potential customers first. You need to validate demand before worrying about agencies or prices. Spend your day finding 5 to 10 people or businesses who might pay for LinkedIn or Pinterest services and ask about their needs and budgets. Once you know what people actually want, you can refine pricing, packages, and outreach.",
          "score": 1,
          "created_utc": "2026-02-03 01:55:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ax22o",
          "author": "Minimum-Candidate851",
          "text": "Start with knowing who's your target audience bro, in that you can find and market your product to them and align your priorities for you to focus on what's really you need to do first. You can do it! Just market it with right audience",
          "score": 1,
          "created_utc": "2026-02-03 07:04:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bgi0f",
          "author": "That-Travel-5697",
          "text": "Start by talking to clients, it won’t help if you start talking to agencies if you don’t know what peoples needs are",
          "score": 1,
          "created_utc": "2026-02-03 10:10:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bnnnx",
          "author": "Existing-Board5817",
          "text": "I agree with our friend here, talk to your customers.\n\nI use Starnus to automate my outbound, I used it for 8 weeks now, it is like my AI employee for sales, I give it the task and it does it for me (lead gen + research/analysis + enrichment + messaging + reachouts + monitoring + ...)\n\nI have the Pro+ plan, it just costs me $60/mo\n\nI reached out to 2000 highly researched and high intent leads on LinkedIn, got 514 accepted connections, 208 replies, 41 meetings booked, 12 deals closed (ACV = $1500+ per deal)\n\nWill try to get 3XPro+ plans, so I can scale it 3X in the coming weeks",
          "score": 1,
          "created_utc": "2026-02-03 11:15:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cjm9l",
          "author": "pantrywanderer",
          "text": "If your mind is already splitting into 50 directions, that is a signal to narrow harder, not add more planning. I would start with talking to potential customers first, even informal conversations, because that will quickly tell you which service people actually care about paying for. Researching agencies is useful, but it can turn into endless comparison with no decisions. Pick one service you feel most confident delivering right now and commit to it for a short window, like 30 days. Treat everything else as background noise during that time. A simple plan that you actually execute beats a perfect plan that keeps changing every day.",
          "score": 1,
          "created_utc": "2026-02-03 14:39:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hwc2g",
          "author": "Realistic-Review-728",
          "text": "Focusing on one thing at a time might help. You could also check out babylovegrowth for content ideas and backlinks or look into tools like Canva for pin design.",
          "score": 1,
          "created_utc": "2026-02-04 08:18:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}