{
  "metadata": {
    "last_updated": "2026-02-20 03:06:13",
    "time_filter": "week",
    "subreddit": "GrowthHacking",
    "total_items": 20,
    "total_comments": 202,
    "file_size_bytes": 187952
  },
  "items": [
    {
      "id": "1r8bh5r",
      "title": "How do resellers move beyond one off finds and build consistency?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r8bh5r/how_do_resellers_move_beyond_one_off_finds_and/",
      "author": "No-Lettuce9313",
      "created_utc": "2026-02-18 18:44:15",
      "score": 61,
      "num_comments": 12,
      "upvote_ratio": 0.81,
      "text": "Been reselling for a while now and the one thing I can't seem to crack is consistency. Like I'll have a genuinely great week find good stuff, flip it fast margins are solid. Then the next week feels like everything dried up and I'm driving around for hours coming back with basically nothing worth listing. The one off finds are fun but they're not a business. I know that. The problem is I'm still not sure how to get from this is going well sometimes to this is actually reliable. Because right now it still feels more like luck than a system.  \n  \nI've tried being more intentional about sourcing, hitting the same spots consistently, learning certain categories better, paying attention to what actually sells versus what just looks good in the moment. That stuff has helped a little but I still feel like I'm missing something structural that more experienced resellers probably figured out a while ago. Part of me wonders if consistency at this level just comes down to volume, like the more you're out there the more it evens out over time. But I also don't want to just grind harder without actually getting smarter about it because that's just burning yourself out for the same results. Curious how people handle the sourcing side when their usual spots stop producing. Do you have backup channels, relationships with certain sellers, specific categories you always fall back on? Or does everyone just hit dry spells and push through it.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r8bh5r/how_do_resellers_move_beyond_one_off_finds_and/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o63w3rg",
          "author": "Weird_Excuse_1249",
          "text": "I hit that same wall after a while, thrift stores alone just aren’t enough if you want consistency. What helped me was starting to look into wholesalers and also searching online for suppliers. There’s more out there than people realize you just have to dig a bit.",
          "score": 15,
          "created_utc": "2026-02-18 19:20:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64827b",
              "author": "OutsideTicket1672",
              "text": "Yes this was my experience, I love thrifting but it just doesn’t scale long term. I’ve been sourcing through Fleek lately and it’s made things way more predictable.",
              "score": 11,
              "created_utc": "2026-02-18 20:16:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o63q7uu",
          "author": "FormalDelay8560",
          "text": "What changed everything for me was moving away from relying purely on random finds and focusing more on repeatable sources. One off pieces are great but consistency comes from having suppliers or channels you can go back to regularly.",
          "score": 1,
          "created_utc": "2026-02-18 18:54:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63qf4f",
          "author": "Full_Ad_3124",
          "text": "Dry spells happen to everyone but relying only on thrift runs makes it hard to scale. What helped me was diversifying where I source from so I’m not dependent on one method. Even if one channel slows down others keep things moving.",
          "score": 1,
          "created_utc": "2026-02-18 18:55:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63wb1w",
          "author": "VarietyWeird909",
          "text": "The real shift is finding repeat suppliers, plenty of wholesalers exist online if you spend time searching.",
          "score": 1,
          "created_utc": "2026-02-18 19:21:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6458la",
          "author": "sainkunal_13",
          "text": "The shift from “good week / bad week” to consistency usually comes from turning sourcing into a system instead of an event.\n\nRight now it sounds like you’re still operating on opportunity. You find something good, margins are there, great week. Then you’re back hunting again. That’s normal early on.\n\nThe resellers I’ve seen build consistency usually do 3 things:\n\n1. They specialize harder than they think they need to. One or two categories max. That way you recognize value instantly and move faster than generalists.\n2. They build repeat sources. Instead of random one-off finds, they create relationships with specific sellers, liquidation spots, or even small local businesses that offload regularly.\n3. They track data obsessively. Not just “what sold” but sell-through time, margin after fees, return rate, etc. Patterns start to show up after 30–50 flips.\n\nVolume does smooth things out, but only if it’s repeatable volume. Otherwise it’s just more chaos.\n\nOut of curiosity — are your best weeks coming from the same type of item each time or totally different finds?",
          "score": 1,
          "created_utc": "2026-02-18 20:03:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66hvjz",
          "author": "amberjletang",
          "text": "It feels like luck because you are hunting for items instead of building a pipeline. One-off finds are fine for a hobby, but they don’t scale because you have to be there for every win.\n\nTo break this, you need to find repeatable loops. Stop hitting the same thrift spots and start looking at bulk sources (like wholesalers or liquidators) where you can buy 10 of the same thing at once. Treat it like a data problem: if you can automate the sourcing alerts for digital auctions or bulk lots, the inventory starts coming to you while you sleep.",
          "score": 1,
          "created_utc": "2026-02-19 03:28:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68kfxu",
          "author": "pantrywanderer",
          "text": "From what you’re describing, it sounds like a mix of luck and system. Even the most experienced resellers hit dry spells, it’s part of the game.\n\nWhat separates the consistent ones is having backup channels and routines that don’t rely on a single source. That could mean cultivating relationships with multiple suppliers, knowing a few categories inside out so you can pivot quickly, or even setting aside time for online sourcing when physical spots run dry. Volume helps, but smarter systems prevent burnout and make the wins more predictable instead of random.",
          "score": 1,
          "created_utc": "2026-02-19 13:26:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69c2ix",
          "author": "Ok_Tart5733",
          "text": "I get this. It often takes time to turn reselling into a consistent system rather than relying on luck. Experienced sellers usually build multiple sourcing channels, focus on categories they know sell, and develop relationships with reliable sellers so dry weeks don’t derail their business.",
          "score": 1,
          "created_utc": "2026-02-19 15:52:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3ofdw",
      "title": "We accidentally fixed a client's reputation crisis while trying to bury a negative Reddit post in Google",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r3ofdw/we_accidentally_fixed_a_clients_reputation_crisis/",
      "author": "algerdy87",
      "created_utc": "2026-02-13 12:55:47",
      "score": 59,
      "num_comments": 6,
      "upvote_ratio": 0.95,
      "text": "Honestly, this is one of those stories I can barely believe actually worked.\n\nSo, a few months back, we had a client freaking out because every time someone googled their brand, the second result (right under their own ad) was a savage Reddit post from two years ago called something like \"\\[Company Name\\] - Be Aware Before You Buy.\"\n\nThe wild part is, the complaint in that post was fair at the time, but they’d completely turned things around since then-totally new management, new team, big improvements.\n\nDidn’t matter though, because people just kept seeing that post and bouncing.\n\nEven worse, it was eating into their conversion rates, since people would still google the company after clicking the ad and, well, there it was.\n\nWe at marketowl ai tried everything-messaged the original poster (no reply), reported the post (Reddit mods didn’t care), blogged about the real improvements (barely made a dent). The post just had too much upvote history to move.\n\nThen we tried something different. What if we just made Reddit love us instead? Not shilling, but actually being helpful in subs related to their industry. We fired up our own tools to find the right subs and topics, and started posting like crazy-real answers to questions, solid advice, quick guides. For about a month, we put up 40-50 posts.\n\nOnly mentioned the client when it honestly made sense, maybe in a fifth of the posts. It was kind of nuts:\n\n* All our posts combined got over 700k reads\n* Four of them went to the top in their subs\n* The negative post got pushed to page 2 on Google after three weeks\n* Now, three of our Reddit posts are on the front page for their brand name\n\nAnd this part blew my mind: I was messing with ChatGPT last week to see what it \"knew\" about the company, and it was literally quoting our Reddit posts. So now even the AI picked up the new, accurate story. Their conversion rate for branded traffic tripled in two months.\n\nHas anyone else had to battle old negative stuff that refused to die in search results? Would love to hear what worked for you (or if there are tricks we haven’t thought of yet).",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r3ofdw/we_accidentally_fixed_a_clients_reputation_crisis/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5brxc0",
          "author": "b3ndgn",
          "text": "So in a sense, be active in any community.",
          "score": 6,
          "created_utc": "2026-02-14 11:54:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nsykp",
              "author": "algerdy87",
              "text": "yep",
              "score": 1,
              "created_utc": "2026-02-16 10:24:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5959o4",
          "author": "musicman651",
          "text": "Thanks for sharing, very interesting",
          "score": 5,
          "created_utc": "2026-02-13 23:34:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nswug",
              "author": "algerdy87",
              "text": "you're welcome",
              "score": 1,
              "created_utc": "2026-02-16 10:23:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5dl0bg",
          "author": "Just_Awareness2733",
          "text": "yea dealing with old negative posts is tough, we had a similar issue and used Riff Analytics to track how our helpful content was being picked up by AI search engines, it showed us exactly which posts were being cited and helped us double down on what worked.",
          "score": 1,
          "created_utc": "2026-02-14 18:10:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3h823",
      "title": "Optimized a page for AI Overviews and it tanked my normal rankings... anyone else?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r3h823/optimized_a_page_for_ai_overviews_and_it_tanked/",
      "author": "CheekyChardonnay",
      "created_utc": "2026-02-13 05:53:39",
      "score": 40,
      "num_comments": 33,
      "upvote_ratio": 1.0,
      "text": "So I had this service page ranking position 4 for a pretty decent keyword. Read a bunch about structuring content for AI Overviews, figured I'd test it.\n\nAdded a direct answer paragraph right at the top, broke everything into shorter Q&A sections, cleaned up the headers to be more question-based. Basically made it way more \"snippet friendly\" or whatever.\n\nTwo weeks later I'm position 11 and not showing in the overview either.\n\nMy theory is I stripped out too much of the detailed content that was actually ranking me in the first place? But honestly I don't know.\n\nAnyone else experiment with this and regret it",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r3h823/optimized_a_page_for_ai_overviews_and_it_tanked/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o54dpvc",
          "author": "Lower-Squirrel5988",
          "text": "did you check if your page still passes Core Web Vitals after the changes? I've seen structured content mess with layout shift scores if you're not careful with how the Q&A sections load. Also curious what your original word count was vs after the rewrite... Might be more than just format",
          "score": 14,
          "created_utc": "2026-02-13 06:27:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54eq7o",
              "author": "No-Tap4873",
              "text": "Yeah this happened to me last month. Turned out optimizing for both regular SERP and AI Overviews needs different signals. i use Semrushs AI Visibility score to track it separately from regular rankings now cause they literally conflict sometimes. not cheap obviously and took me a bit to figure out which metrics actually matter. but at least I can see when Im about to tank one trying to boost the other",
              "score": 9,
              "created_utc": "2026-02-13 06:35:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54g4b1",
                  "author": "ogguptaji",
                  "text": "wait semrush has a separate AI visibility metric now? i've been using their regular toolkit but hadn't seen that. is it under the organic research section or somewhere else",
                  "score": 1,
                  "created_utc": "2026-02-13 06:47:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o55okee",
                  "author": "CheekyChardonnay",
                  "text": "that actually makes a lot of sense. i was treating them like the same optimization target which was probably the mistake. gonna look into that semrush feature, thanks",
                  "score": 1,
                  "created_utc": "2026-02-13 13:06:15",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o55ome6",
              "author": "CheekyChardonnay",
              "text": "Word count went from like 2800 to 2100. Vitals didnt change much, still green across the board. maybe it was the depth reduction more than the format itself idk",
              "score": 1,
              "created_utc": "2026-02-13 13:06:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5970nt",
                  "author": "Future_Dimension_985",
                  "text": "700 words is a lot to cut. Did you lose any semantic variations or supporting topics? Sometimes Google ranks you for the secondary stuff and you don't realize it until its gone",
                  "score": 1,
                  "created_utc": "2026-02-13 23:45:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o54evbq",
          "author": "Fun_Shine8720",
          "text": "the Q&A format works great for user experience even if Google doesn't love it for rankings. maybe worth keeping if your actual conversion rate improved? depends on your goals I guess",
          "score": 3,
          "created_utc": "2026-02-13 06:37:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54driz",
          "author": "Key-Reality9237",
          "text": "Honestly I think Google is still figuring out what they want for AI Overviews. i've been tracking like 15 of my pages and the ones showing up in overviews have zero pattern... some are super detailed, some are basically just lists. Did your CTR change at all before the ranking drop? Sometimes the snippet change kills clicks even before rankings move",
          "score": 2,
          "created_utc": "2026-02-13 06:27:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o55op3r",
              "author": "CheekyChardonnay",
              "text": "cTR actually went up slightly right after the changes, then tanked when rankings dropped. So the new format was getting more clicks at position 4, just didn't hold the position",
              "score": 1,
              "created_utc": "2026-02-13 13:07:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o59iqyq",
                  "author": "Key-Reality9237",
                  "text": "interesting so the format itself was working. Probably just the content depth issue like others said. you might be able to add back some of that detail without losing the Q&A structure",
                  "score": 1,
                  "created_utc": "2026-02-14 00:55:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o54evkf",
          "author": "_moneyish_",
          "text": "anyone actually showing up in AI overviews consistently? I've been trying for months and cant crack it. starting to think its random",
          "score": 2,
          "created_utc": "2026-02-13 06:37:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54gwh9",
              "author": "Master_Accident_5849",
              "text": "i have two pages that show up sometimes but its inconsistent. like the same query will show an overview one day and not the next. really hard to optimize for something that unstable",
              "score": 1,
              "created_utc": "2026-02-13 06:54:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o54dow5",
          "author": "_VongolaDecimo_",
          "text": "Lol google: \"make your content more snippet friendly\" also google: \"actually we're gonna tank you for that\" honestly I think they're just testing stuff and we're all guinea pigs. the AI overview thing is too new for anyone to have real data",
          "score": 1,
          "created_utc": "2026-02-13 06:27:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54ew8d",
              "author": "Total_Hyena5364",
              "text": "This is why I stopped optimizing specifically for features like this. just write good comprehensive content and let google figure it out. Every time I try to game a specific feature it backfires",
              "score": 1,
              "created_utc": "2026-02-13 06:37:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54f9hr",
                  "author": "sychophantt",
                  "text": "yep same. I optimized for featured snippets last year and lost the snippet AND dropped 3 positions. Not touching that stuff anymore",
                  "score": 1,
                  "created_utc": "2026-02-13 06:40:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o54drbi",
          "author": "Material_Tutor_7820",
          "text": "How competitive is the keyword? If its a YMYL or high commercial intent topic google might just want more comprehensive content regardless of format. I've noticed they're less likely to pull snippet-style answers for anything money-related",
          "score": 1,
          "created_utc": "2026-02-13 06:27:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54jqmk",
              "author": "Comfortable-Name3859",
              "text": "Yeah for B2B comparison queries I think they still want the long-form breakdowns. The AI overview thing seems more for quick factual answers not buying decisions",
              "score": 1,
              "created_utc": "2026-02-13 07:19:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o55or5n",
              "author": "CheekyChardonnay",
              "text": "Its B2B software comparison stuff so decent commercial intent. Not crazy competitive but top 10 is all pretty established sites. that could be part of it honestly",
              "score": 1,
              "created_utc": "2026-02-13 13:07:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o54dsmv",
          "author": "Long-Historian-5937",
          "text": "Did you change your internal linking at all? Sometimes when you restructure content like that you lose important contextual links and that can hurt more than the content changes themselves",
          "score": 1,
          "created_utc": "2026-02-13 06:27:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54gn60",
              "author": "Lower-Squirrel5988",
              "text": "Good call. Also anchor text in the new Q&A headers might be too generic. like if you changed \"Best project management software for remote teams\" to \"What's the best option?\" you lost keyword density in a high-priority element",
              "score": 1,
              "created_utc": "2026-02-13 06:52:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o54eblp",
          "author": "kubrador",
          "text": "you played yourself optimizing for a feature that might not exist in six months while nuking the thing that was actually making you money",
          "score": 1,
          "created_utc": "2026-02-13 06:32:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54escc",
          "author": "Bubalis_Bubalus",
          "text": "\nNgl this is exactly why I haven't touched any of my ranking pages. too scared to mess with what's working lol. Maybe just make a new page for AI overview testing instead of risking your current rankers?",
          "score": 1,
          "created_utc": "2026-02-13 06:36:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54gper",
              "author": "Own-Policy-4878",
              "text": "that's actually smart. Test the format on a page that's like position 15-20 where you have less to lose. if it works there move it to the money pages",
              "score": 1,
              "created_utc": "2026-02-13 06:52:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54nxrt",
                  "author": "_VongolaDecimo_",
                  "text": "Or just duplicate the page and do a 50/50 split test but google hates duplicate content so maybe not lmao. there's no good answer here",
                  "score": 1,
                  "created_utc": "2026-02-13 07:58:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o54gs98",
          "author": "Dear_Stage973",
          "text": "You traded your topical depth for a summary and discovered the hard way that Google ranks the source, not the SparkNotes",
          "score": 1,
          "created_utc": "2026-02-13 06:53:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54oukb",
          "author": "Feeling-List9160",
          "text": "sounds like you trimmed too much of the detailed content. try restoring the core paragraphs and test a lighter FAQ at the top, then monitor the impact for a week.",
          "score": 1,
          "created_utc": "2026-02-13 08:06:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58ze0n",
          "author": "Alarming_Bluebird648",
          "text": "Adding that 'direct answer paragraph' likely diluted your keyword density and nuked the semantic depth of the page. You traded your stable SERP floor for a zero-click snippet attempt that didn't even convert.",
          "score": 1,
          "created_utc": "2026-02-13 23:00:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bs47l",
          "author": "Technical-Radio5033",
          "text": "oof yeah that sucks, I'd be frustrated too. The tricky part is optimizing for AI answers isn't really the same as optimizing for traditional rankings, and it sounds like you kinda ended up in no man's land between the two. If you're serious about showing up in AI-generated answers, you might want to check out Brandlight (https://brandlight. ai).\n\nFrom what I've read, it helps you monitor what AI tools are actually saying about your brand or service when people ask for recommendations, so you're not just guessing what works. That way you can see if your changes are even getting you mentioned before tanking more pages. For your current situation tho I'd probably roll back the changes and get your rankings back first, then test more incrementally instead of overhauling the whole thing at once.",
          "score": 1,
          "created_utc": "2026-02-14 11:56:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s2osq",
          "author": "amberjletang",
          "text": "Optimizing for snippets often leads to 'Thin Content' issues. By focusing strictly on a direct answer, you likely removed the semantic depth Google needs to verify your authority on the topic.\n\nTraditional rankings and AI Overviews require different Information Densities. You can serve both by using an architecture that provides a direct answer at the top while keeping a deep 'Logic Layer' below it for core ranking signals.\n\nA Dual-Path Indexing strategy is the fix. Re-introduce the detailed content as the supporting data for your answer. This proves to the algorithm that your snippet is backed by comprehensive expertise rather than just being a lucky guess.",
          "score": 1,
          "created_utc": "2026-02-17 00:13:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o642xfc",
          "author": "Dazzling_Hyena_7407",
          "text": "just started using [https://isyourwebsiteready.ai/](https://isyourwebsiteready.ai/) last week to see where gpt/claude/perplexity hits and which pages convert and it kinda explained why my normal rankings tanked, curious if others saw model-specific patterns too",
          "score": 1,
          "created_utc": "2026-02-18 19:52:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3oobi",
      "title": "Reaching $15k MRR with high intent Linkedin tactict",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r3oobi/reaching_15k_mrr_with_high_intent_linkedin_tactict/",
      "author": "Comfortable-Tell-192",
      "created_utc": "2026-02-13 13:07:05",
      "score": 35,
      "num_comments": 4,
      "upvote_ratio": 0.97,
      "text": "The idea is to use the pesky \"comment-for-guide\" strategy. Yes, it's pesky, and social media is flooded with it, but it works.\n\nGet people to comment to trigger engagement signal to the algo then send them a guide in the comments.\n\nThe guide gives value + teaches how to automate the thing I'm teaching  [with my SaaS](http://rebelgrowth.com/?utm_source=reddit)\n\nWe automatically write the guide targeting high buying intent keywords using rebelgrowth which also creates the linkedin post based on the automatically generated guide\n\nThe post itself follows a simple formula: Hook + Problem Agitation + Hint Solution + CTA (comment to get guide)\n\nUse a scroll stopping image for the post, something weird that makes people go \"wtf?\"\n\nTo anyone who comments, reply directly with the guide (this part is the boring time consuming part)...more comments, more engagement, more reach\n\nThen everyday I connect with 20 high intent leads, I look for people engaging with my competitors or with overlapping brands or that have recently raised money or changed job position for decision making roles or that have typed my high-intent keywords\n\nI also send DMs to people who have accepted my connection request the day prior, the DM is simple and non salesy, I just want to build rapport with people so when they see my posts, they engage. I send more salesy DMs to people who comment or like my posts.\n\nThat's it. Takes a couple hours per day but it converts very well.\n\nHave you tried something like this?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r3oobi/reaching_15k_mrr_with_high_intent_linkedin_tactict/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o571o0g",
          "author": "Lonely_Mark_8719",
          "text": "Growth experiments move faster when asset creation isn’t the bottleneck. We started using lightweight automation to generate variations of landing page sections and social posts. It made testing angles much easier instead of redesigning everything manually each time.",
          "score": 1,
          "created_utc": "2026-02-13 17:14:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o590n4e",
          "author": "Tiny-Celery4942",
          "text": "Works, but it gets noisy fast and won’t scale if you do every reply by hand. Main point: automate the guide delivery so you only spend time on real leads. Quick tip: host the guide on a simple landing page that auto-emails the file when someone comments, reply in-thread with a short line like \"Sent the guide to your inbox\", and only DM the top 5 most engaged commenters within 24 hours with a one-line follow up that references their comment and asks one simple question. Saves hours and keeps the human touch where it matters. I use Depost AI to draft those reply lines and keep follow-ups organized.",
          "score": 1,
          "created_utc": "2026-02-13 23:07:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5izbwu",
          "author": "Confident_Box_4545",
          "text": "linkedin is by far the best platform for finding buyers.",
          "score": 1,
          "created_utc": "2026-02-15 16:11:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r84h8z",
      "title": "What are you using to manage email marketing campaigns?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r84h8z/what_are_you_using_to_manage_email_marketing/",
      "author": "Latter_Ordinary_9466",
      "created_utc": "2026-02-18 14:30:01",
      "score": 33,
      "num_comments": 18,
      "upvote_ratio": 1.0,
      "text": "I'm trying to improve how we handle our marketing campaigns and right now we're juggling emails, socials, ads and it's a total total mess from a time management stand point. That said I don't want to hire/outsource to an agency to do all this for me. Just looking to find a management platform that will free up some time and workload for our team  \n  \nLooking for something that can help:  \n• Keep all contacts in one place  \n• Schedule emails and automation sequences  \n• Track performance and ROI easily  \n• Build forms  \n  \nThere are tools like activecampaign, hubspot, mailchimp ... but wanted to hear from real ppl what really works. What do you use and what's your experience?? I'm happy to invest in it as long as it really does the job.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r84h8z/what_are_you_using_to_manage_email_marketing/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o629c7d",
          "author": "Small-Ad-2708",
          "text": "We use ActiveCampaign! The interface is clean, you can schedule emails, manage contacts etcand it plays nice with other tools we use. Great option to really cover all your marketing efforts and we've benefitted from their AI features that they keep adding",
          "score": 5,
          "created_utc": "2026-02-18 14:55:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63p24b",
          "author": "Numbersevenonly",
          "text": "I started with mailchimp but quickly switched to ActiveCampaign once we scaled. I found it better for managing multiple campaigns and doing easy 'fancy' automations. If you grow and need to do more it is a great tool to start and will save you time further down the line.",
          "score": 3,
          "created_utc": "2026-02-18 18:49:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64lwlv",
              "author": "Organic-Hall1975",
              "text": "+1 moved from Mailchimp to ActiveCampaign too. So glad we did. We have been floored with the improvements we've seen to our email deliverability",
              "score": 1,
              "created_utc": "2026-02-18 21:21:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6262fh",
          "author": "Open_Article8347",
          "text": "Zoho campaogns",
          "score": 1,
          "created_utc": "2026-02-18 14:39:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62iox8",
          "author": "Fred_TastefulGift",
          "text": "I use Brevo for sending mails but they also have some CRM and campaign capabilities. Quite good free plan from my POV.",
          "score": 1,
          "created_utc": "2026-02-18 15:39:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62t8dg",
          "author": "Emotional-Bee-967",
          "text": "For multi-channel check out ActiveCampaign. The automations are great and it's not crazy expensive considering what it can do. Worth every $$ in my books.",
          "score": 1,
          "created_utc": "2026-02-18 16:27:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63cs39",
          "author": "Confident-Tank-899",
          "text": "The platform choice really depends on your workflow complexity. For teams dealing with volume like yours, a unified platform can save tons of time versus switching between tools. ActiveCampaign is solid, but also worth considering based on your specific needs:\n\n\n\nIf you need pure email automation with segmentation, Klaviyo excels. For CRM integration, HubSpot's ecosystem is powerful. The key is making sure your platform integrates with your other tools and scales with you.",
          "score": 1,
          "created_utc": "2026-02-18 17:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63ufmr",
          "author": "theroimaniac",
          "text": "Always loved ActiveCampaign. It has more than just email marketing.",
          "score": 1,
          "created_utc": "2026-02-18 19:13:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64j5uo",
          "author": "brite_star",
          "text": "Try MailPhoton.com nice features for email marketing.Automates emails",
          "score": 1,
          "created_utc": "2026-02-18 21:08:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66bfny",
          "author": "Far_Move2785",
          "text": "Been there with the marketing chaos. Juggling all those channels is brutal.\n\nQuick recommendation on email platforms: check out Klaviyo. Super clean UI and does everything you want. But real talk, that's not even the biggest conversion killer I've seen.\n\nThis might not be your exact problem but I discovered something massive with in-app browsers killing marketing performance. When people click ads on Instagram/Facebook/TikTok they land in these garbage browsers that destroy checkout conversion.\n\nMy conversion was 1.2% in those in-app browsers vs 4% in Safari. Total nightmare. The problem? No credit card autofills, no Apple Pay, everything's slower.\n\nFix was routing people to their real browser before checkout. Saw a 15% revenue lift from same ad spend. Massive difference.\n\nPro tip: Check your analytics for conversion by browser. If Instagram or Facebook browser numbers are way lower than Safari, that's your hidden leak.\n\nhttps://tryhoox.com handles the redirect automatically if you want to test it. Saved my team tons of headache.",
          "score": 1,
          "created_utc": "2026-02-19 02:49:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66j3g5",
          "author": "amberjletang",
          "text": "The mess usually happens because people buy a tool before they actually map out their workflow. \n\nHubSpot is the gold standard for keeping everything in one place, but you definitely pay a massive premium for that convenience as you scale. If your primary pain point is ROI tracking and complex automation sequences, ActiveCampaign often handles the logic better for a much lower price point. \n\nFor a team that's currently overwhelmed, look into setting up a Lead Scoring system within whichever platform you choose. It'll automatically flag which leads are actually worth your time based on their interactions, so your team stops chasing dead ends and focuses only on the high-ROI activity.",
          "score": 1,
          "created_utc": "2026-02-19 03:35:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67b0z1",
          "author": "Bendecx",
          "text": "Try mailerlite",
          "score": 1,
          "created_utc": "2026-02-19 07:01:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67uo0l",
          "author": "Free_Ninja7616",
          "text": "If you want the simplest setup that actually works, go with HubSpot.\n\nYeah it’s more expensive, but it replaces 3 tools and you stop wasting time duct-taping stuff together.\n\nIf you’re early and budget matters:\n\n* ActiveCampaign is great for email automation\n* Mailchimp is fine but gets messy once you need real workflows\n\nBiggest mistake I see is picking cheap and then spending 6 months fighting integrations.\n\nWe see this a lot with clients at BriskFab too. The tool matters way less than having one clean system everyone actually uses.",
          "score": 1,
          "created_utc": "2026-02-19 10:08:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69m3go",
          "author": "Dxstinity",
          "text": "i feel you on the email chaos, it gets overwhelming. i use mailly for my outreach stuff and it really helps streamline things. it keeps everything organized and makes tracking performance a lot easier. might be worth checking out!",
          "score": 1,
          "created_utc": "2026-02-19 16:41:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bgqls",
          "author": "erickrealz",
          "text": "You listed the main contenders already so you clearly know the market. Pick whichever has the best automation builder for your use case and stop overthinking it. They all do basically the same crap at the core level.\n\nThe real difference comes down to how complex your automations need to be. If you're just doing basic sequences and newsletters, go with the simplest and cheapest option. If you need advanced segmentation and lead scoring, step up to a mid tier platform.\n\nTbh most people overpay for features they never use.",
          "score": 1,
          "created_utc": "2026-02-19 22:01:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6chb3m",
          "author": "Hot-Juggernaut-506",
          "text": "You could try Getsitecontrol. They are a popup builder and email marketing tool with good automation / workflow functionality. The cost isn't very high either as a lot of the features come with the free plan.\n\nI had a good experience managing email campaigns through their service, and their form / popup building tools are excellent too. \n\nI also heard good things about Brevo and Mailerite for email marketing but I don't have that much experience with them myself.",
          "score": 1,
          "created_utc": "2026-02-20 01:30:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r74jir",
      "title": "Built side project nights. Launched weekends. Failed. Full Saturday focus won.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r74jir/built_side_project_nights_launched_weekends/",
      "author": "Expensive-Treacle-88",
      "created_utc": "2026-02-17 12:21:12",
      "score": 27,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "Started side project April 2025 building directory submission tracker. Worked two hours nightly after day job. Weekends launched on Reddit and directories. Five months in had nineteen users. Two hundred twelve dollars MRR. Killed it. Restarted dedicating full Saturdays only to building and distribution. Same tool hit four thousand MRR in four months. Nightly grinding destroyed focus. Saturday blocks created momentum.\n\nNightly sessions felt productive. Two hours coding after nine hour workday. Brain already fried. Wrote messy code. Fixed same bugs twice. Thirty minutes productive max per session. Weekends rushed launch posts. No energy left for quality distribution. Burnout hit month three. Took two week break. Momentum died. \n\nRestart changed everything. Saturdays only. Eight AM to six PM. Ten focused hours. Planned week distribution Monday lunch breaks. Coded features Saturday morning fresh. Launched Reddit posts Saturday afternoon when communities active. Submitted twenty directories per Saturday using [FounderToolkit](http://unicornmaking.com/) lists. Responded to comments real time. Energy matched audience energy.​ \n\nWeek one Saturday launch grabbed twenty-three customers. Month one hit twelve hundred MRR from forty-one users. Month four reached four thousand MRR serving one hundred thirty-two customers. Same hours weekly. Different distribution. Saturdays let me ride Reddit momentum. Nightly posts died in low-traffic hours. [FounderToolkit](http://unicornmaking.com/) tracked eighty-nine side projects. Saturday launchers averaged four point one percent conversion. Nightly launchers zero point nine percent. Timing matched audience availability. Side projects need focused blocks not scattered hours. Daily discipline sounds good. Weekly momentum works better. \n\nProtect one full day. Build and distribute same day. Let feedback compound while momentum hot. Nightly coding creates exhaustion theater not progress. Side projects win on energy management not daily streaks. \n\nStop grinding nights. Block Saturdays. Launch fresh when audience awake. \n\nBurning out on nightly side project grind?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r74jir/built_side_project_nights_launched_weekends/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5v793d",
          "author": "Crypto_Ping",
          "text": "The Saturday distribution block is smart. I batched my Reddit prospecting the same way used Reppit AI to find the right conversations to jump into instead of manually scrolling subreddits hoping to get lucky.\n\nFocused blocks + right timing beats grinding every time.",
          "score": 9,
          "created_utc": "2026-02-17 13:58:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5usbu3",
          "author": "7_Eagles",
          "text": "This is such a real takeaway. I tried the nightly grind for months and most of it was just fixing rushed work later. When I moved everything into one long focused day, I shipped cleaner features and actually promoted properly instead of throwing links into dead hours. Audience timing is underrated. And of course momentum comes from depth and not squeezing work into exhaustion.",
          "score": 1,
          "created_utc": "2026-02-17 12:27:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5usi33",
          "author": "MuslimKhan3040",
          "text": "The momentum point is real. when you build and distribute same day, it actually feels alive.",
          "score": 1,
          "created_utc": "2026-02-17 12:29:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ut1gg",
          "author": "buratnanakakaurat",
          "text": "Did you ever feel like you were losing progress by not working on it during weekdays?",
          "score": 1,
          "created_utc": "2026-02-17 12:32:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5uu889",
              "author": "Expensive-Treacle-88",
              "text": "Initially yes, but the quality of output on Saturdays was so much higher that it more than compensated for the gap.",
              "score": 1,
              "created_utc": "2026-02-17 12:40:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5utkw3",
          "author": "bala523",
          "text": "side projects need intensity, not just consistency.",
          "score": 1,
          "created_utc": "2026-02-17 12:36:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vebt8",
          "author": "Far_Move2785",
          "text": "Solid pivot from scattered to focused work. Those nightly sessions always feel productive but kill real momentum.\n\nThis might not be your exact problem but I had huge conversion issues too. Turned out most of my drop off was from in-app browsers.\n\nWhen people click ads on Instagram/Facebook/TikTok they land in those app browsers and those things are terrible for checkout. No credit card autofills, no Apple Pay, and way slower.\n\nMy conversion was 1.2% in those browsers vs 4% in Safari.\n\nFix was routing people to their real browser before checkout. Saw 15% revenue lift from same ad spend.\n\nCheck your analytics for conversion by browser. If Instagram or Facebook is way lower than Safari that's your leak.\n\nhttps://tryhoox.com handles the redirect automatically if you want to test it",
          "score": 1,
          "created_utc": "2026-02-17 14:36:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vhcww",
          "author": "Pineapplebook",
          "text": "Maybe you can try this app of mine? Its a free stock research tool: https://www.omnistockapp.com/",
          "score": 1,
          "created_utc": "2026-02-17 14:52:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5x57uj",
          "author": "schuylerwhet",
          "text": "“This is a great case study on focused execution. The conversion rate difference (4.1% vs 0.9%) is huge.\n\nOne thing that can amplify those Saturday launches even more is design quality. I’ve found that directories with premium design convert significantly better because they signal authority from the first impression. That’s why I built Swiss Directory (swissdirectory.vercel.app) - to give directory builders a foundation that looks like a brand, not a template. When you’re doing focused Saturday launches, having that design quality can really boost those conversion numbers you’re tracking.”",
          "score": 1,
          "created_utc": "2026-02-17 19:40:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5y0eb2",
          "author": "HalfEmbarrassed4433",
          "text": "same experience. used to do the 2 hour nightly thing and most of that time was just remembering where i left off the night before. switching to longer blocks on weekends made a massive difference, especially for distribution since you can actually respond to comments and ride the momentum in real time instead of posting at midnight and waking up to a dead thread",
          "score": 1,
          "created_utc": "2026-02-17 22:07:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ykjff",
          "author": "kubrador",
          "text": "grinding at 11pm after work is just paying to feel tired. one focused saturday beat five months of zombie coding.",
          "score": 1,
          "created_utc": "2026-02-17 23:54:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6es2y",
      "title": "Google Overview is crediting the wrong brand for my product. What actually moves the needle?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r6es2y/google_overview_is_crediting_the_wrong_brand_for/",
      "author": "MarcusUranus",
      "created_utc": "2026-02-16 16:48:03",
      "score": 25,
      "num_comments": 9,
      "upvote_ratio": 0.97,
      "text": "I run a small business and something weird is happening.\n\nIf I search my business name, Google Overview it recommends a competitor instead of me. It’s like it thinks they’re the “best option” for my own brand query.\n\nWhat I’ve done so far:\n\n* Updated homepage + About page with clearer wording\n* Fixed basic stuff (titles, headers, internal links)\n* Added schema (Organization/LocalBusiness)\n* Claimed/cleaned Google Business Profile\n* Got a couple new local citations and mentions\n\nStill happens.\n\nFor anyone who’s actually fixed this, what moved the needle?\n\n* More backlinks? From where?\n* More brand mentions across the web?\n* Specific pages you created \\\\?\n* PR/local press?\n* Time and consistency?\n\nI’m not looking for hacks. I just want to stop losing customers to an answer that’s wrong. If you had 30 days to correct it, what would you do first?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r6es2y/google_overview_is_crediting_the_wrong_brand_for/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5plbgw",
          "author": "gandalfthesupagrey",
          "text": "i used this tool [rebelgrowth](https://youtu.be/ln-YbvOZnbk) and has been doing well for me",
          "score": 1,
          "created_utc": "2026-02-16 16:51:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5plk2v",
              "author": "MarcusUranus",
              "text": "I'll check it out thx",
              "score": 1,
              "created_utc": "2026-02-16 16:52:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5pltk9",
                  "author": "chuchu83688",
                  "text": "yeah you have to try and show up in youtube and reddit and any other platforms the search engines like to cite and summarize",
                  "score": 1,
                  "created_utc": "2026-02-16 16:54:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5pliaw",
          "author": "-listnr",
          "text": "I just got a text because this says ‘brand mentions’ in it, I think brand mentions are huge and being able to monitor them properly. \n\nI just added a collab support feature too so that you can have groups of people engaging when you brand is mentioned.",
          "score": 1,
          "created_utc": "2026-02-16 16:52:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qkec3",
          "author": "Adcero_app",
          "text": "this is a Knowledge Graph entity problem, not really a traditional SEO problem. Google's Overview pulls from its understanding of *what your brand is*, and if a competitor has stronger entity signals, Google associates your brand query with their category.\n\nthe things that actually moved the needle for me in a similar situation: making sure every directory listing (Crunchbase, industry directories, social profiles) uses the exact same brand name and description. Google triangulates from all of these to build its entity understanding. if your LinkedIn says one thing and your GBP says another, you're diluting signals.\n\nalso, branded content on third party sites matters more than your own site for this. guest posts, interviews, or even just getting mentioned in a listicle with your brand name clearly attributed to your product category.",
          "score": 1,
          "created_utc": "2026-02-16 19:34:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r4vhf",
          "author": "Old_Lab1576",
          "text": "I had this exact thing happen Google didnt trust my brand entity yet not a backlink problem more an entity understanding problem what fixed it was consistency everywhere same business name same description same category repeated across profiles directories socials and especially pages about the brand I also created a dedicated about the company page and a founder page and linked them everywhere after a few weeks Google stopped showing competitors on my brand query basically you need to teach Google that your name is a thing not just a keyword",
          "score": 1,
          "created_utc": "2026-02-16 21:15:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r7he3",
          "author": "useomnia",
          "text": "Google’s probably mixing up your brand entity. Tighten the same name and description everywhere, publish one stupidly clear what is Brand page, then get 2 real third party mentions that spell out Brand does X. Give it a couple weeks.",
          "score": 1,
          "created_utc": "2026-02-16 21:27:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s00j5",
          "author": "amberjletang",
          "text": "Google has an identity conflict in its Knowledge Graph. Because your brand signals overlap with a competitor, the algorithm treats you as a secondary entity.\n\nMetadata and headers won't fix this. You need to focus on Data Integrity by using aggressive schema nesting to create a unique digital footprint. This builds an architectural wall between your brand and theirs.\n\nI focus on building these deterministic identity layers so search engines stop guessing. You need to prove your business is the primary authority for its own name.",
          "score": 1,
          "created_utc": "2026-02-16 23:57:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sricf",
          "author": "HarjjotSinghh",
          "text": "wow google's got it wrong - let's make them see the light!",
          "score": 1,
          "created_utc": "2026-02-17 02:40:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6ava4",
      "title": "Which Link Building Service Actually Delivers Quality Links?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r6ava4/which_link_building_service_actually_delivers/",
      "author": "MuslimKhan3040",
      "created_utc": "2026-02-16 14:20:55",
      "score": 25,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "We’ve been scaling SEO as a primary acquisition channel over the past year, and link building has easily been the hardest piece to get right.\n\nContent and technical SEO were straightforward. But links? Completely different story.\n\nWe tested a mix of approaches:\n\n- Hiring freelancers for outreach\n\n- Doing manual outreach in-house\n\n- Using a few well-known agencies\n\n- Even tried some PR-style campaigns\n\nMixed results overall. Some decent placements, but also a lot of overpriced links on sites that didn’t move rankings at all.\n\nRecently, I’ve been seeing people in growth and SEO communities mention [GetMoreBacklinks](http://getmorebacklinks.org), especially in the context of contextual placements and niche-relevant outreach.\n\nBefore committing more budget, I wanted to ask here:\n\n- Has anyone used them (or similar services) and seen actual ranking or traffic impact?\n\n- What should I realistically expect in terms of cost vs ROI?\n\n- Are agencies worth it, or is in-house outreach still the best route for growth-stage companies?\n\nNot looking for spammy guest posts or PBNs - only real placements that drive authority and growth.\n\nWould appreciate honest experiences, good or bad.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r6ava4/which_link_building_service_actually_delivers/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5ou6qf",
          "author": "aviclrz",
          "text": "We used GetMoreBacklinks early when our domain was still new. It didn’t magically rank pages overnight, but it helped get us out of the invisible phase and crawl frequency picked up a lot.",
          "score": 2,
          "created_utc": "2026-02-16 14:41:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qndmn",
              "author": "Space-Possible",
              "text": "how do you know if your website is crawled or not? (sorry if it’s a stupid question)",
              "score": 1,
              "created_utc": "2026-02-16 19:49:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5oso3z",
          "author": "centurytunamatcha",
          "text": "Agencies can work, but only if you’re clear about which pages they’re building links to. Random placements to the homepage didn’t do much for us.\n\n",
          "score": 1,
          "created_utc": "2026-02-16 14:33:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5oti0i",
          "author": "Bubalis_Bubalus",
          "text": "Tbh the biggest ROI came when we combined directory/foundation links with internal linking fixes. Links alone weren’t enough until structure was solid.",
          "score": 1,
          "created_utc": "2026-02-16 14:37:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ouk2m",
          "author": "AcadPhM",
          "text": "For quality links you should stay away of link marketplaces. Today quality in link building means genuineness and relevance of the link. If you don't have the resources (or availability) for manual outreach, I recommend HARO-type platforms and CBALB (Citation-Based Academic Link Building). ",
          "score": 1,
          "created_utc": "2026-02-16 14:43:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zw4zh",
              "author": "mikkel2022",
              "text": "Sounds  pricey",
              "score": 1,
              "created_utc": "2026-02-18 04:21:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qwmbp",
          "author": "decebaldecebal",
          "text": "Honestly you can do this yourself, but it does take like 3-4 hours once you have all the logos, descriptions etc prepared.\n\nThere is a list of directories/sties you can submit at [listingcat.com](http://listingcat.com) (not affiliated)\n\nThere are honestly a lot of products on the market, used one myself but can't recommend since DR (domain rating) didn't go up much and I ended up doing the manual work anyway.\n\nIf you do need other options there is also [www.uneed.best/auto-submit](http://www.uneed.best/auto-submit) and [www.startupsubmit.app](http://www.startupsubmit.app), haven't tried these so I can't vouch for though.\n\nThere is also [www.outrank.so/](http://www.outrank.so/) which is a slightly different service",
          "score": 1,
          "created_utc": "2026-02-16 20:34:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zwg1i",
              "author": "mikkel2022",
              "text": "Have you used outrank.so ?",
              "score": 1,
              "created_utc": "2026-02-18 04:23:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o607wpp",
                  "author": "decebaldecebal",
                  "text": "Personally no, just their free trial for the free tools functionality to  get keywords from it :)",
                  "score": 1,
                  "created_utc": "2026-02-18 05:46:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5u7v85",
          "author": "Numerous-Fox-112",
          "text": "but how you know the platforms will give good website lists, I guess it is much more reseller platforms. I guess better to search contextual link building services so they handle your internal linking too",
          "score": 1,
          "created_utc": "2026-02-17 09:34:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r46eg7",
      "title": "First-time founder: How to grow a user base on Reddit without getting banned for \"self-promotion\"?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r46eg7/firsttime_founder_how_to_grow_a_user_base_on/",
      "author": "beloved86",
      "created_utc": "2026-02-14 00:45:26",
      "score": 20,
      "num_comments": 26,
      "upvote_ratio": 0.92,
      "text": "I’m the COO of an AI-agent startup for the music industry. We’ve reached about 1,100 organic signups, but we want to grow more aggressively. Word of mouth worked for a few months; however, we didn't find product-market fit yet, so growth beyond our network has been slow. We started approaching potential users online, but this just does not scale. I’ve seen a lot of advice saying \"go to Reddit,\" but as a new user, the rules feel like a minefield. I fear that even when I’m genuinely answering a question or providing a solution that our product actually solves, it will be flagged as spam because I'm the founder.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r46eg7/firsttime_founder_how_to_grow_a_user_base_on/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5b3yhs",
          "author": "crawlpatterns",
          "text": "Your fear is valid. Reddit can smell self promotion from a mile away.\n\nThe mistake most founders make is showing up with an agenda. If every answer conveniently points back to your product, people will check your profile and connect the dots fast.\n\nThe safer approach is to separate goals. Use Reddit first to learn, not grow. Join niche subs where your users hang out. Answer questions deeply without mentioning your startup at all. Share lessons, mistakes, industry insight. Build karma and history.\n\nWhen it is directly relevant, you can disclose clearly. Something like “I’m building in this space” and then give real value in the comment itself. No links unless explicitly allowed. No DMs. No funnels.\n\nAlso, Reddit is usually better for feedback than distribution. You might get sharper product insights than raw signups. If growth is the only goal, Reddit will feel frustrating. If learning and credibility are the goal, it works much better.",
          "score": 4,
          "created_utc": "2026-02-14 08:03:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ad58o",
          "author": "redit-ed",
          "text": "My story is very similar. I find reddit a very brutal place. Imagine a community literally named as a start-up promotion removes your post because you are promoting your start-up. What an irony lol. \n\nI am doing a lot of self promotion and able to garner 300 users in 2 weeks from everywhere personal, LinkedIn, reddit.\n\nPersonally, I am not sure how to grow it more aggressively. I know the product I have built is a great platform especially by seeing the usage pattern of 300 users on the platform.",
          "score": 3,
          "created_utc": "2026-02-14 04:15:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5esg7f",
              "author": "DragonfruitFar7568",
              "text": "$$$ paid acquisition",
              "score": 1,
              "created_utc": "2026-02-14 22:00:11",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5exhrl",
              "author": "Maleficent_Staff_776",
              "text": "Yea and another problem is that the places where promotion is enabled are usually full of people that also only want to promote stuff and not your target audience lol.\n\nWhat works for me is replying to comments and then reaching out in DMs to people who show interest.",
              "score": 1,
              "created_utc": "2026-02-14 22:28:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5bjjyr",
          "author": "Pristine-Farm7249",
          "text": "I'm working on something in this space so I've been studying this problem a lot. The pattern that actually works comes down to three things:\n\n\n\n1. Monitor, don't hunt. Set up keyword alerts for pain points your product solves, not your product category. \"How do I get more listeners\" not \"music marketing tool.\"\n\n2. Lead with the ugly truth. Share a real mistake or counterintuitive lesson. Nobody flags a founder sharing a failure as spam.\n\n3. Let people come to you. If your comment genuinely helps, people will check your profile. Make sure your profile/bio does the selling so your comments don't have to.\n\n\n\nThe biggest mistake I see founders make is treating Reddit like a distribution channel. It's a trust channel. The ROI is slower but the conversion quality is way higher than paid ads.",
          "score": 2,
          "created_utc": "2026-02-14 10:36:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ei0fm",
          "author": "tiguidoio",
          "text": "add value, don't try to do sales, people need to trust you. \n\nhttps://preview.redd.it/0cixfv9hyijg1.png?width=1378&format=png&auto=webp&s=123196b837a010a5d0d57400a65fa0b2165f71d3\n\n",
          "score": 2,
          "created_utc": "2026-02-14 21:03:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5aor6p",
          "author": "Global-Complaint-482",
          "text": "You literally just need to contribute to communities. Just don’t self promote. I promise it’s not that hard. \n\nIf you’re getting banned, I guarantee you are breaking the subreddit’s rules.",
          "score": 1,
          "created_utc": "2026-02-14 05:45:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5b4h23",
          "author": "Classic_Drag2611",
          "text": "true",
          "score": 1,
          "created_utc": "2026-02-14 08:08:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5b5jz6",
          "author": "Verryfastdoggo",
          "text": "My time to shine. \n\nYou comment and show expertise on comments of relevant posts. \n\nFor example if a contractor is posting about how slow it is in their town. The top post is “avoid Angis list they are all Scams” \n\nYou would post. “You know it’s funny you say that I work with a lot of contractors. Most of them at one point have used Angis list and they all say the same thing. It’s crazy how bad at their job. Most of these guys just need a little SEO and a decent ad campaign and within a few months they get 50+ leads. Actually Angis does me a service”\n\n1. Address their comment and demonstrate understanding of issue. \n2. Make it known you have a solution you’re not offering them. \n3. Social proof example. \n4. Be approachable and set hook. \n \nThe amount of DMs you’ll get on the right comment will blow your mind. It’s the pitch without pitching. \n\nThe the other I call “one man’s mistake can be your misfortune”. \n\nYou post about building something for someone and they ghost or disappear you. It’s going to go to waste and are wondering if someone would try it, never ask for money. More details to this one but lazy",
          "score": 1,
          "created_utc": "2026-02-14 08:18:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5es83g",
              "author": "dill_pickles3",
              "text": "This!",
              "score": 1,
              "created_utc": "2026-02-14 21:58:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5b9g09",
          "author": "Mysterious-Dark8827",
          "text": "You're smart to be cautious, Reddit mods have zero tolerance for founder self-promotion even when it's genuinely helpful. The trick is you need consistent presence without it looking like drive-by marketing, which is basically impossible to do yourself while also running a startup. Here's what actually works for B2B on Reddit: post 3-5 genuinely helpful comments per day in your niche subs (for you that's music production, audio engineering, maybe indie musician communities).\n\nDon't mention your product in 80% of them. Just be useful. The other 20% can include a subtle mention if it truly solves the exact problem someone posted about.\n\nThe key is volume and consistency, not one-off promotional hits. That said, a lot of B2B founders I've seen just hire a done-for-you service to handle this because it's time-intensive and risky. I came across Community Mentions (https://communitymentions.com) recently when researching this exact problem.\n\nThey basically find the conversations for you and handle the posting so you don't have to worry about account bans or looking spammy. Makes sense if you're already stretched thin as a COO. Other route is using a tool like GummySearch or Brandwatch to monitor keywords, then you handle teh engagement yourself.\n\nGives you more control but requires daily effort.",
          "score": 1,
          "created_utc": "2026-02-14 08:56:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bps65",
          "author": "maddiecoder",
          "text": "Reddit is weird about this stuff. I use OGTool for managing my online business and i remember trying to share it in a marketing sub when someone literally asked for tools... got removed instantly.\n\n\n\nWhat worked better:\n\n\\- Answer questions without mentioning your product at all for like 2-3 weeks\n\n\\- Join smaller niche subs where people actually want solutions\n\n\\- DM people who seem interested instead of posting links publicly\n\n\n\nThe mods really do check post history so if all you do is promote your thing, you're done. Also some subs have karma requirements so you cant even post as a new account.",
          "score": 1,
          "created_utc": "2026-02-14 11:35:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bulqa",
          "author": "ultrathink-art",
          "text": "The key is genuinely solving problems in the threads you participate in. Before posting about your product:\n\n1. Build karma first — answer 20-30 questions with actual technical value in your domain subs\n2. Wait 2-4 weeks between helpful comments and mentioning your product (mods track this)\n3. When you do mention it, do it as 'I built X to solve this exact problem' in a thread where someone explicitly asks for solutions\n\nAlso: Most subs have automod rules that silently remove posts from new accounts. Check r/SUBREDDIT/about/rules and look for karma minimums. r/SaaS typically needs 50+ comment karma before posts go live.\n\nThe 'growth hack' is: there isn't one. Authentic participation compounds over months.",
          "score": 1,
          "created_utc": "2026-02-14 12:17:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bxq6o",
          "author": "RobertLigthart",
          "text": "the irony is that you already have 1100 signups and haven't found PMF yet... honestly I'd focus on talking to those users first before trying to scale on reddit. no amount of growth hacking fixes a product people don't stick with",
          "score": 1,
          "created_utc": "2026-02-14 12:42:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cle3j",
          "author": "decebaldecebal",
          "text": "Honest take: if you don't have PMF yet, Reddit isn't going to fix that. Pushing harder on distribution when the product isn't clicking is how you burn through channels before they're useful.\n\nWhat Reddit is good for at your stage is learning. Hang out in music production and artist subs, read what people complain about, and actually reply with helpful stuff. No links, no mentions of your product. Do that for a few weeks and you'll start to notice patterns in what people need.\n\nWhen you eventually do mention your product, the framing matters. \"I built something that does this\" lands completely differently than \"check out our tool.\" One sounds like a person, the other sounds like a brand account. And make sure it's maybe 1 out of every \\~10-15 comments.\n\nBut really, with 1,100 signups and no PMF, I'd spend the time talking to your existing users instead. Figure out which ones are actually getting value and why. That'll tell you who to target and what to say way better than trying to scale Reddit comments.",
          "score": 1,
          "created_utc": "2026-02-14 15:09:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gf956",
          "author": "omidshabab",
          "text": "don’t talk about the product or yourself — just post valuable contents that helps solving a problem — attach a lead magnet that related to your product as a solution — pitch your product as a solution on that lead magnet — but don’t mention that this is your product on the Reddit post — hope this could help you",
          "score": 1,
          "created_utc": "2026-02-15 04:19:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5h59h2",
          "author": "be_bold_bro",
          "text": "Navigating Reddit's self-promotion rules is definitely a minefield for founders, especially when you're genuinely trying to help. We've found success by focusing on identifying high-intent users actively seeking solutions and then crafting genuinely helpful replies that naturally introduce your product. This approach helps avoid bans and scales engagement, which is exactly what our AI-powered tool, Moreach, is built for.",
          "score": 1,
          "created_utc": "2026-02-15 08:07:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5h9wrt",
          "author": "bundlesocial",
          "text": "don't be a nerd and you good",
          "score": 1,
          "created_utc": "2026-02-15 08:52:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hdvea",
          "author": "trainmindfully",
          "text": "If you go to Reddit to “grow users,” you’ll get banned; if you go to understand your users, you’ll grow naturally. The safest path is to participate like a normal member in relevant subreddits for months, answer questions without mentioning your product, share real insights from building in the space, and only reference your tool when it’s directly relevant and clearly disclosed as yours, ideally after you’ve built karma and trust; also, read each subreddit’s rules carefully because some allow transparent self-promo in comments or weekly threads, while others don’t. Think credibility first, distribution second, and Reddit will reward you over time.",
          "score": 1,
          "created_utc": "2026-02-15 09:31:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hmqs2",
          "author": "TheGCmind",
          "text": "Keep advising, helping with lessons from your growth journey's.. good karma!",
          "score": 1,
          "created_utc": "2026-02-15 10:56:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hn36j",
          "author": "RobertLigthart",
          "text": "the trick is genuinely not thinking about your product when you comment. just answer the question like a normal person would. if your product is relevant someone will check your profile eventually... thats how it works. the second you try to force it you get flagged",
          "score": 1,
          "created_utc": "2026-02-15 10:59:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hue18",
          "author": "RighteousRetribution",
          "text": "You nailed the main problem. Most people either over-promote and get banned, or try to avoid any kind of explicit promotion and don't get any real traction.  \n  \nI've been growing on Reddit consistently over the past year, and here are the only 3 repeatable ways I've used to keep getting traction on Reddit:  \n  \n1) Create posts - this one is obvious, and most founders default to this one, but it's very easy to get wrong. You need create posts that BRING VALUE first (unique insight, sharing your journey, what worked, what didn't, etc.) and only then mention your product. If your post lacks in any real value, it will be obvious that you've only created it to promote. Products that solve real problems are a good fit for creating posts since your value prop directly brings value to readers. Products that are fun and don't bring value might not be an ideal fit for CONSISTENTLY getting traction from posting.  \n  \n2) Comment on existing posts where people either explicitly ask for tool suggestions or describe problems your product solves - founders don't usually make the most out of this method, but this can bring crazy traffic too. The reason is because Reddit posts rank on Google, so lots of people can come upon your comment and then check out your product. The strategy here is the same, BRING VALUE first. Only then mention your product since it ties directly to what they're asking. Most founders don't use this strategy consistently because searching for new high-intent posts is time-consuming, but there are tools now that help with this.  \n  \n3) DM leads that showed interest in your product - this one is the most underrated, but it's also quite powerful, especially if you're early stage since this allows you to actually talk 1:1 with your target audience, ask questions, get feedback and iterate on your product. Also DMs can bring you traffic immediately (you DM, they get back to you in \\~1 day), while replying to posts is more of a long-term, compounding game.  \n  \nThese are pretty much the only strategies you need to grow on Reddit. It's not flashy, and it's not immediate. It's an every day commitment to show up and do this consistently. And it's really hard to show up everyday, but there are tools that can help you create a system, and I highly recommend you use one like Bazzly if you're serious about growing on Reddit.\n\nTLDR: Don't pitch, bring value.",
          "score": 1,
          "created_utc": "2026-02-15 12:05:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5i4x1x",
          "author": "AddendumDue7820",
          "text": "Main point: treat Reddit as user research and service, not a promo channel, and you’ll avoid bans while learning your way to PMF.\n\n\n\nIf you’re still pre–product-market fit, use Reddit less for “acquisition” and more for “sharp feedback.” Hang in subs like r/WeAreTheMusicMakers, r/musicians, specific DAW subs, and search stuff like “overwhelmed”, “admin work”, “music marketing”, “sync licensing”, whatever pain you think your agent solves. Jump into threads with 2–3 concrete steps they can try today (templates, outreach scripts, automation ideas), then add a soft line like “I’m building an agent that does X if you want to skip the manual bits.” No links unless someone asks. That usually keeps mods calm.\n\n\n\nKeep a simple doc of which sub, what pain, what response you got; that becomes your PMF radar. I’ve used F5Bot and Mention for alerts; these days I lean on Pulse alongside them to surface high-intent threads and draft first-pass replies so I can stay fast but still personal.\n\n\n\nMain point again: help first, study reactions, and let subtle mentions ride on top of real value.",
          "score": 1,
          "created_utc": "2026-02-15 13:25:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5j3buu",
          "author": "No_Boysenberry_6827",
          "text": "1,100 signups with stalled growth is actually a great place to be because you have data to work with. we hit the same wall and the fix wasn't more manual outreach. it was building a system that learns which messaging converts for your specific audience and scales without you touching it. went from stalled to 4x signups in 8 weeks. the reddit organic play is smart but it has a ceiling. what's your biggest friction right now, the growth stalling or figuring out PMF?",
          "score": 1,
          "created_utc": "2026-02-15 16:30:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5kp7og",
          "author": "evanmrose",
          "text": "The key is to lead with value. I have no doubt that during the creation of your product you generated useful insights so share those. Whatever problem your app solves help people solve it without the app first then when they learn about the app theyll be more likely to convert.",
          "score": 1,
          "created_utc": "2026-02-15 21:17:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s1ugq",
          "author": "amberjletang",
          "text": "The reason founders get banned is that they lead with the solution instead of the architectural problem. If you mention your product, you are a salesperson; if you deconstruct the systemic bottleneck, you are an authority.\n\nScale comes from mapping 'Workflow Friction' in niche subreddits. Instead of pitching your music AI, audit why current industry pipelines are failing. When you provide a high-signal diagnostic of a common pain point, the community will naturally ask for your tool.\n\nStrategic growth on Reddit requires moving from promotion to infrastructure. By positioning yourself as the person who understands the logic of the problem better than anyone else, you create an organic pull that doesn't trigger spam filters.",
          "score": 1,
          "created_utc": "2026-02-17 00:08:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r67edw",
      "title": "How do you audit 200+ prompts across chatgpt/perplexity/claude?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r67edw/how_do_you_audit_200_prompts_across/",
      "author": "SquareDesperate4003",
      "created_utc": "2026-02-16 11:40:06",
      "score": 20,
      "num_comments": 9,
      "upvote_ratio": 0.96,
      "text": "I’m in the middle of a project where I need to see how our brand (and five other competitors) show up across 200+ prompts in chatgpt, perplexity, claude, maybe gemini too.\n\nI made the mistake of starting manually. As in, opening chatgpt, pasting a prompt, copying the answer, switching tabs, repeat. I’m currently on prompt #12 and already staring at my screen like this cannot be how people are actually doing this in 2026.\n\nThere's gotta be a smarter way to do this that doesn't involve manually checking hundreds of queries across multiple platforms. What are people actually using? Agency folks especially, how are you tracking this at scale for multiple clients without losing entire weeks to it? Hire a VA? Is there like a script someone has made that they could share? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r67edw/how_do_you_audit_200_prompts_across/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5ob364",
          "author": "phantom_midnight",
          "text": "We had an intern volunteer to do it for one client before we quickly realized how nonsensical the approach was. Turns out there are LLM visibility trackers and we just never bothered to search for them because we’re collectively stupid lol. I can’t really make a recommendation because we’ve only used one (peec ai). It automates the whole nightmare. Upload your prompt list and it runs everything across chatgpt, perplexity, gemini, claude over and over and track the results.",
          "score": 7,
          "created_utc": "2026-02-16 12:52:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5og43y",
          "author": "Charming-Commander",
          "text": "This is one of those \"the tool pays for itself immediately\"  situations. Even if you're solo, the time you save not manually checking hundreds of prompts or building out a quick software solution is worth whatever the subscription costs. Your time has value.",
          "score": 1,
          "created_utc": "2026-02-16 13:24:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ok619",
          "author": "Real_Bit2928",
          "text": "Manually pasting prompts will not scale, so script against the APIs, normalize outputs into structured data, and diff responses automatically instead of burning weeks tab switching.",
          "score": 1,
          "created_utc": "2026-02-16 13:47:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5oli5s",
          "author": "Mandazinomics",
          "text": "Were you planning on auditing just once? Because AI answers change constantly. What’s true this week isn’t true next week. So manual aditing is not just painful, It’s also entirely pointless because you’d have to keep redoing it.",
          "score": 1,
          "created_utc": "2026-02-16 13:55:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5or94r",
          "author": "Fit-Donkey-3181",
          "text": "Yeah, we've also been messing with some of the Al features from the bigger SEO tools. Hella expensive though.",
          "score": 1,
          "created_utc": "2026-02-16 14:25:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s1a84",
          "author": "amberjletang",
          "text": "Auditing 200+ prompts manually is a systemic failure in data collection. You aren't just losing time; you are losing the ability to compare versions across models accurately.\n\nYou need an 'Automated Audit Layer' that pulls API responses into a centralized dashboard for side-by-side analysis. Most agencies fail here because they treat AI as a chat interface rather than an API data source.\n\nMy approach involves building deterministic audit systems. If you don't have a script to batch process these queries, you're paying for human error. Once you shift to an API-first architecture, this task moves from a week of work to a few minutes of processing.",
          "score": 1,
          "created_utc": "2026-02-17 00:05:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u1l0b",
          "author": "Sirius-ruby",
          "text": "yeah manual checking is brutal, I feel your pain on that. I've done similar audits and by prompt 15 you start questioning your life choices. For what it's worth, I came across Brandlight (https://brandlight.ai) recently and it seems built specifically for this.\n\nFrom what I understand it monitors brand mentions across all the major AI platforms automatically and can track competitors too, which sounds like exactly what you're trying to accomplish manually right now",
          "score": 1,
          "created_utc": "2026-02-17 08:33:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uqavm",
          "author": "phb71",
          "text": "Use a prompt tracking tool e.g. airefs (not ahrefs) or promptmonitor. It's overkill to do it on multiple llms - focus on chatgpt, that's what most people use.",
          "score": 1,
          "created_utc": "2026-02-17 12:13:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vy34l",
          "author": "pbalIII",
          "text": "Build a tiny eval runner, it's basically SEO rank tracking for LLM answers. You want repeatable runs with metadata, then a scoring layer, not a pile of copied text.\n\n- Put prompts in a CSV with IDs and tags\n- Run across vendors via APIs, promptfoo for CLI, LangSmith or Langfuse for UI and history\n- Perplexity: Sonar API, others: OpenAI, Anthropic, Google\n- Store outputs as JSONL with model, params, timestamp, retrieval mode\n- Score: mention yes or no, who gets recommended, and what domains get referenced\n\nPaid LLM brand-monitor dashboards exist, but you still need reruns and diffs, answers drift with model updates and search. Spend humans on the rubric, not execution.",
          "score": 1,
          "created_utc": "2026-02-17 16:14:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6hs8v",
      "title": "SaaS & App founders/owners: how do you reach real users?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r6hs8v/saas_app_foundersowners_how_do_you_reach_real/",
      "author": "Holiday_Respect9583",
      "created_utc": "2026-02-16 18:34:44",
      "score": 14,
      "num_comments": 30,
      "upvote_ratio": 1.0,
      "text": "Not other builders.\n\nNot devs.\n\nNot people hanging out in SaaS/indie hacker subreddits.\n\nI mean **actual end users**.\n\nHow do you find them **organically** — in relevant communities that aren’t necessarily tech-focused — both on Reddit and social media?\n\nHow do you do it without breaking rules or sounding spammy?\n\nAnd how do you avoid falling for “marketing experts” who promise users but mostly sell hype?\n\n\n\nWould genuinely appreciate your advice.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r6hs8v/saas_app_foundersowners_how_do_you_reach_real/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5qewd8",
          "author": "wandrhealth",
          "text": "Following. We are a medical startup that is B2C so looking to improve end-user reach.",
          "score": 2,
          "created_utc": "2026-02-16 19:08:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qmig5",
              "author": "Holiday_Respect9583",
              "text": "Good luck to you too.",
              "score": 1,
              "created_utc": "2026-02-16 19:44:57",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o5rak61",
              "author": "useomnia",
              "text": "B2C medical is extra spicy because trust is everything",
              "score": 1,
              "created_utc": "2026-02-16 21:42:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5rbxdb",
                  "author": "wandrhealth",
                  "text": "We are founded by a physician and physician assistant so we both have a medical background and both currently work in the ED 🏥 \n\nI believe it gives us a lot of legitimacy! You’re absolutely on the mark when it comes to trust (especially in this day and age)",
                  "score": 2,
                  "created_utc": "2026-02-16 21:49:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5qfrv9",
          "author": "Pristine-Farm7249",
          "text": "I’ve built multiple tools for myself I don’t want to spam here so I won’t be dropping links and stuff but one tool I use to grow my X/Twitter account which is integrated ai assistant and other one I’ve built an analytics tool for Reddit that searches through posts and replies to find you leads with problems you’ve solved. But also I use it for posting on Reddit and being helpful. I guess key is doing organic content and being really helpful. Like that you naturally attract interested people but it takes time an effort and luck. Depends if you are willing to put the work for quite some time",
          "score": 2,
          "created_utc": "2026-02-16 19:12:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5s6scf",
              "author": "MusicTechGearhead",
              "text": "Did you create a profile for your product to reply or did you reply from your personal account?",
              "score": 1,
              "created_utc": "2026-02-17 00:36:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qg2bc",
          "author": "Confident_Box_4545",
          "text": "Reddit and x are the only real platforms. And don't think your gonna post once and get the user no. You post daily a lot give value non stop and the users come.",
          "score": 2,
          "created_utc": "2026-02-16 19:13:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qlgpr",
              "author": "Holiday_Respect9583",
              "text": "What about the others social networks?",
              "score": 1,
              "created_utc": "2026-02-16 19:39:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5twnuo",
                  "author": "Confident_Box_4545",
                  "text": "I would say make your first few sales on the 2 i mentioned and only later branch out when you have sales rolling in and have doubled down.",
                  "score": 1,
                  "created_utc": "2026-02-17 07:47:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5qnoeb",
          "author": "kubrador",
          "text": "you go where they already hang out solving the problem manually. a project management saas founder doesn't fish in r/startups, they lurk in r/projectmanagement or niche subreddits where people are complaining about their current workflow.\n\nreddit's anti-spam rules actually help here. just don't pitch. answer questions in character as someone who uses your thing. drop it naturally when relevant. mods will nuke you if you're obvious about it but \"i built this and it's free to try\" buried in genuine help usually passes.\n\nfor social, tiktok and youtube comments in non-tech niches are goldmines because nobody's marketing there yet. instagram in specific communities too.\n\nif a \"growth expert\" promises users without you naming your specific target community, they're selling placebo. real growth is boring. it's just showing up in the right place consistently and being useful first",
          "score": 2,
          "created_utc": "2026-02-16 19:50:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qt3y2",
          "author": "e_ai_gabriel",
          "text": "I use an AI-powered lead generation tool. I find people who are already requesting the solution I offer and approach them. This tool alerts me very early, within the first few minutes of the post, so I can approach the lead and capture views from the post's readers, which is strongest in the first 2 hours here on Reddit. I'm even the creator of such a tool, and the return is incredible. I even found your post through it while I was monitoring my own leads. This is just proof that there are truly interesting tools for finding qualified leads.\n\nhttps://preview.redd.it/uzgyb3n30xjg1.jpeg?width=2113&format=pjpg&auto=webp&s=01fe89e7b5de9fcb20632578030d7083bbf23944",
          "score": 1,
          "created_utc": "2026-02-16 20:17:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5racp1",
              "author": "Playful_Outcome5435",
              "text": "I also use a lead generation tool for reddit, leadmatically. t scans for those request posts and lets me jump in while the conversation’s fresh.",
              "score": 1,
              "created_utc": "2026-02-16 21:41:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5u4xeh",
              "author": "mikkelatbonnie",
              "text": "Can you send me a link?",
              "score": 1,
              "created_utc": "2026-02-17 09:05:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5uktev",
                  "author": "e_ai_gabriel",
                  "text": "I sent the link via DM so as not to violate the sub's rules.",
                  "score": 1,
                  "created_utc": "2026-02-17 11:30:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5qvprh",
          "author": "decebaldecebal",
          "text": "The trick is you stop thinking like a founder and start thinking like your user.\n\nYour users don't hang out in r/SaaS. They hang out wherever their problem lives. If you built something for real estate agents, they're in Facebook groups complaining about lead follow-up.\n\nThen lurk before you post. Read what people complain about. Use their exact words. When you do contribute, be useful first. \"I built X\" gets ignored. \"I was dealing with Y problem and here's what worked\" gets read.\n\nFor avoiding marketing hype, if someone promises a specific number of users, run. Early growth is ugly and manual. DMing people, joining calls, getting feedback that hurts. It takes a lot of time but I don't think there is another \n\nI struggled with this across multiple products and ended up building a structured framework around it, but the core is simple: go where your users are, listen first, be useful.",
          "score": 1,
          "created_utc": "2026-02-16 20:30:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vwfit",
              "author": "RoleHot6498",
              "text": "I'm a prize for the most useful comment goes to... You. This is solid advice, the changing of the perception from developer to user makes all the difference",
              "score": 1,
              "created_utc": "2026-02-17 16:06:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5r1snk",
          "author": "Zealousideal-Mood469",
          "text": "the biggest shift for me was realizing  \nYour users don’t hang out where builders hang out.\n\nThey hang out where their problems are discussed.\n\nInstead of searching SaaS communities, search\n\n* Industry-specific subreddits\n* Facebook groups tied to professions\n* Niche Discord/Slack groups\n* Local/regional associations\n\nThen don’t sell Observe language first",
          "score": 1,
          "created_utc": "2026-02-16 21:00:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r4mws",
          "author": "greyzor7",
          "text": "Start with organic channels and outbound/DMs (warm).Channels where your ICP is.\n\nTry launching your app on a combo of social media: X/Twitter, Reddit + launch platforms: Product Hunt, Microlaunch. And any channel relevant to your ICP.\n\nRun campaigns, measure all ROIs, then simply double down on what worked. Then keep doing this until you get users & customers.\n\nFix conversions, channel selection, targeting when necessary.",
          "score": 1,
          "created_utc": "2026-02-16 21:13:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ra8m9",
          "author": "useomnia",
          "text": "Builders tend to hang out with other builders because it feels productive. But then the actual users are hanging out in communities where they're frustrated, looking for solutions, and talking about their daily challenges.\n\nPick one specific pain point and position yourself in the places where that pain shows up every single day. I'm not talking about the typical SaaS subreddits. I mean the boring industry-specific communities where real professionals are venting about real problems. Spend a solid week just reading and absorbing. Pay attention to their exact phrasing, the words they use, the way they describe their frustrations. Then start answering questions like a helpful peer who genuinely understands their situation, not like a founder trying to push a product.\n\nif you can't name at least 10 communities where your users complain in plain English about the problem you solve you have a targeting problem. That's a fundamentally different challenge to solve first.\n\nRun the questions your users actually ask through ChatGPT or Google's AI features. When the answers keep citing the same sites and threads over and over, those are your real watering holes. That's where you need to show up first.",
          "score": 1,
          "created_utc": "2026-02-16 21:41:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s0pdq",
          "author": "amberjletang",
          "text": "Actual users aren't in builder subreddits - they are in niche communities solving specific pain points. To find them organically, you have to stop pitching and start auditing. \n\nIdentify a non-tech subreddit where your tool solves a primary friction point. Provide a high-signal diagnostic of their problem without mentioning your link. If your insight proves you understand their workflow better than they do, they will seek out your solution.\n\nI focus on building these organic discovery loops by mapping the 'Cost of Friction' for the end user. When you solve a bottleneck, you aren't a spammer; you are essential infrastructure.",
          "score": 1,
          "created_utc": "2026-02-17 00:01:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5scwkc",
          "author": "No-Common1466",
          "text": "For me, simple DM first in Reddit, X, Facebook Group on communities where your ICP hangs out. Get initial users first and get feedback. The. Switch to inbound lead through SEO and content. I post 3 articles per day in LinkedIn, Substack and medium, and X threads. I use my own tool to get ideas based on users pain points and signals. My site is getting 300 unique visitors daily and I just started doing it consistently 3 days ago. It's a long term process. Articles and SEO not only get your Saas search from Google, it also gets recommended by AIs Like ChatGPT to recommend your tool.",
          "score": 1,
          "created_utc": "2026-02-17 01:12:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tyyuc",
          "author": "Forsaken_Lie_8606",
          "text": "Biggest mistake is starting on Reddit. Your actual users are on Facebook groups, Discord servers for specific niches, and where they complain about existing tools. Search Twitter for people frustrated with competitors - thats your gold mine.",
          "score": 1,
          "created_utc": "2026-02-17 08:08:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5u59k3",
              "author": "mikkelatbonnie",
              "text": "What's the best way to find the discords?",
              "score": 1,
              "created_utc": "2026-02-17 09:09:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5us3qx",
          "author": "sawaisingh",
          "text": "Most founders look for users on platforms.\n\nReal users don’t gather around platforms. They gather around problems.\n\nIf your app solves a specific pain, the question isn’t “where do users hang out?” It’s:\n\nWhere do they complain?  \nWhere do they ask for workarounds?  \nWhere do they compare tools?  \nWhere do they describe frustration?\n\nThose spaces are rarely SaaS subreddits. They’re niche forums, Slack groups, industry communities, local Facebook groups, Discord servers, even comment sections under relevant YouTube videos.\n\nThe second shift is intent. Instead of entering with “how do I promote this?”, enter with “can I understand this problem better?”\n\nThe founders who avoid sounding spammy are usually the ones not trying to sell immediately. They answer questions, share useful breakdowns, and mention their tool only when it genuinely fits.\n\nAs for avoiding hype marketers: if someone promises “users,” ask how they define qualified demand and how they measure retention, not just signups.\n\nUsers are rarely acquired in bursts organically. They compound from repeated visibility inside the right micro-communities.",
          "score": 1,
          "created_utc": "2026-02-17 12:26:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uzh57",
          "author": "Different_Dinner9267",
          "text": "That's the real question honestly. Most founders market to other founders and wonder why they have no real users.\n\nWhat works: find nano/micro creators who already talk to YOUR end users. Not tech influencers, but people in the niche your product actually serves. A budgeting app? Find personal finance creators. A fitness SaaS? Find workout YouTubers. These creators already have the trust of the exact people you're trying to reach.\n\nStart with 10-15 creators, small fixed fee + commission per signup. You get authentic content in front of real users, not other builders scrolling Reddit.\n\nAnd to avoid the \"marketing experts\" selling hype, only work with people who accept performance-based deals. If they won't tie their pay to results, that tells you everything you need to know.",
          "score": 1,
          "created_utc": "2026-02-17 13:13:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o607npi",
          "author": "PageQR",
          "text": "I'm also finding this a huge challenge. Especially as a first-time SaaS/doing-your-own-thing builder. I think the outreach part is definitely a much harder pull than building these days since we have LLMs/AI to build for us. ",
          "score": 1,
          "created_utc": "2026-02-18 05:44:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60cyrp",
          "author": "Bendecx",
          "text": "For B2B we use mainly SEO & GEO also Linkedin.",
          "score": 1,
          "created_utc": "2026-02-18 06:27:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o616dmk",
          "author": "Popular-Penalty6719",
          "text": "Start by identifying where your target audience spends their time. Look beyond tech forums and go to places related to their interests or pain points. Join relevant Facebook groups, subreddits related to specific hobbies or needs, and online communities that align with your product.\n\nEngage authentically. Provide useful insights related to your area. Answer questions, share knowledge, and be a part of the conversation without forcing your product into every discussion. \n\nCreate content that genuinely solves problems for your audience. Focus on forums or platforms where they look for help, not where they consume promotional material. \n\nWatch out for \"marketing experts\" who oversell promise. Many of these strategies sound good but often don’t translate to real users. Instead, aim for clear, actionable steps that foster connection over empty marketing jargon. \n\nFinally, never underestimate word of mouth. It's powerful!! Build a product that people **want to talk about**, then let them spread the word.",
          "score": 1,
          "created_utc": "2026-02-18 10:53:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6337yi",
          "author": "Kpow_636",
          "text": "I built my social media presence first before I built my apps.",
          "score": 1,
          "created_utc": "2026-02-18 17:12:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7yigg",
      "title": "Best AI content moderation tools for detecting coordinated brand attacks & fake reviews on social media",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r7yigg/best_ai_content_moderation_tools_for_detecting/",
      "author": "Aggravating_Log9704",
      "created_utc": "2026-02-18 09:31:03",
      "score": 13,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "I work on marketing and trust & safety for a mid-sized ecommerce platform selling lifestyle products online, and we've seen a clear surge in coordinated disinformation campaigns targeting our brand. Fake posts, misleading reviews, impersonator accounts, and attacks on social media are spreading much faster than we can respond. Manual monitoring is completely overwhelmed and always one step behind.\n\nWe're looking for smarter, proactive solutions using AI content moderation to detect, flag, and contain these campaigns before they damage customers or reputation. The goal is consistent enforcement across platforms without drowning in false positives or over-flagging legitimate user content.\n\nFor other brands or platforms dealing with similar coordinated attacks, has anyone implemented AI systems that actually stay ahead of the curve?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r7yigg/best_ai_content_moderation_tools_for_detecting/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o60y77h",
          "author": "NSRPAIN",
          "text": "If you want AI moderation that actually stays ahead think systems not tools. Use AI for detection across text and behavioral patterns social listening for spread mapping and human review for enforcement. Pure moderation tools will not stop coordinated campaigns because those are distribution problems not just content problems. The brands doing this well treat it like growth analytics in reverse tracking how narratives spread and shutting them down early instead of just deleting bad posts.",
          "score": 6,
          "created_utc": "2026-02-18 09:41:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o610bt4",
          "author": "MetKevin",
          "text": "One reality check... false positives will happen and if you over automate enforcement you will anger legit users fast. Most mature teams keep AI as the triage layer then route edge cases to humans. The real ROI is response speed not full automation.",
          "score": 5,
          "created_utc": "2026-02-18 10:00:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o610xnn",
          "author": "Efficient_Agent_2048",
          "text": "The biggest shift is moving from keyword filtering to behavior analysis. Fake reviews and coordinated attacks usually show weird timing patterns account clusters and amplification loops. AI is actually decent at spotting that.",
          "score": 2,
          "created_utc": "2026-02-18 10:06:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64ci0f",
          "author": "Witty_Habit8155",
          "text": "The accounts and fake reviews is fairly doable with Cotera (think ChatGPT but with tools) - basically you have an AI agent that can go and read reviews (it has a google shopping search and review tool), plus search twitter and stuff. There's also a \"Detect AI Text\" tool that can check to see what percent of the text in the review/post is AI generated. \n\n  \nThis agent prompt gets you most of the way there, just add the \"Detect AI Text\" tool: [https://cotera.co/solutions/marketing/prompts/brand-monitoring](https://cotera.co/solutions/marketing/prompts/brand-monitoring)",
          "score": 1,
          "created_utc": "2026-02-18 20:37:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o665woe",
          "author": "BuildingIncomeDaily",
          "text": "You’re describing a problem a lot of mid-sized platforms are hitting now — coordinated disinformation spreads faster than any manual team can keep up with. AI can help, but it’s about combining detection, context, and proactive moderation, not just keyword flags. Here’s a framework based on what others in ecommerce and social media have successfully done:\n\n1. Real-Time Content Monitoring\nAI-powered NLP models can scan posts, reviews, comments, and user profiles for patterns typical of coordinated campaigns (repeated language, unnatural posting cadence, duplicate media).\nUse embeddings and semantic similarity, not just keywords, so subtle misinformation doesn’t slip through.\nSome teams feed this into streaming analytics (Kafka, Snowflake, or similar) to flag spikes immediately.\n\n2. Coordinated Behavior Detection\nBeyond single posts: look for behavioral fingerprints across accounts.\nRed flags include:\nAccounts created recently posting similar content\nMultiple accounts sharing the same links/media\nRapid comment/review bursts\nGraph-based AI (network analysis) helps detect clusters of suspicious activity even if individual posts look normal.\n\n3. Cross-Platform Intelligence\nSocial media attacks often span multiple channels.\nAggregating data from Instagram, Twitter/X, Reddit, and review sites into one AI pipeline allows the system to spot trends before they peak.\nSome brands use cloud-based content moderation APIs that integrate multiple platforms (Azure, Google, AWS) with their own ML models.\n\n4. Reduce False Positives\nCombine AI signals with confidence thresholds and human-in-the-loop review for high-risk cases.\nTrain your model with historical data of false flags vs true attacks — supervised fine-tuning dramatically reduces over-flagging legitimate users.\nImplement feedback loops: flagged content that is later confirmed as legitimate feeds back into retraining.\n\n5. Proactive Containment\nSome teams automatically quarantine posts for review, limit reach, or temporarily restrict suspicious accounts.\nPrioritize high-impact content: posts with high engagement, high brand mentions, or virality potential.\nAutomation should focus on speed, while critical judgement is reserved for nuanced cases.\n\n6. Integrating With Existing Trust & Safety Workflows\nAPI-first moderation pipelines let you inject AI flags directly into your CRM or platform dashboard.\nAlerts + dashboards = visibility without drowning your team.\n\nUse AI models trained specifically on your brand’s content; generic models often miss subtle attacks or create unnecessary noise.\n\nAI works best when you combine semantic content analysis, coordinated behavior detection, cross-platform intelligence, and human-in-the-loop review. Start by mapping your high-risk vectors, then deploy models that flag suspicious clusters, not just individual posts. Over time, retraining on confirmed attacks vs false positives is what keeps AI ahead.",
          "score": 1,
          "created_utc": "2026-02-19 02:17:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r945d8",
      "title": "I will create a free launch video for the first 50 startup/projects that comment",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r945d8/i_will_create_a_free_launch_video_for_the_first/",
      "author": "Different-Coat-652",
      "created_utc": "2026-02-19 16:42:33",
      "score": 13,
      "num_comments": 47,
      "upvote_ratio": 0.94,
      "text": "Hello founders and builders,\n\nI'm the creator of Ozor, a tool that converts your product ideas, URLs, or descriptions into simple videos in about 60 seconds. No editing required, just basic videos to promote your project.\n\nTo support the community and keep improving my product, I'll make a free custom launch video for the first 50 startups or side projects that comment below.\n\nHere's how it works:\n\n* Leave a comment with a brief description of your project (e.g., \"Recipe generator app for busy parents\") and a link to your site or landing page if available.\n* I'll create a 30-60 second video based on that, with standard visuals, and elements to help with sharing.\n* It will be sent within 48 hours. No obligations, but a mention would be appreciated if you like it.\n\nWhy? Starting a project can be challenging, and a video can help increase visibility on platforms like X or LinkedIn.\n\nCheck Ozor AI for examples.\n\nLimited spots! comment now if interested. Thanks!\n\n  \n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r945d8/i_will_create_a_free_launch_video_for_the_first/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o69n9ym",
          "author": "Scott_Jaeggi",
          "text": "Really nice way to promote your tool :)  \n  \n[usefeedback.dev](http://usefeedback.dev)\n\nIs a SaaS tool to help gather feedback from early customers easier and with matching UI",
          "score": 2,
          "created_utc": "2026-02-19 16:46:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6afs4u",
              "author": "Different-Coat-652",
              "text": "Thanks! Hey, I'm interested! Just messaged you",
              "score": 1,
              "created_utc": "2026-02-19 19:01:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o69qdfc",
          "author": "PoemCivil7458",
          "text": "Original idea to promote your business, kudos\nInterested to see what you can do with ours\n\nhttps://www.sublineapp.com\n\nSubline is a fashion discovery/shopping platform for finding pieces from small, independent, and/or sustainable brands. It uses a tinder-like UI where users swipe right or left on items and our algorithm learns from user preferences and recommend them stuff they might like.",
          "score": 2,
          "created_utc": "2026-02-19 17:01:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6alie6",
              "author": "Different-Coat-652",
              "text": "Thanks! I will be happy to create a video for your company. Just messaged you",
              "score": 1,
              "created_utc": "2026-02-19 19:29:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o69rirw",
          "author": "TooOldForShaadi",
          "text": "Am gonna add you to [my list](https://github.com/zupcode-com/awesome-free-services-for-your-next-startup-or-saas?tab=readme-ov-file) this week. Hope you don't mind",
          "score": 2,
          "created_utc": "2026-02-19 17:07:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6anyu9",
              "author": "Different-Coat-652",
              "text": "Go ahead, my feelings are still intact 🙂",
              "score": 1,
              "created_utc": "2026-02-19 19:41:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o69x4ur",
          "author": "Glass_Scar4888",
          "text": ">",
          "score": 2,
          "created_utc": "2026-02-19 17:34:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a1d1v",
          "author": "shivangibedi",
          "text": "Going to add you list as well",
          "score": 2,
          "created_utc": "2026-02-19 17:54:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ao2f7",
              "author": "Different-Coat-652",
              "text": "No worries, take care!",
              "score": 1,
              "created_utc": "2026-02-19 19:41:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6a32u8",
          "author": "Practical_Fruit_3072",
          "text": "Awesome",
          "score": 2,
          "created_utc": "2026-02-19 18:02:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6aluel",
              "author": "Different-Coat-652",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-02-19 19:30:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6a6oqc",
          "author": "techieram7_",
          "text": "https://myhandle.in\nHelps micro fitness creators on Instagram identify high-potential leads from their DMs.\nIt analyzes incoming messages, filters serious prospects from the clutter, and delivers qualified leads directly to the creator’s WhatsApp, making it easier to continue conversations and convert them into paying clients.",
          "score": 2,
          "created_utc": "2026-02-19 18:19:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6alyy9",
              "author": "Different-Coat-652",
              "text": "Nice! Just DMed you",
              "score": 1,
              "created_utc": "2026-02-19 19:31:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6a7fv9",
          "author": "RecognitionHot9149",
          "text": "Journal Scroll - Write/journal to Doom Scroll. Uses camera to watch/ensure the user is writing/journaling before being able to use social media.   \nSite is only available locally so not available to public yet;",
          "score": 2,
          "created_utc": "2026-02-19 18:22:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6amd05",
              "author": "Different-Coat-652",
              "text": "Perfect. It'll be great to share some screenshots of your website so the agent has more context about your branding. I just dropped you a DM",
              "score": 1,
              "created_utc": "2026-02-19 19:33:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ab61s",
          "author": "Certain_Lion_6643",
          "text": "Hoppin is a live foot traffic monitoring business for businesses, we install discreet hardware at entranceways and then use AI to analyze and provide recommendations to business owners, helping them reduce costs and increase revenue.",
          "score": 2,
          "created_utc": "2026-02-19 18:40:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6amglm",
              "author": "Different-Coat-652",
              "text": "Look's interesting! Just DMed you",
              "score": 1,
              "created_utc": "2026-02-19 19:33:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ab7m6",
          "author": "ChainAccomplished425",
          "text": "You got me curious!  \nI build the app [Qota](https://www.getquota.app).  \nHere's my \"elevator pitch\" about what it does:\n\nSplitting expenses with your partner or roommate shouldn't cause arguments. Qota lets you scan any receipt and our AI instantly recognizes every item — then you split each one individually with a slider, not just a flat 50/50. No subscription: you only pay when you scan, from as little as 3 cents. Available on Android and as a PWA, GDPR-compliant, servers in Germany.Splitting expenses with your partner or roommate shouldn't cause arguments. Qota lets you scan any receipt and our AI instantly recognizes every item — then you split each one individually with a slider, not just a flat 50/50. No subscription: you only pay when you scan, from as little as 3 cents. Available on Android and as a PWA, GDPR-compliant, servers in Germany.\n\nScan the receipt. Split it fairly. Done.",
          "score": 2,
          "created_utc": "2026-02-19 18:40:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ampqa",
              "author": "Different-Coat-652",
              "text": "Amazing! I'll be happy to create a video for you. I just sent you a message",
              "score": 1,
              "created_utc": "2026-02-19 19:34:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6aduoo",
          "author": "undrbiddev",
          "text": "Undrbid — demand-first marketplace where sellers compete for your business instead of buyers searching and negotiating manually.\n\nExample use case:\nA homeowner submits a stump removal request, local providers bid before a live countdown deadline, and the buyer selects the best offer.\n\nIn an early test, a car dealer lowered their price from 5% off MSRP to 17.1% off once competition and a deadline were introduced.\n\nLive site: https://undrbid.com",
          "score": 2,
          "created_utc": "2026-02-19 18:52:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6amt6j",
              "author": "Different-Coat-652",
              "text": "Hey! DMed you!",
              "score": 1,
              "created_utc": "2026-02-19 19:35:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ag5os",
          "author": "prashant_b",
          "text": "Arokiyam – A healthcare booking platform that lets patients instantly book verified doctors, labs, and hospitals with live token tracking, emergency priority access, and transparent ₹10 appointment fees. It also helps providers grow with zero-cost promotion and in-app discovery.  \n[https://arokiyam.in/](https://arokiyam.in/?utm_source=chatgpt.com)  \n[https://play.google.com/store/apps/details?id=com.marchehealthcare.doctorapp](https://play.google.com/store/apps/details?id=com.marchehealthcare.doctorapp)",
          "score": 2,
          "created_utc": "2026-02-19 19:03:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aha28",
          "author": "redit-ed",
          "text": "[Lampzi.com](http://lampzi.com) - A resume builder platform.",
          "score": 2,
          "created_utc": "2026-02-19 19:08:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ai7rp",
          "author": "atceb",
          "text": "We are building an AI-powered app that helps people stay present in the lives of those they care about.\nYou write a simple sentence like “My friend has an exam next Friday” or “My sister is starting a new job,” and the app turns it into gentle, well-timed reminders to check in, wish them luck, or ask how it went.\n\nIt’s not a to-do list or a social network — just a private tool designed to help you remember important moments and show up more consistently for the people that matter.\nwww.trywhisp.app",
          "score": 2,
          "created_utc": "2026-02-19 19:13:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aoqxl",
          "author": "andrebravado",
          "text": "I'll bite - quotecraft.co - conversational quoting app for uk tradesmen with live pricing lookup",
          "score": 2,
          "created_utc": "2026-02-19 19:44:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aorxp",
          "author": "pawreserve",
          "text": "super interesting! [pawreserve.pro](http://pawreserve.pro) \\- PawReserve helps independent pet care businesses manage bookings, clients, and revenue, without the complexity of enterprise software. It learns how your business operates and adapts to you.",
          "score": 2,
          "created_utc": "2026-02-19 19:44:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6arvvo",
          "author": "EnvironmentalCap1492",
          "text": "Interesting proposal.I'm building my newsletter documenting my journey from 0 to Growth Marketer. I don't have my own landing page yet (just Substack), but once I have one in a few weeks, this could be useful for distribution.Do videos perform better on LinkedIn or Twitter in your experience?",
          "score": 2,
          "created_utc": "2026-02-19 19:59:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aw4f3",
          "author": "SWD_HABRAH",
          "text": "Docsmith offline productivity compliance tools building as extension for browser \nwww.Docsmith.tools",
          "score": 1,
          "created_utc": "2026-02-19 20:20:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ayzg3",
          "author": "dertobi",
          "text": "Love this initative, [https://lobsterlair.xyz](https://lobsterlair.xyz) \\- a hosted AI Agent based on OpenClaw",
          "score": 1,
          "created_utc": "2026-02-19 20:34:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b0q9m",
          "author": "blitztask",
          "text": "That's really cool! Definitely interested in this :D\n\n[blitztask.com](https://blitztask.com)\n\nhelps increase productivity using the Timeboxing method, as we like to put it this way: Brain Dump, Prioritize, Schedule.",
          "score": 1,
          "created_utc": "2026-02-19 20:43:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b1762",
          "author": "Iftikharsherwani",
          "text": "https://invoicequick.app\nTurn WhatsApp messages, emails, and images into invoices in under 30 seconds. TG: Freelancers, consultants, and agencies.",
          "score": 1,
          "created_utc": "2026-02-19 20:45:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b1hlz",
          "author": "TheseMajor5418",
          "text": ">",
          "score": 1,
          "created_utc": "2026-02-19 20:47:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b5czs",
          "author": "runthetic",
          "text": "[runthetic](https://runthetic.com) Garmin focused Daily suggested workouts tailored to your goal and recent training data.",
          "score": 1,
          "created_utc": "2026-02-19 21:05:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bbbc4",
          "author": "Gullible-Concept2561",
          "text": "Nice :)  \n  \n[https://zapisowo.pl/](https://zapisowo.pl/)\n\nZapisowo helps extracurricular activity organizers replace spreadsheets, cash payments and manual coordination with a modern enrollment and payment system.\n\nOrganizers can manage classes, participant lists, payments and communication from one dashboard.\n\nWe’re building a two-sided marketplace that will connect parents with trusted local activity providers.",
          "score": 1,
          "created_utc": "2026-02-19 21:34:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bev0d",
          "author": "pvfakten",
          "text": "https://www.oidapost.com/\nSocial media on autopilot for vibe coders. \nLaunch in 2 weeks. Waitlist is open :)",
          "score": 1,
          "created_utc": "2026-02-19 21:52:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bukqa",
          "author": "ApartNote2940",
          "text": "Hey , nice to meet you . Message number 41: my app is https://libretti.app/ ( book tracker with social platform in it )",
          "score": 1,
          "created_utc": "2026-02-19 23:16:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bvnvi",
          "author": "mattfrasernz",
          "text": "[https://www.octero.app](https://www.octero.app)\n\nStrava for musicians. ",
          "score": 1,
          "created_utc": "2026-02-19 23:22:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6c7333",
          "author": "BestDay8241",
          "text": "Voice Sheet lets you add entries to your Google Sheets with simple voice. \n\nhttps://voicesheet.app",
          "score": 1,
          "created_utc": "2026-02-20 00:28:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cmwy3",
          "author": "Ali729",
          "text": "Hello - seems like a good idea - hopefully it works out for you \nBasically I have the only brand in Pakistan providing renewed laptops and Chromebooks with 1-year warranty, A+ grading, and premium packaging (as nearly 95% of the population can't buy new, and remain stuck with low-quality used ones without any warranty).\nHere is my website: www.acetech.pk",
          "score": 1,
          "created_utc": "2026-02-20 02:05:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cs40y",
          "author": "deadfire55",
          "text": "Thanks for doing this! An app to get notified when the aurora is visible near you or on flights that you're going to be on https://apps.apple.com/us/app/aurora-buddy/id6757205504",
          "score": 1,
          "created_utc": "2026-02-20 02:36:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ctm48",
          "author": "subaru_kun33",
          "text": "This is web application to tailor your resume for every job description using Ai. And also it keeps tracks of your applications and everything. With a built-in job board so that you guys can share job opportunities with each other. We can really use one..\n\nhttps://moltjobs.lovable.app/",
          "score": 1,
          "created_utc": "2026-02-20 02:46:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7wwis",
      "title": "Had an awful experience with an AEO tracking platform, what's a good alternative?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r7wwis/had_an_awful_experience_with_an_aeo_tracking/",
      "author": "Academic_Way_293",
      "created_utc": "2026-02-18 07:49:46",
      "score": 12,
      "num_comments": 8,
      "upvote_ratio": 0.82,
      "text": "So I finally had enough with my first AEO tracking tool (Profound) Their support team was really unhelpful and kept putting off my requests for weeks, even though I was subbed to their most premium subscription..\n\nAnyway, I'm done with them and now I'm trying to look at alternatives. I wanted to go with Airops at first but I saw several bad reviews, so now I'm leaning towards something like Promptwatch.\n\nBut before making a decision, I wanna know if you guys have better alternatives? (Bonus points if it has content generation too, not just tracking)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r7wwis/had_an_awful_experience_with_an_aeo_tracking/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o60mshr",
          "author": "Used_Rhubarb_9265",
          "text": "Been there, stuck with a lame tool is the worst.\n\nPromptwatch is solid for tracking + gen, but also check out GrowTool and TrackerAI — both have way better support and actually ship features fast.\n\nIf content gen matters, TrackerAI’s built-in prompts are worth it. Make sure to test support before committing again.\n\nGood luck 👌",
          "score": 1,
          "created_utc": "2026-02-18 07:54:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60mu9y",
          "author": "Background_Neck9690",
          "text": "nice to see it isn't just me, luckily i cancelled my Profound way before the next bill payment. I swear by Promptwatch, and since it looks like you're looking for a responsive support team, that's exactly what they offer. I had an issue at 2am and I got a response within 5 mins (not a generic AI chatbot but a real tech support staff)",
          "score": 1,
          "created_utc": "2026-02-18 07:54:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o61yzqd",
          "author": "Forsaken_Lie_8606",
          "text": "ngl ive been in a similar situation before, switched from a crappy aeo tracking tool to something way better, so i feel you. i used to pay like 500 bucks a month for a tool that was supposed to help me optimize my ad campaigns, but the support was trash and it didnt even deliver the results they promised. anyway, i ended up switching to adplexity and its been a game changer, their support team is actually helpful and the tool itself is way more intuitive. ngl, i was a bit skeptical at first, but they have a free trial so you can test it out before committing to a paid plan, might be worth checking%sout just my 2 cents",
          "score": 1,
          "created_utc": "2026-02-18 14:03:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62vace",
          "author": "Ranocyte",
          "text": "man that sucks about the support issues. hate when tools ghost you after taking the money\n\nfull disclosure: i'm actually building a competitor called getspotted specifically cause i wasn't happy with the current data accuracy in other tools\n\nto answer your point on content gen -> we don't generate the text (i honestly just use claude/gpt for that), BUT we focus on the outreach part\n\nbasically instead of just tracking rankings, my tool finds the emails of the authors/sites that do rank so you can actually contact them. feel like that's the missing link in most AEO tools right now\n\nhappy to hook you up with some free credits if you wanna test it out vs profound. no pressure though",
          "score": 1,
          "created_utc": "2026-02-18 16:37:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6334xz",
          "author": "cheerioskungfu",
          "text": "Profound demos are great, but the actual product is less so. We moved to limy and the difference in data quality was immediate. Its llms traffic attribution actually works, unlike the others. ",
          "score": 1,
          "created_utc": "2026-02-18 17:12:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66jehb",
          "author": "amberjletang",
          "text": "The lack of support is usually a sign that a tool is scaling too fast for its own infrastructure. If you're looking for AEO tracking that doesn't just give you raw data but actually helps with the content side, you might want to look into tools that focus on entity-based SEO. \n\nThe shift from standard keyword tracking to AEO means you need a platform that understands how LLMs are sourcing their citations. Instead of just Promptwatch, look for something that maps your topical authority. It makes the content generation side much more effective because you’re building for the knowledge graph rather than just a search result page.",
          "score": 1,
          "created_utc": "2026-02-19 03:37:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o670by6",
          "author": "botapoi",
          "text": "honestly if you're looking to build your own tracking setup instead of relying on another third party, i've seen people build custom dashboards on blink that track whatever metrics they need, gives you way more control than dealing with support tickets. might be worth exploring before committing to another platform with the same issues",
          "score": 1,
          "created_utc": "2026-02-19 05:33:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o677uuu",
          "author": "o1got",
          "text": "this is a tough spot because the AEO tooling space is still super early and fragmented.  \n  \nFrom what I've seen, most of the current platforms are really just starting to figure out what metrics even matter for AI answer optimization. Like, are you tracking citation appearances? Brand mentions? Position in responses across different AI engines? The problem is every tool seems to measure slightly different things, so switching means you're kind of starting your baseline over.  \n  \nI don't have personal experience with Promptwatch but I'd be careful about going all-in on something that combines tracking + content generation. Those tend to do both things in a mediocre way instead of one thing really well. Might be worth using separate tools even if it's a bit more annoying to manage.  \n  \nThe real question is what you actually need from tracking. If you're trying to measure brand visibility in AI responses, you probably want something different than if you're trying to optimize for specific product queries. I'd figure that out first before committing to another annual plan or whatever.",
          "score": 1,
          "created_utc": "2026-02-19 06:34:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7j644",
      "title": "How are you storing long-term context for agents?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r7j644/how_are_you_storing_longterm_context_for_agents/",
      "author": "Kabhishek92",
      "created_utc": "2026-02-17 21:21:02",
      "score": 12,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Anyone else feel like most AI agents + automations are just… fancy goldfish? \n\nThey look smart in demos.  \nThey work for 2–3 workflows.  \nThen you scale… and everything starts duct-taping itself together.\n\nWe ran into this hard.\n\nAfter processing 140k+ automations, we noticed something:\n\nMost stacks fail because there’s no persistent context layer.\n\n* Agents don’t share memory\n* Data lives in 5 different tools\n* Workflows don’t build on each other\n* One schema change = everything breaks\n\nIt’s basically running your business logic on spreadsheets and hoping nothing moves.\n\nSo we built [Boost.space v5](https://www.producthunt.com/posts/boost-space-v5), a shared context layer for AI agents & automations.\n\nThink of it as:\n\n* A scalable data backbone (not just another app database)\n* A true Single Source of Truth (bi-directional sync)\n* A “shared brain” so agents can build on each other\n* A layer where LLMs can query live business data instead of guessing\n\nInstead of automations being isolated scenarios…  \nThey start compounding.\n\nThe more complex your system gets, the more fragile it becomes, hence you need a shared context for your AI agents and automations. \n\nWhat are you all using right now as your “source of truth” for automations? Airtable? Notion? Custom DB? Just vibes? 😅",
      "is_original_content": false,
      "link_flair_text": "ToolSet",
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r7j644/how_are_you_storing_longterm_context_for_agents/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5xqin4",
          "author": "Kabhishek92",
          "text": "If you resonate with the context and memory problem while scaling complex automations, check out Boostspace v5 and share your feedback >> [https://www.producthunt.com/posts/boost-space-v5](https://www.producthunt.com/posts/boost-space-v5) ",
          "score": 1,
          "created_utc": "2026-02-17 21:21:33",
          "is_submitter": true,
          "replies": [
            {
              "id": "o5y59jw",
              "author": "Conscious_Sock_4178",
              "text": "Yeah, the \"fancy goldfish\" analogy is pretty spot on. We've been leaning heavily into custom DBs tied to specific workflows, but that sounds like what Boost.space is trying to solve.",
              "score": 1,
              "created_utc": "2026-02-17 22:32:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o63bob1",
          "author": "Confident-Tank-899",
          "text": "This context persistence challenge is huge. I've found that most scaling failures happen because agents lose context across sessions. The vector DB approach helps, but you also need a runnable workflow that can retrieve and apply historical context effectively.\n\n\n\nWe've had success using a hybrid approach where frequently accessed context is cached in-memory and historical context is fetched on-demand. The key is making sure your agent workflows are runnable across multiple context windows without degradation.",
          "score": 1,
          "created_utc": "2026-02-18 17:50:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aksem",
          "author": "Alarming_Bluebird648",
          "text": "That 'duct-taping' usually happens because standard vector retrieval isn't a replacement for actual state management. If you're hitting six-figure automation volumes, you need a graph-based memory layer or a dedicated key-value store to maintain logic across disparate nodes.",
          "score": 1,
          "created_utc": "2026-02-19 19:25:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5ep3p",
      "title": "I automated my lead generation process for under 2$. Heres what i built.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r5ep3p/i_automated_my_lead_generation_process_for_under/",
      "author": "Confident_Box_4545",
      "created_utc": "2026-02-15 13:31:15",
      "score": 11,
      "num_comments": 39,
      "upvote_ratio": 1.0,
      "text": "I have been running automated linkedin prospecting using Apify the cost is 1$ per 1K results posts scrapes scores and in the end in delivers valuable leads that i then outreach to. Happy to share if anyone wants the stack!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r5ep3p/i_automated_my_lead_generation_process_for_under/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5ijw7c",
          "author": "sprchrgd_adrenaline",
          "text": "Dude's selling a course to teach it 🤣 that's why the DM",
          "score": 2,
          "created_utc": "2026-02-15 14:53:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5jjgvi",
              "author": "frontier-seo",
              "text": "classic. just share here you grifter",
              "score": 1,
              "created_utc": "2026-02-15 17:49:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5iony4",
              "author": "Confident_Box_4545",
              "text": "I get why you think that but this isn't a course at all. Even with a course it would take ages for a person to build the system!",
              "score": 0,
              "created_utc": "2026-02-15 15:18:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ldck7",
                  "author": "cj1080",
                  "text": "Ian trying to build something like this with Python, playwright and Gemini\n\nSo far I have gotten it to post on LinkedIn and on my companies profile\n\nBut now looking at making it do lead generation with intense human like activities \n\nI have built one that posts and shares viral videos on x,Instagram and LinkedIn.",
                  "score": 1,
                  "created_utc": "2026-02-15 23:27:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5v23jc",
          "author": "Beautiful_Acadia_460",
          "text": "Share please",
          "score": 2,
          "created_utc": "2026-02-17 13:29:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5w3zra",
              "author": "Confident_Box_4545",
              "text": "dm me.",
              "score": 1,
              "created_utc": "2026-02-17 16:45:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ifzsl",
          "author": "Accurate-Geologist12",
          "text": "Sure please do share.",
          "score": 1,
          "created_utc": "2026-02-15 14:31:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ig4on",
              "author": "Confident_Box_4545",
              "text": "Dm me! we can talk more in depth.\n\n",
              "score": 1,
              "created_utc": "2026-02-15 14:32:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ig4dx",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-15 14:32:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ig6s8",
              "author": "Confident_Box_4545",
              "text": "Dm me!",
              "score": 1,
              "created_utc": "2026-02-15 14:32:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5j0nns",
          "author": "No_Boysenberry_6827",
          "text": "we hit this exact wall two years ago. built systems for clients, watched them collapse at scale. finally rebuilt from scratch with automated context tracking and intent signals. went from manual chaos to 3x pipeline with half the team size. the shift wasn't more features, it was smarter automation in the right places. what's your biggest bottleneck when things start to break?",
          "score": 1,
          "created_utc": "2026-02-15 16:17:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5j1iw1",
              "author": "Confident_Box_4545",
              "text": "I don't see it breaking any time soon under the load we are at currently maybe over 100 concurrent users would break it in some way but i don't really see that happening. We can scale pretty nicely the main part is just time now using the product to sell the product!",
              "score": 1,
              "created_utc": "2026-02-15 16:21:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5jc6pn",
                  "author": "No_Boysenberry_6827",
                  "text": "the scaling question is the right one to be asking early. we hit that wall around 80 concurrent users and the fix wasn't what we expected. it wasn't infrastructure, it was the lead scoring layer bottlenecking everything. once we redesigned how the system prioritizes and routes leads in real time, it scaled way beyond what we thought possible. are you selling this as a product or using it internally?",
                  "score": 1,
                  "created_utc": "2026-02-15 17:13:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5j93dd",
          "author": "Competitive_Star2448",
          "text": "Could u share it",
          "score": 1,
          "created_utc": "2026-02-15 16:58:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n5kvt",
              "author": "Confident_Box_4545",
              "text": "Yeah i could dm me we'll talk!",
              "score": 1,
              "created_utc": "2026-02-16 06:45:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5jkaby",
          "author": "unicorn69love",
          "text": "yo thats dope for cheap linkedin scrapes but if you want full automation clienthunter crushes it ai hunts b2b leads everywhere crafts killer personalized emails and follows up smart saved my ass scaling outreach without the manual grind",
          "score": 1,
          "created_utc": "2026-02-15 17:53:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n5pid",
              "author": "Confident_Box_4545",
              "text": "Is that for email? linkedin dm's have a 3x reply rate if done well.",
              "score": 1,
              "created_utc": "2026-02-16 06:46:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5kuzez",
          "author": "bigpurpleoctopus",
          "text": "Instagram wale idhar bhi agaye kya 😂 comment “dm” and I’ll dm 😝",
          "score": 1,
          "created_utc": "2026-02-15 21:47:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5m61dm",
          "author": "Significant_Key6021",
          "text": "Please share.",
          "score": 1,
          "created_utc": "2026-02-16 02:24:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n5qde",
              "author": "Confident_Box_4545",
              "text": "Dm me we can talk!",
              "score": 1,
              "created_utc": "2026-02-16 06:47:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5my6o7",
          "author": "Adventurous_Ice1481",
          "text": "Sure please share 😀",
          "score": 1,
          "created_utc": "2026-02-16 05:42:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n5rca",
              "author": "Confident_Box_4545",
              "text": "If you wanna learn more just dm me!",
              "score": 1,
              "created_utc": "2026-02-16 06:47:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5n54ta",
          "author": "Less-Advertising4580",
          "text": "Scraping cheap is cool.  \nThe real bottleneck usually isnt cost though its signal quality.1,000 scraped profiles 1,000 inmarket buyers.The lift happens when automation is tied to real intent triggers.",
          "score": 1,
          "created_utc": "2026-02-16 06:41:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n5e7o",
              "author": "Confident_Box_4545",
              "text": "It is pretty hard to get real signal targeting is where it's at. You cant scrape random posts that just doesn't work.",
              "score": 1,
              "created_utc": "2026-02-16 06:44:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5o3cpf",
          "author": "thijspeter",
          "text": "Nice!",
          "score": 1,
          "created_utc": "2026-02-16 11:55:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wixgh",
          "author": "djcincos",
          "text": "Hi u/Confident_Box_4545 \\- I'm curious, what line of business are you in. I am interested in what you are sharing.l  \nRegards,  \nDonna",
          "score": 1,
          "created_utc": "2026-02-17 17:57:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wvvgl",
              "author": "Confident_Box_4545",
              "text": "Hey Donna, just sent you a DM with more details so I do not derail the thread.",
              "score": 1,
              "created_utc": "2026-02-17 18:56:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r3l0ot",
      "title": "Results and strategy for my 4-month old website (still 0 DR)",
      "subreddit": "GrowthHacking",
      "url": "https://i.redd.it/exq74re6g8jg1.png",
      "author": "GreedyComposer3913",
      "created_utc": "2026-02-13 09:43:32",
      "score": 9,
      "num_comments": 8,
      "upvote_ratio": 0.92,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r3l0ot/results_and_strategy_for_my_4month_old_website/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o54ztco",
          "author": "Goldnetwork101",
          "text": "That's pretty wild growth for a 4-month-old site, especially with 0 DR. Congrats!\n\nSomething I'd double-check based on your setup: the AI-generated content. I've seen a lot of sites get hit recently for relying too heavily on AI, even if it's \"humanized.\" Google seems to be getting better at detecting it.\n\nThe heavy internal linking is interesting. +30 per page is a lot. Make sure they're contextually relevant and not just stuffed in there, that can also trigger a penalty. I'd experiment with dialing that back to see if it impacts indexing or rankings.",
          "score": 1,
          "created_utc": "2026-02-13 09:50:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5535sv",
          "author": "Comfortable-Foot-665",
          "text": "great results, how did you automate Topic Cluster + Keyword research ?",
          "score": 1,
          "created_utc": "2026-02-13 10:21:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o554ug2",
              "author": "GreedyComposer3913",
              "text": "with [massblogger.com](http://massblogger.com) ",
              "score": 0,
              "created_utc": "2026-02-13 10:37:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o55si27",
          "author": "NecessarySoftware569",
          "text": "I'm happy for you !\n\n",
          "score": 1,
          "created_utc": "2026-02-13 13:29:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5clnt1",
          "author": "decebaldecebal",
          "text": "Wow, how can you get so many impressions?\n\nI need to start doing pSEO too, only have about 10 blog pages and getting aroung 50-100 impressions daily...",
          "score": 1,
          "created_utc": "2026-02-14 15:11:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cryh7",
              "author": "GreedyComposer3913",
              "text": "I do post around 5 blogpost per day ;) ",
              "score": 2,
              "created_utc": "2026-02-14 15:44:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5noemk",
          "author": "benandsons",
          "text": "Who cares about DR you have real results, audience? ",
          "score": 1,
          "created_utc": "2026-02-16 09:41:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8us18",
      "title": "interactive product walkthroughs boost activation… so why do some teams regret adding them?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r8us18/interactive_product_walkthroughs_boost_activation/",
      "author": "Gdonadi2",
      "created_utc": "2026-02-19 09:28:48",
      "score": 9,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "\n\n\n\nI’m researching interactive product walkthrough tools for SaaS and would love real-world feedback from people who’ve actually used them for onboarding, sales demos, or product marketing. I’m not talking about simple screen recordings, but clickable, guided product tours where users can explore flows, follow tooltips, and understand how the product works without jumping on a live call. The goal is to reduce repetitive demos, improve onboarding, and help prospects or users reach value faster.\n\nThe tools I keep seeing mentioned are Navattic, Storylane, Supademo, Product Fruits, WalkMe, and even open-source options like GuideChimp. Navattic is known for no-code, website-embedded tours that simulate real product interactions. Storylane supports persona-based branching demos. Supademo focuses on speed and quick updates when your UI changes. Product Fruits and WalkMe lean more toward in-app onboarding and digital adoption, while GuideChimp is attractive for teams that want full control and customization without SaaS pricing.\n\nWhat I’m trying to understand is what holds up after three to six months of real use. Did maintenance become painful after product updates? Did these tools genuinely improve activation, demo-to-meeting conversion, or feature adoption, or did they just look impressive on landing pages? If you’ve implemented interactive product walkthrough software, what metrics did you track and what would you do differently if you were starting again?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r8us18/interactive_product_walkthroughs_boost_activation/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o67rzmf",
          "author": "Extra-Motor-8227",
          "text": "the biggest issue is maintenance hell after 6 months, your UI changes and suddenly half your walkthroughs are broken pointing to buttons that moved or don't exist. we saw 40% higher activation initially but spent 2 hours every week fixing tours, eventually just went back to loom videos and scheduling more demos",
          "score": 2,
          "created_utc": "2026-02-19 09:43:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67tkwd",
              "author": "GL103",
              "text": "that’s real, the activation bump is great until the upkeep eats your time. did you try limiting it to just one core flow that rarely changes, or was the product evolving too fast for even that to work?",
              "score": 1,
              "created_utc": "2026-02-19 09:58:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o67tfjb",
          "author": "GL103",
          "text": "a lot of teams add interactive walkthroughs expecting higher activation, but without tight scoping and clear value they often just create more clicks instead of more outcomes.",
          "score": 1,
          "created_utc": "2026-02-19 09:57:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69snhj",
          "author": "Outside_Economy9924",
          "text": "I've seen consensus mentioned as a good option for this",
          "score": 1,
          "created_utc": "2026-02-19 17:12:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a3jdb",
          "author": "Cumbrian1970",
          "text": "Most people say walkthroughs work best when they answer one clear question instead of trying to replace the whole demo or onboarding. Tools like Navattic and Storylane are good for early exploration, and some teams use Consensus to qualify interest before a live call. The problems usually start when companies build too many flows and have to keep fixing them after every UI change. The teams that see results focus on 2–3 key paths and track real activation tied to revenue, not just tour clicks.",
          "score": 1,
          "created_utc": "2026-02-19 18:04:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6btc79",
          "author": "KoalaInPain",
          "text": "The fact that some many tools exist is imo validation in itself that the tools work and provide actual value. Most of these tools are also stupidly expensive so they must be doing something right.\n\nMaintenance can be difficult if your UI is constantly changing, but you can combat that by using good stable selectors for example IDs, or data selectors. But for example, Produktly makes this easy by providing a visual selector tool that automatically finds the best selector for the element you want to highlight / action on.",
          "score": 1,
          "created_utc": "2026-02-19 23:08:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6c06ry",
          "author": "supportingthedogs",
          "text": "the regret usually comes from maintenance hell. your UI changes, your tours break, and suddenly someone on the team owns this never-ending job of fixing selectors and updating steps. that's the dirty secret none of the landing pages talk about.\n\nthe tools that hold up long-term tend to be the ones that either screenshot-based so changes don't break them or are smart enough to adapt when your UI shifts. most of the ones you listed aren't really either.\n\nfull transparency: i'm a co-founder at Frigade which is in this space, so take this with a grain of salt, but the reason we built it was specifically because of that 3-6 month cliff you're describing. we went AI-native so guides actually self-update instead of breaking. still early but the teams using it aren't babysitting their tours anymore.\n\nthe metric i'd actually track btw isn't activation rate in week 1, it's what % of users complete the guide AND come back. most tools optimize for the former and ignore the latter.",
          "score": 1,
          "created_utc": "2026-02-19 23:49:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8b1us",
      "title": "Stuck at 290 views for months then jumped to 16k after finding these 5 patterns",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r8b1us/stuck_at_290_views_for_months_then_jumped_to_16k/",
      "author": "Leading_Leading_2114",
      "created_utc": "2026-02-18 18:28:58",
      "score": 8,
      "num_comments": 1,
      "upvote_ratio": 0.73,
      "text": "I’ve been totally consumed by short form video for nearly two years now. I am talking \"legitimately concerning levels of consumed\" where it is pretty much all I think about.\n\nI have been putting in 10 to 14 hour days dissecting what makes videos blow up, testing every hook variation possible, endlessly rewriting scripts, and experimenting with every editing approach I could find.\n\nWhy this level of dedication? Because I am fully convinced short form video is the backbone of absolutely everything moving forward. Growing audiences, marketing anything, building opportunities, or creating brands all comes down to whether you can capture someone’s focus for 30 seconds.\n\nBut here is what almost made me quit entirely: despite working relentlessly every day, nothing was working. I would spend 6 to 7 hours on one video just to watch it die at 290 views. I tried every technique from every creator claiming to know the secret, bought their programs, and applied their \"proven\" blueprints. Still completely stuck.\n\nI seriously started believing maybe I am just not one of the people this works for. Like maybe there is some natural wiring I completely lack.\n\nThen something clicked. I am putting in massive effort, but I am operating completely blind. I do not actually know what is broken. I was just trying random things hoping for different results.\n\nSo I stopped hunting for some viral shortcut and started looking at cold hard data. I reviewed my last 50 videos frame by frame, tracked every single drop off point, and found 5 repeating patterns that were absolutely destroying my performance:\n\n1. **Generic vague hooks are totally invisible to someone scrolling their feed.** \"This is crazy...\" gets bypassed every time. But \"I stopped eating after 6pm for 70 days and my energy crashed\" stops people dead. Specific concrete details obliterate vague mystery without fail.\n2. **Seconds 5 through 7 are the critical window for keeping a viewer.** Most viewers leave between 4 and 7 seconds if you have not demonstrated value yet. I was slowly building anticipation like a total amateur. Now my strongest visual or most compelling stat drops exactly at second 5. That is the hook that genuinely matters.\n3. **Any silence past 1 second drains retention and kills your reach.** I was genuinely obsessed over measuring this, and anything over 1.2 seconds makes people assume nothing is happening. What feels like perfectly natural rhythm to you reads as the video stalling to someone scrolling. Cut significantly tighter than feels comfortable.\n4. **Visual movement is completely non-negotiable if you want to hold attention.** If nothing moves on screen for more than 3 seconds, attention vanishes instantly. I started constantly rotating camera positions, cutting to b-roll, or moving text placement to maintain visual momentum. I went from losing 50% at the halfway mark to retaining 70%.\n5. **Rewatch rate is massively more important than anyone actually thinks.** Videos people watch more than once get amplified exponentially by the algorithm. I started embedding small details that are not obvious the first time or adding elements worth catching on rewatch. My rewatch percentage jumped from 8% to 31% and distribution went absolutely through the roof.\n\nThe real breakthrough was ditching all guesswork and actually tracking what happened at every single second.\n\nI discovered this one tool that goes way beyond showing where people drop off, it literally tells you why and exactly how to correct it. That is when everything transformed. I went from averaging 290 views to hitting 16k in roughly 3 weeks. Standard analytics tell you people are leaving. this one shows the exact moment, the real reason behind it, and what to change next time.\n\nIf you are uploading regularly but cannot break 1k views, your content is not the issue. You simply do not know what is genuinely working versus what you assume is working.\n\nLook, I am putting this out there because figuring this out was honestly one of the most draining things I have experienced. I genuinely wish someone had just walked me through exactly what needed fixing when I was stuck there. It would have saved months of confusion and doubt. So that is what I am doing now for whoever needs it.\n\nEDIT: Getting a flood of DMs asking about the tool, it’s [this one ](https://taap.it/liyjQBu)(works for Reels and Shorts too). Not affiliated with anything, just easier to drop the link than answer everyone separately haha",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r8b1us/stuck_at_290_views_for_months_then_jumped_to_16k/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1r6k2fd",
      "title": "Built an app. Now what?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r6k2fd/built_an_app_now_what/",
      "author": "Space-Possible",
      "created_utc": "2026-02-16 19:56:44",
      "score": 7,
      "num_comments": 17,
      "upvote_ratio": 0.9,
      "text": "Hi. I wanted to give it a try to vibecoding (with no prior code knowledge) and I built an app (it’s a simple plank habit app). \n\nTbh, I was very excited and hyped to the fact that I was able to do that in about 20 hours (what a time to be alive), but what do I do now? How to reach people to see if it’s actually useful to a handful of people?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r6k2fd/built_an_app_now_what/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o5qv4q0",
          "author": "decebaldecebal",
          "text": "The \"built it, now what?\" moment is where most projects die, even non vibe coded ones. The building was the easy part.\n\nStart simple. Find 5-10 people who actually do exercies regularly. Fitness subreddits, Facebook groups, even friends who work out. Show it to them, watch them use it, ask what's missing. You don't need thousands of users right now, you need 5 honest opinions.\n\nThen post it in a few places where your audience already hangs out. r/fitness, r/bodyweightfitness, maybe a few habit tracking communities. Don't just drop a link. Share what you built, why, and ask for feedback. People respond to that.\n\nI went through this exact problem with my own products. Built stuff for months, had no clue how to get it in front of people. I ended up building a whole framework for myself using Claude Code, not sure if you are comfortable with that. It does researching ICPs, writing outreach, figuring out where buyers actually hang out. If you want a structured approach to this I put it together [here](https://beyondfolder.com/distribution), but honestly for a habit app the above steps are your best starting point.",
          "score": 3,
          "created_utc": "2026-02-16 20:27:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qpddk",
          "author": "kubrador",
          "text": "you built a plank timer, the market's already got like 50 of those. post it on twitter/product hunt, get your mom to download it, realize nobody cares about planks, then pivot to something people actually want.",
          "score": 2,
          "created_utc": "2026-02-16 19:58:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u9izr",
          "author": "OptimizmSolutions",
          "text": "Welcome to the misery of go to market. You vibed, you had fun. Now spam like crazy or spend thousands in ads. After that maybe somebody will like it enough to spend 5$ on it. Most likely not. Good luck.",
          "score": 2,
          "created_utc": "2026-02-17 09:50:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uai87",
          "author": "demijane_way",
          "text": "Go to a couple of local gyms and talk to people, as long as you're not creepy people are likely to try it and give you real feedback. Seems difficult but it's much easier than getting people to try it online.\n\nPs. If your app is going to let users create accounts or you collect any kind of data, make sure you have security in place. I see a lot of these vibe coded apps pop up that don't have this in place and it's a nightmare.",
          "score": 2,
          "created_utc": "2026-02-17 09:59:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5uddet",
              "author": "Space-Possible",
              "text": "thank you!",
              "score": 1,
              "created_utc": "2026-02-17 10:25:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5udea3",
                  "author": "exclaim_bot",
                  "text": ">thank you!\n\nYou're welcome!",
                  "score": 1,
                  "created_utc": "2026-02-17 10:25:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5umzed",
          "author": "dawedev",
          "text": "Congrats on finishing the MVP! The 'now what' phase is where most projects live or die.\n\nBefore you spend a dime on ads or heavy marketing, make sure you have a **frictionless feedback loop**. Most founders just share a link and get 'ghosted' by installers.\n\nI actually built **TesterBuddy** to solve this exact problem for iOS devs. It’s a community based on **reciprocity**—we test each other's apps and use direct chat/polls to get real signals fast. We are in the **pre-launch phase** and just went live on Product Hunt today to grow the cohort!\n\nMy advice: find 10-20 people who will give you 'brutal' honesty, not just 'it looks good.' That’s the only way to refine the UX before you go big.\n\nFeel free to check us out if you need that initial signal: [**https://www.producthunt.com/products/testerbuddy-beta-feedback-exchange**](https://www.producthunt.com/products/testerbuddy-beta-feedback-exchange)",
          "score": 2,
          "created_utc": "2026-02-17 11:48:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xs593",
          "author": "Commercial_Quote_320",
          "text": "keep shipping!!",
          "score": 2,
          "created_utc": "2026-02-17 21:29:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ran2l",
          "author": "Dependent_Slide4675",
          "text": "Now sell it to others. Go to market means that you are the one going to meet your market.",
          "score": 1,
          "created_utc": "2026-02-16 21:43:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s0iwb",
          "author": "amberjletang",
          "text": "The gap between building and finding users is a lack of Distribution Infrastructure. Vibecoding is great for prototyping but it rarely accounts for how a tool integrates into a user's daily friction points.\n\nInstead of hunting for users focus on systemic feedback. Map the 'Cost of Friction' for people building habits. If your app doesn't solve a specific failure point in their routine it will be abandoned. \n\nI focus on building logic layers that make tools essential. Shift from reaching people to auditing their workflow. Once you identify the bottleneck the distribution path becomes deterministic.",
          "score": 1,
          "created_utc": "2026-02-17 00:00:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5siet9",
          "author": "Sea_Inflation_2881",
          "text": "what is that app\nsend me the link",
          "score": 1,
          "created_utc": "2026-02-17 01:45:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tmvqx",
              "author": "Space-Possible",
              "text": "it’s called Planked (iOS only)",
              "score": 1,
              "created_utc": "2026-02-17 06:19:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5sifcx",
          "author": "Sea_Inflation_2881",
          "text": "what is that app\nsend me the link",
          "score": 1,
          "created_utc": "2026-02-17 01:45:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u7zdd",
          "author": "Euphoric_Movie2030",
          "text": "Building fast is the easy part now, learning if anyone actually cares is the real work. The next step isn't more features, it's talking to users, testing real behavior, and validating pain before polishing the product.",
          "score": 1,
          "created_utc": "2026-02-17 09:35:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5v0whm",
          "author": "Different_Dinner9267",
          "text": "Building is the easy part now yeah. The hard part is getting it in front of real people. Before spending money on adsor anythink, try reaching out to 10-15 nano/micro fitness creators on TIKTOK or Instagram. A simple plank app is perfect for short demo content. Pay them a tiny fixes fees or even just give them free access and ask for honest feedback. You'll get real users and real feedback at the sema time. But next time, valdiate the idea before building > Talk to people on Reddit, X, forums, see if there's actual demande first. Saves you a lot of time and energy",
          "score": 1,
          "created_utc": "2026-02-17 13:22:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6051sh",
          "author": "Janeneinhaus",
          "text": "Congratulations",
          "score": 1,
          "created_utc": "2026-02-18 05:23:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60v19e",
          "author": "takescaketechnology",
          "text": "Start inbound marketing on techne.blog",
          "score": 1,
          "created_utc": "2026-02-18 09:11:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}