{
  "metadata": {
    "last_updated": "2026-02-26 09:09:58",
    "time_filter": "week",
    "subreddit": "GrowthHacking",
    "total_items": 20,
    "total_comments": 167,
    "file_size_bytes": 170884
  },
  "items": [
    {
      "id": "1rdrcby",
      "title": "I built a tool that finds local businesses with bad websites (Need feedback)",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rdrcby/i_built_a_tool_that_finds_local_businesses_with/",
      "author": "salaryscript",
      "created_utc": "2026-02-24 20:16:23",
      "score": 60,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Hey everyone\n\nI've been working on a tool called [LeadsByLocation](https://leadsbylocation.com) and I'm looking for honest feedback from people who actually do client outreach to local businesses.\n\nThe problem it solves: if you sell web design, SEO, or any digital service to local businesses, you know how tedious prospecting is. Browsing Google Maps, clicking through listings one by one, checking if they have a website, testing how bad it is, copying contact info into a spreadsheet. It takes hours before you have anyone worth calling.\n\nLeadsByLocation lets you search a keyword and city (like \"plumber in Denver\") and instantly pulls up a list of businesses with their ratings, reviews, contact info, and the part I think is most useful — a website performance score with specific reasons like \"no SSL, 6 second load time, not mobile friendly.\" So you're not just getting a list of names, you're getting a built-in pitch angle for each one.\n\nI'm giving out a  free Solo plan for a full month COUPON to anyone who wants to try it. No credit card, no strings. All I'm asking for is real feedback, what's useful, what's confusing, what's missing.\n\nCOUPON: BETATEST\n\nYou can sign up the page and pick the solo plan, input your promo code and you should have the solo plan 100% free.\n\nNote: this is limited to only 30 people\n\nHappy to answer any questions here too.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rdrcby/i_built_a_tool_that_finds_local_businesses_with/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o777wua",
          "author": "Wooden-Term-1102",
          "text": "This actually solves a real pain. Prospecting local businesses takes way too much time and having clear website issues upfront makes outreach easier. Curious how accurate the performance scores are and how often the data refreshes. Happy to test and share feedback.\n\n",
          "score": 2,
          "created_utc": "2026-02-24 20:19:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77ar72",
              "author": "salaryscript",
              "text": "there is a button for you to re-run the score for each business. The performance scores are quite accurate, we do our own in house testing and compare it with google to ensure the accuracy is there",
              "score": 1,
              "created_utc": "2026-02-24 20:33:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o79zwlc",
          "author": "stovetopmuse",
          "text": "Cool concept. I’ve done the “Google Maps + 47 tabs + messy spreadsheet” grind and it’s brutal.\n\nBig question for me is data accuracy. How fresh are the site checks and performance scores? If I call someone out on a 6s load time and they fixed it last week, that kills credibility fast.\n\nAlso curious how you handle niches where a simple site is intentional, like solo contractors who don’t care about SEO. Do you filter by signals that suggest they actually value inbound?",
          "score": 2,
          "created_utc": "2026-02-25 05:28:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bb89q",
              "author": "salaryscript",
              "text": "there is a button for you to re-run the score for each business. The performance scores are quite accurate, we do our own in house testing and compare it with google to ensure the accuracy is there\n\nas for your second question:  \nreview count and rating are your best filters for this right now. A plumber with 200 reviews and a terrible website clearly cares about their reputation and has real customers, they just haven't invested in their site yet. That's a great lead. A solo contractor with 3 reviews and no website is probably living off referrals and won't care about your pitch. You can filter by min reviews to focus on businesses that are actually active and engaged online. That said, adding more intent signals (Google Ads presence, claimed GMB profile, posting frequency) is definitely on the roadmap",
              "score": 1,
              "created_utc": "2026-02-25 12:18:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r9wsv4",
      "title": "I grew a site from 0 to 130K organic visits/month in 14 months. Here's the unsexy playbook no one talks about",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r9wsv4/i_grew_a_site_from_0_to_130k_organic_visitsmonth/",
      "author": "PhilosopherLeft6814",
      "created_utc": "2026-02-20 14:28:27",
      "score": 58,
      "num_comments": 21,
      "upvote_ratio": 0.83,
      "text": "\nNo AI-generated fluff. No $2,000 course upsell. Just the actual stuff that moved the needle.\n\n**Background:** Mid-2024 I launched a B2B SaaS content site in a competitive niche (marketing analytics). By late 2025, we hit 130K monthly organic sessions and it now drives 80% of our qualified pipeline. Here's what actually worked — and a few things I wasted months on.\n\n\n**1. We killed our blog strategy and rebuilt it around pain points, not keywords**\n\nOur first 3 months we did what everyone does: plugged seed keywords into Ahrefs, sorted by volume, and started writing.\n\nThe result? 40 posts. Almost zero conversions. Decent traffic on a handful, but the wrong people.\n\nThe shift: We started interviewing our sales team and pulling questions from customer support tickets. We built content around what people were *actually confused about* — not what a tool told us had volume.\n\nExample: \"how to track competitor share of voice\" had almost no search volume. We published it anyway. It's now our #2 converting page because the people searching it are exactly who we sell to.\n\n**Takeaway: Low-volume, high-intent keywords will outperform high-volume vanity keywords almost every time for business outcomes.**\n\n\n**2. Internal linking is stupidly underrated**\n\nI'm not talking about throwing random links in your posts. I mean building a disciplined topic cluster architecture.\n\nWe created 6 pillar pages (2,500-4,000 words each) and linked 8-15 supporting articles to each one. Every supporting article links back to the pillar and to 2-3 siblings.\n\nAfter restructuring our internal links, one pillar page went from position 14 to position 3 in about 6 weeks — with zero new backlinks. Google could finally understand what we were actually about.\n\n**Takeaway: Before you build more backlinks, audit your internal linking. It's the highest-ROI SEO activity most people ignore.**\n\n\n**3. We stopped publishing 3x/week and started publishing 1x/week at 3x the quality**\n\nHot take: publishing frequency is a vanity metric.\n\nWe cut our output from 12 posts/month to 4. But each one got:\n\n- A custom diagram or chart (made in Figma, takes 30 min)\n- Real examples, not hypothetical ones\n- An original data point or survey stat when possible\n- A genuinely helpful structure (not just H2s stuffed with keywords)\n\nOur average time-on-page went from 1:20 to 4:45. Pages started ranking faster. And we stopped cannibalizing our own keywords.\n\n**Takeaway: One post that becomes THE resource on a topic > four forgettable posts that rank on page 3.**\n\n\n**4. Technical SEO basics compound more than you think**\n\nNot the sexy stuff. The boring stuff:\n\n- Fixed 400+ broken internal links (Screaming Frog, took a weekend)\n- Compressed images site-wide (saved 2.1s avg load time)\n- Added proper schema markup to all posts (FAQ, HowTo, Article)\n- Fixed orphan pages — 30+ posts had ZERO internal links pointing to them\n- Submitted a clean XML sitemap and pruned 80 thin/outdated pages\n\nNone of this individually was a game-changer. Together, over 3-4 months, we saw a ~25% lift in indexed pages ranking in the top 20.\n\n**Takeaway: Technical SEO isn't a one-time audit. Treat it like hygiene — do a little every month.**\n\n\n**5. Distribution > creation (the thing I learned way too late)**\n\nFor the first 6 months, we'd hit publish and... wait. Maybe share it on LinkedIn once.\n\nNow every piece of content gets:\n\n- Repurposed into a LinkedIn carousel (our best channel for B2B reach)\n- Submitted to 2-3 relevant niche communities (not spam — genuine answers that link to the full post)\n- Turned into a short email to our list with a \"here's why this matters to you\" angle\n- Quoted in responses on Quora/Reddit where someone is asking exactly what the post answers\n\nThis alone 3x'd our first-week traffic on new posts and improved early engagement signals that (I believe) helped ranking velocity.\n\n**Takeaway: If you're spending 8 hours writing and 0 hours distributing, flip that ratio to at least 50/50.**\n\n\n**6. Things that were a waste of time (for us)**\n\nBeing honest here:\n\n- **Obsessing over DA/DR scores** for link building. Some of our best-converting referral traffic comes from niche sites with DA 25.\n- **Programmatic SEO** before we had topical authority. We tried auto-generating 500 location pages. Google ignored most of them.\n- **Hiring cheap freelance writers** to scale output. We burned ~$6K on content we either rewrote entirely or unpublished.\n- **Chasing featured snippets specifically.** They came naturally once the content was genuinely the best answer. Trying to reverse-engineer them was a time sink.\n\n\n**The honest truth about timelines**\n\nMonths 1-3: Basically nothing. A few posts trickling in 10–50 visits/month.\n\nMonths 4-6: Slow compounding. A couple posts hit page 1 for long-tails. ~5K/month.\n\nMonths 7-10: The hockey stick starts. Pillar pages climb. Internal linking kicks in. ~40K/month.\n\nMonths 11-14: Everything compounds. New content ranks faster because site authority is there. Hit 130K.\n\n**SEO is a slow game that rewards patience and consistency. If you need results in 30 days, run ads. If you're building for 12+ months, SEO will be the single best investment you make.**\n\n\nHappy to answer questions about any of this. What's working (or not working) for you all right now? Drop your biggest SEO challenge and I'll give you my honest take.\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r9wsv4/i_grew_a_site_from_0_to_130k_organic_visitsmonth/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6gg4us",
          "author": "Just-A-Boyyy",
          "text": "The 'distribution > creation' insight is gold - most teams publish then ghost hoping Google finds it. Your LinkedIn + niche communities strategy 3x'd early traffic because social signals and niche authority compound faster than organic crawl. Technical SEO as hygiene is underrated too. Saw sites with 0% CTR improvement from design changes but 40% from fixing internal link structure. Long-term wins come from consistency, not hacks.",
          "score": 7,
          "created_utc": "2026-02-20 17:28:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6flbwf",
          "author": "sajacen",
          "text": "I get the scepticism. Could you share screenshots from GA?",
          "score": 6,
          "created_utc": "2026-02-20 15:05:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ftf0l",
          "author": "goldgravenstein",
          "text": "“No AI-generated fluff” haha oh man, what a lie right off the bat",
          "score": 10,
          "created_utc": "2026-02-20 15:43:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kehi1",
              "author": "CautiousBobcat2622",
              "text": "Haha 100% the whole post is 100% generated. Hot take, AI generated fluff. Who are they kidding 🤣",
              "score": 1,
              "created_utc": "2026-02-21 07:24:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fgup8",
          "author": "AcanthaceaePitiful26",
          "text": "Again chat gpt text! Why do you make this AI hell from reddit?",
          "score": 13,
          "created_utc": "2026-02-20 14:42:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k7w8e",
              "author": "olliekod",
              "text": "it kills me seeing it too brother",
              "score": 2,
              "created_utc": "2026-02-21 06:24:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6fij1k",
              "author": "PhilosopherLeft6814",
              "text": "lol fair enough, i get the skepticism. this is from my actual experience for the past year+ ...happy to get specific on anything if you have questions",
              "score": 4,
              "created_utc": "2026-02-20 14:51:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6flhxk",
                  "author": "adjei7",
                  "text": "Tbh I don't see a problem with AI generated posts if the source is from the author. The message is there, but just in a form that is clear, concise and easier to understand. If it helps you get your point across, go for it.",
                  "score": 14,
                  "created_utc": "2026-02-20 15:06:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6h8n5k",
          "author": "Bendecx",
          "text": "Fantastic article, I'm exactly as in your early days. Worked hard and  ranked number one for industries most competitive keyword, results almost no traffic, then started targeting less volume but pain related keywords and already getting results. I would need further research to identify more pain points. Great inspiration. thanks for sharing.",
          "score": 3,
          "created_utc": "2026-02-20 19:39:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ku5yo",
          "author": "Confident_Box_4545",
          "text": "Most people read this and think write better content\n\nThe real lever is you aligned content with sales questions and then pushed distribution hard\n\nTraffic is nice but pipeline is the metric that matters",
          "score": 3,
          "created_utc": "2026-02-21 09:59:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jdbcg",
          "author": "Alarming_Bluebird648",
          "text": "Targeting pain point keywords over high-volume vanity metrics is the right play for B2B. What was the specific conversion rate from that 130k organic traffic to actual MQLs?",
          "score": 2,
          "created_utc": "2026-02-21 02:40:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k5ovq",
              "author": "Munib_raza_khan",
              "text": "He mentioned it in comments 3.6%",
              "score": 2,
              "created_utc": "2026-02-21 06:05:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6q5wfv",
          "author": "slapbumpnroll",
          "text": "“The unsexy stuff no one talks about” \n\nRespectfully - you’ve pointed out the stuff that everyone already talks about. Content clusters, check. Have good technical SEO, check. Etc. noting really really new or controversial here. You did solid SEO and it’s working so good for you.",
          "score": 2,
          "created_utc": "2026-02-22 05:32:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6sll1s",
          "author": "Confident-Tank-899",
          "text": "Love this breakdown because the real insight is 'kill keyword strategy and rebuild around pain points.' That's the opposite of what SEO guides teach. They asked their sales/support team directly instead of hunting trends. That alignment matters way more than volume. We copied this and our content converts 3x better now even though traffic is half. Quality-of-traffic completely changes the game compared to vanity metrics",
          "score": 2,
          "created_utc": "2026-02-22 16:22:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6t566h",
          "author": "SystemicCharles",
          "text": "Well done! Your timeline seems accurate. \n\nMost people give up in the 1-3 month timeline. Maybe because some guru claimed SEO is supposed to \"work\" in 90 days.\n\nI'm not gonna lie, that first 1-3 can be brutal. But SEO is a long-term investment that pays for itself.",
          "score": 2,
          "created_utc": "2026-02-22 17:52:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6h5cf0",
          "author": "Artic_funky",
          "text": "great, what was your conversion rate once you hit those numbers?",
          "score": 1,
          "created_utc": "2026-02-20 19:23:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ilsjz",
              "author": "PhilosopherLeft6814",
              "text": "Jumped to around 3.6% after the 10th month",
              "score": 2,
              "created_utc": "2026-02-20 23:52:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6iwlka",
          "author": "_SeaCat_",
          "text": "Well even if the first sentence sounds as AI-generated, the following text all makes sense. I've sent you DM with a question on your post. Thanks!",
          "score": 1,
          "created_utc": "2026-02-21 00:55:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6k95v5",
          "author": "Clear_Emotion_8715",
          "text": "Did gamification ever work for you?",
          "score": 1,
          "created_utc": "2026-02-21 06:35:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6j4fp9",
          "author": "Analytics-Maken",
          "text": "Having a central place to actually see what is happening is a game changer, a dashboard that shows GA4, GSC, Facebook Ads, Google Ads, and the CRM, lets us see what strategies work, what is hurting, and what our clients want. It's a little bit of work upfront, but it's worth it: using ETL tools like Windsor.ai to consolidate the data sources into Power BI or a data warehouse like BigQuery, cleaning, transforming, and joining the data. ",
          "score": 0,
          "created_utc": "2026-02-21 01:44:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbm0ct",
      "title": "I tracked every single thing i did for my business for 30 days. 80% of it was completely useless.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rbm0ct/i_tracked_every_single_thing_i_did_for_my/",
      "author": "Crescitaly",
      "created_utc": "2026-02-22 13:35:15",
      "score": 48,
      "num_comments": 33,
      "upvote_ratio": 0.99,
      "text": "Im gonna be honest this experiment humbled me.\n\n\n\nI run a small online business. Been at it for a few years now. Things are going okay, growing steadily, but i always had this nagging feeling that im busy but not productive. Like im running on a treadmill.\n\n\n\nSo last month i decided to track literally everything. Every task, every hour, every \"quick check\" on analytics, every time i opened instagram to \"monitor engagement,\" every email i wrote, every call i took. All of it. I used a simple spreadsheet, nothing fancy. Just timestamp, what i did, and how long it took.\n\n\n\nAfter 30 days i sat down and categorized everything into three buckets:\n\n\n\n1. Revenue generating - things that directly led to money coming in\n\n2. Foundation building - things that dont make money today but build something for tomorrow (systems, relationships, content)\n\n3. Busywork - everything else\n\n\n\nThe results were honestly embarrassing.\n\n\n\nOut of roughly 240 working hours that month:\n\n\n\n\\- Revenue generating activities: about 28 hours (12%)\n\n\\- Foundation building: about 20 hours (8%)\n\n\\- Busywork: about 192 hours (80%)\n\n\n\nEighty percent. I spent 80% of my time on stuff that didnt matter.\n\n\n\nThe biggest time killers:\n\n\n\n\\- Checking analytics dashboards multiple times a day when nothing was going to change between checks. This alone was eating 1-2 hours daily.\n\n\\- Responding to emails that didnt need a response or could have waited.\n\n\\- \"Researching\" competitors which was really just scrolling their social media.\n\n\\- Redesigning things that were already working fine because i got bored of how they looked.\n\n\\- Attending networking calls that went nowhere.\n\n\n\nThe 20% that actually moved the needle:\n\n\n\n\\- Direct outreach to potential partners and clients\n\n\\- Creating actual content (not planning content, not researching content, actually making it)\n\n\\- Improving the parts of my funnel where people were dropping off\n\n\\- Having real conversations with existing customers about what they needed\n\n\n\nAfter seeing this data i restructured my entire week. Now i block the first 4 hours of every day exclusively for revenue generating or foundation building work. No email, no analytics, no social media. Those things get a 1 hour window in the afternoon.\n\n\n\nIts been 3 weeks since i made the switch. Revenue is up about 15% and i actually feel like i have more free time even though im technically working the same hours.\n\n\n\nThe uncomfortable truth is most of us are addicted to feeling busy because it feels like progress. But activity is not achievement.\n\n\n\nAnyone else done something similar? Curious what other peoples ratios look like. I have a feeling 80/20 busywork might actually be generous compared to some people.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rbm0ct/i_tracked_every_single_thing_i_did_for_my/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6rtcly",
          "author": "Confident_Box_4545",
          "text": "80 percent busywork isn’t surprising. Most small online businesses have the same problem.\n\nThe part that stood out to me wasn’t the analytics checking or the emails. It was that only 28 hours were directly tied to money. That’s basically one week out of a month actually pushing revenue.\n\nIf someone forced you to only work 2 hours a day, you’d immediately cut 90 percent of that busywork without thinking. That’s usually the test I use. If I had to make money in 14 days or I’m broke, what do I do? It’s never redesigning a landing page.\n\nAlso worth tracking next month: which specific revenue actions actually closed. Not all outreach is equal. Not all content is equal. You might find 10 of those 28 hours did almost all the lifting.\n\nMost people don’t have a time problem. They have a courage problem. Revenue work feels exposed. Busywork feels safe.",
          "score": 7,
          "created_utc": "2026-02-22 14:02:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rum8h",
              "author": "Crescitaly",
              "text": "The \"if you could only work 2 hours\" test is brilliant and i wish i had thought of it before spending 30 days tracking everything. You're right that it immediately cuts through the noise. And that last line hit hard - its absolutely a courage problem. Revenue work means putting yourself out there, getting rejected, having hard conversations. Busywork is safe because nobody can judge your email response time. Im planning to track which specific revenue actions closed deals next month, exactly like you suggested. Curious to see if the 80/20 applies within that 28 hours too.",
              "score": 4,
              "created_utc": "2026-02-22 14:10:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6rv2fh",
                  "author": "Confident_Box_4545",
                  "text": "When you track which actions close, also track the emotional resistance before doing them. You’ll probably notice the highest revenue tasks are the ones you procrastinate on the most.\n\nIf 5 of those 28 hours drive most of the money, your real job isn’t time management. It’s protecting those hours like your business depends on it. Because it does.",
                  "score": 2,
                  "created_utc": "2026-02-22 14:12:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6rskkr",
          "author": "Actonace",
          "text": "This is such a powerful reminder that tracking exposes the truth, what gets measured get optimized and most growth comes from ruthlessly protecting the small % that actually drive revenues. ",
          "score": 3,
          "created_utc": "2026-02-22 13:58:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ru1kc",
              "author": "Crescitaly",
              "text": "100%. The protecting part is what i keep coming back to. Its so easy to let busywork creep into those revenue hours because it feels urgent. Like someone emails you during your focused selling time and you think \"let me just quickly respond\" - 45 minutes later youre down a rabbit hole. Now i literally block my calendar for revenue work and treat it like a meeting i cant cancel.",
              "score": 4,
              "created_utc": "2026-02-22 14:06:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6rstq8",
          "author": "trainmindfully",
          "text": "this is painfully relatable, especially the research that’s really just sophisticated procrastination. i did a lighter version of this last year and realized most of my day was reacting instead of initiating, which felt productive but wasn’t.\n\nblocking the first few hours for actual needle movers is such a simple shift but it changes everything. my busywork ratio was probably worse than 80 percent if i’m honest, so props for actually facing the data instead of just feeling guilty about it.",
          "score": 2,
          "created_utc": "2026-02-22 13:59:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ru7fq",
              "author": "Crescitaly",
              "text": "\"Sophisticated procrastination\" is the perfect way to describe it honestly. Thats going in my vocabulary now. The reacting vs initiating distinction is huge too. Most of my busywork was reactive - responding to things that felt important in the moment but werent moving anything forward. The tracking forced me to see that pattern. Uncomfortable but necessary.",
              "score": 1,
              "created_utc": "2026-02-22 14:07:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6vb3qz",
          "author": "Dependent_Slide4675",
          "text": "The real pareto principle 😂 \n20% of your work did lead to 80% of your results.\nIt's courageous of you to auto-analyse your work day",
          "score": 2,
          "created_utc": "2026-02-23 00:29:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rowce",
          "author": "Crescitaly",
          "text": "For anyone curious about the actual tracking method - i literally just made 3 columns in google sheets: time, task, duration. Every time i switched tasks i logged it. The annoying part was the first 3-4 days where you keep forgetting to log stuff. After that it becomes second nature.\n\n\n\nThe hardest part was being honest with myself. When i wrote \"competitor research\" i had to ask... was i actually learning something actionable or was i just doomscrolling their instagram and calling it work? 90% of the time it was the latter.",
          "score": 1,
          "created_utc": "2026-02-22 13:36:43",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o6rozgu",
          "author": "Crescitaly",
          "text": "One thing i should have mentioned in the post - the analytics addiction was the worst offender. I was checking google analytics, social media insights, and email stats probably 8-10 times a day. The data barely changes in a day. Now i check once in the morning and once before wrapping up. Thats it. Freed up probably 8-10 hours a week just from that one change alone.",
          "score": 1,
          "created_utc": "2026-02-22 13:37:14",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o6s28o6",
          "author": "RobertLigthart",
          "text": "the analytics checking thing is so real. I used to open GA like 6 times a day and the numbers literally never changed between checks... just a dopamine loop disguised as work",
          "score": 1,
          "created_utc": "2026-02-22 14:51:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6sdadi",
          "author": "HearthString",
          "text": "I love this experiment because that 80 20 realization is brutal but so necessary. I fell into the exact same trap of spending hours checking analytics and doing manual email follow ups instead of actually building my business. What really helped me flip that ratio was leaning into automation. I have been really impressed prompting ActiveCampaigns AI to suggest and create my automation workflows and pull reporting insights lately. It basically handles that whole busywork bucket for me. Instead of manually digging through data or typing out routine emails the AI handles the plumbing in the background. It makes the marketing run so much smoother and frees up my time to focus strictly on the revenue generating stuff. Have you thought about automating those funnel drop offs you mentioned?",
          "score": 1,
          "created_utc": "2026-02-22 15:46:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6shyr5",
          "author": "adjei7",
          "text": "First of all, thanks for the post! Really insightful! But...\n\n\"Researching\" competitors\n\nAnd\n\nAttending networking calls that\nwent nowhere\n\n... are not busy work. You never know where networking calls go. You have to plan in that some will be a waste, but attending all is important. It only takes one to make a huge difference. \n\nAlso keeping tabs on competition helps keep you on the know.",
          "score": 1,
          "created_utc": "2026-02-22 16:06:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x4ot4",
              "author": "Crescitaly",
              "text": "Fair pushback and you're right that i probably oversimplified those two. Networking absolutely has value - some of my best partnerships came from random calls. The issue was more about the RATIO. I was taking 3-4 networking calls a week with zero criteria for who i talked to. Now i'm way more selective - i only take calls where there's a clear mutual benefit or the person is in my exact niche. Quality over quantity.\n\n\n\nSame with competitor research. Keeping tabs is important but there's a difference between spending 20 minutes reading their latest blog post vs spending 2 hours scrolling their instagram stories. The latter was what i was actually doing most of the time.",
              "score": 2,
              "created_utc": "2026-02-23 08:20:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6sv7s0",
          "author": "Hecker8778",
          "text": "Dude, this is the ultimate reality check. The addiction to feeling busy is the exact same developer trap that keeps founders endlessly tweaking their architecture instead of actually shipping.\n\nWhen you are deep in the weeds deploying a project like SupyMem, it is dangerously easy to spend eighty percent of your time refreshing GCP logs or redesigning a dashboard instead of directly talking to users and validating the pain point. Activity is not achievement.\n\nTo permanently kill that busywork, you have to offload the repetitive foundation building. Since Runable is fully capable of creating full websites and not just running background workflows, you could use it to automatically spin up, host, and test new landing pages for your funnel. That completely removes the technical friction and frees up your core hours strictly for revenue-generating outreach.",
          "score": 1,
          "created_utc": "2026-02-22 17:05:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6swoh9",
          "author": "Confident-Tank-899",
          "text": "lol same pain - tracked for 45 days, 78% waste on low roi like ad creative tweaks when real wins were in sql outreach. axed ig/fb for b2b, went all-in cold linkedin + productled. cac dropped 40%, focus laser sharp now. dead channels kill momentum. biggest cut u made?\n\n",
          "score": 1,
          "created_utc": "2026-02-22 17:12:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x4rm3",
              "author": "Crescitaly",
              "text": "45 days and 78% waste - yeah that tracks with my numbers. Love that you went all-in on the channel that was actually working instead of trying to optimize everything. The biggest cut for me was the analytics checking. Sounds small but when you add up 1-2 hours a day of refreshing dashboards, it's basically a full work week per month doing nothing. After that it was the networking calls - went from 3-4 unfocused ones per week to 1 targeted call. The CAC drop you saw from going cold linkedin + product-led is impressive. That's the move for B2B.",
              "score": 1,
              "created_utc": "2026-02-23 08:21:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6tk6h5",
          "author": "Electrical_Chard3255",
          "text": "Interesting idea, I knocked up an app based on your example test, can only upload one image so made a collage of some of the pages \n\nI guess there are already apps out there that will do this, but I like playing around with ideas\n\nhttps://preview.redd.it/it5p9qhpf3lg1.png?width=2772&format=png&auto=webp&s=ce0ee4d3737882e1c2c4a9267f7d18980878e664\n\n",
          "score": 1,
          "created_utc": "2026-02-22 19:00:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tnwm2",
          "author": "Lonely_Mark_8719",
          "text": "true tbh...",
          "score": 1,
          "created_utc": "2026-02-22 19:18:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6uhw39",
          "author": "_SeaCat_",
          "text": "Not everything can be tracked in just 30 days. Many things like SEO will paid off much later.",
          "score": 1,
          "created_utc": "2026-02-22 21:49:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x4uyk",
              "author": "Crescitaly",
              "text": "Good point. SEO is exactly the kind of thing that falls into my \"foundation building\" bucket - you won't see ROI in 30 days but it compounds massively over 6-12 months. That category only got 20 hours in my tracking which is another problem. I was so busy with busywork that even the long-term investments were getting neglected. The 30-day window was really about identifying what to STOP doing more than what to start.",
              "score": 2,
              "created_utc": "2026-02-23 08:22:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6x1nyk",
          "author": "Snaddyxd",
          "text": "this is a great reminder for everyone who wants to drive more sales. dedicated most of your time to what is bringing in the revenue ",
          "score": 1,
          "created_utc": "2026-02-23 07:51:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xdplj",
          "author": "wantToMakeItBig",
          "text": "Nice op. Is it possible to share the excel sheet. I want to do something similar and may be come up with a software to help me out",
          "score": 1,
          "created_utc": "2026-02-23 09:50:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o705yk3",
          "author": "WorldlinessEastern12",
          "text": "This is just a nice reminder that while activity may seem useful, only concentrated effort moves company forward",
          "score": 1,
          "created_utc": "2026-02-23 19:24:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o710ssw",
          "author": "Commercial_Orchid358",
          "text": "What tool(s) did you use to gather the data points?\n\nAsking bc I have a tendency to get really into systems but then realize tracking, at least the way I’ve been doing it, turns into a mini project rather than a fluid part of operations.",
          "score": 1,
          "created_utc": "2026-02-23 21:52:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71rqa4",
          "author": "Zain_320",
          "text": "You could juts automate most of the stuff here like a email automation that gives summary of every mail you got and tells you to rely to which one or not. People are using n8n to build automation for their business and saving lots of time and revenue you could just search it up for n8n automation",
          "score": 1,
          "created_utc": "2026-02-24 00:16:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71wibp",
          "author": "idyllagency",
          "text": "That 80% number isn't as unusual as it feels. Most business owners would find something similar if they actually looked. I've been there. When I finally audited my own time, the results were uncomfortable. What changed everything wasn't discipline or better habits. It was automation. Removing the tasks that didn't need me and protecting the hours that did.\n\nWhat you've essentially done is a manual time audit that surfaces exactly what automation is designed to solve. The items on your busywork list, analytics checks, routine email responses, repetitive admin, those aren't just time wasters. They're automation candidates. The reason they ate your time isn't a discipline problem. It's a systems problem.\n\nThe ratio you found is also telling you something about where your real value lives. 28 hours of revenue-generating work produced your current results. What happens when that becomes 50 hours because the other 22 are automated away? Your 15% revenue increase in three weeks came from attention, not more hours. That's the proof of concept. Automation just makes it permanent.",
          "score": 1,
          "created_utc": "2026-02-24 00:42:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79s1ja",
          "author": "SmartBizSteve",
          "text": "This mirrors exactly what I saw managing teams at GM, IBM, and HP over 30 years. The ratio was almost identical at every level — most people confused motion with progress.\n\nThe dashboard checking habit you mentioned is one of the worst offenders. At IBM we had managers who spent 2 hours every morning reviewing dashboards that updated weekly. They were looking at the same numbers they saw yesterday. The fix was simple — set a specific day and time for data review and stick to it. Once a week for most metrics, once a day maximum for anything time-sensitive.\n\nYour three-bucket framework is solid. The one thing I'd add is that the busywork category usually disguises itself as urgent. Emails feel urgent. Tweaking your website feels productive. Reorganising your project board feels like progress. None of it moves revenue.\n\nThe blocking strategy you landed on is what every high-performer I ever managed figured out eventually. Protect your first hours for the work that actually generates money. Everything else fits into whatever time is left. Not the other way around.\n\nYour 80/20 ratio is probably generous. In my experience most people are closer to 90/10 and just don't want to admit it.",
          "score": 1,
          "created_utc": "2026-02-25 04:32:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7aeeme",
          "author": "NoSuspect9845",
          "text": "Respect for actually tracking it instead of guessing.\n\nMost people say they’re busy. Very few prove it.\n\nWhat stands out:\n\n1.  80% busywork doesn’t mean you’re lazy it means modern tools make distraction look like work.\n2. Redesigning things that already work is such a common trap. It feels creative, but it’s usually avoidance.\n3. Talking to real customers and fixing drop-offs being in the top 20% makes total sense. That’s where clarity comes from.\n\nI’d bet most founders wouldn’t like their own spreadsheet if they did this.",
          "score": 1,
          "created_utc": "2026-02-25 07:28:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ddxtl",
          "author": "Strong_Teaching8548",
          "text": "We built something for tracking community conversations and the same pattern shows up constantly, people obsessively monitoring dashboards waiting for some magic number to change, when they should be out actually talking to their audience\n\nyour 80% number tracks with what i've seen. most founders get trapped in the illusion of control, like refreshing metrics gives you agency. it doesn't. the real work is the unglamorous stuff nobody wants to admit takes time: having actual conversations, iterating based on feedback, shipping things that might suck\n\nthe 1-hour email window is smart but in my experience i'd go harder. most business communication doesn't need real-time responses no matter how urgent it feels :)",
          "score": 1,
          "created_utc": "2026-02-25 18:32:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rckz7f",
      "title": "Made $27K this month with my 7-month-old SaaS, here’s what worked (and what didn’t)",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rckz7f/made_27k_this_month_with_my_7monthold_saas_heres/",
      "author": "RealOrdinary1344",
      "created_utc": "2026-02-23 15:47:59",
      "score": 35,
      "num_comments": 3,
      "upvote_ratio": 0.81,
      "text": "I launched [this tool](https://tryrebelgrowth.com) in August, and we generated approximately 27,000 USD in the last 30 days\n\nHere's what worked\n\nFacebook ads: optimize for Purchase, then obsess over your Conversion API plumbing until your event match quality sits above 6.\n\nIf Meta can’t confidently match the purchase back to a person, your “learning” is basically a blindfold.\n\nGet Pixel + CAPI working with deduping, send the right fields (email, phone, external\\_id), make sure your domain is verified, AEM is set, and your purchase event fires cleanly. Then stop spraying 40 adsets.\n\nConsolidate so you get real volume per adset. If your match score is like a 3, you’re paying extra just to confuse the algo. Fix tracking first, then test creative.\n\nGoogle Ads: bid on competitor terms.\n\nMake a separate campaign for competitor names only. Exact match, tight negatives (like the word free), low daily budget, and a landing page that compares in plain English (pricing, features, who it’s for).\n\nYour goal is to catch high intent people who are already shopping.\n\nWatch CPCs, they can get spicy.\n\nAlso, don’t get cute with trademark stuff in ad copy unless you know the rules. You can win this channel with a tiny campaign if your page doesn’t suck.\n\nSEO: target high buying intent keywords and skip the “what is…” fluff\n\nGo after queries that smell like a credit card: “best”, “pricing”, “alternatives”, “vs”, “review”, “software for”, “tool for”, “agency for”, “near me” (if local).\n\nWrite pages that answer the decision. Put the pricing, the screenshots, the comparison table, the objection handling. Update the page every month or two so it stays fresh.\n\nMost people write SEO content like a school essay. That’s why it ranks for nothing and converts like trash.\n\nWe use our own product for this.\n\nOutreach: keep the message stupid simple, no links, and send a guide after the prospect agrees\n\n\"Hey I built a resource on how we achieve XYZ, want to check it out?\" that's it\n\nThen once they resply, you send the guide where your company is mentioned or the \"hero of the guide\n\nSocial: win the first 2 seconds with a real hook, then borrow distribution from bigger accounts.\n\nMost “content strategy” is just posting into the void. You need hooks that slap, and you need existing attention.\n\nComment on big accounts where your buyers already hang out.\n\nReply fast, be helpful, be a little polarizing, and pull people back to your profile. Remix their topics with your angle. Turn one strong idea into 10 posts across formats. Social rewards gravity. If you’re posting great stuff from a dead account with no interactions, it’s like yelling in the garage.\n\nThat's it, it's better to focus on the 80/20 for each growth channel than trying to do everything perfect\n\nCheers!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rckz7f/made_27k_this_month_with_my_7monthold_saas_heres/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o70xpvx",
          "author": "_SeaCat_",
          "text": "You keep spamming reddit, this is your strategy. ok.",
          "score": 7,
          "created_utc": "2026-02-23 21:37:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zvzx6",
          "author": "Huge_Line4009",
          "text": "Riiigghhtt..",
          "score": 4,
          "created_utc": "2026-02-23 18:38:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70hrpo",
          "author": "dropspaceapp",
          "text": "\"stop spraying 40 adsets\" is the one. consolidation before optimization is counterintuitive but it's why most Meta campaigns burn 60% of budget in week one. what does event match quality look like now after the deduping fix?",
          "score": 1,
          "created_utc": "2026-02-23 20:19:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ratuxi",
      "title": "What mobile app analytics tools actually help you understand why users churn?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1ratuxi/what_mobile_app_analytics_tools_actually_help_you/",
      "author": "blood_vampire2007",
      "created_utc": "2026-02-21 15:26:25",
      "score": 29,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "Honestly this has been bugging me for weeks. We push updates, change flows, test new features and then just... wait? Check the retention numbers and try to guess what went wrong?\nHad a thing last sprint where we redesigned our onboarding and signups dropped 15%. Rolled it back, numbers still weird. Spent like 3 days in meetings trying to figure out if it was the copy, the button placement, or just bad timing with a competitor launch.\nThe PM in me wants data. The human in me is tired of playing detective with incomplete clues.\nHow do you all actually figure out why users drop off? Is everyone just A/B testing into oblivion or is there something I'm missing?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1ratuxi/what_mobile_app_analytics_tools_actually_help_you/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6m9kw3",
          "author": "Practical_While_9263",
          "text": "Talk to your users. They will tell why they need your product and why don't.",
          "score": 1,
          "created_utc": "2026-02-21 16:01:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6quj1o",
          "author": "sugondesenots",
          "text": "This is so relatable. We basically live in Amplitude and run endless A/B tests but still feel blind half the time.",
          "score": 1,
          "created_utc": "2026-02-22 09:18:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6quwbm",
          "author": "No-Pitch-7732",
          "text": "Have you tried looking at session replays? That's usually where I find the real answers instead of just guessing from numbers.",
          "score": 1,
          "created_utc": "2026-02-22 09:22:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qvkzu",
              "author": "blood_vampire2007",
              "text": "Yeah I've been trying out uxcam recently and the session replay thing is pretty eye-opening, you can literally see where people get confused. Still learning it though, curious if anyone else uses similar stuff.",
              "score": 1,
              "created_utc": "2026-02-22 09:28:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6qwmqg",
          "author": "Ronin4Doom",
          "text": "Qualitative data is underrated. Sometimes you just need to watch 10 users struggle and everything becomes obvious",
          "score": 1,
          "created_utc": "2026-02-22 09:39:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6r0rmb",
          "author": "Unique_Appeal5763",
          "text": "User interviews help too but they take forever and people don't always tell you the truth about what they do vs what they think they do.",
          "score": 1,
          "created_utc": "2026-02-22 10:18:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9xjcl",
      "title": "How I Generated $2,795 from 2,150 Organic Visitors",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r9xjcl/how_i_generated_2795_from_2150_organic_visitors/",
      "author": "sg-21",
      "created_utc": "2026-02-20 14:57:53",
      "score": 27,
      "num_comments": 8,
      "upvote_ratio": 0.97,
      "text": "For the past few months, I’ve been building my SaaS product completely solo. That means nights and weekends spent coding, marketing, and everything in between. No team, no virtual assistants, and no agencies, just me, my laptop, and plenty of coffee. \n\nThis past month felt like a real turning point for me. I got 2,150 organic visitors to my site, which led to 31 trial signups and ultimately 7 paying customers. That brought in $2,795 in revenue, which averages out to about $1.3 per visitor. And the best part is, I didn’t spend a single dollar on ads. \n\nSo, what made the difference? Let me walk you through the tools and strategies that really moved the needle. \n\nI used [Typedream](http://typedream.com/) to build my homepage and pricing pages quickly. It only took me about two hours, and everything was SEO-friendly and mobile responsive without any complicated coding or design headaches. \n\nFor backlink building, I relied on the [directory submission service](http://getmorebacklinks.org/). Manually submitting my website to hundreds of startup directories would have taken me around 20 hours, but with this tool, I did it in one click. My domain rating jumped from zero to six, and Google indexed my site in just four days, which gave me some crucial early momentum. \n\nTo support content marketing, I used [PostKit](http://postkit.pro/) to post two blog articles targeting keywords with low competition. One of those posts ranked in the top 30 search results within 10 days. I also kept a public changelog to show that the project is alive and active, which helped build trust and conversions. \n\nFor onboarding, I set up a simple five-step drip email sequence using [MailMaestro](https://www.maestrolabs.com/). I welcomed new users, shared helpful tips on features, highlighted testimonials, showcased a mini case study, and asked for feedback. This sequence played a big role in turning 31 trial users into paying customers. \n\nThe biggest lessons I learned are not to chase flashy tools but to pick simple, reliable ones that help you work without friction. Despite not being glamorous, directory backlinks are still effective. Slow and consistent growth beats flashy viral hacks. And most importantly, your goal should be revenue per visitor, not just traffic. \n\nIf you want, I’m happy to share email templates, blog outlines, and even the keywords I focused on. This month was my first time making real profit as a solo founder, and I’m finally starting to feel momentum.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r9xjcl/how_i_generated_2795_from_2150_organic_visitors/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6fpdxl",
          "author": "Top-Statement-9423",
          "text": "$1.3 per visitor with zero ad spend is solid.",
          "score": 5,
          "created_utc": "2026-02-20 15:24:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fnekw",
          "author": "Bubalis_Bubalus",
          "text": "That’s a strong solo stack.",
          "score": 2,
          "created_utc": "2026-02-20 15:15:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gfwkq",
          "author": "Just-A-Boyyy",
          "text": "The $1.3 per visitor LTV is excellent because it required zero paid spend - that's the metrics nobody talks about. The real win here is the drip sequence converting 23% of trial users. Most people obsess over top-of-funnel velocity but don't invest in the nurture sequence that actually moves the needle. Your email strategy probably drove more value than all the blog posts combined.",
          "score": 2,
          "created_utc": "2026-02-20 17:27:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6frc5j",
          "author": "bala523",
          "text": "what your trial-to-paid conversion rate was after the drip sequence kicked in? Did most upgrades happen early or near the end of the trial?",
          "score": 1,
          "created_utc": "2026-02-20 15:34:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gobgu",
          "author": "Alarming_Bluebird648",
          "text": "A 22.5% trial-to-paid conversion on organic traffic is massive for a solo project. Are you running a credit-card-required trial, or is that conversion rate coming from a friction-less signup flow?",
          "score": 1,
          "created_utc": "2026-02-20 18:05:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6sktt7",
          "author": "Confident-Tank-899",
          "text": "These are my favorite case studies because they show it's not about budget, it's about systems. The tool choices here (Typedream, PostKit, MailMaestro) are all picked for speed/simplicity, not price. That's the play—choose boring tools that work, spend time on what matters (content + conversion flow). I did something similar and hit cash flow positive by month 4 with almost no ad spend. Strategy > spend always wins.",
          "score": 1,
          "created_utc": "2026-02-22 16:18:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73wz6e",
          "author": "Blumpo_ads",
          "text": "If $1.3 is in 1-2 months revenue you have a chance of fast profitable scaling on Meta, Linkedin ads as the LTV will be probably closer $10 per user. \n\nIf that is LTV keep the good work on the organic side",
          "score": 1,
          "created_utc": "2026-02-24 09:27:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbrdzs",
      "title": "We were wasting hours every week and didn’t realize why",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rbrdzs/we_were_wasting_hours_every_week_and_didnt/",
      "author": "freebie1234",
      "created_utc": "2026-02-22 17:13:14",
      "score": 26,
      "num_comments": 2,
      "upvote_ratio": 0.9,
      "text": "We kept trying to optimize execution and productivity, but something still felt off.\n\nNothing obvious was broken.  \nStill, every week, hours were disappearing.\n\nSo we treated our internal workflow like a growth experiment.\n\n**Hypothesis:**  \nThe real bottleneck wasn’t speed, it was **context loss**.\n\n**What we tested:**  \nWe centralized specs, decisions, and lightweight task notes in **Notion**, and deliberately tested it using their [3-month Business + AI trial](https://affiliate.notion.so/Saas) so we could evaluate it properly before paying.\n\nWe focused on:\n\n* keeping all context in one place\n* using permissions once more than one person was involved\n* using AI summaries instead of rereading long docs and threads\n\n**Result:**  \nNo magic growth spike, but a clear drop in execution friction:\n\n* faster handoffs\n* fewer clarification messages\n* less time spent rebuilding context after interruptions\n\nThe trial period mattered because it let us test this with real workflows instead of guessing from demos.\n\nCurious if others here have experimented with internal tooling the same way.  \nWhat internal change had the highest leverage for your team?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rbrdzs/we_were_wasting_hours_every_week_and_didnt/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6tojyl",
          "author": "Lonely_Mark_8719",
          "text": "very useful information",
          "score": 1,
          "created_utc": "2026-02-22 19:21:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r945d8",
      "title": "I will create a free launch video for the first 50 startup/projects that comment",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r945d8/i_will_create_a_free_launch_video_for_the_first/",
      "author": "Different-Coat-652",
      "created_utc": "2026-02-19 16:42:33",
      "score": 22,
      "num_comments": 68,
      "upvote_ratio": 0.96,
      "text": "Hello founders and builders,\n\nI'm the creator of Ozor, a tool that converts your product ideas, URLs, or descriptions into simple videos in about 60 seconds. No editing required, just basic videos to promote your project.\n\nTo support the community and keep improving my product, I'll make a free custom launch video for the first 50 startups or side projects that comment below.\n\nHere's how it works:\n\n* Leave a comment with a brief description of your project (e.g., \"Recipe generator app for busy parents\") and a link to your site or landing page if available.\n* I'll create a 30-60 second video based on that, with standard visuals, and elements to help with sharing.\n* It will be sent within 48 hours. No obligations, but a mention would be appreciated if you like it.\n\nWhy? Starting a project can be challenging, and a video can help increase visibility on platforms like X or LinkedIn.\n\nCheck Ozor AI for examples.\n\nLimited spots! comment now if interested. Thanks!\n\n  \n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r945d8/i_will_create_a_free_launch_video_for_the_first/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o69n9ym",
          "author": "Scott_Jaeggi",
          "text": "Really nice way to promote your tool :)  \n  \n[usefeedback.dev](http://usefeedback.dev)\n\nIs a SaaS tool to help gather feedback from early customers easier and with matching UI",
          "score": 2,
          "created_utc": "2026-02-19 16:46:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6afs4u",
              "author": "Different-Coat-652",
              "text": "Thanks! Hey, I'm interested! Just messaged you",
              "score": 1,
              "created_utc": "2026-02-19 19:01:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o69qdfc",
          "author": "PoemCivil7458",
          "text": "Original idea to promote your business, kudos\nInterested to see what you can do with ours\n\nhttps://www.sublineapp.com\n\nSubline is a fashion discovery/shopping platform for finding pieces from small, independent, and/or sustainable brands. It uses a tinder-like UI where users swipe right or left on items and our algorithm learns from user preferences and recommend them stuff they might like.",
          "score": 2,
          "created_utc": "2026-02-19 17:01:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6alie6",
              "author": "Different-Coat-652",
              "text": "Thanks! I will be happy to create a video for your company. Just messaged you",
              "score": 1,
              "created_utc": "2026-02-19 19:29:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o69rirw",
          "author": "TooOldForShaadi",
          "text": "Am gonna add you to [my list](https://github.com/zupcode-com/awesome-free-services-for-your-next-startup-or-saas?tab=readme-ov-file) this week. Hope you don't mind",
          "score": 2,
          "created_utc": "2026-02-19 17:07:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6anyu9",
              "author": "Different-Coat-652",
              "text": "Go ahead, my feelings are still intact 🙂",
              "score": 1,
              "created_utc": "2026-02-19 19:41:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o69x4ur",
          "author": "Glass_Scar4888",
          "text": ">",
          "score": 2,
          "created_utc": "2026-02-19 17:34:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a1d1v",
          "author": "shivangibedi",
          "text": "Going to add you list as well",
          "score": 2,
          "created_utc": "2026-02-19 17:54:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ao2f7",
              "author": "Different-Coat-652",
              "text": "No worries, take care!",
              "score": 1,
              "created_utc": "2026-02-19 19:41:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6a32u8",
          "author": "Practical_Fruit_3072",
          "text": "Awesome",
          "score": 2,
          "created_utc": "2026-02-19 18:02:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6aluel",
              "author": "Different-Coat-652",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-02-19 19:30:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6a6oqc",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-02-19 18:19:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6alyy9",
              "author": "Different-Coat-652",
              "text": "Nice! Just DMed you",
              "score": 1,
              "created_utc": "2026-02-19 19:31:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6a7fv9",
          "author": "RecognitionHot9149",
          "text": "Journal Scroll - Write/journal to Doom Scroll. Uses camera to watch/ensure the user is writing/journaling before being able to use social media.   \nSite is only available locally so not available to public yet;",
          "score": 2,
          "created_utc": "2026-02-19 18:22:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6amd05",
              "author": "Different-Coat-652",
              "text": "Perfect. It'll be great to share some screenshots of your website so the agent has more context about your branding. I just dropped you a DM",
              "score": 1,
              "created_utc": "2026-02-19 19:33:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ab61s",
          "author": "Certain_Lion_6643",
          "text": "Hoppin is a live foot traffic monitoring business for businesses, we install discreet hardware at entranceways and then use AI to analyze and provide recommendations to business owners, helping them reduce costs and increase revenue.",
          "score": 2,
          "created_utc": "2026-02-19 18:40:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6amglm",
              "author": "Different-Coat-652",
              "text": "Look's interesting! Just DMed you",
              "score": 1,
              "created_utc": "2026-02-19 19:33:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ab7m6",
          "author": "ChainAccomplished425",
          "text": "You got me curious!  \nI build the app [Qota](https://www.getquota.app).  \nHere's my \"elevator pitch\" about what it does:\n\nSplitting expenses with your partner or roommate shouldn't cause arguments. Qota lets you scan any receipt and our AI instantly recognizes every item — then you split each one individually with a slider, not just a flat 50/50. No subscription: you only pay when you scan, from as little as 3 cents. Available on Android and as a PWA, GDPR-compliant, servers in Germany.Splitting expenses with your partner or roommate shouldn't cause arguments. Qota lets you scan any receipt and our AI instantly recognizes every item — then you split each one individually with a slider, not just a flat 50/50. No subscription: you only pay when you scan, from as little as 3 cents. Available on Android and as a PWA, GDPR-compliant, servers in Germany.\n\nScan the receipt. Split it fairly. Done.",
          "score": 2,
          "created_utc": "2026-02-19 18:40:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ampqa",
              "author": "Different-Coat-652",
              "text": "Amazing! I'll be happy to create a video for you. I just sent you a message",
              "score": 1,
              "created_utc": "2026-02-19 19:34:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6aduoo",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-02-19 18:52:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6amt6j",
              "author": "Different-Coat-652",
              "text": "Hey! DMed you!",
              "score": 1,
              "created_utc": "2026-02-19 19:35:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ag5os",
          "author": "prashant_b",
          "text": "Arokiyam – A healthcare booking platform that lets patients instantly book verified doctors, labs, and hospitals with live token tracking, emergency priority access, and transparent ₹10 appointment fees. It also helps providers grow with zero-cost promotion and in-app discovery.  \n[https://arokiyam.in/](https://arokiyam.in/?utm_source=chatgpt.com)  \n[https://play.google.com/store/apps/details?id=com.marchehealthcare.doctorapp](https://play.google.com/store/apps/details?id=com.marchehealthcare.doctorapp)",
          "score": 2,
          "created_utc": "2026-02-19 19:03:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aha28",
          "author": "redit-ed",
          "text": "[Lampzi.com](http://lampzi.com) - A resume builder platform.",
          "score": 2,
          "created_utc": "2026-02-19 19:08:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ai7rp",
          "author": "atceb",
          "text": "We are building an AI-powered app that helps people stay present in the lives of those they care about.\nYou write a simple sentence like “My friend has an exam next Friday” or “My sister is starting a new job,” and the app turns it into gentle, well-timed reminders to check in, wish them luck, or ask how it went.\n\nIt’s not a to-do list or a social network — just a private tool designed to help you remember important moments and show up more consistently for the people that matter.\nwww.trywhisp.app",
          "score": 2,
          "created_utc": "2026-02-19 19:13:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aoqxl",
          "author": "andrebravado",
          "text": "I'll bite - quotecraft.co - conversational quoting app for uk tradesmen with live pricing lookup",
          "score": 2,
          "created_utc": "2026-02-19 19:44:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aorxp",
          "author": "pawreserve",
          "text": "super interesting! [pawreserve.pro](http://pawreserve.pro) \\- PawReserve helps independent pet care businesses manage bookings, clients, and revenue, without the complexity of enterprise software. It learns how your business operates and adapts to you.",
          "score": 2,
          "created_utc": "2026-02-19 19:44:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6arvvo",
          "author": "EnvironmentalCap1492",
          "text": "Interesting proposal.I'm building my newsletter documenting my journey from 0 to Growth Marketer. I don't have my own landing page yet (just Substack), but once I have one in a few weeks, this could be useful for distribution.Do videos perform better on LinkedIn or Twitter in your experience?",
          "score": 2,
          "created_utc": "2026-02-19 19:59:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ayzg3",
          "author": "dertobi",
          "text": "Love this initative, [https://lobsterlair.xyz](https://lobsterlair.xyz) \\- a hosted AI Agent based on OpenClaw",
          "score": 1,
          "created_utc": "2026-02-19 20:34:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b0q9m",
          "author": "blitztask",
          "text": "That's really cool! Definitely interested in this :D\n\n[blitztask.com](https://blitztask.com)\n\nhelps increase productivity using the Timeboxing method, as we like to put it this way: Brain Dump, Prioritize, Schedule.",
          "score": 1,
          "created_utc": "2026-02-19 20:43:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b1hlz",
          "author": "TheseMajor5418",
          "text": ">",
          "score": 1,
          "created_utc": "2026-02-19 20:47:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b5czs",
          "author": "runthetic",
          "text": "[runthetic](https://runthetic.com) Garmin focused Daily suggested workouts tailored to your goal and recent training data.",
          "score": 1,
          "created_utc": "2026-02-19 21:05:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bbbc4",
          "author": "Gullible-Concept2561",
          "text": "Nice :)  \n  \n[https://zapisowo.pl/](https://zapisowo.pl/)\n\nZapisowo helps extracurricular activity organizers replace spreadsheets, cash payments and manual coordination with a modern enrollment and payment system.\n\nOrganizers can manage classes, participant lists, payments and communication from one dashboard.\n\nWe’re building a two-sided marketplace that will connect parents with trusted local activity providers.",
          "score": 1,
          "created_utc": "2026-02-19 21:34:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bev0d",
          "author": "pvfakten",
          "text": "https://www.oidapost.com/\nSocial media on autopilot for vibe coders. \nLaunch in 2 weeks. Waitlist is open :)",
          "score": 1,
          "created_utc": "2026-02-19 21:52:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bvnvi",
          "author": "mattfrasernz",
          "text": "[https://www.octero.app](https://www.octero.app)\n\nStrava for musicians. ",
          "score": 1,
          "created_utc": "2026-02-19 23:22:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6c7333",
          "author": "BestDay8241",
          "text": "Voice Sheet lets you add entries to your Google Sheets with simple voice. \n\nhttps://voicesheet.app",
          "score": 1,
          "created_utc": "2026-02-20 00:28:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cmwy3",
          "author": "Ali729",
          "text": "Hello - seems like a good idea - hopefully it works out for you \nBasically I have the only brand in Pakistan providing renewed laptops and Chromebooks with 1-year warranty, A+ grading, and premium packaging (as nearly 95% of the population can't buy new, and remain stuck with low-quality used ones without any warranty).\nHere is my website: www.acetech.pk",
          "score": 1,
          "created_utc": "2026-02-20 02:05:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cs40y",
          "author": "deadfire55",
          "text": "Thanks for doing this! An app to get notified when the aurora is visible near you or on flights that you're going to be on https://apps.apple.com/us/app/aurora-buddy/id6757205504",
          "score": 1,
          "created_utc": "2026-02-20 02:36:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ctm48",
          "author": "subaru_kun33",
          "text": "This is web application to tailor your resume for every job description using Ai. And also it keeps tracks of your applications and everything. With a built-in job board so that you guys can share job opportunities with each other. We can really use one..\n\nhttps://moltjobs.lovable.app/",
          "score": 1,
          "created_utc": "2026-02-20 02:46:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d2tok",
          "author": "Icy_Mud5419",
          "text": "I’m interested! https://rewardsbunny.com",
          "score": 1,
          "created_utc": "2026-02-20 03:44:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d3uyf",
          "author": "pchalita",
          "text": "I'm interested! My site in Spanish but soon also in English https://blstherapy.com",
          "score": 1,
          "created_utc": "2026-02-20 03:51:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d6lyp",
          "author": "Indigenous_HUSLR",
          "text": "ScanWerx 3D - AI-powered construction documentation and progress monitoring utilizing autonomous drones serving heavy civil/infrastructure general contractors and owners. \n\nWww.sw3d.com",
          "score": 1,
          "created_utc": "2026-02-20 04:10:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dk4tm",
          "author": "ShukantPal",
          "text": "I'm building Sonar, a AEO tool that helps you track and improve your visibility in AI search.\n\nWe're not just a simple tracking tool — our workflow lets you quickly generate content, ask for backlinks, do guest posts, etc.\n\n[https://trysonar.ai](https://trysonar.ai)",
          "score": 1,
          "created_utc": "2026-02-20 05:53:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dpgmp",
          "author": "pn2327",
          "text": "nVariant lets SaaS teams create interactive product demos that prospects can explore instantly via a shared link or embedded directly on the company’s website.\n\nInstead of walking someone through complex workflows over a call, you can let them click through the actual product flow step by step on their own.\n\nFor workflow-heavy products, this helps buyers understand how the system actually works before a deeper sales or technical conversation.\n\nBeyond basic views, nVariant shows exactly how users moved through the demo, where they slowed down, skipped steps, or dropped off, with full session timelines and navigation paths, so teams can see what actually happened during the exploration.\n\nhttps://nvariant.ai/",
          "score": 1,
          "created_utc": "2026-02-20 06:39:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dsq5w",
          "author": "alphaxtitan",
          "text": "AI native all in one edu platform for engineers\n\nhttps://coderden.in\n\nJust launched private beta, looking for a launch video for the platform, have no idea where to start",
          "score": 1,
          "created_utc": "2026-02-20 07:08:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6e10u3",
          "author": "Crazy_Patient4364",
          "text": "Thats tough",
          "score": 1,
          "created_utc": "2026-02-20 08:25:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6e4zf1",
              "author": "Crazy_Patient4364",
              "text": "Bro i just tried it for like 30mins, nice graphics but the sound lagging and it deletes scenes i never ask to delete would prefer to have a drag around function to reorder scenes ourself. Send u a dm!",
              "score": 1,
              "created_utc": "2026-02-20 09:03:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6e905p",
          "author": "Visible-Mix2149",
          "text": "WOW! I've been procrastinating this task for so long.\n\n[https://predflow.ai/](https://predflow.ai/) \\- building predflow, it's AI Agent for D2C brands who spend heavily on performance marketing, it tells them which ads are not working, why they are not working and what exactly to fix ",
          "score": 1,
          "created_utc": "2026-02-20 09:41:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ekkex",
          "author": "Busy_Trouble9769",
          "text": "www.stoxii.com",
          "score": 1,
          "created_utc": "2026-02-20 11:24:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gt0t8",
          "author": "dev_addicted",
          "text": "Road trip planner app, invite friends, discover places in the route, split expanses, select vehicles, see multiple vehicles location etc.",
          "score": 1,
          "created_utc": "2026-02-20 18:26:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6h11tp",
          "author": "Xenopica",
          "text": "X profile customization tool. It shows live banner that updates as the data changes. It can display wide range of infographics including github activity, tweeting activity, earning over time from stripe, moon phase on the day, or some beautiful gradient patterns on the banner with auto updating quotes. \n\nWould appreciate if you could make a video for it using the website graphics as reference. Here is the link. https://xenopic.us",
          "score": 1,
          "created_utc": "2026-02-20 19:03:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6r99hy",
          "author": "am2_grx",
          "text": "Hello. I am interested in that. \nThe project: extra virgin Olive oil importer from Spain to Czech  Republic. We supply high quality EVOO to HORECA clients (B2B). Best product produced in the fields of Andalucía and shipped to Czechia.\nI have no website or landing page yet.",
          "score": 1,
          "created_utc": "2026-02-22 11:39:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wmx28",
          "author": "TooOldForShaadi",
          "text": "i am adding you to the [awesome list of free services for your next startup](https://github.com/zupcode-com/awesome-free-services-for-your-next-startup-or-saas?tab=readme-ov-file)",
          "score": 1,
          "created_utc": "2026-02-23 05:40:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xtvux",
          "author": "AeStyx01",
          "text": "For growth hacking strategies, two tools that come to mind are Buffer for scheduling and Tweethunter for content ideation. Buffer helps manage multiple accounts efficiently - its analytics are solid for seeing which posts resonate. On the flip side, TweetHunter integrates AI to generate content ideas, which can be a real boost when you're running low creatively. It's not the only option, but it does handle ideation pretty well.",
          "score": 1,
          "created_utc": "2026-02-23 12:14:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdgemw",
      "title": "Dan Kulkov built a free AI tool in 7 days and got it on auto-pilot marketing in 3 months. Here's the exact sequence.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rdgemw/dan_kulkov_built_a_free_ai_tool_in_7_days_and_got/",
      "author": "missy_delenor",
      "created_utc": "2026-02-24 13:35:50",
      "score": 20,
      "num_comments": 7,
      "upvote_ratio": 0.91,
      "text": "Most growth strategies require either money or an existing audience. This one requires neither.\n\nThe approach is called side project marketing. Build a free tool that solves a small problem connected to your paid product. The free tool gets organic traffic, builds your email list, and funnels users toward your main product without ad spend.\n\nDan Kulkov's exact sequence:\n\nFind a problem connected to your paid product with at least 1,000 monthly searches. Build a 2-screen AI wrapper input on screen one, results on screen two. Use GPT-3.5 with a detailed prompt for fast results. Critical: don't gate the results behind an email. Let people use it freely. More trials means more organic sharing. On the results screen, offer a valuable resource that requires an email to unlock. That's your list builder.\n\nThe distribution sequence after building: launch on Product Hunt targeting top 5, submit to AI directories the same day, post on Reddit and HackerNews, start daily short videos showing the tool in action.\n\nFull side project marketing playbook with Dan Kulkov's, Marc Lou's, and Sveta Bay's frameworks three different approaches that complement each other is [inside foundertoolkit](http://unicornmaking.com)..\n\nWithin 3 weeks of this sequence, AI influencers typically discover and feature tools organically. That generates free backlinks that compound for months. Within 3 months, the whole thing runs without active promotion.\n\nSveta Bay's addition that makes a measurable difference: put a CTA button on every single page of your free tool pointing to your paid product. Every visitor is a potential conversion not just an email subscriber.\n\nHas anyone here successfully used a free tool to drive signups for a paid product? What was the conversion rate?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rdgemw/dan_kulkov_built_a_free_ai_tool_in_7_days_and_got/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7849do",
          "author": "Sea-Cut-4178",
          "text": "Is there an example of this in action?",
          "score": 2,
          "created_utc": "2026-02-24 22:52:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74yo4n",
          "author": "Any_Butterscotch_610",
          "text": "I’ve seen this work really well when the free tool solves something super specific instead of trying to be too broad. The narrower the use case, the easier it spreads.",
          "score": 1,
          "created_utc": "2026-02-24 14:04:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74zpaw",
          "author": "desisevil",
          "text": "How closely related does the free tool need to be to the paid product to actually convert well?",
          "score": 1,
          "created_utc": "2026-02-24 14:10:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7548dv",
              "author": "missy_delenor",
              "text": "Very closely related. The free tool should solve a small piece of the same problem so users naturally want the full solution afterward.",
              "score": 2,
              "created_utc": "2026-02-24 14:33:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o751uw2",
          "author": "GreatIdeal1954",
          "text": "Biggest early signal for me was impressions increasing in Search Console before clicks. Rankings followed later.\n\n\n\n",
          "score": 1,
          "created_utc": "2026-02-24 14:21:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77812m",
          "author": "Plus-Stuff-6353",
          "text": "Solid playbook.Most people fail in the no email gate on results part friction makes sharing die. Free tool + CTA on each page is essentially free passive sales funnel which builds up with time.",
          "score": 1,
          "created_utc": "2026-02-24 20:20:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77asbd",
              "author": "Rude-Purple4938",
              "text": "I get what you’re saying — reducing friction definitely helps with sharing, and a free tool with a clear CTA can turn into a solid passive funnel over time. That part makes sense.\n\n\nBut I don’t think removing all friction is always the answer. Sometimes a small amount of friction — like capturing an email before showing full results — can actually increase perceived value and help build a stronger long-term relationship with users.\n\n\nA free tool alone doesn’t guarantee growth. If users don’t see real value or don’t feel connected to the product, they won’t come back — no matter how smooth the funnel is.\n\n\nI think it’s less about “no friction” and more about “intentional friction” — being strategic about when and why you ask for something.\n\n\nIf you’d like, I can also make it:\nMore direct and debate-style\nMore supportive but nuanced\nOr shorter and punchier for Reddit/Twitter tone.",
              "score": 1,
              "created_utc": "2026-02-24 20:33:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rcf6gr",
      "title": "How can artificial intelligence reduce manual CRM tasks?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rcf6gr/how_can_artificial_intelligence_reduce_manual_crm/",
      "author": "Kaess-Janetta",
      "created_utc": "2026-02-23 11:39:11",
      "score": 18,
      "num_comments": 10,
      "upvote_ratio": 0.96,
      "text": "ok so we use crm obviously and the amount of manual crap we do is insane. like logging calls, updating stages, copy pasting from emails into notes. it's 2025 and i feel like a secretary half the time. been seeing all these ai tools pop up that claim to automate this stuff. like they listen to calls and log everything automatically or pull data from emails without you lifting a finger. sounds too good to be true honestly. has anyone actually used this stuff? does it work or is it just another thing that sounds cool in demos but sucks in real life? would rather just keep doing things manually if the ai thing is half baked. curious what you guys have tried and if any of it actually saved you time.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rcf6gr/how_can_artificial_intelligence_reduce_manual_crm/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7dovb5",
          "author": "harsh02121",
          "text": "it's wild how much time we spend on the mundane, and while ai isn't a silver bullet yet, it's definitely interesting to see how some platforms are integrating it to chip away at those tasks, like hubspot trying to make call logging less of a chore.",
          "score": 6,
          "created_utc": "2026-02-25 19:21:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xvi4z",
          "author": "OracleofFl",
          "text": "There is AI and then there are workflows. If you can define the \"when this happens, do this\" a straightforward workflow can be defined to do those task pretty easily. There are also \"integrations\" that can automatically log phone calls to your CRM available on virtually all CRMs and all phone systems. \n\nAI workflows are best for workflows not easily defined like scoring a lead based on factors like zip code, which ad they responded to and how quickly they respond to emails and calls. AI works best in these less clearly defined areas.",
          "score": 1,
          "created_utc": "2026-02-23 12:26:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71plbp",
              "author": "Kaess-Janetta",
              "text": "this is helpful, thanks. the distinction between ai and workflows makes sense. i think most of what we do is probably just workflow stuff that should already be automated. guess we need to actually set it up instead of complaining lol.",
              "score": 2,
              "created_utc": "2026-02-24 00:04:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6z0lj7",
          "author": "FamlyMemo",
          "text": "Yes, it's called automation and it works. In some cases it works like this:\n\nYou give access to your email to the ai  \nYou setup cron jobs so the ai knows WHEN to look at your email  \nIt pulls data and do whatever you want to do with that  \nIt pushes to google drive\n\nOther solution would be webhooks (when an event has happend is calling an endpoint). That endpoint starts a function like (hey ai, do this or that).  \nHope this helps",
          "score": 1,
          "created_utc": "2026-02-23 16:13:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zwb0h",
          "author": "Wild-Cantaloupe-4548",
          "text": "Once I built an AI agent for a company, you simply talk to and it creates mails & journeys out of templates  you have on sfmc if you're familiar with it. They say it had been pretty life changing",
          "score": 1,
          "created_utc": "2026-02-23 18:39:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zwvej",
          "author": "morningdebug",
          "text": "yeah the call logging stuff actually works pretty well if it's set up right, but the real pain is getting it to talk to your crm without breaking everything. i built something similar on blink that pulls from emails and updates fields automatically, saved us like hours a week on data entry alone",
          "score": 1,
          "created_utc": "2026-02-23 18:42:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o782e2i",
          "author": "Academic-Highlight10",
          "text": "IMO it depends on your workflows. In one of my organizations, we use Gong and there is a lot of stuff that they get right based on the parameters and the testing we have done. There are some things that I wish it did better.  In my other organization we built our own system  and build for others so we can be very specific to what we wanted, how data should be handled, how it can consider our playbooks etc. Gong has saved me time trying to move sales forward, capturing key points from calls, creating follow up emails etc. we have it set up to fill out certain fields from a calls well which saves some time. I will say building custom has been helpful for most of our customers bc of the way they use their CRM and other external applications/systems",
          "score": 1,
          "created_utc": "2026-02-24 22:43:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7baol6",
          "author": "Creepy-Neck6587",
          "text": "It actually works, but only for the repetitive stuff.\n\nAuto call summaries, email to CRM logging, and task creation can save a lot of admin time. Where it fails is nuance. Sometimes you still need to review and tweak.\n\nThe sweet spot isn’t full automation. It’s AI drafting and logging everything so you just approve instead of typing.\n\nWhen set up well, it definitely reduces the “CRM secretary” feeling.\n\nSelect 24 more words to run Humanizer.",
          "score": 1,
          "created_utc": "2026-02-25 12:14:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdgdy1",
      "title": "Link building service that actually works?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rdgdy1/link_building_service_that_actually_works/",
      "author": "Traditional_Arm_9981",
      "created_utc": "2026-02-24 13:35:01",
      "score": 17,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Been running growth experiments for the past 6 months and SEO has consistently been the hardest channel to crack. Paid acquisition is eating budget and we need organic to start pulling its weight.\n\n\n\nContent and on-page SEO are in decent shape. The bottleneck is clearly authority, we're getting outranked by competitors who have weaker content but stronger backlink profiles. Tried a couple of outreach campaigns in-house and the response rates were terrible. Tried one agency and got overpriced placements that moved nothing.\n\n\n\nRecently started seeing [Link-Building tool](http://getmorebacklinks.org) come up in growth communities, specifically around building foundational authority through directory submissions. The positioning makes sense to me establish baseline credibility first, then layer more aggressive outreach on top. But I haven't seen many growth hackers talk about directory submissions specifically.\n\n\n\nHas anyone used directory submissions as part of a broader growth strategy and seen measurable ranking impact? And what link building approach has genuinely moved organic growth numbers for you rather than just looking good in a report?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rdgdy1/link_building_service_that_actually_works/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o74ypa8",
          "author": "Bubalis_Bubalus",
          "text": "Directory submissions aren’t magic, but they helped establish a baseline for me. After that, outreach links seemed to have way more impact.",
          "score": 1,
          "created_utc": "2026-02-24 14:04:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74zjil",
          "author": "desisevil",
          "text": "Also noticed crawl rate increased after building more foundational links. That alone helped new content get indexed and tested faster.",
          "score": 1,
          "created_utc": "2026-02-24 14:09:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o751ed9",
          "author": "Queasy_Mulberry____",
          "text": "Honestly most agencies sell links that look  impressive but dont move rankings. Relevance and consistency mattered way more than DR numbers in my case",
          "score": 1,
          "created_utc": "2026-02-24 14:19:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7asbuj",
          "author": "jluisseo",
          "text": "Llevo años trabajando en link building para proyectos de e-commerce y SaaS, y lo que describes es el patrón clásico: buen contenido, buen on-page, pero competidores con perfiles de backlinks más potentes que te superan incluso en queries donde tú deberías ganar por relevancia. El problema de fondo es que Google usa los backlinks como proxy de reputación, y sin masa crítica de autoridad externa, el contenido solo llega hasta cierto punto.\n\n\n\nEn cuanto a los envíos a directorios: funcionan, pero como base de diversificación, no como solución principal. Lo que realmente mueve el ranking en nichos competitivos son los enlaces contextuales de sitios de autoridad media-alta en tu sector, los que viene de artículos en publicaciones especializadas, round-ups, colaboraciones editoriales o digital PR bien ejecutado.\n\n\n\nEl outreach manual tiene tasas de respuesta baísimas porque el 90% se hace mal: correos genéricos, propuestas sin valor claro, sin personalización. Lo que sí funciona es el enfoque de \"link insertion\" (ofrecer actualizar un artículo existente con tu recurso relevante) y las estrategias de broken link building en nichos con contenido desactualizado. Ambas tienen tasas de éxito significativamente mejores que el outreach estándar.\n\n\n\nLo de las agencias que dan ubicaciones sobrevaloradas es el problema más común del mercado. Antes de contratar cualquier servicio, exige ver una muestra de sus ubicaciones recientes: DR real (no manipulado), tráfico orgánico del dominio en Ahrefs, y que el contenido tenga relevancia temática real con tu nicho. Si no pueden mostrarte eso, es una señal de alarma clara.",
          "score": 1,
          "created_utc": "2026-02-25 09:38:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd6ov3",
      "title": "Top 10 SEO tips for generative engine optimization",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rd6ov3/top_10_seo_tips_for_generative_engine_optimization/",
      "author": "Fun-Training9232",
      "created_utc": "2026-02-24 04:57:20",
      "score": 17,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "SEO feels completely different now with ai overviews, chatgpt, perplexity, and other assistants shaping what people actually see. a lot of the old playbooks still matter, but they need updates to work in ai-driven search and stronger ai brand visibility.\n\nhere are 10 seo tips that are still working:\n\n1. focus on clear topical authority, not just single keywords\n2. answer real user questions in simple, structured language\n3. build strong internal linking around core themes\n4. earn high-quality backlinks from trusted, relevant sites\n5. optimize for entities and context, not just phrases\n6. publish original data, insights, or expert opinions\n7. keep technical seo clean so content is easy to crawl and parse\n8. update content regularly to stay relevant for ai citations\n9. track visibility beyond google, including ai search mentions\n10. align content with generative engine optimization so llms can easily reference it\n\ncurious what others are seeing work right now. what’s actually moving rankings or getting cited inside ai answers?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rd6ov3/top_10_seo_tips_for_generative_engine_optimization/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7334hz",
          "author": "FoodFine4851",
          "text": "I love the tips you have mentioned, ive been using similarweb to check my sites visibility in ai searches and its eye opening how much traffic comes from there now. helps with that tip on tracking beyond google, shows competitor insights too which is great for building authority. op, have you noticed similarweb picking up ai mentions for your content or other tools you use for that?",
          "score": 3,
          "created_utc": "2026-02-24 05:04:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gjs98",
          "author": "Scary_Bag1157",
          "text": "This is a solid list, and I totally agree with the direction things are heading. For me, the biggest shift I've seen is how AI actually \\*navigates\\* content.\n\n\n\nWe had a pretty big website migration about 18 months ago, and the old playbook of just mapping URLs and calling it a day wasn't cutting it. Even with perfect 301s, we noticed our AI visibility and citations were lagging. What eventually clicked was focusing on that internal linking (point 3) and structuring content (point 2, 7) not just for humans or traditional bots, but for an AI doing a multi-step research journey, like u/o1got mentioned. \n\n\n\nWe started treating internal links like breadcrumbs for an AI agent, making sure related topics were clearly connected. We also broke down complex topics into shorter, self-contained sections. It sounds simple, but seeing our content start appearing in AI overviews and getting cited over competitors who only focused on basic keyword stuffing was a game-changer. Took about 3-4 months of consistent effort to see those results, but it was worth it.",
          "score": 2,
          "created_utc": "2026-02-26 04:26:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o735hyx",
          "author": "kubrador",
          "text": "the irony of posting seo tips on reddit to ask for seo tips is genuinely impressive",
          "score": 1,
          "created_utc": "2026-02-24 05:22:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o735ns1",
          "author": "Altruistic-Meal6846",
          "text": "You hit it with focusing on entities and context, i swear google’s eating that up.",
          "score": 1,
          "created_utc": "2026-02-24 05:23:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73nncr",
          "author": "Cool-Gur-6916",
          "text": "One thing I’ve noticed recently is that AI engines tend to cite tools or platforms that have clear documentation and use-case pages explaining real workflows.\n\nFor example, when experimenting with automation workflows, I’ve seen platforms like Runable get referenced more often when the content clearly explains how something works rather than just promoting the tool. AI systems seem to prefer pages that show step-by-step implementations, comparisons, and practical examples.\n\nSo beyond the usual SEO basics, I think a big part of Generative Engine Optimization right now is creating structured, explainable content around real tasks (automation, integrations, tutorials, etc.). That kind of content is much easier for LLMs and AI search engines to quote or summarize.\n\nCurious if others are seeing the same thing with documentation-driven content getting picked up more by AI answers.",
          "score": 1,
          "created_utc": "2026-02-24 07:58:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73x04m",
          "author": "Maximum-Bit-3848",
          "text": "Solid list. I’d just add one more layer to it.\n\nWe’ve been testing this across a few projects and what’s really helping with AI citations is:\n\n* Clear definitions in the first 2–3 paragraphs\n* Short, self-contained answer blocks that can stand alone\n* Schema markup that reinforces entities and relationships\n* Pages that load fast and have clean HTML (LLMs struggle with messy DOMs more than people think)\n\nAlso noticing that pages with original comparisons, frameworks, or data points get cited way more than generic “10 tips” content. AI systems seem to prefer content that adds something new, not just summarizes what already exists.",
          "score": 1,
          "created_utc": "2026-02-24 09:27:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o747qyz",
          "author": "dianehasolt",
          "text": "Working something on this domain.",
          "score": 1,
          "created_utc": "2026-02-24 11:06:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74qmbw",
          "author": "Temporary-Constant51",
          "text": "Really solid breakdown. SEO now feels more like building true topical authority than chasing keywords. The shift towards structured answers and entity-based optimization is very real. Definitely a wake-up call for anyone still using old playbooks.",
          "score": 1,
          "created_utc": "2026-02-24 13:20:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77sutg",
          "author": "GroMach_Team",
          "text": "old playbooks don't work if you aren't covering the exact entities the ai expects. i usually use a gap analysis tool to find the specific topic clusters competitors rank for and build content around those missing pieces.",
          "score": 1,
          "created_utc": "2026-02-24 21:56:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77swlj",
          "author": "GroMach_Team",
          "text": "content quality doesn't matter if you're answering the wrong questions. i run a competitor gap analysis to find exactly what topic clusters are driving their traffic, then build better content around those specific gaps.",
          "score": 1,
          "created_utc": "2026-02-24 21:56:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7a0h7z",
          "author": "o1got",
          "text": "good tips!  \nI've analyzed a ridiculous amount of AI agent crawl data and one thing that's not talked about enough: the crawl patterns are completely different from traditional search bots.  \nTraditional SEO assumes a bot hits your page, parses it, and leaves. AI agents are doing multi-step research journeys. They'll hit your homepage, follow internal links based on context they're building, sometimes circle back to pages they visited earlier when they find new info. Your internal linking structure matters way more than it used to because you're not just passing PageRank around, you're literally guiding an agent through a research process.\n\nThe other big thing I'm seeing: structured content wins, but not in the schema markup way everyone assumes. It's more about information hierarchy. AI models are really good at extracting from clean HTML with proper heading structures, lists, and tables. The fancy JavaScript-heavy sites that look great to humans are a mess for LLM parsing. I've seen sites with identical content get cited completely differently based purely on how clean their DOM structure is.",
          "score": 1,
          "created_utc": "2026-02-25 05:32:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b11uw",
          "author": "AlisaWaelchi",
          "text": "tracking ai mentions like you mentioned in tip 9 is key, i use aicarma for that - it shows how different llms describe your brand vs competitors, helps spot where your content gets cited or missed.",
          "score": 1,
          "created_utc": "2026-02-25 10:57:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b5fy7",
          "author": "Yesterdaycomedy",
          "text": "i've been doing seo for a while now and one thing that's really helped me is focusing on long-tail keywords - they're way less competitive and can drive some serious traffic to your site. what's your take on keyword research, do you think it's still a crucial part of seo?",
          "score": 1,
          "created_utc": "2026-02-25 11:34:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ewsk8",
          "author": "Dizzy_Feedback7025",
          "text": "Good foundational list. The items I'd double down on from experience with B2B SaaS clients:\n\nEntity optimization (your point 5) is doing more heavy lifting than most people realize. It's not just about on page context. LLMs cross reference your brand information across your site, schema, directories, and third party profiles. Inconsistencies get you filtered out regardless of content quality. Cleaning up entity signals alone has moved the needle more than any single content change we've made.\n\nOriginal insights (point 6) are where real differentiation lives. LLMs don't need another version of generic advice they can already synthesize. They need content that fills gaps they can't cover on their own: judgment calls, experience based comparisons, genuinely novel data. That's what earns citations.\n\nOne addition I'd make: structure content for extraction specifically. Clear, concise answers positioned in the first few sentences of a section before going deeper. LLMs pull from the most direct statement they can find, so burying your best insight deep in a paragraph means it might never get surfaced.\n\nWe break down how these elements work together at [www.exaltgrowth.com](http://www.exaltgrowth.com). The biggest takeaway from running integrated SEO+GEO strategies is that no single tactic on this list moves results dramatically in isolation. The compound effect of getting several of them right simultaneously is where the real gains come from.",
          "score": 1,
          "created_utc": "2026-02-25 22:49:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1replqv",
      "title": "Launched a SaaS one year ago that have zero traction. Haven’t touched it in 6 months. Now it gets ~600 users/month.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1replqv/launched_a_saas_one_year_ago_that_have_zero/",
      "author": "AppTasticVoyager",
      "created_utc": "2026-02-25 20:56:08",
      "score": 10,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "I launched my first SaaS product in Feb 2025 (almost to the day). It is just a simple online PDF tool site. Compress PDF, merge PDF, that kind of thing. I kept it simple and boring just to understand and learn the process.\n\nPart of the process was learning sales. I had zero idea how to market or grow. So I spent money on ads, tried social media marketing, etc. And nothing really worked. I didn't have a single sale.\n\nFor the first 8 months, I had around 1,500 users come and go, with no sales. [Link for proof](https://imgur.com/MmMbfZ4). This was spending so many hours each month working to get users with no sales. I basically burned out and gave up on the site and pivoted to a new tool.\n\nThe new tool automatically created blog posts targeting keywords to grow SEO/GEO presence. I figured why not, and set it up for my PDF site. All I did was target keywords I figured people might search for around PDFs. The system publishes 3 posts per day.\n\nThat setup was the last time I touched it. No promotion, not new features, nothing.\n\nSince that setup in Oct 2025, my site averages around 600 users per month - [link to proof](https://imgur.com/VJ5xW3p)\n\nThe best part of it, I've made three sales. I know it isn't groundbreaking, but it covers the cost of the site and is very cool to see still new to building and shipping. It is very ironic that when I stopped working day and night for users is when I got actual paying users lol.\n\nHappy to answer any questions, but figured a post like this might help some of you that are stuck with no customers. One year later after essentially abandoning it and I have actual paying users. Just insane.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1replqv/launched_a_saas_one_year_ago_that_have_zero/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o7ejyht",
          "author": "Obvious_Jelly_8062",
          "text": "TBH, I'm kinda surprised you're getting 600 users after not touching your product for months - was that a result of organic traffic or did you do some kind of refresh to get it back in the game?",
          "score": 1,
          "created_utc": "2026-02-25 21:46:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ekxt5",
              "author": "AppTasticVoyager",
              "text": "It was truly just SEO from what I can tell/what the results look like. \n\nI didn't touch anything else in terms of offering or setup. ",
              "score": 1,
              "created_utc": "2026-02-25 21:51:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7fjk5x",
          "author": "Fun_Mycologist_7791",
          "text": "I'd be getting a lifetime value offer on this now, even just $10 to use it forever... Nice little dividend if you have no intention of promoting it more ",
          "score": 1,
          "created_utc": "2026-02-26 00:53:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7frbcz",
              "author": "AppTasticVoyager",
              "text": "That's actually how it is set up. Just a one time payment.",
              "score": 1,
              "created_utc": "2026-02-26 01:37:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7h3quq",
          "author": "Inevitable-Neat-225",
          "text": "This is actually a really interesting case study. You proved that traffic wasn’t the real bottleneck — distribution just needed compounding time. The more interesting question now is monetization design.600 users/month with 3 sales suggests intent mismatch more than visibility problems. PDF tools usually attract high-volume, low-attachment users. The challenge becomes: how do you capture value at the exact moment utility is highest? SEO solved acquisition. Now the leverage is in conversion mechanics.",
          "score": 1,
          "created_utc": "2026-02-26 06:59:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h0ha2",
          "author": "Tom-Cruisin",
          "text": "fuck off with this ad. ",
          "score": 0,
          "created_utc": "2026-02-26 06:31:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rci5qf",
      "title": "Unpopular opinion: \"Content Velocity\" is killing my brand. How do you scale without sounding like a bot?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rci5qf/unpopular_opinion_content_velocity_is_killing_my/",
      "author": "gandalfthesupagrey",
      "created_utc": "2026-02-23 13:59:14",
      "score": 8,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Everyone says \"publish more, rank higher.\" So I tried it. I ramped up from 1 post/week to 5/week using a mix of freelancers and AI tools.\n\nThe result? My traffic graph looks nice (impressions are up), but my engagement and conversions are actually *down*. The content feels... thin. It lacks that \"human\" touch that actually builds trust.\n\nI'm starting to think \"velocity\" is just a trap to sell more AI tools. \n\nBut I can't go back to writing everything myself or I'll never grow. \n\nHow are you guys finding the balance? Is there a way to automate the \"grunt work\" (keywords, formatting, distribution) without outsourcing the actual *thinking*? Or do I just need to hire expensive editors?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rci5qf/unpopular_opinion_content_velocity_is_killing_my/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6yi4s7",
          "author": "MarcusUranus",
          "text": "I had the exact same issue last year. The problem was trying to replace the *human* part (writing) with AI.\n\nWe switched to a hybrid approach: I write the core ideas and outlines, then use [RebelGrowth](https://tryrebelgrowth.com) for the heavy lifting (keywords, E-E-A-T structure, internal linking, etc). It lets me keep the quality but handle the volume. \n\nHonestly, automating the distribution/repurposing saved us more time than the writing part anyway. Maybe focus on automating the grunt work, not the creative work?",
          "score": 1,
          "created_utc": "2026-02-23 14:42:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ynhi2",
          "author": "RobertLigthart",
          "text": "the traffic up but conversions down thing is the tell. impressions are a vanity metric when the content isnt actually resonating with anyone\n\n  \nwhat worked for me was going to 2-3 posts/week instead of 5 but spending the extra time on distribution and repurposing. one solid post turned into linkedin posts, tweets, email content etc. got way more mileage than 5 mediocre blog posts that nobody shared\n\n  \nthe \"publish more rank higher\" advice is technically true but it only works if each piece actually answers a question better than whats already out there",
          "score": 1,
          "created_utc": "2026-02-23 15:10:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcb89o",
      "title": "Finally reached the audiences we actually wanted here’s what worked",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rcb89o/finally_reached_the_audiences_we_actually_wanted/",
      "author": "Boring_Analysis_6057",
      "created_utc": "2026-02-23 07:40:56",
      "score": 8,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Just wanted to share this with you guys, for months we were struggling to get our message in front of the right people. We tried multiple channels, ran ads, and experimented with different campaigns but engagement never matched our expectations. Then we tested a streaming CTV approach, and it completely changed the game. Suddenly, we were reaching exactly the kind of audience we had been chasing: people who were genuinely interested, highly engaged, and responsive to our campaigns. The best part was how efficient and accessible it felt. Campaigns launched faster, reporting made sense, and we could see which placements were actually driving results. It wasn’t magic targeting and creative still mattered but finally, it felt like our message wasn’t just floating in the void. \n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rcb89o/finally_reached_the_audiences_we_actually_wanted/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6x1e5b",
          "author": "EyeImpossible4412",
          "text": "Yess so happy for u",
          "score": 1,
          "created_utc": "2026-02-23 07:48:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x2va9",
          "author": "WoodpeckerNo9461",
          "text": "The fact that you mentioned reporting being clearer actually means a lot, since old school TV always felt like just throwing a message out and hoping for the best.",
          "score": 1,
          "created_utc": "2026-02-23 08:02:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x6mwn",
          "author": "KeyChemistry794",
          "text": "You nailed something that gets missed a lot campaigns are only as good as the feedback you get, and most digital platforms still dont lay it out in a way thats easy to connect to actual business outcomes. A programmatic tv advertising Vibeco was so useful for us sorted out our issues with reaching engaged viewers way better than other methods.",
          "score": 1,
          "created_utc": "2026-02-23 08:40:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xjhbj",
          "author": "blitztask",
          "text": "That's cool",
          "score": 1,
          "created_utc": "2026-02-23 10:45:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ak0lm",
          "author": "Former_Tea1131",
          "text": "CTV really is a game changer when you nail the setup. We've seen similar results with clients who switched from traditional digital and the transparency in reporting makes optimization so much cleaner. We are on self serve using vibe co and its made ctv accessible without the usual agency overhead.",
          "score": 1,
          "created_utc": "2026-02-25 08:19:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdpcl6",
      "title": "I Built a Google Maps scraper in 2 days",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1rdpcl6/i_built_a_google_maps_scraper_in_2_days/",
      "author": "Smart-Total-7099",
      "created_utc": "2026-02-24 19:05:23",
      "score": 8,
      "num_comments": 27,
      "upvote_ratio": 0.67,
      "text": "Someone paid me 2500 dollars for it. I did not overthink it. I just built something obviously useful.\n\nAll it does is scrape Google Maps. You type “plumbers in Chicago” and it spits out a CSV with names, emails, phone numbers and websites. That is it. No complicated SaaS dashboard, no subscription and free to scrape, no API costs.\n\nDay 1: wrote the scraper in Python with Playwright.  \nDay 2: I added a basic interface and recorded a 30 second demo.\n\nWhen I reached out to marketing agencies and lead generation people on LinkedIn and in Facebook groups, I did not try to convince them they needed it. I just explained why it would help them and showed the demo. They already knew they wanted this.\n\nOne agency asked if they could have exclusive use in their niche. They paid 2500 dollars.\n\nLesson learned: boring problems pay if you find the right person. You do not need a platform or a subscription model. Just solve one annoying task for someone who already has the problem.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1rdpcl6/i_built_a_google_maps_scraper_in_2_days/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o78ujmb",
          "author": "agin_",
          "text": "Note that Google already sued similar solutions. Even if you just built the tool and not using it, I would not feel on the safe side by doing so.",
          "score": 6,
          "created_utc": "2026-02-25 01:15:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cdgk9",
              "author": "niiks07",
              "text": "If google sued, that means is useful things.",
              "score": 1,
              "created_utc": "2026-02-25 15:46:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7cddrh",
          "author": "Confident_Box_4545",
          "text": "This is what people miss. The money wasn’t in the scraper, it was in finding someone who already needed it.\n\nYou didn’t build a big vision. You solved one annoying task for a specific buyer and showed them exactly how it helps. That’s why it moved fast.\n\nMost founders overbuild and then go hunting for demand. You found demand first and kept the build simple.",
          "score": 2,
          "created_utc": "2026-02-25 15:46:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dqx3y",
          "author": "Longjumping-Ad8775",
          "text": "I used to scrape Google years ago.  Trust me, they’ll lock you out.",
          "score": 2,
          "created_utc": "2026-02-25 19:31:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7as5d3",
          "author": "nlomb",
          "text": "Firstly this isn't growth hacking. Secondly, this is against the TOC and you will get sued for it. Might want to get rid of any evidence that you ever worked on this. ",
          "score": 2,
          "created_utc": "2026-02-25 09:36:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7avcd9",
              "author": "Smart-Total-7099",
              "text": "Scraping public data is not illegal, there are many big saas on the internet that have been scraping millions of emails from google maps yet they didn't get anything. rule of thumb, if it's public, you can scrape it. that's how LinkedIn lost that lawsuit. the data was public\n\nbut if you meant something else can you please share what you meant ",
              "score": 2,
              "created_utc": "2026-02-25 10:05:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7axh0j",
                  "author": "nlomb",
                  "text": "You should do some research on what you just said. You're reselling it that's where it's wrong. Read the Terms and Conditions. Those SaaS companies are mining data not reselling a wrapper based on the information. \n\n[https://maps.google.com/help/terms\\_maps/](https://maps.google.com/help/terms_maps/)\n\n* **Prohibited Conduct.** Your compliance with this Section 2 is a condition of your license to use Google Maps. When using Google Maps, you may not (or allow those acting on your behalf to):\n   1. redistribute or sell any part of Google Maps or create a new product or service based on Google Maps;\n   2. copy the content (unless you are otherwise permitted to do so by the [Using Google Maps, Google Earth, and Street View](https://www.google.com/permissions/geoguidelines/) permissions page or applicable intellectual property law, including \"fair use\");\n   3. mass download or create bulk feeds of the content (or let anyone else do so);\n   4. use Google Maps to create or augment any other mapping-related dataset (including a mapping or navigation dataset, business listings database, mailing list, or telemarketing list) for use in a service that is a substitute for, or a substantially similar service to, Google Maps; or\n   5. use any part of Google Maps with other people's products or services for or in connection with real-time navigation or autonomous vehicle control, except through a specific Google-provided feature such as Android Auto.",
                  "score": 1,
                  "created_utc": "2026-02-25 10:25:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7b1mm6",
          "author": "CapMonster1",
          "text": "Some builders running Playwright-based pipelines pair them with CapMonster Cloud to automatically handle verification challenges and keep large scraping runs consistent. It integrates easily into browser automation and helps reduce manual interruptions. If you ever want to test it in your scraper, we can provide a small test balance so you can see how it performs under heavier loads.",
          "score": 1,
          "created_utc": "2026-02-25 11:02:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d4952",
          "author": "drunkenweed",
          "text": "Interesting. So the existing places API + email enrichment?",
          "score": 1,
          "created_utc": "2026-02-25 17:48:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7d6ep2",
              "author": "Smart-Total-7099",
              "text": "No API in the equation, you just input the place, the profession and it finds the leads with their emails, phone numbers and websites",
              "score": 0,
              "created_utc": "2026-02-25 17:58:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r8us18",
      "title": "interactive product walkthroughs boost activation… so why do some teams regret adding them?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1r8us18/interactive_product_walkthroughs_boost_activation/",
      "author": "Gdonadi2",
      "created_utc": "2026-02-19 09:28:48",
      "score": 8,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "\n\n\n\nI’m researching interactive product walkthrough tools for SaaS and would love real-world feedback from people who’ve actually used them for onboarding, sales demos, or product marketing. I’m not talking about simple screen recordings, but clickable, guided product tours where users can explore flows, follow tooltips, and understand how the product works without jumping on a live call. The goal is to reduce repetitive demos, improve onboarding, and help prospects or users reach value faster.\n\nThe tools I keep seeing mentioned are Navattic, Storylane, Supademo, Product Fruits, WalkMe, and even open-source options like GuideChimp. Navattic is known for no-code, website-embedded tours that simulate real product interactions. Storylane supports persona-based branching demos. Supademo focuses on speed and quick updates when your UI changes. Product Fruits and WalkMe lean more toward in-app onboarding and digital adoption, while GuideChimp is attractive for teams that want full control and customization without SaaS pricing.\n\nWhat I’m trying to understand is what holds up after three to six months of real use. Did maintenance become painful after product updates? Did these tools genuinely improve activation, demo-to-meeting conversion, or feature adoption, or did they just look impressive on landing pages? If you’ve implemented interactive product walkthrough software, what metrics did you track and what would you do differently if you were starting again?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1r8us18/interactive_product_walkthroughs_boost_activation/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o67rzmf",
          "author": "Extra-Motor-8227",
          "text": "the biggest issue is maintenance hell after 6 months, your UI changes and suddenly half your walkthroughs are broken pointing to buttons that moved or don't exist. we saw 40% higher activation initially but spent 2 hours every week fixing tours, eventually just went back to loom videos and scheduling more demos",
          "score": 2,
          "created_utc": "2026-02-19 09:43:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67tkwd",
              "author": "GL103",
              "text": "that’s real, the activation bump is great until the upkeep eats your time. did you try limiting it to just one core flow that rarely changes, or was the product evolving too fast for even that to work?",
              "score": 1,
              "created_utc": "2026-02-19 09:58:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o67tfjb",
          "author": "GL103",
          "text": "a lot of teams add interactive walkthroughs expecting higher activation, but without tight scoping and clear value they often just create more clicks instead of more outcomes.",
          "score": 1,
          "created_utc": "2026-02-19 09:57:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69snhj",
          "author": "Outside_Economy9924",
          "text": "I've seen consensus mentioned as a good option for this",
          "score": 1,
          "created_utc": "2026-02-19 17:12:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a3jdb",
          "author": "Cumbrian1970",
          "text": "Most people say walkthroughs work best when they answer one clear question instead of trying to replace the whole demo or onboarding. Tools like Navattic and Storylane are good for early exploration, and some teams use Consensus to qualify interest before a live call. The problems usually start when companies build too many flows and have to keep fixing them after every UI change. The teams that see results focus on 2–3 key paths and track real activation tied to revenue, not just tour clicks.",
          "score": 1,
          "created_utc": "2026-02-19 18:04:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6btc79",
          "author": "KoalaInPain",
          "text": "The fact that some many tools exist is imo validation in itself that the tools work and provide actual value. Most of these tools are also stupidly expensive so they must be doing something right.\n\nMaintenance can be difficult if your UI is constantly changing, but you can combat that by using good stable selectors for example IDs, or data selectors. But for example, Produktly makes this easy by providing a visual selector tool that automatically finds the best selector for the element you want to highlight / action on.",
          "score": 1,
          "created_utc": "2026-02-19 23:08:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6c06ry",
          "author": "supportingthedogs",
          "text": "the regret usually comes from maintenance hell. your UI changes, your tours break, and suddenly someone on the team owns this never-ending job of fixing selectors and updating steps. that's the dirty secret none of the landing pages talk about.\n\nthe tools that hold up long-term tend to be the ones that either screenshot-based so changes don't break them or are smart enough to adapt when your UI shifts. most of the ones you listed aren't really either.\n\nfull transparency: i'm a co-founder at Frigade which is in this space, so take this with a grain of salt, but the reason we built it was specifically because of that 3-6 month cliff you're describing. we went AI-native so guides actually self-update instead of breaking. still early but the teams using it aren't babysitting their tours anymore.\n\nthe metric i'd actually track btw isn't activation rate in week 1, it's what % of users complete the guide AND come back. most tools optimize for the former and ignore the latter.",
          "score": 1,
          "created_utc": "2026-02-19 23:49:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g3gt3",
          "author": "ProductFruits",
          "text": "Hey user onboarding platform here. I have some insight that may help you.\n\nMost teams regret interactive walkthroughs for one of two reasons: they shipped a “tour of the UI” instead of a fast path to a first result, and then they got stuck maintaining a bunch of steps that nobody actually needed.\n\nWhat holds up long-term is usually not the walkthrough itself. It’s whether you can keep a single first-success path working as the product changes.\n\nWhere it goes wrong in practice:  \n1. you overproduce it. You build a 10 step guided flow that explains everything. It demos well. In the real app it’s friction. Users skip, click off, or follow it once and still do not reach a meaningful outcome.\n\n2. it’s not tied to intent. A great walkthrough for persona A is noise for persona B. If you do not segment by “what are you here to do today”, you end up with a generic flow that helps nobody.\n\n3. maintenance becomes a tax.  Every UI change breaks selectors or the logic of the steps. The worst part is not fixing the tour. It’s losing trust internally because the tour is now wrong and support starts apologizing for it. \n\n1 and 2 is on you. This requires a deep knowledge of the app and the user intent plus some rudimentary UX. 2 is easily achievable with segmentation.  \n3 is on us (meaning the vendors in general). A good example is Product Fruits text-targeting or the newly released AI-fingerprinting. This will never be 100% bulletproof, but the 80% we're getting is a huge improvement over it breaks-with-every update.\n\nHope it helps, it's only a tool and the power of the tool is in the hand of the user. ",
          "score": 1,
          "created_utc": "2026-02-20 16:30:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mjhv4",
          "author": "Confident-Tank-899",
          "text": "We tested this and the metrics were interesting. Demo tours helped first-time engagement but didn't move retention. The magic was when we used them to highlight the 'aha moment' specifically—not the whole product. Narrower focus = higher completion. We're now building minimal tours that show one job-to-be-done, and early cohort data shows better D7 retention. Walkthroughs work when they're targeted, not comprehensive.",
          "score": 1,
          "created_utc": "2026-02-21 16:50:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ranbwj",
      "title": "You don't have a product problem. You have a lead problem.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1ranbwj/you_dont_have_a_product_problem_you_have_a_lead/",
      "author": "Confident_Box_4545",
      "created_utc": "2026-02-21 09:54:34",
      "score": 7,
      "num_comments": 14,
      "upvote_ratio": 0.89,
      "text": "And you're solving it wrong.\n\nBuying lists. Scraping emails. Running ads to cold audiences. Posting and praying.\n\nThen blaming the market.\n\nThe market's fine. You're just fishing in the wrong pond.\n\nRight now, someone on Reddit is typing \"looking for a web developer.\" Someone on LinkedIn just posted \"any good cold email agencies?\" Someone in a Slack group is asking \"what CRM do you actually use?\"\n\nThat's not noise. That's a hand raised.\n\nA lead isn't someone who liked your post. A lead is someone who already admitted they have the problem you solve.\n\nMost founders are out here trying to create demand. Meanwhile, demand is just... sitting there. Public. Searchable. Fresh.\n\nStop manufacturing. Start finding.\n\nYou don't need a big audience. You don't need a funnel with 11 steps. You don't need to go viral.\n\nYou need to show up in the right place, five minutes after someone asks the question you've been building an answer to for years.\n\nOne person. Right moment. Relevant reply.\n\nThat's a pipeline.\n\nSo if your calendar is empty, don't ask \"how do I get more followers.\"\n\nAsk where are people already begging for what I built?\n\nThat answer is worth more than any ad you'll ever run.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1ranbwj/you_dont_have_a_product_problem_you_have_a_lead/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6kz2s5",
          "author": "trainmindfully",
          "text": "i agree with the core idea but i think it’s incomplete. capturing existing demand is powerful, especially in communities where people are actively asking for solutions. that’s usually higher intent than blasting cold traffic. but for most businesses, that pool is limited and competitive. if you only rely on hand raisers, you cap your ceiling pretty fast. the sweet spot is usually both. show up where demand already exists, and build systems that create awareness upstream so more people eventually raise their hand for you specifically.",
          "score": 2,
          "created_utc": "2026-02-21 10:47:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ruy9g",
              "author": "Confident_Box_4545",
              "text": "I don’t disagree with building upstream awareness. I just see too many founders skip the obvious step.\n\nIf you haven’t captured the people already asking for your solution, you haven’t proven your offer converts. Awareness just amplifies whatever’s broken.\n\nSequence matters. Nail the hand raisers first. Then build the machine on top of something that already works.",
              "score": 1,
              "created_utc": "2026-02-22 14:12:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6q42at",
          "author": "bigsparra",
          "text": "I'm interested to know what methods you use to identify these people. For example, I sell coffee. Is there a way of monitoring socials and Reddit for people in my location who are looking for coffee recommendations?",
          "score": 2,
          "created_utc": "2026-02-22 05:17:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qs6c5",
              "author": "Confident_Box_4545",
              "text": "100% there is shoot me a dm lets talk",
              "score": 1,
              "created_utc": "2026-02-22 08:56:02",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6qsr23",
              "author": "Organic-Maximum-7334",
              "text": "yeah you can. set up Google Alerts for \"best coffee\" + your city, and use Reddit search with \"near me\" or neighborhood names. are you local delivery or a physical shop? that changes the keywords a lot.",
              "score": 1,
              "created_utc": "2026-02-22 09:01:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6xrhop",
                  "author": "bigsparra",
                  "text": "I roast the coffee so I guess I'd be looking for customers asking about either supply for business or use at home.",
                  "score": 1,
                  "created_utc": "2026-02-23 11:55:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6m9m6j",
          "author": "-listnr",
          "text": "Neat, [Listnr](https://listnrapp.com) is great for social listening.",
          "score": 1,
          "created_utc": "2026-02-21 16:01:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6pioeb",
          "author": "kubrador",
          "text": "this is just \"be in the right place at the right time\" wrapped in a motivational bow. wild that we had to invent growth hacking to rediscover that people who want your thing are easier to sell to than people who don't.",
          "score": 1,
          "created_utc": "2026-02-22 02:45:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra08vx",
      "title": "my outreach bot books more meetings than I ever did manually and the secret is an 8 page document nobody wants to write",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1ra08vx/my_outreach_bot_books_more_meetings_than_i_ever/",
      "author": "Popular-Cap-9013",
      "created_utc": "2026-02-20 16:37:20",
      "score": 6,
      "num_comments": 10,
      "upvote_ratio": 0.88,
      "text": "I replaced a sales rep with a bot I built myself and its outperforming every human BDR I've ever worked with\n\nok before anyone comes at me this isnt about firing people or whatever. we're a team of 3 and we were never gonna hire a BDR at this stage anyway. but we needed meetings booked and I didnt want to spend 4 hours a day doing cold outreach manually like I used to\n\nso I built a system. not a saas, not a product, just a workflow for us internally. heres roughly what it does\n\nfirst it scrapes prospects based on an ICP doc that I spent like half day building. and honestly thats the part nobody wants to do. most people write a one paragraph ICP and wonder why their outreach sucks. mine is like 8 pages. industry, company size, revenue range, tech stack, hiring patterns, pain points by role, objections by seniority level. the bot is only as smart as what you feed it\n\nthen it enriches the data. linkedin profiles, company info, recent news, job postings. because a cold email that says \"I noticed youre hiring a marketing manager\" actually gets opened. a cold email that says \"hi I help companies like yours\" goes straight to trash. we all know this but nobody wants to put in the work to personalize at scale. thats what the bot does\n\nthen it writes the sequences. not generic templates. actual personalized emails based on what it found about each prospect. and I have it running on linkedin too doing connection requests with custom notes\n\nthe whole thing runs while I'm doing other stuff. I wake up and theres replies in my inbox and meetings in my calendar that I didnt manually set up\n\nnow heres the thing people get wrong about this. they think the AI part is the hard part. its not. the hard part is the ICP doc. its the thinking. its sitting down for half a day and really figuring out who your ideal client is, what keeps them up at night, what words they use to describe their problems, what makes them say yes vs what makes them ghost you\n\nI've seen people build incredible automation workflows with terrible ICPs and then wonder why nobody replies. garbage in garbage out. doesnt matter how good your tech stack is.\n\nthe other thing is you still need to know how to sell. the bot books the meeting. I still need to show up and close. if you cant sell on a call the best outreach system in the world wont help you. I've been selling since I was in my early 20s working retail and honestly thats the skill that made everything else possible. not the tech\n\nalso quick note for people wondering about deliverability. if you're sending 500 cold emails a day from one domain you're gonna get destroyed. warm up your domains, rotate them, keep volume reasonable per domain. the bot handles this but you need to set it up properly or you'll burn your reputation in a week\n\nanyway not trying to sell anything here I dont even have a product lol. just wanted to share because I spent years doing outreach manually and I cant believe how long I waited to automate this. the roi on the time I spent building it was probably the best investment I made this year\n\ncurious if anyone else built their own outreach system from scratch vs using an off the shelf tool. what are you using and hows it working",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1ra08vx/my_outreach_bot_books_more_meetings_than_i_ever/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6hc2ub",
          "author": "leadg3njay",
          "text": "The 8-page ICP is the most underrated advice, automation only works if your targeting is precise. Warm each domain before use, start small, and set up tracking with SSL. Enrichment like hiring signals and role-specific pain points separates a 3% reply rate from 0.3%. Automation keeps your calendar full so reps get the practice they need.",
          "score": 3,
          "created_utc": "2026-02-20 19:55:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ggrbk",
          "author": "Designer_Money_9377",
          "text": "One thing that really makes a difference is having a super detailed ICP, like you said. I've tried to shortcut that part before, and the outreach always falls flat, no matter how good the tools are. It's definitely the \"garbage in, garbage out\" principle in action.\n\nI've tried a few different approaches, from manual scraping to using some of the bigger outreach platforms. LeadsRover has been pretty helpful for finding those high-intent leads on Reddit and drafting responses that sound natural, which saves a ton of time. You still need to guide it with a good ICP, but it handles a lot of the initial legwork.\n\nI think the key is really committing to that upfront research. It's not the most exciting work, but it pays off way more than tweaking email copy for hours.",
          "score": 2,
          "created_utc": "2026-02-20 17:31:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6k9qa4",
          "author": "RecognitionHot9149",
          "text": "Awesome share - a few questions\n\n1) can you use a bot to help you warm up emails\n2) how long did it take you the train the bot?\n\nI don’t have a sales background so prob wouldn’t be as easy for me to make one",
          "score": 2,
          "created_utc": "2026-02-21 06:40:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79c0uo",
              "author": "Popular-Cap-9013",
              "text": "1. I use instantly.ai the emails you buy are prewarmed so I prefer to use it\n2. You need to setup your bot correctly first then show him step by steps what to do then give him all the apis key. It's quite technical. But you just ask claude 4,6 opus pro to break it down for you and explain step by steps process to achieve it and you will be fine. When you don't understand you just say explain me like I'm 8 years old. And he will use a basic vocabulary so you will be able to go through it.",
              "score": 1,
              "created_utc": "2026-02-25 02:54:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6n0lbf",
          "author": "ShaperSaaS",
          "text": "Spend time on a detailed ICP doc; it's worth every minute. Mine's 8 pages and it changed everything for our outreach. Personalizing emails with enriched data like LinkedIn profiles and recent news is key. I used to do it all manually and this bot setup just gets me more meetings.\n\n\n\nI've tried automating Reddit prospecting too; Reppit AI has been great for scaling that. But remember, even with the best tech, you still need to nail the sales call. It's all about balance.",
          "score": 1,
          "created_utc": "2026-02-21 18:16:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6nijn9",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-02-21 19:45:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6sg2o1",
          "author": "Tartiflan1",
          "text": "the crazy part isn’t the bot, it’s the 8-page ICP doc. most people want automation without clarity. they’d rather tweak subject lines than spend half a day thinking deeply about who they actually help. this is basically “garbage in, garbage out” at scale. the bot just amplifies the quality of your thinking. also respect for pointing out that closing still matters. too many people think automation replaces selling when it really just earns you the shot",
          "score": 1,
          "created_utc": "2026-02-22 15:58:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6sm71d",
              "author": "Popular-Cap-9013",
              "text": "Yes no worries man hope that it was helpful",
              "score": 2,
              "created_utc": "2026-02-22 16:24:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72zt5o",
          "author": "Sven8228",
          "text": "The ICP doc thing is so real. I spent ages with like a 2 sentence description of our target customer and couldn't figure out why my reply rates were garbage. Finally sat down and wrote out like 5 pages... pain points by role, specific objections, even the language they use on linkedin. Night and day difference.\n\nOne thing I'd add on the deliverability side since you mentioned it briefly - the domain rotation stuff is where most people completely screw themselves. I was burning through domains before I started using maildoso to handle that whole setup, the SPF/DKIM/DMARC stuff was killing me trying to do it manually across like 12 domains. Not saying everyone needs that but if you're running volume it saves a lot of headaches.\n\nCurious about your enrichment step though - are you using clay for that or something custom? Thats the part of my workflow that still feels janky tbh. Like sometimes the data is just... wrong, and then the personalization sounds dumb because its referencing a job posting from 8 months ago or whatever.",
          "score": 1,
          "created_utc": "2026-02-24 04:40:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra70sm",
      "title": "We boosted form completion from 2% to 11% by removing one friction point",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1ra70sm/we_boosted_form_completion_from_2_to_11_by/",
      "author": "PainEmbarrassed378",
      "created_utc": "2026-02-20 20:47:19",
      "score": 6,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "Our lead capture form was performing terribly—around 2% conversion. We tried all the growth hacks: fewer fields, better copy, exit-intent popups. Marginal gains.\n\nThe breakthrough came when we looked at \\*how\\* people were submitting. Over 70% of our traffic was mobile. Watching session recordings, you could see people start typing, pause, and bounce. The friction was typing itself.\n\nSo we built a simple widget that let visitors record a voice message instead. One click to start, guided by a prompt. I can share in DM if you're curious.\n\nThe result wasn't incremental. Form completion jumped to 11% almost immediately. But the bigger win was lead quality. Instead of getting 'Hi, interested' we got 90-second messages explaining exactly what they needed, their budget, and their timeline. The sales team could hear urgency and excitement. Qualification time dropped by about 70%.\n\nThe lesson for growth hackers: sometimes the biggest lever isn't optimizing the existing process, but changing the medium entirely. For mobile-heavy sites, senior audiences, or any service where context matters, asking people to talk might be the highest-impact test you can run.\n\nHas anyone else experimented with alternative input methods (voice, video) on forms? What were your results?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1ra70sm/we_boosted_form_completion_from_2_to_11_by/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o6hn4yd",
          "author": "Wooden-Term-1102",
          "text": "This is such a smart insight. Switching the input method instead of just tweaking fields is a game changer, especially for mobile users. Love how it not only boosted conversions but also improved lead quality. Makes me wonder how much untapped potential there is in rethinking other standard forms with voice or video.",
          "score": 2,
          "created_utc": "2026-02-20 20:50:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6i0f0k",
              "author": "PainEmbarrassed378",
              "text": "Thank you for jumping in!! \n\nI think there's huge untapped potential beyond lead forms too : support tickets with voice walkthroughs, surveys that feel like chats, job apps where personality shines, e-comm Q&A via quick video, etc. etc. etc. etc.",
              "score": 1,
              "created_utc": "2026-02-20 21:56:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jcz65",
          "author": "pbalIII",
          "text": "Built a healthcare intake flow that replaced a 12-field form with guided voice prompts. Completion jumped almost immediately.\n\nBut the hidden cost was downstream... sales had to manually listen to every recording to extract budget, timeline, use case. Without auto-transcription pulling structured fields from the audio, the volume increase would've burned the team.",
          "score": 2,
          "created_utc": "2026-02-21 02:38:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6nzaaq",
              "author": "PainEmbarrassed378",
              "text": "Yeah that's classic voice intake trap. You slash form friction but then the ops/sales bottleneck shifts downstream to manual audio review. Without structured extraction, it's like trading form abandonment for listening fatigue ahah\n\nIn our app we're seeing the same pattern in early healthcare-ish flows where people finish guided prompts way faster than typing but raw recordings pile up fast if someone's manually pulling budget/timeline/use-case/whatever.\n\nFrom what I've dug into lately (2026 landscape), tools like AssemblyAI, Corti, or even general ones like Vapi/Bolna with structured outputs are nailing this for healthcare/lead flows—real-time transcription + NLP to map spoken answers to predefined fields (e.g., \"budget is around 5-10k next quarter\" → {budget\\_low: 5000, budget\\_high: 10000, timeline: \"Q2\"}). HIPAA-compliant options exist too if it's sensitive patient data.\n\nProps for catching it early and sharing!!! Saves a ton of pain for others going voice-first :) ",
              "score": 1,
              "created_utc": "2026-02-21 21:14:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6l0wcx",
          "author": "crawlpatterns",
          "text": "That’s actually a smart observation about mobile friction. Typing on a small screen, especially for longer answers, is a bigger barrier than most of us admit.\n\nThe jump in quality makes sense too. When someone records 60 to 90 seconds, that’s real intent. I’d be curious how it performs across different audiences though, since some people might hesitate to speak out loud depending on context.",
          "score": 2,
          "created_utc": "2026-02-21 11:04:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6nzo04",
              "author": "PainEmbarrassed378",
              "text": "I genuinely think that quality jump is real because people ramble naturally when speaking, revealing nuances typing skips ahaha\n\nAnd yep, hesitation is a thing especially in public. I've seen studies showing 50-78% of users feel awkward using voice in public spaces (due to privacy, looking \"weird,\" or being overheard). \n\nIn private/home/office flows (like intake forms or async messaging), it crushes. In public/on-the-go, some bail or default to typing.\n\nWe're testing audience segmentation in our app (age, device context, referrer) to see drop-off by scenario... early data shows private contexts convert 2-3x better on voice!!",
              "score": 1,
              "created_utc": "2026-02-21 21:16:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6pja6l",
                  "author": "N945LA",
                  "text": "Please share just one example of a study that backs that up",
                  "score": 2,
                  "created_utc": "2026-02-22 02:49:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6l5082",
          "author": "N945LA",
          "text": "If you’re only getting 2% I really think you should rework the form entirely. Autofill comes with phones by default and should what most users press to one shot standard interest forms. How many questions do you have and are  they all required? I’ve built countless forms and have yet to add a voice note option for a few reasons beyond inefficiency. Am I, HubSpot and all other big CRMs missing out on this one simple trick?",
          "score": 2,
          "created_utc": "2026-02-21 11:43:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6o0b54",
              "author": "PainEmbarrassed378",
              "text": "Quick rundown on what usually kills conversions (from tons of form tests I've seen/ran) :\n\n* Best practices point to 3-5 fields max for high conversion (often 20-50% lifts when dropping from 4+ to 3). Every extra field adds friction and required ones scare people off more. HubSpot data and others show reducing from 4 to 3 can boost \\~50%. If yours has 6+, make non-essentials optional or multi-step.\n* Phone/email often optional skyrockets completion (some tests double rates). Only force what's truly needed to qualify/respond.\n\nAlso big CRMs like HubSpot don't natively support voice recording/input in embedded forms (they have IVR for calls, voice-to-text for internal notes via extensions, or AI agents for outbound, but not user-submitted voice in lead forms). It's rare because of tech complexity, privacy/compliance and some users love it for detail/richness, but others hesitate (public spaces, accent issues, longer commitment).\n\nWe've seen 2-3x completion in private contexts with guided voice vs. text forms in our app tests.\n\nNot saying ditch traditional forms butttttttttt hybrid works!",
              "score": 1,
              "created_utc": "2026-02-21 21:19:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6lxul4",
          "author": "Far_Move2785",
          "text": "Nice catch on the form friction. Voice messaging is smart.\n\nThis might not be your exact problem but I had huge conversion issues too. Turned out most of my drop off was from in-app browsers.\n\nWhen people click ads on Instagram/Facebook/TikTok they land in those app browsers and those things are terrible for checkout. No credit card autofills, no Apple Pay, and way slower.\n\nMy conversion was 1.2% in those browsers vs 4% in Safari.\n\nFix was routing people to their real browser before checkout. Saw 15% revenue lift from same ad spend.\n\nCheck your analytics for conversion by browser. If Instagram or Facebook is way lower than Safari that's your leak.\n\nhttps://tryhoox.com handles the redirect automatically if you want to test it",
          "score": 2,
          "created_utc": "2026-02-21 15:00:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6nyf04",
              "author": "PainEmbarrassed378",
              "text": "Thanks for the solid insight and sharing your numbers!!\n\nYeah, agreed, in-app browsers are silent killers for a ton of flows right now. I've seen similar leaks in a bunch of early Lissn tests (that's our app), mobile social traffic would look hot on top-of-funnel metrics but then crater at checkout/submit. Your redirect-to-native-browser fix is spot on and aligns with what a lot of DTC/SaaS folks are doing in 2026. The lift you got (15% revenue from same spend) is right in the typical 10-25% range I've heard from others who've patched it sometimes even higher on mobile-heavy funnels.\n\nFor our app right now we're testing a combo of :\n\n* Custom link wrappers on our ad destinations to force external browser opens where possible\n* Some lightweight JS detection on landing to nudge users if it's still stuck in-app\n* Heavy segmentation in analytics (browser + referrer + device) so we can quantify the exact delta like you did\n\nCurious about what % of your total traffic was coming through those in-app browsers before the fix? Did you notice any uptick in retargeting performance after since cookies/pixels behave better outside the walled gardens?",
              "score": 1,
              "created_utc": "2026-02-21 21:09:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6qrfn4",
                  "author": "Far_Move2785",
                  "text": "Yes, retargeting got better, but not by a lot - it's very hard to measure  \nDrop your app's link here so we can check it out",
                  "score": 2,
                  "created_utc": "2026-02-22 08:48:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}