{
  "metadata": {
    "last_updated": "2026-02-01 08:57:56",
    "time_filter": "week",
    "subreddit": "GrowthHacking",
    "total_items": 20,
    "total_comments": 94,
    "file_size_bytes": 110940
  },
  "items": [
    {
      "id": "1qnmxd2",
      "title": "Is anyone actually happy with their GTM setup",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qnmxd2/is_anyone_actually_happy_with_their_gtm_setup/",
      "author": "EnvironmentalCar761",
      "created_utc": "2026-01-26 17:40:29",
      "score": 45,
      "num_comments": 11,
      "upvote_ratio": 0.98,
      "text": "Serious question.  \nEvery team I talk to seems at least mildly unhappy with their GTM setup. Either the data is messy, workflows are fragile, sales and ops are misaligned, or everything takes too long to change.  \nEven teams with solid revenue numbers seem to be duct taping systems together behind the scenes.  \n  \nIs anyone here genuinely happy with how their GTM works today.  \nIf yes, what does your setup look like and how long did it take to get there.  \nIf not, what is the biggest thing that feels broken right now.  \n  \nMostly asking because I am trying to figure out whether this is just normal or if good GTM systems actually exist.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qnmxd2/is_anyone_actually_happy_with_their_gtm_setup/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o204mcx",
          "author": "IcebergPoet115",
          "text": "From what I have seen, teams that feel ok about their GTM usually have a simple core. Salesforce or HubSpot as the source of truth, then a small number of systems doing very specific jobs.\n\nA common pattern is using the CRM for record keeping, something like Clay for enrichment, research, and signals, and then letting sales tools focus purely on execution. The happier teams avoid having five different places modifying data. Most of the pain comes from data being enriched, scored, and “interpreted” in multiple tools at once. Once that happens, reporting and alignment fall apart. I still do not think anyone is truly done. The teams that feel good just have fewer moving parts and touch their system less often.",
          "score": 11,
          "created_utc": "2026-01-27 12:18:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27mrvc",
              "author": "EnvironmentalCar761",
              "text": "Nice, like your stack. Yeah no one seems to be completely happy by the looks of it but at least they're working with what they have the best they can. Thanks for the comment, cheers!",
              "score": 1,
              "created_utc": "2026-01-28 13:37:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1uyora",
          "author": "Live-Peanut-7647",
          "text": "I don’t think anyone is ever fully happy — the best GTM setups I’ve seen just minimize decision lag and accept tradeoffs instead of chasing a “perfect” stack.",
          "score": 1,
          "created_utc": "2026-01-26 17:58:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27n31m",
              "author": "EnvironmentalCar761",
              "text": "All the comments seem to agree with that lol, appreciate the comment!",
              "score": 1,
              "created_utc": "2026-01-28 13:39:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1w930s",
          "author": "OkDependent6809",
          "text": "no ones happy with it\n\nweve been at it 4 years and still messy. attribution is guessing, sales and marketing blame each other, data never matches across systems\n\nbiggest issue is everything takes forever to change. by the time you ship something the strategy already shifted\n\ndont think anyone has it actually figured out tbh",
          "score": 1,
          "created_utc": "2026-01-26 21:19:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20voo9",
              "author": "EnvironmentalCar761",
              "text": "It really is that kind of environment, constantly shifting, it's getting pretty hard to try and catch up to everything ALL THE TIME!",
              "score": 1,
              "created_utc": "2026-01-27 14:48:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o20ix2u",
          "author": "Maleficent_Craft_774",
          "text": "Totally get where you’re coming from, I’ve chatted with dozens of founders in the same boat. Even teams pulling decent revenue often feel like their GTM is held together with hope and spreadsheets. \n\nThe “duct tape” vibe is real, attribution fights, slow iteration, sales/marketing silos, or just everything moving at glacial speed.\n\nThe setups that feel solid tend to come from forcing clarity early and shipping fast to get real signals.",
          "score": 1,
          "created_utc": "2026-01-27 13:44:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g6t09",
          "author": "MORPHOICES",
          "text": "That line — *“only ones they’d stopped fighting”* — is painfully accurate. \\~\n\nEvery GTM I’ve ever seen that “worked” had two traits:\n\n1. It was a little messy.\n2. The mess was intentional.\n\nThe duct tape isn’t the failure. **Freezing it is.**\n\nWhat breaks teams isn’t bad GTM design — it’s **GTM calcification**. Markets shift, pricing shifts, ICPs drift, channels decay… and the system quietly insists everything is still true. Then people start working *around* it instead of *with* it.\n\nYour reframing is the right one: GTM as a changeable surface, not a finished machine.\n\nA few patterns I’ve seen that help teams stop fighting it:\n\n* **Short GTM half-lives** Treat ICPs, messaging, and channels as hypotheses with expiration dates. If something hasn’t been revisited in 90 days, it’s probably lying to you.\n* **Make change cheap** If updating routing rules, qualification logic, or pricing takes a committee, you’ve already lost. The best setups assume they’ll be wrong and optimize for fast correction.\n* **One source of truth, not ten** Most GTM pain comes from contradictions: sales believes one thing, marketing another, RevOps something else. Alignment isn’t agreement — it’s shared visibility.\n* **Accept unevenness** A GTM that works will always feel slightly unfair: one channel overperforming, one segment hogging resources, one motion clearly dying. That’s not a bug; it’s a signal.\n\nThe real maturity move is realizing:  \nA clean GTM is usually a **lagging indicator**.  \nA resilient GTM is a **leading one**.\n\nIf the system can bend without breaking — and without exhausting the people inside it — you’re probably doing better than you think.",
          "score": 1,
          "created_utc": "2026-01-29 17:47:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uzw7g",
          "author": "No-Subject-1428",
          "text": "The 'duct tape' feeling usually happens because native integrations between CRM and sales tools are super limited and break easily. You can fix this by moving your logic into a workflow engine like n8n or Make.com, which lets you build a centralized 'brain' that handles your lead routing and data syncing properly without the fragile workarounds.",
          "score": 0,
          "created_utc": "2026-01-26 18:04:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1v5nhj",
              "author": "agin_",
              "text": "Do you have any interesting reading on this to recommend?",
              "score": 1,
              "created_utc": "2026-01-26 18:28:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o25stct",
          "author": "Analytics-Maken",
          "text": "Duct tape GTM setups come from data getting touch across multiple tools, creating sync conflicts and fragile workflows. You can use ETL tools like Windsor.ai to create a centralized source of truth, preserve granularity, and avoid schema drift.",
          "score": 0,
          "created_utc": "2026-01-28 05:01:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpbrrc",
      "title": "Growth hack that's not sexy but works",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qpbrrc/growth_hack_thats_not_sexy_but_works/",
      "author": "F4rewll",
      "created_utc": "2026-01-28 13:46:18",
      "score": 32,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Everyone wants the viral growth hack that 10x's their traffic overnight. Tried all the sexy tactics first. Product Hunt launch, viral Twitter threads, Reddit posting, influencer outreach. Got some spikes but nothing sustainable. The problem with sexy growth hacks is they produce one-time results. You get a spike, then you're back to grinding for the next spike. I needed something that would compound week over week without constant effort. Switched to the unsexy approach that most growth hackers skip because it's boring. Built SEO foundation through directory submissions and consistent content. Used [backlink agency to handle 200+ directory submissions](http://getmorebacklinks.org) in week one while I focused on finding actual growth levers.\n\nWeek one through three looked like nothing was happening. Directory listings went live slowly and traffic stayed flat around 50 visitors. This is why most growth hackers abandon SEO, no immediate dopamine hit like a viral post provides. Week four is when the compound effect started. Domain authority moved from zero to 16. A few blog posts started appearing on page two for longtail keywords. Traffic hit 180 visitors, small but growing consistently without any new effort from me.\n\nWeek five through eight the growth accelerated. Domain authority reached 22 and traffic climbed to 850 visitors. Published 6 blog posts total but the bigger factor was older content moving up in rankings as authority increased. Each post produced more value over time instead of spiking then dying. The growth rate is what changed my thinking. Viral tactics gave me 500 visitors one day then 20 the next. SEO foundation gave me 120 visitors week one, 180 week two, 340 week three. The trajectory was predictable and sustainable. Now eight weeks in and traffic keeps climbing without me chasing new growth hacks. The foundation work compounds while I focus on product and conversion optimization. The visitors coming through organic search convert better too because they have real intent.\n\nThe growth hacking lesson is that boring systematic work beats clever one-time tactics. Directory submissions and content creation aren't exciting to talk about but they produce predictable compounding growth. Viral moments are lottery tickets, foundation work is compound interest. If you're burned out chasing growth hacks that produce temporary spikes, try building something that compounds. It's slower to start but way less exhausting than constantly hunting for the next viral moment.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qpbrrc/growth_hack_thats_not_sexy_but_works/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o27s6cu",
          "author": "kubrador",
          "text": "cool story but you just described seo, which people have been doing since 1998. calling it a \"growth hack\" is like calling a hammer an \"impact optimization tool.\"",
          "score": 1,
          "created_utc": "2026-01-28 14:05:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27ub10",
          "author": "One_Perspective971",
          "text": "curious, once authority kicked in, did new content start ranking faster or was it still slow at first?",
          "score": 1,
          "created_utc": "2026-01-28 14:16:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27wmxp",
              "author": "F4rewll",
              "text": "it was noticeably faster. once the domain had some trust, new posts started getting indexed and ranking in days instead of sitting there for weeks.",
              "score": 1,
              "created_utc": "2026-01-28 14:28:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27v2oq",
          "author": "GreatIdeal1954",
          "text": "the 2–3 week “nothing is happening” phase is exactly why most people quit SEO too early.",
          "score": 1,
          "created_utc": "2026-01-28 14:20:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27wh14",
          "author": "OkMetal220",
          "text": "Any startup should start exactly like this... make it your daily routine while you’re growing. Even if you have the budget to throw at ads from day one, it’s way better to validate the idea, build organic traffic, refine your strategies, and see what’s actually working. Once that’s dialed in, then you can scale with paid campaigns.",
          "score": 1,
          "created_utc": "2026-01-28 14:27:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28m49t",
          "author": "LouisLesavre",
          "text": "cold emailing prospects one by one works way better than blasting newsletters. spend 10 minutes personalizing each message with something specific from their site or recent post. you get 20-30% response rates if you target right, beats fancy automation tools that end up in spam. track opens and replies in a simple google sheet, tweak your template based on what converts. do 50 a week, you'll build a pipeline without burning cash on ads.",
          "score": 1,
          "created_utc": "2026-01-28 16:24:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2arpx7",
          "author": "jello_house",
          "text": "reddit spikes suck long-term just like you said. i used reddbot to automate natural comments on relevant threads while grinding seo frees up tons of time and keeps reddit traffic compounding steadily too. boring but effective af",
          "score": 1,
          "created_utc": "2026-01-28 22:03:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f1mhi",
          "author": "pantrywanderer",
          "text": " Exactly this. The unsexy, systematic stuff is where compounding happens. Viral spikes are fun, but they don’t scale predictably and often eat mental bandwidth chasing the next hit. Building a solid foundation, consistent content, backlinks, SEO basics, feels slow at first, but that steady growth is what actually moves the needle long term. From an operational perspective, I’ve seen clients burn themselves out chasing clever hacks, only to plateau, while the boring groundwork keeps delivering week after week.\n\n",
          "score": 1,
          "created_utc": "2026-01-29 14:40:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g7f8d",
          "author": "MORPHOICES",
          "text": "Yes — very much. And the way you’re describing it tells me you’ve actually *felt* the difference, not just understood it intellectually. \\~\n\nThat “carryover” lens is the quiet unlock most people never articulate. Spikes are addictive because they feel like proof. Compounding work feels broken because the feedback loop is delayed — sometimes insultingly so. Nothing happening, nothing happening, nothing happening… and then suddenly *everything* looks obvious in hindsight.\n\nI love this line in particular:\n\n>\n\nThat’s a brutal but accurate filter. It reframes growth from “What can I trigger?” to “What survives neglect?” The moment you stop feeding it, does it collapse — or does it coast?\n\nAnd you’re right about the emotional trap: compounding inputs feel unrewarding right when they’re most fragile. That’s where most people quit, not because the strategy is wrong, but because it doesn’t soothe anxiety fast enough.\n\nWhat you’re circling around is a deeper shift:\n\n* From **reactive energy** → **stored energy**\n* From **performance** → **accumulation**\n* From **attention** → **infrastructure**\n\nOnce you internalize that, growth stops feeling like something you *chase* and starts feeling like something you *set up*.\n\nSo yes — this conversation is helpful. It’s coherent, grounded, and unusually honest about the emotional side of building things that compound.\n\nIf you want to keep going, I’m curious:  \nwhat was the *first* boring input that finally proved itself to you?",
          "score": 1,
          "created_utc": "2026-01-29 17:50:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qod97r",
      "title": "Stop doing what Twitter tells you works and start measuring what converts.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qod97r/stop_doing_what_twitter_tells_you_works_and_start/",
      "author": "Unique-Persimmon2291",
      "created_utc": "2026-01-27 13:03:25",
      "score": 21,
      "num_comments": 11,
      "upvote_ratio": 0.87,
      "text": "\nFollowed every growth hack thread on Twitter for 6 months. Implemented 12 different tactics everyone said were \"game changers.\" Webinars, lead magnets, exit popups, chatbots, retargeting, influencer outreach, podcast guesting, cold email, LinkedIn automation, Twitter threads, TikTok content, newsletter swaps. Spent 600+ hours and $4,200 implementing everything. Only 2 tactics actually drove meaningful growth. The rest was noise. Webinars brought 12 signups from 3 sessions requiring 40 hours prep and promotion. Lead magnets got 340 downloads, 8 converted to customers. Exit popups annoyed users, increased bounce rate 12%. Chatbot got 89 conversations, zero conversions. Retargeting ads burned $800 for 4 customers. Influencer outreach got ignored 47 times, responded 3 times, zero partnerships.\n\nPodcast guesting landed 2 appearances after 30+ pitches. Got 6 trial signups total. Cold email had 2.1% response rate, zero customers. LinkedIn automation got account restricted. Twitter threads brought engagement but zero paying customers. TikTok required learning new platform, made 15 videos, got 340 views combined. Newsletter swaps with 3 creators brought 23 signups, 1 customer. The only 2 tactics that actually worked were SEO content and community engagement. Wrote 25 helpful articles targeting specific problems my customers searched. Ranked for 18 keywords within 8 weeks. Brought 280 organic signups over 6 months converting at 18%. Posted valuable insights in 9 subreddits and 4 Slack communities daily. Built reputation over 4 months. Brought 190 signups converting at 24%.\n\n[Studied FounderToolkit data comparing growth tactics across 1,000+ founders](http://foundertoolkit.org). SEO and community engagement had highest ROI for bootstrappers because they compound monthly without ongoing cost. Every other tactic required constant effort or budget. Write one good article, it brings traffic for years. Build one community relationship, it brings referrals forever. The controversial reality is most growth hacks work for funded startups with teams and budgets. For solo founders or small teams, only compounding organic channels matter. Everything else is distraction dressed as strategy. SEO takes 3-6 months to work. Community building takes 4-8 months. Nobody wants to hear that timeframe. Everyone wants viral growth hack.\n\nStop chasing tactics. Start doubling down on what compounds. Measure actual conversions, not vanity metrics.\n\nWhat growth tactic actually worked for you? Be honest about conversions, not engagement.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qod97r/stop_doing_what_twitter_tells_you_works_and_start/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o20dc6h",
          "author": "Any_Butterscotch_610",
          "text": "\n\ndo you think SEO and communities always win, or is that just because you stuck with them longer?",
          "score": 1,
          "created_utc": "2026-01-27 13:13:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20ljwj",
              "author": "Impossibu",
              "text": "partly time, but mostly intent. people searching or actively discussing a problem are already halfway to buying. everything else felt like interrupting strangers.",
              "score": 1,
              "created_utc": "2026-01-27 13:57:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o27cxbt",
          "author": "Major_Fill_670",
          "text": "I did a similar audit recently, cutting the \"distraction\" channels that weren't compounding. But I found a flaw in my data: my tests on paid channels didn't fail because the audience wasn't there. They failed because I was testing one mediocre video every two weeks.\n\nI can't afford a creative team, so I started using an Truepix ai ads agent to handle the heavy lifting. I feed it the product shots and specs, and it generates the full video ad--script, voiceover, visuals. it allows me to test 5-6 different hooks in the time it used to take me to edit one manually.\n\nTurns out, the channel wasn't dead, my sample size was just statistically insignificant. Hard to find a winner when you only take one shot.",
          "score": 1,
          "created_utc": "2026-01-28 12:39:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29abcs",
          "author": "AlternativePrimary44",
          "text": "The chatbot thing resonates hard. Most chatbots fail because they're just another tool you slap on the site with generic responses and zero context about what you actually sell. They feel robotic, annoying, and get zero conversions exactly like you found. I was stuck in that same cycle for months, testing tactics that gave me vanity metrics but nothing real. What finally changed things for me was realizing my site had a silent handoff problem. Visitors showed up, but nobody was there to welcome them, answer questions, or move them through the decision. I ended up testing something called [Getaman.co](http://Getaman.co) that's different from traditional chatbots because it actually lives on your site, understands your business and pricing, and has real conversations instead of scripted flows. Went from quiet site to getting actual qualified leads without chasing the next growth hack. Sometimes boring infrastructure beats clever tactics.",
          "score": 1,
          "created_utc": "2026-01-28 18:09:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2au5y2",
          "author": "unicorn69love",
          "text": "spot on, chasing twitter \"hacks\" is a total time suck engagement vanity metrics everywhere but zero revenue. seo and legit community stuff compound forever tho, cut the noise and double down on what your data shows works.",
          "score": 1,
          "created_utc": "2026-01-28 22:14:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2tf9ca",
          "author": "ComfortableRest4776",
          "text": "Can’t believe this got only 10 comments. Did the Twitter thing for a year and didn’t do squat. We need zero BS growth tactics,  honestly shared by people who have field tested it. I am tired of engagement farming BS. \nSomeone should start one or I am going to start one so we can all share notes.",
          "score": 1,
          "created_utc": "2026-01-31 17:00:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20citw",
          "author": "kubrador",
          "text": "yeah this is the real one. everyone's selling you their sexy tactic because \"here's my 69-slide framework\" gets more retweets than \"i wrote boring articles for 6 months and it quietly worked.\" seo and community don't have a snappy name so nobody threads about them.",
          "score": 0,
          "created_utc": "2026-01-27 13:09:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20g91l",
          "author": "Easy-Extension-6917",
          "text": "the amount of hours people sink into “trying everything” without tracking conversions is wild. engagement feels productive until you check revenue and nothing moved.",
          "score": 0,
          "created_utc": "2026-01-27 13:30:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22ccb9",
          "author": "Savings_Detective292",
          "text": "Great point! It's all about sustainable traction over quick fixes.",
          "score": 0,
          "created_utc": "2026-01-27 18:40:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrep5f",
      "title": "Built a tool that turns plain English into email campaigns",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qrep5f/built_a_tool_that_turns_plain_english_into_email/",
      "author": "Natural_System_6973",
      "created_utc": "2026-01-30 19:04:43",
      "score": 21,
      "num_comments": 3,
      "upvote_ratio": 0.97,
      "text": "\"Send to users who registered in the last 7 days but profile\\_complete = false, personalize with their name and days\\_since\\_signup\"\n\n\n\nI haven't find any email tool that has this flexibility to turn english to full campaign setup, either can't read your database or handle complex conditions.\n\nA tool that connects directly to your database and lets you describe campaigns in plain English. It handles the querying, personalization, and sending.\n\n\n\nLooking for: Technical founders who face this same problem. Would love to get your feedback and in return you'll get free credits to test it out.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qrep5f/built_a_tool_that_turns_plain_english_into_email/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o2nlw98",
          "author": "Natural_System_6973",
          "text": "Link: [https://elu.dev/](https://elu.dev/)",
          "score": 1,
          "created_utc": "2026-01-30 19:05:29",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o2p7zu0",
          "author": "TheRealJpn",
          "text": "Beautiful. Love it",
          "score": 1,
          "created_utc": "2026-01-30 23:49:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2pc2e4",
              "author": "Natural_System_6973",
              "text": "Give it a try, let me know: [https://elu.dev/](https://elu.dev/)\n\nIt took me exactly 14 seconds to build a complex, data driven \"Power User\" flow.\n\nhttps://preview.redd.it/h26ovs8fukgg1.png?width=2674&format=png&auto=webp&s=360427e4665f4fd9993de7fcac44d3ce3063d4a9",
              "score": 1,
              "created_utc": "2026-01-31 00:11:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qr2wq8",
      "title": "Pro tip: Infographics work better than slides",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qr2wq8/pro_tip_infographics_work_better_than_slides/",
      "author": "Minimum_Pear9193",
      "created_utc": "2026-01-30 11:28:05",
      "score": 21,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Sharing long winded insights internally or with clients using ling slide decks; almost always ignored. Forwarded once and quickly forgotten. When the same info is presented as a **single infographic or visual summary** we get so much engagement and \"key stakeholders\" actually remember and reference numbers. \n\nLooks like people engage more when they can see the whole story at once instead of clicking through 20 slides. Especially for things like performance summaries, process explanations and high level takeaways. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qr2wq8/pro_tip_infographics_work_better_than_slides/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o2l6nay",
          "author": "FamousTechnology9618",
          "text": "The key differentiator is information density vs audience attention span. Infographics work when you need poeple to retain a complete narrative without your presence. Slides work better when you're there to guide the story and field questions in real-time",
          "score": 1,
          "created_utc": "2026-01-30 11:58:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l6vll",
          "author": "Beneficial_Fee_613",
          "text": "Yeah but most teams don't have the design skills/inclination to create effective infos at scale. Slides are easy access and anyone can make them, even if they're not always the best.",
          "score": 1,
          "created_utc": "2026-01-30 11:59:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l96kz",
          "author": "Own_Battle5956",
          "text": "What about interactive dashboards? Especially for performance summaries and ongoing processes. Tools like Visme, Tableau, or even a good old fashioned Notion page let stakeholders explore the data at their own depth level. \n\nInfographics are great for one time comms or fixed narratives but if you're updating monthly or quart the production overheads add up. Slides can be update efficiently but lack engagement dashboards can be both engaging and maintainable. Just food for thought.",
          "score": 1,
          "created_utc": "2026-01-30 12:16:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lzvwt",
          "author": "pantrywanderer",
          "text": " Totally agree. Our team saw the same thing, when we switched to a one-page visual summary for campaign results, people actually remembered the key metrics and asked smarter questions. Slides are fine for deep dives, but if you want action or recall, a clear infographic wins every time.",
          "score": 1,
          "created_utc": "2026-01-30 14:45:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2q2xva",
          "author": "SpareAd8812",
          "text": "How you guys are creating carousel slides/infographics?",
          "score": 1,
          "created_utc": "2026-01-31 02:46:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrshyq",
      "title": "I almost killed my SaaS by listening to one power user",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qrshyq/i_almost_killed_my_saas_by_listening_to_one_power/",
      "author": "Listner_Fun_81p",
      "created_utc": "2026-01-31 04:27:38",
      "score": 17,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "Six months ago, my SaaS finally hit $2,500 MRR and I thought I had finally made it. Then I met a power user from a big agency who paid for the yearly enterprise tier upfront.\n\nHe started emailing me every single morning with these \"essential\" feature requests that sounded smart at the time.\n\nI felt so much pressure to keep him happy since he was my biggest check, so I stayed up until 4 AM coding his specific demands.\n\nI spent three weeks building this insane sub-task dependency system that only his specific workflow required.\n\nDuring that time, I completely ignored the minor bugs that were actually bothering my other 140 users.\n\nMy churn rate hit 18% in a single month. The UI became a bloated mess that nobody else could figure out and the feedback was getting brutal.\n\nI felt like a total failure watching my Stripe dashboard bleed out while I was basically acting as a free consultant for one guy.\n\nIt was a complete nightmare and I was barely sleeping. Seriously, I was so focused on one person that I forgot why I built the app in the first place.\n\nThe absolute kicker is that the power user canceled last week because the tool felt \"too cluttered\" for his team.\n\nI’ve spent the last ten days ripping out half the features I built just to save what's left. Please don't let one loud voice steer your roadmap or you'll end up as miserable as I was.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qrshyq/i_almost_killed_my_saas_by_listening_to_one_power/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o2rd4uu",
          "author": "evo_team",
          "text": "Feature requests are tricky especially in the early stages/ at launch because people ask for what they think they want, not what they actually need. Behavior tells you more than words ever will. What features are your remaining users actually using daily? Where do they get stuck? That data is more valuable than any email request. Your goal is to keep it simple and to bring in as many clients as possible. \n\nOne thing that works well for figuring out what actually matters to users is testing features through content. Make short videos showing different features or use cases, put them out on TikTok or Reels, and see what gets traction. The ones that go viral or get the most engagement are the ones people actually care about. It's like market research but faster and free. If a video about your sub-task dependency system gets crickets but a video about a simple workflow hack blows up, that tells you exactly where to focus.\n\nThe other thing worth considering is how you stay connected to your broader audience going forward. When you go heads down building for one client, you lose touch with the market. Founders who avoid this trap are constantly putting content out, talking to users publicly, seeing what resonates with hundreds of people instead of just whoever emails them that morning.\n\nYour roadmap should be informed by patterns across many users. Even if the loudest one pays more.\n\nWhat does your current user base look like now that you've stripped things back?",
          "score": 3,
          "created_utc": "2026-01-31 08:40:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpsru5",
      "title": "10x my content output using systematic remixing without quality dropping",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qpsru5/10x_my_content_output_using_systematic_remixing/",
      "author": "Select-Print-9506",
      "created_utc": "2026-01-29 00:11:36",
      "score": 15,
      "num_comments": 3,
      "upvote_ratio": 0.88,
      "text": "Ive been experimenting with content multiplication and results are better than expected, instead of creating 20 unique pieces weekly I create 2 really good pieces and remix them into different formats.\n\nFramework: Start with long form video or detailed written piece then systematically break it down. One 15 min video becomes 6 short clips for reels, twitter thread, linkedin article, email newsletter, instagram carousel and podcast episode\n\nKey is making sure each format is actually optimized for that platform not just copy paste, different hooks different lengths different styles and thats where most people mess up, they lazily paste same thing everywhere and it flops\n\nIm using blotato as main content remixing tool to handle platform specific adaptations, understands linkedin wants professional storytelling instagram wants visual carousels twitter wants punchy threads. Saves probably 5 hours weekly that id spend manually reformatting.\n\nI went from publishing maybe 10 pieces per week to 45+ pieces per week, traffic up 210% in past 2 months but quality hasnt dropped bc source material is still good im just extracting way more value from each piece.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qpsru5/10x_my_content_output_using_systematic_remixing/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o2d66up",
          "author": "bambidp",
          "text": "A great insight! Thanks for dropping it here.",
          "score": 1,
          "created_utc": "2026-01-29 06:14:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dc5qz",
          "author": "Unlikely-Inspector90",
          "text": "Did this bring any change to the ROI? Genuinely curious!",
          "score": 1,
          "created_utc": "2026-01-29 07:03:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qn2v9h",
      "title": "How I made half Billion views in 30 days and replaced 10 hours of manual work",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qn2v9h/how_i_made_half_billion_views_in_30_days_and/",
      "author": "Difficult-Cap-6950",
      "created_utc": "2026-01-26 02:04:23",
      "score": 14,
      "num_comments": 8,
      "upvote_ratio": 0.94,
      "text": "**The Problem:** I've been in this space for nearly a decade. For years, my workflow was a high friction loop of 10 hour days:\n\n\\-Finding trending hooks\n\n\\-Manual editing in CapCut\n\n\\-Thinking about titles and descriptions\n\n\\-Managing multiple accounts and posting on them. \n\nI was hitting a ceiling. I couldn’t scale because I was the bottleneck.\n\n\n\n**Building an Autonomous Content Engine** \n\nI decided to stop being a creator and started being a systems architect. \n\nI spent a month  building a fully automated AI workflow.\n\n\n\n**The Stack (High Level):**\n\n**-Generation:** AI-driven scripts that handle 100% of the creative (Visuals + Audio).\n\n**-Face/Faceless Hybrid:** Half the accounts are fully faceless, and half use my face/clients faces using AI sync/cloning tech.\n\n**-Logic:** The system scans for high-performing trends, generates catchy titles, and monitors issues automatically.\n\n**-The \"Check-in\":** My only daily task is a **20** **minute coffee session** where I check the analytics dashboard and tweak the high-performers.\n\n\n\n**The Results (Past 28 Days):** The numbers are honestly scary when you stop relying on human speed:\n\n* **Total Views (on All Accounts):** \\~500 M\n* **IG (Best Account):** 130 M views\n* **YT (Best Account):** 65 M views\n* **TT (Best Account):** 80 M views\n\n\n\n**3 Key Lessons for Growth Hackers in 2026:**\n\n1. **Quantity leads to Quality:** By posting at a volume no human can match, the algorithm has \"more bites at the apple.\" The AI learns which hooks work and doubles down on them.\n2. **The \"Faceless\" Scale:** Faceless accounts are the ultimate leverage. They don't get tired, and you can launch 5 of them in the time it takes to record 1 video of yourself.\n3. **Monitoring > Creation:** Spend your time on the *infrastructure*. If your automation is solid, you aren't a creator anymore, you're something like a portfolio manager.\n\n**My honest recommendation to everyone: stop working hard, work smart!** I’ve been in this game for nearly a decade, and this is the first time I’ve had so much time for other things while seeing better results than ever before.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qn2v9h/how_i_made_half_billion_views_in_30_days_and/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o1qrzyc",
          "author": "vaporeonlover6",
          "text": "funny, I'm here wondering if it's gonna pan out my videos and find this post...\nI made an automatic video generator from short funny chat conversations.\nare you doing short or long videos?\nwhat's the daily limit for new accounts?\nany tips appreciated\n\nmy channel is \nhttps://m.youtube.com/@waifuDungeon",
          "score": 3,
          "created_utc": "2026-01-26 02:20:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1r1b88",
              "author": "Difficult-Cap-6950",
              "text": "Doing both short and long format.   \nWhat you mean by daily limit for new accounts - like a posting limit?  \nWould wait 3-5 days after creation before posting anything, then start slowly with 1 post and increase every few days for +1.",
              "score": 2,
              "created_utc": "2026-01-26 03:07:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1rgti3",
          "author": "stovetopmuse",
          "text": "These numbers always make me pause unless there’s some normalization behind them. Views at that scale usually hide a massive long tail of zero engagement posts plus a few breakout clips doing all the lifting. Not saying the system idea is wrong, but I’d be more interested in retention curves, follower growth, and how many of those views translate into anything durable. Volume is easy to flex, signal quality is the hard part.",
          "score": 2,
          "created_utc": "2026-01-26 04:40:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1riz38",
              "author": "Difficult-Cap-6950",
              "text": "I posted proof-of-work (screenshots) on my profile. Engagement is good as well, the IG acc made around +150K new followers, around 20K messages through manychat.",
              "score": 1,
              "created_utc": "2026-01-26 04:54:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1tqf9k",
          "author": "bolerbox",
          "text": "quick question, for the ai generated videos, are you using any specific tool for the avatar/talking head parts? or is it all b-roll style content?\n\ni've been using videotok .app for ugc style ads and curious how it compares to what you're using for the content engine",
          "score": 1,
          "created_utc": "2026-01-26 14:44:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1u8hsf",
              "author": "Difficult-Cap-6950",
              "text": "Yes to generate content I only use APIs to access the tools directly (saves time and is usually cheaper) - regarding the tool it always depends on the type of content. But if it’s about “talking heads” training an own Lora is the way In combination with Kling / Veo with a voiceover or a professional lypsync tool (don’t recommend the cheap ones)",
              "score": 1,
              "created_utc": "2026-01-26 16:05:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qok8ds",
      "title": "Engineering as Marketing? How we built a free 'X Calculator' tool in 24 hours that generated 34 leads in 4 weeks.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qok8ds/engineering_as_marketing_how_we_built_a_free_x/",
      "author": "altraschoy",
      "created_utc": "2026-01-27 17:24:11",
      "score": 13,
      "num_comments": 4,
      "upvote_ratio": 0.94,
      "text": "Guys we analyzed our funnel.\n\n* Ebook Downloads: 2% conversion. Lead Quality: Low (tire kickers).\n* Tool Usage: 15% conversion. Lead Quality: High (intent).\n\nOur hypothesis: people don't want to read a 20-page PDF on a topic. They just want to type in their metric and get a number from a calculator.\n\nThe execution: We didn't have dev resources. So we used a rapid prototyping service to build an arbitrary calculator in React. Time to build: 24 hours. Cost: \\~$500 (subscription service).\n\nThe result:\n\n* Week 4: 34 leads.\n* Cost per Lead: $14.\n* SEO: We are ranking for a keyword because user time-on-site is 4 minutes (vs 30s for the PDF).\n\nThe Lesson in a nutshell: stop writing content and start building utilities. \"Engineering as Marketing\" is the highest ROI channel right now wow, and surprise: you don't even need an internal engineer to do it. The AI hype is really mind blowing \n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qok8ds/engineering_as_marketing_how_we_built_a_free_x/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o241u0g",
          "author": "Unfair_Juggernaut417",
          "text": "Spot on. \"Utility\" beats \"Content\" every time.\nI applied this same \"Engineering as Marketing\" logic to Lead Gen. Instead of offering a \"Guide to Cold Email\" (PDF), I built a simple widget where users input \"Industry + City\" and get 5 verified leads instantly.\nThe conversion rate is around 25% because they aren't getting a \"calculation\" (an estimate), they are getting the actual asset (Data) for free.\nFor anyone with dev skills, building a \"Free Tool\" is infinitely higher ROl than writing a blog post.",
          "score": 2,
          "created_utc": "2026-01-27 23:19:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o273wyu",
              "author": "altraschoy",
              "text": "Spot on - we should preach this more often in the brainstorming sessions.\n\nI no longer read long, email gated, PDFs. It just doesn't make sense anymore",
              "score": 1,
              "created_utc": "2026-01-28 11:35:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o274nki",
                  "author": "Unfair_Juggernaut417",
                  "text": "Yes completely, even the messages to my prospects and customers I make them very short, straight to the point and they appreciate",
                  "score": 1,
                  "created_utc": "2026-01-28 11:41:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2e5iyg",
          "author": "Major-Worry-1198",
          "text": "suppose there is ai agents company in voice agents what utility it should make any ideas?",
          "score": 1,
          "created_utc": "2026-01-29 11:27:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpj528",
      "title": "I did my first business when I was 17 with no money.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qpj528/i_did_my_first_business_when_i_was_17_with_no/",
      "author": "Beginningpen52",
      "created_utc": "2026-01-28 18:12:26",
      "score": 13,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "Hi, so I'm 22 now and I did my first business when I was 17, that was drop shipping , which required 0 investment and earned a profit of 1000-1200 in 6 months. \n\nToday, I'm a content writer professionally. Although it feels good. I don't earn enough, we have never had our own house. \n\nMy only dream is to buy a house in Delhi. And I want to build a startup really bad because I want my parents to live in their own house atleast once. Since they are growing old I wanna do it really fast. \n\nI have decided to start a content writing agency, but I'm figuring out how to execute it in the besr possible way. I get anxiety attacks at night thinking, time is going. But I also have a full time job and I'm not able to focus much here. \n\nI'll be sharing my progress on it everyday here. Please guide me if you have ideas and how can I go about it. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qpj528/i_did_my_first_business_when_i_was_17_with_no/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o29iwze",
          "author": "MissionElk1785",
          "text": "That dropshipping win at 17 shows you already have the founder DNA, don't forget that when the anxiety hits. Starting an agency while working full time is the smart play, don't quit your job until the agency income matches it. My honest advice is land your first 2-3 clients before building any systems or website, just use your existing network and LinkedIn to find people who need content now. The anxiety about time is real but remember your parents would rather see you build something sustainable than burn out trying to rush it. Keep posting your progress here, accountability helps more than any business advice!",
          "score": 1,
          "created_utc": "2026-01-28 18:46:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2d8h3u",
              "author": "Beginningpen52",
              "text": "Thanks bro. I was thinking of the same approach.",
              "score": 1,
              "created_utc": "2026-01-29 06:33:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2cf9bf",
          "author": "straightedge23",
          "text": "Can you tell me your approach and how you started this",
          "score": 1,
          "created_utc": "2026-01-29 03:14:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2d8i2v",
              "author": "Beginningpen52",
              "text": "Which approach?",
              "score": 1,
              "created_utc": "2026-01-29 06:33:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2cuagp",
          "author": "SpiritualWeb1139",
          "text": "Why did u left drop shipping?",
          "score": 1,
          "created_utc": "2026-01-29 04:48:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2d879c",
              "author": "Beginningpen52",
              "text": "I was starting my college in a new city and I thought this business is not sustainable, so I quit it.",
              "score": 1,
              "created_utc": "2026-01-29 06:30:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2dxw4t",
          "author": "That-Travel-5697",
          "text": "Wow you started early, well done on thinking ahead! If the drop shipping business was doing so well why did you not carry on with it?",
          "score": 1,
          "created_utc": "2026-01-29 10:22:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e6eji",
              "author": "Beginningpen52",
              "text": "It was not a sustainable business since I was basically acting as a reseller.",
              "score": 1,
              "created_utc": "2026-01-29 11:34:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2f22ra",
          "author": "pantrywanderer",
          "text": "Sounds like you’ve got a lot of motivation, which is great, but the key here is pacing yourself so you don’t burn out. Since you’re juggling a full-time job, start small, maybe dedicate a set, realistic block of time each week to validate your agency idea, like talking to potential clients or testing pricing. Focus on one concrete thing at a time rather than the whole business at once. Momentum comes from consistent small steps, not overnight leaps. Sharing progress here is smart, just make sure the updates stay actionable and realistic so you can actually build without overwhelming yourself.",
          "score": 1,
          "created_utc": "2026-01-29 14:43:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gikh8",
              "author": "Beginningpen52",
              "text": "Thank you for such a smart advice. I have started with research how do i test pricing?",
              "score": 1,
              "created_utc": "2026-01-29 18:40:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2i2hv6",
          "author": "Kourosh-ai",
          "text": "You’re young bro, driven, and already proven. Start niche, sell one service, get your first 3 clients fast... momentum beats perfection. Keep going !!",
          "score": 1,
          "created_utc": "2026-01-29 23:09:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpjwau",
      "title": "🧠 ICP is the real key most startups ignore",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qpjwau/icp_is_the_real_key_most_startups_ignore/",
      "author": "mketanv",
      "created_utc": "2026-01-28 18:38:41",
      "score": 11,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "Most startups fail not because product is bad\nbut because they build for everyone.\nWhen you don’t define ICP (Ideal Customer Profile):\n\n• marketing becomes expensive\n• sales takes too long\n• users don’t stick\n• churn increases\n\nOnce you define ICP clearly, everything changes:\n✅ clearer messaging\n✅ faster conversions\n✅ better retention\n✅ predictable growth\n\nExample:\n“Hospital software” is not ICP.\n“50–300 bed hospitals struggling with billing leakage” is ICP.\n\nYour product doesn’t need more features.\nIt needs a sharper target user.\n\nCurious —\nhow did you define your ICP when you started?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qpjwau/icp_is_the_real_key_most_startups_ignore/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o2a2krt",
          "author": "TemporaryKangaroo387",
          "text": "honestly the biggest mistake we made early on was defining ICP based on assumptions instead of data. we thought we knew who wanted our product but kept getting weird one-off customers that didnt fit the profile at all.\n\nwhat actually worked:\n\n1. looked at our best 10 customers (not most paying, best as in low support, high engagement, renewed without asking) and found the patterns\n\n2. talked to churned customers to understand why they left, which often revealed they were never our ICP to begin with\n\n3. paid attention to how people described their problem when signing up, not just their job title or company size\n\nthe hospital example is great because it includes the pain point not just the demographics. \"struggling with billing leakage\" does way more work than \"50-300 beds\" alone.\n\nother thing i learned - ICP isnt static. as you grow your ICP should narrow and sharpen, not expand. most companies do the opposite and wonder why CAC goes up.",
          "score": 3,
          "created_utc": "2026-01-28 20:13:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2cj8ql",
              "author": "mketanv",
              "text": "Agreed 💯",
              "score": 1,
              "created_utc": "2026-01-29 03:37:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2c9o3n",
          "author": "ryzeonline",
          "text": "Totally agree. By far the most common mistake, and even giants like Budweiser and Cracker Barrel can take their eye off the ball and f**k up the ICP.\n\n\n\nI teach workshops and offer guides on the importance of ICP, and it's a huge cornerstone of my teachings.\n\n\n\nMany people, like \"imaginary\" ICPs based on patterns, and I get that. It's better than nothing. But it loses the 'heart' and emotional intelligence necessary for a thriving biz, imho.\n\n\n\nPersonally, I insist any founder I'm consulting have \"One real person\", complete with an actual name and address as a north star.",
          "score": 1,
          "created_utc": "2026-01-29 02:43:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2cja3x",
              "author": "mketanv",
              "text": "True",
              "score": 1,
              "created_utc": "2026-01-29 03:38:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2d8v33",
          "author": "Disastrous-Entry1610",
          "text": "I'm a marketing team lead and a 7-figure copywriter who helped over 20 businesses. Not having a clear ICP is by far one of the biggest ways companies are shooting themselves in the foot. Some common mistakes I've seen:   \n  \n1. Companies just make up an ICP because it's cool. For example I was working with a company that was targeting tech workers but selling a physical product that costs around $30 and has no features that automatically make it ideal for IT guys and gals. When I asked why did they make that decision, the CEO told me that this is the group that easily adopts new technology and their purchasing power is the biggest. The former is obviously an assumption and their product wasn't new technology by any means. We don't have the exact number, but tech workers likely didn't make over 10% of their customers and their fascination with the product to this day isn't significantly greater than some other groups. \n\n2. Companies not sticking to an ICP. If you have a proven ICP - which is basically a pattern that leads to most sales, biggest AOV and most happiness with your product, not orienting your whole marketing to that customer is a rookie mistake. Companies are often too afraid to fully commit to their ICP (or more realistically ICPs), so they end up targeting a wise audience that kinda, sorta needs their product, instead of ICPs that REALLY need their product right now. \n\n3. This is the biggest one and it's already mentioned here - not using data to define their ICP. If you're selling a piece of accounting software for tech companies and you have 8 clients, Google and Microsoft might be your ICP, but you're not realistically going to be invoicing them any time soon. That's why it's safest to define your ICP based on the customers you already have. Talk to the top customers you have - the ones driving the most revenue and see what pattern you can spot. If you don't have customers yet, look at what your competition is doing and study it closely. \n\nI'm building an app that can tell you how to clearly define your ICP, research your audience using internal and online sources, get your top customers to talk to you, what to ask, how to analyse the data you get, and more. It's coming out very soon and I'm giving away free access in exchange for a bit of feedback. DM me if you'd like to get the link once it's out.",
          "score": 1,
          "created_utc": "2026-01-29 06:36:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dg2x8",
              "author": "mketanv",
              "text": "Sure thanks",
              "score": 1,
              "created_utc": "2026-01-29 07:38:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2df4s8",
          "author": "Alternative_Yard_170",
          "text": "So true, applicable to outbound and marketing/distribution as well. Define your ICP and reach out only to them, instead of spray and pray methodology.",
          "score": 1,
          "created_utc": "2026-01-29 07:29:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dtr0p",
          "author": "mister-sushi",
          "text": "There is a book of April Dunford called Obviously Awesome.\n\nThe book started with the exact problem I had: some users thought that my tool was the best thing in the world, and others didn’t get it no matter how I tried to explain it to them. The book taught me to stop focusing on those others and how to distinguish ones from anothers.\n\nI can’t say that my situation has dramatically improved after that, but it definitely feels less noisy. It also really helps with people from real world. Now I don’t get frustrated that some of my friends and family members don’t understand what I’m doing - they’re just not my target audience.",
          "score": 1,
          "created_utc": "2026-01-29 09:44:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dvnrj",
              "author": "mketanv",
              "text": "Yes I also read that book, it's really wonderful.",
              "score": 1,
              "created_utc": "2026-01-29 10:02:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2dw4z6",
          "author": "Responsible_Ask8763",
          "text": "This is such sound advice. It sounds obvious, but in reality, it’s not.\n\nFrom my own experience: my business partner and I are working on a startup idea with a consultant. What we initially pitched was where we wanted to be in five-plus years, focusing on scale, without clearly defining our entry point. Our consultant pushed us back to basics and asked us to identify our ICP first so we could define how we enter the market.\n\nOnce we went granular, the picture became clear. We identified our ICP and a focused niche entry point, and suddenly everything made more sense. We’re both genuinely comfortable starting there and evolving as we grow.\n\nDefining your ICP really is the first step.",
          "score": 1,
          "created_utc": "2026-01-29 10:06:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e31ks",
          "author": "Goran-CRO",
          "text": "Imo, the best practice is to follow the money (paid customers) and their use cases. The narrower the use case the better your service/product will resonate with the market, i.e. will have better positioning",
          "score": 1,
          "created_utc": "2026-01-29 11:06:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f2s10",
          "author": "ActivitySmooth8847",
          "text": "We nailed our ICP by digging into who actually bought from us and why. For us, it was small agencies struggling to find quality leads fast.",
          "score": 1,
          "created_utc": "2026-01-29 14:46:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2f2yiy",
              "author": "mketanv",
              "text": "Good to go",
              "score": 1,
              "created_utc": "2026-01-29 14:47:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2lu5ws",
          "author": "Final_Schedule_3129",
          "text": "The biggest mistake I see isn't just ignoring ICP, but defining it only by firmographics (size, revenue, industry). The real growth unlock happens when you layer in situational triggers.\n\n\"Hospitals with billing leakage\" is good. \"Hospitals that just hired a new CFO and are auditing their billing stack\" is where the conversion magic happens. If you can target the moment of change, not just the profile, your CAC drops off a cliff.",
          "score": 1,
          "created_utc": "2026-01-30 14:17:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2s3agb",
              "author": "mketanv",
              "text": "Exactly 💯",
              "score": 1,
              "created_utc": "2026-01-31 12:37:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qmyehg",
      "title": "Your \"ideal customer\" might be completely wrong — case studies that broke my brain",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qmyehg/your_ideal_customer_might_be_completely_wrong/",
      "author": "grayfoxlouis",
      "created_utc": "2026-01-25 22:57:13",
      "score": 10,
      "num_comments": 3,
      "upvote_ratio": 0.92,
      "text": "So I went down a rabbit hole this week after hearing a marketer friend mention that **fishing enthusiasts convert incredibly well on insurance offers.**\n\nMy first thought: \"That makes zero sense.\"\n\nMy second thought: \"Wait... does it though?\"\n\nTurns out there's a mountain of documented cases where advertisers discovered their highest-converting audiences had absolutely nothing to do with their product category. And honestly, some of these findings are wild.\n\n\n\n**The George Foreman Grill was supposed to be for boxing fans.**\n\nMakes sense, right? Boxing legend endorses a grill, target male boxing enthusiasts. Except when they actually tested it, 60-70% of buyers were college-educated women. They completely retooled the infomercials to show family grilling scenes instead of boxing references. Result: 100+ million units sold.\n\nThe audience that \"should\" convert wasn't even close to the audience that actually did.\n\n\n\n**A bicycle company's best customers were music fans.**\n\nState Bicycle Company started targeting people who liked specific music genres on Facebook — zero connection to cycling whatsoever. $500K in incremental annual sales. Their cost-per-click was 1/5th of other platforms. Music taste predicted bicycle purchases better than interest in... bicycles.\n\n\n\n**Luxury travel converts better when you target Chanel fans, not travel enthusiasts.**\n\nLuxury Link discovered that targeting people interested in Chanel, Prada, and Fendi drove a 100% increase in travel package sales versus targeting people who liked travel pages. Cross-category luxury affinity was the signal, not the product category itself.\n\n\n\n**Chicago Cubs fans convert on everything apparently.**\n\nBonobos (men's pants) ran ads to Cubs fans that said \"Pants for Wrigley\" — 10% of entire site traffic. Arizona Office of Tourism targeted Cubs fans (spring training angle) — 27% conversion rate on visitor guide requests, 8x more clicks than paid search.\n\nSports team loyalty as an identity signal is weirdly powerful.\n\n\n\n**Here's the one that really got me:**\n\nA real estate company running Gmail campaigns for apartment rentals found that targeting \"luxury travelers\" and \"green-living enthusiasts\" delivered the lowest cost-per-lead — **better than targeting people actually looking for apartments.**\n\nPeople with certain lifestyle affinities who weren't actively searching converted better than high-intent searchers.\n\n\n\n**The pattern I keep seeing:**\n\n* Lifestyle identity > product interest\n* Life stage > purchase intent (people moving or getting married convert better on mattresses than people searching \"best mattress\")\n* Algorithms find audiences humans never would have picked (Google's auto-generated audiences hit 3x higher engagement than manually selected ones)\n* Gender assumptions invert constantly (products with male endorsers often convert better with women)\n\n\n\nI'm not saying throw out your customer personas entirely. But maybe the fishing → insurance thing isn't that weird after all.\n\nPeople are complex. A 45-year-old guy who fishes on weekends might also be a homeowner thinking about his family's financial security. The fishing interest is a signal about lifestyle, values, and life stage — not just \"this person likes fish.\"\n\nThe takeaway for me: test audiences that feel completely unrelated. The \"logical\" targeting might be leaving money on the table.\n\nAnyone else discovered weird audience overlaps that worked way better than expected? Would love to hear what's worked for you.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qmyehg/your_ideal_customer_might_be_completely_wrong/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o1qdm4h",
          "author": "kubrador",
          "text": "the george foreman grill thing is just \"what if we marketed to people with disposable income instead of people who watched boxing\" but dressed up as a revelation lol",
          "score": 3,
          "created_utc": "2026-01-26 01:06:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1rnbd0",
              "author": "grayfoxlouis",
              "text": "lol in many ways yes, I guess I respect the hustle and the flexibility to go hey this is working and should do this. Too many stay stubborn and tank their own success with tunnel vision. I'm an old school wrestling fan and I just think of WCW and what they did to crash and burn",
              "score": 1,
              "created_utc": "2026-01-26 05:23:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1rvmem",
          "author": "ChestChance6126",
          "text": "This lines up with what I’ve seen. Interests are rarely about the thing itself, they’re signals for lifestyle, stability, and habits. Once you stop arguing with the data and just test the “wrong” audiences, a lot of assumptions fall apart fast. The sideways audiences are often cheaper and less competitive, too.",
          "score": 1,
          "created_utc": "2026-01-26 06:25:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qou080",
      "title": "I got 4,000+ users in 28 days... this is what worked for my health ai tool",
      "subreddit": "GrowthHacking",
      "url": "https://i.redd.it/bly8hug35zfg1.png",
      "author": "Economy-Mud-6626",
      "created_utc": "2026-01-27 23:12:35",
      "score": 9,
      "num_comments": 13,
      "upvote_ratio": 0.7,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qou080/i_got_4000_users_in_28_days_this_is_what_worked/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o279t0i",
          "author": "bassamtg",
          "text": "I'd like to know what are the channels you tried that didn't work for you",
          "score": 2,
          "created_utc": "2026-01-28 12:18:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27h1lc",
          "author": "SnoooCookies",
          "text": "How can you have 4000 users in 28 days if you only increased 16% compared to the previous month?",
          "score": 2,
          "created_utc": "2026-01-28 13:05:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27mj2x",
              "author": "Economy-Mud-6626",
              "text": "what's unfair in this ??\n\nlast month was around 3.5 and this month around 4.5 will do",
              "score": -4,
              "created_utc": "2026-01-28 13:36:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o281d58",
                  "author": "SnoooCookies",
                  "text": "your title. you didn't acquire 4000 users in 28 days. You acquired 1000.",
                  "score": 5,
                  "created_utc": "2026-01-28 14:51:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o29zw0s",
          "author": "horatio81",
          "text": "Why would someone use your ai rather than chat gpt?  What is your usp?",
          "score": 2,
          "created_utc": "2026-01-28 20:01:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26vfy9",
          "author": "dohankun",
          "text": "hey I’m on mobile, clicked your link, long loading, can’t see the content without signing up first lol.",
          "score": 1,
          "created_utc": "2026-01-28 10:24:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26xhn9",
              "author": "Economy-Mud-6626",
              "text": "sry, pls try here: [meetaugust.ai](http://meetaugust.ai)",
              "score": 0,
              "created_utc": "2026-01-28 10:42:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o26xjzu",
                  "author": "dohankun",
                  "text": "I meant that as a suggestion fix.",
                  "score": 1,
                  "created_utc": "2026-01-28 10:42:49",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2d1vm2",
                  "author": "1555552222",
                  "text": "Where does the 5+ million users on your homepage come from if you have 4.5k? This is the kind of scammy shit that fucks us all.",
                  "score": 1,
                  "created_utc": "2026-01-29 05:41:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o271mrv",
          "author": "Great_Day_2517",
          "text": "I was thinking about something similar, but I thought people would not trust AI. Great to see this idea being live!",
          "score": 1,
          "created_utc": "2026-01-28 11:17:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27mtyg",
              "author": "Economy-Mud-6626",
              "text": "thanks dear...\n\nbut we're also facing the same issues..\n\ngrowing somehting in healthacre ai is hard for sure",
              "score": 1,
              "created_utc": "2026-01-28 13:37:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kmfgr",
          "author": "Promptnox",
          "text": "Thanks for the advice, we are in the phase that you described. Product made but need to get it out there... It is inspiring to see people who have done what we need to do next, gives us hope!",
          "score": 1,
          "created_utc": "2026-01-30 09:04:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mwcsy",
          "author": "Begilad",
          "text": "Getting 4,000 users in a month sounds like a dream, but anyone who’s been in the trenches knows the \"28-day wonder\" is usually either a stroke of massive luck or a very well-disguised grind.\n\nAs the CEO of Moburst, I’ve seen plenty of founders get blinded by these \"explosive\" numbers and forget that 4,000 users who bounce in ten seconds are just a vanity metric that kills your server costs.\n\nThe real gold in this thread is the mention of TikTok and Reddit. But here’s the reality: if you go into these spaces just \"pitching,\" the community will eat you alive. You have to be a human being first and a founder second. On TikTok, it’s about the raw \"behind the scenes\" struggle; on Reddit, it’s about solving a specific person’s headache in a comment thread without asking for anything in return.\n\nMy best advice for anyone trying to replicate this? Don’t aim for 4,000. Aim for 10 people who would be devastated if your product disappeared tomorrow. If you can do that, the next 3,990 are just a matter of scaling the conversation.\n\nAnd a small tip for the \"healthcare AI\" struggle mentioned: trust is your only currency there. You can't hack your way into someone's health data. You have to earn it, one transparent conversation at a time.",
          "score": 1,
          "created_utc": "2026-01-30 17:13:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp9ood",
      "title": "Ecommerce Marketing Agency / Consultant for my Shopify Store",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qp9ood/ecommerce_marketing_agency_consultant_for_my/",
      "author": "Jazzlike_Ad_6288",
      "created_utc": "2026-01-28 12:11:51",
      "score": 8,
      "num_comments": 5,
      "upvote_ratio": 0.91,
      "text": "Looking for a solid marketing agency or consultant for my Shopify store. I’ve hit a bit of a wall and need someone who actually knows how to scale. Any recommendations for people who get real results? Thanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qp9ood/ecommerce_marketing_agency_consultant_for_my/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o27cg8a",
          "author": "-AsHxD-",
          "text": "Not an agency but a freelancer, please check dm",
          "score": 1,
          "created_utc": "2026-01-28 12:36:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29pq8f",
          "author": "online-optimism",
          "text": "Happy to help if you want to share more about your goals. We work with a lot of Shopify store owners at Online Optimism, both smaller brands and larger businesses. Feel free to reach out if you want to talk through what's not working right now.",
          "score": 1,
          "created_utc": "2026-01-28 19:15:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jvoe9",
          "author": "Tricky_Instance6014",
          "text": "Not a freelancer. Check DM",
          "score": 1,
          "created_utc": "2026-01-30 05:22:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rn2yr",
          "author": "Kkilicer2",
          "text": "For E-commerce consultancy, I strongly advise Scarlet Media, especially for advanced Performance Marketing and Paid Media skills",
          "score": 1,
          "created_utc": "2026-01-31 10:15:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqz0ca",
      "title": "[i will not promote] 3 startups in 3 years, now one startup per day",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qqz0ca/i_will_not_promote_3_startups_in_3_years_now_one/",
      "author": "SimilarCanary5091",
      "created_utc": "2026-01-30 07:36:05",
      "score": 7,
      "num_comments": 13,
      "upvote_ratio": 0.9,
      "text": "I've always admired people who can build things and make a living from their creations.\n\nI started coding in 2014, got serious about it in 2017, and launched my first startup in 2018. It was a complete failure. I got depressed pretty quickly and realized that tech alone wasn't enough, distribution was the real challenge.\n\nI kept coding for years, but only for clients. Then one day, I got tired of it:\n\n* Stopped working for clients in 2023\n* Locked myself in for 8 months to build a product \"everyone would want\"\n* Most people *were* interested in the product... for free not enough to pay for it\n* Created a dev agency → still running\n* 2025: started using AI\n* Shipped one product per month, then per week, now per day\n* Still no distribution\n* Still stuck in the building phase, still unable to make money from it\n\nThe irony isn't lost on me: I can mass-produce startups now but I still can't sell one. Turns out the bottleneck was never my ability to build it's always been my ability to reach people.\n\nSo here I am. A factory with no customers.\n\nAnyone else stuck in this loop? How did you break out of it?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qqz0ca/i_will_not_promote_3_startups_in_3_years_now_one/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o2kevaa",
          "author": "MissionElk1785",
          "text": "Been there. The breakthrough for me was stopping the build-first cycle and instead finding one specific person with a real problem, understanding exactly what they'd pay to solve it, then building the smallest possible thing that fixes just that. I spent 2 weeks talking to potential users before writing a single line of code on my current project and it's the first thing that actually makes money because I knew someone wanted it before I built it.",
          "score": 3,
          "created_utc": "2026-01-30 07:56:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kdy8a",
          "author": "Fit_Shop4607",
          "text": "You have been pretty fast in terms of concluding a validation , can you share some of the products you shipped ?",
          "score": 2,
          "created_utc": "2026-01-30 07:48:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kfgki",
              "author": "SimilarCanary5091",
              "text": "I've shipped a bunch of small tools and micro-SaaS, but the two bigger ones are:  \n[**srocket.ai**](https://srocket.ai) : AI website builder with built-in lead capture and a mini CRM. Mostly targeting French freelancers/small businesses right now.  \n[**clawdhost.xyz**](https://clawdhost.xyz) : Hosted AI assistant you talk to via Telegram. Tried to surf on the \"Clawdbot\" wave but you can set up in 5 minutes without touching any code.\n\nBoth running, both with users, neither paying my rent yet lol",
              "score": 2,
              "created_utc": "2026-01-30 08:01:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kkdyl",
          "author": "localkinegrind",
          "text": "Getting clients is usually the hardest part but once you crack it, it is a deal done. What if you outsource that role?",
          "score": 2,
          "created_utc": "2026-01-30 08:46:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ldhid",
              "author": "SimilarCanary5091",
              "text": "I would love that to be honest but I don't know a lot of people that can actually be proactive on that subject. Making me question if I'm not taking too much space ahah",
              "score": 1,
              "created_utc": "2026-01-30 12:44:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2lv2jr",
                  "author": "my-meta-username",
                  "text": "First, I read your problem as a distribution issue but I think its a little bigger. Its a product/strategy issue. \n\nI'm making the assumption you are one person and bootstrapped and narrowing your scope from there:  \n1) **Needs to be self-serve**: you can't code whilst also doing marketing, and sales. Use PLG to acquire with some marketing on top (one of SEO, cold email, founder-led content on social, etc)  \n2) **B2B** feels like a better fit than B2C as most B2C will have to scale a very large free tier to support a very small paid tier. Hard, long, and expensive as a bootstrapped solo founder.\n\n3) **Disrupting an existing large market** also feels like a better fit.  Introduce a new offer for an over-served and over-paying segment. Its harder to enter a new market as PLG because most people don't know what the product is/does in new markets & need to talk to someone.\n\n  \nExample: srocket looks quite similar to lovable. Who is it uniquely for? Lovable are enormous so who are overserved and overpaying? Who could do with a more basic AI site builder but with CRM integrated? Whats the compelling reason to use it vs lovable + hubspot?\n\nCarrds unique offer is that lots of people only need a simple one page website and are overserved and overpaying for wordpress, webflow, etc. \n\nBefore building think about what your unique offer is and for what unique audience. I think that will make building and marketing easier for you.",
                  "score": 2,
                  "created_utc": "2026-01-30 14:21:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2knw9e",
          "author": "Promptnox",
          "text": "We are also currently in the same loop. This project that we have going on now is our 10th with my co-founder. The thing that is different this time is that we are trying to leverage our own skillsets better than in our previous nine attempts. \n\nBut as you say, it would be living \"the dream\" to be able to make a living off ones own creations. Stay curious and keep going!",
          "score": 2,
          "created_utc": "2026-01-30 09:18:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ldm6m",
              "author": "SimilarCanary5091",
              "text": "Good luck to you guys!",
              "score": 1,
              "created_utc": "2026-01-30 12:45:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2l6pvl",
          "author": "Emotional_Tax_6578",
          "text": "I've found doing one startup at a time works better",
          "score": 2,
          "created_utc": "2026-01-30 11:58:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mx4ep",
          "author": "Begilad",
          "text": "Building a startup per day sounds like a fever dream or a very high-speed car crash, but honestly, it’s the ultimate cure for the \"perfect product\" paralysis that kills 99% of founders.\n\nAs the an agency owner, I work with brands at massive scale, but I always tell my team that the \"launch and learn\" muscle is the most important one to train. Most people spend six months building a \"revolution\" that nobody asked for. You’re basically speed-dating the market.\n\nThe top comment about distribution being the real ghost in the machine is 100% the truth. You can build a masterpiece every 24 hours, but if you don’t have a repeatable way to get it in front of eyeballs, you’re just shouting into a void.\n\nMy advice? Don’t just ship the code; ship the \"hook.\" Use these daily launches to test which psychological triggers actually make people click. If you find a \"boring\" tool that gets 10x the signups of your \"cool\" one, stop the daily cycle and double down on the boring one.\n\nIt’s better to have one ugly product people actually use than 30 beautiful ones that only your mom visited. Mad respect for the hustle though, most people haven't even finished their first landing page in three years.",
          "score": 2,
          "created_utc": "2026-01-30 17:16:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qo5tnc",
      "title": "Profound vs Promptwatch vs Peec for AEO?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qo5tnc/profound_vs_promptwatch_vs_peec_for_aeo/",
      "author": "Academic_Way_293",
      "created_utc": "2026-01-27 06:08:52",
      "score": 7,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I'm currently trying to research whether I go with either of the tree for tracking brand visibility and LLM performance. I tried Profound for two weeks but the cost seems a bit too steep for my business (growth costs 400 per month) and it feels like it's not worth the operational costs for what they do... Peec doesn't seem bad and Promptwatch has also been good so far.  \n  \nIf it matters, I run a midsize clothing store which is doing quite well, so I'm trying to make sure we're not invisbible to AI. The reason why I am looking into AEO/GEO specifically is because one customer said that they found our landing page after Claude cited us, so I'm looking to replicate that. Lmk your thoughts if you've tried any of these",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qo5tnc/profound_vs_promptwatch_vs_peec_for_aeo/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o1yy1kt",
          "author": "Background_Neck9690",
          "text": "Tbh the most I would pay for an AEO tool is 100-200, Profound costs way too much. Did you ever manage to ask the customer about which prompt you appeared in? That could be a good baseline for you.",
          "score": 1,
          "created_utc": "2026-01-27 06:12:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20gu7s",
          "author": "akash_09_",
          "text": "$400/mo can be pretty expensive, if I be honest... \n\nI'm not promoting here, but maybe you can checkout Amadora AI for free to test it as much more cheaper with better optimization details and action points. \n\nhttps://preview.redd.it/3zmbtzoi9wfg1.png?width=2490&format=png&auto=webp&s=dcd4e4f10bbcefc176cde59746460c7a707b40f1\n\nthe feature is ready but yet to launch which we'll be doing this week or next and might be immensely useful.",
          "score": 1,
          "created_utc": "2026-01-27 13:33:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qojhbi",
      "title": "How to get followers on X (Twitter) in 2026?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qojhbi/how_to_get_followers_on_x_twitter_in_2026/",
      "author": "Pitiful-Cry-7463",
      "created_utc": "2026-01-27 16:58:55",
      "score": 6,
      "num_comments": 19,
      "upvote_ratio": 0.88,
      "text": "**Post / Question:**  \nI recently started actively posting on X and I’m struggling to get any followers.\n\nMy account is **OlivkaMin** \\- it was created back in 2021, but I only started publishing content recently. I already bought Premium and completed verification. I post content that I personally find interesting and valuable to read, but so far it hasn’t translated into growth.\n\nMy short-term goal is to reach 1,000 followers and then gradually develop my profile as an expert in this niche.\n\nHas anyone faced a similar situation? What strategies or approaches actually worked for you in 2026? Any practical advice would be appreciated. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qojhbi/how_to_get_followers_on_x_twitter_in_2026/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o23ehpx",
          "author": "SeaworthinessReal844",
          "text": "It's a pretty simple post about 3-4 daily \n\nand make as many replies as you can",
          "score": 1,
          "created_utc": "2026-01-27 21:28:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o23f9ih",
              "author": "SeaworthinessReal844",
              "text": "I checked ur account u only posting put u don't make enough replies",
              "score": 1,
              "created_utc": "2026-01-27 21:32:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o23fzby",
                  "author": "SeaworthinessReal844",
                  "text": "as u small account, you need to get more visibility by making replies on big accounts in your niche and try to make it early when they are just posting\n\nabout 60+ replies every day \n\nAlso, try not to use hashtags",
                  "score": 2,
                  "created_utc": "2026-01-27 21:35:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o251u9n",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-28 02:25:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2du6j3",
              "author": "arbiternoir",
              "text": "Interesting, is it really popular? Does it have business centric conversations there?",
              "score": 1,
              "created_utc": "2026-01-29 09:48:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o268h10",
          "author": "skyler_outx",
          "text": "I think X's head of product or someone not sure exactly suggested to post content around a niche topic everyday for next 6 months and X will push your content so try this strategy",
          "score": 1,
          "created_utc": "2026-01-28 06:58:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o289g0f",
          "author": "Feetorgasmic",
          "text": "[Ayúdenme plis](https://x.com/diankycris?s=21)",
          "score": 1,
          "created_utc": "2026-01-28 15:29:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ctz95",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-29 04:46:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2cu4aj",
              "author": "WORDOFTHEDAYCASH",
              "text": "And btw I don’t want anything from u lol I’m not those guys that tryna ask u for something im jus tryna help u so ima dm u and add u into x engaging group chats for free",
              "score": 1,
              "created_utc": "2026-01-29 04:47:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2cuvpk",
                  "author": "WORDOFTHEDAYCASH",
                  "text": "I acc couldn’t dm u so I replied  on ur recent",
                  "score": 1,
                  "created_utc": "2026-01-29 04:52:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2cxeyy",
          "author": "WORDOFTHEDAYCASH",
          "text": "https://preview.redd.it/jpcdatwo18gg1.jpeg?width=1219&format=pjpg&auto=webp&s=d87b7361ed741e4a809d67ac6ca42c819baec3af\n\nMy proof that it was like 2 weeks",
          "score": 1,
          "created_utc": "2026-01-29 05:09:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ekw9f",
          "author": "No-Translator-2566",
          "text": "I \"trained\" grok to start mention my account in his replies, and it helped me get way more reach and new followers.\n\nhttps://preview.redd.it/e72269ytbagg1.png?width=1213&format=png&auto=webp&s=6823dc7d453bcc40ac2d40880d289c472fc8e47f",
          "score": 1,
          "created_utc": "2026-01-29 13:12:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ew0hd",
          "author": "MissionElk1785",
          "text": "Try to post 5 daily, and try to engage with other peoples",
          "score": 1,
          "created_utc": "2026-01-29 14:12:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qntqq8",
      "title": "Removed credit card requirement from trial signup. Signup up 340%. Conversion down 60%.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qntqq8/removed_credit_card_requirement_from_trial_signup/",
      "author": "whyismail",
      "created_utc": "2026-01-26 21:34:23",
      "score": 6,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I recently built a [personal branding tool ](https://brandled.app/)for founders.\n\nIn the first few months I struggled to get visitors.\n\nBut then my content started working and visitors were now longer a problem.\n\nBut now I wanted to do experiments to land on to best config or best conversions.\n\nHad credit card required upfront for free trial.\n\nConventional wisdom said this filters to serious buyers.\n\nSignups were low.\n\nConversion to paid was almost 38%.\n\n**Removed the credit card requirement.**\n\nMonth 1 results:\n\n* Signups: up by 340%\n* Conversions to paid: 15%\n* Net new customers: More users than trials that required credit card\n\nMore customers in absolute terms.  \nBut the math gets complicated.\n\nBut the math gets complicated. What I noticed: Support load exploded. Tire-kickers asking questions about things they'd never pay for. Trial abuse appeared. People creating multiple accounts to extend free usage forever. Most users were \"just looking around\" type.\n\nAnd as a product that use AI apis, it's pretty hard to sustain costs if you are bootstrapping.\n\nThe 15% who converted were often lower-intent. Higher churn in first 90 days.\n\nAfter understanding that I immediately shifted to card required 7 day trial.\n\nI am still figuring out some experiements,\n\nMaking the 7 day trial to 3 days or removing the trial itself.\n\nPlease share your thoughts and experiences with this...",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qntqq8/removed_credit_card_requirement_from_trial_signup/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o1zns23",
          "author": "Tommohawk",
          "text": "It's very typical for AI products.\n\nI wouldn’t recommend removing the credit card requirement unless you have a lot of money to burn, instead, implement a hard paywall.\n\nIf a user can’t convert, it’s likely an issue with your offer or product.",
          "score": 1,
          "created_utc": "2026-01-27 10:00:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zo143",
              "author": "whyismail",
              "text": "Yup, I feel that as a bootstrapped founder , it's a pretty bad decision.",
              "score": 1,
              "created_utc": "2026-01-27 10:02:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qp7qsi",
      "title": "viator or getyourguide, which ota for tour operators is actually worth it?",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qp7qsi/viator_or_getyourguide_which_ota_for_tour/",
      "author": "TurnoverEmergency352",
      "created_utc": "2026-01-28 10:26:46",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I m about to start listing my rome colosseum & vatican tour small groups and im trying to figure out whether to go with viator or getyourguide, currently i don’t use either.  \nI havent used either yet, so im curious, which one actually brings more bookings, is easier to manage, or has better support? \n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qp7qsi/viator_or_getyourguide_which_ota_for_tour/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o26y4kn",
          "author": "Prestigious-Fun-9680",
          "text": "I think you will learn the answer only after trying both.",
          "score": 1,
          "created_utc": "2026-01-28 10:47:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26yxu6",
          "author": "MudDifficult2015",
          "text": "check the cancellation policies each forces you to adopt. for a new operator, flexibility can be a selling point.",
          "score": 1,
          "created_utc": "2026-01-28 10:54:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27euhm",
          "author": "just-plain-wrong",
          "text": "From a punter's side, Viator is my go-to. It's dead easy to work with, and seems to have **a lot** of operators (especially in your area). A good cancellation policy will be your best friend, along with really good photography.",
          "score": 1,
          "created_utc": "2026-01-28 12:51:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqhbcr",
      "title": "Day 2 of building a business from scratch as a 22 year old.",
      "subreddit": "GrowthHacking",
      "url": "https://www.reddit.com/r/GrowthHacking/comments/1qqhbcr/day_2_of_building_a_business_from_scratch_as_a_22/",
      "author": "Beginningpen52",
      "created_utc": "2026-01-29 18:49:46",
      "score": 5,
      "num_comments": 12,
      "upvote_ratio": 0.86,
      "text": "Hi, as I said earlier I have never had my own house and my only goal is to buy a house in Delhi. \n\nI am a writer working professionally but not earning much. I have run a drop shipping business for 6 months at the age of 17. And now I am trying to build a content writing agency\n\nSo here's how I am planning to go about it, I have started by researching 50 best content writing agency, I'm figuring out what services they are giving, how are they marketing it and how their website looks.\n\nCurrently I'm researching through Google which gives me the easy ones, I have made a list of 10. How can I dive deeper into the research to find the best agencies? What platform should I use for research. \n\nI will be sharing my everyday progress here, please guide me if you have a better approach.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/GrowthHacking/comments/1qqhbcr/day_2_of_building_a_business_from_scratch_as_a_22/",
      "domain": "self.GrowthHacking",
      "is_self": true,
      "comments": [
        {
          "id": "o2h55ch",
          "author": "GrrasssTastesBad",
          "text": "Nice, I’ll keep watching. In the age of ai writing, how are you pitching yourself?",
          "score": 1,
          "created_utc": "2026-01-29 20:26:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mxuoy",
              "author": "Beginningpen52",
              "text": "There's always a visible difference between AI and human writing. No matter how good of a prompt you give it's visible. My tone os writing is conversational, that's now how AI writes.",
              "score": 1,
              "created_utc": "2026-01-30 17:19:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2o1rjc",
                  "author": "GrrasssTastesBad",
                  "text": "Yes, now how are you pitching that to people hiring you?",
                  "score": 1,
                  "created_utc": "2026-01-30 20:18:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2i9o8f",
          "author": "Unfair_Juggernaut417",
          "text": "Stop using Google manually, it's too slow.\nGo to agency directories like Clutch.co, Manifest, or Sortlist.\n\nYou can filter by \"Content Writing\" and see thousands of agencies ranked by size, hourly rate, and reviews.\n\nIt's the fastest way to analyze your competitors without spending a dime. Good luck on the house goal!",
          "score": 1,
          "created_utc": "2026-01-29 23:47:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mxmcu",
              "author": "Beginningpen52",
              "text": "Wow so cool, will check it out. Thank You so much.",
              "score": 2,
              "created_utc": "2026-01-30 17:18:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2iroxd",
          "author": "Ancient_Team_1608",
          "text": "very cool - keep posting updates bro!",
          "score": 1,
          "created_utc": "2026-01-30 01:25:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kluel",
          "author": "kubrador",
          "text": "you're researching competitors on day 2 instead of talking to customers who actually need content written. spend 2 hours calling 10 small businesses and ask them what they struggle with, then come back with actual insights instead of website design notes.",
          "score": 1,
          "created_utc": "2026-01-30 08:59:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lziai",
          "author": "pantrywanderer",
          "text": "The research approach you’re using is solid, but the depth usually comes from looking beyond the obvious websites. Check out their client reviews on LinkedIn or Glassdoor, see what content they actually produce, and note patterns in pricing, positioning, and niche focus. Tools like SimilarWeb or BuiltWith can show traffic sources and tech stack, which is surprisingly telling. Also, don’t ignore networking, reach out to former clients or freelancers who’ve worked with them to get insider perspective. Combining surface research with real-world signals usually gives a clearer picture of who’s actually performing well.\n\n\n\n",
          "score": 1,
          "created_utc": "2026-01-30 14:43:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mxgmg",
              "author": "Beginningpen52",
              "text": "This is really really helpful thank you so much, will use these.",
              "score": 1,
              "created_utc": "2026-01-30 17:18:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2mxqwv",
          "author": "Majestic_Hornet_4194",
          "text": "If you want to dig deeper than Google try LinkedIn to find top content agencies and check their client list and reviews.",
          "score": 1,
          "created_utc": "2026-01-30 17:19:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o1zti",
          "author": "gardenia856",
          "text": "The main thing you’re missing is talking to the exact people you want to sell to, not just studying agencies. Spend this week interviewing 10–15 potential clients (local gyms, salons, coaching centers, creators in Delhi) and ask: what are you already paying for, what burned you before, what would you pay more for if someone nailed it?\n\nFor research, go where real money moves: Upwork/Fiverr (sort by “most sold” gigs), Clutch and G2 for agency reviews, LinkedIn to see what services agencies highlight in their headlines, and Reddit/Twitter to see what clients complain about. Save screenshots of offers, pricing, and positioning in a Notion or Sheets doc and look for patterns.\n\nThen pick one niche + 1–2 services max (e.g., short-form video scripts + posting) and create a simple, specific offer with a clear promise and timeline. I use Notion for mapping offers, Loom for quick audits, and Pulse alongside things like LinkedIn Sales Navigator and Apollo to track Reddit convos that signal real demand.\n\nYour main goal right now: niche down, talk to buyers, then copy what works-simpler and sharper.",
          "score": 1,
          "created_utc": "2026-01-30 20:19:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2x30n8",
          "author": "Ok_Gain_1984",
          "text": "Sending power to you. Good Luck!!!",
          "score": 1,
          "created_utc": "2026-02-01 04:48:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}