{
  "metadata": {
    "last_updated": "2025-12-31 01:39:34",
    "time_filter": "week",
    "subreddit": "HowToHack",
    "total_items": 6,
    "total_comments": 49,
    "file_size_bytes": 51717
  },
  "items": [
    {
      "id": "1puaddz",
      "title": "How to detect Jammers",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1puaddz/how_to_detect_jammers/",
      "author": "Forward-Pay-1792",
      "created_utc": "2025-12-24 01:01:39",
      "score": 24,
      "num_comments": 34,
      "upvote_ratio": 0.82,
      "text": "Looking to buy smt to help detect a local jammer. Someone at a local business my friend owns is jamming our wifi and cells. We're looking to find out if we could by something to detect where it may be coming from so we can proceed with reporting it. Any advice? Or tips on what to buy? Or is there a way we can stop it?",
      "is_original_content": false,
      "link_flair_text": "hacking",
      "permalink": "https://reddit.com/r/HowToHack/comments/1puaddz/how_to_detect_jammers/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nvnbfd6",
          "author": "cybernekonetics",
          "text": "Jamming modern phone signals is actually pretty difficult and requires some heavy-duty equipment. Are you sure you don't just have bad reception?",
          "score": 41,
          "created_utc": "2025-12-24 01:50:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvzqpsw",
              "author": "sidusnare",
              "text": "They sell book sized all-in-one jammers on Alibaba etc, totally illegal, but not difficult or bulky.",
              "score": 3,
              "created_utc": "2025-12-26 07:38:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvn61kx",
          "author": "LongRangeSavage",
          "text": "Look up “radio fox hunt.” If you can find the location, report to the FCC or your country’s equivalent, especially if it’s affecting a business. Jamming signals to will be a gigantic fine.",
          "score": 30,
          "created_utc": "2025-12-24 01:16:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpoywh",
              "author": "Budget_Putt8393",
              "text": "Disrupting cell is a huge deal in the USA. The FCC takes that very serious.",
              "score": 11,
              "created_utc": "2025-12-24 13:22:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvxrpr8",
                  "author": "ArkansasGamerSpaz",
                  "text": "Yeah, only the government gets to jam signals without a trial, charge, or warrant.\n\nThe government hates competition.",
                  "score": 7,
                  "created_utc": "2025-12-25 22:56:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvobnxh",
          "author": "smorin13",
          "text": "A cell booster with the transmission antenna aimed in the wrong direction is a pretty effective jammer.  Ask me how I know.",
          "score": 16,
          "created_utc": "2025-12-24 05:57:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvzcty0",
              "author": "Dramatic_Teaching129",
              "text": "How do you know, and can we be friends?",
              "score": 1,
              "created_utc": "2025-12-26 05:31:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw8kay0",
                  "author": "smorin13",
                  "text": "I have a 30 foot plus tower.  The height helps with range, but makes all the equipment on the tower susceptible to high winds.  We had a nasty storm last spring and I didn't notice that the cell booster antenna had been turned more than 90 degrees away from the closest cell tower.  The antenna was basically pointing into a black hole if coverage.  If we were in the part of the house with the best coverage from the booster, calls would constantly drop or the call quality would be so bad you couldn't understand each other.  The indoor boost antenna is directional as well.  If we walked to a part of the house behind the indoor antenna the calls would clear up. The cause didn't register with me until I was doing some electrical work in the house and accidentally left the booster unplugged. Once I knew the source of the issue, I messes with the setup to find the best orientation. In the process I found that you could effectively disrupt calls by blocking the signal of the external antenna.",
                  "score": 1,
                  "created_utc": "2025-12-27 19:18:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nvx4e6x",
              "author": "TygerTung",
              "text": "How do you know?",
              "score": 1,
              "created_utc": "2025-12-25 20:31:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw11o0a",
                  "author": "ps-aux",
                  "text": "noise vs signal... wonderful things to understand lol...",
                  "score": 2,
                  "created_utc": "2025-12-26 14:36:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvnuw4h",
          "author": "CRIMSEN15",
          "text": "Equipment to locate a jammer is fairly expensive but just to see a jammer is active you just need a sdr with whatever cell or wifi bands you would like to check and then just look for alot of noise on a waterfall display. Pretty simple but most likely bad reception, too many on network, bad roaming agreements or weird case only cause one was found in NY a cell farm.",
          "score": 11,
          "created_utc": "2025-12-24 03:53:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvt7x96",
              "author": "WalksWithWs",
              "text": "Wouldn’t it just take 3 and some trianglulation code",
              "score": 3,
              "created_utc": "2025-12-25 02:11:54",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvvc1g7",
              "author": "New_Fuel7753",
              "text": "Surely you could just make a directional antenna (like a diy measuring tape yagi or similar) to locate a transmission by connecting it to the software defined radio?",
              "score": 2,
              "created_utc": "2025-12-25 13:55:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvvkaht",
                  "author": "CRIMSEN15",
                  "text": "Yeah you could do something like that, gosh out of practice think the military calls it loa, idk but either way idk if you know much about ellipses but even a directional antenna still creates one, so you still have a left and right error that gets larger the farther you walk towards your target in a way. And not saying the software isn't out there but definitely would need to possibly code your own. Not sure how many civ our out there df ing signals.",
                  "score": 1,
                  "created_utc": "2025-12-25 14:54:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvne9ha",
          "author": "jerwong",
          "text": "For cell it's a little difficult. For wifi, it's easier since most prosumer-grade wireless APs can act as a spectrum analyzer and you can look for strong signals coming in on the 2 ghz and 5 ghz range. If you're sure of it, you can reach out to the FCC and report it and they will come out to check. \n\nYou may also want to check your carbon monoxide detectors.",
          "score": 10,
          "created_utc": "2025-12-24 02:07:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvzd55a",
              "author": "Dramatic_Teaching129",
              "text": "Carbon monoxide detectors? Could you elaborate please",
              "score": 1,
              "created_utc": "2025-12-26 05:34:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw11z0h",
                  "author": "ps-aux",
                  "text": "you have enough information at hand to research this answer yourself.",
                  "score": 1,
                  "created_utc": "2025-12-26 14:38:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvpii3m",
          "author": "Select_Bat_5535",
          "text": "No one’s jamming your cell signal. For WiFi, it’s a possibility but even then WiFi isn’t as easy to jam such as something like GPS. Your easiest way to find it is build an SDR and antenna with a spectrum analyzer and RSSI then direction finding it from there.\n\nElectronic Warfare vet here.",
          "score": 9,
          "created_utc": "2025-12-24 12:36:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpxp0n",
              "author": "wornoutseed",
              "text": "What would you recommend for building something to track consumer drones?",
              "score": 3,
              "created_utc": "2025-12-24 14:17:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvq8mke",
                  "author": "NationalBug55",
                  "text": "Use a WiFi dongle that does both bands and is capable of monitor mode. Use kismet to monitor/control/ organize",
                  "score": 6,
                  "created_utc": "2025-12-24 15:20:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvndbl5",
          "author": "cant_pass_CAPTCHA",
          "text": "Are you sure it's jamming in the literal sense that it's sending out a lot of signal to make it unusable? Is just one wifi network affected or is all wifi unusable?",
          "score": 6,
          "created_utc": "2025-12-24 02:02:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvo1vrf",
              "author": "Forward-Pay-1792",
              "text": "Mainly cell, all cell phones and radios at the business where off for 40min straight, nothing we could do",
              "score": 6,
              "created_utc": "2025-12-24 04:42:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvp1rcb",
                  "author": "O-o--O---o----O",
                  "text": "And you a certain this is a jammer why exactly? Is this all the time, most of the time, occassionally or rarely? Could be an outtage, could be crappy reception influenced by weather.\n\nYou say \"wifi and cells\". These are usually on quite different frequencies. Whwt kind of wifi do you use? 2.5 or 5 or 6GHz?\n\nDid you try and see how far the \"jamming\" extends? At what distance and direction away from your workplace do you start getting better reception? \n\nAre all cellphones on the same provider/plan? Anecdote: in my country different providers have slightly different frequency bands and some of them were better or less suited for different purposes and one provider had a frequency assigned for usage that got more dampened/blocked by the way steel-reinforcement is used in skyscrapers, so you would get worse reception with them in a skyscraper with than another provider.\n\nFor wifi, it could be a deauther sending packets that tell the wifi to drop all connections constantly. \n\nOr it could be in a radar zone and disable certain bands so not to disturb the radar. And if it's a crappy access point/router it might not fall back to a free frequency band quick enough.\n\nOr someone could be using a cheap powerlan adapter that jams wifi as a side-effect. Or a ton of other things.\n\nEither way, if you say it's BOTH wifi AND cell, why not just call your mobile provider and your ISP and tell both that stuff isn't working and to send a technician?",
                  "score": 6,
                  "created_utc": "2025-12-24 10:03:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvoeipr",
          "author": "svprvlln",
          "text": "For a jammer to be effective, you must be able to overpower the signal between the source and endpoint devices. For cellular devices, this means a lot of noise; and this can be fairly easy to do using OTC radio equipment and powered antennas, or even by flooding the area with a combination of WiFi and BTLE devices. Having bluetooth enabled when you are not using it can be problematic for WiFi, especially if you are in close proximity to other devices that have BTLE enabled.  \n  \nIt is more difficult to jam a WiFi signal when certain settings are enabled on the AP that is serving the SSID. You want to find the setting in the router called \"Protected Management Frames\" and make sure that is enabled. Next, you want to ensure that your router is using a modern protocol like AC or AX with WPA2 minimum, or WPA3 preferred, and do your best to use the 5ghz spectrum if you can.\n\nIn the event that you are surrounded by interference, the 5ghz spectrum may be unavailable, and you will \"hop\" to the 2.4ghz spectrum of an AC or AX access point, and without PMF turned on, you are susceptible to deauthentication attacks that keep you offline. These kind of attacks do not affect cellular modems.\n\nAs per detection: you need a way to look at the logs. Deauthentication attacks look something like this:\n\nhttps://preview.redd.it/0ecdj9ibh39g1.png?width=1676&format=png&auto=webp&s=0cbd0452b873e0f4c2bb7373ecbd4a959884b92e",
          "score": 3,
          "created_utc": "2025-12-24 06:21:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvpohpk",
          "author": "eightbic",
          "text": "Phish tshirts usually give it away. ",
          "score": 2,
          "created_utc": "2025-12-24 13:19:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvqeqxg",
          "author": "Less-Mirror7273",
          "text": "Just notify local authorities about this situation. They have the tools and the legal stick.",
          "score": 1,
          "created_utc": "2025-12-24 15:53:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvst6ya",
          "author": "stefan-weiss01",
          "text": " Look for unusual noise patterns in the frequency bands you're monitoring.",
          "score": 1,
          "created_utc": "2025-12-25 00:22:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvegh2",
          "author": "New_Fuel7753",
          "text": "You might have success in contacting relevant [communications] authorities initially to see whether they are willing to investigate for you. Keep in mind however that it is more than likely that you are merely suffering from QRN (Man made interference) or just a poorly positioned antenna. \n\nMobile signal requires line of sight to communicate, there are only so many walls that signal can penetrate before it drops out completely. Since WiFi and Mobile spectrum are heavily limited on the amount of power used this is a very likely possibility.\n\n\nA badly placed antenna could be;\n\nNext to large amounts of electronics likely to generate RF noise\n\nNear or touching conductive materials/objects\nSurrounded by thick walls\n\nOr just a very non resonant antenna badly matched for the frequencies in use.\n\n\nNext steps I recommend;\n\nMake sure that you are not just having issues with thick walls. (Go just outside the door and see if there is any change in dB (download a app for this like \"signal detector\")) \n\nMove the position of your routers antenna so there is a clear line of sight\n\nBuy a better antenna built for the frequencies needed. (External,away from the router)\n\nGo crazy with ferrite cores.\n\n\nWhy should you listen to me? \n\nI am a licensed user of the RF spectrum and have to deal with issues like these on a regular basis. Hope this helps",
          "score": 1,
          "created_utc": "2025-12-25 14:13:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvyjvk3",
          "author": "AFarenci",
          "text": "Call the feds. FBI and/or FCC. Try to determine the boundaries of the affected area. The bigger the area you tell the feds about, the quicker they'll show up. Also the jammer should be in the middle more or less.",
          "score": 1,
          "created_utc": "2025-12-26 02:00:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw49vjm",
          "author": "LessCarry266",
          "text": "Could be a sim farm in a nearby unit",
          "score": 1,
          "created_utc": "2025-12-27 01:23:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwawkyw",
          "author": "ComfortableTune5639",
          "text": "I’m no hacker but perhaps what I do when I lose my phone will work. Just find out the limits of the range of the jamming in each direction, and then you can calculate the source perhaps? I do that using my earbuds, just find the range of how far you can go in each direction before it gets staticky and then arrange it on a mental graph.",
          "score": 1,
          "created_utc": "2025-12-28 03:11:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxerwr",
      "title": "Hardware I should look out for?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1pxerwr/hardware_i_should_look_out_for/",
      "author": "Famous-Tangelo1324",
      "created_utc": "2025-12-28 01:43:39",
      "score": 19,
      "num_comments": 14,
      "upvote_ratio": 0.91,
      "text": "New to pen testing here! Got a bunch of Christmas money and I need a new laptop. \n\nAny tips for specific specs or hardware to look out for that would make my journey easier? My price limit is around $400. Looking for something with base windows OS and I’ll boot up my live USB with Kali.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1pxerwr/hardware_i_should_look_out_for/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nwal4yg",
          "author": "BrokenWhimsy3",
          "text": "I would get a used Lenovo laptop off FB marketplace. You can get a lot of i5 laptops with 8 or 16 GB RAM quite easily for around 150 - 200. Most, if not all, will have an SSD and the RAM can easily be upgraded to 16 GB.\n\nLenovo has good Linux support, so you can run a number of distributions and try them out (including Kali).\n\nI would look for one with windows 11 as the base, if that’s the route you want to go.",
          "score": 8,
          "created_utc": "2025-12-28 02:03:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwamdcx",
              "author": "Famous-Tangelo1324",
              "text": "FB marketplace is a good idea. Thanks!",
              "score": 0,
              "created_utc": "2025-12-28 02:10:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwbke3b",
                  "author": "l3nzzo",
                  "text": "look into thinkpad t480. most parts are very customizable and although its not the most recent thing out there it still holds its weight just fine as a daily driver. i currently run a arch/windows dual boot on there via two separate internal drives",
                  "score": 1,
                  "created_utc": "2025-12-28 05:53:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwarb9g",
          "author": "DonkeyTron42",
          "text": "You're best bet is metasploit.  Learn to walk before you run.",
          "score": 3,
          "created_utc": "2025-12-28 02:40:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwaimqe",
          "author": "TallBlueberry5523",
          "text": "get a raspberry pi. run kali",
          "score": 2,
          "created_utc": "2025-12-28 01:48:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwam4d0",
              "author": "Famous-Tangelo1324",
              "text": "I will eventually, but i need the laptop for school and work too. I’ll eventually have a dedicated setup for pen testing, but I’m still new and just wanna learn",
              "score": 2,
              "created_utc": "2025-12-28 02:09:17",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nwc8ij8",
              "author": "AppropriateTwo2657",
              "text": "Or just raspbian lite on a zero2wh an hotspot +ssh",
              "score": 1,
              "created_utc": "2025-12-28 09:36:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwc8nnj",
                  "author": "AppropriateTwo2657",
                  "text": "Plus power bank , like 20gbp total maybe 25. You can learn a lot about Linux with this setup",
                  "score": 1,
                  "created_utc": "2025-12-28 09:37:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwam0ou",
          "author": "DeathBeforeDishonor7",
          "text": "Just search around for the best deal for what you need. If you are gonna be running labs at home just look for something with plenty of space do so. For me I found a Dell laptop with 32GB RAM and 1TB SSD and i7 cpu for $400 during a cyberweek deal.",
          "score": 2,
          "created_utc": "2025-12-28 02:08:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjedtv",
          "author": "Boring_Astronaut8509",
          "text": "Hey, welcome to the world of pentesting!   \n  \nSo $400 is totally doable, you just gotta be smart about where you spend it.\n\nHonestly? Skip the new laptops at that price point.   \nYou'll get way more bang for your buck with a refurbished ThinkPad – like a T440, T450, or T460. Those things are basically tanks and they run Kali like a dream.   \nLook on eBay or Facebook Marketplace for deals. Shoot for 8GB RAM minimum (16GB would be sweet but might stretch your budget), an i5 processor, and definitely an SSD if you can swing it. The SSD makes a huge difference even if it's only 256GB.\n\nNow here's the thing literally nobody told me when I started – your laptop's WiFi card is gonna be useless for anything wireless-related.   \nLike, Kali will see it, but you won't be able to do monitor mode or packet injection, which are kinda essential if you're getting into WiFi security stuff. You'll need to grab an external USB WiFi adapter with a compatible chipset. Budget around $30-40 for something like the Alfa AWUS036NHA or a TP-Link with the Atheros chipset. Trust me, finding this out after you've already bought your laptop is annoying.\n\nSo realistically you're looking at maybe $350 for a solid used ThinkPad and $30-40 for the WiFi adapter. The ThinkPad keyboard alone is worth it – you'll be typing a lot and those things are genuinely nice to use.",
          "score": 2,
          "created_utc": "2025-12-29 13:03:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwaltkh",
          "author": "Whatdafuqisgoingon",
          "text": "eBay has HP Elitebook laptops for less than 400 and you can get i5 or i7 and 16-32 gigs of ram and decent storage. Not sure about windows tho",
          "score": 1,
          "created_utc": "2025-12-28 02:07:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwascno",
          "author": "Veloxxx_",
          "text": "I don't know THAT much about hardware but Thinkpads are amazing for quite cheap",
          "score": 1,
          "created_utc": "2025-12-28 02:46:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwaukjf",
              "author": "Famous-Tangelo1324",
              "text": "The thought of thinkpads gives me flashbacks to middle school computer carts, but I’ll check it out!",
              "score": 2,
              "created_utc": "2025-12-28 02:59:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwb0per",
                  "author": "ps-aux",
                  "text": "they are the best bang for the buck, cheap i7s on ebay and you are better of running linux as primary os while virtualizing a windows instead... less hassle... be better off just doing docker + kasm imo since nothing on windows is worth having that you can't emulate on docker+kasm",
                  "score": 1,
                  "created_utc": "2025-12-28 03:36:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pxbbo6",
      "title": "How do you research and try to hack something?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1pxbbo6/how_do_you_research_and_try_to_hack_something/",
      "author": "TzarZara",
      "created_utc": "2025-12-27 23:05:14",
      "score": 8,
      "num_comments": 21,
      "upvote_ratio": 0.72,
      "text": "For context/example - the electronic pricing tags used in supermarkets - I can't stop thinking about how they might work and how hypothetically one could hack something like that. Which has led my curiosity to well how would you learn about a new system/product etc. and how you would go about trying to test and hack it? Can't imagine \"googling\" would get one very far lol.\n\n(I'm super new to cyber and hacking etc. so apologies for my naivety and thank you in advance)\n\nTldr; how do you research a new product you want to try and hack? ",
      "is_original_content": false,
      "link_flair_text": "hacking",
      "permalink": "https://reddit.com/r/HowToHack/comments/1pxbbo6/how_do_you_research_and_try_to_hack_something/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nw9s3xh",
          "author": "Zazucki",
          "text": "Learn everything you would need to know as if you were going to own/operate them, then learn about the protocols they use for data. That would be a good place to start.",
          "score": 10,
          "created_utc": "2025-12-27 23:16:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw9v1og",
          "author": "jddddddddddd",
          "text": "Regarding e-paper price tags, there’s a good writeup about them ( https://www.furrtek.org/index.php?a=esl ) which also links to a GitHub repo for some working code for hacking one specific model of price tags.\n\nAs for how this kind of thing is done in general, it will probably be a mixture of reading whatever datasheets are available for the product, examining source code if it’s open source (or disassembling the code if it’s not), or examining the hardware etc. if a device communicates over a network then try and see what data you can sniff with Wireshark, if it transmits over radio then try and decode the traffic with an SDR, if it communicates over USB then sniff with Cynithion, etc.",
          "score": 7,
          "created_utc": "2025-12-27 23:32:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwa52q1",
          "author": "Redgohst92",
          "text": "Research is the most important part of hacking something. Knowing everything about how it is supposed to work under normal circumstances is the only way to learn how to alter those circumstances. And knowing how to do that research without being caught (if it’s illegal). In this case it’s probably an rf frequency I’d start there.",
          "score": 5,
          "created_utc": "2025-12-28 00:29:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw9t8qi",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 2,
          "created_utc": "2025-12-27 23:22:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwlqysi",
              "author": "signtopper",
              "text": "When you say sandbox, i assume you mean creating a virtual machine testing the version that is publicly available through source code. Ie .. ios v18. If the OP doesnt know how to \"test security flaws\" by finding out what database the pricing tag uses wouldn't he need to first research what certificates it uses and then find the source code from that company. Because \"finding security flaws\" isnt the same verbage as \"hacking\" but im assuming that is what your saying",
              "score": 1,
              "created_utc": "2025-12-29 20:07:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwa2n7z",
          "author": "Distdistdist",
          "text": "Thinks picking locks. People who design them try to make it as difficult as possible to do so. People who pick them - deep learn about how locks work and, sometimes, discover flaws that let them pick that lock. Same applies here.",
          "score": 2,
          "created_utc": "2025-12-28 00:15:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwaqrqg",
          "author": "takeyouraxeandhack",
          "text": "For those e-ink price tags is pretty simple: Google the model, download the datasheet, done: you have the protocol to communicate with them.  \n\nThey probably have some authentication system, but getting around that is not legal, so it's up to you if you want to commit a crime, we can't help with that.",
          "score": 2,
          "created_utc": "2025-12-28 02:36:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwdapcw",
          "author": "Delicious-Ad2528",
          "text": "In the context of supermarket tracking systems in general: You could probably find a cheap Zebra MC40 and or TC70 from EBay or Facebook marketplace. \n\nFor the electronic pricing tags specifically, I believe that’s set by a base station or something, not the Zebra handhelds. \n\nWithout knowing much about the electronic price tags themselves, I’d research the protocols and technology used to see if it’s anything a flipper zero can tackle \n\nAs a new person researching it, try to figure it out on your own whether the flipper zero would be able to hack this. Don’t just ask chatGPT yes or no.\n\n> Can’t imagine “googling” would get one very far lol. \n\nNah try some reconnaissance, you’d be surprised. Whoever makes these could have full sets of public documentation. Could be as simple as dorking pdf in your search",
          "score": 2,
          "created_utc": "2025-12-28 14:42:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwltnyj",
          "author": "signtopper",
          "text": "Look man researching new products to hack makes no sense. You need to research how  amazon.com does this and research the certificates that allow them to collect the pricing information. This is easy because amazon has ssl certificates that are valid amongst many different OS..windows...mac.. if you wanted to \"hack\" a products price margin over several different online markets. You need to look into researching Amazon...it you wanna \"hack\" Amazon...which is a supermarket. There is a server you can find that amazon ssl certificates connect to...for example google dns server is 8.8.8.8 which is what your using to connect to a search engine. If you can find what port amazon uses then you will be \"hacking\" if you wanna hack reddit mods will delete that shit so quick",
          "score": 2,
          "created_utc": "2025-12-29 20:21:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwlue90",
              "author": "TzarZara",
              "text": "I was on about the little electronic price tags used in physical supermarkets/stores that the companies use to fluctuate prices based on demand and stock. The tags that replaced a little print out of the price tag. So I wouldn't be hacking Amazon or Reddit. Unless I have misunderstood your response?",
              "score": 1,
              "created_utc": "2025-12-29 20:24:49",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nwrhi54",
              "author": "castleinthesky86",
              "text": "What in the word salad are you the fuck on about? 😂",
              "score": 1,
              "created_utc": "2025-12-30 17:27:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwahax4",
          "author": "SubjectShock6003",
          "text": "Ask deepweb AI \nJk DON'T do that",
          "score": 2,
          "created_utc": "2025-12-28 01:40:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwan50f",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 0,
          "created_utc": "2025-12-28 02:15:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwb0sp3",
              "author": "ps-aux",
              "text": "this is unrelated to the original post.",
              "score": 2,
              "created_utc": "2025-12-28 03:37:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwb65gu",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-28 04:10:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwb65ix",
              "author": "AutoModerator",
              "text": "This link has not been approved, please read the descriptions for Rule 1 and 5 before trying again. Please wait for a moderator to review and approve this post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HowToHack) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2025-12-28 04:10:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwacpc4",
          "author": "ps-aux",
          "text": "get a job working in shipping/receiving at that store and you'll get to play with the tags and software that controls it... ;)",
          "score": 1,
          "created_utc": "2025-12-28 01:13:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwax2ej",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 0,
              "created_utc": "2025-12-28 03:14:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwb0wbk",
                  "author": "ps-aux",
                  "text": "no I can not help, because this is unrelated to the thread you are talking on...",
                  "score": 1,
                  "created_utc": "2025-12-28 03:38:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pxog8k",
      "title": "what are the networking concepts that essential for ethical hacking/cybersecurity?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1pxog8k/what_are_the_networking_concepts_that_essential/",
      "author": "evadranuvvu",
      "created_utc": "2025-12-28 10:41:57",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 0.73,
      "text": "pretty much the title",
      "is_original_content": false,
      "link_flair_text": "hacking",
      "permalink": "https://reddit.com/r/HowToHack/comments/1pxog8k/what_are_the_networking_concepts_that_essential/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nwcn0op",
          "author": "BeasleyMusic",
          "text": "You should have a firm understanding of all layers of the OSI model starting from the bottom.\n\nI cannot stress enough how important it is to understand these concepts. You WILL not be able to succeed if you don’t understand how to build a network, how to operate a firewall, how to read a route table, how to navigate a switch, and so much more.\n\nYou should look at getting a Network+ if youre really serious, it’s a great entry level network cert that will equip you with the basics.\n\nGrab a used Cisco switch off eBay too and maybe a firewall and build your own network at home. Don’t just read a book and say you know it, get hands on and build something",
          "score": 10,
          "created_utc": "2025-12-28 11:53:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwd6crw",
              "author": "imprimis2",
              "text": "Is packet tracer a good substitute for buying the physical hardware off eBay?",
              "score": 4,
              "created_utc": "2025-12-28 14:15:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwd6pz9",
                  "author": "BeasleyMusic",
                  "text": "Not a bad start, I’m not super familiar with it but I know people build labs with it.\n\nAnother fun project would be to create a virtualized network by virtualizing PFSense and some VMs on a virtual network that use PFSense as the router using something like virtual box on your local machine.",
                  "score": 2,
                  "created_utc": "2025-12-28 14:18:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwfcs25",
          "author": "datOEsigmagrindlife",
          "text": "Not network specific.  \n  \nBeing able to search google effectively for basic information and understanding how to use Google Syntaxes/Dorks to query specific sites.\n\nFor example, instead of posting this thread you could have just searched \"site:reddit.com what are the networking concepts that essential for ethical hacking\" and it will give you the information you are asking.\n\nIf you can't do basic research on your own, you're doomed to fail.",
          "score": 5,
          "created_utc": "2025-12-28 20:49:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwetkhi",
          "author": "cant_pass_CAPTCHA",
          "text": "To be a bit contrarian, the OSI model is just a dumb interview thing. I'm not saying don't learn it all, just that there is nothing very useful about reviewing PDNTSPA. \n\nYou should focus on concepts like how switches and vlans and segment networks, Active Directory (tickets, authentication, etc.), pivoting/lateral movement, getting a sense of which open ports relate to which technology and how to attack those.",
          "score": 5,
          "created_utc": "2025-12-28 19:16:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwcw3vs",
          "author": "EverythingIsFnTaken",
          "text": "[OSI Reference Model - Best Explanation](https://www.youtube.com/watch?v=eKHCH6rw0As)  \n[https://www.youtube.com/playlist?list=PLBf0hzazHTGPYo1Bc7v34Haistd\\_qQRmJ](https://www.youtube.com/playlist?list=PLBf0hzazHTGPYo1Bc7v34Haistd_qQRmJ)  \n[https://www.youtube.com/playlist?list=PLBf0hzazHTGM8V\\_3OEKhvCM9Xah3qDdIx](https://www.youtube.com/playlist?list=PLBf0hzazHTGM8V_3OEKhvCM9Xah3qDdIx)",
          "score": 1,
          "created_utc": "2025-12-28 13:07:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmcrkb",
          "author": "__aeon_enlightened__",
          "text": "Probably the most powerful and useful is to really learn the Network stack on Linux. \n\nHonestly if you are not doing this already, get a cheap computer, install arch (or heck even Gentoo), turn off Network Manager, plug into your main computer and just try to get the internet working on your cheap computer. See if you can mess around forwarding a few ports. Try to setup a NAT then maybe a bridge. Then see if you can setup a reverse gateway with another laptop far away out of town and try dialing home. \n\nA super satisfying thing is to buy a cheap ThinkPad and be able to remote into your beefcakes computer at home but in a way that's like 100% manual. Just homelab like crazy.\n\nLearn by doing not just by following lessons.",
          "score": 1,
          "created_utc": "2025-12-29 21:54:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pvn92a",
      "title": "So not exactly about hacking but I must ask",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1pvn92a/so_not_exactly_about_hacking_but_i_must_ask/",
      "author": "Ok-History9485",
      "created_utc": "2025-12-25 21:25:27",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "How would someone go about modifying this toy to play different audio files? My brother gave the brilliant idea of changing out the sounds to this fnaf toy, I'll describe it and explain it a bit, but basically it's a toy freddy head that held little blind bags of toys inside I got as a christmas gift, when you press the button on the top of the head on the hat it plays a cycled audio and the eyes blink and glow, I know I've saw people do stuff that let them change out audio files and such to play custom ones with toys similar but I just don't know how to do so or where to start or if I wanted to what to replace! I guess it's more just a silly question to ask but I would love to hear ideas or pointers would be nice, basically my brother suggested I change out the audio for something like the magic conch audio from spongebob so it acts like some sort of ask a question get a answer toy like in the show itself.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1pvn92a/so_not_exactly_about_hacking_but_i_must_ask/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nvxzvya",
          "author": "Conscious_Name9514",
          "text": "I’d replace the stored audio file but that’s me.",
          "score": 3,
          "created_utc": "2025-12-25 23:49:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvyqrw8",
          "author": "cant_pass_CAPTCHA",
          "text": "You'd likely need to flash new software onto the toy's chip. If you open everything up you'll find a computer board with chips on it. You'd need to locate the chip that holds the memory, likely unsoldered it, read the program stored on it, rewrite it but with an updated audio file, then solder it back in place. There might be a way to do it without removing the chip, but anyways it's going to require some hardware.",
          "score": 2,
          "created_utc": "2025-12-26 02:48:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw97yfm",
              "author": "Ok-History9485",
              "text": "Ah dang, I wish I knew how to solder, I suppose this will be a project I put on the shelf for now :D",
              "score": 2,
              "created_utc": "2025-12-27 21:26:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvxg8jq",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-25 21:44:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvxg8n9",
              "author": "AutoModerator",
              "text": "This link has not been approved, please read the descriptions for Rule 1 and 5 before trying again. Please wait for a moderator to review and approve this post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HowToHack) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2025-12-25 21:44:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pwy1d5",
      "title": "Can somebody help me",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1pwy1d5/can_somebody_help_me/",
      "author": "Unlikely_Ad2833",
      "created_utc": "2025-12-27 13:38:02",
      "score": 2,
      "num_comments": 12,
      "upvote_ratio": 0.57,
      "text": "Thank you for reading this i want to make an esp 32 c3 supermini  based deauth gadget wich scans all networks it can find and with 1 of 2 button sellects a network and with the second button starts the deauth. Does anybody have any tips or other help because i am new to coding ",
      "is_original_content": false,
      "link_flair_text": "programming",
      "permalink": "https://reddit.com/r/HowToHack/comments/1pwy1d5/can_somebody_help_me/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nwcz95o",
          "author": "Minge_Ninja420",
          "text": "If you give a cool and legal use case you're likely to get great answers. So many script kiddies on here obviously trying to do the wrong thing.",
          "score": 4,
          "created_utc": "2025-12-28 13:29:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw6vpv3",
          "author": "ZombiGrn",
          "text": "As long as you have permission to do so there are plenty of tutorials. Trial and error. And good luck, plenty of firewall will detect your test. Don’t be a goof, test it on your own network",
          "score": 3,
          "created_utc": "2025-12-27 13:58:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwdhqz5",
              "author": "noxiouskarn",
              "text": "Firewalls do not detect deauthorization packets sent to an AP...",
              "score": 3,
              "created_utc": "2025-12-28 15:22:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw6w2op",
              "author": "Unlikely_Ad2833",
              "text": "Yess thank you i set up an extra wifi on my router so the rest of the family doesnt get anoyed by my experiments",
              "score": 1,
              "created_utc": "2025-12-27 14:00:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwcrd4n",
          "author": "Minge_Ninja420",
          "text": "You'd have to be talking about flooding every single channel as most devices will hop channels rapidly. Leaving this comment to follow.",
          "score": 2,
          "created_utc": "2025-12-28 12:31:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwdiccc",
          "author": "noxiouskarn",
          "text": "Use spacehun's code for deauth as a base amd add code that allows you the two button solution you are trying to make.\n\nThat or buy a Wifi Nugget, or a Marauder, or a dstike watch",
          "score": 2,
          "created_utc": "2025-12-28 15:25:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwdwui6",
          "author": "Unlikely_Ad2833",
          "text": "NOTE i am using an old bit of code i wrote a time ago and i just made the menu i am trying to write the code from a open source project and edit it so it fits in my code",
          "score": 1,
          "created_utc": "2025-12-28 16:39:43",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "nw88xgq",
          "author": "keyboard325",
          "text": "You can buy one from eBay, I'll reply to this with the link, 1 sec..it connects to your phone.",
          "score": 0,
          "created_utc": "2025-12-27 18:21:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw896wl",
              "author": "keyboard325",
              "text": "Wifi Deauth Deauther 5GHz/2.4GHz Dual Band Pre-Flashed Custom SSID + OFF Button | eBay https://share.google/YytB5G1MNowKhQgSq",
              "score": 0,
              "created_utc": "2025-12-27 18:22:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw8kkft",
                  "author": "ps-aux",
                  "text": "posts were validated and approved",
                  "score": 2,
                  "created_utc": "2025-12-27 19:20:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw7d71g",
          "author": "nige_12",
          "text": "Can I dm because to give good tip",
          "score": -2,
          "created_utc": "2025-12-27 15:40:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}