{
  "metadata": {
    "last_updated": "2026-03-02 09:15:17",
    "time_filter": "week",
    "subreddit": "HowToHack",
    "total_items": 14,
    "total_comments": 69,
    "file_size_bytes": 81744
  },
  "items": [
    {
      "id": "1rf6obm",
      "title": "How do people DDOS?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rf6obm/how_do_people_ddos/",
      "author": "Ilikemilkshakes51",
      "created_utc": "2026-02-26 10:27:10",
      "score": 29,
      "num_comments": 26,
      "upvote_ratio": 0.78,
      "text": "All I know is that they gain the IP of a victim through an IP grabber, and then overload the router with large size packets, but how exactly do people overload the router in the first place?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rf6obm/how_do_people_ddos/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o7hreyv",
          "author": "DutchOfBurdock",
          "text": "dDoS is a DoS, but with multiple sources flooding a single endpoint with traffic.\n\nYou have a Layer 3 DoS, which will send traffic to an endpoint in order to overload the capacity of the link. Say you have a 500mbps downlink and I had a 1gbps uplink. I could (assuming your ISP doesn't rate limit traffic to your link) overwhelm your bandwidth by flooding it with UDP/ICMP/TCP. Despite your firewall dropping this, the traffic is still being pushed down your link before firewall sees it . This will saturate your downlink, slowing it to a crawl or completely overwhelming it.\n\nThen you have a Layer 7 DoS. This attempts to overwhelm the server itself, but sending legitimate requests in high volumes to saturate CPU and RAM, causing processes onboard to slow down or even crash.\n\nIn short, for L3, you need to generate more traffic than the endpoint can handle. Layer 7 you overload the server itself with requests to exhaust it.",
          "score": 52,
          "created_utc": "2026-02-26 10:42:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hqk6x",
          "author": "Kriss3d",
          "text": "By sending a ton of requests to it.",
          "score": 10,
          "created_utc": "2026-02-26 10:34:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hqofa",
          "author": "Sakul_the_one",
          "text": "Mostly using multiple machines and just spamming the system with packets ",
          "score": 9,
          "created_utc": "2026-02-26 10:35:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hqdsp",
          "author": "Ilikemilkshakes51",
          "text": "! QUICK WARNING ! I do **NOT** intend to use this is a malicious way or at all, I am just curious!",
          "score": 13,
          "created_utc": "2026-02-26 10:32:52",
          "is_submitter": true,
          "replies": [
            {
              "id": "o7hrevg",
              "author": "findingkieron",
              "text": "Overloading a router is called a da authentication attack. It's over loaded with requests so eventually kicked ever one off the networkand the trys again. A Dos attack denial or service or distribute D DOS is when large number of incoming requests are made to a server  and then gets over loaded.\nUsed to be a ddos cannon capable of the IP attack",
              "score": 6,
              "created_utc": "2026-02-26 10:42:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7i56g0",
              "author": "arquivo0",
              "text": "Os oficiais vão levar em conta essa declaração.",
              "score": 3,
              "created_utc": "2026-02-26 12:31:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7hze6p",
              "author": "greenyashiro",
              "text": "🤨",
              "score": 1,
              "created_utc": "2026-02-26 11:50:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o81ndeg",
              "author": "IronRiff_Messiah",
              "text": "There are some tools that can cause ddos. You chain them up from different systems and voila a recipe for disaster.",
              "score": 1,
              "created_utc": "2026-03-01 12:58:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7s0zcn",
              "author": "Massive-Range3384",
              "text": "thanks for the warning bro. no one is worried about you",
              "score": 1,
              "created_utc": "2026-02-27 22:06:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hqajk",
          "author": "Many-Strategy-5905",
          "text": "RemindMe! 5 hours",
          "score": 5,
          "created_utc": "2026-02-26 10:32:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hqd3u",
              "author": "RemindMeBot",
              "text": "I will be messaging you in 5 hours on [**2026-02-26 15:32:02 UTC**](http://www.wolframalpha.com/input/?i=2026-02-26%2015:32:02%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/HowToHack/comments/1rf6obm/how_do_people_ddos/o7hqajk/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FHowToHack%2Fcomments%2F1rf6obm%2Fhow_do_people_ddos%2Fo7hqajk%2F%5D%0A%0ARemindMe%21%202026-02-26%2015%3A32%3A02%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201rf6obm)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "score": 2,
              "created_utc": "2026-02-26 10:32:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7kz6hz",
          "author": "pete84",
          "text": "There are 3 main types.\n\nVolumetric. Usually udp. Udp allows for large packet size, and there is no handshake, so the source IP can be spoofed. These can easily  exceed 10gbps, so it could easily max out a 10gbps router or switch. \nDefense: use a cdn or something like Amazon waf to block the request. There are packet scrubbers but it’s best to just use cdn/waf.\n\nSyn flood. Layer 3 resource exhaustion. They start a tcp handshake, but never finish it. If the server has 65000 open connections, it can’t accept any more. This was particularly useful 10+ years ago, when Apache would keep a handshake open for something like 10 minutes.\nDefense: also cdn or waf. Also the Apache/nginx tcp connection timeout default is pretty good nowadays. Normal users complete handshake within a second or 2. \n\nLayer 7. This is harder. They can request parts of the website which combines a kit of resources, so that your server is stuck processing. Could be thousands of requests for a static image (consuming disk performance) or something like a php script to break cpu/ram.\nDefense: layer 7 waf. Also use cdn to cache static images. Ensure they don’t bypass your cache for static assets. Ensure autoscaling is enabled for your services.",
          "score": 4,
          "created_utc": "2026-02-26 20:53:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hrxrb",
          "author": "billy_teats",
          "text": "What is an ip grabber? If your computer is making contact with the “victim” you already have the IP. Maybe you just don’t know where to look for it so you found a tool that helps you expose it. \n\nThere are protocols that can be abused. UDP has an issue where it doesn’t verify what the source actually is, so you can send requests from “fake” ip’s that the victim will respond to. If you send the right request, your small request can elicit a very large response, chewing up processing power and network usage. \n\nAlternatively most ddos attacks use compromised machines to send the requests. Botnets. You tell your botnet to start sending data to a victim. If you have 1000 lightbulbs under your control all over a country you can have them send a constant stream of packets. This won’t have a noticeable effect for the sources, their home router can handle one lightbulb sending data. The victim cannot handle 1000 devices all sending data at the same time. \n\nIf you got a group of toddlers and convinced them all to ask their teacher a question at the same time over and over, the teacher can probably handle a few and still pick out individual voices to answer and manage. If you got every kindergartner in the state to ask a question at the same time the teacher would have no idea and be overwhelmed.",
          "score": 5,
          "created_utc": "2026-02-26 10:47:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7j54z2",
          "author": "goldfish_glug_glug",
          "text": "DDoS is just a denial of service attack from multiple devices in a botnet. \n\n\nDoS can be done a lot of ways since its just get a lot of data from point A to point B, but it depends for what'll be more effective. You can send a ton of UDP/ICMP packets, or oversized packets, TCP SYN floods, or reflections. A type of reflection is with DNS, you send queries to a DNS server while spoofing the victim IP, which makes the DNS respond to the spoofed IP with the requested records.",
          "score": 2,
          "created_utc": "2026-02-26 15:45:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7iy53i",
          "author": "GlendonMcGladdery",
          "text": "By gaining access to a bigger pipe than the victim",
          "score": 1,
          "created_utc": "2026-02-26 15:13:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o00u0",
          "author": "Admirable_Ad_2868",
          "text": "Send a lot of POST/GET. I mean A LOT",
          "score": 1,
          "created_utc": "2026-02-27 07:58:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vchlp",
          "author": "Glittering_Hope_4349",
          "text": "You can use lots of github available ddos tools for e.g MHDDoS. It sends out lots of requests (simple but a lot) and server just cant handle them all overloads and crashes or just doesnt allow the normal traffic to come in and to get proccessed aswell \n\n",
          "score": 1,
          "created_utc": "2026-02-28 12:39:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o832yvb",
              "author": "7ohVault",
              "text": "thats not a ddos though youd need many netowrks to run such program to make it a ddos",
              "score": 1,
              "created_utc": "2026-03-01 17:33:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7xzxp0",
          "author": "Parking_Statement613",
          "text": "Hping",
          "score": 1,
          "created_utc": "2026-02-28 21:11:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81elgj",
          "author": "New_Shoulder1087",
          "text": "By getting a bunch of other computers to go \"beep bop boop\" to it at the same time.",
          "score": 1,
          "created_utc": "2026-03-01 11:47:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdqt8y",
      "title": "How to reverse remote access connection",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rdqt8y/how_to_reverse_remote_access_connection/",
      "author": "Green-Check337",
      "created_utc": "2026-02-24 19:57:28",
      "score": 26,
      "num_comments": 36,
      "upvote_ratio": 0.86,
      "text": "recently i have seen youtubers reverse an anydesk connection where a scammer connects to their computer and from that connection they are able to connect to the scammers computer, i was wondering how you could do something similar to this\n\nhere is an exmple (the next 10 seconds explains what i am looking for)  \n[https://youtu.be/JR-PGndccBA?t=73](https://youtu.be/JR-PGndccBA?t=73)",
      "is_original_content": false,
      "link_flair_text": "hacking",
      "permalink": "https://reddit.com/r/HowToHack/comments/1rdqt8y/how_to_reverse_remote_access_connection/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o7d6i2j",
          "author": "Humbleham1",
          "text": "It's as simple as clicking a menu option as long as you have a subscription. The scammer does need to click on a popup to agree to reverse the connection.",
          "score": 19,
          "created_utc": "2026-02-25 17:58:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ghuf7",
              "author": "Impossible-End-9796",
              "text": "eh? there must be free version too right?  \nwhat happens behind the sences?",
              "score": 2,
              "created_utc": "2026-02-26 04:13:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7gn4a0",
                  "author": "Humbleham1",
                  "text": "Of course there's a free version. Obviously, the paid version has more features. It takes just a few minutes to install AnyDesk or look at the subscription plans and see where I'm going with this.",
                  "score": 2,
                  "created_utc": "2026-02-26 04:49:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7dgn9b",
          "author": "Ok_Confusion4762",
          "text": "I had the same question and as I understand from previous research, they somehow convince scammers to click specially crafted files like pdf on their computer that will allow the guy to have a reverse shell.",
          "score": 8,
          "created_utc": "2026-02-25 18:44:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7dnm7a",
              "author": "cant_pass_CAPTCHA",
              "text": "Same here. I saw it done and was curious. Some YouTubers like Jim Browning seemed to be very cagey with how it was done so it made it seem like something more technical, but I've seen others where they just go like \"oh yes it says waiting for the host to accept\" when they are told to do something and I assumed this was a way to trick them into reverse access.",
              "score": 6,
              "created_utc": "2026-02-25 19:15:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7ft1ct",
                  "author": "chicken_head_",
                  "text": "There was a video I watched years ago that the scam baiter used a spicific version of the remote software that had a vulnerability that allowed him to reverse the connection (he just has to get the scammer to use it). Some older versions allowed the controled machine to reverse the connection too.",
                  "score": 2,
                  "created_utc": "2026-02-26 01:47:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7emztn",
              "author": "Humbleham1",
              "text": "PDF exploits are quickly patched, and PDF readers are a dime a dozen. Trying to get a victim to open a PDF with a specific vulnerable version is pretty much a moonshot, but yes, some scambaiters may try to bait scammers with malware that looks like valuable files. Or transfer malware to the scammer's Startup folder if permissions allow that.",
              "score": 1,
              "created_utc": "2026-02-25 22:00:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ebbdi",
          "author": "Elegant-Ranger-7819",
          "text": "It's actually a social engineering hack, Jim Browning convinces the scammer to allow him to control his computer. He explained it on a podcast.",
          "score": 3,
          "created_utc": "2026-02-25 21:06:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kglbj",
              "author": "Green-Check337",
              "text": "Ok, but if I were to get them to accept me controlling their pc. How would I be able to “elevate access” to be able to control it anytime and not directly moving their mouse but be able to do things in the background?",
              "score": 0,
              "created_utc": "2026-02-26 19:24:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7rvoby",
                  "author": "Humbleham1",
                  "text": "You're asking this on a hacking forum? You click Yes on the UAC prompt.",
                  "score": 2,
                  "created_utc": "2026-02-27 21:39:14",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7y88ej",
                  "author": "anonwilled828",
                  "text": "Using tools like metasploit, sliver, empire, etc. there’s lots of options.  I prefer to work off termina vs GUI, u can input commands elevate privileges, steal tokens, migrate laterally, dump hashes and credentials, log keystrokes, everything…",
                  "score": 1,
                  "created_utc": "2026-02-28 21:55:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7czrru",
          "author": "Caldtek",
          "text": "With the support of the remote connection software supplier.",
          "score": 7,
          "created_utc": "2026-02-25 17:28:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hdpvg",
              "author": "Ok_Error9961",
              "text": "i was thinking the same , this one might be true, there can be nothing technical but just help from inside",
              "score": 3,
              "created_utc": "2026-02-26 08:30:59",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7rw3kn",
              "author": "Humbleham1",
              "text": "AnyDesk and its competitors would never allow someone to remotely access a computer without authorization, no matter how much the target abuses the software.",
              "score": 0,
              "created_utc": "2026-02-27 21:41:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7epukk",
          "author": "XFM2z8BH",
          "text": "they set up vm as a trap pc, with infected files, allow scammer access to that, files infect scammer's pc, aka a rat",
          "score": 1,
          "created_utc": "2026-02-25 22:14:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7g2a0i",
              "author": "OperationFriendly179",
              "text": "Or Honeyports",
              "score": -1,
              "created_utc": "2026-02-26 02:39:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7vddud",
          "author": "Glittering_Hope_4349",
          "text": "I mean what I like to use is something like NjRAT but there a bunch of tools available for RAT access \n\n",
          "score": 1,
          "created_utc": "2026-02-28 12:45:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d0lki",
          "author": "Commercial_Count_584",
          "text": "You know to understand what they are not showing you behind the scenes. I’ve done a little bit of research into this. But I’m not going to give it away. Mostly for their benefit. But its setup is how a lot of hackers use too.",
          "score": -17,
          "created_utc": "2026-02-25 17:32:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7d729m",
              "author": "Kbang20",
              "text": "This doesn't help OP at all... lmao",
              "score": 10,
              "created_utc": "2026-02-25 18:01:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7czcma",
          "author": "misoscare",
          "text": "You need to minotor the connections to the system for example using wireshark grab the IP and trace it back but it will be pretty useless if the attacker is using a VPN or multiple proxy's.\n\nThat's why it's so hard to trace a lot of attacks unless the gov can put pressure on said companies etc etc and all that palava",
          "score": -14,
          "created_utc": "2026-02-25 17:26:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7d6w98",
              "author": "Humbleham1",
              "text": "Bunch of nonsense. If you don't know the software or how firewalls and NAT works or network exploitation, don't confuse ppl.",
              "score": 11,
              "created_utc": "2026-02-25 18:00:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7d87vz",
                  "author": "misoscare",
                  "text": "Unless the connection is encrypted which most rats or malware aren't unless its government shit",
                  "score": -14,
                  "created_utc": "2026-02-25 18:06:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7dc8gc",
              "author": "Logical-Pirate-7102",
              "text": "Please go back to tryhackme",
              "score": 5,
              "created_utc": "2026-02-25 18:24:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7d2egb",
              "author": "Green-Check337",
              "text": "If I were to get their ip and have them connect to me could I use that for anything?",
              "score": 1,
              "created_utc": "2026-02-25 17:40:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7kf2ka",
                  "author": "Humbleham1",
                  "text": "You give them your ID number, then allow them to connect. If you want, you may be able to get an IP address then.",
                  "score": 1,
                  "created_utc": "2026-02-26 19:17:05",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7jfui6",
                  "author": "Bempf",
                  "text": "If you let them connect to you you are done.",
                  "score": 0,
                  "created_utc": "2026-02-26 16:34:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rg7n8s",
      "title": "How do I get started with ethical hacking?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rg7n8s/how_do_i_get_started_with_ethical_hacking/",
      "author": "lazygamer2852",
      "created_utc": "2026-02-27 14:07:57",
      "score": 22,
      "num_comments": 17,
      "upvote_ratio": 0.92,
      "text": "I have always been interested in hacking but not for any malicious reasons, just to learn about it. I also recently purchased a raspberry pi 4 to try to get started. Heres my question, what are the best things to buy to get started? As i was thinking about getting into wifi packet deauthentication and IR scanning tools, would that also be a good start?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rg7n8s/how_do_i_get_started_with_ethical_hacking/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o7psqf9",
          "author": "IsDa44",
          "text": "Why not learn th theory first to know what u need?",
          "score": 7,
          "created_utc": "2026-02-27 15:36:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pyblj",
          "author": "RutabagaOk522",
          "text": "Brother, before you buy anything flashy, go through [roadmap.sh](http://roadmap.sh) and look up cybersecurity expert. Try your best to follow its exercise and roadmap. If you want to browse subreddits, look through at its wikis. Thats your GOLD mine. For wifi packet deauthentication and IR scanning tools I find esp32s or esp8266 are wayyy cheaper and fun to tinker with. But try looking two of these guys up on youtube: Yellow Purple, Core Electronics. ",
          "score": 5,
          "created_utc": "2026-02-27 16:03:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7r0450",
              "author": "normalbot9999",
              "text": "holy cow [roadmap.sh](http://roadmap.sh) is fire!",
              "score": 3,
              "created_utc": "2026-02-27 19:01:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7txxjk",
                  "author": "RutabagaOk522",
                  "text": "I know right? The devs there know what they're doing. Its community based too so they regularly maintain it. I believe they have a discord channel as well. Lovely people.",
                  "score": 2,
                  "created_utc": "2026-02-28 05:10:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7psti1",
          "author": "beefdeadx0",
          "text": "i would start with basic network concepts. understanding how communication between computers work. I would recommend learning nmap for scanning, SUPER interesting. htb or portswigger have great info too. good luck, it's a long journey, keep in the good path",
          "score": 3,
          "created_utc": "2026-02-27 15:37:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7q2nyv",
          "author": "Nenogaming",
          "text": "what do u wanna do? the field is very huge , theres web, android , hardware , malware\n\ni'd say the best way is to learn fundamentals by reading books+ tryhackme ,, and then hack the box when you're more comfortable \n\nif you dont know what to study, just lookup any university 's course info, usually they will list what student learn in the # years in cyber security ,and then u can find materials related to that course\n\n you should learn some scripting language too ,\n\n or compiled language if u wanna do malware",
          "score": 2,
          "created_utc": "2026-02-27 16:24:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7zp3la",
          "author": "Mantaraylurks",
          "text": "Honestly the comment with most upvotes is on the nose. \n\nBut if you wanna buy something it’s a reliable laptop, once you learn the basics you can get a home lab set up. So on and so forth.",
          "score": 2,
          "created_utc": "2026-03-01 03:07:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pz7x4",
          "author": "Utopicdreaming",
          "text": "Don't spend money when youre not quite sure if youd even like it the way you think you will. \n\nYotube videos of redteamers and even discords about hacking \n\nLike the other two said theory and hackme",
          "score": 1,
          "created_utc": "2026-02-27 16:07:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7r3baa",
          "author": "xeroxgru",
          "text": "Learn the OSI model first.",
          "score": 1,
          "created_utc": "2026-02-27 19:17:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7t29nc",
              "author": "beefdeadx0",
              "text": "all people seem to need data processing",
              "score": 1,
              "created_utc": "2026-02-28 01:41:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7s47n1",
          "author": "low0nink",
          "text": "There’s a good starting point \nGo to “tryhackme” and start from there",
          "score": 1,
          "created_utc": "2026-02-27 22:23:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x2iez",
          "author": "Heavy-Career-1800",
          "text": "hello i need lanschool air blocker\n\n",
          "score": 1,
          "created_utc": "2026-02-28 18:17:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o84w9k0",
          "author": "Jazzlike_Flight_6651",
          "text": "Look up hexdump on youtube. He's got really good basic tutorials",
          "score": 1,
          "created_utc": "2026-03-01 23:01:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rg2ioc",
      "title": "Friend getting abusive emails, OTP spam and attempted WA breach, urgent advice?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rg2ioc/friend_getting_abusive_emails_otp_spam_and/",
      "author": "420Deku",
      "created_utc": "2026-02-27 09:51:49",
      "score": 10,
      "num_comments": 9,
      "upvote_ratio": 0.78,
      "text": "A friend of mine is getting abusive emails on her work email and nonstop OTP/SMS spam to her phone. Someone’s also trying to get into her account on WA. She’s panicking and wants to take quick action, she’s fine involving the authorities. What immediate steps should we take right now and what should we do if this keeps up?\n\nLooking for: fast, practical steps (technical and legal) and what evidence to collect for police/cyber cell. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rg2ioc/friend_getting_abusive_emails_otp_spam_and/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o7ofphq",
          "author": "RutabagaOk522",
          "text": "Holy this is serious! I feel for you and your friend mate. Much respect for you for taking the time out to help her out. Theres definitely some immediate actions she could take right away:   \n  \n\\- Lock everything down. Turn on WhatsApp 2‑step verification with a strong PIN please im begging you. Tell her to check “Linked devices” and log out of anything unfamiliar, and never share any codes with anyone.   \n  \n\\- Change passwords on work and personal email, banking, cloud, and social accounts (lock her card as well whether its debit or credit), and once again im begging you please make every password unique and enable app-like 2FA (like Google Authenticator) wherever possible.   \n  \n\\- Make sure to also check email settings for strange forwarding rules or “send as” permissions. Because of the nonstop OTP spam, she should definitely call her mobile provider and ask for a SIM‑swap/port‑out lock and a customer‑service PIN (KYC crap)... and she MUST ignore any OTPs or login prompts she didn’t request.   \n  \n\\- On the work side, she should inform IT/security in writing that she is receiving abusive emails and seeing repeated login or OTP attempts (SCREENSHOT EVERYTHINGGGGG). Also ask IT to check for suspicious logins, retain logs, and block abusive senders, and loop in HR if the harassment is connected to work or impacting her ability to do her job.   \n  \nFor evidence, my rule of thumb is: don’t delete, don’t argue, just document.   \n  \nSo keep all the emails, screenshots showing sender, recipient, date/time, subject, and full content. Export it if she has to. The most important thing is to SCREENSHOTTING EVERYTHINGGGG that includes OTP floods and any abusive SMS or WhatsApp messages (including timestamps).   \n  \nShe should also keep a simple timeline document noting when this started, how often it happens, which channels are affected, any idea who might be behind it, and how it’s affecting her sleep, anxiety, and/or work. If there are threats, doxxing, or ongoing attempts to break into accounts, she should go to the police or cyber cell with her phone, with a short written timeline, and the collected evidence. Just ask for a case number and clearly state that this is targeted, ongoing harassment that’s affecting her safety and employment.\n\nSorry for rambling as this happended to my grandmother before. If you need further assistant please feel free to reach out. Stay safe.\n\n",
          "score": 6,
          "created_utc": "2026-02-27 10:26:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ofyti",
              "author": "420Deku",
              "text": "Thanks! So currently we are in line with what you have mentioned. We will be informing the police today too. Hope we get some good insights",
              "score": 3,
              "created_utc": "2026-02-27 10:28:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7onlp4",
                  "author": "RutabagaOk522",
                  "text": "Keep us updated. If you need help in gathering documents let me know. Happy to help out! Stay calm and know that you have this community rooting for you :)",
                  "score": 1,
                  "created_utc": "2026-02-27 11:34:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ocrzx",
          "author": "student-1010",
          "text": "defend yourself? nah... time to go offensive. There is thing called \"email tracker\" where you can embed 1x1 pixel images from a remote server. Whenever someone clicks on your email, you can see which ip the request came from. Send emails embeded with such trackers(many user friendly chrome extensions can help with this) to the sender of those abusive emails.\n\nnothing much you can do with just the ip but you can send it to the police with other evidence who can trace it",
          "score": 5,
          "created_utc": "2026-02-27 09:59:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7te1fa",
              "author": "Bullion_Lord",
              "text": "Elite ball knowledge this is why I love Reddit",
              "score": 2,
              "created_utc": "2026-02-28 02:54:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7of56u",
              "author": "420Deku",
              "text": "Okay will try this",
              "score": 1,
              "created_utc": "2026-02-27 10:21:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7uo8t3",
          "author": "tahaan",
          "text": "Email messages include a set of headers that shows the true path the email took to reach you.  This is not included when you forward or reply to an email.  Just keep all the email so that a forensics or security specialist can look at it.\n\nWhat is \"WA\" ?  Only think I can think of is Whatsapp?  Contact them, and tell them you are under attack.\n\nChaning passwords on everything is fine, as other responses suggested, but be wary since it will also include OTPs/validation.  Not saying don't do it, just saying be super careful that you only enter your own valid OTPs and don't click the wrong link.  **Best to copy-paste the OTPs and not click links!**\n\n  \nEnable MFA wherever it is supported.  From Steam to Google to everywhere.\n\nDon't use the same password in more than one place.  Ever.\n\nUse a password manager.  Much as we love to hate on Google, their Chrome built-in password manager makes it difficult to enter the wrong password into the wrong site.  \n\nIf you use passwords you can remember, chances are they are easy to hack.  Use strong passwords.\n\n",
          "score": 2,
          "created_utc": "2026-02-28 08:59:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o86nug2",
          "author": "Commercial-Wait-7609",
          "text": "Cyber Investigator here 👋 \n\nYou can go into their email header to locate their ip address. However, there's a strong chance that they're using a VPN that's concealing their real location. You can still request a subpoena for the ISP from the vpn host that can help provide you their information that way.\n\nThe best way I find online bullies and scammers is through baiting tactics. I would pretend to be the victim or a relative of them who offers payment to stop the abuse. Once you can get a verifiable email, phone number, then that's where your chances of the real person increases much higher. A common mistake online criminals make is providing phone and emails connected to bank accounts that require their true identity to be verified. I'll forst enter their info in cash app, venmo, and PayPal. If I don’t find a person or anything traceable, asking for their Zelle ID or address to send money to is usually golden. PO boxes can be traced back to owners online, believe it or not.",
          "score": 1,
          "created_utc": "2026-03-02 05:51:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdm1sa",
      "title": "Is there any relationship between civil engineering, technology, and hacking?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rdm1sa/is_there_any_relationship_between_civil/",
      "author": "abdellah9966",
      "created_utc": "2026-02-24 17:09:09",
      "score": 8,
      "num_comments": 5,
      "upvote_ratio": 0.91,
      "text": "Since I'm studying civil engineering, I don't want to limit myself to what I learn in that field. I want to create something related to information technology and hacking within this discipline, to develop an innovation that will be very useful to the field and hasn't been discovered yet, thus achieving success despite being a beginner at the moment. ",
      "is_original_content": false,
      "link_flair_text": "very cool",
      "permalink": "https://reddit.com/r/HowToHack/comments/1rdm1sa/is_there_any_relationship_between_civil/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o76a9fi",
          "author": "Shinazolvigo",
          "text": "Civil engineering uses tech for design, analysis, and management. Hacking, in a broader sense, can involve exploiting tech vulnerabilities. Some \"hack\" systems to improve them (white hat hackers). In civil engineering, tech like BIM is a game-changer.",
          "score": 4,
          "created_utc": "2026-02-24 17:48:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ugid1",
              "author": "abdellah9966",
              "text": "BIM is the future; it's best to study it in depth.",
              "score": 1,
              "created_utc": "2026-02-28 07:49:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ke5ku",
          "author": "RelevantScience4271",
          "text": "I doubt there is a close link but in broader sense everything uses tech and every tech can be hacked ",
          "score": 2,
          "created_utc": "2026-02-26 19:12:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ugmgx",
              "author": "abdellah9966",
              "text": "You have given a useful summary",
              "score": 1,
              "created_utc": "2026-02-28 07:50:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o871h4i",
          "author": "cappucinosid",
          "text": "Civil engineering has no direct connection with hacking , If you want to build something related to hacking you can learn it separately! Maybe in the first year of engineering they will teach you some coding but later they will only teach you topics related to civil engineering which has no connection with hacking",
          "score": 1,
          "created_utc": "2026-03-02 07:53:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgq3rl",
      "title": "CS student confused about next steps in cybersecurity – need honest guidance + learning resources",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rgq3rl/cs_student_confused_about_next_steps_in/",
      "author": "Smooth_One_3492",
      "created_utc": "2026-02-28 02:05:36",
      "score": 7,
      "num_comments": 2,
      "upvote_ratio": 0.89,
      "text": "Hi everyone,\n\nI’m a Computer Science engineering student (2nd year) from India and I want to build a serious career in cybersecurity. I’m posting here because I’m a bit confused about what to focus on next, and I’d really appreciate guidance from people already in the field.\n\nMy current status:\n\nI understand basic cybersecurity concepts (threats, vulnerabilities, common attack types).\n\nI have basic networking knowledge: TCP/IP, OSI model, ports, DNS, HTTP/HTTPS, routing basics.\n\nI’ve completed Linux basics and I’m comfortable working in it.\n\nI’ve installed Kali Linux (VirtualBox) and explored some tools.\n\nI know HTML & CSS, basic web fundamentals, and I’m slowly learning JavaScript.\n\nI’m interested in web security / offensive security, but I don’t want to jump blindly.\n\nLong-term plan: Master’s in Cybersecurity abroad (Germany/Australia are current options) + strong certifications later (OSCP-level).\n\nWhere I’m confused:\n\nShould I strengthen networking and web fundamentals more deeply before going hard into security?\n\nShould I master web fundamentals first (HTTP, cookies, sessions, auth, CORS, etc.) or start web security in parallel?\n\nIs it okay to start web security now (OWASP Top 10, labs) while improving fundamentals side-by-side?\n\nWhat should my next 6–12 months realistically look like as a student?\n\nHow important are CTFs and labs (TryHackMe / Hack The Box) vs theory at my stage?\n\nWhat beginner mistakes do you often see that I should avoid?\n\nLearning resources question: I’m struggling to find structured and trustworthy YouTube content (too much clickbait and shallow tutorials).\n\nCould you recommend:\n\nSpecific YouTube channels or playlists for:\n\nNetworking (from a security perspective)\n\nWeb fundamentals\n\nWeb security / OWASP Top 10\n\nBeginner-friendly offensive security\n\nCreators you personally trust and would recommend over random tutorials\n\nI’m not looking for shortcuts—I want a solid foundation, realistic expectations, and a roadmap that leads to internships, real skills, and eventually a good job.",
      "is_original_content": false,
      "link_flair_text": "hacking",
      "permalink": "https://reddit.com/r/HowToHack/comments/1rgq3rl/cs_student_confused_about_next_steps_in/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o7ughka",
          "author": "Historical-Show3451",
          "text": "There are a lot of questions here, but I'll try to answer as many as I can. If you are starting, my recommendation is starting out from TryHackMe. They have tons of content (60% of which is free) and hands-on labs you can try out while learning. I think starting there would be the best option, as that is also the path I chose to take. Learn theory while doing hands-on labs. TryHackMe does have two different types of \"rooms\": challenges and walk-throughs. So, those should help you a lot.\n\n  \nYes, definitely strengthen your networking skills. That will be a great base for you to start in cybersecurity. Web fundamentals are also important to learn, but it really does depend on which path you want to take. If you are looking into red teaming/pentesting, I would learn web skills, as that is most likely needed for offensive paths.\n\nSome mistakes beginners make are that certifications are everything (or, in some sense, will get you a job). This is not true. Certifications will definitely help boost your resume, but most of the time, certifications are used to pass through the HR level of interviews. There are technical parts of interviews (as expected). I'm not saying certifications are not important, but you shouldn't go certification hunting.\n\nAnother mistake is that beginners don't write notes. Notes are very important so that you can retain more information and go back if you don't remember something. Some tips I give are that your notes should be:\n\n1. Note too long, but not too short either. It should have some decent amount of information.\n\n2. Organized in a way you can quickly find the stuff you need. This will differ between people\n\n3. Usable for the future. If you won't use it ever, no need to write it down.\n\n4. Based on the techniques, tactics, procedures, and tools you learned. If you are starting in TryHackMe, for example, you shouldn't make your note title the same as the name of the room you are completing. You will not remember which room/content taught you what. \n\nObsidian is a great app to use for writing notes. It is completely free (except for linking your notes between different devices, which isn't necessary), and it is what I personally use.\n\nLet me know if you have any more questions, and I'll try to answer them with the best of my ability. Hope this helps!",
          "score": 2,
          "created_utc": "2026-02-28 07:48:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7uq194",
          "author": "cracc_babyy",
          "text": "The job market is rough right now, but it’s also the easiest and best time to learn..\n\nThere’s basically unlimited resources out there, and 95% of the good stuff is free\n\nI wouldn’t spend any money right away, try HTB and THM and others, then when you get some traction you can consider paying for a subscription or whatever.. \n\nI’m partial to HTB, but it’s not incredibly beginner-friendly..\n\nWhatever you do, just keep at it, practice or study every day, and you will get there\n\nYou mentioned interests, but you didn’t tell us where you are at currently, so I assume you are a beginner..\n\nStart by spinning up a VM, Kali or parrot, learn to use Linux CLI, maybe nmap scan your home network\n\nProfessor Messer on YT is a networking god",
          "score": 1,
          "created_utc": "2026-02-28 09:16:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd2czz",
      "title": "Software locked to tablet.. want to use different tablet",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rd2czz/software_locked_to_tablet_want_to_use_different/",
      "author": "Comprehensive-Two364",
      "created_utc": "2026-02-24 02:29:18",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I have a long arm quilting machine (think CNC sewing machine) that uses Prostitcher software that they provide on a Chuwi X tablet. Recently there have been a bunch of the tablets with exploding batteries. Of course they will happily replace the tablet for $1000. How hard would it be to move the software to another machine? Supposedly the software is configured to run on only this tablet. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rd2czz/software_locked_to_tablet_want_to_use_different/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o72foit",
          "author": "strongest_nerd",
          "text": "This is an IT question, not a hacking question. Ask the company that provides the software and ask for the APK. Also there have not been a \"lot of exploding batteries recently with tablets.\" Or just extract the APK if you have root https://github.com/alexcmgit/kanade.",
          "score": 1,
          "created_utc": "2026-02-24 02:33:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74x654",
          "author": "red-joeysh",
          "text": "Contact ProStitcher support; they are better suited to answer that. Depending on the license agreement, you may be able to transfer the license from one device to another.\nThat's the only legal way of doing it.",
          "score": 1,
          "created_utc": "2026-02-24 13:56:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75kptd",
          "author": "ps-aux",
          "text": "why not just replace the batteries? seems like the cheaper alternative... in order for someone to test the theory of putting the software on something else you would have to be willing to part with a tablet while they reverse engineer it etc...",
          "score": 1,
          "created_utc": "2026-02-24 15:52:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o75lbw0",
              "author": "Comprehensive-Two364",
              "text": "Ideally I’d like a larger tablet (old man eyesight lol)",
              "score": 1,
              "created_utc": "2026-02-24 15:55:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rcfzsu",
      "title": "Help to end network/device hacking attack please",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rcfzsu/help_to_end_networkdevice_hacking_attack_please/",
      "author": "Unique_Opinion1978",
      "created_utc": "2026-02-23 12:21:37",
      "score": 6,
      "num_comments": 13,
      "upvote_ratio": 0.75,
      "text": "Hopefully you're able to help. The site was discovered while searching for solutions to end a mass sound hacking attack. \n\nI'm a disabled 48 year old man with severe sensory PTSD, agoraphobia and psychogenic hyperventilation. \n\n Home is Broughton Astley, Leicester.\n\nSince 25 February 2023 hackers have remotely been adjusting TV sound frequency/pitch. It could be a radio frequency device?\n\nI've researched the devices extensively but the technical terminology is unfamiliar and it isn't clear which device would work. The person is known to me and formed a vendetta in a gym between 2017/18. I heard them discussing their use of related technology in the gym among friends but didn't gleen more specific details.\n\nI haven't seen them since January 2018 and reported this many times but still it continues. I've liaised with several doctors and it's not imagined or exaggerated. Various sound files prove how poor the TV sound frequency is.\n\nThey heard the files as have many others and after doing so were in no doubt. The hacker also does it to the mobile, tablet and laptop but I've only captured it on the TV. It sounds even worse in person. Several hearing tests revealed my hearing is fine. Is there any secure router or network solution you can suggested that would block them? I purchased a TP Link Archer Vx1800v last year but it's suggested security features didn't stop any of the attacks.\n\n17 TVs and several soundbars were replaced under warranty in 2023 as the hacking continues. An alternative non smart TV was also purchased but once it connected by aerial they hacked the sound on that too. \n\n They alter the frequency/pitch so vocals are tinny, hollow and distorted. It induces severe nausea, tightening chest and thorax, inability to draw deep breath, laboured breath and tremor as the sound is terrible. \n\n Please note that they live in Watford, 70 miles away from me. It's an unprovoked anti-disability vendetta. \n\n It most definitely is happening, is possible and isn't imagined.\n\n Please advise on devices/tools that I can purchase which would re-adjust the TV frequency/pitch to the level it should be at or how it could be blocked.\n\n \n\nMany thanks and yours sincerely, ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rcfzsu/help_to_end_networkdevice_hacking_attack_please/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o6zhv7o",
          "author": "LongRangeSavage",
          "text": "Assuming this is OTA television, UK TV frequencies range from 470-854MHz. There’s no possible way someone is doing anything to the signal from 70 miles away—at least not without a very tall tower, and a lot more people than you would be affected. \n\nAssuming this is streaming television, it’s still very unlikely that anyone is continually hacking your systems. Streaming services are going to have some sort of encryption mechanism so traffic can’t be intercepted between the source and destination—even when using UDP. The only type of people that would even have this type of ability (to continually hacking devices) are going to be state level actors. They will not waste multiple millions of dollars and years of research on someone that isn’t a government official, diplomat, journalist, or activist. The chances of being continually hacked when changing to different hardware vendors makes it even less likely. \n\nThen saying they are doing it over both over the air and through internet, just lowers the likelihood. OTA would be easier to confirm, you’d just need a SDR and a directional antenna. From there you can isolate signal directions and compare those bearings from your location to known transmitting towers. Again, you’d be wasting a lot of time because for someone to be messing with you from 70 miles away, while you’re using OTA, UHF band television is going to be nearly impossible to focus radio waves small enough to only impact a single person. \n\nAll of that to say the chances you are constantly being hacked is so low that it’s statistically improbable. What’s more likely, and even then the chances are almost zero, is something closer to you could be causing interference at just the right frequencies to distort signal. What makes that almost statistically zero is you’re “hacked” using both OTA and streaming.",
          "score": 8,
          "created_utc": "2026-02-23 17:33:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71i5h9",
          "author": "stevebehindthescreen",
          "text": "This has been going on for at least 3 years now going by your post history. I'll just be straight up here, no one is doing what you are saying and there is some other factor involved and the most logical answer is a medical one.\n\nTechnology is not something you just 'hack'. Every device is different, you are using different apps on your smart TV and they all have different methods and secure servers to pull their content from. For someone to intercept those streams, decode the audio and then reencode the audio and replace it on your TV would be an excessive and rather complicated thing to pull off and would require physical access to each device and the capability to install custom hacked certificates on to let the intercepts happen.\n\nWith everything going over SSL and being encrypted this just isn't a thing that you are mentioning. Live TV on old analog signals could have easily been tampered with but not only you would be experiencing it, lots of others would and they would be making noise over it.\n\nYou already touched on health issues, there is more to this than technology problems I can assure you that. Please understand this and seek help to get better.",
          "score": 5,
          "created_utc": "2026-02-23 23:22:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73gclu",
              "author": "Internal-Sun-6476",
              "text": "Sounds like a classic carbon monoxide induced post. OP get to your Doctor ASAP!",
              "score": 3,
              "created_utc": "2026-02-24 06:51:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6zdn99",
          "author": "ForrestCFB",
          "text": "This sounds more like a psychological issue. \n\nOr just basic interference or bad cables or some faulty piece of hardware you haven't found. \n\nSomeone hacking the pitch of a TV just to get back at you is VERY unlikely.\nJust adjusting the pitch also shouldn't have that huge a physical impact, it's not a LRAD.",
          "score": 3,
          "created_utc": "2026-02-23 17:13:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zpp4y",
          "author": "namedotnumber666",
          "text": "you could be getting intermodulation from a nearby RF sources, I would highly recommend you buy a carbon monoxide detector.",
          "score": 3,
          "created_utc": "2026-02-23 18:10:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zxl6t",
          "author": "TygerTung",
          "text": "You could watch vhs and DVDs so they won't be vulnerable to any kind of hacking. Use an old TV too which doesn't have any kind of \"smart\" features.",
          "score": 3,
          "created_utc": "2026-02-23 18:45:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76cn3w",
              "author": "GuessSecure4640",
              "text": "Makes too much sense",
              "score": 2,
              "created_utc": "2026-02-24 17:58:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o70fo3i",
          "author": "[deleted]",
          "text": "That sounds like a Philip K Dick story!",
          "score": 3,
          "created_utc": "2026-02-23 20:09:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o743br6",
          "author": "findingkieron",
          "text": "Do you have a smart TV I'm thinking assessing it via your router over your internet is my only guess we can reset you router or internet but I'm unsure if this is the source of the problem",
          "score": 1,
          "created_utc": "2026-02-24 10:26:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rhp74",
          "author": "Surfnazi77",
          "text": "Change your WiFi router password",
          "score": 1,
          "created_utc": "2026-02-27 20:29:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74074x",
          "author": "Unique_Opinion1978",
          "text": "Please use the complete word rather than an acronym. Many thanks, Josh",
          "score": 0,
          "created_utc": "2026-02-24 09:57:59",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o73zzht",
          "author": "Unique_Opinion1978",
          "text": "I'm the poster responding to the answers and suggestions. Please note that I'd only like to hear from people who have an idea of how this is possible and how to end it i.e. with router, network/other solutions. I know of the person doing it (as someone to say hello to etc in a gym) and heard her discuss the bespoke hacking devices that she uses in the gym between 2017 and 2018. She formed a vendetta and its totally unprovoked. Plus there were hints the TV, phone and laptop hacking would begin on instagram in February 2023. It isnt imagined or exaggerated and I'm not sitting her hearing distorted sound pitch. Please, please dont gaslight. Sound files have been played to friends. Family, doctors and all have confirmed its very uncomfortable for them to listen to and is very likely hacking. Please only respond if you can help with technical solutions and if you know of ways it can be done and most importantly ended. This particular hacker is sitting at home and alters all devices I use as part of her daily routine so the phone, laptop sound is also often very uncomfortable. I've had hearing tests and my hearing is fine. I understand its far fetched for people who haven't experienced it but I have no reason to lie. To those who have suggested measuring signals etc, please elaborate in simple terms. \nAgain, please dont respond with unconstructive posts about how its not possible. Also, its been reported many times but nothing could be done due to the complexity and evidence gathering. \n\n\nMany thanks,\n\n\nJosh ",
          "score": -2,
          "created_utc": "2026-02-24 09:56:00",
          "is_submitter": true,
          "replies": [
            {
              "id": "o7rlm2p",
              "author": "PlusNone01",
              "text": "Hey, just trying to narrow stuff down.  Is it affecting all your personal devices? Everything within a specific network? Ie home, work, gym or just every device that you use?",
              "score": 1,
              "created_utc": "2026-02-27 20:49:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rf28vo",
      "title": "Web app or network pentesting?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rf28vo/web_app_or_network_pentesting/",
      "author": "dotagamer69420",
      "created_utc": "2026-02-26 05:58:11",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 0.84,
      "text": "Hi all, I am sure this question goes around a lot (I’ve seen it myself a couple times) but I was curious what people in the field have to say about this topic. \n\nCurrently I’m a Systems Engineer, we deal with network / Server administration (Firewalls, Wifi configuration, Cloud infrastructure, AD, File Servers, some web servers, etc.). I have a friend who’s a security engineer at Apple who thinks it makes the most sense to transition into whatever you have the most background in, which for me would obviously be either network or cloud. \n\nHaving read through this reddit as well as other Pentesting adjacent places, almost everyone says to go for web apps first. I am not sure whether I want to do full on pentesting in the future, my main goal is to transition into security. I absolutely love the act of pen testing, I think the one thing that makes me hesitant to want to do it is how hard it is to initially get into. My plan at this moment is to transition into some type of security role, and then determine whether I want to go for pentesting or another more senior security role after. \n\nBut my main purpose of this post was to get people’s opinions on whether I should focus on web apps first or net pentesting to start out with. I’ve read that its best to specialize in one area first and try to stand out from the rest of the crowd for the best chance at transitioning into the security field. Any opinions or suggestions are appreciated. Thanks for reading. ! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rf28vo/web_app_or_network_pentesting/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o7h6hot",
          "author": "signal_sentinel",
          "text": "Your friend at Apple is 100% right. Since you're already a Systems Engineer, Network and Cloud Pentesting is your \"unfair advantage.\"The market is flooded with junior web pentesters who can run Burp Suite but don't understand subnets or AD. If you master internal pivoting, Kerberoasting, and Cloud misconfigurations, you'll be far more valuable. Don't start from zero in Web when you're already halfway to being a solid Infrastructure security specialist.",
          "score": 3,
          "created_utc": "2026-02-26 07:23:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h97n2",
          "author": "PlusRise",
          "text": "They're both great, and you need to know both eventually anyway. Every company has a network and every company has a web app. Currently it's more difficult for AI to pentest a web application, if that's worth anything. I'd start with web apps and the portswigger academy",
          "score": 3,
          "created_utc": "2026-02-26 07:48:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hhx4d",
          "author": "Unres0lved404",
          "text": "Start with web app, any low to mid level pentester will usually start out on web app anyway. Once you learn methodologies procedures tools etc, move into internal.",
          "score": 1,
          "created_utc": "2026-02-26 09:12:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ja7at",
          "author": "ps-aux",
          "text": "always networking first... you won't encounter many web apps for contracts unless that's all your job can land... most folk are after internal testing and pivoting etc...",
          "score": 1,
          "created_utc": "2026-02-26 16:09:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rhggkq",
      "title": "Student here was wondering where to find up to date tools for kali linux",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rhggkq/student_here_was_wondering_where_to_find_up_to/",
      "author": "Current-Age330",
      "created_utc": "2026-02-28 22:47:46",
      "score": 4,
      "num_comments": 15,
      "upvote_ratio": 0.7,
      "text": "Im interested on red team ethical hacking and pen testing but don’t know to much about it textbooks lack a lot of the new tools and don’t even know what zero click attack is or things like pegasus. Any help is appreciated ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rhggkq/student_here_was_wondering_where_to_find_up_to/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o7yk9pa",
          "author": "Loptical",
          "text": "It sounds like you've installed Kali without understanding the foundations. Sign up for something g like TryHackMe and learn the foundations before thinking you can be an ethical hacker. Tools are OS agnostic, so just learn tools.",
          "score": 12,
          "created_utc": "2026-02-28 23:02:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yiyh1",
          "author": "I_am_beast55",
          "text": "Updated tools for what exactly. Theres a million and 1 tools out there.",
          "score": 7,
          "created_utc": "2026-02-28 22:54:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7yjodi",
              "author": "Current-Age330",
              "text": "Yea have seen a lot these past days and i know there are so much more i have to see. Honestly dont know for what exactly just want to see newer tech than the ones we have in books like wireshark and nmap",
              "score": -2,
              "created_utc": "2026-02-28 22:58:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7yk7h1",
                  "author": "I_am_beast55",
                  "text": "Hard to help without specifics. You can tools on any number of websites/repos",
                  "score": 3,
                  "created_utc": "2026-02-28 23:01:41",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7ynriw",
                  "author": "cant_pass_CAPTCHA",
                  "text": "What's wrong with nmap? What, you gonna use naabu or amass? Maybe the common tools are commonly recommended because they work well and have lots of other tools integrate with them. Lots of tools can parse and ingest nmap.xml files.",
                  "score": 2,
                  "created_utc": "2026-02-28 23:22:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7yiy65",
          "author": "xeroxgru",
          "text": "Go to tryhackme, hackthebox. Watch some videos and read documentations of said tools you wanna learn how they work, why and when you wanna use them. Plenty of sources out there.",
          "score": 3,
          "created_utc": "2026-02-28 22:54:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ykihd",
              "author": "I_can_pun_anything",
              "text": "That and de_ice vulnerable vm as well",
              "score": 2,
              "created_utc": "2026-02-28 23:03:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7ylcwr",
                  "author": "xeroxgru",
                  "text": "Also DVWA for basic website stuff. ",
                  "score": 2,
                  "created_utc": "2026-02-28 23:08:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7yj9nw",
              "author": "Current-Age330",
              "text": "Thank you i have a hack the box acc but do you think it is worth to buy the premium version ?",
              "score": 0,
              "created_utc": "2026-02-28 22:56:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ykx71",
                  "author": "xeroxgru",
                  "text": "No, most of the basic stuff that you will need to learn you can learn them for free. But just knowing how to use tools isnt much. Again \"Ethical Hacking\" is a very broad umbrella. First you need to learn the basics. Networking, Scripting, Hardware knowledge, OSINT, Social Engineering, Writing reports etc. But you NEED to learn the basics. Using a tool without properly understanding why you're using them wont be much of a help. And there's like over a hundred tools that are readily available out there.",
                  "score": 2,
                  "created_utc": "2026-02-28 23:05:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7yu8w8",
          "author": "AlfredoVignale",
          "text": "Skip Kali. Download Debian. Install the Project Discovery toolset. Also install SQLmap, WPscan, Zap, and Metasploit.",
          "score": 1,
          "created_utc": "2026-03-01 00:00:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd9a2n",
      "title": "Trouble Capturing Packets using a tp link adapter",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rd9a2n/trouble_capturing_packets_using_a_tp_link_adapter/",
      "author": "ConferenceLeather590",
      "created_utc": "2026-02-24 06:58:00",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 0.75,
      "text": "So,I bought a Tp link adapter off of amazon and it claimed to have monitor mode and packet injection.Now when I plugged it in and used turned Monitor mode on,it worked but for some reason,it won’t work in wireshark neither does it capture any packets.I have been stuck with it for a while now.The model of the adapter is TL-WN722N.I even tried Installing third party drivers but nothing seems to work.Can anyone help me?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rd9a2n/trouble_capturing_packets_using_a_tp_link_adapter/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o7bzfue",
          "author": "Humbleham1",
          "text": "Well, that adapter is over 14 years old and only supports 2.4 GHz. WiFi 6 is going to cause you some trouble. Still, Atheros chipsets should work great in Kali if that's what you're using, so more info is needed. Did you use airmon-ng to set monitor mode? Wireshark doesn't control channels, so you need to do that manually. The adapter could be listening on a channel with nothing transmitting (if that's possible).",
          "score": 1,
          "created_utc": "2026-02-25 14:38:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7daeoc",
              "author": "ConferenceLeather590",
              "text": "I used Airmon ng to enable monitor mode but when I tried to use wireshark using Wlan0 interface,I could not view any other traffic except my own",
              "score": 1,
              "created_utc": "2026-02-25 18:16:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7de4as",
                  "author": "ps-aux",
                  "text": "why aren't you providing logs? lol... that's the first thing any tech would be looking into and sharing amongst other techs for a solution...",
                  "score": 1,
                  "created_utc": "2026-02-25 18:33:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1ri7kpp",
      "title": "lazHow to unlock a blocked Google Form on a school Chromebook + Lazarus blocking systemarus",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1ri7kpp/lazhow_to_unlock_a_blocked_google_form_on_a/",
      "author": "Doxxz_",
      "created_utc": "2026-03-01 20:08:32",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.67,
      "text": "I think they've also blocked all the virtual computer websites; when you log out, you can only use your school email and it doesn't allow you to connect to external Wi-Fi networks.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1ri7kpp/lazhow_to_unlock_a_blocked_google_form_on_a/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o83ze6k",
          "author": "Doxxz_",
          "text": "Sorry I typed the title kinda weird.",
          "score": 2,
          "created_utc": "2026-03-01 20:09:28",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcwo9u",
      "title": "Is there a way to find my raw gps data?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rcwo9u/is_there_a_way_to_find_my_raw_gps_data/",
      "author": "Fwhite77",
      "created_utc": "2026-02-23 22:48:26",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 0.8,
      "text": "I need to retrace my route from a week or so ago, is there a way to extract my gps data to see where I was at a specific date and time? I have a Google pixel 7a",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rcwo9u/is_there_a_way_to_find_my_raw_gps_data/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o71gzux",
          "author": "slippingaway83",
          "text": "Do you use Google Maps? They have a timeline feature that lets you look at location history, but you have to turn that feature on, it's not automatic. Any other location tracking apps like Life360? Unless you have an app that records your location data, you won't be able to get it. The gps chip in your phone doesn't store history, it just outputs the current location and it's up to the software to do something with that info.",
          "score": 3,
          "created_utc": "2026-02-23 23:16:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71ihvc",
          "author": "Fwhite77",
          "text": "Yes, Strava, timeline and 360 but none were enabled at the time. I was hoping there was a way. Thanks",
          "score": 1,
          "created_utc": "2026-02-23 23:24:36",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgv70m",
      "title": "Curious question",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rgv70m/curious_question/",
      "author": "PositionSad8780",
      "created_utc": "2026-02-28 06:22:23",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "How do you find out someone at your school is hacking. Let’s say ur not class to this guy but you are sus of him.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rgv70m/curious_question/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o7u7exg",
          "author": "Utopicdreaming",
          "text": "What does hacking look like to you?\n\nSometimes hacking isnt hacking its just kids being silly with their private info which is also dangerous for many reasons.\n\nOpportunist are funny at a young age.",
          "score": 2,
          "created_utc": "2026-02-28 06:27:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7u9ry8",
          "author": "TygerTung",
          "text": "Sometimes hacking is soldering jumper wires to musical keyboards to get more sounds. Sometimes it is taking a piece of wood and hacking it into something else.\n\nAlmost anything can be hacked and often it is quite innocent.",
          "score": 2,
          "created_utc": "2026-02-28 06:48:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ucmfw",
          "author": "xeroxgru",
          "text": "Someone can ask you about your date of birth, favourite colour and pets name. Most times its just out of curiousity, or could also be a social engineering way to gain information out from you. There are many forms of hacking and some doesn't involved using a device. :P",
          "score": 1,
          "created_utc": "2026-02-28 07:13:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7udpnk",
          "author": "Loptical",
          "text": "Why do you care?",
          "score": 1,
          "created_utc": "2026-02-28 07:23:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}