{
  "metadata": {
    "last_updated": "2026-02-11 03:30:00",
    "time_filter": "week",
    "subreddit": "HowToHack",
    "total_items": 5,
    "total_comments": 27,
    "file_size_bytes": 28192
  },
  "items": [
    {
      "id": "1r05s01",
      "title": "Why it is believed that hackers(top-tier) must be very smart ,even genius? Practising and reading sounds enough to me.",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1r05s01/why_it_is_believed_that_hackerstoptier_must_be/",
      "author": "Consistent-Foot-2452",
      "created_utc": "2026-02-09 14:34:30",
      "score": 23,
      "num_comments": 24,
      "upvote_ratio": 0.67,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1r05s01/why_it_is_believed_that_hackerstoptier_must_be/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o4fuq4j",
          "author": "ML1948",
          "text": "The best hackers are very smart. Especially the ones innovating. Even good ones who study up and use tools and techniques developed by others need to apply what they learn and pivot cleverly as they work to be effective. Public perception is based on the media so many think all hackers are geniuses while most low tier ones are less clever than an average skilled burglar. But saying the people developing tools and selling kits that are causing mass financial suffering aren't at least pretty intelligent sounds crazy to me.",
          "score": 38,
          "created_utc": "2026-02-09 14:47:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kn8tr",
              "author": "JamesNowBetter",
              "text": "No stuff like pysilon is actually criminally stupid. None of the groups outside of the nation sponsored ones want to try anything cool anymore",
              "score": 1,
              "created_utc": "2026-02-10 06:32:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4g8k6t",
          "author": "Humbleham1",
          "text": "Not just any coder can find a vulnerability in closed-source software. It took years and years for something like EternalBlue to be publicly exposed. Using an exploit by no means makes anyone a top-tier hacker.",
          "score": 20,
          "created_utc": "2026-02-09 15:56:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4haz4g",
          "author": "BroaxXx",
          "text": "That's just Dunning-Krugger talking.\n\nYou can read all the books and practice all you want. You still need to establish connections with that vast pool of information you gathered in your brain. \n\nThat's what being \"smart\" is all about.\n\nIt doesn't matter if it's infosec or any other field. Being smart is about establishing valid connections with the things you observe and the things you know.\n\nI know a lot of people that hold degrees but are dumb as a bell.",
          "score": 16,
          "created_utc": "2026-02-09 18:58:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4jo5m0",
              "author": "ADunningKrugerEffect",
              "text": "I had nothing to do with this post.",
              "score": 9,
              "created_utc": "2026-02-10 02:28:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4fvtwf",
          "author": "sa_sagan",
          "text": "Practicing and reading, and top-tier \"hacking\" is like the difference between a cook and a chef. A cook follows pre-defined recipes and practices them until they can do it. A chef creates from nothing. It requires intricate knowledge of the tools and resources and techniques available. Creating their own methods and techniques, and discovering new ways to do things.\n\nSimilar as a \"script kiddie\" and a \"hacker\" (e.g. security researchers, exploit developers etc...).\n\nOne uses pre-defined tools and methods, the other creates them.\n\nYou can't study what doesn't yet exist. Top-tier hackers are looking for 0-days. Bugs/exploits that don't yet exist. You can't read a book thet tells you how to find them. It requires deep knowledge and understanding of multiple layers of code, frameworks and technologies. Often down to a machine-level for those more serious about it. You're mentally processing memory dumps, assembly, and forming a complex model of the environment in your head. It often requires very deep analytics occuring up in the grey matter. A top-tier hacker is up against potentially hundreds of very intelligent software and security engineers designing ways to stop them.",
          "score": 17,
          "created_utc": "2026-02-09 14:53:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fzofn",
              "author": "elliwigy1",
              "text": "One could argue a \"security researcher\" or \"exploit developer\" is at times the same thing as someone searching for 0-days or bugs/exploits that don't exist yet. I have been \"retired\" but spent years and years finding exploits for US Samsung devices (root exploits and bootloader exploits) that didn't exist yet. Had to constantly stay up on Android/Samsung security, had to know the ins and outs of pretty much everything involved from hardware, software, processors, kernels, bootloaders etc. etc. I retired myself when it wasn't fun anymore lol.. Was nice though getting paid for bug bounties. I would report the major exploits to Samsung. Root exploits I would release publicly because that was the whole reason I got into it in the first place, because Samsung and the US carriers lock the bootloaders on US devices. I was surprised at how horrible the security was back then. Like having the bootloader root the device on startup simply by changing prop setting 😅. It was ranked critical and I got like 5k for that one lol.",
              "score": 15,
              "created_utc": "2026-02-09 15:13:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4gnh3e",
                  "author": "RolledUhhp",
                  "text": "I tried to unlock the bootloader on an old fore tablet this week. I came into this thread thinking about the absolute mad men that figured out so many seemingly unconnected steps, the patience to keep getting it wrong, etc..\n\n\nAnyway, im stuck in a pre-boot loop and had to take a break for my sanity. All that to say, you boggle my mind.",
                  "score": 5,
                  "created_utc": "2026-02-09 17:07:36",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4g0yy9",
                  "author": "sa_sagan",
                  "text": "Oh, absolutely. I can agree that they are the same. But just threw a couple of examples out there.\n\nAlways fun to hear the stories from industry veterans. It's still funny to look back on how security was implemented back then (sometimes even today). So much of it being purely obscurity or \"surely no one would try this out\".",
                  "score": 3,
                  "created_utc": "2026-02-09 15:19:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4m0771",
          "author": "Snowboard76",
          "text": "It's surprising how many people think hacking is just about reading and practicing; true toptier hackers understand the underlying systems deeply enough to innovate, much like how a composer creates a symphony rather than just reading music.",
          "score": 2,
          "created_utc": "2026-02-10 13:27:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hyn13",
          "author": "Pharisaeus",
          "text": "Like with everything in life, it's both. Anyone can train some sports and they can get good at it, but without certain predispositions they're not going to win the Olympics. Most people are smart enough to go to university and get a PhD, but most of them won't get a Nobel Prize.\n\nTo be top-tier in something you need both: hard work + talent. With just hard work, you can be good, but at some point you're going to reach the limit you can't break.",
          "score": 3,
          "created_utc": "2026-02-09 20:54:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ky68g",
              "author": "AWS_0",
              "text": "I fully agree. People don’t like to hear this, but being the best of the best requires more than just hardwork.",
              "score": 1,
              "created_utc": "2026-02-10 08:12:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hd20z",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 0,
          "created_utc": "2026-02-09 19:08:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hfqwf",
              "author": "ps-aux",
              "text": "this is how to hack, not how to hire lol...",
              "score": 1,
              "created_utc": "2026-02-09 19:21:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4hkd3o",
                  "author": "[deleted]",
                  "text": "[removed]",
                  "score": 0,
                  "created_utc": "2026-02-09 19:43:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4hri85",
          "author": "wolfie-thompson",
          "text": "Anyone can read a 'howto' and apply it. Understanding it is another matter.\n\nWhat did you think hackers did pre-internet before 'hacker warez' were a thing? Or no access to a search engine?\n\n Trust me, it was never really about reading and practicing.  It was about curiosity and exploration, reading actual documentation and studying systems. These days 'hackers' ( script kiddies ) fail at installing Kali and think they're MrRobot with next to zero clue even about basic networking..",
          "score": 1,
          "created_utc": "2026-02-09 20:19:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jj0yl",
          "author": "JustRuss79",
          "text": "Writing your own software to take advantage of a bug or flaw in a system, possibly discovering the flaws yourself and reverse engineering your way into exploiting it.   Takes a lot of intelligence, you can't learn how to reason your way into this stuff...  not efficiently.\n\nHackers make the tools that script kiddies use to call themselves \"hackers\".",
          "score": 1,
          "created_utc": "2026-02-10 01:59:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jv2f9",
          "author": "nimbusfool",
          "text": "Just look at something like Denuvo. No matter how long or hard I study, I ain't cracking it.",
          "score": 1,
          "created_utc": "2026-02-10 03:10:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4j67ok",
          "author": "CoffeeTable105",
          "text": "Just like doctors.. because they were able to memorize some information. 😂😂😂",
          "score": 0,
          "created_utc": "2026-02-10 00:44:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzxcq4",
      "title": ".exe file Password recovery",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1qzxcq4/exe_file_password_recovery/",
      "author": "Melhoi_lml",
      "created_utc": "2026-02-09 06:56:11",
      "score": 15,
      "num_comments": 11,
      "upvote_ratio": 0.86,
      "text": "I have created this file back in the early 2000, it have some of my high-school memories and pictures of my late Granny.\n\nIs there anyone who can help me to break the password protected self-extracting archive. \n\nI am open to suggestions. I am okay if there is any freelancers out there who can do it for price too. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1qzxcq4/exe_file_password_recovery/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o4ea54e",
          "author": "External_Cut_6946",
          "text": "Send me the file. I'll try to reverse engineer and check if the encryption mechanism used is possibly weak and bruteforceable",
          "score": 11,
          "created_utc": "2026-02-09 07:15:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4eh7bb",
          "author": "Substantial-Walk-554",
          "text": "I can help look into it no promises. If succeed I'll let you decide what to pay.",
          "score": 5,
          "created_utc": "2026-02-09 08:22:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ep0x6",
              "author": "Time_Pattern_9659",
              "text": "Quiero empezar a hackear, para hacer cosas banas como acceder a redes sociales (mi jodida vida está en una situación donde el hacerlo podría significar mantener una familia o dejar las cosas al carajo) en ningún lado leo algo donde te den aunque sea un comienzo hacia donde ir todo son tecnicismos y egos informáticos",
              "score": -1,
              "created_utc": "2026-02-09 09:41:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4gc8xt",
                  "author": "ps-aux",
                  "text": "the starting point is probably further back for you until you can understand the jargon lol...",
                  "score": 5,
                  "created_utc": "2026-02-09 16:14:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ezdtk",
          "author": "DutchOfBurdock",
          "text": "Crucial time period, that. If was made using legacy zip 2.0, then you have high hopes of retrieval. This used a weak sauce 40 bit key that a mobile phone could crack.\n\nThat said, it was around 2000 when AES started to get used, too. Which, would make it a little bit more of a challenge",
          "score": 4,
          "created_utc": "2026-02-09 11:19:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f9nc6",
          "author": "Medium-Potential-348",
          "text": "Send me the file I’ll give it a go too.",
          "score": 3,
          "created_utc": "2026-02-09 12:40:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hqx5s",
          "author": "Broenofficial",
          "text": "Send it on over",
          "score": 2,
          "created_utc": "2026-02-09 20:17:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nchzr",
          "author": "the_packets",
          "text": "If you want to send me the file as well, I can decompile it and give you more info, and see if I can reverse it. If not you'll at least know why.",
          "score": 1,
          "created_utc": "2026-02-10 17:26:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzo4rg",
      "title": "Slow Internet Issue on Kali Linux Live USB",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1qzo4rg/slow_internet_issue_on_kali_linux_live_usb/",
      "author": "Winter_Reception_924",
      "created_utc": "2026-02-08 23:19:27",
      "score": 7,
      "num_comments": 7,
      "upvote_ratio": 0.78,
      "text": "Recently, I met a cybersecurity professional who suggested that I use a Kali Linux live USB. I thought it was a great idea because running Kali directly from a live pendrive allows the system to use my hardware resources (especially RAM) more efficiently.\n\nSo, I switched to a live-booted pendrive. However, after doing this, I started facing an issue: when I use Kali Linux from the live USB, my internet speed becomes extremely slow—it feels like it’s running at a turtle’s pace. But when I run Kali Linux inside VirtualBox on Windows, the internet works perfectly fine and is very fast.\n\nI’m confused about why this is happening and how to fix the slow internet issue on live-booted Kali. Can you please help me resolve this?",
      "is_original_content": false,
      "link_flair_text": "hacking",
      "permalink": "https://reddit.com/r/HowToHack/comments/1qzo4rg/slow_internet_issue_on_kali_linux_live_usb/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o4c8srd",
          "author": "suka-blyat",
          "text": "Pretty sure it's because of the USB drive. Is you flash drive usb 3.0+ and plugged into USB 3.0+ port?",
          "score": 1,
          "created_utc": "2026-02-08 23:32:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ds18o",
              "author": "Winter_Reception_924",
              "text": "i havent tried on different port ",
              "score": 1,
              "created_utc": "2026-02-09 04:48:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4clyfm",
          "author": "1kn0wn0thing",
          "text": "Had the same problem. It’s the USB drive.\nI’ve since installed it on an NVMe SSD in an external case with a Thunderbolt 4 connection and I get the same performance as internal NVMe drive.",
          "score": 1,
          "created_utc": "2026-02-09 00:47:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ds45g",
              "author": "Winter_Reception_924",
              "text": "ohh   \nis ther any solution???",
              "score": -1,
              "created_utc": "2026-02-09 04:48:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e9mjw",
          "author": "TygerTung",
          "text": "I've installed kali on a USB 2.0 flash drive before, so not a live session, but using the flash drive as a HDD. Install took a very long time, but it ran OK after that. It took a little while to boot, and programmes took a wee while to launch, but the internet speeds were normal.",
          "score": 1,
          "created_utc": "2026-02-09 07:10:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lk4ak",
          "author": "DutchOfBurdock",
          "text": "So the USB drive could be one cause, the other could be limited support for your network hardware (WiFi or ethernet). VirtualBox uses virtio for networking (commonly) which is well supported in guests.",
          "score": 1,
          "created_utc": "2026-02-10 11:38:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4o6ih5",
          "author": "RelevantScience4271",
          "text": "Maybe its the USB itself",
          "score": 1,
          "created_utc": "2026-02-10 19:44:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyvjnm",
      "title": "Which WiFi adapter is best for WiFi pentesting and auditing?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1qyvjnm/which_wifi_adapter_is_best_for_wifi_pentesting/",
      "author": "Even-Tiger6766",
      "created_utc": "2026-02-08 01:27:30",
      "score": 6,
      "num_comments": 15,
      "upvote_ratio": 0.8,
      "text": "Hello, I am fairly new to the world of cybersecurity and pentesting. I have an ALFA NETWORK wifi adapter with the AWUSO36ACS chip, it works well for penetration testing, supports monitor mode, packet injection, etc.\n\nBut as you already know, for Evil Twin with deauthentication, two Wi-Fi adapters are needed or the adapter has two physical radios.\n\nI thought about buying the same wifi adapter again but I want a more powerful option so to speak and also one that has good controllers, stability and range.I've been searching and I think I found three good options on Amazon\n\n1. ALFA AC1900 WiFi Adapter – 1900Mbps 802.11ac Long Range USB 3.0 Wi-Fi Network Adapter with 4 External 5dBi Dual Band Antennas, TAA Compliant\n2. Alfa AWUS036ACHM 802.11ac WiFi Range Boost Adaptador USB\n3. 【New version type C USB WiFi】 ALFA AWUS036ACH Long-range AC1200 dual-band wireless Wi-Fi adapter with 2 external 5dBi antennas - 2.4GHz 300Mbps/5GHz 867Mbps - 802.11ac and A, B, G,\n\nAll three have almost the same style, the main visual difference is the antennas\n\nmy questions are:\n\n* Which of the 3 should be or is better for pentesting, injection, stability, etc?\n* Do the extra antennas of each model (1) (2) (4) have any advantages?\n* Are there WiFi adapters that have 2 or more PHYSICAL radios?\n* Are there better WiFi adapters on the market for more or less the same price?\n* Some of these adapters have a version that integrates 6ghz Wi-Fi. It is useful or it is advisable to have 3 bands for pentesting and/or security testing of Wi-Fi networks.?\n\nhank you, I look forward to your responses and contributions.",
      "is_original_content": false,
      "link_flair_text": "pentesting",
      "permalink": "https://reddit.com/r/HowToHack/comments/1qyvjnm/which_wifi_adapter_is_best_for_wifi_pentesting/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o478r98",
          "author": "cracc_babyy",
          "text": "I like RT5370 for packet injection and openWRT.. or RT5572 for dual band (2.4 & 5 ghz)\n\nBoth will work with pineAP etc. but you won’t find them on Amazon. Check eBay or aliexpress instead\n\nActually now that I’m thinking about it.. I did find a RT5572 chipset adapter from Amazon, it has 2 antennas, and it works great, but I had to 3D print a case bc it came with a naked pcb",
          "score": 4,
          "created_utc": "2026-02-08 04:31:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4a9vbj",
              "author": "Even-Tiger6766",
              "text": "2 antenas? te refieress a 2 radios fisicas?",
              "score": 1,
              "created_utc": "2026-02-08 17:36:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4fjh4l",
                  "author": "cracc_babyy",
                  "text": "my device has 1 rt5370 interface and 1 rt5572. the rt5572 has 2 antennas. the rt5370 is just one antenna",
                  "score": 1,
                  "created_utc": "2026-02-09 13:43:31",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4flfpm",
                  "author": "cracc_babyy",
                  "text": "[https://www.amazon.com/Jingelmall-Wireless-Adapter-Antenna-Raspberry/dp/B0FLJVP8SG?dib=eyJ2IjoiMSJ9.-Ai0D6NSnTA0EDb0jXNkImszTA\\_Bbu0UlacbzfEq3aVl643VM6UHGuI0H72-KfWlZX8zXzeJK9wtn6U8YIfEtBQRYcHOJ5\\_GgtZfVpXmdLsBDOFyQbAMeVYP65O7YQ89GisylP5dmGhyEBLbZlb1kmq17VYJgi5NF8cpQiJmxkpKsF7Ty\\_hNwZBj48JeNnp-T9Sfw3XHw2wKuinPFfM8w2u8domXh\\_PT2cK7NLv52jE.6lbYhQzsirLi\\_wwxdzOsvVEwjDO9ywzWs2R1npD37ts&dib\\_tag=se&keywords=rt5572&qid=1770645267&sr=8-1](https://www.amazon.com/Jingelmall-Wireless-Adapter-Antenna-Raspberry/dp/B0FLJVP8SG?dib=eyJ2IjoiMSJ9.-Ai0D6NSnTA0EDb0jXNkImszTA_Bbu0UlacbzfEq3aVl643VM6UHGuI0H72-KfWlZX8zXzeJK9wtn6U8YIfEtBQRYcHOJ5_GgtZfVpXmdLsBDOFyQbAMeVYP65O7YQ89GisylP5dmGhyEBLbZlb1kmq17VYJgi5NF8cpQiJmxkpKsF7Ty_hNwZBj48JeNnp-T9Sfw3XHw2wKuinPFfM8w2u8domXh_PT2cK7NLv52jE.6lbYhQzsirLi_wwxdzOsvVEwjDO9ywzWs2R1npD37ts&dib_tag=se&keywords=rt5572&qid=1770645267&sr=8-1)\n\n",
                  "score": 1,
                  "created_utc": "2026-02-09 13:54:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o47y0zx",
          "author": "Federal-Guava-5119",
          "text": "I really like my Alfa awus036ach",
          "score": 2,
          "created_utc": "2026-02-08 08:06:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4a9ims",
              "author": "Even-Tiger6766",
              "text": "tiene buena estabilidad?",
              "score": 1,
              "created_utc": "2026-02-08 17:34:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4aa683",
                  "author": "Federal-Guava-5119",
                  "text": "yes, once you have the drivers needed for it installed. only works with linux though but i guess you will be using linux\n\n",
                  "score": 2,
                  "created_utc": "2026-02-08 17:37:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r1bxz2",
      "title": "Anyone still have the original you are an idiot html?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1r1bxz2/anyone_still_have_the_original_you_are_an_idiot/",
      "author": "Federal-Guava-5119",
      "created_utc": "2026-02-10 20:20:36",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I was wondering if anyone still has it or knows where  to find it since I’m looking into how it works. Thanks in advance",
      "is_original_content": false,
      "link_flair_text": "software",
      "permalink": "https://reddit.com/r/HowToHack/comments/1r1bxz2/anyone_still_have_the_original_you_are_an_idiot/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o4og4kn",
          "author": "DutchOfBurdock",
          "text": "Dunno about that one, but one of the best HTML fubar was [UpsideDownternet](https://wiki.archlinux.org/title/Upside_Down_Ternet)\n\nBack in the day before HTTPS was enforced, this would be hilarious to do transparently proxying HTTP requests.",
          "score": 1,
          "created_utc": "2026-02-10 20:29:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4oqbxn",
          "author": "Electrical_Horror776",
          "text": "The original won't work on today's systems. There are web emulators that will emulate it but it won't lock up your system. I think I do have the original tucked away with memz Trojan and a couple of others too but those older viruses just don't run anymore as the tools they utilize are long lost in modern systems",
          "score": 1,
          "created_utc": "2026-02-10 21:16:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pq7wi",
          "author": "blacksheepghost",
          "text": "The source is archived on GitHub. A quick Google search should find it.",
          "score": 1,
          "created_utc": "2026-02-11 00:22:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}