{
  "metadata": {
    "last_updated": "2026-01-02 04:45:58",
    "time_filter": "week",
    "subreddit": "HowToHack",
    "total_items": 12,
    "total_comments": 73,
    "file_size_bytes": 94847
  },
  "items": [
    {
      "id": "1puaddz",
      "title": "How to detect Jammers",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1puaddz/how_to_detect_jammers/",
      "author": "Forward-Pay-1792",
      "created_utc": "2025-12-24 01:01:39",
      "score": 24,
      "num_comments": 34,
      "upvote_ratio": 0.82,
      "text": "Looking to buy smt to help detect a local jammer. Someone at a local business my friend owns is jamming our wifi and cells. We're looking to find out if we could by something to detect where it may be coming from so we can proceed with reporting it. Any advice? Or tips on what to buy? Or is there a way we can stop it?",
      "is_original_content": false,
      "link_flair_text": "hacking",
      "permalink": "https://reddit.com/r/HowToHack/comments/1puaddz/how_to_detect_jammers/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nvnbfd6",
          "author": "cybernekonetics",
          "text": "Jamming modern phone signals is actually pretty difficult and requires some heavy-duty equipment. Are you sure you don't just have bad reception?",
          "score": 41,
          "created_utc": "2025-12-24 01:50:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvzqpsw",
              "author": "sidusnare",
              "text": "They sell book sized all-in-one jammers on Alibaba etc, totally illegal, but not difficult or bulky.",
              "score": 3,
              "created_utc": "2025-12-26 07:38:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvn61kx",
          "author": "LongRangeSavage",
          "text": "Look up “radio fox hunt.” If you can find the location, report to the FCC or your country’s equivalent, especially if it’s affecting a business. Jamming signals to will be a gigantic fine.",
          "score": 30,
          "created_utc": "2025-12-24 01:16:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpoywh",
              "author": "Budget_Putt8393",
              "text": "Disrupting cell is a huge deal in the USA. The FCC takes that very serious.",
              "score": 11,
              "created_utc": "2025-12-24 13:22:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvxrpr8",
                  "author": "ArkansasGamerSpaz",
                  "text": "Yeah, only the government gets to jam signals without a trial, charge, or warrant.\n\nThe government hates competition.",
                  "score": 7,
                  "created_utc": "2025-12-25 22:56:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvobnxh",
          "author": "smorin13",
          "text": "A cell booster with the transmission antenna aimed in the wrong direction is a pretty effective jammer.  Ask me how I know.",
          "score": 16,
          "created_utc": "2025-12-24 05:57:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvzcty0",
              "author": "Dramatic_Teaching129",
              "text": "How do you know, and can we be friends?",
              "score": 1,
              "created_utc": "2025-12-26 05:31:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw8kay0",
                  "author": "smorin13",
                  "text": "I have a 30 foot plus tower.  The height helps with range, but makes all the equipment on the tower susceptible to high winds.  We had a nasty storm last spring and I didn't notice that the cell booster antenna had been turned more than 90 degrees away from the closest cell tower.  The antenna was basically pointing into a black hole if coverage.  If we were in the part of the house with the best coverage from the booster, calls would constantly drop or the call quality would be so bad you couldn't understand each other.  The indoor boost antenna is directional as well.  If we walked to a part of the house behind the indoor antenna the calls would clear up. The cause didn't register with me until I was doing some electrical work in the house and accidentally left the booster unplugged. Once I knew the source of the issue, I messes with the setup to find the best orientation. In the process I found that you could effectively disrupt calls by blocking the signal of the external antenna.",
                  "score": 1,
                  "created_utc": "2025-12-27 19:18:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nvx4e6x",
              "author": "TygerTung",
              "text": "How do you know?",
              "score": 1,
              "created_utc": "2025-12-25 20:31:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw11o0a",
                  "author": "ps-aux",
                  "text": "noise vs signal... wonderful things to understand lol...",
                  "score": 2,
                  "created_utc": "2025-12-26 14:36:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvnuw4h",
          "author": "CRIMSEN15",
          "text": "Equipment to locate a jammer is fairly expensive but just to see a jammer is active you just need a sdr with whatever cell or wifi bands you would like to check and then just look for alot of noise on a waterfall display. Pretty simple but most likely bad reception, too many on network, bad roaming agreements or weird case only cause one was found in NY a cell farm.",
          "score": 11,
          "created_utc": "2025-12-24 03:53:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvt7x96",
              "author": "WalksWithWs",
              "text": "Wouldn’t it just take 3 and some trianglulation code",
              "score": 3,
              "created_utc": "2025-12-25 02:11:54",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvvc1g7",
              "author": "New_Fuel7753",
              "text": "Surely you could just make a directional antenna (like a diy measuring tape yagi or similar) to locate a transmission by connecting it to the software defined radio?",
              "score": 2,
              "created_utc": "2025-12-25 13:55:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvvkaht",
                  "author": "CRIMSEN15",
                  "text": "Yeah you could do something like that, gosh out of practice think the military calls it loa, idk but either way idk if you know much about ellipses but even a directional antenna still creates one, so you still have a left and right error that gets larger the farther you walk towards your target in a way. And not saying the software isn't out there but definitely would need to possibly code your own. Not sure how many civ our out there df ing signals.",
                  "score": 1,
                  "created_utc": "2025-12-25 14:54:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvne9ha",
          "author": "jerwong",
          "text": "For cell it's a little difficult. For wifi, it's easier since most prosumer-grade wireless APs can act as a spectrum analyzer and you can look for strong signals coming in on the 2 ghz and 5 ghz range. If you're sure of it, you can reach out to the FCC and report it and they will come out to check. \n\nYou may also want to check your carbon monoxide detectors.",
          "score": 10,
          "created_utc": "2025-12-24 02:07:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvzd55a",
              "author": "Dramatic_Teaching129",
              "text": "Carbon monoxide detectors? Could you elaborate please",
              "score": 1,
              "created_utc": "2025-12-26 05:34:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw11z0h",
                  "author": "ps-aux",
                  "text": "you have enough information at hand to research this answer yourself.",
                  "score": 1,
                  "created_utc": "2025-12-26 14:38:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvpii3m",
          "author": "Select_Bat_5535",
          "text": "No one’s jamming your cell signal. For WiFi, it’s a possibility but even then WiFi isn’t as easy to jam such as something like GPS. Your easiest way to find it is build an SDR and antenna with a spectrum analyzer and RSSI then direction finding it from there.\n\nElectronic Warfare vet here.",
          "score": 9,
          "created_utc": "2025-12-24 12:36:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpxp0n",
              "author": "wornoutseed",
              "text": "What would you recommend for building something to track consumer drones?",
              "score": 3,
              "created_utc": "2025-12-24 14:17:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvq8mke",
                  "author": "NationalBug55",
                  "text": "Use a WiFi dongle that does both bands and is capable of monitor mode. Use kismet to monitor/control/ organize",
                  "score": 6,
                  "created_utc": "2025-12-24 15:20:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvndbl5",
          "author": "cant_pass_CAPTCHA",
          "text": "Are you sure it's jamming in the literal sense that it's sending out a lot of signal to make it unusable? Is just one wifi network affected or is all wifi unusable?",
          "score": 6,
          "created_utc": "2025-12-24 02:02:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvo1vrf",
              "author": "Forward-Pay-1792",
              "text": "Mainly cell, all cell phones and radios at the business where off for 40min straight, nothing we could do",
              "score": 6,
              "created_utc": "2025-12-24 04:42:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvp1rcb",
                  "author": "O-o--O---o----O",
                  "text": "And you a certain this is a jammer why exactly? Is this all the time, most of the time, occassionally or rarely? Could be an outtage, could be crappy reception influenced by weather.\n\nYou say \"wifi and cells\". These are usually on quite different frequencies. Whwt kind of wifi do you use? 2.5 or 5 or 6GHz?\n\nDid you try and see how far the \"jamming\" extends? At what distance and direction away from your workplace do you start getting better reception? \n\nAre all cellphones on the same provider/plan? Anecdote: in my country different providers have slightly different frequency bands and some of them were better or less suited for different purposes and one provider had a frequency assigned for usage that got more dampened/blocked by the way steel-reinforcement is used in skyscrapers, so you would get worse reception with them in a skyscraper with than another provider.\n\nFor wifi, it could be a deauther sending packets that tell the wifi to drop all connections constantly. \n\nOr it could be in a radar zone and disable certain bands so not to disturb the radar. And if it's a crappy access point/router it might not fall back to a free frequency band quick enough.\n\nOr someone could be using a cheap powerlan adapter that jams wifi as a side-effect. Or a ton of other things.\n\nEither way, if you say it's BOTH wifi AND cell, why not just call your mobile provider and your ISP and tell both that stuff isn't working and to send a technician?",
                  "score": 6,
                  "created_utc": "2025-12-24 10:03:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvoeipr",
          "author": "svprvlln",
          "text": "For a jammer to be effective, you must be able to overpower the signal between the source and endpoint devices. For cellular devices, this means a lot of noise; and this can be fairly easy to do using OTC radio equipment and powered antennas, or even by flooding the area with a combination of WiFi and BTLE devices. Having bluetooth enabled when you are not using it can be problematic for WiFi, especially if you are in close proximity to other devices that have BTLE enabled.  \n  \nIt is more difficult to jam a WiFi signal when certain settings are enabled on the AP that is serving the SSID. You want to find the setting in the router called \"Protected Management Frames\" and make sure that is enabled. Next, you want to ensure that your router is using a modern protocol like AC or AX with WPA2 minimum, or WPA3 preferred, and do your best to use the 5ghz spectrum if you can.\n\nIn the event that you are surrounded by interference, the 5ghz spectrum may be unavailable, and you will \"hop\" to the 2.4ghz spectrum of an AC or AX access point, and without PMF turned on, you are susceptible to deauthentication attacks that keep you offline. These kind of attacks do not affect cellular modems.\n\nAs per detection: you need a way to look at the logs. Deauthentication attacks look something like this:\n\nhttps://preview.redd.it/0ecdj9ibh39g1.png?width=1676&format=png&auto=webp&s=0cbd0452b873e0f4c2bb7373ecbd4a959884b92e",
          "score": 3,
          "created_utc": "2025-12-24 06:21:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvpohpk",
          "author": "eightbic",
          "text": "Phish tshirts usually give it away. ",
          "score": 2,
          "created_utc": "2025-12-24 13:19:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvqeqxg",
          "author": "Less-Mirror7273",
          "text": "Just notify local authorities about this situation. They have the tools and the legal stick.",
          "score": 1,
          "created_utc": "2025-12-24 15:53:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvst6ya",
          "author": "stefan-weiss01",
          "text": " Look for unusual noise patterns in the frequency bands you're monitoring.",
          "score": 1,
          "created_utc": "2025-12-25 00:22:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvegh2",
          "author": "New_Fuel7753",
          "text": "You might have success in contacting relevant [communications] authorities initially to see whether they are willing to investigate for you. Keep in mind however that it is more than likely that you are merely suffering from QRN (Man made interference) or just a poorly positioned antenna. \n\nMobile signal requires line of sight to communicate, there are only so many walls that signal can penetrate before it drops out completely. Since WiFi and Mobile spectrum are heavily limited on the amount of power used this is a very likely possibility.\n\n\nA badly placed antenna could be;\n\nNext to large amounts of electronics likely to generate RF noise\n\nNear or touching conductive materials/objects\nSurrounded by thick walls\n\nOr just a very non resonant antenna badly matched for the frequencies in use.\n\n\nNext steps I recommend;\n\nMake sure that you are not just having issues with thick walls. (Go just outside the door and see if there is any change in dB (download a app for this like \"signal detector\")) \n\nMove the position of your routers antenna so there is a clear line of sight\n\nBuy a better antenna built for the frequencies needed. (External,away from the router)\n\nGo crazy with ferrite cores.\n\n\nWhy should you listen to me? \n\nI am a licensed user of the RF spectrum and have to deal with issues like these on a regular basis. Hope this helps",
          "score": 1,
          "created_utc": "2025-12-25 14:13:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvyjvk3",
          "author": "AFarenci",
          "text": "Call the feds. FBI and/or FCC. Try to determine the boundaries of the affected area. The bigger the area you tell the feds about, the quicker they'll show up. Also the jammer should be in the middle more or less.",
          "score": 1,
          "created_utc": "2025-12-26 02:00:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw49vjm",
          "author": "LessCarry266",
          "text": "Could be a sim farm in a nearby unit",
          "score": 1,
          "created_utc": "2025-12-27 01:23:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwawkyw",
          "author": "ComfortableTune5639",
          "text": "I’m no hacker but perhaps what I do when I lose my phone will work. Just find out the limits of the range of the jamming in each direction, and then you can calculate the source perhaps? I do that using my earbuds, just find the range of how far you can go in each direction before it gets staticky and then arrange it on a mental graph.",
          "score": 1,
          "created_utc": "2025-12-28 03:11:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxerwr",
      "title": "Hardware I should look out for?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1pxerwr/hardware_i_should_look_out_for/",
      "author": "Famous-Tangelo1324",
      "created_utc": "2025-12-28 01:43:39",
      "score": 16,
      "num_comments": 15,
      "upvote_ratio": 0.85,
      "text": "New to pen testing here! Got a bunch of Christmas money and I need a new laptop. \n\nAny tips for specific specs or hardware to look out for that would make my journey easier? My price limit is around $400. Looking for something with base windows OS and I’ll boot up my live USB with Kali.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1pxerwr/hardware_i_should_look_out_for/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nwal4yg",
          "author": "BrokenWhimsy3",
          "text": "I would get a used Lenovo laptop off FB marketplace. You can get a lot of i5 laptops with 8 or 16 GB RAM quite easily for around 150 - 200. Most, if not all, will have an SSD and the RAM can easily be upgraded to 16 GB.\n\nLenovo has good Linux support, so you can run a number of distributions and try them out (including Kali).\n\nI would look for one with windows 11 as the base, if that’s the route you want to go.",
          "score": 8,
          "created_utc": "2025-12-28 02:03:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwamdcx",
              "author": "Famous-Tangelo1324",
              "text": "FB marketplace is a good idea. Thanks!",
              "score": 0,
              "created_utc": "2025-12-28 02:10:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwbke3b",
                  "author": "l3nzzo",
                  "text": "look into thinkpad t480. most parts are very customizable and although its not the most recent thing out there it still holds its weight just fine as a daily driver. i currently run a arch/windows dual boot on there via two separate internal drives",
                  "score": 1,
                  "created_utc": "2025-12-28 05:53:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwarb9g",
          "author": "DonkeyTron42",
          "text": "You're best bet is metasploit.  Learn to walk before you run.",
          "score": 3,
          "created_utc": "2025-12-28 02:40:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwaimqe",
          "author": "TallBlueberry5523",
          "text": "get a raspberry pi. run kali",
          "score": 2,
          "created_utc": "2025-12-28 01:48:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwam4d0",
              "author": "Famous-Tangelo1324",
              "text": "I will eventually, but i need the laptop for school and work too. I’ll eventually have a dedicated setup for pen testing, but I’m still new and just wanna learn",
              "score": 2,
              "created_utc": "2025-12-28 02:09:17",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nwc8ij8",
              "author": "AppropriateTwo2657",
              "text": "Or just raspbian lite on a zero2wh an hotspot +ssh",
              "score": 1,
              "created_utc": "2025-12-28 09:36:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwc8nnj",
                  "author": "AppropriateTwo2657",
                  "text": "Plus power bank , like 20gbp total maybe 25. You can learn a lot about Linux with this setup",
                  "score": 1,
                  "created_utc": "2025-12-28 09:37:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwam0ou",
          "author": "DeathBeforeDishonor7",
          "text": "Just search around for the best deal for what you need. If you are gonna be running labs at home just look for something with plenty of space do so. For me I found a Dell laptop with 32GB RAM and 1TB SSD and i7 cpu for $400 during a cyberweek deal.",
          "score": 2,
          "created_utc": "2025-12-28 02:08:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjedtv",
          "author": "Boring_Astronaut8509",
          "text": "Hey, welcome to the world of pentesting!   \n  \nSo $400 is totally doable, you just gotta be smart about where you spend it.\n\nHonestly? Skip the new laptops at that price point.   \nYou'll get way more bang for your buck with a refurbished ThinkPad – like a T440, T450, or T460. Those things are basically tanks and they run Kali like a dream.   \nLook on eBay or Facebook Marketplace for deals. Shoot for 8GB RAM minimum (16GB would be sweet but might stretch your budget), an i5 processor, and definitely an SSD if you can swing it. The SSD makes a huge difference even if it's only 256GB.\n\nNow here's the thing literally nobody told me when I started – your laptop's WiFi card is gonna be useless for anything wireless-related.   \nLike, Kali will see it, but you won't be able to do monitor mode or packet injection, which are kinda essential if you're getting into WiFi security stuff. You'll need to grab an external USB WiFi adapter with a compatible chipset. Budget around $30-40 for something like the Alfa AWUS036NHA or a TP-Link with the Atheros chipset. Trust me, finding this out after you've already bought your laptop is annoying.\n\nSo realistically you're looking at maybe $350 for a solid used ThinkPad and $30-40 for the WiFi adapter. The ThinkPad keyboard alone is worth it – you'll be typing a lot and those things are genuinely nice to use.",
          "score": 2,
          "created_utc": "2025-12-29 13:03:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1ktww",
          "author": "-Lost-Map-",
          "text": "Don't jump into the flipperzero phase. Learn to use esp32s and flash your own software like Bruce, esp32s Marauder etc...  u can add components fairly easily and very cheaply as opposed to higher costs from the flipperzero",
          "score": 2,
          "created_utc": "2026-01-01 06:25:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwaltkh",
          "author": "Whatdafuqisgoingon",
          "text": "eBay has HP Elitebook laptops for less than 400 and you can get i5 or i7 and 16-32 gigs of ram and decent storage. Not sure about windows tho",
          "score": 1,
          "created_utc": "2025-12-28 02:07:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwascno",
          "author": "Veloxxx_",
          "text": "I don't know THAT much about hardware but Thinkpads are amazing for quite cheap",
          "score": 1,
          "created_utc": "2025-12-28 02:46:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwaukjf",
              "author": "Famous-Tangelo1324",
              "text": "The thought of thinkpads gives me flashbacks to middle school computer carts, but I’ll check it out!",
              "score": 2,
              "created_utc": "2025-12-28 02:59:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwb0per",
                  "author": "ps-aux",
                  "text": "they are the best bang for the buck, cheap i7s on ebay and you are better of running linux as primary os while virtualizing a windows instead... less hassle... be better off just doing docker + kasm imo since nothing on windows is worth having that you can't emulate on docker+kasm",
                  "score": 1,
                  "created_utc": "2025-12-28 03:36:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pzvdww",
      "title": "Virtual numbers",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1pzvdww/virtual_numbers/",
      "author": "gostodecats",
      "created_utc": "2025-12-30 22:12:35",
      "score": 14,
      "num_comments": 2,
      "upvote_ratio": 0.89,
      "text": "I didn't quite know in which community to post this, but since people here know how to hack, maybe they might use these kind of services too, which are renting virtual numbers to receive SMS for account activations. For this I used to use Sms-activate, but today shockingly I discovered that it has been shut down. I had been using it for years and it liked it because it was a reliable app. I am looking for similar apps with the same purposes, that are reliable and work well. Any recommendations?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1pzvdww/virtual_numbers/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nwufbb4",
          "author": "Small-Selection-3538",
          "text": "you can use the app called vNu which is on Play Store. for a PC app i don't know but for a mobile app i used vNu before and it was really good, hopefully it'll be reliable for now because i used it a long ago (2021 to be exact)\n\n  \ntest it out yourself and if you have already then there can be more apps better than that",
          "score": 3,
          "created_utc": "2025-12-31 02:21:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwzrvyf",
          "author": "Disastrous_Sun2118",
          "text": "VoIP?  SIP?  Vanity 800 №?",
          "score": 2,
          "created_utc": "2025-12-31 22:57:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxbbo6",
      "title": "How do you research and try to hack something?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1pxbbo6/how_do_you_research_and_try_to_hack_something/",
      "author": "TzarZara",
      "created_utc": "2025-12-27 23:05:14",
      "score": 7,
      "num_comments": 24,
      "upvote_ratio": 0.67,
      "text": "For context/example - the electronic pricing tags used in supermarkets - I can't stop thinking about how they might work and how hypothetically one could hack something like that. Which has led my curiosity to well how would you learn about a new system/product etc. and how you would go about trying to test and hack it? Can't imagine \"googling\" would get one very far lol.\n\n(I'm super new to cyber and hacking etc. so apologies for my naivety and thank you in advance)\n\nTldr; how do you research a new product you want to try and hack? ",
      "is_original_content": false,
      "link_flair_text": "hacking",
      "permalink": "https://reddit.com/r/HowToHack/comments/1pxbbo6/how_do_you_research_and_try_to_hack_something/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nw9s3xh",
          "author": "Zazucki",
          "text": "Learn everything you would need to know as if you were going to own/operate them, then learn about the protocols they use for data. That would be a good place to start.",
          "score": 10,
          "created_utc": "2025-12-27 23:16:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwro0vh",
              "author": "Disastrous_Sun2118",
              "text": "Cyber Security wise, definitely reach and ask them.  There likely looking for someone to harden their systems against hacks.  And they're old school, and they only use specific graded systems.  But I'm sure they may interested in a better online system.  But they might not.  \n\nIf we really wanted this hack.  We would have to tell them about why it's a good thing.  Imagine in terms of the Super Shoppers that gather and use coupons, and end up with a years worth of groceries, and $10,000 cash given back to the shopper.  Picture it being them membership card, and it has a debit card connected to it.  And instead of hacking the prices, we could build it so,, with enough points, or credits, you could change the prices on specific items for yourself.",
              "score": 1,
              "created_utc": "2025-12-30 17:57:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nw9v1og",
          "author": "jddddddddddd",
          "text": "Regarding e-paper price tags, there’s a good writeup about them ( https://www.furrtek.org/index.php?a=esl ) which also links to a GitHub repo for some working code for hacking one specific model of price tags.\n\nAs for how this kind of thing is done in general, it will probably be a mixture of reading whatever datasheets are available for the product, examining source code if it’s open source (or disassembling the code if it’s not), or examining the hardware etc. if a device communicates over a network then try and see what data you can sniff with Wireshark, if it transmits over radio then try and decode the traffic with an SDR, if it communicates over USB then sniff with Cynithion, etc.",
          "score": 7,
          "created_utc": "2025-12-27 23:32:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwa52q1",
          "author": "Redgohst92",
          "text": "Research is the most important part of hacking something. Knowing everything about how it is supposed to work under normal circumstances is the only way to learn how to alter those circumstances. And knowing how to do that research without being caught (if it’s illegal). In this case it’s probably an rf frequency I’d start there.",
          "score": 6,
          "created_utc": "2025-12-28 00:29:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw9t8qi",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 2,
          "created_utc": "2025-12-27 23:22:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwlqysi",
              "author": "signtopper",
              "text": "When you say sandbox, i assume you mean creating a virtual machine testing the version that is publicly available through source code. Ie .. ios v18. If the OP doesnt know how to \"test security flaws\" by finding out what database the pricing tag uses wouldn't he need to first research what certificates it uses and then find the source code from that company. Because \"finding security flaws\" isnt the same verbage as \"hacking\" but im assuming that is what your saying",
              "score": 1,
              "created_utc": "2025-12-29 20:07:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwa2n7z",
          "author": "Distdistdist",
          "text": "Thinks picking locks. People who design them try to make it as difficult as possible to do so. People who pick them - deep learn about how locks work and, sometimes, discover flaws that let them pick that lock. Same applies here.",
          "score": 2,
          "created_utc": "2025-12-28 00:15:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwaqrqg",
          "author": "takeyouraxeandhack",
          "text": "For those e-ink price tags is pretty simple: Google the model, download the datasheet, done: you have the protocol to communicate with them.  \n\nThey probably have some authentication system, but getting around that is not legal, so it's up to you if you want to commit a crime, we can't help with that.",
          "score": 2,
          "created_utc": "2025-12-28 02:36:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwdapcw",
          "author": "Delicious-Ad2528",
          "text": "In the context of supermarket tracking systems in general: You could probably find a cheap Zebra MC40 and or TC70 from EBay or Facebook marketplace. \n\nFor the electronic pricing tags specifically, I believe that’s set by a base station or something, not the Zebra handhelds. \n\nWithout knowing much about the electronic price tags themselves, I’d research the protocols and technology used to see if it’s anything a flipper zero can tackle \n\nAs a new person researching it, try to figure it out on your own whether the flipper zero would be able to hack this. Don’t just ask chatGPT yes or no.\n\n> Can’t imagine “googling” would get one very far lol. \n\nNah try some reconnaissance, you’d be surprised. Whoever makes these could have full sets of public documentation. Could be as simple as dorking pdf in your search",
          "score": 2,
          "created_utc": "2025-12-28 14:42:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwltnyj",
          "author": "signtopper",
          "text": "Look man researching new products to hack makes no sense. You need to research how  amazon.com does this and research the certificates that allow them to collect the pricing information. This is easy because amazon has ssl certificates that are valid amongst many different OS..windows...mac.. if you wanted to \"hack\" a products price margin over several different online markets. You need to look into researching Amazon...it you wanna \"hack\" Amazon...which is a supermarket. There is a server you can find that amazon ssl certificates connect to...for example google dns server is 8.8.8.8 which is what your using to connect to a search engine. If you can find what port amazon uses then you will be \"hacking\" if you wanna hack reddit mods will delete that shit so quick",
          "score": 2,
          "created_utc": "2025-12-29 20:21:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwlue90",
              "author": "TzarZara",
              "text": "I was on about the little electronic price tags used in physical supermarkets/stores that the companies use to fluctuate prices based on demand and stock. The tags that replaced a little print out of the price tag. So I wouldn't be hacking Amazon or Reddit. Unless I have misunderstood your response?",
              "score": 1,
              "created_utc": "2025-12-29 20:24:49",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nwrhi54",
              "author": "castleinthesky86",
              "text": "What in the word salad are you the fuck on about? 😂",
              "score": 1,
              "created_utc": "2025-12-30 17:27:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwahax4",
          "author": "SubjectShock6003",
          "text": "Ask deepweb AI \nJk DON'T do that",
          "score": 2,
          "created_utc": "2025-12-28 01:40:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwan50f",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 0,
          "created_utc": "2025-12-28 02:15:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwb0sp3",
              "author": "ps-aux",
              "text": "this is unrelated to the original post.",
              "score": 2,
              "created_utc": "2025-12-28 03:37:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwb65gu",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-28 04:10:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwb65ix",
              "author": "AutoModerator",
              "text": "This link has not been approved, please read the descriptions for Rule 1 and 5 before trying again. Please wait for a moderator to review and approve this post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HowToHack) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2025-12-28 04:10:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwvcbgi",
          "author": "vrgpy",
          "text": "Most of the times tou dont need to know very much to guess how somethings works or.comunicates with other parts of the system.\nIn electronics many times the designer reuse protocols and building blocks. And security features are something not too many people put as fundamental function of systems. Usually security features are added as an improvement of an already working product. And sometime the added cost doesn't help selling the product.\nMaybe I could say that security is difficult.to sell.\n\nSo, the probability of you finding a vulnerability in some new product or technology is not low.especially if it doesn't need to pass external scrutiny.\n\nAlso, some tools like an oscilloscope, protocol analyzers, logic probes, etc.  can help you find details that most product manager think are.hidden enough to not care.",
          "score": 1,
          "created_utc": "2025-12-31 05:55:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nww5n7d",
          "author": "Boring_Astronaut8509",
          "text": "Great question - and you're right that Googling alone won't get you far, but it's actually where you'd *start*.\n\nThe methodology most hardware security researchers use follows a pretty clear path:\n\n**OSINT (Open Source Intelligence) Phase**   \nBefore you even touch the device, you hunt for publicly available info. For something sold in the US, look up the FCC ID (required for anything transmitting RF) on [fccid.io](http://fccid.io) \\- this often gives you internal photos, user manuals, and circuit board layouts that manufacturers have to submit. Check GitHub for existing research, look for vendor documentation, search security conference presentations (like DEF CON or Black Hat), and browse forums where people discuss the tech.\n\n**Physical Analysis**   \nGet the actual device and tear it down. Document the chips and components - every IC (integrated circuit) has markings. Look those up to find datasheets that explain what each component does. Identify potential debug interfaces like UART, JTAG, or SWD ports. Measure voltages with a multimeter.\n\n**Protocol Analysis**   \nFigure out how it communicates. If it's wireless, tools like HackRF or RTL-SDR can capture and analyze the radio signals. For the ESL example you mentioned - there's actually been real research on this. A security researcher named Steffen Robertz reverse engineered SUNY brand ESL tags and found they used an unencrypted 433 MHz protocol, meaning anyone with the right radio equipment could update any tag within range.\n\n**Firmware/Software Analysis**   \nIf you can dump the firmware (from flash memory chips or find it online), you can reverse engineer it to understand how the device works internally.\n\nThe wild part?   \n  \nA lot of this is legal research as long as you own the device and aren't breaking into systems you don't have permission to access.   \n  \nThe sites like Hackaday have tons of teardowns and research to learn from.",
          "score": 1,
          "created_utc": "2025-12-31 10:21:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwacpc4",
          "author": "ps-aux",
          "text": "get a job working in shipping/receiving at that store and you'll get to play with the tags and software that controls it... ;)",
          "score": 1,
          "created_utc": "2025-12-28 01:13:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwax2ej",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 0,
              "created_utc": "2025-12-28 03:14:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwb0wbk",
                  "author": "ps-aux",
                  "text": "no I can not help, because this is unrelated to the thread you are talking on...",
                  "score": 1,
                  "created_utc": "2025-12-28 03:38:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1q19jvg",
      "title": "Trying to stay ahead of runtime attacks once things are live",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1q19jvg/trying_to_stay_ahead_of_runtime_attacks_once/",
      "author": "therowreality",
      "created_utc": "2026-01-01 17:26:04",
      "score": 7,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "It is honestly so stressful how runtime threats can just stay hidden until some serious damage actually happens. By the time you get a loud alarm the situation is usually already a total mess. I have realized that early detection really comes down to understanding how your system actually behaves day to day rather than just looking at a configuration file. If you are only looking at the setup you are missing the whole story of what is happening once the code is live. I am trying to figure out how to actually stay ahead of this before it turns into a disaster. App layer attacks and identity misuse are just so subtle and blend in way too easily. How do you guys manage to keep an eye on things without it becoming a full time job for your entire team.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1q19jvg/trying_to_stay_ahead_of_runtime_attacks_once/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nx4aj43",
          "author": "therowreality",
          "text": "Identity misuse blends in easily.",
          "score": 1,
          "created_utc": "2026-01-01 18:40:52",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxog8k",
      "title": "what are the networking concepts that essential for ethical hacking/cybersecurity?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1pxog8k/what_are_the_networking_concepts_that_essential/",
      "author": "evadranuvvu",
      "created_utc": "2025-12-28 10:41:57",
      "score": 6,
      "num_comments": 12,
      "upvote_ratio": 0.67,
      "text": "pretty much the title",
      "is_original_content": false,
      "link_flair_text": "hacking",
      "permalink": "https://reddit.com/r/HowToHack/comments/1pxog8k/what_are_the_networking_concepts_that_essential/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nwcn0op",
          "author": "BeasleyMusic",
          "text": "You should have a firm understanding of all layers of the OSI model starting from the bottom.\n\nI cannot stress enough how important it is to understand these concepts. You WILL not be able to succeed if you don’t understand how to build a network, how to operate a firewall, how to read a route table, how to navigate a switch, and so much more.\n\nYou should look at getting a Network+ if youre really serious, it’s a great entry level network cert that will equip you with the basics.\n\nGrab a used Cisco switch off eBay too and maybe a firewall and build your own network at home. Don’t just read a book and say you know it, get hands on and build something",
          "score": 10,
          "created_utc": "2025-12-28 11:53:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwd6crw",
              "author": "imprimis2",
              "text": "Is packet tracer a good substitute for buying the physical hardware off eBay?",
              "score": 4,
              "created_utc": "2025-12-28 14:15:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwd6pz9",
                  "author": "BeasleyMusic",
                  "text": "Not a bad start, I’m not super familiar with it but I know people build labs with it.\n\nAnother fun project would be to create a virtualized network by virtualizing PFSense and some VMs on a virtual network that use PFSense as the router using something like virtual box on your local machine.",
                  "score": 2,
                  "created_utc": "2025-12-28 14:18:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwfcs25",
          "author": "datOEsigmagrindlife",
          "text": "Not network specific.  \n  \nBeing able to search google effectively for basic information and understanding how to use Google Syntaxes/Dorks to query specific sites.\n\nFor example, instead of posting this thread you could have just searched \"site:reddit.com what are the networking concepts that essential for ethical hacking\" and it will give you the information you are asking.\n\nIf you can't do basic research on your own, you're doomed to fail.",
          "score": 5,
          "created_utc": "2025-12-28 20:49:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwetkhi",
          "author": "cant_pass_CAPTCHA",
          "text": "To be a bit contrarian, the OSI model is just a dumb interview thing. I'm not saying don't learn it all, just that there is nothing very useful about reviewing PDNTSPA. \n\nYou should focus on concepts like how switches and vlans and segment networks, Active Directory (tickets, authentication, etc.), pivoting/lateral movement, getting a sense of which open ports relate to which technology and how to attack those.",
          "score": 4,
          "created_utc": "2025-12-28 19:16:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwcw3vs",
          "author": "EverythingIsFnTaken",
          "text": "[OSI Reference Model - Best Explanation](https://www.youtube.com/watch?v=eKHCH6rw0As)  \n[https://www.youtube.com/playlist?list=PLBf0hzazHTGPYo1Bc7v34Haistd\\_qQRmJ](https://www.youtube.com/playlist?list=PLBf0hzazHTGPYo1Bc7v34Haistd_qQRmJ)  \n[https://www.youtube.com/playlist?list=PLBf0hzazHTGM8V\\_3OEKhvCM9Xah3qDdIx](https://www.youtube.com/playlist?list=PLBf0hzazHTGM8V_3OEKhvCM9Xah3qDdIx)",
          "score": 1,
          "created_utc": "2025-12-28 13:07:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmcrkb",
          "author": "__aeon_enlightened__",
          "text": "Probably the most powerful and useful is to really learn the Network stack on Linux. \n\nHonestly if you are not doing this already, get a cheap computer, install arch (or heck even Gentoo), turn off Network Manager, plug into your main computer and just try to get the internet working on your cheap computer. See if you can mess around forwarding a few ports. Try to setup a NAT then maybe a bridge. Then see if you can setup a reverse gateway with another laptop far away out of town and try dialing home. \n\nA super satisfying thing is to buy a cheap ThinkPad and be able to remote into your beefcakes computer at home but in a way that's like 100% manual. Just homelab like crazy.\n\nLearn by doing not just by following lessons.",
          "score": 1,
          "created_utc": "2025-12-29 21:54:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwu62oz",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 0,
          "created_utc": "2025-12-31 01:27:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwu62r6",
              "author": "AutoModerator",
              "text": "This link has not been approved, please read the descriptions for Rule 1 and 5 before trying again. Please wait for a moderator to review and approve this post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HowToHack) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2025-12-31 01:27:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwvg8t0",
          "author": "TerrificVixen5693",
          "text": "All.",
          "score": 1,
          "created_utc": "2025-12-31 06:27:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx2wp5n",
          "author": "1prime3579",
          "text": "subnets, acl and  firewalling, 802.1x, 802.1q, 802.3, 802.11 wpa wep, dynamic routing especially bgp, aaa, proxies and reverse proxies. these are in my opinion the basic concepts an ethical hacker would need the most.\n\nAlso understanding the osi stack and how the low level protocol operate dhcp, arp, stp .... . Go into detail on how tcp, udp and icmp works and their different use cases.\n\nFinally, maybe go into the application protocols like http, https, sftp, smtp, ldaps, ...",
          "score": 1,
          "created_utc": "2026-01-01 14:06:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzcmzi",
      "title": "Mother's accounts got hacked, how? I want to learn more.",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1pzcmzi/mothers_accounts_got_hacked_how_i_want_to_learn/",
      "author": "RedstoneRiderYT",
      "created_utc": "2025-12-30 08:17:58",
      "score": 6,
      "num_comments": 25,
      "upvote_ratio": 0.69,
      "text": "Two days ago, my mother discovered two new emails in her inbox. One, her Facebook account was locked due to suspicious activity, and two, and alert of a suspicious sign-in into that same email account (Microsoft). Of course I immediately helped her change her passwords. I thought that was it, but the next day we discover that someone has posted something strange on her Instagram story, so we change that password too. Then today, same with her LinkedIn! Someone signed her up for premium and started sending dozens of recruitment messages to random people. Changed that password too.\n\nI'm going to help her enable two-factor authentication today. But I'd like to know how they got in. She knows about phishing and to not click weird links, I've taught her a decent amount about internet safety as far as I was aware. She says she did not go onto any strange sites, and she regularly scans her computer with malwarebytes.\n\nWas there a Microsoft data breach? Her passwords were all decently secure so I don't know if they were brute forced or gathered from some sort of data breach. She does travel a lot, but her last time in an airport was November, so I don't know if the attack could have been through public wifi, if it took this long for them to do anything? Unless it was through a vulnerable public wifi in a shopping centre? She didn't go shopping on the day that the attack happened though.\n\nI'd be happy to answer any questions to help get to the bottom of this. I want to be able to understand this better and help prevent it in the future. I genuinely thought I understood hacking better than this, but I am clearly a bit of a noob.",
      "is_original_content": false,
      "link_flair_text": "hacking",
      "permalink": "https://reddit.com/r/HowToHack/comments/1pzcmzi/mothers_accounts_got_hacked_how_i_want_to_learn/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nwp5yn3",
          "author": "FrainBreez_Tv",
          "text": "Probably a phishing link or something she used that seems legit. \n\nMake sure 2fa is enabled as well as different passwords for each account.\n\nFor data breaches, check haveibeenpwnd dot com and enter her email.\n\nIf she recycles passwords change them all and check her pc for anything she might have installed including browser extension.\n\nGood luck",
          "score": 15,
          "created_utc": "2025-12-30 08:23:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwp6j99",
              "author": "RedstoneRiderYT",
              "text": "I asked her about whether she clicked any links where she had to enter her sign-in details at all, and she said no.\n\nI'm enabling 2fa today, and we made sure all her passwords are different.\n\nI'll try that site, thanks!\n\nI'll check for browser extensions, that's a good idea, thanks!",
              "score": 3,
              "created_utc": "2025-12-30 08:29:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwpc7vh",
                  "author": "DrLitte",
                  "text": "I mean, idk you mother but, you know, they are all the same. She have probably clicked, we are talking about Meta, it's not a small indie company, they probably know their stuff",
                  "score": 6,
                  "created_utc": "2025-12-30 09:22:18",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwqjvhl",
                  "author": "uncomfortable_idiot",
                  "text": "2fa doen't always protect if they can steal a session token",
                  "score": 1,
                  "created_utc": "2025-12-30 14:45:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwp8rmf",
          "author": "Double-Familiar",
          "text": "The method used was probably password spraying.\n\nThreat actors procure lists of username/password from compromised that had been hacked, threat actors know that people reuse the same passwords over and over.",
          "score": 5,
          "created_utc": "2025-12-30 08:50:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwtgz82",
              "author": "RedstoneRiderYT",
              "text": "She didn't repeat any passwords as far as I'm aware, and they were all pretty secure, immune to dictionary attacks and the likes",
              "score": 1,
              "created_utc": "2025-12-30 23:08:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwvtpxt",
                  "author": "vvokhom",
                  "text": "Are you sure sure she didnt have, like, passwords .txt somewhere? ",
                  "score": 1,
                  "created_utc": "2025-12-31 08:27:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwp5nq9",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-30 08:20:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwp5nsz",
              "author": "AutoModerator",
              "text": "This link has not been approved, please read the descriptions for Rule 1 and 5 before trying again. Please wait for a moderator to review and approve this post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HowToHack) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2025-12-30 08:20:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwrgavg",
                  "author": "uncomfortable_idiot",
                  "text": "if this was me, it was an accidental comment supposed to be a reply",
                  "score": 1,
                  "created_utc": "2025-12-30 17:21:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwq29fc",
          "author": "Admirable-Oil-7682",
          "text": "It would be speculation for anybody to provide anything conclusive without being able to have direct access to the computer and piece together an assessment.\n\nIt could be an infostealer. What you mentioned is very common with infostealers.  \nThe malware targets valuable data on the computer and then sends it back to the criminals.  \nYour mothers accounts don't need to be hacked because the malware steals the browser data that allows access to the accounts from the browser.   \nWhen you login to a website you save data on your browser that is provided to the site when you visit it again. This is usually in the form of cookies. A cookie is a small amount of information that can be accessed by the website that set the cookie. Websites often use cookies for authentication (logging on and confirming the user successfully did this so they don't have to do it again). Nothing can access the cookie except the site that set it. \n\nThat is unless a hacker targets the computer and steals the cookie. If they can do this, they can steal the authentication that was granted to the user who logged into that account. They are basically impersonating the user and stealing their permission to access the site. They don't need to pass 2FA because 2FA comes during the authentication and not afterwards. When you pass 2FA you demonstrate you are allowed to access that account and the cookie is set. Access granted. \n\nMany websites are changing the way they do authentication. As a full stack web developer myself I avoid relying solely on cookie based authentication and use a mix of client-side and server-side authentication. This limits the reliance on client-side methods for confirming the legitimacy of the session and puts more weight on the server to do this although mitigating for session fixation attacks and other things is necessary on the server-side too. A good example is using server-side session state management and from there you can control the session independent of whether the cookie is set or not. You can confirm whether the IP address matches the one that logged in, how much time has elapsed since logging in, how many sessions you want a single user to have (1, 10, 100 etc), you can perform browser fingerprinting and match patterns and see whether over time those patterns align. A good example here is if a hacker uses Google Chrome and you've always used Mozilla Firefox that will flag on the back end and you can take some form of action to protect the account. This is fundamentally a shift in a positive direction because traditional authentication has security flaws. Gone are the days where a simple cookie is enough to confirm you are who you say you are! Ideally, a website should store next to no data on the client-side (browser) to prevent exactly these problems but the changes are slow primarily unfortunately, primarily because changes like this mean the fundamental infrastructure has to change as well. \n\nThere are other possibilities. Browser extensions can be malicious. Because they get access to the activity in the browser (and not just a single tab) they can oversee everything. This is great for functionality and why extensions are so useful but it can also make them backdoors in their own right. Extensions have the ability to connect out to the internet. How do you know what is being sent from your browser? You would need to go into developer mode on your browser and start reading through lines of Javascript in that extension and start looking for fetch/axios/XHR activity. You will be surprised how much data is collected by seemingly benign extensions! If you have 20 extensions in your browser, that's 20 potential backdoors, particularly if you use extensions that are potentially shady (and many are). \n\nAnother possibility. Data breaches. Sites get hacked all the time, including big sites. Do you use the same password over multiple sites? Do you reuse old passwords? That will be surely make for an unhappy day.  \n  \nPublic networks can be an issue too. By default most Windows computers are set to make a lot of noise when they connect to a network. This is both for convenience and compatibility. This noise can be picked up by anyone listening on the wire. You can do a lot to reduce this noise (disable SMB, printer, RDP, netbios, several tweaks to reduce discovery, prevent poisoning attacks, firewall rules to block certain ports etc and ensure firewall is enabled for all zones) but public networks will always be a big risk. You can connect to a seemingly legitimate network (Starbucks) and it is a rogue AP that is performing MITM attacks.",
          "score": 1,
          "created_utc": "2025-12-30 13:01:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwtjvtc",
              "author": "RedstoneRiderYT",
              "text": "Thanks for leaving such a detailed response, it was a very informative read!\n\nFor your suggestion of it being an infostealer: would Malwarebytes not have detected that when we did a deep scan? \n\nWhen you speak of them stealing the authentication cookie, is that the same as a session token or different?\n\nI do think Microsoft used the strategy you mentioned-, the suspicious activity was on Chrome, whilst my mother uses Firefox, and the IP address was naturally also different (somewhere in Northern Ireland).\n\nAnother commenter here mentioned browser extensions, so I checked, and it's still only UBlock Origin, nothing else has been installed.\n\nShe did not repeat any passwords, I taught her not to, and the site for checking if your email has been pwned came back with nothing significant.\n\nI've definitely wondered about the attack coming from a public wifi network, but she didn't connect to one on the day that the attacks started. And she only takes her cellphone out of the house, not her laptop. Would a delay between them gaining the info and actually breaching the accountd be normal or purposeful in this case?\n\nI just find all of this strange; they made no attempt to lock my mother out of her accounts, changing the passwords was simple, she was still logged in and could just go into account settings. They only used her LinkedIn and Instagram like I mentioned in the post. I don't know what their intentions were, but I can't imagine that they are super professional hackers if they made it so easy for us to recover it all.",
              "score": 1,
              "created_utc": "2025-12-30 23:24:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwyroy2",
                  "author": "Admirable-Oil-7682",
                  "text": "The cookie is often the session token.  \nCookies persist between sessions and that's why when you close a typical browser and then re-open it, you are still logged in. It is the cookie that tells the website you have already authenticated. Depending on what they do on the back-end (more lax security or more tight) they will perform a variety (or minimal) actions. More secure sites won't rely solely on the cookie but will do some comparative analysis between previous sessions as well as look at the client connecting etc. Multiple sessions can be a concern especially from different IP addresses simultaneously but even this is hard to implement as a security feature because legitimate use also may involve using different computer, browsers and different IP addresses. Some less secure sites will just accept the cookie and you're logged in.\n\nThere are other methods like JWT which don't rely on cookies and instead creates a token based on a secret key that exists on the server. All tokens are derived from that secret key and prove validity because they can be encrypted/decrypted and match the expected value. More accurately they are not actually encrypted at all but use hashing algorithms but these are pretty strong in most cases, when using an algo that hasn't been cracked and a secret key that is strong enough.\n\nYes, this would be fairly standard fingerprinting checks. A history of browsers that have been used to access the site are recorded and then compared over time. Not just browsers but IP addresses too and any other identifiable information. Over time, you tend to create reliable patterns and when these deviate, it's usually indication of a potential compromise. As for the IP address, it would be hard to determine if this was the true IP address as criminals usually hide their IP address. They can do this by hacking someone's computer and then conducting illegal activity through that, or using a VPN, Tor etc.\n\nThe delay could be meaningful although it's likely just down to order of business on the day. Infostealers can collect A LOT of information. The big ones are MULTI-MILLION dollar enterprises and they are run through sophisticated multi-layered multi-tiered infrastructure. You could get compromised minutes, hours, weeks or months afterwards. It's also worth noting they probably didn't breach the account. They probably stole session data which means they didn't need to breach anything. A breach would imply coercion in some way but with most infostealers they go for the browser data itself which bypasses any need for coercion. They get the keys to the vault without needing to break in. It's one of the oldest and still most effective methods for walking straight into someone's account. All you need to do (literally) is export the browser data from where it is installed to another browser and you impersonate the session that was initially created on the first browser without needing to do anything else. Try it on a website you visit that you have an account for. Copy the cookie data from one browser to the browser on another computer and you should be able to access the account without needing to login!\n\nThe lack of overtly destructive actions is probably damage limitation. The less attention drawn to the criminals the more likely their crimes will slip under the radar and while illegal, they are far more likely to continue by not doing blatantly destructive things and so their actions are often strategic and balanced. Gone are the days where someone hacks a company and spreads a virus that deletes all data because that makes a lot of noise and can cause serious disruption which is far more likely to get the attention of the law than if they discretely (yet illegally) conduct their activities. It's all about plausible deniability and sculpting a timeline of events that minimizes attribution. Most criminals in this area want to be invisible not the other way round. If they hacked social media accounts and began posting recruitment content, they were likely propagating their malicious campaign to as many more victims as possible while using the credibility of a legitimate social media account.\n\nI have personally analyzed malware of similar characteristics and I would agree on your observation about professionalism. A lot of malware many people come into contact with is moderately sophisticated. Intermediate level understanding of Windows internals and a programming language that is fairly low level will gift you the ability to make malware. Some maldevs copy code that others have made, or piggyback on their malware with their own. 6-12 months of solid learning will attain most with the level (assuming you have previous programming experience) to make half-decent half-effective malware. It's also not necessarily the sophistication of the malware but the infrastructure behind it. How much money can they make? How quickly can they recover from a server shutdown? How fast can they move on to the next campaign? The goal isn't necessarily to be an elite level hacker - that's often for APTs/nation state threat actors whose goals align with attacking an entire country's critical infrastructure. Everyday malware, if this term exists, is exactly that - it works for the moment and then the next it doesn't and then it moves on.\n\nThanks for the thought provoking questions!",
                  "score": 0,
                  "created_utc": "2025-12-31 19:37:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwvy5zc",
              "author": "RedstoneRiderYT",
              "text": "I'd also like to ask, for my own internet safety- I use tampermonkey for scripts for a web game I play. Should I be worried about each of the scripts being dangerous?",
              "score": 1,
              "created_utc": "2025-12-31 09:10:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwyy0a8",
                  "author": "Admirable-Oil-7682",
                  "text": "In the browser, the risks go down considerably. This is because Javascript, the language being used in the browser, is isolated to the browser context. Javascript can become problematic when it leaves the browser (or client-side as it technically called) and goes other places, like on the back-end or even on running in desktop apps. \n\nIf the scripts don't run outside of the browser, you should be fine. Stick to vanilla JS and you should have no issues.   \nJavascript doesn't have features that can communicate with the operating system by default. When you start looking at Javascript derived creations beyond the browser defined context, that's when things change. For example, Node.js, Next.js, Electron, JScript etc.",
                  "score": 1,
                  "created_utc": "2025-12-31 20:11:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwz49e5",
          "author": "Silencer-007",
          "text": "I'll be honest without creating new accounts outside the infected network and drive they'll always have access not matter scenraio they'll always have direct login access through remote access of the devices infected. \n\nChanging passwords does nothing here when changing withing the same network. You need to create a new account on separate device outside of the infected network to prevent the attacker getting direct access since he already has remote access by sounds of it",
          "score": 1,
          "created_utc": "2025-12-31 20:45:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx0384t",
          "author": "alterego200",
          "text": "Your mom probably clicked on some phishing emails, or she reuses her passwords, or she has 2FA turned off. \n\nYou should teach her which email links to never click on.  You can hover over a link to find out it's true URL.  Make sure she understands how domain names work and what a fake one looks like. \n\nsupport.microsoft.com << Microsoft\nmicrosoft.scammer.com << Not Microsoft",
          "score": 1,
          "created_utc": "2026-01-01 00:06:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx1pz6a",
              "author": "RedstoneRiderYT",
              "text": "She already knows not to click on weird links in emails, and she always points them out to me when she receives them. She also did not reuse her passwords. She had 2FA off, but I enabled it for her after all this.",
              "score": 2,
              "created_utc": "2026-01-01 07:14:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx1uoy3",
                  "author": "alterego200",
                  "text": "Ok, well she's doing better than most of our parents.  These big companies often hire the cheapest programmers, who created all sorts of security vulnerabilities.",
                  "score": 2,
                  "created_utc": "2026-01-01 08:02:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pvn92a",
      "title": "So not exactly about hacking but I must ask",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1pvn92a/so_not_exactly_about_hacking_but_i_must_ask/",
      "author": "Ok-History9485",
      "created_utc": "2025-12-25 21:25:27",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 0.88,
      "text": "How would someone go about modifying this toy to play different audio files? My brother gave the brilliant idea of changing out the sounds to this fnaf toy, I'll describe it and explain it a bit, but basically it's a toy freddy head that held little blind bags of toys inside I got as a christmas gift, when you press the button on the top of the head on the hat it plays a cycled audio and the eyes blink and glow, I know I've saw people do stuff that let them change out audio files and such to play custom ones with toys similar but I just don't know how to do so or where to start or if I wanted to what to replace! I guess it's more just a silly question to ask but I would love to hear ideas or pointers would be nice, basically my brother suggested I change out the audio for something like the magic conch audio from spongebob so it acts like some sort of ask a question get a answer toy like in the show itself.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1pvn92a/so_not_exactly_about_hacking_but_i_must_ask/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nvxzvya",
          "author": "Conscious_Name9514",
          "text": "I’d replace the stored audio file but that’s me.",
          "score": 3,
          "created_utc": "2025-12-25 23:49:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvyqrw8",
          "author": "cant_pass_CAPTCHA",
          "text": "You'd likely need to flash new software onto the toy's chip. If you open everything up you'll find a computer board with chips on it. You'd need to locate the chip that holds the memory, likely unsoldered it, read the program stored on it, rewrite it but with an updated audio file, then solder it back in place. There might be a way to do it without removing the chip, but anyways it's going to require some hardware.",
          "score": 2,
          "created_utc": "2025-12-26 02:48:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw97yfm",
              "author": "Ok-History9485",
              "text": "Ah dang, I wish I knew how to solder, I suppose this will be a project I put on the shelf for now :D",
              "score": 2,
              "created_utc": "2025-12-27 21:26:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvxg8jq",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-25 21:44:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvxg8n9",
              "author": "AutoModerator",
              "text": "This link has not been approved, please read the descriptions for Rule 1 and 5 before trying again. Please wait for a moderator to review and approve this post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HowToHack) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2025-12-25 21:44:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q02v85",
      "title": "Dvd Archiving",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1q02v85/dvd_archiving/",
      "author": "LongjumpingWriter712",
      "created_utc": "2025-12-31 03:42:45",
      "score": 5,
      "num_comments": 9,
      "upvote_ratio": 0.73,
      "text": "Hello everyone, I'm not sure if it's really hacking, but I'm looking to like doing some archiving on some old or not well distributed DVD. But I have 2 problems. First I never did that, but for this one I can work on it, it doesn't seem really hard. But the second problem seems to be that most DVD have some kind of protection on them. I know it's not legal but it's not to sell or things it's only for my personal use. Thanks in advance ",
      "is_original_content": false,
      "link_flair_text": "hacking",
      "permalink": "https://reddit.com/r/HowToHack/comments/1q02v85/dvd_archiving/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nwutdaz",
          "author": "bitsynthesis",
          "text": "makemkv",
          "score": 5,
          "created_utc": "2025-12-31 03:45:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwuy25b",
              "author": "LongjumpingWriter712",
              "text": "So all I need a dvd reader and MakeMKV downloaded in my computer and I can do the archiving?",
              "score": 1,
              "created_utc": "2025-12-31 04:15:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwvcxpe",
                  "author": "bitsynthesis",
                  "text": "yep",
                  "score": 3,
                  "created_utc": "2025-12-31 06:00:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwvnx9a",
          "author": "Savings-Second3898",
          "text": "Use DVD shrink. It allows for any DVD to be ripped into a disk image ISO. You can then burn them to a DVD+/-R/RW or just keep them on your home server to watch whenever. It's actually perfectly legal to make digital copies of your DVDs.",
          "score": 1,
          "created_utc": "2025-12-31 07:33:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvnyr1",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2025-12-31 07:34:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwvnys7",
                  "author": "AutoModerator",
                  "text": "This link has not been approved, please read the descriptions for Rule 1 and 5 before trying again. Please wait for a moderator to review and approve this post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HowToHack) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2025-12-31 07:34:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwxnult",
          "author": "xander2600",
          "text": "Does Handbrake still get around protection?",
          "score": 1,
          "created_utc": "2025-12-31 16:18:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwyv8hb",
          "author": "Humbleham1",
          "text": "WinX DVD Ripper has a 'giveaway' edition. DVDs don't usually have strong DRM, but you need capable software at least.",
          "score": 1,
          "created_utc": "2025-12-31 19:56:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwy1d5",
      "title": "Can somebody help me",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1pwy1d5/can_somebody_help_me/",
      "author": "Unlikely_Ad2833",
      "created_utc": "2025-12-27 13:38:02",
      "score": 4,
      "num_comments": 12,
      "upvote_ratio": 0.64,
      "text": "Thank you for reading this i want to make an esp 32 c3 supermini  based deauth gadget wich scans all networks it can find and with 1 of 2 button sellects a network and with the second button starts the deauth. Does anybody have any tips or other help because i am new to coding ",
      "is_original_content": false,
      "link_flair_text": "programming",
      "permalink": "https://reddit.com/r/HowToHack/comments/1pwy1d5/can_somebody_help_me/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nwcz95o",
          "author": "Minge_Ninja420",
          "text": "If you give a cool and legal use case you're likely to get great answers. So many script kiddies on here obviously trying to do the wrong thing.",
          "score": 4,
          "created_utc": "2025-12-28 13:29:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw6vpv3",
          "author": "ZombiGrn",
          "text": "As long as you have permission to do so there are plenty of tutorials. Trial and error. And good luck, plenty of firewall will detect your test. Don’t be a goof, test it on your own network",
          "score": 3,
          "created_utc": "2025-12-27 13:58:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwdhqz5",
              "author": "noxiouskarn",
              "text": "Firewalls do not detect deauthorization packets sent to an AP...",
              "score": 3,
              "created_utc": "2025-12-28 15:22:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw6w2op",
              "author": "Unlikely_Ad2833",
              "text": "Yess thank you i set up an extra wifi on my router so the rest of the family doesnt get anoyed by my experiments",
              "score": 1,
              "created_utc": "2025-12-27 14:00:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwcrd4n",
          "author": "Minge_Ninja420",
          "text": "You'd have to be talking about flooding every single channel as most devices will hop channels rapidly. Leaving this comment to follow.",
          "score": 2,
          "created_utc": "2025-12-28 12:31:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwdiccc",
          "author": "noxiouskarn",
          "text": "Use spacehun's code for deauth as a base amd add code that allows you the two button solution you are trying to make.\n\nThat or buy a Wifi Nugget, or a Marauder, or a dstike watch",
          "score": 2,
          "created_utc": "2025-12-28 15:25:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwdwui6",
          "author": "Unlikely_Ad2833",
          "text": "NOTE i am using an old bit of code i wrote a time ago and i just made the menu i am trying to write the code from a open source project and edit it so it fits in my code",
          "score": 1,
          "created_utc": "2025-12-28 16:39:43",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "nw88xgq",
          "author": "keyboard325",
          "text": "You can buy one from eBay, I'll reply to this with the link, 1 sec..it connects to your phone.",
          "score": 0,
          "created_utc": "2025-12-27 18:21:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw896wl",
              "author": "keyboard325",
              "text": "Wifi Deauth Deauther 5GHz/2.4GHz Dual Band Pre-Flashed Custom SSID + OFF Button | eBay https://share.google/YytB5G1MNowKhQgSq",
              "score": 0,
              "created_utc": "2025-12-27 18:22:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw8kkft",
                  "author": "ps-aux",
                  "text": "posts were validated and approved",
                  "score": 2,
                  "created_utc": "2025-12-27 19:20:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw7d71g",
          "author": "nige_12",
          "text": "Can I dm because to give good tip",
          "score": -2,
          "created_utc": "2025-12-27 15:40:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q1e9zr",
      "title": "Where do I l learn web exploitation for CTFs, but also in general?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1q1e9zr/where_do_i_l_learn_web_exploitation_for_ctfs_but/",
      "author": "Norker_g",
      "created_utc": "2026-01-01 20:32:52",
      "score": 4,
      "num_comments": 7,
      "upvote_ratio": 0.83,
      "text": "I want to participate in CTFs. One of the categories is obviously web exploitation and such. I have tried Natas and some CTFs on picoCTF, but understood, that I don't actually have the knowledge to do the tasks there. What are some free resources, where I could learn it?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1q1e9zr/where_do_i_l_learn_web_exploitation_for_ctfs_but/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nx4yfb8",
          "author": "Evendurrr",
          "text": "I think what you’re searching for you’ll find on PortSwigger",
          "score": 2,
          "created_utc": "2026-01-01 20:40:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx4zsu1",
              "author": "Norker_g",
              "text": "But they have only one beginner course. Where do I go from there?",
              "score": -1,
              "created_utc": "2026-01-01 20:48:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx50n40",
                  "author": "Evendurrr",
                  "text": "You can try their labs and research about the topics on the knowledge required sections. There are some learning paths on Tryhackme and on Hack the Box academy, but Port Swigger is your place for web exploitation",
                  "score": 2,
                  "created_utc": "2026-01-01 20:52:40",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nx57dac",
                  "author": "gh0st-Account5858",
                  "text": "I wouldn't describe Portswigger Academy as \"one beginner course\". I'm pretty sure you would benefit greatly from it.",
                  "score": 2,
                  "created_utc": "2026-01-01 21:28:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx4xgub",
          "author": "DrLitte",
          "text": "Idk man, you are in a sub where this is basically the main topic but Idk",
          "score": 2,
          "created_utc": "2026-01-01 20:35:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx4xl1p",
          "author": "FrainBreez_Tv",
          "text": "Maybe give hackthebox a try, they also have nice writeups and so on and a good free model. If you enjoy it, consider the paid one which is insane for it's value if they still have the student deals / Christmas deals",
          "score": 1,
          "created_utc": "2026-01-01 20:36:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1py9pcm",
      "title": "Is it possible to bypass Knox?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1py9pcm/is_it_possible_to_bypass_knox/",
      "author": "aircooler100",
      "created_utc": "2025-12-29 02:13:38",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 0.62,
      "text": "Been trying to bypass a Samsung Galaxy tab A  protected by Knox to see if i can give it a new life, by flashing the firmware i was able to use it as an actual tablet, however USB debugging and Root cannot be turned on. Developer mode cannot be enabled, and i already tried flashing it again with a Rooted AP file, however it didnt work.\nAny ideas?\nAny tips?\nI flashed with Odin.\nEnabled root with Magisk on another Andriod device.\nI know SAMFW TOOL has an option to disable Knox but i need USB debugging for that so i kinda hit a dead end when developer mode was disabled.\n\nThis post was made for educational purposes only.",
      "is_original_content": false,
      "link_flair_text": "software",
      "permalink": "https://reddit.com/r/HowToHack/comments/1py9pcm/is_it_possible_to_bypass_knox/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "nwipne9",
          "author": "TapApprehensive8815",
          "text": "There should be guides on xdaforum for this. Have a look over there.",
          "score": 2,
          "created_utc": "2025-12-29 09:34:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nws2q7e",
              "author": "aircooler100",
              "text": "Ill take a look, thankyou",
              "score": 1,
              "created_utc": "2025-12-30 19:05:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx1v60m",
          "author": "trixime",
          "text": "Have the same tablet, followed a tutorial on YouTube and everything worked",
          "score": 1,
          "created_utc": "2026-01-01 08:07:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx1v934",
              "author": "trixime",
              "text": "do you have any admin apps enabled that could be disabling developer settings?",
              "score": 1,
              "created_utc": "2026-01-01 08:08:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}