{
  "metadata": {
    "last_updated": "2026-02-24 09:09:57",
    "time_filter": "week",
    "subreddit": "HowToHack",
    "total_items": 10,
    "total_comments": 60,
    "file_size_bytes": 62028
  },
  "items": [
    {
      "id": "1r73ahp",
      "title": "How do people hack databases?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1r73ahp/how_do_people_hack_databases/",
      "author": "Acrobatic-Clock-7889",
      "created_utc": "2026-02-17 11:15:05",
      "score": 84,
      "num_comments": 49,
      "upvote_ratio": 0.91,
      "text": "Well I live in Uzbekistan and recently our systems were hacked and personal information of 15.000.000 people got leaked. It was leaked through government website or its database. Moreover, today one of the biggest mobile network operators was hacked too and some information was leaked. Why and how can it even be hacked in the first place?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1r73ahp/how_do_people_hack_databases/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o5ujsex",
          "author": "ArthurLeywinn",
          "text": "You either find a exploid that you can abuse.\n\nOr the way more common and easier option is to social engineer your way into the system.\n\nYou do this until you get high privileges to access all sub systems and done.",
          "score": 57,
          "created_utc": "2026-02-17 11:22:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5um0wc",
              "author": "idkwhatiamdoing21",
              "text": "Find an exploit or come up with one which happens rarely from time to time.",
              "score": 8,
              "created_utc": "2026-02-17 11:40:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5ukgc9",
              "author": "Acrobatic-Clock-7889",
              "text": "Alright, but people who work for the government, they are controlled and carefully checked. Phishing is highly unlikely in this case, or am I mistaking ?",
              "score": -3,
              "created_utc": "2026-02-17 11:27:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ulxdv",
                  "author": "IsDa44",
                  "text": "The human link is the weakest. Just requires a single one to enter his password on a completely identical Phishing page",
                  "score": 42,
                  "created_utc": "2026-02-17 11:40:04",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5unyss",
                  "author": "hkusp45css",
                  "text": "Having done IT work for Federal Law Enforcement for years and years, I assure you that the people staffing the government roles, in the most sensitive positions, will hap-hap-happily click on some Nigerian Prince malware scam email that literally says \"and if you click this link, we'll exploit your network!\"",
                  "score": 27,
                  "created_utc": "2026-02-17 11:56:06",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5ukqn7",
                  "author": "Onlyroad4adrifter",
                  "text": "All humans can be hacked.  We all have weaknesses.  A picture of a cat, a cause something we all care about.  All it takes is someone to pay attention to those details and anyone can be compromised.",
                  "score": 7,
                  "created_utc": "2026-02-17 11:30:14",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5umwwk",
                  "author": "Incid3nt",
                  "text": "Even in highly structured environments, there's likely not enough funding to do it properly.  In addition, you may have an exploit that appears immediately, leading to a need to patch immediately.  How quickly can a company with a huge footprint patch, especially if the system is critical for the organization and partners to function?  In many cases, they needed a few days to properly patch, but the attacker only needed a few hours to get around their defenses.",
                  "score": 8,
                  "created_utc": "2026-02-17 11:48:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6dz67q",
                  "author": "hex-matrix",
                  "text": "Simply clicking on a link, you can infect a PC. Phishing doesn’t matter, if there is a security-permission elevation vulnerability like there was with WannaCry ransomware, that click is the difference between being infected or not.",
                  "score": 1,
                  "created_utc": "2026-02-20 08:08:32",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o72ykhn",
                  "author": "Sanja1871980",
                  "text": "You are mistaking. Phishing clever combined with some phonecalls opens almost any door.",
                  "score": 1,
                  "created_utc": "2026-02-24 04:32:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ujzzf",
          "author": "Classic-Tap-5668",
          "text": "Shit programming from the company's side mainly.",
          "score": 13,
          "created_utc": "2026-02-17 11:24:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uovh9",
          "author": "PsychoMachineElves",
          "text": "SQL injection",
          "score": 10,
          "created_utc": "2026-02-17 12:02:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vf51a",
          "author": "drevmbrevker",
          "text": "I think its more simple for countries with high levels of corruption the attackers just buy access from employees",
          "score": 5,
          "created_utc": "2026-02-17 14:40:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vn1nw",
          "author": "cant_pass_CAPTCHA",
          "text": "If the DB is exposed to the Internet (less likely but not impossible), the attacker could try to guess the password, or if it's quite out of date maybe there is a CVE they can exploit to gain access. \n\nSimilarly, if the DB is not exposed to the Internet but the attacker has made their way into the internal network, they can repeat the previous steps, but now with the added benefits of being on the internal network and maybe having access to a privileged account or found credentials. \n\nProbably the most likely way would be a weak web app with SQL injection or RCE. SQL injection would allow straight access to dump the DB while RCE now puts them on the application server which probably has some creds embedded in the web app to access the DB and now they can authenticate to dump the DB.",
          "score": 3,
          "created_utc": "2026-02-17 15:20:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wbjlm",
          "author": "leRealKraut",
          "text": "Well, you would like to get access to a user with the access level you like.\n\nWhat people look out for is a way to grab the users out of the database because of the stored Password hashes.\n\nThere are big databases with hashes to search for a hit and some tinkering when you are pretty similar to an existing hash and do the rest with trail and error.\n\nSome Form of SQL injection or access to a compromised System is the usual door inside.",
          "score": 3,
          "created_utc": "2026-02-17 17:22:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wpq8c",
          "author": "GlendonMcGladdery",
          "text": "These gov't subcontractors are a dime and a dozen. Hired and fired regularily. All it takes is one pissed off ex-worker to grab sensative info on his way out. Hacking doesn't always imply tech.",
          "score": 3,
          "created_utc": "2026-02-17 18:28:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uk0c4",
          "author": "raidn1337",
          "text": "Either Phishing or OWASP 10",
          "score": 1,
          "created_utc": "2026-02-17 11:24:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5v0e1w",
          "author": "gorillabrave",
          "text": "Most data leaks from the server, maybe hackers enter the system from security holes such as old plugins, vulnerabilities in SQL server communication, old PHP, user weaknesses such as weak passwords, or brute force many factors, if the system stores it on the web, they just look for the config then log in to the database if SQL phpmyadmin then export the SQL database download if on the computer maybe phishing like malware on government applications in remote access",
          "score": 1,
          "created_utc": "2026-02-17 13:19:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vtw1t",
          "author": "Darkorder81",
          "text": "Used to be so easy with SQLinjection, take a site dump the DB mainly user tables and CC cards tables, and if the password was hashed most of time it was just MD5. The good old days, but these days I aint a clue old life made way for a new.",
          "score": 1,
          "created_utc": "2026-02-17 15:54:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o604r6c",
          "author": "elstongunn87",
          "text": "Cant rule out insiders who have the skill and permissions to do more in high level it positions",
          "score": 1,
          "created_utc": "2026-02-18 05:21:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62f2ek",
          "author": "ZiradielR13",
          "text": "1. recon, find a path in, 2. Once in Push your exploit, 3. Make sure your C2 is connected, 4. Leave a backdoor so you can maintain access if needed. 5. Exfiltrate the target data. Done ✔️ The reason they got breached is due to their lack of security. All a bad actor needs is one loose brick, in a matter of minutes they will be on the other side of the wall.",
          "score": 1,
          "created_utc": "2026-02-18 15:23:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67l1db",
              "author": "Acrobatic-Clock-7889",
              "text": "The reason I asked is that recently some government workers came to my university and they started talking about this, and they said that they have no clue how our systems can get hacked, I just couldn’t believe them. Do you think that they actually don’t or are they just pretending? By the way those people weren’t it specialists they were some kind of police.",
              "score": 1,
              "created_utc": "2026-02-19 08:33:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o68d10s",
                  "author": "ZiradielR13",
                  "text": "Seems like they suspect someone at your school to have done it. Otherwise they would not have come there on their fishing expedition.",
                  "score": 1,
                  "created_utc": "2026-02-19 12:39:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o66ppfh",
          "author": "weHaveThoughts",
          "text": "Lazy admins misconfiguring when introducing new systems or rearchitecting the environment. Best time to find a way in is after the announcement of the company or govt agency announcement of a new product or enhancement. Rush to release causes some rule breaking.",
          "score": 1,
          "created_utc": "2026-02-19 04:17:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67kiic",
          "author": "Witty-Development851",
          "text": "Все проще чем кажется, свои сливают. ",
          "score": 1,
          "created_utc": "2026-02-19 08:28:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67lcsd",
              "author": "Acrobatic-Clock-7889",
              "text": "А в чем выгода? Насколько я знаю хакеры украли данные про серию паспорта год рождения имя и номер телефона. Некоторые украденные данные принадлежали гос служащим, получается что и гос служащих данные и личности были раскрыты, хакер также требовал 200.000 долларов, но как он может использовать эти данные злым путем?",
              "score": 1,
              "created_utc": "2026-02-19 08:37:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o67lpcp",
                  "author": "Witty-Development851",
                  "text": "Все тебе расскажи ) Про телефонных мошенников слышал? Откуда они все знают, как думаешь? У вас как и у нас у админов ЗП маленькие, найти кого-то, кто по доброте душевной, за толику малую сольет данные - гораздо проще чем что-то взламывать.",
                  "score": 1,
                  "created_utc": "2026-02-19 08:40:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ai7t2",
          "author": "Significant-Truth-60",
          "text": "Some of these hacks are out of ignorance. Misconfiguration and outdated applications or plugins. Especially for some government websites ",
          "score": 1,
          "created_utc": "2026-02-19 19:13:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ep2sq",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-20 11:59:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ep2tr",
              "author": "AutoModerator",
              "text": "This link has not been approved, please read the descriptions for Rule 1 and 5 before trying again. Please wait for a moderator to review and approve this post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HowToHack) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-20 11:59:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6etxj3",
          "author": "Stoic_Zen910",
          "text": "It can be many reasons:\n\n-sql injection\n-weak credentials\n-file disclosure ( LFI,path traversal, and backup exposure)\n-exposed database services\n\nOut the top of my head, but there is more.",
          "score": 1,
          "created_utc": "2026-02-20 12:33:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gkulg",
          "author": "findingkieron",
          "text": "Most hacks are user based social engineering",
          "score": 1,
          "created_utc": "2026-02-20 17:50:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hs1f3",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 0,
          "created_utc": "2026-02-20 21:14:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6hs1h0",
              "author": "AutoModerator",
              "text": "This link has not been approved, please read the descriptions for Rule 1 and 5 before trying again. Please wait for a moderator to review and approve this post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HowToHack) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-20 21:14:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6wli7n",
          "author": "Born_Ad5697",
          "text": "Penetrating firewalls.\nComputer domains etc. Private accounts, what ever, the case may be\nIt's only a matter of the method, cost and the tool  used. It's much like penetrating  a bulletproof vest, there it's not a vest that's made that can't be penetrated and there's not a bullet that can't be stopped.\nAll depending on the method, the money and the tool used. And now we have a new player in the game by the name AI artificial intelligence",
          "score": 1,
          "created_utc": "2026-02-23 05:29:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ulnv7",
          "author": "Outrageous_Prior_787",
          "text": "Could be done a number of ways but the only way to know for sure is to check the logs.  \n  \n\\* Web server hacked (many methods), connection string file found, DB hacked from webserver.   \n\\* SQLi through the web application.  \n\\* SQL service brute force either by the service being exposed to the internet.  \n\\* Another host in the network was compromised (phishing, malicious download, insider threat).",
          "score": 1,
          "created_utc": "2026-02-17 11:37:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7bnhb",
      "title": "How can it be hacked?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1r7bnhb/how_can_it_be_hacked/",
      "author": "XunooL",
      "created_utc": "2026-02-17 16:57:09",
      "score": 43,
      "num_comments": 34,
      "upvote_ratio": 0.87,
      "text": "I have a genuine question: how can a database of a secure (supposedly) company that spends tens of millions of dollars on just security, like Meta (IG, FB), Google...etc get hacked?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1r7bnhb/how_can_it_be_hacked/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o5w7d2q",
          "author": "octave1",
          "text": "You don't \"hack\" the database but you try to get credentials somehow, through social engineering or vulns in their code. Doubt it will ever happen to those companies.\n\nThe weakest link are the employees through social engineering.\n\nEverything can be hacked, it's just a matter of how much time / money / talent you have.",
          "score": 53,
          "created_utc": "2026-02-17 17:02:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wcsjk",
              "author": "D-Ribose",
              "text": "this is exactly how Twitter was hacked back in 2020.  \nWhat happened is that the Attackers looked up the cell phone numbers of Twitter employees from LinkedIn and contacted them. They then asked the employees to log into a fake Twitter VPN page and  give their 2FA code.  \nThere is an entire Wikipedia article on it, just search  \n\"2020 Twitter account hijacking\"",
              "score": 33,
              "created_utc": "2026-02-17 17:28:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o60jc22",
                  "author": "Maxtecy",
                  "text": "This. For the fun of it, look up the Dutch ISP Odido, more or less this happened recently causing a data leak of 6.2 million(!) people. ",
                  "score": 6,
                  "created_utc": "2026-02-18 07:22:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6le9fz",
              "author": "castleinthesky86",
              "text": "You can hack the database directly if there is a vulnerability which grants access. They don’t happen very often anymore but there have been several examples of auth bypasses in several major db platforms/services",
              "score": 1,
              "created_utc": "2026-02-21 12:58:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5w7lvi",
          "author": "hkusp45css",
          "text": "Because there is no defense against a determined attacker.\n\nThe attackers can get lucky once, we have to be absolutely right, every time.\n\nThey are throwing darts, while we're playing chess.",
          "score": 14,
          "created_utc": "2026-02-17 17:03:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5w94vp",
          "author": "CommunityPrize8110",
          "text": "Weakest link are the employees. You can merely educate them but that’s not foolproof. \n\nSocial engineering most likely accounts for a VAST majority of database intrusions. This is done by tricking the employee(s), usually carefully selected, into giving you access.",
          "score": 19,
          "created_utc": "2026-02-17 17:10:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ylb36",
              "author": "OkMountain1705",
              "text": "Thats why phishing exist exactly for that you dont hack it directly you just wait for sarah from hr to click that link to get her bonus check and you slowly slither into the network to get to the servers through her computer.",
              "score": 4,
              "created_utc": "2026-02-17 23:59:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5x5ofp",
          "author": "ps-aux",
          "text": "I think you are assuming two things: 1 they are secured, 2 they spend millions on security lol... I haven't noticed any of these two things happening by companies throughout my decades of hacking... from my experience, all companies spend the least as possible on their security and that's why they are always whacked... companies are penny pinching greedy beasts :P",
          "score": 6,
          "created_utc": "2026-02-17 19:42:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5w9st6",
          "author": "jet_set_default",
          "text": "I'll give you some homework. Look up \"SQL injection\". Portswigger is your friend for all things web. Bonus points if you come back with working knowledge on how to do it.\n\nEdit: yes I know there's multiple vulnerabilities and that SQLi is mostly old stuff, but for any newbie learning about DB hacking, this is the usual route people start on. Don't overcomplicate it.",
          "score": 4,
          "created_utc": "2026-02-17 17:14:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wf9rd",
              "author": "octave1",
              "text": "\\> I'll give you some homework. Look up \"SQL injection\". \n\nsqlmap but really, most forms are protected by now since most sites are built with frameworks.",
              "score": 2,
              "created_utc": "2026-02-17 17:40:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5xcjcq",
                  "author": "Pharisaeus",
                  "text": "> most forms are protected by now since most sites are built with frameworks.\n\nThat's not completely true. There are still practical scenarios where people will glue queries by hand, and a lot of frameworks don't really provide any assistance. Prepared statements prevent injection in the parameter values, so your classic `'or '1'='1` won't work but there can be other scenarios.\n\nLet me give a real-life example: Imagine that you want to query only selected columns from the db, based on the user input (so you want to do `select a,b from table` or `select c,d from table` if whichever columns were requested). You could argue that one can simply `select *` and then filter out the requested values from the results, but for column databases that would be a huge waste, because you'd be reading columns you don't need. Even worse for something like AWS Athena or GCP Big Query where you literally pay based on how much data was scanned, so you really want to touch only things you actually need. You can't use parametrized queries or prepared statements for this. There are a few \"frameworks\" that actually provide means to do this safely (for example jOOQ and QueryDSL), but many mainstream solutions don't, and I've seen people gluing those strings manually ;)",
                  "score": 5,
                  "created_utc": "2026-02-17 20:15:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5wrnrn",
              "author": "cengynely",
              "text": "SQL injection is just one method... There are many other vulnerabilities that can be exploited, like social engineering or misconfigured servers. security isn't just about spending money; it's about how effectively those resources are managed.",
              "score": 1,
              "created_utc": "2026-02-17 18:37:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5xn5g8",
          "author": "NoClownsOnMyStation",
          "text": "SQL injection through the login screen \nselect * where “im_in”",
          "score": 3,
          "created_utc": "2026-02-17 21:05:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xy2x5",
          "author": "BWright79",
          "text": "If someone makes it, someone can break it.",
          "score": 3,
          "created_utc": "2026-02-17 21:56:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wwvo1",
          "author": "leRealKraut",
          "text": "There is a missconception around Hacks and leaked information.\n\nPeople most of the time try to use credentials to Systems, find loopholes around authenticating at all or just look out for the content of a dumpster to get stuff.\n\nMost database Hacks are just someone getting an SQL Statement to run and return an result because a Form and output is not checked correctly.\n\nTargets can be anything from user table to content.\n\nSome Systems let you get information over changing a number in an opened URL.\n\nSome backends of Websites can be accessed because the webservice does not require authentication for everything behind a directory.\n\nSome applications allow for users to exploit planned System behavior to gether information, like whatsapp.\n\nIn other instances some people get a hold on old storage devices with unencrypted, useable data or paper points that were not destroyed.\n\nEveryday someone looses a Password or record. If it is someone with access to valuable information, sometimes the wrong people find it.",
          "score": 2,
          "created_utc": "2026-02-17 19:01:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xwcsi",
          "author": "Business_Arrival_765",
          "text": "The answer to your question is \"because Apache Struts\"",
          "score": 2,
          "created_utc": "2026-02-17 21:48:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xwzb9",
          "author": "Isaac_Atham",
          "text": "Well either you gain physical access or access via social engineering etc, you cant ”hack” meta you would with a very slim possibility hack a employee with access",
          "score": 2,
          "created_utc": "2026-02-17 21:51:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5y1km9",
          "author": "GlendonMcGladdery",
          "text": "This question has already asked and addressed. A corporation with so many employees hires subcontractors and such. All it takes to breach is someone whom was laid off or fired\nThey'll take paperwork with them on the way out so speak. \n\nMcafee and symmantec both do quarterly projections on virus trends based on how many geeks were layed off and/or don't have employment, for a reason.",
          "score": 2,
          "created_utc": "2026-02-17 22:13:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5yho7h",
          "author": "Ronmoz",
          "text": "Phishing",
          "score": 2,
          "created_utc": "2026-02-17 23:39:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5w8zqe",
          "author": "Neverr-",
          "text": "Mostly through reconnaissance, enumeration, and initial access.",
          "score": 1,
          "created_utc": "2026-02-17 17:10:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wrs6e",
          "author": "texcleveland",
          "text": "Most often it’s either social engineering (tricking someone who has access into giving you access), or misconfiguration, like leaving a port exposed on the public internet.",
          "score": 1,
          "created_utc": "2026-02-17 18:38:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wwnxy",
          "author": "Funny-Artichoke-7494",
          "text": "Easier than you think. The user is almost always the weakest link. ",
          "score": 1,
          "created_utc": "2026-02-17 19:00:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xbe0u",
          "author": "Jccckkk",
          "text": "social engineering…what nerd could say no to a temptress (or honeypot ).",
          "score": 1,
          "created_utc": "2026-02-17 20:09:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ycmr7",
          "author": "Nervous_Screen_8466",
          "text": "There are these people called marketing and sales…\n\nOccasionally they get some great idea and build some great database but fail to put a god damn password on the fucking database. ",
          "score": 1,
          "created_utc": "2026-02-17 23:11:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60o9gx",
          "author": "billdietrich1",
          "text": "Please use better, more informative, titles (subject-lines) on your posts. Give specifics right in the title. Thanks.",
          "score": 1,
          "created_utc": "2026-02-18 08:07:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64a6z9",
          "author": "creativeboulder",
          "text": "Everything can be hacked. If attacking it head-on (via sole exploit, etc) then there's social engineering (getting an employee to give up creds), among other methods.\n\n25 years as an IT guy, coder, techie-- nothing is 100% unhackable. Nothing.",
          "score": 1,
          "created_utc": "2026-02-18 20:26:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66m581",
          "author": "Wa-a-melyn",
          "text": "Obviously everybody mentions phishing. Once someone has access to the network on any level, they can do a lot more investigation into how it works and look for exploits, and eventually move laterally, or potentially find a privilege escalation. Eventually, maybe you could do DNS poisoning or a mitm or something and phish for more important credentials that would give you unrestricted access.\n\nWhile there are some common tactics, there really is no single answer as to how this happens—the exploits are specific to each network.",
          "score": 1,
          "created_utc": "2026-02-19 03:54:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcbot8",
      "title": "Please help me recover my dads photos and phone",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rcbot8/please_help_me_recover_my_dads_photos_and_phone/",
      "author": "srinkylegitimate",
      "created_utc": "2026-02-23 08:09:31",
      "score": 18,
      "num_comments": 6,
      "upvote_ratio": 0.91,
      "text": "(Mods if this breaks any rule I will understand its removal). My dad passed away very abruptly, I won’t go into details for anonymity but it was violent(not suicide). I know the rules say no personal vendettas but I am not trying to snoop or get revenge, I just want his memories. Because this wasn’t expected, he left his phone behind and nobody knows his password. I just want into his phone because he had a lot of selfies and pictures I’d really like access to. The phone is an android celero5g. And I know most photos are backed up on Google photos but my dad was old so he used Yahoo. Whatever Gmail is tied to the phone we don’t know what it is me ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rcbot8/please_help_me_recover_my_dads_photos_and_phone/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o6xqdm6",
          "author": "Brufar_308",
          "text": "Many companies have a department that handles this.  \n\nRequest Data from Google: You can file a request with Google to obtain data from a deceased person's account, which may include photos and cloud-stored data, rather than the phone itself.\n\nSamsung has a department for this with Samsung phones, etc, etc.\n\nPosting response a second time without link to Google support kb article on this topic,  in case mods don’t approve original post in a timely fashion.",
          "score": 7,
          "created_utc": "2026-02-23 11:46:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6y52av",
              "author": "srinkylegitimate",
              "text": "Thank you",
              "score": 2,
              "created_utc": "2026-02-23 13:29:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xpyx8",
          "author": "Brufar_308",
          "text": "Many companies have a department that handles this.  \n\nRequest Data from Google: You can file a request with Google to obtain data from a deceased person's account, which may include photos and cloud-stored data, rather than the phone itself.\n\nhttps://support.google.com/accounts/troubleshooter/6357590?hl=en\n\nSamsung has a department for this with Samsung phones, etc, etc.",
          "score": 1,
          "created_utc": "2026-02-23 11:43:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71unxl",
          "author": "Disastrous-Goal-2127",
          "text": "I can help there is no reason a family shouldnt be able to get into a lived ones phone",
          "score": 1,
          "created_utc": "2026-02-24 00:32:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r972vt",
      "title": "Restoring, maintaining and updating the lost artifacts of the InfoSec underground - Obsidian Covenant",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1r972vt/restoring_maintaining_and_updating_the_lost/",
      "author": "D3vil0p",
      "created_utc": "2026-02-19 18:27:16",
      "score": 11,
      "num_comments": 1,
      "upvote_ratio": 0.93,
      "text": "I created a new project on GitHub called [Obsidian Covenant](https://github.com/Obsidian-Covenant) to mainly revive abandoned but good pentesting tools that are not maintained anymore upstream.\n\nThe purpose is to modernize the source code, fix any building/compiling issue and modernize functionalities where needed.\n\n[Here](https://github.com/orgs/Obsidian-Covenant/repositories) the list of the current tools I tried to revive.\n\nIf, over time, it will become a community, would be wonderful, in order to maintain also future tools that will be not maintained anymore.\n\nIf you are interested, contributions are highly appreciated.",
      "is_original_content": false,
      "link_flair_text": "pentesting",
      "permalink": "https://reddit.com/r/HowToHack/comments/1r972vt/restoring_maintaining_and_updating_the_lost/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1rbpqfe",
      "title": "I could not find a dictionary",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rbpqfe/i_could_not_find_a_dictionary/",
      "author": "AirportDesperate5906",
      "created_utc": "2026-02-22 16:11:02",
      "score": 11,
      "num_comments": 6,
      "upvote_ratio": 0.77,
      "text": "So there was a common Indian wifi password dictionary named allpass.txt in some github repo. I last used it a few months ago, then I changed my os. Now I want to download the file, search for it but could not find it. It contained around 10 million passwords. If anyone knows, please message me. The dictionary cracked almost 50-55% of the passwords I tried.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rbpqfe/i_could_not_find_a_dictionary/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o6ty277",
          "author": "tilouze",
          "text": "Op plz let me know when you find it",
          "score": 3,
          "created_utc": "2026-02-22 20:08:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6wjs53",
              "author": "AirportDesperate5906",
              "text": "But now I am giving up on finding it, I am going to find different dictionaries, remove duplicates and concatenate",
              "score": 4,
              "created_utc": "2026-02-23 05:15:41",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6wjl8b",
              "author": "AirportDesperate5906",
              "text": "Sure",
              "score": 3,
              "created_utc": "2026-02-23 05:14:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6tmz3g",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-22 19:13:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tmz5h",
              "author": "AutoModerator",
              "text": "This link has not been approved, please read the descriptions for Rule 1 and 5 before trying again. Please wait for a moderator to review and approve this post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HowToHack) if you have any questions or concerns.*",
              "score": -2,
              "created_utc": "2026-02-22 19:13:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6timor",
          "author": "guiltyJMEKA",
          "text": "how much would you say this file would be worth you in dollars?",
          "score": -11,
          "created_utc": "2026-02-22 18:53:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rawyl6",
      "title": "Hydra is not working",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rawyl6/hydra_is_not_working/",
      "author": "Background_Pool_6764",
      "created_utc": "2026-02-21 17:27:04",
      "score": 9,
      "num_comments": 7,
      "upvote_ratio": 0.74,
      "text": "I recently started getting into ethical hacking, and as a result, I started learning how to use Hydra. As a test, I tried hacking [https://demo.testfire.net/login.jsp](https://demo.testfire.net/login.jsp), which is a site created to let hackers test things such as SQL injections and other stuff. I know that the correct username for this website is \"admin\" and the correct password is \"admin\". I tried to use Hydra to test this, but Hydra finds every single password I put correct even when they're not. And if I use a success criterion instead of a failure criteria it finds every single password wrong.\n\nI have no idea why it is not working, and neither does Google. Any help would be greatly appreciated.\n\nThis is the command that I'm using:\n\nhydra -f -vV \\\\ -l Admin \\\\ -p Admin \\\\ [demo.testfire.net](http://demo.testfire.net) \\\\ https-post-form \"/login.jsp:uid=\\^USER\\^&passw=\\^PASS\\^&btnSubmit=Login:F=Login Failed\"\n\nBy the way, I am running Kali Linux in Virtualbox if that changes anything",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rawyl6/hydra_is_not_working/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o6mrwn5",
          "author": "ITSecHackerGuy",
          "text": "https://preview.redd.it/geh3myeowvkg1.png?width=2094&format=png&auto=webp&s=80b438440c459b0be5a569d415f4d46c5de4fbfa\n\nYour problem is where you're sending the data. It never finds the \"Login Failed\" because you're not using the correct URL for your request. See, in the network you'll see the endpoint you're meant to send the payload to isn't /login.jsp but instead /doLogin. It is then redirected to login.jsp",
          "score": 14,
          "created_utc": "2026-02-21 17:33:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6mumyu",
              "author": "ITSecHackerGuy",
              "text": "https://preview.redd.it/jvr3g5uuxvkg1.png?width=2316&format=png&auto=webp&s=eb4e2b357ee1b1ead2a0e3183c17620b235f3b7d\n\n",
              "score": 6,
              "created_utc": "2026-02-21 17:46:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6nv25s",
              "author": "Background_Pool_6764",
              "text": "Oh ok. Thank you!",
              "score": 2,
              "created_utc": "2026-02-21 20:51:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6osuea",
          "author": "Careless-Dot5770",
          "text": "https://preview.redd.it/xwmkjm1qsxkg1.jpeg?width=1884&format=pjpg&auto=webp&s=4588563014b8119cc23db180589d16ea8e1735d5\n\n\\[    0.087237\\] \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* \\[    0.087255\\] \\*\\*   NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE   \\*\\* \\[    0.087265\\] \\*\\*                                                      \\*\\* \\[    0.087275\\] \\*\\* trace\\_printk() being used. Allocating extra memory.  \\*\\* \\[    0.087284\\] \\*\\*                                                      \\*\\* \\[    0.087293\\] \\*\\* This means that this is a DEBUG kernel and it is     \\*\\* \\[    0.087302\\] \\*\\* unsafe for produciton use.                           \\*\\* \\[    0.087311\\] \\*\\*                                                      \\*\\* \\[    0.087321\\] \\*\\* If you see this message and you are not debugging    \\*\\* \\[    0.087330\\] \\*\\* the kernel, report this immediately to your vendor!  \\*\\* \\[    0.087339\\] \\*\\*                                                      \\*\\* \\[    0.087348\\] \\*\\*   NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE   \\*\\* \\[    0.087357\\] \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*",
          "score": 1,
          "created_utc": "2026-02-22 00:01:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6otnoh",
          "author": "Careless-Dot5770",
          "text": "Can you or do you know anything about this kernel custom rom? I've had 4 phones all from T-Mobile hacked. \nWith this message on my recovery logs? I'm trying to find answers in sorry if I'm in the wrong place. Thanks",
          "score": 1,
          "created_utc": "2026-02-22 00:06:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6sx0wx",
          "author": "elreomn",
          "text": "yo hydra can be finicky as hell sometimes, especially with https sites. couple things probably going wrong here:\n\nfirst off your command has some weird backslashes. in terminal those escape characters so it's probably not reading right. try it all on one line without the \\\\ breaks\n\nalso for https you need the -S flag or specify port 443. hydra gets confused with ssl sometimes\n\nthe bigger issue tho - that testfire site might be returning the same response code regardless of login success/failure. hydra relies on spotting a difference like \"login failed\" text. if the page doesn't change or uses javascript/ajax, hydra won't catch it\n\ntry this instead:\n\n```\nhydra -l admin -p admin demo.testfire.net https-post-form \"/login.jsp:uid=^USER^&passw=^PASS^&btnSubmit=Login:Login Failed\" -S -V\n```\n\nif that still doesn't work, open the site in burp suite first and see exactly what the request looks like when you login. could be hidden fields or cookies messing with it\n\nalso double check it's actually \"uid\" and \"passw\" as field names. sometimes these test sites use different names\n\nworst case try with a http version if they have one. https just adds extra headache for learning",
          "score": 1,
          "created_utc": "2026-02-22 17:13:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcaj0f",
      "title": "Android 12, Moto g40, how to unlock",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rcaj0f/android_12_moto_g40_how_to_unlock/",
      "author": "jackai7",
      "created_utc": "2026-02-23 06:59:06",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 0.78,
      "text": "I forgot the pin of my old motorola g40 phone, how can I unlock it, I need to recover photos & document from the device.\nHow can I do it, I have a bit knowledge of Linux.\nDoes anyone know any software or any way to unlock",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rcaj0f/android_12_moto_g40_how_to_unlock/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o6wx0k1",
          "author": "red-joeysh",
          "text": "Ask the rightful owner, I am sure they will share it.",
          "score": 6,
          "created_utc": "2026-02-23 07:07:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6y1dfd",
          "author": "Humbleham1",
          "text": "Buy new phone.",
          "score": 1,
          "created_utc": "2026-02-23 13:06:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yuj33",
              "author": "jackai7",
              "text": "Got one already",
              "score": 2,
              "created_utc": "2026-02-23 15:44:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6x4v5c",
          "author": "Infamous_Gear3578",
          "text": "Je ne peux malheureusement te le dire ici, mais regarde sur Google il existent des solutions.",
          "score": 1,
          "created_utc": "2026-02-23 08:22:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7wc7p",
      "title": "How to check where my phone number is currently active or linked to an account?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1r7wc7p/how_to_check_where_my_phone_number_is_currently/",
      "author": "Mundane-Elevator1906",
      "created_utc": "2026-02-18 07:15:16",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 0.71,
      "text": "With email, it’s easy to see where you’ve signed up because you receive newsletters and notifications. But with a phone number, it’s much harder to track which websites or services are using it. Is there any way to find out where my number is registered?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1r7wc7p/how_to_check_where_my_phone_number_is_currently/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o629qv4",
          "author": "ps-aux",
          "text": "not really... could try leaked dbs",
          "score": 2,
          "created_utc": "2026-02-18 14:57:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o629xm2",
          "author": "Juzdeed",
          "text": "Not really since some services dont even bother to verify if the number belongs to you.\n\nDue to spam and just emailing not costing basically anything then its just easier to check. But again all services dont send newsletter or even confirmation code so you cant really get a true list where you are registered",
          "score": 2,
          "created_utc": "2026-02-18 14:58:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ranlmt",
      "title": "Need help on packet editing server side",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1ranlmt/need_help_on_packet_editing_server_side/",
      "author": "Accurate_Buddy_75",
      "created_utc": "2026-02-21 10:10:35",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 0.81,
      "text": "What’s up guys. I’m not very well versed in packet editing. But back in the day, when editing packets in games. It was as easy as editing what is from my understanding “not encrypted”. Like if one was playing miniplanet years ago, and wanted to stop themselves from getting kicked out of a house by another player, they would record themselves being kicked using wpe. Then edit the packets content. Usually an obvious word like “kick” and nullify it. These days, everything is encrypted, or from what I read, must pass the games server before going to the client, or another client. That’s me putting it in my newbie terms. I’ve played around with fiddler, don’t know how to do anything like this. Any help on how to do this? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1ranlmt/need_help_on_packet_editing_server_side/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o6l0ei3",
          "author": "Humbleham1",
          "text": "Specifically, you have no chance. I doubt that game packets will be encrypted, but nothing will be in plaintext. They'll use a proprietary protocol. It's also rare for there to be the old-school game host that everyone in a match connects to directly. Game companies, at least AAA ones, will protect user privacy.",
          "score": 3,
          "created_utc": "2026-02-21 11:00:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l1zqi",
              "author": "Accurate_Buddy_75",
              "text": "So this is true regarding a multiplayer flash game, or like a game on Facebook for example? People have used fiddler and wpe in the past.",
              "score": 1,
              "created_utc": "2026-02-21 11:15:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6lb8q4",
                  "author": "Humbleham1",
                  "text": "Especially those. It's possible to decrypt the TLS packets, but you would only see your connection to the server. Wireshark will confirm this. Back when LAN gaming existed, you could probably modify something in plaintext.",
                  "score": 4,
                  "created_utc": "2026-02-21 12:35:47",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6lbj72",
                  "author": "Humbleham1",
                  "text": "I don't understand either, how if a game host wanted to kick someone, the command could be intercepted and altered on the affected player's computer.",
                  "score": 1,
                  "created_utc": "2026-02-21 12:38:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rb7n2o",
      "title": "Hacking vs. Cloning; Expert’s input requested?",
      "subreddit": "HowToHack",
      "url": "https://www.reddit.com/r/HowToHack/comments/1rb7n2o/hacking_vs_cloning_experts_input_requested/",
      "author": "Cautious-Title-4389",
      "created_utc": "2026-02-22 00:43:25",
      "score": 3,
      "num_comments": 9,
      "upvote_ratio": 0.64,
      "text": "I know they’re not the same.\n\nFrom a security & traceability standpoint:\n\n\tWhich leaves more digital evidence and is easier to track?\n\n\tWhat’s the purpose of each ;why would someone hack vs. clone?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/HowToHack/comments/1rb7n2o/hacking_vs_cloning_experts_input_requested/",
      "domain": "self.HowToHack",
      "is_self": true,
      "comments": [
        {
          "id": "o6pbglw",
          "author": "ITSecHackerGuy",
          "text": "It really depends. There are hundreds of different scenarios involving cloning and even more different ways to hack into devices. The exact circumstances you're in will define which you should go for and why. \n\nGenerally, hacking into a device is more fragile. The exploit might not work well, it might get detected and blocked, it might not survive long enough until disruption (update, restart, etc.), or it might be very difficult or impossible with your knowledge at the time.\n\n  \nCloning, on the other hand, is typically a simpler and more stable process. You can clone a device, then explore it offline anywhere. Sometimes you can clone it in a way that lets you still see some future activity and often even interact with it. It is, however, more limited. First, it typically requires more access to what you're cloning, either in terms of information or physically. Second, you can only explore the information you cloned, plus whatever accesses are still available and possible to use from the existing sessions. This means you could for example still see someone's email or messages, but you cannot see other future activity like him logging into his bank account after you clone it.   \n  \nBottom line is, in very general terms, cloning a device is easier but requires more access and is more limited in what it gives you access to. Hacking into a device is more fragile, more things can go wrong, and it's noisier, but it allows you to have better control and more power to do a lot more. One isn't better than the other, they're simply two ways to obtain overlapping but different kinds of information and access. They're both useful, depending on the situation. ",
          "score": 2,
          "created_utc": "2026-02-22 01:58:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6pfosa",
              "author": "Cautious-Title-4389",
              "text": "Thank for taking the time to reply, lets say for the sake of  discussion and learning:\n\nsomeone cloned  a portal that’s used to check peoples information. Their goal is to change or fake a person’s details so that when someone verifies that person, the information shows up differently from the real, original data.\n\nIs something like that actually possible? And does it happen only on the class ned version or can the real portal be altered as well?",
              "score": 1,
              "created_utc": "2026-02-22 02:25:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6rgqfw",
                  "author": "ITSecHackerGuy",
                  "text": "No worries! \n\nI will assume this portal is either a web application or software that connects to a backend that has access to a database where the data lives. If we're talking only about cloning, then what we would do is set up an app with a similar domain or name, and replicate how that portal looks completely. This wouldn't affect the real portal, we would just have a clone of that real portal, but it's effectively a different portal, one only we control. \n\nWe would have to get whoever we wanted to \"attack\" or trick, to use OUR portal instead of the real one. Since we control our portal we can show whatever we want. We can't, however, make any changes to the real portal. \n\nIf we want to make changes to the real portal we need to hack into it, not just clone it. \n\nCloning usually only allows us to make changes or have access to information on the real apps/devices in very specific scenarios. For example, cloning a phone completely or a computer, which contains all the logged-in sessions. In this case we could still use those sessions, if they were valid, hence being able to see or change the real accounts/systems. \n\nIn the scenario you presented, the only cloning we could do would be to replicate the portal as our own portal, without being able to touch the real one. If you wanted to affect the real one you'd have to hack into a device that has administrative access to the portal, or hack into the servers hosting the portal, or hack into the databases/backend connected to that portal.\n\nBottom line, yea your full scenario is possible, but not through cloning alone. \n\nHope it helped :D  \n",
                  "score": 2,
                  "created_utc": "2026-02-22 12:41:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6p0o1v",
          "author": "I_can_pun_anything",
          "text": "Hack would probably leave more log evidence as your continually trying and breaching the same system. Clone takes a copy to Crack offline\n\nBut its nuanced",
          "score": 1,
          "created_utc": "2026-02-22 00:49:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6p5cwj",
              "author": "Cautious-Title-4389",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-02-22 01:19:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6p65fu",
                  "author": "I_can_pun_anything",
                  "text": "Risk with clonining depending on app or machine size is the persistent connection needed to download or image the machine. But without specific examples its hard to say more than its a nuanced thing",
                  "score": 1,
                  "created_utc": "2026-02-22 01:24:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6p9i98",
          "author": "Cautious-Title-4389",
          "text": "That piece of info I do not have.",
          "score": 0,
          "created_utc": "2026-02-22 01:45:55",
          "is_submitter": true,
          "replies": []
        }
      ]
    }
  ]
}