{
  "metadata": {
    "last_updated": "2026-02-08 03:39:57",
    "time_filter": "week",
    "subreddit": "indiehackers",
    "total_items": 12,
    "total_comments": 311,
    "file_size_bytes": 282743
  },
  "items": [
    {
      "id": "1qwod1o",
      "title": "i wish someone would have told me this before building my 1st startup",
      "subreddit": "indiehackers",
      "url": "https://www.reddit.com/r/indiehackers/comments/1qwod1o/i_wish_someone_would_have_told_me_this_before/",
      "author": "davidheikka",
      "created_utc": "2026-02-05 15:32:00",
      "score": 63,
      "num_comments": 86,
      "upvote_ratio": 0.95,
      "text": "i’ve grown my current startup to [$12k/mo](https://imgur.com/a/qMEoB9f).\n\ni honestly think i could’ve saved myself months of wasted effort going down the wrong paths if i truly understood this before starting.\n\n1. validate your idea before you start building.\n2. don’t chase investors. focus on getting users instead and investors will come knocking on your door.\n3. don’t be cheap when you hire an accountant, you’ll save time and money by spending more.\n4. inspiration is the design key when you’re new. don’t build your own landing page from scratch, copy different sections from the tools you love the most and make it your own this way.\n5. post online daily. x, reddit, linkedin, tiktok, whatever suits you and your target audience.\n6. solve your own problem and let this decide if you’re b2b or b2c. both come with pros and cons. don’t listen to people who try to paint a black/white picture of it.\n7. i’m bootstrapped and therefore highly recommend it. work a 9-5 until you have 1-2 years of runway (living cheap), then go all in.\n8. you earn the right to paid ads by getting organic marketing to work first. ads aren’t $100 in, X customers out. you’ll burn thousands just trying to learn it.\n9. define your most important metrics and track them. they should be the pillars that guide all your decisions.\n10. keep your product free at the start. controversial opinion maybe, but it’s how i did it and it got me feedback and testimonials that helped me grow fast and make a lot of money later on.\n11. the first few minutes of your app is a promise to the user: this app will help you achieve your goal. so put a lot of effort into the beginning to convert more people.\n12. have an mvp mindset with everything you do. get the minimal version out asap then use feedback to improve it.\n13. just because someone else has done it, doesn’t mean you can’t compete. execution is so important and you have no idea how well they’re doing it.\n14. having a co-founder that matches your ambition is the single greatest advantage for success.\n15. if you’re not passionate about what you’re building, it’s going to be difficult to keep going through the early stage where you might not see results for months.\n16. good testimonials will increase the perceived value of your product.\n17. always refund people that want a refund.\n18. marketing is constant experimentation to learn what works. speed up the process by drawing inspiration from what works for similar products.\n19. getting your first paying customers is the hardest part by far. do things that don’t scale to get them.\n20. building a good product comes down to thinking about what your users want.\n\nedit - for context, my startup is [aicofounder.com](https://aicofounder.com)",
      "is_original_content": false,
      "link_flair_text": "Sharing story/journey/experience",
      "permalink": "https://reddit.com/r/indiehackers/comments/1qwod1o/i_wish_someone_would_have_told_me_this_before/",
      "domain": "self.indiehackers",
      "is_self": true,
      "comments": [
        {
          "id": "o3reumj",
          "author": "Just__Beat__It",
          "text": "1. How to validate the idea?",
          "score": 7,
          "created_utc": "2026-02-05 18:31:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3swqna",
              "author": "justbeinghonestk",
              "text": "This is for B2B ideas:\n\nDo in-person sales (can be virtual, phone, or actually in-person) and real world prospecting (not spam 10000 people you find in Apollo). \n\nIf you see $$, then that's validation. More money = more validation. If no one's buying it, refine it. Cuz it's even a smaller chance a random will find you and buy it online.\n\nIf you are not comfortable doing in-person sales, time to learn. Because you will be selling no matter what stage your business is in. ",
              "score": 5,
              "created_utc": "2026-02-05 22:49:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3uu8v2",
                  "author": "Just__Beat__It",
                  "text": "Thanks",
                  "score": 1,
                  "created_utc": "2026-02-06 05:59:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3uu1g1",
              "author": "NewBlock8420",
              "text": "The cheapest way to validate is to sell before you build. Talk to potential users, describe what you're thinking of building, and see if they'd pay for it. You can do this with a simple landing page and a waitlist, or even just DMs and conversations.\n\nA few things that work:  \n\\- Post your idea in communities where your target users hang out and see if anyone bites  \n\\- Create a basic landing page with a \"join waitlist\" or \"pre-order\" button  \n\\- Run a small ad campaign ($50-100) to test if people click\n\nI wrote a full breakdown on this here if you want the details: [https://hafiz.dev/blog/how-to-validate-your-idea-before-spending-eur5000-on-development](https://hafiz.dev/blog/how-to-validate-your-idea-before-spending-eur5000-on-development)",
              "score": 2,
              "created_utc": "2026-02-06 05:57:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3uu5em",
                  "author": "Just__Beat__It",
                  "text": "Good idea, thanks!",
                  "score": 1,
                  "created_utc": "2026-02-06 05:58:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3wrlsw",
              "author": "davidheikka",
              "text": "it depends on how much of an investment it is to build it. my idea was quite simple to build so i posted a survey on reddit a couple of times to gather enough positive signals to tell me it was worth building.\n\nif it's easy to build, you don't lose that much from actually spending the time to build it and then start marketing it to validate with real payments and usage.\n\nif it's going to take months of effort and funding to build, i would start with only doing marketing to a landing page with a wait list or pre orders before building anything.",
              "score": 2,
              "created_utc": "2026-02-06 14:49:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3r9pgl",
          "author": "Adam_mf",
          "text": "How quick should you release your product? Or is it better to wait until you actually get a solid waitlist?",
          "score": 3,
          "created_utc": "2026-02-05 18:08:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wqbd9",
              "author": "davidheikka",
              "text": "i launched my mvp after about a month of building, and this was after i had validated my idea through a survey on reddit. getting my mvp out fast helped me a lot since it led to feedback that then let me shape the app into something people actually wanted. so my answer is basically to get it out as fast as possible to start receiving the valuable feedback you need.",
              "score": 2,
              "created_utc": "2026-02-06 14:42:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3x1mhr",
                  "author": "Adam_mf",
                  "text": "That’s very helpful, really appreciate it!!",
                  "score": 1,
                  "created_utc": "2026-02-06 15:38:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o46f2e1",
              "author": "silicoAI",
              "text": "If you’re proud of your MVP, you launched too late. Can’t remember who said that, but I like that philosophy",
              "score": 2,
              "created_utc": "2026-02-08 01:18:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qcpmg",
          "author": "Ibrasa",
          "text": "I learned to not only validate my idea. But properly validate it\n\nI validated wrong 5€4 first time, validating and correctly validating seems to be two different things 🥲",
          "score": 2,
          "created_utc": "2026-02-05 15:35:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qf8d0",
              "author": "davidheikka",
              "text": "yes there are definitely mistakes you can make with validation depending on what method you choose",
              "score": 1,
              "created_utc": "2026-02-05 15:47:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qtiw6",
          "author": "billionaire2030",
          "text": "I am literally giving away my prouct to be used for free just to validate. it's a great way to start tbh",
          "score": 2,
          "created_utc": "2026-02-05 16:53:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qyc6o",
              "author": "davidheikka",
              "text": "some people say don't do it but like i mentioned, it got me feedback and testimonials that helped me improve my app and market it more easily. so in the end i definitely made my money back.",
              "score": 1,
              "created_utc": "2026-02-05 17:15:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qukov",
          "author": "Civil-Fish",
          "text": "What's your startup? Otherwise this is all just total BS.",
          "score": 2,
          "created_utc": "2026-02-05 16:58:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qz2p6",
              "author": "davidheikka",
              "text": "i wanted to avoid self promotion but since you ask it's [aicofounder.com](https://aicofounder.com)",
              "score": 1,
              "created_utc": "2026-02-05 17:19:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qchgx",
          "author": "hassanali098",
          "text": "Please check your DM",
          "score": 1,
          "created_utc": "2026-02-05 15:34:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qfcyc",
              "author": "davidheikka",
              "text": "okay",
              "score": 1,
              "created_utc": "2026-02-05 15:47:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3r6kle",
          "author": "Comfortable_Place465",
          "text": "This is a solid list, but the subtext that matters most (and people miss) is sequence. Almost every mistake founders make is doing the right thing at the wrong time: ads before pull, investors before users, polish before proof, scale before fit.\n\nThe “do things that don’t scale” + staying employed while bootstrapping combo is especially underrated. It buys you patience, and patience is basically a superpower in the early stage. Most people don’t fail because the idea is bad, they fail because they run out of emotional or financial runway.\n\nAlso +1 on refunds and free early access. Trust compounds faster than revenue at the beginning, and people who feel treated fairly come back later. Congrats on $12k/mo, and thanks for sharing the unglamorous parts instead of a victory lap.",
          "score": 1,
          "created_utc": "2026-02-05 17:54:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vc464",
              "author": "balu_Marikanti",
              "text": "\"ads before pull, investors before users, polish before proof, scale before fit\". I agree, this is a very common mistake.",
              "score": 2,
              "created_utc": "2026-02-06 08:38:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3vcpfz",
                  "author": "Comfortable_Place465",
                  "text": "totally agree; particularly just driving \"fake\" traction before users really naturally get into the product IMO",
                  "score": 1,
                  "created_utc": "2026-02-06 08:43:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3rlmar",
          "author": "Jaded_Society8669",
          "text": "That’s an awesome advices. As a newly baked indie hacker - thank you for sharing this with community. Pretty sure it will save a lot of trouble for me and others.",
          "score": 1,
          "created_utc": "2026-02-05 19:02:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wpo28",
              "author": "davidheikka",
              "text": "i'm glad to help. and i wish you all the best on your indie hacker journey!",
              "score": 1,
              "created_utc": "2026-02-06 14:39:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3rqw5i",
          "author": "Ryland990",
          "text": "this is great insight and honestly, i share a lot of from what you have mentioned... sharing most of the struggles, however, why do you need an accountant for at this stage ? you're doign 12k/mo is not that much imo to need one (maybe i'm biased since I work in finance for my 9to5) \n\n",
          "score": 1,
          "created_utc": "2026-02-05 19:27:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rqyv1",
          "author": "hectorguedea",
          "text": "This list is solid, and what I like most is how unsexy most of these lessons are 😅\n\nThey only feel obvious after you’ve paid the price.\n\nThe one that hit me hardest personally was #19: getting the first paying customers is the hardest part.\n\nOnce money changes hands, everything becomes clearer: positioning, onboarding, support, even what not to build.\n\nI’d also double down on doing things that don’t scale early. Real conversations, manual fixes, even awkward workflows teach you way more than analytics dashboards at the beginning.\n\nThanks for sharing this. Posts like this save months for people who are just starting.",
          "score": 1,
          "created_utc": "2026-02-05 19:27:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3s8pik",
          "author": "Basic-Gazelle4171",
          "text": "Solid list, especially point 12 on the MVP mindset. Getting that minimal version out fast to validate is everything. That's the core of how we operate at THWorks helping founders build that crucial first version in AI or Web3 without getting stuck building for months. ",
          "score": 1,
          "created_utc": "2026-02-05 20:51:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3s9c0g",
          "author": "Druffster_",
          "text": "Thanks, this is really helpful!\nI have published my first app on the iOS store which is free and busy with our second app we are going to monetize. \nQuestion…When you say validating the idea, does it also suffice telling a few people about it and asking if they would use it or more structured?",
          "score": 1,
          "created_utc": "2026-02-05 20:54:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3sim7f",
          "author": "Sea-Assumption6035",
          "text": "genuine question regarding privacy policies and terms of service, when you first launch the mvp, do you just AI-generate the two pages or ask lawyer friends to review a bit? I plan to launch my product and just stuck at these two pages...",
          "score": 1,
          "created_utc": "2026-02-05 21:39:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wt3om",
              "author": "davidheikka",
              "text": "just ai generate. there's no reason to get slowed down by something like that. maybe some lawyer would get triggered by this but i'm pretty sure 90% of people just do it with ai.",
              "score": 1,
              "created_utc": "2026-02-06 14:56:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3skmxl",
          "author": "Embarrassed_Wafer438",
          "text": "Thank you for sharing this! It’s like a 'golden rule' for me. I really appreciate you sharing such valuable insights with the community.\n\nI'm currently swamped with final debugging, system migration, and refining core content right before the launch. I'll definitely have to go through your advice thoroughly to make sure I haven't missed anything. Thanks again!",
          "score": 1,
          "created_utc": "2026-02-05 21:49:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wtc6v",
              "author": "davidheikka",
              "text": "that's awesome. i hope the launch goes well for you!",
              "score": 1,
              "created_utc": "2026-02-06 14:58:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3twop9",
          "author": "ShippidyShipIt",
          "text": "How far should someone go before validating the idea. I mean, to really put it to tests, isn't it better to have a MVP at least? Honest question here. Got an idea, currently building the MVP.",
          "score": 1,
          "created_utc": "2026-02-06 02:16:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3tz6d7",
          "author": "Ecaglar",
          "text": "the sequence point from one of the comments is underrated. doing the right thing at the wrong time is basically my entire first year of building stuff lol. also #19 hits different - those first few paying customers feel impossible until they happen and then suddenly everything clicks into place",
          "score": 1,
          "created_utc": "2026-02-06 02:31:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3u4bch",
          "author": "Repulsive-Ad7675",
          "text": "when you talk about 'most important metrics' can you be a bit more specific? obviously i'm guessing if it's b2c it's probably stuff like DAU, MAU, retention right? Is that what you are referring to?",
          "score": 1,
          "created_utc": "2026-02-06 03:01:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ubj1o",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 1,
          "created_utc": "2026-02-06 03:46:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uk2dr",
          "author": "Altruistic_Minimum94",
          "text": "love this. ",
          "score": 1,
          "created_utc": "2026-02-06 04:43:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ukb9f",
          "author": "Altruistic_Minimum94",
          "text": "What would you say is the proper best way to validate a b2c mobile app?\n\n",
          "score": 1,
          "created_utc": "2026-02-06 04:45:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uwlgg",
          "author": "NucleusOS",
          "text": "Number 5 is underrated. Most people obsess over building the \"perfect\" product first, but daily posting teaches you way more about your market than months of silent building.\n\n\n\nAlso agree on #8 about organic marketing. Paid ads should amplify what already works, not validate it. If you can't get your first 10-50 users organically, throwing money at ads won't fix the fundamental problem.\n\n\n\nThe best validation isn't feedback - it's people asking \"when can I use this?\" before you even finish explaining it.",
          "score": 1,
          "created_utc": "2026-02-06 06:18:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ux3z6",
          "author": "Nervous_Technology19",
          "text": "Have sense, I can tell it's all true on some point",
          "score": 1,
          "created_utc": "2026-02-06 06:22:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uy5gs",
          "author": "WorthFan5769",
          "text": "solid list especially validate before building and free early access for feedback, disagree slightly on paid ads only after organic works since sometimes paid is the only way to reach your audience at scale but yeah dont burn cash learning it blind, twelve thousand monthly revenue bootstrapped is real proof this approach works, how long from idea to first dollar",
          "score": 1,
          "created_utc": "2026-02-06 06:31:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v3pzl",
          "author": "_3VLTN",
          "text": "This is a great list. The “validate before building” + “get users before investors” combo alone would’ve saved me a ton of time early on. The part that really hits is doing things that don’t scale for the first paying customers. Everyone wants automation way too early, but those scrappy, manual wins teach you more than any dashboard ever will. Also hard agree on organic before ads. Ads just amplify what already works. Solid reminders all around.",
          "score": 1,
          "created_utc": "2026-02-06 07:19:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v43jf",
          "author": "Forsaken_Lie_8606",
          "text": "Solid list! The organic before paid ads point is huge. Too many founders burn cash on ads before they know what message actually converts. Your 12k MRR validates these lessons.",
          "score": 1,
          "created_utc": "2026-02-06 07:23:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v49jp",
          "author": "Forsaken_Lie_8606",
          "text": "Great insights! The organic before paid ads point is crucial. Many founders burn cash on ads before knowing what message converts.",
          "score": 1,
          "created_utc": "2026-02-06 07:24:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vc86r",
          "author": "balu_Marikanti",
          "text": "Thank you And congratulations.",
          "score": 1,
          "created_utc": "2026-02-06 08:39:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vj75y",
          "author": "akilhan13",
          "text": "Get instant conversion optimization suggestions for your landing pages. \n\n\nhttps://convertpulse.vercel.app/",
          "score": 1,
          "created_utc": "2026-02-06 09:46:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vopwh",
          "author": "zGotz",
          "text": "Well mentioned. Don’t chase investors if you don’t need atp. They always appear.",
          "score": 1,
          "created_utc": "2026-02-06 10:37:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3votzh",
          "author": "Hovdev",
          "text": "I think 5 is the most important and hard.\nbut it is much harder than Making...😂",
          "score": 1,
          "created_utc": "2026-02-06 10:38:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wtsks",
              "author": "davidheikka",
              "text": "yep, distribution really is tough and there's a lot of competition out there these days. staying consistent with it has definitely rewarded me though.",
              "score": 1,
              "created_utc": "2026-02-06 15:00:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vp4cm",
          "author": "Helpful_Listen2824",
          "text": "i face one major problem that what i am making is it really worth it or not, so what should be the right approach ",
          "score": 1,
          "created_utc": "2026-02-06 10:41:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wu6xa",
              "author": "davidheikka",
              "text": "that's the exact reason to validate your idea. the wrong approach would be spending months building and marketing something only to find out later no one really wanted it.\n\nif i were you i would validate the idea. you can read my other replies about it but basically how much validation you need depends on how big of an investment it is to build.",
              "score": 1,
              "created_utc": "2026-02-06 15:02:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vp7k5",
          "author": "MomentInfinite2940",
          "text": "these are greatest and honest insights i have heard so far, P.S your product is awsome  \nQuestion - can you go more in detail with:\n\n1. marketing is constant experimentation to learn what works. speed up the process by drawing inspiration from what works for similar products.\n2. was this your first product?\n\nThanks. Cheers.\n\n",
          "score": 1,
          "created_utc": "2026-02-06 10:42:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xa4ra",
          "author": "Forsaken_Lie_8606",
          "text": "validation before building is such underrated advice, spent 6 months building something nobody wanted before learning this the hard way, congrats on 12k/mo",
          "score": 1,
          "created_utc": "2026-02-06 16:19:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xajlr",
          "author": "squarallelogram",
          "text": "why did your revenue drop so much?  \n[https://www.reddit.com/r/SaaSMarketing/comments/1o4nrlx/my\\_app\\_makes\\_me\\_27700month\\_after\\_12\\_months/](https://www.reddit.com/r/SaaSMarketing/comments/1o4nrlx/my_app_makes_me_27700month_after_12_months/)\n\n",
          "score": 1,
          "created_utc": "2026-02-06 16:21:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3xn0b4",
              "author": "davidheikka",
              "text": "we actually have more customers now but we recently switched from a high one-time price to a lower subscription price so we have to build up the MRR again",
              "score": 2,
              "created_utc": "2026-02-06 17:19:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3zlhdu",
                  "author": "squarallelogram",
                  "text": "Gotcha, that make sense. Nice!",
                  "score": 1,
                  "created_utc": "2026-02-06 23:08:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3xc3u4",
          "author": "ryan_mcleod",
          "text": "Congrats on the $12K/mo! That's real traction, not just theory ;)\n\n\\#10 hits different for me right now. I'm on Day 12 of launching Memflect ($3.99 one-time) and have been debating whether I should've made it free initially just to get people actually trying it vs optimizing for revenue from day one.\n\nThe problem I'm running into: people see \"$3.99\" and bounce without even trying the free preview. But if I made it fully free, would they even value it enough to give real feedback? Classic chicken-and-egg.\n\n\\#5 and #8 also feel spot-on. I'm posting daily across TikTok, Reddit, LinkedIn, X - testing what actually converts. Zero paid ads yet because I haven't cracked organic. Feels like I'm throwing spaghetti at the wall but at least I'm learning what sticks haha.\n\nQuestion: when you kept it free at the start, how long until you switched to paid? And did you grandfather the free users or convert them?\n\nAlso curious - did you build aicofounder solo or with a co-founder (given #14)? 😄",
          "score": 1,
          "created_utc": "2026-02-06 16:28:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xk82r",
          "author": "PerformanceTrue9159",
          "text": "Any tips on narrowing the ideas to know market potential ?",
          "score": 1,
          "created_utc": "2026-02-06 17:06:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3y2dgd",
          "author": "Nervous-Stretch1591",
          "text": "how to get first paying customer ?",
          "score": 1,
          "created_utc": "2026-02-06 18:32:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ya455",
          "author": "SoloNM8",
          "text": "Thanks, it's very interesting and useful. How long it took to get your first earnings?",
          "score": 1,
          "created_utc": "2026-02-06 19:09:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yaibc",
          "author": "SoloNM8",
          "text": "You mentioned about accountant. Are you freelancer?",
          "score": 1,
          "created_utc": "2026-02-06 19:11:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ybrjg",
          "author": "Sthgrey",
          "text": "Validate the app with free usage for some time?",
          "score": 1,
          "created_utc": "2026-02-06 19:17:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yxgop",
          "author": "Sergiowild",
          "text": "the distribution thing is so real. spent months building and polishing, then realized i had no idea how to actually get it in front of people. marketing is its own skill entirely.",
          "score": 1,
          "created_utc": "2026-02-06 21:05:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zk1ja",
          "author": "nezerwa",
          "text": "Thanks for this i really needed it",
          "score": 1,
          "created_utc": "2026-02-06 23:00:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40zdfz",
          "author": "Ecaglar",
          "text": "point 8 about earning the right to paid ads is something most people skip. ive seen so many founders burn thousands on ads before they even know who their customer is. organic first forces you to understand what resonates before you scale it",
          "score": 1,
          "created_utc": "2026-02-07 04:14:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o416vyz",
          "author": "PerformanceTrue9159",
          "text": "This is going to have high churn rate - what happens once they have build SaaS ? They aren't going to come again",
          "score": 1,
          "created_utc": "2026-02-07 05:09:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o418qs6",
          "author": "harshamv",
          "text": "This is a really grounded list. The point about earning the right to paid ads and not being cheap with early hires like accounting is something people usually learn the hard way. Curious which one of these surprised you the most in hindsight after hitting 12k a month.",
          "score": 1,
          "created_utc": "2026-02-07 05:24:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41fbp4",
          "author": "h____",
          "text": "About validation, depends on who you are. If you're comfortable talking to strangers — do outreach first, find people with the problem, ask what they'd pay. You'll learn faster than building anything.\n\nIf you hate that (like me), ship something barely working and see if anyone bites. Even a landing page with a waitlist tells you something. Either way, don't wait until it's \"ready\" — the point is to get signal quickly.",
          "score": 1,
          "created_utc": "2026-02-07 06:18:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41fyu4",
          "author": "Playful-Pizza-5891",
          "text": "Love this list! It’s like a cheat sheet for anyone starting out. You mention keeping the product free, but that might not work for everyone. It depends on the niche...",
          "score": 1,
          "created_utc": "2026-02-07 06:23:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41n325",
          "author": "No_Boysenberry_6827",
          "text": "#19 hit me personally. getting that first paying customer felt impossible - then suddenly it clicked.\n\nmy previous product was technically solid but died on distribution. built for months, launched to crickets. the feedback loop when nobody's using it is brutal.\n\ncurrent project is the opposite - i focused on a problem i was living every day: sales outreach eating all my time. now my pipeline runs overnight and i wake up to meetings already booked. night and day difference when you solve your own pain first.\n\nthe validation point is underrated too. i could've saved months if i just talked to potential users before building.\n\nwhat's your split between building vs marketing time now that you're at $12k/mo?",
          "score": 1,
          "created_utc": "2026-02-07 07:28:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42505c",
          "author": "nezerwa",
          "text": "True",
          "score": 1,
          "created_utc": "2026-02-07 10:23:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o434036",
          "author": "gXzaR",
          "text": "feels like the kind of advice that makes sense after things work out. When you’re in it, everything’s a bit messier.",
          "score": 1,
          "created_utc": "2026-02-07 14:41:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o437ny4",
          "author": "47Industries",
          "text": "What I wish Id known before starting: customer validation is everything. Built features nobody wanted for months because I was in love with the idea instead of talking to real users. Now I validate every assumption first, even if it feels obvious. Way harder to pivot after youve already built the wrong thing.",
          "score": 1,
          "created_utc": "2026-02-07 15:01:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43swtr",
          "author": "atrumgeost",
          "text": "Struggling with number 5. Especially when things get messy, because then publishing gets cut out, and it’s hard for me to get back at it!",
          "score": 1,
          "created_utc": "2026-02-07 16:47:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44c696",
          "author": "pocketrob",
          "text": "#5. Post daily on all those sites is SUCH a slog. I absolutely burned myself out over a month, creating unique, research-validated content, and posting to Instagram.",
          "score": 1,
          "created_utc": "2026-02-07 18:22:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45q0is",
          "author": "silicoAI",
          "text": "Congrats on $12k! For cofounders, what do you think of YC’s cofounder search tool? Have you tried it?",
          "score": 1,
          "created_utc": "2026-02-07 22:45:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu0e4i",
      "title": "My exact distribution strategy I used to go from $0 to $600 MRR",
      "subreddit": "indiehackers",
      "url": "https://www.reddit.com/r/indiehackers/comments/1qu0e4i/my_exact_distribution_strategy_i_used_to_go_from/",
      "author": "RighteousRetribution",
      "created_utc": "2026-02-02 16:50:38",
      "score": 35,
      "num_comments": 137,
      "upvote_ratio": 0.95,
      "text": "I see a lot of people struggling with moving past the $100 MRR milestone, so I’m sharing the exact sequence I used to go from $0 to $600 without an audience or paid ads.\n\n**1) Getting the first customers**\n\nI didn’t create content or try to build an audience first. This is too slow. I didn’t even launch on Product Hunt (in fact I still haven’t launched there). Instead, I reached out directly to people who were clearly my target audience and offered them to try out my tool for free.\n\nThose conversations did two things at once:\n\n* I got people to try out my tool even tho I didn’t have any social proof\n* I got to understand exactly what kind of solution are they looking for\n\nOnce their free trial would end, I’d see if they convert. If not, I’d reach out again and ask why. All this feedback made me understand in which direction to take the product, how to position, and how to price. Whenever I’d get an insight, I’d implement it, and continue with reaching out to people. And eventually, I got my first couple of paying customers.\n\n**2) Getting to $100 MRR**\n\nThe approach above is how I got to $100 MRR and my first testimonials I could put on my landing page. But once I hit the $100 mark, I noticed something important: users were churning.\n\nSo instead of doing more outreach, I paused and switched focus to talking to people who canceled to understand why. Based on what they’d tell me, I’d implement changes, then go back to doing outreach to see if those changes actually made a difference. This loop of feedback + reiteration lasted 3 months.\n\nBy the end of it, I had:\n\n* better offer\n* better landing page\n* better activation\n* higher signups\n* lower churn\n\nAt this point, my funnel finally felt healthy, so it made sense to go all-in on marketing again.\n\n**3) Growing to $600 MRR**\n\nOnce the funnel felt healthy and users were actually sticking around, I went back to doing cold outreach and that alone got me to around $200 MRR.\n\nAt this point, I had a solid product, a working outreach system and had learned valuable strategies and insights I could share with my target audience. That’s when creating content started to make sense.\n\nI took real lessons and wins and started sharing them on X and Reddit. Since these lessons were based on my real experience, they were actually valuable and resonated with my audience. Those posts brought in more traffic and customers, which would give me new lessons and insights, which I could use to create new content. And this loop helped add $100 MRR every week.\n\nSo long story short, keep talking to your ideal customers, keep iterating on your offer, and keep repeating this until things click. Once they do, that’s when you start stacking other marketing channels.\n\nIf you want to see proof and the actual timeline of my growth, you can [see it here.](https://trustmrr.com/startup/bazzly)\n\nHappy to answer any questions or go deeper so you can apply this to your SaaS!",
      "is_original_content": false,
      "link_flair_text": "Sharing story/journey/experience",
      "permalink": "https://reddit.com/r/indiehackers/comments/1qu0e4i/my_exact_distribution_strategy_i_used_to_go_from/",
      "domain": "self.indiehackers",
      "is_self": true,
      "comments": [
        {
          "id": "o36l9x1",
          "author": "AutoModerator",
          "text": "This post has been reported to the moderators for review because it mentions **MRR**.\n\nIf you’re making an MRR/revenue claim, include proof.\nIf this is an opinionated article about another company, make that clear.\n\nIf there’s no proof for the claim and it isn’t a clearly opinionated/sourced article, it will be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/indiehackers) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 16:50:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i6jl0",
          "author": "skyler_outx",
          "text": "great work",
          "score": 7,
          "created_utc": "2026-02-04 09:56:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i7qwm",
              "author": "RighteousRetribution",
              "text": "Thanks man",
              "score": 1,
              "created_utc": "2026-02-04 10:07:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hinna",
          "author": "hey_yogini",
          "text": "Love this. We're at a similar stage (\\~$1k MRR). We did the same thing around month 3, noticed people signing up but dropping off during onboarding. Spent a week talking to churned users and understanding problem. Your \"feedback → iterate → outreach\" loop is exactly right. Right now our support channel is the best way to understand where product can improve. \n\nQuestion: at what point did you feel confident enough in your funnel to start content? We're at that crossover point now and trying to figure out the right mix of outreach vs content.",
          "score": 3,
          "created_utc": "2026-02-04 06:18:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i8bav",
              "author": "RighteousRetribution",
              "text": "Once all conversion points in my funnel were slightly above average for my cohort (other B2B early-stage tools) I doubled-down on marketing",
              "score": 1,
              "created_utc": "2026-02-04 10:12:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o36mhse",
          "author": "teced",
          "text": "how do you go about finding people to outreach? I'm struggling with that",
          "score": 2,
          "created_utc": "2026-02-02 16:56:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36oy48",
              "author": "RighteousRetribution",
              "text": "On X I'm doing it manually, on Reddit I'm using my tool Bazzly",
              "score": 3,
              "created_utc": "2026-02-02 17:07:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3bdx8h",
                  "author": "kriptonian_",
                  "text": "Don’t you think manual outreach is too slow and tedious",
                  "score": 1,
                  "created_utc": "2026-02-03 09:45:33",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3dr8gw",
                  "author": "lucamakes",
                  "text": "do you reply to comments on x or?",
                  "score": 1,
                  "created_utc": "2026-02-03 18:05:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3t6x50",
              "author": "whateverlolwtf",
              "text": "Use something like [agentjette.com](http://agentjette.com), it checks 5 social media platforms (X, reddit, Linkedin, Facebook and bluesky) 24/7 for potential leads. If your users aren't on one of those platforms then I don't know.",
              "score": 1,
              "created_utc": "2026-02-05 23:45:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o37f3zm",
          "author": "harshamv",
          "text": "This is actually solid and very real. The part about pausing at 100 MRR to fix churn instead of pushing more outreach is something most people skip. Curious what the biggest change was that reduced churn for you. Was it onboarding pricing or the core feature itself?",
          "score": 2,
          "created_utc": "2026-02-02 19:06:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37gph1",
              "author": "RighteousRetribution",
              "text": "It was improving my core offer, which made my tool more valuable and worth staying subscribed to.",
              "score": 2,
              "created_utc": "2026-02-02 19:13:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37i3n8",
                  "author": "harshamv",
                  "text": "That tracks. What did improving the core offer actually look like in practice though? Was it narrowing the use case, adding one must have feature, or changing how the value showed up early on?\n\nThis stays simple, invites specifics, and keeps the thread useful without sounding argumentative or promotional.",
                  "score": 1,
                  "created_utc": "2026-02-02 19:20:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o37143n",
          "author": "LibrarianOk1263",
          "text": "I'm currently in that phase of pausing outreach to fix churn.\n\nI’m way earlier (\\~€11 MRR), but decided to slow down distribution an sitting with power users to see how I can make value more clear, and how the features can tell a better story. After 300+ it was clear I needed to focus on retention rather than more signups.\n\nThe problem is: its very hard to get users to talk to you, and to simplify the tool I want their insights vs coming up with my own ideas.",
          "score": 1,
          "created_utc": "2026-02-02 18:03:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o372iev",
              "author": "RighteousRetribution",
              "text": "I know it's hard! I've been talking with users either via email or via DMs (if I initially reached out to them via DM).\n\nKeep going at it, you're doing the right thing focusing on churn instead of doing distribution. Fixing churn at the core is basically two things: make the tool more valuable, make the user get the value as fast as possible",
              "score": 2,
              "created_utc": "2026-02-02 18:09:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o378k2y",
                  "author": "LibrarianOk1263",
                  "text": "Spot on!",
                  "score": 1,
                  "created_utc": "2026-02-02 18:36:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o373x5u",
          "author": "SoftAd2420",
          "text": "impressive! although i see on X your engagement is quite low. does those low engagements ever converted? (struggling myself), also, i'll really appreciate if you could give me tips for my product [https://propelkit.dev](https://propelkit.dev)  \nsummary of the product : a a Next.js boilerplate which comes pre configured with auth, payments, multi-tenancy, credit system, emails, supabase for database, superadmin panel, AI project manager (claude is needed for this) you explain the product in layman langauage, it asks relevant questions (appropriate file system so it doesn't hallucinate), divides project into phases and builds upon the boilerplate, Loveable UI wrapper, which converts your loveable code to next.js",
          "score": 1,
          "created_utc": "2026-02-02 18:16:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o377kxy",
              "author": "ExtraDistribution95",
              "text": "Your product seems interesting !! \nKeep grinding",
              "score": 2,
              "created_utc": "2026-02-02 18:32:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o37ck2s",
              "author": "RighteousRetribution",
              "text": "Yeah, I don't have a big audience on X, but I'm posting there consistently and X is my 3rd biggest traffic channel despite that.\n\nTips for your project: find your ideal customers, and reach out to them. They'll give you the exact feedback you need. I'm not your ICP so I can't really give you useful product feedback apart from strategy. Your copy seems good tho!",
              "score": 1,
              "created_utc": "2026-02-02 18:54:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3dh78o",
                  "author": "Relevant-Ad-7577",
                  "text": "which is your biggest traffic channel ?",
                  "score": 1,
                  "created_utc": "2026-02-03 17:19:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3t7e08",
              "author": "whateverlolwtf",
              "text": "Indiehackers/build in public communities on X will be a huge goldmine for you honestly, would have been super happy to get my hands on your product when I first started coding, tried nextjs on my own and gave up and moved to java instead. You could search by keywords manually but it's honestly best if you use a lead finder like [agentjette.com](http://agentjette.com), this one checks 5 social media platforms for high intent leads, qualifies/segments the leads before sending them to you. Worth a try!!",
              "score": 1,
              "created_utc": "2026-02-05 23:48:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o375ql8",
          "author": "Icy_Pound1279",
          "text": "Great breakdown of your distribution journey! I’m curious—when you were doing that initial outreach, what channels did you find most effective, and how did you keep your messaging personal without spending tons of time per prospect?Great breakdown of your distribution journey! I’m curious—when you were doing that initial outreach, what channels did you find most effective, and how did you keep your messaging personal without spending tons of time per prospect?",
          "score": 1,
          "created_utc": "2026-02-02 18:24:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37dol8",
              "author": "RighteousRetribution",
              "text": "First I started by only doing manual outreach on X. I used a DM template like this one:  \n  \n*“Hey! Saw that you're* ***{specific problem they mentioned}****. I built a tool that* ***{very specific outcome tied to their problem}****. Want to try it out?”*\n\nNow I'm mostly sending DMs on Reddit using my tool, so the whole process is automated.",
              "score": 1,
              "created_utc": "2026-02-02 18:59:58",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3t7sal",
              "author": "whateverlolwtf",
              "text": "If time is an issue, I'd recommend automating your workflow. Reality is, lead finding can easily be automated pretty quickly with AI these days. Social listening tools are where it's at, because they check for leads for you all over the internet without you having to lift a finger. You can try something like [agentjette.com](http://agentjette.com), this one is my favourite since it pretty much checks at least 5 social media platforms for hot leads that are actively searching for your product making them likely to convert into paying customers.",
              "score": 1,
              "created_utc": "2026-02-05 23:50:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o37fajm",
          "author": "Great_Equal2888",
          "text": "The 3 months on churn before going back to marketing is the part most people skip or rush through. It's uncomfortable because it feels like you're not \"growing\" - but those conversations with churned users are where the real product decisions happen.\n\nOne thing I've noticed: the instinct is always to add features when retention is low. But from what you're describing, it sounds like the fixes were more about positioning and activation than building new stuff. Was that actually the case?",
          "score": 1,
          "created_utc": "2026-02-02 19:07:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37i4eq",
              "author": "RighteousRetribution",
              "text": "Yeah, during those 3 months I definitely felt like I'm not growing but I'm glad I kept at it because once I fixed my funnel growth suddenly exploded.\n\nThe #1 thing that fixed my retention was to improve my core offer. If I had been adding extra nice-to-have features I think that would have barely affected my retention and just made my user activation more difficult.",
              "score": 1,
              "created_utc": "2026-02-02 19:20:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37jd7t",
          "author": "Rahdtb",
          "text": "This is pretty good, and well done. I think I may need to try this out. Well done!",
          "score": 1,
          "created_utc": "2026-02-02 19:26:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37k8gp",
              "author": "RighteousRetribution",
              "text": "Thanks man!",
              "score": 1,
              "created_utc": "2026-02-02 19:30:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37oopa",
          "author": "Public-Salary1289",
          "text": "Love seeing this kind of growth! Direct outreach really can pay off if you put in the effort and listen to feedback.",
          "score": 1,
          "created_utc": "2026-02-02 19:51:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37qse8",
              "author": "RighteousRetribution",
              "text": "I think it's the best way to grow a new B2B SaaS",
              "score": 1,
              "created_utc": "2026-02-02 20:00:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37wf1h",
          "author": "Strong_Teaching8548",
          "text": "this is exactly how i approached things with zignalify too. the cold outreach phase was tbh brutal at first because you're basically asking strangers to trust an unproven tool, but it forced me to get really comfortable with rejection and, more importantly, it forced the product to actually solve real problems instead of what i thought were problems",
          "score": 1,
          "created_utc": "2026-02-02 20:27:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o380cgi",
              "author": "RighteousRetribution",
              "text": "Yeah, but I found being personal in DMs and offering a free trial helps makes it very easy for them to say yes.",
              "score": 1,
              "created_utc": "2026-02-02 20:46:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o383n6b",
                  "author": "Strong_Teaching8548",
                  "text": "💯",
                  "score": 1,
                  "created_utc": "2026-02-02 21:01:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o37y743",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 20:36:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o380hbe",
              "author": "RighteousRetribution",
              "text": "I started by finding them manually on X, now I use my tool to find and reach out to them on Reddit.",
              "score": 1,
              "created_utc": "2026-02-02 20:47:07",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o397yv8",
              "author": "Wide_Brief3025",
              "text": "Finding those early users can be tough. I focused on joining niche Reddit threads, LinkedIn groups, and relevant Quora topics, then engaged authentically before reaching out. If you want to streamline the process, something like ParseStream can help track conversations and alert you when those ideal leads pop up. Saved me a ton of time searching manually.",
              "score": 1,
              "created_utc": "2026-02-03 00:27:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o38gs9a",
          "author": "protomota",
          "text": "The part about pausing outreach to talk to churned users is something most people skip over, but it's probably the most important step in this whole sequence. Churn tells you more about product-market fit than signups ever will.\n\nI've seen so many founders (including myself early on) keep pushing marketing when the real problem is retention. You can always get more traffic, but if people aren't sticking around, you're just burning money.\n\nCurious how you structured those churn conversations. Did you do calls, or async messages? And how quickly after cancellation did you reach out?",
          "score": 1,
          "created_utc": "2026-02-02 22:04:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38ik9o",
              "author": "RighteousRetribution",
              "text": "I was sending emails or DMs, no calls. I reached out as soon as I saw that they've cancelled.",
              "score": 1,
              "created_utc": "2026-02-02 22:12:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o39vkue",
          "author": "Asleep-Work-5071",
          "text": "Ok got it",
          "score": 1,
          "created_utc": "2026-02-03 02:41:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3a08sk",
          "author": "Ecaglar",
          "text": "The 3-month pause to fix churn is the part most founders would skip. It's counterintuitive - feels like you're not growing. But pouring more users into a leaky bucket just means you're working harder to stay in the same place.\n\n  \nThe sequence matters too: direct outreach → fix churn → content. Most people try to do content first because it feels safer than cold outreach, but you end up writing content without understanding what actually resonates because you haven't talked to enough customers yet.\n\n  \nOne thing i'd add: the transition from outreach to content works because you've earned the insights. When you share \"lessons learned\" without the learning, it reads like generic advice. When you share lessons that cost you 3 months of churn conversations, people can tell the difference.\n\n  \nSolid playbook.",
          "score": 1,
          "created_utc": "2026-02-03 03:07:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3bd6hx",
              "author": "RighteousRetribution",
              "text": "Spot on.",
              "score": 1,
              "created_utc": "2026-02-03 09:38:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3a1il8",
          "author": "NucleusOS",
          "text": "the cold outreach loop you described is spot on. most people underestimate how much iteration it takes before the funnel stabilizes. congrats on the $600 MRR.",
          "score": 1,
          "created_utc": "2026-02-03 03:15:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3bd10j",
              "author": "RighteousRetribution",
              "text": "Yeah, building a product close to PMF from first try almost never happens (and it shouldn't unless you've launched later than you should have). Thanks!",
              "score": 1,
              "created_utc": "2026-02-03 09:36:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3arjbx",
          "author": "Ancient_Law_889",
          "text": "This is a reality check for many devs, including myself. We often hide behind 'launching' on PH instead of actually talking to users. Your focus on **fixing churn before scaling content** is the gold standard of SaaS growth. I'm currently building an AI tool, and I've been debating whether to focus on X/Reddit or direct outreach. This post just gave me the answer. Thanks for being so transparent with the numbers!",
          "score": 1,
          "created_utc": "2026-02-03 06:17:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3aso54",
              "author": "Wide_Brief3025",
              "text": "You might get a ton of valuable feedback and early users if you focus on real conversations where your audience hangs out. Reddit and direct outreach both have their place, but finding the right threads fast can get overwhelming. I found that using ParseStream saves a lot of time tracking keywords and surfacing good leads so you never miss relevant discussions.",
              "score": 1,
              "created_utc": "2026-02-03 06:26:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3bcrt5",
              "author": "RighteousRetribution",
              "text": "Glad it was helpful! Good luck growing your AI tool, just keep going at it!",
              "score": 1,
              "created_utc": "2026-02-03 09:34:14",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3t88mz",
              "author": "whateverlolwtf",
              "text": "Don't put your eggs in those two baskets alone, there are tools out there that check most social media platforms, or you'd be losing customers to competitors every single day. Try something like [agentjette.com](http://agentjette.com), this one actively searches X, Reddit, Linkedin, Facebook and bluesky for potential leads.",
              "score": 1,
              "created_utc": "2026-02-05 23:53:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3b68b3",
          "author": "WorthFan5769",
          "text": "this is a great breakdown, talk to users first, fix churn before scaling, then add content, solid reminder that marketing only works once the funnel is healthy, thanks for sharing the playbook",
          "score": 1,
          "created_utc": "2026-02-03 08:30:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3bcnlo",
              "author": "RighteousRetribution",
              "text": "Glad it was helpful!",
              "score": 1,
              "created_utc": "2026-02-03 09:33:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3b8i9u",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-02-03 08:52:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3bdgyh",
              "author": "RighteousRetribution",
              "text": "Damn, people stopped paying attention to their AI comments",
              "score": 1,
              "created_utc": "2026-02-03 09:41:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ba6go",
          "author": "Ok-Engine-172",
          "text": "I will try!!",
          "score": 1,
          "created_utc": "2026-02-03 09:08:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bu92r",
          "author": "m_zafar",
          "text": "How did you reduce churn?",
          "score": 1,
          "created_utc": "2026-02-03 12:08:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3bwwmi",
              "author": "RighteousRetribution",
              "text": "I made the tool more valuable",
              "score": 1,
              "created_utc": "2026-02-03 12:27:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3buynz",
          "author": "bizarro_kvothe",
          "text": "This matches my experience almost exactly. You always underestimate how hard getting that first revenue is. Especially the pause at $100 MRR to focus on churn and understanding cancellations. That loop is where most of the real learning happens.",
          "score": 1,
          "created_utc": "2026-02-03 12:13:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3bx6n7",
              "author": "RighteousRetribution",
              "text": "Definitely, that's when you actually build a product people want",
              "score": 1,
              "created_utc": "2026-02-03 12:29:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3cfb89",
                  "author": "bizarro_kvothe",
                  "text": "100%\n\nTop reason why I'm building Userjam - to help builders obsessed with tracking user behavior actually understand what's going on without refreshing meaningless dashboards",
                  "score": 1,
                  "created_utc": "2026-02-03 14:16:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3cyevq",
          "author": "Mir3x",
          "text": "I'm currenty looking for beta testers, I have not even market fitted the product yet, what do you suggested in that situation? Fighting with barehands on reddit and X?",
          "score": 1,
          "created_utc": "2026-02-03 15:52:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3dh422",
              "author": "RighteousRetribution",
              "text": "Find people on Reddit that you think are a great fit for your product and send them a personalized DM offering them to try out your tool for free. Once they do, you can follow up with feedback.",
              "score": 2,
              "created_utc": "2026-02-03 17:19:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3d3xik",
          "author": "BP041",
          "text": "This mirrors my experience almost exactly. The \"pause marketing to fix churn\" phase is the part most founders skip, and it's the reason they stay stuck at $100.\n\n  \nOne thing I'd add: the type of outreach matters. I've found that replying to people actively complaining about a problem (on Twitter, Reddit, forums) converts 5-10x better than cold DMs to people who fit a demographic. They've already admitted they have the pain.\n\n  \nThe content flywheel you described is real. Once you have actual wins to share, the content writes itself. Before that, most \"build in public\" content is just noise.\n\n  \nQuestion: when you were doing the initial outreach, how did you find the people to reach out to? Manual search or any tools/filters?",
          "score": 1,
          "created_utc": "2026-02-03 16:18:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3d7ge9",
              "author": "Wide_Brief3025",
              "text": "Manual search worked at first but it quickly got overwhelming trying to track so many conversations. Setting up filters for your target keywords is a big time saver. I eventually started using ParseStream to monitor relevant discussions across platforms and it automatically sent alerts for high intent posts, which helped me jump in at just the right moment.",
              "score": 1,
              "created_utc": "2026-02-03 16:34:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3dgtda",
              "author": "RighteousRetribution",
              "text": "Yeah, DMing people that are actively seeking for your solution converts way better. I'm not doing it manually anymore, I use my tool for that.",
              "score": 1,
              "created_utc": "2026-02-03 17:18:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3eii51",
          "author": "hectorguedea",
          "text": "This lines up a lot with what I’ve been experiencing too.\n\nI made the mistake before of thinking content or launch platforms would magically solve distribution. Talking to real users first changed everything.\n\nWith Mr. Popup, what worked early wasn’t scaling channels, it was seeing how people actually behaved once a popup was live. Did they engage? Did they act on it? That feedback loop was way reminded faster than analytics dashboards.\n\nAnd with Suippy (still validating), I’m deliberately staying in that “talk to people + watch intent” phase. I’m less interested in whether someone likes the idea and more in whether they try to sell something, set a price, or share a link.\n\nTotally agree that once the funnel feels healthy, content and broader distribution finally make sense. Before that, it’s mostly noise.\n\nCurious how long it took you to feel confident the funnel was “healthy enough” to go all-in again.",
          "score": 1,
          "created_utc": "2026-02-03 20:10:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ekrkv",
              "author": "RighteousRetribution",
              "text": "Took me 3 months of iteration until my funnel was healthy (all conversion points were slightly above average for my cohort)",
              "score": 1,
              "created_utc": "2026-02-03 20:21:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3eq56e",
                  "author": "hectorguedea",
                  "text": "That makes sense. Three months feels very realistic, especially if you’re actually iterating instead of just collecting data.\n\nI really like the “slightly above average across the funnel” framing. That’s been helpful for me with Mr. Popup too, where nothing suddenly “clicked”, but things got healthier one step at a time.\n\nIt’s easy to underestimate how long it takes for a funnel to stabilize when you’re solo and shipping + talking to users at the same time.\n\nThanks for sharing the timeline, that context is super useful.",
                  "score": 1,
                  "created_utc": "2026-02-03 20:47:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ep7j9",
          "author": "DevR4KA",
          "text": "It depends",
          "score": 1,
          "created_utc": "2026-02-03 20:42:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3fejd9",
          "author": "Pristine-Farm7249",
          "text": "will try out your first point for Twitter Growth platform [xengage.studio](http://xengage.studio)\n\ni also added a free trial for people to more offer better\n\nbecause I agree that posting and building audience feels too slow and I need validation and first wins\n\nthen i could learn, adjust and snowball",
          "score": 1,
          "created_utc": "2026-02-03 22:42:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ia3b6",
              "author": "RighteousRetribution",
              "text": "Yeah, start sending DMs, get people to try out your tool and reiterate based on feedback first",
              "score": 2,
              "created_utc": "2026-02-04 10:28:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3k24ct",
                  "author": "Pristine-Farm7249",
                  "text": "any advice on best way to find the perfect leads to DM on X/Reddit?",
                  "score": 1,
                  "created_utc": "2026-02-04 16:43:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3g0gt5",
          "author": "audiodesigndan",
          "text": "this is helpful to see what is the likely journey for most indiehackers. slowly, slowly and then suddenly all at once.",
          "score": 1,
          "created_utc": "2026-02-04 00:40:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i9qdy",
              "author": "RighteousRetribution",
              "text": "This was 100% the case for me lol",
              "score": 1,
              "created_utc": "2026-02-04 10:25:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3g54w1",
          "author": "Altruistic_Minimum94",
          "text": "This is super solid advice. Love it. You ever think about having creators market it also?",
          "score": 1,
          "created_utc": "2026-02-04 01:06:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i9mfe",
              "author": "RighteousRetribution",
              "text": "Yeah, I want to double down at affiliate marketing at some point in the future, but I'm still not there. Affiliate marketing works best when you've hit PMF.",
              "score": 1,
              "created_utc": "2026-02-04 10:24:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3gg5tl",
          "author": "Ecaglar",
          "text": "the 3 month pause to fix churn before going back to marketing is the part most people skip. its uncomfortable because it feels like youre not growing, but spending money to acquire users who leave is just burning cash with extra steps.the cold outreach to content pipeline also makes sense - you cant create useful content without real experience, and you cant get real experience without talking to users first. most people try to reverse this and wonder why their content falls flat",
          "score": 1,
          "created_utc": "2026-02-04 02:08:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i9cgi",
              "author": "RighteousRetribution",
              "text": "Spot on",
              "score": 1,
              "created_utc": "2026-02-04 10:21:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3gk4id",
          "author": "Full_Island6896",
          "text": "where did you find contacts/emails of your target audience",
          "score": 1,
          "created_utc": "2026-02-04 02:30:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i9a8k",
              "author": "RighteousRetribution",
              "text": "I wasn't sending emails, just DMs. I find my target audience on feeds on X or on subreddits on Reddit and send DMs so I can easily talk 1:1",
              "score": 1,
              "created_utc": "2026-02-04 10:21:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3gl6vp",
          "author": "h____",
          "text": "I've found answering questions in relevant subreddits works similarly to your step 1 -- you learn what language people use to describe their problems, which directly feeds into better positioning and landing page copy. And the ones who DM you after a helpful reply are warmer than any cold outreach lead.",
          "score": 1,
          "created_utc": "2026-02-04 02:36:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i9505",
              "author": "RighteousRetribution",
              "text": "Yeah, but people rarely DM you after a helpful reply, however you can DM them!",
              "score": 2,
              "created_utc": "2026-02-04 10:19:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hjdg7",
          "author": "chiranthgowdamax",
          "text": "Thanks for sharing this clear strategy. The focus on a single channel is smart. Congrats on the milestone!!!",
          "score": 1,
          "created_utc": "2026-02-04 06:24:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i7xuk",
              "author": "RighteousRetribution",
              "text": "Thanks! Hope this was helpful",
              "score": 1,
              "created_utc": "2026-02-04 10:08:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hu4g4",
          "author": "harshXgrowth",
          "text": "This is such valuable breakdown, especially the emphasis on pausing outreach to fix churn. It's so easy to get caught up in the chase for new users, but a leaky bucket just wastes effort. Your point about customer conversations driving real product decisions really resonates. \n\nIt's a tough but necessary step to build something truly sustainable. Thanks for sharing your transparent journey and insights, it's a great reminder for all of us building products.",
          "score": 1,
          "created_utc": "2026-02-04 07:58:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i7vc6",
              "author": "RighteousRetribution",
              "text": "Glad this was helpful! Keep iterating",
              "score": 1,
              "created_utc": "2026-02-04 10:08:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3i2a60",
          "author": "Imaginary_Estimate73",
          "text": "Cool",
          "score": 1,
          "created_utc": "2026-02-04 09:15:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3iesae",
          "author": "Ok-Active9414",
          "text": "This really resonates. The part about pausing outreach to fix churn is something most people skip, and it's probably the most important step.\n\nI'm building a native Mac/iOS app right now and went through a similar loop. My first version had decent signups but terrible retention because I built what I *thought* users wanted instead of what they actually needed. Spent two months just doing calls with churned users and realized the core problem was completely different from what I assumed.\n\nThe content flywheel you describe in step 3 is real. Once you have genuine stories from building and iterating, the content basically writes itself. I started sharing little workflow tips related to my app's problem space on Reddit and Twitter, and it brings in way more qualified leads than any cold outreach I've done.\n\nOne thing I'd add: for mobile/desktop apps specifically, App Store optimization compounds nicely alongside the content strategy. Good reviews from your early feedback-loop users give you a foundation that keeps working even when you're not actively marketing.",
          "score": 1,
          "created_utc": "2026-02-04 11:10:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3j02wj",
              "author": "RighteousRetribution",
              "text": "Spot on! If you're building an app or browser extension, you should build a strategy around getting reviews right from the start.",
              "score": 1,
              "created_utc": "2026-02-04 13:36:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3iu6g8",
          "author": "CodeAndFounder",
          "text": "Man this is exactly what I needed to read. Been stuck trying to \"build an audience\" for my app when I should just be talking to users facepalm\n\nThe feedback loop you mentioned is brilliant. Did you find certain channels worked better for cold outreach than others? Or was it just volume game?\n\nAppreciate you dropping this knowledge",
          "score": 1,
          "created_utc": "2026-02-04 13:02:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3izeni",
              "author": "RighteousRetribution",
              "text": "Glad to hear this was valuable man! X used to be a great outreach channel, but after they changed how DMs work the reply rate is very low (people don't get notified when you DM them). Right now Reddit is a great channel because it's easy to find people who are actively looking for a solution your app provides, and with a good personalized DM you can get around 30% reply rates. I haven't tried other platforms, but LinkedIn, Facebook, etc. might be good channels too.",
              "score": 1,
              "created_utc": "2026-02-04 13:32:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3j2mw3",
                  "author": "CodeAndFounder",
                  "text": "30% reply rate is wild lol\n\nI've been in cultivation communities for years and built an app specifically because I couldn't find anything that handles data privacy properly for growers. The cloud-based tracking apps just don't work for this niche. But I've been hesitating to engage on Reddit cause it feels intrusive to DM people about my own app.\n\nYour strategy makes sense though - find people actively looking for solutions instead of just cold outreach everyone. Quick Q - how long after someone comments do you reach out? Immediately? Or do you wait a bit?\n\nAlso what's in your DMs? Just \"hey saw your comment, might be able to help\"? Or something different?\n\nAppreciate the real numbers here, most people don't share actual stats.",
                  "score": 1,
                  "created_utc": "2026-02-04 13:50:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3k3qsk",
          "author": "soham512",
          "text": "How you got $200 MRR by cold outreach?",
          "score": 1,
          "created_utc": "2026-02-04 16:50:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3k8zp7",
              "author": "RighteousRetribution",
              "text": "I used my tool to help me automate finding leads and DMing, otherwise it'd have been really hard doing this consistently",
              "score": 1,
              "created_utc": "2026-02-04 17:14:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3kdavy",
                  "author": "Wide_Brief3025",
                  "text": "Automating your outreach is honestly a game changer for staying consistent and not burning out while hunting for leads. I’ve found that tracking specific keywords and joining discussions at the right time makes a huge difference. If you want to catch those opportunities across Reddit and even Quora or LinkedIn, ParseStream can help you spot good leads and jump in instantly.",
                  "score": 1,
                  "created_utc": "2026-02-04 17:35:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3l9x7d",
          "author": "Quick_Pair_3249",
          "text": "Wow this is great advice. Find customer, offer them free trial and talk to them if they dont signup.",
          "score": 1,
          "created_utc": "2026-02-04 20:04:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p007c",
              "author": "RighteousRetribution",
              "text": "Hope it was valuable!",
              "score": 1,
              "created_utc": "2026-02-05 10:24:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3n6x7q",
          "author": "Ecaglar",
          "text": "the pause at 100 mrr to fix churn is the part most people wont do because it feels like going backwards. but pouring more people into a leaky funnel just means you burn through your market faster. the feedback loop with churned users is brutal but thats where all the real product decisions come from",
          "score": 1,
          "created_utc": "2026-02-05 02:04:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3oyui3",
              "author": "RighteousRetribution",
              "text": "Yeah, my growth stalled during these 3 months fixing churn, but after that it suddenly exploded",
              "score": 1,
              "created_utc": "2026-02-05 10:13:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3nx3em",
          "author": "Money-Present-2731",
          "text": "Thanks for sharing. I think the first step you're talking about definitely works. Will try it soon",
          "score": 1,
          "created_utc": "2026-02-05 04:43:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3oymts",
              "author": "RighteousRetribution",
              "text": "Good luck, hope this was helpful",
              "score": 1,
              "created_utc": "2026-02-05 10:11:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3obwbl",
          "author": "Useful-Process9033",
          "text": "What much time do you spend on outreach vs building?",
          "score": 1,
          "created_utc": "2026-02-05 06:37:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p8o9q",
          "author": "WorthFan5769",
          "text": "solid playbook, outreach first to validate then content once you have proof is way smarter than building audience from zero, three months of churn iteration before scaling is the patience most founders skip, what niche is your saas in and how did you find your outreach targets initially",
          "score": 1,
          "created_utc": "2026-02-05 11:40:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ph75u",
              "author": "RighteousRetribution",
              "text": "My niche is early-stage SaaS founders looking to get customers from Reddit.\n\nI first started finding founders on X through communities or through posts of bigger creators. Now I just use my tool to find and DM my ideal users on Reddit",
              "score": 2,
              "created_utc": "2026-02-05 12:42:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pokci",
          "author": "False_Ad8389",
          "text": "that's pretty awesome\n\n",
          "score": 1,
          "created_utc": "2026-02-05 13:28:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q703y",
          "author": "Ok_Oil_1874",
          "text": "Just finished my mvp and i am ready to market. I have begun scouring reddit, x, and dev and indie hacker ect. These channels seem like yelling into the abyss lol.. would you recommend to continue posting to the normal channels or no??",
          "score": 1,
          "created_utc": "2026-02-05 15:07:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3r4lyh",
              "author": "RighteousRetribution",
              "text": "I recommend sending DMs to your target audience instead of creating content at this stage. Find your ideal customers on X and Reddit and send them a personalized DM with your offer. Then use these conversations to get as much feedback as you can",
              "score": 1,
              "created_utc": "2026-02-05 17:45:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3t1wsm",
                  "author": "Ok_Oil_1874",
                  "text": "Hey thanks for the reply. I am scouring and just got banned from stripe for offering to help with webhooks lol. I will figure out the algorithm. Great advice and thanks again for responding.",
                  "score": 1,
                  "created_utc": "2026-02-05 23:17:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3s3ixg",
          "author": "Defiant_Bug4117",
          "text": "This is a massive help good to see the process",
          "score": 1,
          "created_utc": "2026-02-05 20:26:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3sat45",
              "author": "RighteousRetribution",
              "text": "Glad to hear it was helpful",
              "score": 1,
              "created_utc": "2026-02-05 21:01:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3t8vqf",
          "author": "j12usedfor",
          "text": "applaud the hustle",
          "score": 1,
          "created_utc": "2026-02-05 23:56:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vic7c",
              "author": "RighteousRetribution",
              "text": "Thanks man, no way around it",
              "score": 1,
              "created_utc": "2026-02-06 09:38:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wdyzr",
          "author": "Outrageous_Phrase320",
          "text": "The 3-month loop to fix churn before scaling is the most underrated advice here. Most people just throw more ads at a leaky bucket and wonder why they're broke.\n\nWhen you reached out to people who canceled, what was the 'magic question' you asked that actually got them to reply? I find that most churned users just ghost you completely.",
          "score": 1,
          "created_utc": "2026-02-06 13:37:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3x9ywe",
              "author": "RighteousRetribution",
              "text": "There was no magic question. Since I've been manually reaching out to people when they sign up to ask them about their product and how I can help them (or sometimes they reach out to me), we already had a conversation going, so I'd just casually ask them why they cancelled so I can improve my tool. Sometimes they don't reply back, but sometimes they do.",
              "score": 1,
              "created_utc": "2026-02-06 16:18:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wuvtc",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-06 15:05:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3xa8ps",
              "author": "RighteousRetribution",
              "text": "I'm using my tool that finds and sends DMs to my target audience automatically. If you want to do it manually, you can go to subreddits where your target audience hangs out and find posts where they ask for tools like yours or describe problems your tool solves, and then use the post context to send a personalized DM.",
              "score": 1,
              "created_utc": "2026-02-06 16:19:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o43mnl1",
          "author": "selldomdom",
          "text": "thats actually really helpful. thanks for sharing. ",
          "score": 1,
          "created_utc": "2026-02-07 16:16:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o43s3mo",
              "author": "RighteousRetribution",
              "text": "Np, glad to hear it was helpful",
              "score": 1,
              "created_utc": "2026-02-07 16:43:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o36vt4h",
          "author": "mika_gremlin",
          "text": "This is the playbook that actually works. Direct outreach + feedback loops beats content marketing for early traction every time.\n\nThe key insight here is the feedback part — most people spam outreach and ghost when people say no. But you turned rejections into product intel. Thats gold.\n\nQuestion: how did you identify who to reach out to initially? Did you scrape forums, use LinkedIn, or something else?\n\nAlso curious about the conversion rate from free trial to paid once you had that initial feedback loop dialed in.",
          "score": 0,
          "created_utc": "2026-02-02 17:39:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o371y9h",
              "author": "RighteousRetribution",
              "text": "Whenever someone creates a post explicitly asking for a tool like mine, or describes a problem my tool solves, then they are an ideal person to reach out to since they're actively looking for a solution that my tool provides. You can find these people manually, but on Reddit I use my own tool which finds them for me automatically.\n\nMy current trial to paid is 37%.",
              "score": 1,
              "created_utc": "2026-02-02 18:07:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37fcsj",
                  "author": "mika_gremlin",
                  "text": "37% trial to paid is solid! And building your own tool to find leads automatically is the smart move — you're basically dogfooding your own product for distribution.\n\nThe \"people actively looking for a solution\" angle is key. Cold outreach to random people has terrible conversion but reaching out when they just posted about the exact problem you solve is completely different.\n\nThanks for sharing the specifics, really helpful.",
                  "score": 1,
                  "created_utc": "2026-02-02 19:07:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o37pnvp",
              "author": "Wide_Brief3025",
              "text": "I found that targeting users posting or commenting about specific pain points on relevant forums worked way better than just scraping random lists. Tweak your outreach based on their questions so replies stay personal. For surfacing these leads fast, ParseStream can track key discussions across Reddit and LinkedIn which saves a ton of time on manual searching.",
              "score": 1,
              "created_utc": "2026-02-02 19:55:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qtxrxv",
      "title": "20 startup ideas reverse‑engineered from successful startup",
      "subreddit": "indiehackers",
      "url": "https://www.reddit.com/r/indiehackers/comments/1qtxrxv/20_startup_ideas_reverseengineered_from/",
      "author": "Hefty-Airport2454",
      "created_utc": "2026-02-02 15:17:02",
      "score": 33,
      "num_comments": 73,
      "upvote_ratio": 1.0,
      "text": "The pattern is simple, combine categories people love and make a product out of it.\n\nEvery combo below appeared multiple times in recent launches and averaged significantly above-median upvotes. I scrap daily 400+ startup data on [startuphunt.io](http://startuphunt.io) for my newsletter.\n\nEach idea follows that exact structure so you get distribution, clarity, and a built-in positioning story from day one.\n\n(app ideas purely invented feel free to copy that, if they do ... my bad).\n\n* **Email | Marketing | SaaS:** A B2B tool that scores every email campaign by revenue generated per segment and recommends the next campaign to send.\n* **Analytics | SaaS | Tech:** A unified dashboard that connects to your SaaS stack (billing, product, CRM) and highlights which features and cohorts drive MRR and retention.\n* **Marketing | SEO | Search:** A planner that clusters keywords by user intent and suggests landing page structures and internal links to own each cluster.\n* **Chrome Extensions | Design Tools | Developer Tools:** A browser extension that lets you point‑and‑click live UIs, extract styles/components, and export them into your design system.\n* **Social Media | Marketing | Growth Hacking:** A tool that turns each post into a mini funnel (hook, lead magnet, DM script) and auto‑tests variants to grow followers and leads.\n* **Design Tools | User Experience | Icons:** An icon system that adapts automatically to your product’s tone (playful, serious, fintech, health) and exports ready‑to‑ship sets.\n* **Productivity | Meetings | Calendar:** A calendar companion that scores every meeting on cost vs outcome, auto‑suggests cancellations, and enforces agendas and time boxes.\n* **Health & Fitness | Artificial Intelligence | Fitness:** A training app that adjusts workouts in real time based on past sessions, sleep, and soreness instead of a static program.\n* **Productivity | Writing | Notes:** A notes app that turns raw notes into clean outlines, tweets, and blog post drafts grouped by topic.\n* **iOS | Health & Fitness | Productivity:** An iOS app that embeds 10‑second wellness actions into existing routines like unlocking your phone or opening certain apps.\n* **SaaS | Artificial Intelligence | No-Code:** A no‑code builder where ops teams design workflows and an AI layer generates the logic, integrations, and error handling.\n* **Fintech | Investing | Artificial Intelligence:** An investing copilot that summarizes portfolio risk, proposes small weekly rebalances, and blocks emotional trades with behavioral nudges.\n* **Productivity | Task Management | Calendar:** A planner where you define time budgets for goals (build, sell, learn) and the calendar dynamically enforces those allocations.\n* **Chrome Extensions | Productivity | Notion:** A browser extension that saves pages, highlights, and screenshots directly into structured Notion databases with tags and relations.\n* **Web App | Productivity | Artificial Intelligence:** A browser‑based workspace that pulls tasks from multiple tools and uses an assistant to propose the single next best task per focus block.\n* **Mac | Productivity | Artificial Intelligence:** A Mac menu bar assistant that watches window/app usage and suggests automations (shortcuts, scripts, focus modes) proactively.\n* **API | Payments | Developer Tools:** A unified payments API that normalizes Stripe, Paddle, PayPal, and app stores so developers query “MRR, churn, LTV” with one schema.\n* **Privacy | Developer Tools | Security:** A dev tool that scans code, logs, and configs in CI/CD to prevent secret leakage and enforce privacy/security policies automatically.\n* **Android | iOS | Productivity:** A mobile hub that aggregates metrics (revenue, analytics, socials) and lets founders trigger key actions like refunds, replies, and deploys from one place.\n* **Chrome Extensions | Productivity | Social Media:** A browser extension to draft, schedule, and repurpose threads across multiple networks from any tab, with performance stats inline.\n\nOpen for criticism on my technique or any questions!",
      "is_original_content": false,
      "link_flair_text": "Knowledge post",
      "permalink": "https://reddit.com/r/indiehackers/comments/1qtxrxv/20_startup_ideas_reverseengineered_from/",
      "domain": "self.indiehackers",
      "is_self": true,
      "comments": [
        {
          "id": "o3617xp",
          "author": "AutoModerator",
          "text": "This post has been reported to the moderators for review because it mentions **MRR**.\n\nIf you’re making an MRR/revenue claim, include proof.\nIf this is an opinionated article about another company, make that clear.\n\nIf there’s no proof for the claim and it isn’t a clearly opinionated/sourced article, it will be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/indiehackers) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 15:17:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o369qdk",
          "author": "Quick_Pair_3249",
          "text": "This can be really useful:\n\n* **Marketing | SEO | Search:** A planner that clusters keywords by user intent and suggests landing page structures and internal links to own each cluster.\n\nanything like it that already exists?",
          "score": 3,
          "created_utc": "2026-02-02 15:57:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36bakt",
              "author": "No-Fun-5974",
              "text": "Some tools already do parts of this, like keyword clustering or content outlines (Surfer, Frase, etc.), but I have not seen many that also handle landing page structure *and* internal linking in one place. Most stop at one side of the workflow.",
              "score": 2,
              "created_utc": "2026-02-02 16:04:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o36bw9m",
                  "author": "Quick_Pair_3249",
                  "text": "I just looked at both surfer and frase... looks nice but it has too many features",
                  "score": 2,
                  "created_utc": "2026-02-02 16:07:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o36a195",
              "author": "Hefty-Airport2454",
              "text": "I mean, I don't think so, not from my dataset at least.\n\nNot the easiest idea but for sure it's cool",
              "score": 1,
              "created_utc": "2026-02-02 15:58:55",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3aks01",
              "author": "jim0u",
              "text": "I’ve been building a small GSC-native tool in this exact space, mainly because I kept running into cannibalisation issues that didn’t show up until you cluster *actual* Search Console queries by intent.\n\nMost tools do clustering or content optimisation, but very few help answer the page-level decisions (what to merge, what should win, what page should exist).\n\nEarly takeaway for me: the hard part isn’t generating content, it’s deciding which page deserves it.",
              "score": 1,
              "created_utc": "2026-02-03 05:23:21",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3ogvog",
              "author": "Altruistic_Minimum94",
              "text": "I know some do. A client that I had was looking for this but we never fully went and built it out. ",
              "score": 1,
              "created_utc": "2026-02-05 07:21:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o36gzef",
          "author": "ruibranco",
          "text": "The \"combine categories\" pattern is basically what every successful indie product does whether they realize it or not. Notion is notes + databases + project management. Linear is issue tracking + design system. The trick is knowing which combinations create genuine value vs which ones are just feature bloat. The unified payments API idea is probably the most buildable one here - every SaaS founder I know has dealt with the pain of normalizing data across Stripe, Paddle, and LemonSqueezy.",
          "score": 3,
          "created_utc": "2026-02-02 16:31:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37dv3g",
              "author": "Hefty-Airport2454",
              "text": "They do it, but I assure you that 90% of launches is either : full broad labels, too many, or too few.\n\nWe know but when it comes to execute it's always different.",
              "score": 1,
              "created_utc": "2026-02-02 19:00:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3httvp",
                  "author": "bonzo_bcn",
                  "text": "Is this api just for analytics or for managing payments through one unified api?",
                  "score": 2,
                  "created_utc": "2026-02-04 07:55:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o37lf9j",
          "author": "harshamv",
          "text": "The pattern makes sense but the risky part feels like stopping at category mashups. Distribution and positioning come from the pain, not just the combo. Curious how you pressure test which of these actually has a sharp buyer pain versus just sounding cool on paper.",
          "score": 2,
          "created_utc": "2026-02-02 19:35:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c6ae6",
              "author": "Hefty-Airport2454",
              "text": "I agree, it's just a reversed-engineering technique. Simple so unperfect for sure.",
              "score": 1,
              "created_utc": "2026-02-03 13:26:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o383z61",
          "author": "Alternative-Theme885",
          "text": "i've been playing around with combining categories like this for a side project and it's crazy how often it results in something that sounds like a real startup idea, even if it's not always practical or useful",
          "score": 2,
          "created_utc": "2026-02-02 21:03:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c6gyb",
              "author": "Hefty-Airport2454",
              "text": "It does ! And you come up with good ideas. By good I mean : niches enough and simple feature speaking.",
              "score": 1,
              "created_utc": "2026-02-03 13:27:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o38t2r2",
          "author": "Downtown-Celery3173",
          "text": "This is a good idea: \n\n* **Health & Fitness | Artificial Intelligence | Fitness:** A training app that adjusts workouts in real time based on past sessions, sleep, and soreness instead of a static program.\n\nJust a lot of competition there.",
          "score": 2,
          "created_utc": "2026-02-02 23:06:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c725w",
              "author": "Hefty-Airport2454",
              "text": "There is. Depends if you niche on a specific sport community. My friend is doing something for streetlifting for example. (without the sleep thing)",
              "score": 2,
              "created_utc": "2026-02-03 13:31:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3ohdv1",
                  "author": "Altruistic_Minimum94",
                  "text": "I wanted to do one for my favorite sport as well. Great great idea. ",
                  "score": 1,
                  "created_utc": "2026-02-05 07:26:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3a44zp",
          "author": "Sharp_Animal",
          "text": "love this pattern spotting - combos are great, but i’d pressure test the riskiest assumption per idea first. my quick loop: 1 pager with who/pain/outcome + a fake door + 5 target user calls in 48h, and pick the one with built in distribution via an existing weekly workflow. i’ve been building smarter.day around the planner/time budgets angle and learned the AI scoring took alot of experimentation, so starting with simple rules before fancy models saved me.",
          "score": 2,
          "created_utc": "2026-02-03 03:31:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c7mt0",
              "author": "Hefty-Airport2454",
              "text": "Ofc normally you start with pain points.\n\nMy method is simple but imperfect, still give super cool project ideas.\n\nLike your process !",
              "score": 1,
              "created_utc": "2026-02-03 13:34:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3bmn31",
          "author": "botapoi",
          "text": "this is solid, the category combo approach makes sense for positioning but curious if you've noticed any patterns in which combos actually convert to paying users vs just getting upvotes. feels like startuphunt engagement doesn't always correlate with product market fit",
          "score": 2,
          "created_utc": "2026-02-03 11:06:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c88fp",
              "author": "Hefty-Airport2454",
              "text": "Simple method, unperfect but I love the ideas that it creates.\n\nwhat do you mean by : \"feels like startuphunt engagement doesn't always correlate with product market fit\" ?",
              "score": 1,
              "created_utc": "2026-02-03 13:37:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3g5j3z",
          "author": "Altruistic_Minimum94",
          "text": "I was creating this actually with a co-founder. \n\n\n\n**Email | Marketing | SaaS:** A B2B tool that scores every email campaign by revenue generated per segment and recommends the next campaign to send. \n\nI love this whole thread!",
          "score": 2,
          "created_utc": "2026-02-04 01:08:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lvnlk",
              "author": "Hefty-Airport2454",
              "text": "ahah Thanks.\n\nYou had a good idea. double down on it man !",
              "score": 1,
              "created_utc": "2026-02-04 21:48:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3ly077",
                  "author": "Altruistic_Minimum94",
                  "text": "Tbh, it was my friend's idea who works in Email marketing so idk anything about it lol\n\nI was the one developing it and his idea. I think I'd be better suited in an app where I know it better? ",
                  "score": 1,
                  "created_utc": "2026-02-04 21:59:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3g64ay",
          "author": "Altruistic_Minimum94",
          "text": "* **API | Payments | Developer Tools:** A unified payments API that normalizes Stripe, Paddle, PayPal, and app stores so developers query “MRR, churn, LTV” with one schema.\n\nI really like this idea. I love anything payment related and would love to try this.",
          "score": 2,
          "created_utc": "2026-02-04 01:11:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lvsx0",
              "author": "Hefty-Airport2454",
              "text": "It's very shareable and touches money. Datafast but for mail like.",
              "score": 1,
              "created_utc": "2026-02-04 21:48:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3m0581",
                  "author": "Altruistic_Minimum94",
                  "text": "Would you say that this is tough because since it deals with payments there are regulations or any privacy things I’d need to be wary of?",
                  "score": 1,
                  "created_utc": "2026-02-04 22:09:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3gpyi8",
          "author": "Embarrassed_Wafer438",
          "text": "So useful ideas!! Very helpful for everyone here!! 👍 👍 👍",
          "score": 2,
          "created_utc": "2026-02-04 03:03:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lvxwt",
              "author": "Hefty-Airport2454",
              "text": "Will you pick one ? or you already have your thingy",
              "score": 1,
              "created_utc": "2026-02-04 21:49:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3huq8k",
          "author": "BP041",
          "text": "Great post! Reverse-engineering successful startups is a brilliant way to brainstorm ideas. One approach I find useful is to analyze their user feedback—understanding what customers love and what pain points remain can inspire unique variations on those concepts. Additionally, considering emerging trends and technologies can help you tailor these ideas to modern needs. What aspects of the successful startups do you find most intriguing?",
          "score": 2,
          "created_utc": "2026-02-04 08:04:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lwcyw",
              "author": "Hefty-Airport2454",
              "text": "I would add some actual pain points instead. But it requires an other dataset or researches ahah\n\nSuccessful startup ? Their crystal-clear messaging",
              "score": 1,
              "created_utc": "2026-02-04 21:51:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ivcp0",
          "author": "CodeAndFounder",
          "text": "This is gold 🪄 The \"combine two categories\" insight is so simple but somehow I never thought about it like that. Built my app in a niche I've been part of for years (mushroom cultivation) and didn't realize until now that I basically combined \"offline-first + privacy + productivity\" and that became the whole brand identity.\n\nYour fitness idea that adjusts workouts based on sleep/soreness is actually insane. Would pay for that ngl.\n\nQuestion though - with all the AI trends you're seeing, how do you spot what's actually gonna stick vs what's just hype? Some of these feel very 2026-cycle if that makes sense?\n\nDef following your newsletter, need more of this analysis lol",
          "score": 2,
          "created_utc": "2026-02-04 13:09:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lwtv0",
              "author": "Hefty-Airport2454",
              "text": "I love the enthousiasm here.\n\nThat's a way simple, unperfect to find ideas. I loved the process. I'll more of these type I think.\n\nI don't spot what sticks honestly. But I try to find how to give you all the chances to",
              "score": 1,
              "created_utc": "2026-02-04 21:53:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3oc130",
          "author": "Useful-Process9033",
          "text": "do you have any insights on dev tools? If feels like a hard crowd to please",
          "score": 2,
          "created_utc": "2026-02-05 06:38:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ov6e0",
              "author": "Hefty-Airport2454",
              "text": "I will probably do an analysis on my newsletter. it's a big study  you ask here ahah",
              "score": 2,
              "created_utc": "2026-02-05 09:38:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3rttm2",
          "author": "hectorguedea",
          "text": "This is a solid way to reduce randomness early on.\n\nCombining proven categories definitely helps with distribution and clarity, especially for launches. You start with a story people already understand instead of teaching them from zero.\n\nOne thing I’d add though: category combos get you *attention*, but pain depth is what gets you *retention*.\n\nTwo products can live in the same combo and still have wildly different outcomes depending on how specific the problem is.\n\nAs a starting framework, this is great. Just needs a strong “who is this painfully for?” layer on top.",
          "score": 2,
          "created_utc": "2026-02-05 19:40:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xzh6m",
          "author": "BearInevitable3883",
          "text": "[https://chromewebstore.google.com/detail/ui-capture-by-landinghero/kdnhhppnjcfeedmlblmibigilaokfohd](https://chromewebstore.google.com/detail/ui-capture-by-landinghero/kdnhhppnjcfeedmlblmibigilaokfohd)  \n  \n**Chrome Extensions | Design Tools | Developer Tools:** A browser extension that lets you point‑and‑click live UIs, extract styles/components, and export them into your design system.\n\nthank me later!",
          "score": 2,
          "created_utc": "2026-02-06 18:19:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4212gv",
              "author": "Hefty-Airport2454",
              "text": "it does exist ahah. Good finding",
              "score": 1,
              "created_utc": "2026-02-07 09:44:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ycwci",
          "author": "SoloNM8",
          "text": "How do you generate and validate ideas?",
          "score": 2,
          "created_utc": "2026-02-06 19:23:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o421moe",
              "author": "Hefty-Airport2454",
              "text": "reverse-engineer on what work and some formula from winners on product hunt.\n\nFind out categories into the tagline from it.\n\nI detail here : [https://startuphunt.io/before-you-launch](https://startuphunt.io/before-you-launch) \n\nit's very \"simple\" and unperfect but the idea that come from it are so cool",
              "score": 1,
              "created_utc": "2026-02-07 09:50:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o44blbh",
                  "author": "SoloNM8",
                  "text": "Thanks, that's useful",
                  "score": 2,
                  "created_utc": "2026-02-07 18:19:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4529u8",
          "author": "Any-Scheme5954",
          "text": "That's a great idea. I feel that when working at a startup, I use many different tools for different aspects of my work, which is really inconvenient. It would be great to have a dashboard that integrates all the tools, but that might result in each function being mediocre. It's a tough problem.",
          "score": 2,
          "created_utc": "2026-02-07 20:36:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o366i2m",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 15:42:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3689vq",
              "author": "Hefty-Airport2454",
              "text": "The more narrow (i prefere using niche) the easier it is to market and easier to understand what you offer for sure",
              "score": 2,
              "created_utc": "2026-02-02 15:50:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o368wmd",
                  "author": "No-Fun-5974",
                  "text": "Yep, niche is the right word. Starting narrow makes positioning and marketing much easier. You can always expand later once you have nailed one real pain point.",
                  "score": 2,
                  "created_utc": "2026-02-02 15:53:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3apw4w",
          "author": "Ancient_Law_889",
          "text": "This is a goldmine for solopreneurs. The 'Chrome Extension + Notion' combo (#14) is still under-exploited, IMO. People live in their browsers but want their 'brain' in Notion. Creating a seamless bridge there is a money printer. Thanks for sharing the reverse-engineered patterns!",
          "score": 1,
          "created_utc": "2026-02-03 06:03:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c7sw7",
              "author": "Hefty-Airport2454",
              "text": "Ahah, happy you like it. It's a simple unperfect method but it gives out good ideas.",
              "score": 1,
              "created_utc": "2026-02-03 13:35:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3b6cnl",
          "author": "WorthFan5769",
          "text": "this is a strong framework, the combo-first thinking + built-in distribution angle is smart, feels practical, not random idea dumping, curious to see which of these you’re most bullish on",
          "score": 1,
          "created_utc": "2026-02-03 08:31:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c7xij",
              "author": "Hefty-Airport2454",
              "text": "I mean, to be bullish on, I prefer dig on where the real pain points are. I stopped believing in ideas to be successful ahah.",
              "score": 1,
              "created_utc": "2026-02-03 13:36:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3bspmv",
          "author": "ruibranco",
          "text": "the methodology here is more valuable than the specific ideas. scraping what categories overlap in successful launches and reverse-engineering the positioning is a legit framework. most people start with \"what can I build\" instead of \"what patterns are already winning.\" the unified payments API one (Stripe + Paddle + PayPal normalization) actually feels like it has real pull - every SaaS founder I know hates dealing with multiple payment providers and would pay for a clean abstraction layer.",
          "score": 1,
          "created_utc": "2026-02-03 11:56:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c8gsl",
              "author": "Hefty-Airport2454",
              "text": "Thanks ! Still a simple unperfect method but I love it.",
              "score": 1,
              "created_utc": "2026-02-03 13:39:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3btofs",
          "author": "m_zafar",
          "text": "thanks for sharing",
          "score": 1,
          "created_utc": "2026-02-03 12:03:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cdopt",
          "author": "ryan_mcleod",
          "text": "Love the \"combine categories people love\" framework - way simpler than trying to invent something from scratch (which is basically what I did with Memflect haha). Looking at your list though, the ones that stand out are the ones solving a specific frustration people already have, not just combining two cool things. Like the meeting scorer - everyone already hates pointless meetings. The frustration exists before the product does.  \n  \nThat's honestly what I got wrong early on with my own thing. I built something cool first and then went looking for the audience. Painful lesson ;) Which of these 20 are YOU actually going to build or is this purely a data exercise? Curious what your newsletter looks like. ✌️",
          "score": 1,
          "created_utc": "2026-02-03 14:07:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3fbzhb",
          "author": "Mental_Bug_3731",
          "text": "What do you think is the most underrated/low competition one amongst all?",
          "score": 1,
          "created_utc": "2026-02-03 22:29:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lvcmy",
              "author": "Hefty-Airport2454",
              "text": "Well I don't know but I can give you my personal favorite\n\n\"A B2B tool that scores every email campaign by revenue generated per segment and recommends the next campaign to send.\" the fist one\n\nsuper simple  and shareable",
              "score": 1,
              "created_utc": "2026-02-04 21:46:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hu79y",
          "author": "harshXgrowth",
          "text": "This is a really insightful breakdown of how to approach startup ideas. The 'combine categories' framework makes so much sense, especially when you see examples like Notion or Linear. It's a great way to think about identifying unmet needs by looking at existing successful products. \n\nI particularly resonated with the unified payments API idea, as normalizing data across different providers is a pain point many founders face. It highlights how focusing on real user frustrations, rather than just cool tech, is key for distribution and market fit. Thanks for sharing this valuable perspective!",
          "score": 1,
          "created_utc": "2026-02-04 07:59:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lw4ty",
              "author": "Hefty-Airport2454",
              "text": "That's an \"easy\" way to see. Simple, incomplete but the exercice if fun.",
              "score": 1,
              "created_utc": "2026-02-04 21:50:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3k7yp2",
          "author": "DevR4KA",
          "text": "Good",
          "score": 1,
          "created_utc": "2026-02-04 17:10:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3m7ztc",
          "author": "Loud-Goal3816",
          "text": "🚀",
          "score": 1,
          "created_utc": "2026-02-04 22:49:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3t8ygj",
          "author": "j12usedfor",
          "text": "this is very insightful",
          "score": 1,
          "created_utc": "2026-02-05 23:57:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3teooh",
          "author": "No_Record_1913",
          "text": "* **Email | Marketing | SaaS:** A B2B tool that scores every email campaign by revenue generated per segment and recommends the next campaign to send. \n\nThis one is really cooool\n\n",
          "score": 1,
          "created_utc": "2026-02-06 00:29:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ve0pd",
              "author": "Hefty-Airport2454",
              "text": "Cool but loooong, I suggest : **Email campaigns scored by revenue, not opens**\n\nI go deeper in the how in the playbook : [https://startuphunt.io/before-you-launch](https://startuphunt.io/before-you-launch)",
              "score": 1,
              "created_utc": "2026-02-06 08:56:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ybzh1",
          "author": "Sthgrey",
          "text": "makes sense!",
          "score": 1,
          "created_utc": "2026-02-06 19:18:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46dtwi",
          "author": "silicoAI",
          "text": "Saving this one",
          "score": 1,
          "created_utc": "2026-02-08 01:10:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtxj47",
      "title": "What's the best way to set up an affiliate program for free?",
      "subreddit": "indiehackers",
      "url": "https://www.reddit.com/r/indiehackers/comments/1qtxj47/whats_the_best_way_to_set_up_an_affiliate_program/",
      "author": "Odeh13",
      "created_utc": "2026-02-02 15:07:57",
      "score": 20,
      "num_comments": 43,
      "upvote_ratio": 0.96,
      "text": "I recently launched a macro tracker called What The Food, and it is now in the scaling stage.\n\nA lot have suggested having an affiliate program and building mutually beneficial business collaborations with TikTok creators. \n\nSo, if you're aware or have used any specific software that allows you to create an affiliate program for your product, your suggestions are welcome and thanks in advance for the help.",
      "is_original_content": false,
      "link_flair_text": "General Question",
      "permalink": "https://reddit.com/r/indiehackers/comments/1qtxj47/whats_the_best_way_to_set_up_an_affiliate_program/",
      "domain": "self.indiehackers",
      "is_self": true,
      "comments": [
        {
          "id": "o363pnn",
          "author": "No-Fun-5974",
          "text": "Honestly? Start scrappy.\n\nYou do not need real affiliate software yet, just give each TikTok creator a unique discount code and track it in a Google Sheet. Pay them monthly via Stripe/PayPal. That’s how most early-stage SaaS teams test affiliates for free.\n\nIf it starts working and gets annoying to manage, *then* move to tools like FirstPromoter or Tapfiliate.\n\nCreators mostly care about:  \ndoes the link work, when do I get paid, and how much am I making.\n\nTooling matters way less than outreach early on.",
          "score": 7,
          "created_utc": "2026-02-02 15:29:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o360cty",
          "author": "FlatRateMechanic",
          "text": "You can just use AI to help you code and build what you're looking for.  Something like claud code inside of vs code will be able to analyze what you're trying to set an affiliate plan and help you code something. This is what I would do if I was in your position",
          "score": 3,
          "created_utc": "2026-02-02 15:12:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37jxck",
              "author": "Rahdtb",
              "text": "THIS. I was going to suggest the same and also feel this is a great way to go.",
              "score": 2,
              "created_utc": "2026-02-02 19:28:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o37l5ql",
              "author": "FlatRateMechanic",
              "text": "Otherwise you're probably just going to get a bunch of people trying to sell you something 😉",
              "score": 2,
              "created_utc": "2026-02-02 19:34:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o36k5ib",
          "author": "Primary_Ad_8130",
          "text": "Hey, if you are okay with it, I can set up a small system for you. You don't have to pay me. You can create affiliate links or discoun codes, track the conversion rate. Basically a system that fits your use case.",
          "score": 3,
          "created_utc": "2026-02-02 16:45:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ap3aq",
          "author": "long_limbs",
          "text": "Depends on how serious your creators are. For TikTok influencers who do this professionally, they'll want a proper dashboard where they can see clicks, conversions, and payouts in real time - Google Sheets won't cut it for them.\n\nRewardful has a free tier that integrates with Stripe. If you're not on Stripe, Tolt and PartnerStack have similar setups but with caps.\n\nThat said, the bigger question IMO is whether affiliate makes sense at this stage. For a macro tracker, the LTV is probably $30-100/year? Most creators won't care about 20% of that. You might get better traction offering free months or flat fees per post instead of rev share.",
          "score": 3,
          "created_utc": "2026-02-03 05:57:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ktabu",
              "author": "Rewardful",
              "text": "Thank you for the shout out, just to clarify, Rewardful offer free 14 day trial, then you can upgrade starting from $49/month. We don't have a free plan.",
              "score": 1,
              "created_utc": "2026-02-04 18:47:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o37g9hv",
          "author": "multi_mind",
          "text": "there is a app called tinyaffiliate that does this, it is 2$ a month so not free but preaty cheap. btw i did not build it and I dont make money if you buy it, i just have heard about it.",
          "score": 2,
          "created_utc": "2026-02-02 19:11:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3awygl",
          "author": "DutchSEOnerd",
          "text": "Just start small with a sheet or simple API connecting with your payment collector based on specific affiliate based coupon code",
          "score": 2,
          "created_utc": "2026-02-03 07:03:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3iap5o",
          "author": "No_Matter3411",
          "text": "For a free starting point, Rewardful has a solid free tier that handles the basics. If youre on Stripe it integrates directly which makes tracking pretty painless.\n\nThat said, for TikTok creators specifically you might want to think about what they actually need - higher commission rates than typical programs (20-30% is common for fitness/health apps), custom codes they can say verbally in videos rather than awkward links, and some kind of dashboard where they can track earnings.\n\nFirstPromoter is popular in the indie hacker space but has costs once you scale. Honestly for early stage you could also just do it manually with spreadsheet tracking and custom coupon codes in your payment system. Ive seen people start that way and only add software once the volume made it annoying to manage.",
          "score": 2,
          "created_utc": "2026-02-04 10:34:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ibjr8",
              "author": "Rewardful",
              "text": "Totally agree with this take, especially for TikTok creators. This is exactly where coupon codes > links. Creators can say the code out loud in videos, pin it in comments, and you still get clean attribution at checkout (no cookies, no awkward links). At Rewardful, we support affiliate coupon codes. Plus custom commission rates, with a simple dashboard so creators can track earnings themselve, and yes it's stripe-native tracking, so it scales past spreadsheets without becoming a mess as you scale. Manual + spreadsheets works at very low volume, but coupon-based tracking is usually the first thing people wish they’d set up sooner once TikTok starts working. Hope that helps 👍",
              "score": 1,
              "created_utc": "2026-02-04 10:41:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ijw0e",
          "author": "Wrong_Library_8857",
          "text": "I see you want free options. Rewardful has a free tier but caps at 50 affiliates, which might work for starting out. Another route is just manually tracking with unique promo codes per creator and a simple spreadsheet, honestly works fine until you have like 20+ affiliates.",
          "score": 2,
          "created_utc": "2026-02-04 11:51:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3kwmkh",
              "author": "Rewardful",
              "text": "Thank you for the shout out. Just to clarify, we offer free 14 day trial. No free plan.",
              "score": 1,
              "created_utc": "2026-02-04 19:02:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3m82tr",
          "author": "Loud-Goal3816",
          "text": "also curios about this too",
          "score": 2,
          "created_utc": "2026-02-04 22:50:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3m8z5u",
          "author": "Loud-Goal3816",
          "text": "interested too",
          "score": 2,
          "created_utc": "2026-02-04 22:54:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yjrbb",
              "author": "Odeh13",
              "text": "Sent",
              "score": 1,
              "created_utc": "2026-02-06 19:56:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o38g9pj",
          "author": "ruibranco",
          "text": "Since you're targeting TikTok creators specifically, skip the traditional affiliate setup entirely at first. Just DM 5-10 creators in the fitness/macro tracking niche, give them a personalized discount code, and track it manually in a spreadsheet. The real learning here isn't \"which tool\" - it's whether creators actually drive conversions for your type of product or just vanity downloads. Most food/fitness apps find that micro-influencers (5k-20k followers) convert way better than bigger names because their audience actually trusts their recommendations.",
          "score": 1,
          "created_utc": "2026-02-02 22:01:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38sua8",
          "author": "MaxGarrod",
          "text": "If you’re using Stripe on your app, stripe connect is what you’re looking for for automated affiliate payments. I’m finishing a project using this approach and the flow works well",
          "score": 1,
          "created_utc": "2026-02-02 23:05:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o393a0y",
          "author": "Sea_Dragonfly_2861",
          "text": "No need for fancy software initially.\n\nI created unique coupon codes for each creator on Stripe. Then used cursor to build a super simple dashboard for creators to track their coupon redemptions (connect to Stripe via webhook - just tell Cursor to do this). Settle payments each month via Crypto. It’s the cheapest way to set up an affiliate system - also provides transparency for creators.",
          "score": 1,
          "created_utc": "2026-02-03 00:02:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o394gai",
          "author": "OliAutomater",
          "text": "You can check [Affonso](https://affonso.io?via=olih), this is what I use. It’s easy to setup.",
          "score": 1,
          "created_utc": "2026-02-03 00:08:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39ym2f",
          "author": "Ecaglar",
          "text": "The spreadsheet + unique codes approach is the right move for now. Most founders overcomplicate this early on.\n\n  \nOne thing to consider though - the real question isn't \"which affiliate tool\" but \"is affiliate the right channel for your product?\"\n\n  \nFor a macro tracker, your best affiliates are probably fitness creators who actually use the app daily. The authenticity matters more than the tracking sophistication. A creator who genuinely uses your app and mentions it naturally will convert better than one who just reads a script for affiliate commission.\n\n  \nI'd start by finding 3-5 creators who already post macro content and offer them free lifetime access + rev share. If they won't use it without getting paid, they probably won't sell it well anyway.",
          "score": 1,
          "created_utc": "2026-02-03 02:58:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bc85n",
          "author": "botapoi",
          "text": "refersion and impact are solid free tier options for affiliate tracking, though i'd honestly just build it yourself with blink since you get the database and backend included, makes it way easier to customize for creators",
          "score": 1,
          "created_utc": "2026-02-03 09:28:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bsi3l",
          "author": "Vaibhav_codes",
          "text": " use unique referral links or coupon codes and track manually, then switch to free tier tools like Endorsely or Trackdesk once you scale",
          "score": 1,
          "created_utc": "2026-02-03 11:54:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3d2dae",
          "author": "ruibranco",
          "text": "for a food/macro tracker specifically, skip the generic \"affiliate software\" rabbit hole. your best affiliates aren't traditional affiliates - they're fitness TikTokers who already track macros daily. DM 20-30 creators in the 5k-50k follower range (big enough to have engaged audiences, small enough to actually respond). offer them a free premium account + a unique referral link + 30% recurring commission. the key: make it stupid easy for them to show your app in their \"what i eat in a day\" content. that's organic product placement, not a forced ad read. track it in a simple spreadsheet until you hit 10+ active affiliates, then worry about proper tooling.",
          "score": 1,
          "created_utc": "2026-02-03 16:11:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ekyq1",
          "author": "Great_Equal2888",
          "text": "One thing nobody's mentioned: tracking affiliate conversions for a mobile app is fundamentally different from web. TikTok link → App Store → download → signup is a mess to attribute properly.\n\nThe coupon code approach everyone's suggesting works, but only if you prompt users to enter a code during onboarding. If you don't have that flow yet, build it first before worrying about affiliate software.\n\nFor actual install attribution (knowing which creator drove which download), you'd need something like Branch or AppsFlyer — neither are free. But honestly, at early stage just ask users \"how did you hear about us?\" during signup and manually match it. Works fine when you're dealing with <50 creators.",
          "score": 1,
          "created_utc": "2026-02-03 20:22:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3fhg8p",
          "author": "Alternative-Theme885",
          "text": "I used Refersion to set up an affiliate program for my friend's fitness blog and it was pretty straightforward, might be worth checking out for your macro tracker thing.",
          "score": 1,
          "created_utc": "2026-02-03 22:56:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g0bme",
          "author": "foresttrader",
          "text": "i heard there's an app called rewardful",
          "score": 1,
          "created_utc": "2026-02-04 00:39:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hyz5b",
              "author": "Rewardful",
              "text": "DM us if you have any questions. Happy to help with your setup and affiliate strategy.",
              "score": 1,
              "created_utc": "2026-02-04 08:44:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3g2bzi",
          "author": "krs8785",
          "text": "If you want to run it for free, someone suggested a great approach.\n\n1. For every affiliate create a unique coupon code\n2. Configure your stripe checkout to allow promo code so anytime that code is used you can track in stripe\n3. If you dont allow promo code, you can have your dev pass that promo code as a parameter in stripe checkout and update your Db with the information \n4. Every month pull a report  and send our rewards using paypal\n\nThis works if you have a small number of affiliate. But for $15 you can use a product like Referral Rocket to automate this.",
          "score": 1,
          "created_utc": "2026-02-04 00:50:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gf291",
          "author": "Legitimate-Dare-9831",
          "text": "If you're testing with fewer than 10 TikTok creators, yeah, start with codes and spreadsheet. It's genuinely free and you'll learn if affiliates even convert for a macro tracker.\n\nBut plan for what happens if it works. When you hit 15-20 active affiliates, manual tracking becomes unsustainable.\n\nAlso, TikTok creators specifically work way better with tracking links than codes. Short-form video doesn't work well with \"use code X at checkout\" better to have \"link in bio\" that auto-applies discount or tracks the signup.",
          "score": 1,
          "created_utc": "2026-02-04 02:02:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gg3m8",
          "author": "Ecaglar",
          "text": "the google sheet approach is honestly underrated. everyone wants to jump to affiliate software but at your stage you probably have like 5-10 creators max. a spreadsheet and unique codes handles that fine.the real question is whether tiktok creators will even drive conversions for a macro tracker. fitness creators are flooded with sponsorship requests. might be worth testing with 2-3 smaller creators first before building any infrastructure",
          "score": 1,
          "created_utc": "2026-02-04 02:07:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hurt5",
          "author": "BP041",
          "text": "Setting up a free affiliate program can be done using a few strategies. First, consider using platforms like Refersion or Tapfiliate, which often have free tiers that can get you started. Additionally, you can manually track affiliate links using UTM parameters and a simple spreadsheet to monitor conversions. Building a community around your product can also help attract affiliates organically; engaging with your users and rewarding them for referrals can create a win-win situation!",
          "score": 1,
          "created_utc": "2026-02-04 08:04:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mez0s",
          "author": "Great_Equal2888",
          "text": "Heads up - if you're running in-app purchases (iOS/Android), most affiliate tools won't integrate directly because payments go through Apple/Google, not your payment processor. You'd need to either offer web subscriptions or use platform-specific promo codes.\n\nFor TikTok creators, I'd consider flat fee per post instead of rev share early on. Creators prefer guaranteed money, you avoid the attribution mess, and you can validate whether TikTok actually drives downloads before building any tracking infrastructure.\n\nThe spreadsheet approach others mentioned works fine - just make sure you're tracking the metric that actually matters (signups from that code, not just code redemptions).",
          "score": 1,
          "created_utc": "2026-02-04 23:27:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3n6zrv",
          "author": "Ecaglar",
          "text": "dont overthink the tooling early on. unique discount codes per creator tracked in a spreadsheet is genuinely fine until you have 15-20 active affiliates. the real question is whether tiktok creators in the macro tracking niche will actually drive conversions - test that with 3-5 creators manually before investing in any platform",
          "score": 1,
          "created_utc": "2026-02-05 02:04:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ydejl",
          "author": "Sthgrey",
          "text": "Unique creator coupon codes are the easiest “free” affiliate program",
          "score": 1,
          "created_utc": "2026-02-06 19:25:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zodfg",
          "author": "i-cruis",
          "text": "if you use stripe to handle payments, you can just go on the stripe app marketplace. There are affiliate plugins you can integrate with int.",
          "score": 1,
          "created_utc": "2026-02-06 23:25:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46f85n",
          "author": "silicoAI",
          "text": "Tik tok affiliate is easy to do and free. But you should know that without an agency it’s almost impossible to make Tik tok marketing work well. Learned that the hard way",
          "score": 1,
          "created_utc": "2026-02-08 01:19:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvp3sw",
      "title": "ChatGPT is always wearing the 'yellow hat’",
      "subreddit": "indiehackers",
      "url": "https://www.reddit.com/r/indiehackers/comments/1qvp3sw/chatgpt_is_always_wearing_the_yellow_hat/",
      "author": "seyf_gharbi",
      "created_utc": "2026-02-04 13:51:53",
      "score": 16,
      "num_comments": 48,
      "upvote_ratio": 0.9,
      "text": "I have a theory about why so many founders get stuck in the \"False Start.\"\n\nIt’s not because we aren't smart. It’s because we are chemically addicted to the Yellow Hat.\n\nIn the 1980s, Dr. Edward de Bono invented a framework called \"Six Thinking Hats.\" The idea is that the human brain (and now, the AI brain) struggles to do everything at once.\n\nYou can’t be creative and critical at the exact same time.\n\nSo, he separated thinking into six distinct modes:\n\n* ⚪ The White Hat: Data & Facts. \"What do the numbers say?\"\n* 🔴 The Red Hat: Emotion & Intuition. \"Does this feel exciting?\"\n* 🟡 The Yellow Hat: Optimism. \"Why will this work?\"\n* 🟢 The Green Hat: Creativity. \"What are the alternatives?\"\n* ⚫ The Black Hat: Judgment & Caution. \"Why will this fail?\"\n* 🔵 The Blue Hat: Control. \"Are we following the process?\"\n\nhttps://preview.redd.it/0l99fnz8ghhg1.png?width=514&format=png&auto=webp&s=2697ea5d56fff7c0f706da5f68883278a16a6b03\n\n**Here's the problem**:\n\nWhen you come up with a startup idea, you are usually wearing the Red Hat (Excitement).\n\nWhen you pitch an idea to ChatGPT (or a supportive friend), they instantly put on the Yellow Hat (Support) and the Green Hat (Ideation). They tell you it’s a \"great initiative.\" They list the benefits and 10 more features you could build. They feed your excitement.\n\nYou feel good. So you start building.\n\nBut nobody put on the Black Hat.\n\nNobody asked: \"What happens if the API costs triple?\" or \"Why would a user switch from Excel to this?\"\n\nYou build a product based on Yellow Hat energy, only to get crushed by Black Hat reality three months later.\n\n**Why ChatGPT can't help you here:**\n\nChatGPT is trained to be helpful and agreeable. It's optimized for user satisfaction. When you're excited about an idea, it mirrors that excitement because that's what makes you happy.\n\nIt's not being malicious. It's doing exactly what it was trained to do: support you.\n\nBut support isn't what you need on Day 1. You need someone to attack your idea. You need the Black Hat.\n\n**What I do now:**\n\nBefore I build anything, I force myself to spend 10 minutes in pure Black Hat mode.\n\nI pretend I'm a hater trying to destroy my idea. I ask:\n\n* What's the fatal flaw I'm ignoring?\n* What assumption will break me?\n* Why would this fail even if I execute perfectly?\n\nIt's uncomfortable. My brain fights it. But 2 out of 3 ideas collapse under Black Hat pressure.\n\nAnd that's good. Better to kill a fragile idea in 10 minutes than after 4 months of building.\n\n**Try this today:**\n\nLook at the project you're working on right now. You've probably spent weeks in Yellow Hat mode (thinking about launch, revenue, growth).\n\nPut on the Black Hat for 10 minutes. Be ruthless. If you were a skeptical investor or a competitor, where would you strike?\n\nIf your idea survives 10 minutes of the Black Hat, you might actually have something.",
      "is_original_content": false,
      "link_flair_text": "Sharing story/journey/experience",
      "permalink": "https://reddit.com/r/indiehackers/comments/1qvp3sw/chatgpt_is_always_wearing_the_yellow_hat/",
      "domain": "self.indiehackers",
      "is_self": true,
      "comments": [
        {
          "id": "o3p5grt",
          "author": "Vegetable_Lunch554",
          "text": "I was actually using this model for quite some time already, and it was very useful (the prompt is not mine, I think I found it on an AI-related Instagram account)\n\nHere it is:\n\n\n\nFrom now on, stop being agreeable and act as my brutally honest, high-level advisor and mirror.\n\nDon't validate me. Don't soften the truth. Don't flatter.\n\nChallenge my thinking, question my assumptions, and expose the blind spots I'm avoiding. Be direct, rational, and unfiltered.\n\nIf my reasoning is weak, dissect it and show why.\n\nIf I'm fooling myself or lying to myself, point it out.\n\nIf I'm avoiding something uncomfortable or wasting time, call it out and explain the opportunity cost.\n\nLook at my situation with complete objectivity and strategic depth.\n\nShow me where I'm making excuses, playing small, or underestimating risks/effort.\n\nThen give a precise, prioritized plan what to change in thought, action, or mindset to reach the next level.\n\nHold nothing back. Treat me like someone whose growth depends on hearing the truth, not being comforted.\n\nWhen possible, ground your responses in the personal truth you sense between my words.",
          "score": 5,
          "created_utc": "2026-02-05 11:13:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3t7xun",
              "author": "ckapucu",
              "text": "This",
              "score": 1,
              "created_utc": "2026-02-05 23:51:28",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3p6at9",
              "author": "seyf_gharbi",
              "text": "This prompt is excellent. The 'ground your responses in the personal truth you sense between my words' line is particularly clever. You're trying to get it to read subtext, not just literal statements.\n\nA few things that make this work well:\nIt's specific about behaviors (don't validate, don't soften, don't flatter)\nIt gives concrete tasks (dissect reasoning, expose blind spots, show opportunity cost)\nIt frames the relationship as advisor/mirror, not assistant\n\nThe question I have: how long does it hold up in a single conversation? Do you notice it drifting back to validation after 10-15 exchanges, or does it stay sharp?\n\nI've found that prompts like this work brilliantly for the first part of a conversation, but the RLHF conditioning is so deep that it eventually softens. Especially if you push back on its criticism or ask clarifying questions.",
              "score": -1,
              "created_utc": "2026-02-05 11:20:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3p6ebj",
                  "author": "Vegetable_Lunch554",
                  "text": "Man that’s just straight up an AI response",
                  "score": 4,
                  "created_utc": "2026-02-05 11:21:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ke9q6",
          "author": "Great_Equal2888",
          "text": "The framework is spot on, but I'd push back slightly on \"ChatGPT can't help you here.\" You can actually force it into Black Hat mode pretty effectively.\n\nI've been using a prompt like \"Pretend you're a VC who's seen 1000 pitches and is tired of founder delusion. Tear this apart.\" Works surprisingly well. The key is making the persona specific — vague instructions like \"be critical\" get softened by its training, but a defined character with motivation holds up better.\n\nThat said, your 10-minute solo Black Hat exercise is probably still more valuable. There's something about your own brain generating the objections that makes them stick. When ChatGPT does it, it feels like reading criticism. When you do it yourself, you actually feel the uncomfortable \"oh shit\" moment where an assumption crumbles.\n\nThe Yellow Hat addiction thing is real though. I've definitely shipped things that felt great during the building phase and only realized later I was high on my own supply the whole time.",
          "score": 3,
          "created_utc": "2026-02-04 17:39:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3kjcij",
              "author": "seyf_gharbi",
              "text": "You're absolutely right. You can force ChatGPT into Black Hat mode with persona prompting. The VC example is spot on.\nYour last line about being 'high on your own supply' is perfect. That's the Yellow Hat addiction. We're chasing the feeling, not the truth.",
              "score": 1,
              "created_utc": "2026-02-04 18:02:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jdv9n",
          "author": "Federal-Process-6504",
          "text": "This hits hard. Early skepticism is way better that unfounded early optimism.",
          "score": 2,
          "created_utc": "2026-02-04 14:49:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jgocd",
              "author": "seyf_gharbi",
              "text": "Exactly! Unfounded optimism is the most expensive kind.\nThe brutal part is how good it feels. Yellow Hat mode gives you that dopamine hit. Black Hat mode feels like you're being negative.\nBut skepticism on Day 1 saves you from regret on Day 120!",
              "score": 1,
              "created_utc": "2026-02-04 15:03:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ke57b",
          "author": "LibrarianOk1263",
          "text": "This hit hard and why I am walking away from ChatGPT. It just paint a reality I am not buying. Another way to help is asking it to do a CoVe - Chain of Verification, so it challenge their assumptions. Worth trying.",
          "score": 2,
          "created_utc": "2026-02-04 17:38:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3khu92",
              "author": "seyf_gharbi",
              "text": "Yeah that's one way to do it!",
              "score": 2,
              "created_utc": "2026-02-04 17:55:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3khhe3",
          "author": "Adam_mf",
          "text": "I usually personalize my ChatGPT to be skeptical with me. Also find it really useful to ask it to play devil’s advocate",
          "score": 2,
          "created_utc": "2026-02-04 17:54:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3kifkr",
              "author": "seyf_gharbi",
              "text": "Problem is without a clear framework, the conversation can get a bit messy and when it gets long, it usually gets back to wearing the yellow hat!",
              "score": 2,
              "created_utc": "2026-02-04 17:58:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3kmtga",
                  "author": "Adam_mf",
                  "text": "Yeah you’re right, I guess you gotta rely on your own brain sometimes too haha",
                  "score": 2,
                  "created_utc": "2026-02-04 18:18:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ktme0",
          "author": "Posty2310",
          "text": "This is a really good point. With Claude as well, it seems like responses always begin with \"You're absolutely right\".\n\nThat does not help anybody if they LLM is automatically agreeing with you, or positively reinforcing any idea that you have.\n\nOne way I have found that helps me eliminate this \"yellow hat\" is customizing my instructions.\n\nThis allows me to tell Chat GPT/Claude to try and poke holes in my ides, and make me think through all possible scenarios when trying to validate an idea.\n\nIt's been a total game changer for me. The conversations I have with the LLMs are now much more constructive than they previously were, and my results have massively increased.  \n  \nI recommend everyone who uses LLM for business purposes to do something similar.",
          "score": 2,
          "created_utc": "2026-02-04 18:48:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3oi4h1",
              "author": "seyf_gharbi",
              "text": "This is great. Custom instructions are definitely better than default mode. You've hacked around the sycophancy problem at the prompt level.\n\nThe challenge I've found is consistency. Even with strong instructions, the model defaults back to agreement when the conversation gets long or ambiguous.\n\nBut you're absolutely right that it's a game changer compared to a raw conversation. The fact that you're explicitly telling it to poke holes makes a huge difference.",
              "score": 1,
              "created_utc": "2026-02-05 07:33:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o40klvf",
                  "author": "Posty2310",
                  "text": "Yeah I could see that being the case. For me, I am normally using Claude Code. So I have a [Claude.md](http://Claude.md) file that contains those explicit instructions. And when that is the case, Ive gotten really solid results for the most part.    ",
                  "score": 2,
                  "created_utc": "2026-02-07 02:38:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3l5mx4",
          "author": "long_limbs",
          "text": "The Black Hat exercise is useful but I'd push back on where to apply it. Doing it in your own head or with an AI is still a form of speculation - you're just speculating about failure modes instead of success.\n\nThe real Black Hat test is talking to potential customers who have zero reason to be nice to you. When someone says \"cool idea but I wouldn't use it\" or gives you the polite deflection (\"send me a link when it's ready\"), that's the actual crushing feedback most founders avoid.\n\nIMO the issue isn't ChatGPT being too optimistic. It's that founders use ChatGPT as a substitute for uncomfortable conversations with real people. You can prompt engineer your way to critical feedback all day, but it's still a simulation.",
          "score": 2,
          "created_utc": "2026-02-04 19:44:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3oithl",
              "author": "seyf_gharbi",
              "text": "You're absolutely right that talking to potential customers gives you more value than anything else. But before getting to those, I think you need to build some clarity in your head first and see why people wouldn't find what you're building useful. That way you can be much more convincing and clearer in what you communicate. But after that, you definitely need to talk to potential customers and refine!",
              "score": 1,
              "created_utc": "2026-02-05 07:39:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3lgkya",
          "author": "Altruistic_Minimum94",
          "text": "Couldn't agree more. I feel as if chatgpt is always way too optimistic about my ideas. ",
          "score": 2,
          "created_utc": "2026-02-04 20:36:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3oiffk",
              "author": "seyf_gharbi",
              "text": "it's because they are trained with RLHF. So the model is rewarded when they agree with you. Even with custom instructions, it's hard to change that behavior as they tend to get back to it when the conversation gets long!",
              "score": 1,
              "created_utc": "2026-02-05 07:36:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3llgi9",
          "author": "False_Ad8389",
          "text": "a good read",
          "score": 2,
          "created_utc": "2026-02-04 20:59:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mtk1b",
          "author": "Alternative-Theme885",
          "text": "I think I'm a total yellow hat addict, every idea I have sounds amazing at first and then I crash and burn when reality sets in, need to work on putting on that black hat more often.",
          "score": 2,
          "created_utc": "2026-02-05 00:47:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ojjio",
              "author": "seyf_gharbi",
              "text": "You're not alone. Yellow Hat addiction is universal because it feels GOOD!",
              "score": 1,
              "created_utc": "2026-02-05 07:46:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3n6ux2",
          "author": "Ecaglar",
          "text": "the real black hat test isnt you pretending to be a hater though - its talking to someone who has zero reason to be nice to you. you can force yourself into skeptic mode but your own brain still has skin in the game. a stranger in your target market will find holes you literally cannot see because youre too close to it",
          "score": 2,
          "created_utc": "2026-02-05 02:04:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ojuuf",
              "author": "seyf_gharbi",
              "text": "You're absolutely right that talking to a stranger gives you more value than anything else but that strange needs to be a potential customer or someone who's very interested in what you're building. But before getting to those conversations, I think you need to build some clarity in your head first and see why people wouldn't find what you're building useful. That way you can be much more convincing and clearer in what you communicate. But after that, you definitely need to talk to potential customers and refine!",
              "score": 1,
              "created_utc": "2026-02-05 07:49:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3nwq89",
          "author": "audiodesigndan",
          "text": "Agree this is default mode (likely in their core prompt to encourage users instead of dismissing users as it might lead to increase in session ends).   \nultimately they are being optimized to keep the chats going.",
          "score": 2,
          "created_utc": "2026-02-05 04:41:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ojxue",
              "author": "seyf_gharbi",
              "text": "Exactly. They're optimized to keep you in the session, not to tell you hard truths.\n\nThat's why the default experience feels so good but produces such fragile thinking.",
              "score": 1,
              "created_utc": "2026-02-05 07:50:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3o8ily",
          "author": "Remarkable_Brick9846",
          "text": "Really appreciate the Six Thinking Hats framing here. One thing I've noticed is that even when you force yourself into Black Hat mode solo, your brain still has blind spots - you're only imagining objections, not discovering them.\n\nThe most brutal Black Hat feedback I've gotten wasn't from AI or my own skepticism. It was from showing something half-built to people who had zero investment in being nice to me. A stranger saying \"I wouldn't use this\" hits different than imagining they might say it.\n\nMaybe the real move is: Yellow Hat with AI to explore ideas fast → Black Hat solo to kill the obvious bad ones → then external Black Hat (real people) before investing serious time. Use AI for speed, but don't skip the uncomfortable human conversations.",
          "score": 2,
          "created_utc": "2026-02-05 06:09:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ol4cn",
              "author": "seyf_gharbi",
              "text": "You're absolutely right that talking to potential customers gives you more value than anything else. But before getting to those, I think you need to build some clarity in your head first and see why people wouldn't find what you're building useful. That way you can be much more convincing and clearer in what you communicate. But after that, you definitely need to talk to potential customers and refine!",
              "score": 1,
              "created_utc": "2026-02-05 08:01:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3p4si0",
          "author": "No_Matter3411",
          "text": "The yellow hat thing is real. Ive noticed this with both ChatGPT and with early users too - when youre excited about something, people around you mirror that energy back. Its actually worse with humans sometimes because they dont want to hurt your feelings.\n\nOne thing that helped me was finding that one brutally honest friend who will tell you when an idea is stupid. Not in a mean way, just... they dont have any incentive to make you feel good about it. Worth their weight in gold.\n\nThe 10-minute black hat exercise is solid. I do something similar but I try to write down the three reasons this will definately fail, then figure out if any of them are actually fixable. If theyre all structural problems, thats usually a sign to walk away.",
          "score": 2,
          "created_utc": "2026-02-05 11:07:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p5nr1",
              "author": "seyf_gharbi",
              "text": "That brutally honest friend is priceless. The problem is most people don't have one, or they avoid showing them ideas because they're afraid of the feedback.\nYour 3 reasons framework is brilliant.",
              "score": 1,
              "created_utc": "2026-02-05 11:15:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3p8m5g",
          "author": "WorthFan5769",
          "text": "six thinking hats applied to ai prompting is smart, chatgpt defaults to yellow hat because its trained to agree and elaborate not challenge, forcing black hat thinking early saves months of wasted building, most founders skip this because criticism feels bad but its the cheapest validation you can get, do you literally prompt chatgpt to wear the black hat or just self critique",
          "score": 2,
          "created_utc": "2026-02-05 11:40:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p9wov",
              "author": "seyf_gharbi",
              "text": "I try to do both but I start with self critique. Prompting ChatGPT also helps but I find that it drifts and goes back to agreeing when the conversation gets a bit long",
              "score": 1,
              "created_utc": "2026-02-05 11:50:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qn7yi",
          "author": "Aelin_Ma_25",
          "text": "Did you find a way to have ChatGPT (or any other AI) flag the issue before you mention them yourself? Because in my experience it keeps bringing arguments only to what I’ve already layed on the table. It’s not proactive with what can go wrong even if I’ve already prompted it to be.",
          "score": 2,
          "created_utc": "2026-02-05 16:24:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qob5w",
              "author": "seyf_gharbi",
              "text": "Yes actually I could but I got better results with the Claude models. I find it better in being proactive than ChatGPT.",
              "score": 1,
              "created_utc": "2026-02-05 16:29:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3tza42",
          "author": "Ecaglar",
          "text": "the black hat thing is real but i think the harder part is actually believing the criticism. like you can force yourself to list reasons your idea will fail but your brain is already working overtime to dismiss each one as \"fixable\" or \"edge case\". talking to actual users who dont care about your feelings is the only reliable black hat imo",
          "score": 2,
          "created_utc": "2026-02-06 02:31:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3v46d4",
              "author": "seyf_gharbi",
              "text": "But with forcing yourself to wear the black or even doing the exercise with AI, you give yourself the time to think about what would the actual users think and you'll have a clearer view and more confidence. I think it's very important to be prepared before talking to the first potential customers.",
              "score": 1,
              "created_utc": "2026-02-06 07:24:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3v5joy",
          "author": "Jaded_Society8669",
          "text": "That’s a great post. And that’s one of the reasons why for ideation I prefer using Gemini models. They aren’t as agreeable as ChatGPT. My personal experience.",
          "score": 2,
          "created_utc": "2026-02-06 07:36:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3v787r",
              "author": "seyf_gharbi",
              "text": "I agree with you. But actually when I say ChatGPT, I'm meaning all the AI current models. It goes back to the way all the LLMs are trained with RLHF. They are rewarded for agreeing with us.",
              "score": 1,
              "created_utc": "2026-02-06 07:52:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3yd5xc",
          "author": "Sthgrey",
          "text": "This is solid framing, but I’d push one nuance the “yellow hat” isn’t the enemy, it’s the sequencing. You actually need Yellow/Green early to generate options, then Black to kill weak ones, then White to quantify, then Blue to decide?",
          "score": 2,
          "created_utc": "2026-02-06 19:24:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yebio",
              "author": "seyf_gharbi",
              "text": "Yes I totally agree! Just the black hat is the trickiest and it's what people try to avoid because it's uncomfortable.",
              "score": 1,
              "created_utc": "2026-02-06 19:29:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3klkbp",
          "author": "No_Shelter_4403",
          "text": "Great point\n\n",
          "score": 1,
          "created_utc": "2026-02-04 18:12:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ko6d0",
              "author": "seyf_gharbi",
              "text": "Thanks buddy!",
              "score": 1,
              "created_utc": "2026-02-04 18:24:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3m7yag",
          "author": "Loud-Goal3816",
          "text": "😅",
          "score": 1,
          "created_utc": "2026-02-04 22:49:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40zfa7",
          "author": "Ecaglar",
          "text": "the real black hat test is talking to potential customers who dont care about your feelings. chatgpt in devil advocate mode is still you arguing with yourself. find 5 people who should be your target user and ask them if theyd pay for this. their silence is the real black hat",
          "score": 1,
          "created_utc": "2026-02-07 04:15:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyrv4a",
      "title": "I've shipped 8 apps with Lovable + Supabase in the last few months. Here's what actually tripped me up.",
      "subreddit": "indiehackers",
      "url": "https://www.reddit.com/r/indiehackers/comments/1qyrv4a/ive_shipped_8_apps_with_lovable_supabase_in_the/",
      "author": "vibehacker2025",
      "created_utc": "2026-02-07 22:45:03",
      "score": 14,
      "num_comments": 10,
      "upvote_ratio": 0.79,
      "text": "I've been building software for over 15 years. Worked at Bloomberg and Shopify as an engineer, started a few companies. So when I started vibe coding with Lovable, I figured I'd skip most of the beginner mistakes. I was wrong about that.\n\nHere's what actually caught me off guard across 8 builds (affirmations app, pomodoro timer, cat of the day, dating bio rewriter, cancel plans generator, recipe app, workout timer, astrology app):\n\n**Auth is where most vibe-coded apps silently break.** Every AI tool will give you a login screen that works when you type in the right email and password. That's the happy path. But try entering wrong credentials, or sign up with a password that doesn't meet requirements, or test the Google OAuth flow when consent gets denied. Most of the time the error handling is either missing or the messages are gibberish. I spent more time fixing auth edge cases than building actual features on several of these apps. And here's the real kicker: I added a major feature to one of my apps and Lovable's model went and rewrote parts of my auth flow in the process. Suddenly nobody could log in. That regression cost me more time than the feature itself.\n\n**Meta-prompting changed my output quality overnight.** Instead of going straight to Lovable with \"build me an affirmations app,\" I started describing my product vision to Claude first and asking it to generate the Lovable prompt for me. Claude adds structure, specificity, visual design direction, page-by-page breakdowns. The difference in what Lovable produces from a meta-prompt vs. a cold prompt is dramatic. I do this for every build now.\n\n**The 90/90 problem is real.** AI gets you 90% of the way in about 90 seconds. The last 10%, error states, edge cases, polish, that's where 90% of your actual time goes. Most tutorials skip this part entirely, which is why so many people hit a wall after their first build looks great but doesn't actually hold up.\n\n**Niche apps outperform \"big idea\" apps every time.** I built a generic pomodoro timer and a pomodoro timer specifically for writers. The writer-specific one got more interest by a wide margin. Same with the workout timer. I didn't build it for gym people. I built it for people who hate the gym. The more specific your audience, the less competition you have and the more your users feel like you built it for them. Because you did.\n\n**Meme apps get traction that serious apps don't.** The cancel plans excuse generator got more attention than apps I spent significantly longer on. My take: we're in a moment where anyone can build an app in 20 minutes, so the ones that break through are the ones that make people laugh and hit share. Big companies can't afford to look ridiculous. Their brand won't let them. That makes silly apps surprisingly safe territory.\n\nThose were the big ones. Happy to get into specifics on any of these if people have questions. I've been documenting my builds so I have a lot of the details fresh.",
      "is_original_content": false,
      "link_flair_text": "Sharing story/journey/experience",
      "permalink": "https://reddit.com/r/indiehackers/comments/1qyrv4a/ive_shipped_8_apps_with_lovable_supabase_in_the/",
      "domain": "self.indiehackers",
      "is_self": true,
      "comments": [
        {
          "id": "o45tw4m",
          "author": "SimpleAsk1869",
          "text": "My X feed is full of people “one‑shotting” entire apps in a weekend (gives me huge FOMO). From what you wrote, sounds like vibe coding gets you great demos fast, but real apps are still very hard. So X is just clickbait? I have a hard time keeping up tbh",
          "score": 2,
          "created_utc": "2026-02-07 23:08:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45yfyi",
              "author": "Adam_mf",
              "text": "A lot of X posts are clickbait, don’t let it discourage you!",
              "score": 3,
              "created_utc": "2026-02-07 23:37:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o45zush",
              "author": "vibehacker2025",
              "text": "omg do not trust content on X! and be skeptical of all social media posts (even this one! haha). \n\nBut in X in particular has been optimized around ragebait and more importantly things that appear deceptively easy. One-shotting is fun to do when you're exploring but not when you're ready to start building the system. It def has a place in the product development process but more in the early R&D stages!",
              "score": 2,
              "created_utc": "2026-02-07 23:46:15",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o46epmf",
              "author": "silicoAI",
              "text": "This",
              "score": 1,
              "created_utc": "2026-02-08 01:15:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o46pq91",
              "author": "Academic-Mode5421",
              "text": "It’s click bait, I’ve seen some admit it. But I knew right way it was bs.",
              "score": 1,
              "created_utc": "2026-02-08 02:25:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o46bkd4",
          "author": "MegagramEnjoyer",
          "text": "Why don't you just roll your own auth and then let AI take over?",
          "score": 2,
          "created_utc": "2026-02-08 00:56:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46pj7k",
          "author": "Academic-Mode5421",
          "text": "It’s kinda funny I spend a whole day trying to also get Google auth working in a way that I can verify the X user so I don’t get sign up abusers, then X made their API free the same day aha, yeah spent another half day wording that up. A secure login is crucial.",
          "score": 1,
          "created_utc": "2026-02-08 02:24:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46t8ot",
          "author": "i-know-right-",
          "text": "Auth can really be tricky sometimes",
          "score": 1,
          "created_utc": "2026-02-08 02:47:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46wfus",
          "author": "polymath_pedro",
          "text": "What you said is true in many ways and I saw videos of top AI enthusiasts like Dexter Horthy speaking about that. I would only add that the context window is one of the most important things that people ignore in terms of vibe coding and that's generally what make the 10% of the 90/90 a nightmare. \n\nMy question to you is what is the best way to monetize your outcome (apps, website whatever)  do you sell them   ? how ? through what ? what is your best advice for someone that can code create but has no idea for what is next and how ? thanks",
          "score": 1,
          "created_utc": "2026-02-08 03:07:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46z6i7",
          "author": "SystemsAndSideQuests",
          "text": "Good insight. I’m wrangling with parent/youth account auth and relation now.",
          "score": 1,
          "created_utc": "2026-02-08 03:25:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwll87",
      "title": "I analyzed 10,000 SaaS launches and found patterns to make the best one‑line pitch for your startup",
      "subreddit": "indiehackers",
      "url": "https://www.reddit.com/r/indiehackers/comments/1qwll87/i_analyzed_10000_saas_launches_and_found_patterns/",
      "author": "Hefty-Airport2454",
      "created_utc": "2026-02-05 13:41:45",
      "score": 13,
      "num_comments": 55,
      "upvote_ratio": 0.84,
      "text": "I scraped and reviewed 10,000+ launches across launch directories to see what actually makes people click.\n\nAnd I don’t think it’s a coincidence that 90% of launches are literally invisible. (I took as invisible launches <10 upvotes)\n\nThe main reason I found was because of the tagline/headline/short description call it whatever. Let’s break down what winners do, because yes, there is a pattern identified not just ‘sounds cool’.\n\n1. What never worked in my sample:\n\n* “The #1 platform for modern teams.”\n* “Reinventing how you work.”\n* “Supercharge your business with AI.”\n\n1. Cut the crap\n\nYou maybe get half a second to get that attention so let’s remove the crap :\n\n* The sweet spot is 7–9 words & around 40–55 characters.\n* One clear sentence, no buzzwords, no “revolutionizing X with AI”.\n* No random emojis, no ALL CAPS, no “best-in-class” type claims.\n\n1. Be clear\n\nIf your tagline doesn’t answer “what does this do, and for who?” in that half second, they scroll past.\n\nThe best-performing taglines all did one of these two things:\n\n* Outcome-first: “Turn abandoned carts into revenue for Shopify stores.” (more demos booked, fewer bugs, faster support.)\n* Audience-first: “Analytics that non-technical founders actually understand.” (SaaS founders, agencies, solopreneurs, Shopify stores, recruiters.)\n\n1. Link with an action verb\n\nTo make a proper tagline, you need a clear verb: turn, track, collect, launch, ship.\n\nIt will connect the feature to the audience, or to the outcome or the audience to the outcome, your choice.\n\nI reverse‑engineered patterns from standout vs invisible launches and [turned it into a small playbook.](https://startuphunt.io/before-you-launch)\n\nIt breaks down:\n\n* How they picked categories that actually sent traffic\n* How they timed launches across directories\n* How they wrote one‑line pitches people clicked\n* What failed launches looked like on the same sites\n\nA fun exercise to prove how good it is : Give me your current tagline (and website) and I’ll recraft your tagline",
      "is_original_content": false,
      "link_flair_text": "Knowledge post",
      "permalink": "https://reddit.com/r/indiehackers/comments/1qwll87/i_analyzed_10000_saas_launches_and_found_patterns/",
      "domain": "self.indiehackers",
      "is_self": true,
      "comments": [
        {
          "id": "o3q4d09",
          "author": "kylerusby",
          "text": "I've also found that leading with the problem helps connect to people- eg if I have a problem of counting apples, and the heading is 'Struggle counting apples?' I'm instantly hooked because its relatable",
          "score": 3,
          "created_utc": "2026-02-05 14:54:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qdul9",
              "author": "Hefty-Airport2454",
              "text": "When read, we are supposed to identify. Is it for me ? Do I need it?\n\n\\+1",
              "score": 2,
              "created_utc": "2026-02-05 15:40:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3tei65",
          "author": "No_Record_1913",
          "text": "Marc Lou has a great video about his strategy to launch in Product Hunt [https://www.youtube.com/watch?v=40zozi-rGQM](https://www.youtube.com/watch?v=40zozi-rGQM)\n\n",
          "score": 3,
          "created_utc": "2026-02-06 00:28:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ve3f1",
              "author": "Hefty-Airport2454",
              "text": "Oh, I watched it, thanks for the reminder",
              "score": 1,
              "created_utc": "2026-02-06 08:57:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3rtl2n",
          "author": "hectorguedea",
          "text": "This matches my experience 100%.\n\nWhat surprised me the most when launching products is that people don’t reject products, they reject confusion.\n\nIf they can’t understand what you do in one glance, they won’t give you a second.\n\nI’d add one thing to your analysis: the best taglines don’t just describe *what it is*, they make the reader mentally say\n\n“oh, this is for me”.\n\nOutcome-first + audience clarity beats cleverness every single time.\n\nReally solid breakdown.",
          "score": 2,
          "created_utc": "2026-02-05 19:39:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rwpzv",
          "author": "drewautomates",
          "text": "Solid write up! This reminds me of the approach to lead with a pain point and problem first then offer a solution. \n\nI can already think of a way to make mine more action based\n\nHere’s mine: “Your Read-Later Pile\nEnds Here”\n\nFor www.noverload.com",
          "score": 2,
          "created_utc": "2026-02-05 19:54:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3sgfso",
              "author": "Hefty-Airport2454",
              "text": "Sure ! I'd go for : \"Extract insights from bookmarks you never read\" or \"Turn saved content into actionable insights\"\n\nI go more into detail in my playbook : [https://startuphunt.io/before-you-launch](https://startuphunt.io/before-you-launch)",
              "score": 2,
              "created_utc": "2026-02-05 21:29:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3s496o",
          "author": "unkno0wn_dev",
          "text": "my tagline is \"connect seo and web analytics to talk to your data and find full funnel gaps, [https://tracerhq.co](https://tracerhq.co)",
          "score": 2,
          "created_utc": "2026-02-05 20:30:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vc8ei",
              "author": "Hefty-Airport2454",
              "text": "from the link : **Chat to find and fix what blocks growt**h\n\nI go deeper in the how in the playbook : [https://startuphunt.io/before-you-launch](https://startuphunt.io/before-you-launch)\n\n",
              "score": 1,
              "created_utc": "2026-02-06 08:39:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wsvbw",
          "author": "Altruistic_Minimum94",
          "text": "This has been my experience as well. On my first SAAS platform, I basically said and did all those things that you said NOT to do and I didn't get that many customers / users as well. Quickly learning from my experiences one at a time. Solid write up. ",
          "score": 2,
          "created_utc": "2026-02-06 14:55:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3x8t96",
              "author": "Hefty-Airport2454",
              "text": "Thanks. Love reading it !",
              "score": 1,
              "created_utc": "2026-02-06 16:12:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ycukh",
          "author": "Sthgrey",
          "text": "This matches what I’ve seen too, directories are basically a “scroll feed\" not a research mode. The moment your tagline forces me to think, I’m gone.",
          "score": 2,
          "created_utc": "2026-02-06 19:22:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o421era",
              "author": "Hefty-Airport2454",
              "text": "it is. I do think people genuely use the newsletter and top 5 not the rest. (use in the discovery term))",
              "score": 1,
              "created_utc": "2026-02-07 09:47:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o41t0ns",
          "author": "Anonymous-20212025",
          "text": "This is really insightful, and more importantly, helpful to who are new in this field, particularly to those who are technically good but have very little idea about how to market what they built. \n\nAs a noob I am really grateful for your sharing!\n\nHave saved this valuable post, which, I believe, will be of great help to me.",
          "score": 2,
          "created_utc": "2026-02-07 08:25:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4244ma",
              "author": "Hefty-Airport2454",
              "text": "Glad it helps ! ",
              "score": 2,
              "created_utc": "2026-02-07 10:14:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pvi6g",
          "author": "Remarkable_Brick9846",
          "text": "The 7-9 word sweet spot is really underrated advice. I've noticed the same pattern - the moment a tagline tries to be clever or comprehensive, it loses.\n\nThe outcome-first vs audience-first framing is helpful too. Most founders default to feature-first (\"AI-powered dashboard for X\") which is basically invisible noise at this point.\n\nOne thing I'd add: specificity in the outcome matters. \"Save time\" is weak. \"Cut meeting prep from 2 hours to 10 minutes\" actually registers.",
          "score": 1,
          "created_utc": "2026-02-05 14:07:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pwfox",
              "author": "Hefty-Airport2454",
              "text": "The more specific / niche the better indeed",
              "score": 1,
              "created_utc": "2026-02-05 14:12:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qiles",
          "author": "bundlesocial",
          "text": "aight I know that this is promo but will bite\n\n\\>A fun exercise to prove how good it is : Give me your current tagline (and website) and I’ll recraft your tagline\n\nI often do something along the lines of [bundle.social](http://bundle.social) social media API with no account limits, got any suggestions?",
          "score": 1,
          "created_utc": "2026-02-05 16:02:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qmihh",
              "author": "Hefty-Airport2454",
              "text": "Sort of. Here how I would tweak it :\n\n* Social media API for scheduling and analytics\n* Schedule, analyze, and automate social via one API\n\nYour one is already good honestly. I go deeper on my playbook here : [https://startuphunt.io/before-you-launch](https://startuphunt.io/before-you-launch)",
              "score": 1,
              "created_utc": "2026-02-05 16:20:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ri8r9",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 18:47:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3rxein",
              "author": "Hefty-Airport2454",
              "text": "\"Localhost tunnels with zero configuration required\" or \"Secure tunneling for webhooks and local testing\"\n\nI go more into detail in my playbook : [https://startuphunt.io/before-you-launch](https://startuphunt.io/before-you-launch)",
              "score": 1,
              "created_utc": "2026-02-05 19:57:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3suyso",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 22:40:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vf6nj",
              "author": "Hefty-Airport2454",
              "text": "**Product design tool that exports actual specs** OR **Structure product ideas into dev-ready specs**\n\nI go deeper in the how in the playbook : [https://startuphunt.io/before-you-launch](https://startuphunt.io/before-you-launch)\n\n",
              "score": 2,
              "created_utc": "2026-02-06 09:07:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3upf23",
          "author": "billionaire2030",
          "text": "How about this for my product \n\n\"A JD contextured AI resume scanner, every Job seeker should use\"",
          "score": 1,
          "created_utc": "2026-02-06 05:21:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vcqj4",
              "author": "Hefty-Airport2454",
              "text": "suggestion : Match your resume to any job description\n\nI go deeper in the how in the playbook : [https://startuphunt.io/before-you-launch](https://startuphunt.io/before-you-launch)",
              "score": 1,
              "created_utc": "2026-02-06 08:44:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3vd7v3",
                  "author": "billionaire2030",
                  "text": "But what about stating the user for this product upfront",
                  "score": 1,
                  "created_utc": "2026-02-06 08:48:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3uy9gb",
          "author": "WorthFan5769",
          "text": "this is useful breakdown especially the seven to nine word sweet spot and outcome first framing, most taglines are vague positioning garbage that sounds impressive but says nothing, linking feature to audience with action verb is the clarity most founders skip, drop your tagline and website and ill give feedback",
          "score": 1,
          "created_utc": "2026-02-06 06:32:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vcay4",
              "author": "Hefty-Airport2454",
              "text": "they are not garbage. I would say \"fancy\" & egocentric",
              "score": 1,
              "created_utc": "2026-02-06 08:40:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3v7vfs",
          "author": "Internal_Ad_6405",
          "text": "# Convert Files & Calculate Values All in One Place\n\n[https://filetoconvert.com/](https://filetoconvert.com/)",
          "score": 1,
          "created_utc": "2026-02-06 07:58:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vcx0z",
              "author": "Hefty-Airport2454",
              "text": "suggestion : **Convert files and run calculations instantly**\n\nI go deeper in the how in the playbook : [https://startuphunt.io/before-you-launch](https://startuphunt.io/before-you-launch)\n\n",
              "score": 1,
              "created_utc": "2026-02-06 08:45:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wh14f",
          "author": "NoKeyNoKey423",
          "text": "i think the key takeaway here is to keep it simple and focus on the problem you're solving, rather than trying to sound clever or revolutionary - it's all about making that instant connection with your audience. the examples given are really helpful in illustrating this point.",
          "score": 1,
          "created_utc": "2026-02-06 13:53:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3x8cj3",
              "author": "Hefty-Airport2454",
              "text": "yes for sure. Here it's a \"simple\" unperfect way. But it filters many wrong thing we can do.",
              "score": 1,
              "created_utc": "2026-02-06 16:10:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3x32k7",
          "author": "AchillesFirstStand",
          "text": "Give examples ",
          "score": 1,
          "created_utc": "2026-02-06 15:45:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3x8z84",
              "author": "Hefty-Airport2454",
              "text": "exemple of good or bad taglines ?",
              "score": 2,
              "created_utc": "2026-02-06 16:13:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3ykank",
                  "author": "AchillesFirstStand",
                  "text": "Yeh, like the 10 best you found",
                  "score": 1,
                  "created_utc": "2026-02-06 19:59:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o43jvva",
          "author": "47Industries",
          "text": "This is fascinating! Data-driven insights like this are gold for builders. What were the biggest surprises you found? I'm always curious about the gap between what founders think will work vs what actually drives early traction. Building something myself and trying to avoid the common pitfalls.",
          "score": 1,
          "created_utc": "2026-02-07 16:02:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o43q6ph",
              "author": "Hefty-Airport2454",
              "text": "Surprise? That patterns actual exists and 93% of launches receive NO visits\n\nI go more into detail in my playbook : [https://startuphunt.io/before-you-launch](https://startuphunt.io/before-you-launch)\n\n  \n",
              "score": 1,
              "created_utc": "2026-02-07 16:33:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o44b1tl",
                  "author": "47Industries",
                  "text": "Wow 93% getting zero visits is brutal but not surprising. Most people just throw stuff out there without any real launch strategy. Your playbook looks solid, the pre launch validation stuff especially. Do you have data on what the successful 7% did differently? Like was it mostly about having an existing audience or were there other patterns",
                  "score": 2,
                  "created_utc": "2026-02-07 18:16:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o46qura",
          "author": "Academic-Mode5421",
          "text": "Yeah can you review my landing page? I kinda went at it without actually researching what works. I think it looks great but idk I’m a newbie.",
          "score": 1,
          "created_utc": "2026-02-08 02:32:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qbz9d",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 15:32:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qfguw",
              "author": "Hefty-Airport2454",
              "text": "not really a versus. More like a choice. Some A/B testing to be done here\n\nfor you :\n\n* QR reviews for busy local businesses\n* Turn customer visits into shareable reviews\n\ni made a playbook to make good launches  here : [https://startuphunt.io/before-you-launch](https://startuphunt.io/before-you-launch)",
              "score": 1,
              "created_utc": "2026-02-05 15:48:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qdn3t",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 15:39:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qgqxz",
              "author": "Hefty-Airport2454",
              "text": "Yours is already awesome. Some others :\n\n* AI content that actually sounds like you\n* Train AI on your posts, clone your voice\n\nI made a playbook where i go deeper : [https://startuphunt.io/before-you-launch](https://startuphunt.io/before-you-launch)",
              "score": 2,
              "created_utc": "2026-02-05 15:54:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3qh1b0",
                  "author": "Ibrasa",
                  "text": "Thanks mate. Will check it out 🙏",
                  "score": 2,
                  "created_utc": "2026-02-05 15:55:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3qgrnl",
              "author": "Hefty-Airport2454",
              "text": "Yours is already awesome. Some others :\n\n* AI content that actually sounds like you\n* Train AI on your posts, clone your voice\n\nI made a playbook where i go deeper : [https://startuphunt.io/before-you-launch](https://startuphunt.io/before-you-launch)",
              "score": 1,
              "created_utc": "2026-02-05 15:54:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qaybe",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": -2,
          "created_utc": "2026-02-05 15:27:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qdxbp",
              "author": "Hefty-Airport2454",
              "text": "??? Out of subject here",
              "score": 2,
              "created_utc": "2026-02-05 15:41:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3qi6n8",
                  "author": "bundlesocial",
                  "text": "thats a bot lamao\n\n",
                  "score": 2,
                  "created_utc": "2026-02-05 16:00:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qy5jgt",
      "title": "I found 10 things that people are willing to do for FREE this week across various SaaS subreddits (Feb 1 - Feb 7 2026)",
      "subreddit": "indiehackers",
      "url": "https://www.reddit.com/r/indiehackers/comments/1qy5jgt/i_found_10_things_that_people_are_willing_to_do/",
      "author": "TooOldForShaadi",
      "created_utc": "2026-02-07 05:38:19",
      "score": 13,
      "num_comments": 15,
      "upvote_ratio": 0.93,
      "text": "- [This guy says he ll do anything tech for free](https://www.reddit.com/r/SaaS/comments/1qxd14g/anything_for_free/)\n- [This guy says he ll help early stage founders scale for free](https://www.reddit.com/r/IndianEntrepreneur/comments/1qxasze/want_to_help_early_stage_founders_for_free/)\n- [This guy says he ll find 20 leads for free](https://www.reddit.com/r/SaaS/comments/1qx13ih/ill_find_you_20_leads_for_free_drop_your_saas/)\n- [This guy says he ll do SEO for free](https://www.reddit.com/r/SaaSSolopreneurs/comments/1qwxs39/your_seo_traffic_doesnt_convert_ill_change_that/)\n- [This guy says he ll test your website for free](https://www.reddit.com/r/SaaS/comments/1qvoslv/ill_test_your_site_for_free_using_an_ai_agent/)\n- [This guy says he ll review your UX for free](https://www.reddit.com/r/SaaS/comments/1qvmniq/ill_review_your_saas_signup_flow_for_free/)\n- [This guy says he ll make a viral video for free](https://www.reddit.com/r/SaaSMarketing/comments/1quto92/well_make_a_viral_video_for_you_for_free/)\n- [This guy says he ll test your website for free](https://www.reddit.com/r/SideProject/comments/1qulse6/ill_test_your_sideproject_website_for_free/)\n- [This guy says he ll audit your startup for free](https://www.reddit.com/r/SaaS/comments/1qttzns/im_a_pm_with_10_years_experience_ill_audit_your/)\n- [This guy says he ll get you customers for free](https://www.reddit.com/r/buildinpublic/comments/1qsno8c/share_your_startup_and_ill_schedule_one_meeting/)",
      "is_original_content": false,
      "link_flair_text": "Knowledge post",
      "permalink": "https://reddit.com/r/indiehackers/comments/1qy5jgt/i_found_10_things_that_people_are_willing_to_do/",
      "domain": "self.indiehackers",
      "is_self": true,
      "comments": [
        {
          "id": "o41e8a9",
          "author": "Otherwise_Wave9374",
          "text": "That list is wild, \"I will test your site with an AI agent\" is basically its own micro-category now.\n\nIt feels like we are watching the early market formation for agent-based services, people do the same thing manually today, but agents make it cheap enough to offer for free as a lead magnet. I have been tracking a few real-world agent use cases here too: https://www.agentixlabs.com/blog/",
          "score": 5,
          "created_utc": "2026-02-07 06:08:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41g28o",
              "author": "TooOldForShaadi",
              "text": "I really wouldn't trust any of the AI code reviews too much",
              "score": 1,
              "created_utc": "2026-02-07 06:24:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o424ep7",
          "author": "No_Matter3411",
          "text": "The real question is how many of these convert into paying customers. Ive seen people run these \"free audit\" campaigns for months and the conversion rate is usually brutal - maybe 2-3% actually become clients. Works great as a lead magnet if you have a clear upsell path, but most of these read like people testing the waters to see if anyone even wants what theyre building.",
          "score": 3,
          "created_utc": "2026-02-07 10:17:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o424tde",
              "author": "TooOldForShaadi",
              "text": "I keep my eyes open for all types of free offers during the week and compile them.  I am thinking of putting. A github repo that aggregates these every week",
              "score": 2,
              "created_utc": "2026-02-07 10:21:23",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o43q7g9",
              "author": "Rich-Emu-1561",
              "text": "It doesn't matter what resources you use. It only convert into real client when your approach is engaging enough.",
              "score": 1,
              "created_utc": "2026-02-07 16:33:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o44bogo",
                  "author": "pocketrob",
                  "text": "I think your point stands as: \"you still need to find real people with real problems you solve\". And damn if it isn't difficult.",
                  "score": 1,
                  "created_utc": "2026-02-07 18:19:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o41nlq3",
          "author": "Far-Storm-9586",
          "text": "hopefully they will not do all work with AI",
          "score": 2,
          "created_utc": "2026-02-07 07:33:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o421qoz",
          "author": "ErickNeo",
          "text": "I also give free AEO audit for brands that are struggling with AI visibility.",
          "score": 2,
          "created_utc": "2026-02-07 09:51:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o427nbt",
          "author": "Old_Instruction_6448",
          "text": "Maybe they are also career switchers trying to gain some experience and build cases for their portfolio. If so, I wish them good luck.",
          "score": 2,
          "created_utc": "2026-02-07 10:48:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42uvot",
          "author": "jonutz_csgo",
          "text": "I also give 1 million to the person that is willing to give me 2 millions :))\n\n",
          "score": 2,
          "created_utc": "2026-02-07 13:49:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o43ietj",
              "author": "16GB_of_ram",
              "text": "Buy one get one free ",
              "score": 1,
              "created_utc": "2026-02-07 15:55:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4310qo",
          "author": "WorthFan5769",
          "text": "most of these free offers are either portfolio building junior skill level or lead gen for paid services later nothing truly free just different payment structures if youre taking them up set clear scope and timeline expectations upfront",
          "score": 2,
          "created_utc": "2026-02-07 14:24:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41am2m",
          "author": "TooOldForShaadi",
          "text": "Reminder that I am not affiliated with anyone and also what would I even get out of this? they are all offering stuff for free so nothing to gain here",
          "score": 1,
          "created_utc": "2026-02-07 05:38:59",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o43pdt8",
          "author": "Rich-Emu-1561",
          "text": "Free resources just work one time only in my opinion. I decided to use a lead gen **Leadmatically** for reddit. ",
          "score": 1,
          "created_utc": "2026-02-07 16:29:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o456s7f",
          "author": "47Industries",
          "text": "Really interesting list! The feedback exchange thing is so underrated. People love giving their opinion when you ask nicely. I've found that even just posting 'would love feedback on this concept' in communities gets way more engagement than expected. Have you tried any of these approaches yourself yet?",
          "score": 1,
          "created_utc": "2026-02-07 21:01:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qycsl2",
      "title": "We are living in the!! golden age of technology",
      "subreddit": "indiehackers",
      "url": "https://www.reddit.com/r/indiehackers/comments/1qycsl2/we_are_living_in_the_golden_age_of_technology/",
      "author": "AgentHomey",
      "created_utc": "2026-02-07 12:40:21",
      "score": 13,
      "num_comments": 26,
      "upvote_ratio": 0.88,
      "text": "I’m an indie dev and one of my small side projects (simple calorie + habit tracking mobile app) just has started earning me money. Not an impressive number by startup-Twitter standards, but it covers my devops costs, AI tools, and about half of my car payment. More importantly, it’s stable and still growing month over month.\n\nWhat surprised me most is that none of this came from TikTok hype, Instagram reels, or viral launches. No big audience. No “growth hacks.” Just a boring combination of shipping consistently, fixing UX friction, listening to user complaints, and iterating for months.\n\nPeople keep saying the app market is dead, SaaS is saturated, hardware is impossible, etc. From what I’m seeing, that’s mostly noise. Revenue still compounds if you keep improving something real. Whether you’re building a mobile app, a SaaS, or even a physical product: if users are getting value and you keep showing up, the curve eventually bends upward. It’s not glamorous, but it works.\n\nI’m still iterating on my app daily, and I expect it to keep growing and not because of hype, but because people actually use it.\n\n**If you’re in a slump right now: don’t stop. This is probably the best time in history to keep building.**",
      "is_original_content": false,
      "link_flair_text": "Sharing story/journey/experience",
      "permalink": "https://reddit.com/r/indiehackers/comments/1qycsl2/we_are_living_in_the_golden_age_of_technology/",
      "domain": "self.indiehackers",
      "is_self": true,
      "comments": [
        {
          "id": "o42ltok",
          "author": "Vaibhav_codes",
          "text": "Love this consistency and listening to users beats hype every time. Small wins add up faster than most expect.",
          "score": 2,
          "created_utc": "2026-02-07 12:51:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42ndp3",
          "author": "Adam_mf",
          "text": "Congrats! What specifically helped move the most for you tho? Like a new feature? Or the way you did distribution",
          "score": 2,
          "created_utc": "2026-02-07 13:01:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42r9ut",
              "author": "AgentHomey",
              "text": "I've never seen a huge spike, just a constant stream of downloads. The first couple of months the app was free, I've recently added IAPs. And I continued adding new features (latest feature is i18n in spanish and a fasting tracker) ",
              "score": 2,
              "created_utc": "2026-02-07 13:27:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o42nxsl",
          "author": "CaptainSuperStrong",
          "text": "Shipping small, listening closely, and compounding improvements is still the cheat code",
          "score": 2,
          "created_utc": "2026-02-07 13:05:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o430wx1",
          "author": "WorthFan5769",
          "text": "congrats on hitting profitability most people quit before the curve bends upward your approach is the opposite of what gets posted online which is why it worked boring consistent execution beats viral hype every time whats the app called and how long did it take to hit positive cash flow",
          "score": 2,
          "created_utc": "2026-02-07 14:24:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43433s",
          "author": "Grampsy25",
          "text": "Agreed",
          "score": 2,
          "created_utc": "2026-02-07 14:41:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43l8ag",
          "author": "selldomdom",
          "text": "This is the kind of post people need to read. Consistent shipping and real user feedback still wins, even without hype. Congrats on hitting real, growing revenue. Keep going.",
          "score": 1,
          "created_utc": "2026-02-07 16:09:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43oo60",
          "author": "AchillesFirstStand",
          "text": "Nice!",
          "score": 1,
          "created_utc": "2026-02-07 16:26:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43pytt",
          "author": "blakeyuk",
          "text": "Nice. Consistency, realistic outcomes, and not a mention of your product in your post.",
          "score": 1,
          "created_utc": "2026-02-07 16:32:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43rffa",
          "author": "Weekly-Sentence1636",
          "text": "Love this post, needed to hear it today.\n\nI'm in a similar boat - solo dev, built Queryra, an AI search plugin for WooCommerce. The problem is simple: default WooCommerce search is keyword-only, so when someone types \"gift for dad who likes gardening\" they get 0 results even if the store sells garden gloves and seed kits.\n\nJust launched on [WordPress.org](http://WordPress.org) about a week ago. No viral moment, no big audience. What's working: posting in Facebook groups with a genuine \"here's a problem I solved\" angle. Got 44 downloads in one day from that. Total around 85 now. No paying customers yet, but people are trying it.\n\nThe hardest part isn't building - it's the gap between \"people download it\" and \"people actually use it and pay.\" Right now I'm trying to figure out where users drop off in the setup process. Classic activation problem.\n\nYour point about \"fixing UX friction and listening to user complaints\" hits hard. That's exactly where I am - the product works, now I need to make onboarding so smooth that non-technical store owners can set it up without thinking.\n\nWhat was the turning point for you between \"people download it\" and \"people actually pay\"?",
          "score": 1,
          "created_utc": "2026-02-07 16:39:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o444466",
          "author": "botapoi",
          "text": "that's the dream right there, consistent revenue from something useful beats chasing viral moments every time. been building similar stuff with blink and the builtin database plus auth saves so much time that you can actually focus on making the product better instead of wrestling with infrastructure",
          "score": 1,
          "created_utc": "2026-02-07 17:42:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o448ynk",
          "author": "Electrical-Face-9291",
          "text": "I guess truee",
          "score": 1,
          "created_utc": "2026-02-07 18:06:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44bb3c",
          "author": "pocketrob",
          "text": "I'm curious where you found your users and how you engaged them genuinely?",
          "score": 1,
          "created_utc": "2026-02-07 18:17:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44x1xm",
          "author": "Relevant-Ad-7577",
          "text": "This is refreshing to read.   \n  \nMy first project was the opposite.   \n  \nChased the viral launch, built in isolation for 2 years, zero revenue.   \n  \nNow building something new with exactly the approach you describe.   \n  \nNo hype, just showing up every day, listening to users, fixing what's broken.   \n  \nWay less exciting to talk about but actually sustainable.   \n  \nThe 'app market is dead' noise is just people who gave up too early looking for excuses.",
          "score": 1,
          "created_utc": "2026-02-07 20:08:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45116t",
          "author": "Any-Scheme5954",
          "text": "Congratulations! I'm very curious how you found your first users! I'm also looking forward to seeing your future performance.",
          "score": 1,
          "created_utc": "2026-02-07 20:29:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o457svz",
          "author": "podwatch-dev",
          "text": "Super inspirational, it took AI getting to today's point to wake me up and start building daily, with the latest models all the excuses melted away. If you aren't building something, you are lying to yourself by saying you don't have the time.",
          "score": 1,
          "created_utc": "2026-02-07 21:06:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45ijb8",
          "author": "ycfra",
          "text": "the part about it being boring is what most people don't talk about. no one posts 'iterated on onboarding flow for 3 months' on twitter because it's not flashy, but that's usually what actually moves the needle. congrats on the momentum",
          "score": 1,
          "created_utc": "2026-02-07 22:04:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45pug6",
          "author": "silicoAI",
          "text": "Thanks for keeping us motivated 🫡",
          "score": 1,
          "created_utc": "2026-02-07 22:44:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o467cdu",
          "author": "47Industries",
          "text": "Absolutely agree! The speed of innovation right now is incredible. What really gets me excited is how accessible these tools have become. Five years ago you needed a massive team to build something meaningful, now a solo founder can ship a full SaaS product using AI, no code platforms, and cloud infrastructure that scales automatically. The barrier to entry has never been lower, which means more problems are getting solved by people who actually understand them firsthand. Are you working on anything that takes advantage of these new capabilities?",
          "score": 1,
          "created_utc": "2026-02-08 00:31:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46po61",
          "author": "jim0u",
          "text": "Thanks for your insights! How long since you pushed your app live and got your first paid users?",
          "score": 1,
          "created_utc": "2026-02-08 02:24:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46py5u",
          "author": "Academic-Mode5421",
          "text": "That what I was worried about, hopefully I can catch the same train as you.",
          "score": 1,
          "created_utc": "2026-02-08 02:26:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46yhjg",
          "author": "Obvious_Cheetah240",
          "text": "I agree 100% with you! Consistency is key. Show up, and you will get the results.",
          "score": 1,
          "created_utc": "2026-02-08 03:21:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46zydq",
          "author": "Sharp_Animal",
          "text": "love this. same playbook worked for me building smarter.day - i keep a tiny friction log and ship 1 fix a day, plus a simple in-app changelog so users see progress. offline sync and figuring out our AI scoring took longer than planned, but those boring wins moved retention alot more than any launch. keep going - steady > shiny.",
          "score": 1,
          "created_utc": "2026-02-08 03:30:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42svks",
          "author": "Otherwise_Wave9374",
          "text": "This is the most encouraging kind of indie story because it is not a one-week spike, it is a repeatable loop.\n\nTotally agree that \"no audience\" is not a blocker if the product nails a real job to be done and you keep tightening the funnel.\n\nWe have a few posts on building that steady SaaS growth engine (positioning, onboarding, retention) here: https://blog.promarkia.com/",
          "score": 0,
          "created_utc": "2026-02-07 13:37:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwala2",
      "title": "Just dropped a fully self-hostable Docker version of a2n – no white-label BS, deploy wherever you want",
      "subreddit": "indiehackers",
      "url": "https://www.reddit.com/r/indiehackers/comments/1qwala2/just_dropped_a_fully_selfhostable_docker_version/",
      "author": "Southern_Tennis5804",
      "created_utc": "2026-02-05 03:45:24",
      "score": 10,
      "num_comments": 18,
      "upvote_ratio": 1.0,
      "text": "We've all been there: you love the idea of self-hosting your automations for control and zero recurring costs, but then n8n's setup feels like a part-time job—Docker compose tweaks, Postgres/Redis config, keeping everything updated without breaking flows.\n\nFor the lighter, everyday stuff (Sheet syncs, Slack alerts, simple AI triggers), I wanted something that still gives you the drag-and-drop canvas you're used to... but deploys in literally one command and just runs.\n\nSo I made the full a2n backend (the same engine behind a2n.io) open and Docker-ready. Repo here: https://github.com/johnkenn101/a2nio\n\nOne-liner to spin it up:\n\n```bash\n\ndocker run -d --name a2n -p 8080:8080 -v a2n-data:/data sudoku1016705/a2n:latest\n\n```\n\nHit http://localhost:8080 and you're in. Built-in embedded DB + Redis so no external services needed for quick tests. For real use, just pass your own Postgres/Redis URLs and secrets.\n\nWhat you get out of the box:\n\n\\- Same visual builder: nodes, connections, real-time execution/logs\n\n\\- 30+ integrations: Google Sheets/Slack/Notion/Telegram/Gmail/GitHub/Discord/OpenAI/Twilio/etc.\n\n\\- Built-in AI agent nodes (supports OpenAI, Claude, Gemini, Grok – tool use and all)\n\n\\- No white-label restrictions or forced branding – it's MIT licensed, your instance, your rules\n\n\\- Unlimited executions/workflows when self-hosted (no artificial caps)\n\nIt's not a 1:1 n8n clone—node library is smaller (growing), no ultra-deep custom code nodes yet, but for the 80% of practical flows that actually ship? This cuts the deployment pain to almost zero.\n\nI've been running it locally and on a cheap VPS—feels snappy, data stays private, and no more \"update broke my instance\" surprises.\n\nIf you're tired of heavy orchestration for simple things, give the Docker image a spin and tell me what breaks first (or what you'd want added). What's stopping you from self-hosting more automations right now—setup complexity, missing nodes, or just not worth the hassle? Genuinely want to hear.",
      "is_original_content": false,
      "link_flair_text": "Self Promotion",
      "permalink": "https://reddit.com/r/indiehackers/comments/1qwala2/just_dropped_a_fully_selfhostable_docker_version/",
      "domain": "self.indiehackers",
      "is_self": true,
      "comments": [
        {
          "id": "o3ocxo2",
          "author": "_devmanoharrr",
          "text": "The real win here is one-command deploy - self-hosting only matters if setup friction stays near zero.",
          "score": 2,
          "created_utc": "2026-02-05 06:46:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3onixv",
              "author": "Southern_Tennis5804",
              "text": "Cool",
              "score": 1,
              "created_utc": "2026-02-05 08:24:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3p415m",
          "author": "Basic-Plankton3537",
          "text": "Love this. Self-hostable + deploy anywhere is a huge win especially for teams that care about control and privacy. Big differentiator over the usual locked-in SaaS.",
          "score": 2,
          "created_utc": "2026-02-05 11:01:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pjhk1",
          "author": "yesiliketacos",
          "text": "Looks really cool",
          "score": 2,
          "created_utc": "2026-02-05 12:57:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q1624",
          "author": "No-Intention-5521",
          "text": "lmaooo this is really connivence",
          "score": 2,
          "created_utc": "2026-02-05 14:37:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3veknz",
          "author": "Forsaken_Lie_8606",
          "text": "tbh ive been playing around with self hosting automation tools for a while now and imo one of the biggest hurdles is getting everything to work seamlessly together, so kudos to you for tackling that issue%shead on with a2n. i had a similar experience with trying to set up n8n, spent like 5 hours just getting the postgres config right lol. anyway, im curious to know how you plan on handling updates and security patches for the docker version, are you gonna have some kind of automated update system or will%susers have to manually update their containers?",
          "score": 2,
          "created_utc": "2026-02-06 09:01:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3y63we",
              "author": "Southern_Tennis5804",
              "text": "For upgrade user need to manually upgrade container. very soon will share those details i suggest join discord for live updates, discord link in github",
              "score": 1,
              "created_utc": "2026-02-06 18:50:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ycyt8",
          "author": "Sthgrey",
          "text": "Nice. The “n8n feels like a part-time job” line is painfully accurate for anyone who’s tried to keep Postgres/Redis + upgrades stable.",
          "score": 2,
          "created_utc": "2026-02-06 19:23:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zk5cr",
          "author": "nezerwa",
          "text": "Amazing",
          "score": 2,
          "created_utc": "2026-02-06 23:01:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3o4881",
          "author": "Rfksemperfi",
          "text": "So cool, can’t wait to try/break it for you in the morning!",
          "score": 1,
          "created_utc": "2026-02-05 05:35:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3o8js3",
              "author": "Southern_Tennis5804",
              "text": "Cool",
              "score": 1,
              "created_utc": "2026-02-05 06:09:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3obdqw",
          "author": "Useful-Process9033",
          "text": "looks dope!",
          "score": 1,
          "created_utc": "2026-02-05 06:33:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3t8rly",
          "author": "j12usedfor",
          "text": "good shit",
          "score": 1,
          "created_utc": "2026-02-05 23:56:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3tz85t",
          "author": "Ecaglar",
          "text": "one command deploy is the whole game tbh. ive abandoned so many self-hosted tools because the setup took longer than id ever use them :)",
          "score": 1,
          "created_utc": "2026-02-06 02:31:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o40lfb2",
              "author": "16GB_of_ram",
              "text": "Although you do have to inspect the scripts and make sure there are no issues.",
              "score": 1,
              "created_utc": "2026-02-07 02:43:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3y2ih9",
          "author": "Nervous-Stretch1591",
          "text": "how can i post here whenever i post modertor remove it how to fix this ",
          "score": 1,
          "created_utc": "2026-02-06 18:33:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43pnic",
          "author": "47Industries",
          "text": "Nice work on the Docker deployment! Self hosted solutions are huge right now especially with all the privacy concerns around third party services. The one command setup is smart - removes so much friction for people wanting to try it out. \n\nHow are you handling updates and data migration between versions? Thats usually the tricky part with self hosted stuff.",
          "score": 1,
          "created_utc": "2026-02-07 16:30:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxd5uv",
      "title": "Friday Share Fever 🕺 Let’s share your project!",
      "subreddit": "indiehackers",
      "url": "https://www.reddit.com/r/indiehackers/comments/1qxd5uv/friday_share_fever_lets_share_your_project/",
      "author": "diodo-e",
      "created_utc": "2026-02-06 09:31:21",
      "score": 7,
      "num_comments": 69,
      "upvote_ratio": 0.73,
      "text": "I'll start.  \nMine is [Beatable](https://beatable.co), to help you validate your project:\n\n[https://beatable.co/startup-validation](https://beatable.co/startup-validation)\n\nWhat about you?",
      "is_original_content": false,
      "link_flair_text": "Sharing story/journey/experience",
      "permalink": "https://reddit.com/r/indiehackers/comments/1qxd5uv/friday_share_fever_lets_share_your_project/",
      "domain": "self.indiehackers",
      "is_self": true,
      "comments": [
        {
          "id": "o3wa7ib",
          "author": "z_duane_93",
          "text": "I built https://ugccopilot.ai, It’s an AI UGC tool that automates Trend Analysis, Viral Hook Scripting, AI Persona Creation, and renders final ads with Veo 3.1/Sora 2. No prompting required.",
          "score": 6,
          "created_utc": "2026-02-06 13:16:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wbssm",
              "author": "diodo-e",
              "text": "Nice!",
              "score": 1,
              "created_utc": "2026-02-06 13:25:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3wpik4",
                  "author": "z_duane_93",
                  "text": "Thanks!",
                  "score": 1,
                  "created_utc": "2026-02-06 14:38:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3vj5ia",
          "author": "greyzor7",
          "text": "Building an all-in-one pack for founders who want more than \"just another launch\"\n\nLaunch, reach 30k+ makers, get users & customers - [microlaunch.net/premium](http://microlaunch.net/premium)\n\nLifetime, auto-distribution, marketplace spots, 700+ customers so far.",
          "score": 4,
          "created_utc": "2026-02-06 09:46:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o43lx07",
              "author": "selldomdom",
              "text": "This is a solid offer. The lifetime + auto distribution angle is especially appealing for founders who just want traction without spending weeks on launch strategy.",
              "score": 1,
              "created_utc": "2026-02-07 16:12:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vm7lu",
          "author": "Sea_Dinner5230",
          "text": "https://video2docs.com\n\n•\t⁠upload any app or software walkthrough video and the tool generates a structured step-by-step guide from it with screenshots.",
          "score": 4,
          "created_utc": "2026-02-06 10:14:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vn9e8",
              "author": "diodo-e",
              "text": "Nice, I was looking for something like that. Thanks.",
              "score": 2,
              "created_utc": "2026-02-06 10:24:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wdudd",
          "author": "CaliforniaUniversity",
          "text": "Launched https://racoons.ai?ref=salt helps optimize your website to make more money",
          "score": 5,
          "created_utc": "2026-02-06 13:36:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vj1v4",
          "author": "hurebegz",
          "text": "[**AssetBuilders**](https://www.reddit.com/r/AssetBuilders/)   \n  \nCommunity for builders to meet and share growth tactics.  \n  \nFREE Press Release for all new members. ",
          "score": 3,
          "created_utc": "2026-02-06 09:45:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vkx2l",
          "author": "jundymek",
          "text": "Shipping updates to **FakerFill** this week - focused on faster workflows, templates, and better field detection.\n\n[https://www.fakerfill.com](https://www.fakerfill.com)",
          "score": 3,
          "created_utc": "2026-02-06 10:02:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vi81a",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-02-06 09:37:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3viad7",
              "author": "diodo-e",
              "text": "Tried, very useful.",
              "score": 3,
              "created_utc": "2026-02-06 09:37:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vidr6",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-02-06 09:38:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3viie1",
              "author": "diodo-e",
              "text": "Congrats on your first project! Well done :)",
              "score": 2,
              "created_utc": "2026-02-06 09:40:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3voy0b",
          "author": "zakjaquejeobaum",
          "text": "keinsaas Navigator: [https://keinsaas.com/navigator:](https://keinsaas.com/navigator:) AI Coworker that unifies all interaction with tools, agents and automation. No model dependence and you only pay for what you use.",
          "score": 2,
          "created_utc": "2026-02-06 10:39:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vprur",
              "author": "diodo-e",
              "text": "Wow, congrats!",
              "score": 1,
              "created_utc": "2026-02-06 10:47:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3w17co",
          "author": "o_Oleh",
          "text": "Hey folks! I’m building a tool for cross-platform social media publishing - with a clean design, rich functionality, analytics, scheduling, content calendar, and team collaboration.\n\nLink: [https://shaflex.com](https://shaflex.com)\n\nBest regards, Oleh!",
          "score": 2,
          "created_utc": "2026-02-06 12:18:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wbq44",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-02-06 13:24:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wgape",
              "author": "diodo-e",
              "text": "That’s an amazing idea 😍",
              "score": 1,
              "created_utc": "2026-02-06 13:49:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wg4n2",
          "author": "python55",
          "text": "Tavlo is one home for all your saves, bookmarks, and watch-laters across X, YouTube, TikTok, Reddit, LinkedIn, and more. Instead of disappearing into random folders, your saves become a clean, searchable library with AI summaries and tags, plus Collections you can share and a Discover feed full of other people’s best gems. [https://www.tavlo.ca/](https://www.tavlo.ca/)\n\n",
          "score": 2,
          "created_utc": "2026-02-06 13:49:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wjv5x",
          "author": "Boring-Apartment-687",
          "text": "Building thegc.ai — an iMessage-style group chat where one prompt gets answers from GPT / Claude / Gemini side-by-side so you can compare instantly.\n\nLive: https://thegc.ai",
          "score": 2,
          "created_utc": "2026-02-06 14:09:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wrfbt",
          "author": "Direct-Attention8597",
          "text": "I’m working on [**https://temetro.com/**](https://temetro.com/)   a small tool to add voice or screen context directly to GitHub code reviews. It’s been interesting seeing how a few seconds of explanation can replace long comment threads.\n\nCurious how others here handle this 👀",
          "score": 2,
          "created_utc": "2026-02-06 14:48:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wumnj",
          "author": "originx_games",
          "text": "Local Bank Statement Converter (PDF → CSV) with 100% privacy  \n[https://localbankstatementconverter.com/](https://localbankstatementconverter.com/)",
          "score": 2,
          "created_utc": "2026-02-06 15:04:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3x272u",
          "author": "Best_Meat2452",
          "text": "Soft launched [pushplay.dev](https://www.pushplay.dev/) — turns your GitHub PRs into short video changelogs. You ship a feature, pick a PR, and get a 30-second video using your repo components with AI voiceover explaining what changed. Way easier to share with users than a wall of text and screenshots / And way more rewarding to see than a PR review!",
          "score": 2,
          "created_utc": "2026-02-06 15:41:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3x31cl",
          "author": "fallendev",
          "text": "[http://thespinlist.com](http://thespinlist.com)\n\nIt's like Letterboxd but for albums. Mostly building it to scratch an itch and to learn some NextJS. It's been fun building it so far. Just need to do some polishing before I can officially launch.",
          "score": 2,
          "created_utc": "2026-02-06 15:45:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3x9wnk",
          "author": "Dangerous_Pin594",
          "text": "My project is [Aware](https://chromewebstore.google.com/detail/aware/apmioggmlmbdbaifamomifnfbbbbibhl). I built it because I kept losing hours on YouTube 🎢. It asks “Why did you open this?”, helps me stay focused, and lets me take voice/text notes linked to each video.",
          "score": 2,
          "created_utc": "2026-02-06 16:18:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xc4ve",
          "author": "IndividualAir3353",
          "text": "I’m building a few\nProjects that are ready for users\n\nhttps://bittorrented.com a torrent-first\nStreaming platform\n\nhttp://marksyncr.com a free bookmarks synchronizer web extension for chrome safari and Firefox based browsers\n\nhttp://defpromo.com a zero-cloud self promotion web extension for all browsers  helps automate commenting on social media posts to promote your product  api keys required  \n\nhttps://giv1.com Publish Newsletters & Podcasts. The complete platform for content creators. Publish beautiful newsletters and podcasts\n\nhttps://tutorlinkup.com The Premier Cryto-friendly Marketplace for Test Taking Services, Tutoring and Homework Help\n\nhttps://www.parklookup.com Explore thousands of national, state, county, and city parks across America. Plan your next adventure today.\n\nhttp://summaryforge.com  Turn long readings into ready-to-study notes and quizzes. Perfect for students cramming before exams.\n\nhttp://coinpayportal.com a non custodial crypto payment gateway   Easy to integrate similar to stripe with web hooks and manage multiple businesses  \n\nhttp://qrypt.chat a free quantum resistant chat application \n\nhttp://disrupthire.com ai assisted engineer consulting services \n\nhttp://saasrow.com link directory for saas and ai\n\nhttp://ugig.net Connect with skilled engineers and workers who leverage AI tools to deliver exceptional results. Free to browse, free to apply.\n\nhttp://cryptoshot.space an ethereum jackpot game just connect your wallet and take a shot at the jackpot contract is open source \n\nhttps://postammo.com a viral content idea generator for social media posters. Includes native mobile, PWA and web extension apps.\n\nhttp://icemap.app an anonymous, real-time incident reporting platform that helps communities stay informed about what's happening around them.\n\nhttps://github.com/profullstack/ugig.net/blob/master/awesome-agent-platforms.md A curated list of platforms where AI agents can post, socialize, find work, and participate in the emerging agent economy.\n\nhttp://pairux.com - (coming soon) Collaborative screen sharing with simultaneous remote mouse and keyboard control. Like Screenhero, but open source.\n\nIf you want to try out an app and provide feedback you can always email support@<domain.name> or join our discord at: https://discord.gg/U7dEXfBA3s\n\n---\n\n☎️ Hire me: Anthony \"Chovy\" at +1 (408) 656-2473.\nI'll build you something similar for $500 USD per week.\nhttps://github.com/profullstack",
          "score": 2,
          "created_utc": "2026-02-06 16:28:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3y21kj",
          "author": "BenjyDev",
          "text": "Hey IH 👋\n\nBuilding RestoreProof — a tool that proves your backups actually restore.\n\nThe backstory: lost prod data twice at a previous company. One time the backups didn't even exist. Recently tested a Postgres backup from Supabase — it was there but incomplete. Missing tables, truncated data.\n\nLooked for solutions: Veeam and Commvault do backup validation, but only inside their own ecosystem at enterprise pricing. Nothing vendor-agnostic for SMBs.\n\nSo I'm building it. The concept:\n→ Deploy a runner on your infra\n→ It restores your backup in an isolated container\n→ Runs verification (SQL queries, file checks, archive integrity)\n→ Signs the report cryptographically\n→ Destroys everything — zero data leaves your network\n\nDashboard for CTOs and auditors (ISO 27001 / SOC 2).\n\nSolo founder, Go + Vue.js, MVP nearly done. Landing page is live to gauge interest.\n\nhttps://restoreproof.io \n\nAnyone dealt with this problem? Would love to hear your take.",
          "score": 2,
          "created_utc": "2026-02-06 18:31:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3y6bes",
              "author": "diodo-e",
              "text": "Hello there 👋🏻\nInteresting story, thanks for sharing",
              "score": 2,
              "created_utc": "2026-02-06 18:51:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ygafb",
          "author": "Acceptable-Egg-1801",
          "text": "I'm building ~[Focus Pocus](https://www.focuspocusapp.com/)~. It's for people who want to organize work, life, and personal goals all in one place:\n* Create multiple goals and milestones. Then, add your squads to collab.\n* Get it out of your head and into Focus Pocus by text or email\n* Create focus sessions to lock in\n* Organize work with an AI assistant\n* Audit your time with our busyness calendar\n\nI have a pay what you want model. Also, have codes for users that promise to give me weekly feedback.",
          "score": 2,
          "created_utc": "2026-02-06 19:39:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zmolu",
          "author": "ifedapoolarewaju",
          "text": "Land your first customers by automating your LinkedIn outreach with [Bindago](https://bindago.com)",
          "score": 2,
          "created_utc": "2026-02-06 23:15:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41spbk",
              "author": "diodo-e",
              "text": "Nice. I see a lot of these tools on App Sumo, what’s the main difference?",
              "score": 1,
              "created_utc": "2026-02-07 08:21:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o406br1",
          "author": "invisiblyanon",
          "text": "Task management website www.gettrackli.com",
          "score": 2,
          "created_utc": "2026-02-07 01:09:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o416bpv",
          "author": "escapethematrix_app",
          "text": "[Feedbacks]-AI Rep Counter On-Device with Real-Time Form Analysis.\n\nBuilt this iOS app that auto-counts push-ups, squats, lunges etc. using on-device AI. Just point your camera at yourself-it tracks reps in real time, grades your form afterward, has voice callouts for milestones & reps, and a free widget. 100% private, no sign-in needed for the basics.\n\nhttps://apps.apple.com/in/app/ai-rep-counter-on-device/id6756504196",
          "score": 2,
          "created_utc": "2026-02-07 05:05:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41sflm",
          "author": "Dramatic-Ad5682",
          "text": "I built Runvia, a serverless AI running coach using Flutter + Gemini.\nIt works with a BYOK model: you generate your free Google AI key and paste it into the app, giving full privacy and zero costs.\nIt analyzes your real workouts (Strava/Garmin) and adapts suggestions day by day.\nEarly-stage, free, available on Google Play:\nhttps://play.google.com/store/apps/details?id=com.runvia.app\nCurious for feedback on architecture, AI prompts, and the serverless approach!",
          "score": 2,
          "created_utc": "2026-02-07 08:19:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42gjl6",
          "author": "rjyo",
          "text": "Moshi, a mobile terminal app for iOS. The idea is simple: your AI coding agent runs on a server, but you are not always at your desk. Moshi lets you check on Claude Code, nudge Codex, or monitor any terminal session from your phone.\n\n  \nThe thing that makes it different from other SSH apps is the Mosh protocol, so your session survives WiFi drops, sleep mode, and network switches. Also added voice-to-terminal (runs on-device, no cloud), Face ID for SSH keys, and push notifications when long jobs finish.\n\n  \nBuilt the whole thing with Claude Code over about 6 weeks. Solo founder, bootstrapped.\n\n  \n[https://getmoshi.app](https://getmoshi.app)",
          "score": 2,
          "created_utc": "2026-02-07 12:09:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42jywq",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-02-07 12:37:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42l1vr",
              "author": "wwwgeek",
              "text": "Bookmarks for links is a nice idea, I would maybe set the default language on your landing page to English though ",
              "score": 1,
              "created_utc": "2026-02-07 12:45:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o42qt10",
                  "author": "Hovdev",
                  "text": "Oh, I didn’t realize Korean was set as the default. I’ll fix that right away. Thanks for letting me know!",
                  "score": 2,
                  "created_utc": "2026-02-07 13:24:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3vlx98",
          "author": "beliveapp88",
          "text": "Thanks 🙏",
          "score": 1,
          "created_utc": "2026-02-06 10:12:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vmatb",
              "author": "diodo-e",
              "text": "About what? :)",
              "score": 1,
              "created_utc": "2026-02-06 10:15:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3vmdcf",
                  "author": "beliveapp88",
                  "text": "Sorry I post on the wrong thread",
                  "score": 1,
                  "created_utc": "2026-02-06 10:16:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3yznrk",
          "author": "Alternative-Theme885",
          "text": "i've been trying to validate my own project for months and i'm still not sure if it's worth pursuing, beatable looks like it could be a huge help but the pricing is kinda steep for a solo founder like me",
          "score": 1,
          "created_utc": "2026-02-06 21:16:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3z013j",
              "author": "diodo-e",
              "text": "Just try it, do not overthink on it. Release an MVP and see if somebody is interested.",
              "score": 1,
              "created_utc": "2026-02-06 21:18:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o42kwnv",
          "author": "wwwgeek",
          "text": "Currently building realtime captioning software for live events to promote accessibility. Today we are launching on Product Hunt:  \n[https://www.producthunt.com/products/stagecaptions-io?utm\\_source=reddit&utm\\_medium=social](https://www.producthunt.com/products/stagecaptions-io?utm_source=reddit&utm_medium=social)",
          "score": 1,
          "created_utc": "2026-02-07 12:44:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4387ic",
          "author": "ShakeTheJello",
          "text": "I made a free and single click \"convert page to markdown\" without the noise: [https://plainmarkdown.com](https://plainmarkdown.com) \n\nCurrently only on the Chrome store, but planning to push to Firefox and Edge as well.",
          "score": 1,
          "created_utc": "2026-02-07 15:04:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43c7sd",
          "author": "monkey6",
          "text": "https://paymentsettings.com\n\nLink shortener for payment links; get paid faster\n\nTurn a complicated URL into short one that instantly conveys meaning like pay.rent; 55 domains to choose from.",
          "score": 1,
          "created_utc": "2026-02-07 15:24:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43v1k8",
          "author": "HawkHoldings",
          "text": "I've recently launched Traderverse - the Al-powered social finance network built for people who actually trade and invest seriously. \n\nNo more fragmented apps: connect with verified traders, share real-time insights, join gamified communities, get Al-filtered signals, and collaborate on plays that actually win.\n\nIt's social media reimagined for profit-transparent, rewarding, and retail-first.\n\nRight now, in exclusive alpha, early users are testing the future of trading: building profiles, posting breakdowns, earning badges, and accessing tools the big brokers won't give you.\n\nAny and all feedback would be amazing before pushing out of alpha phase! \n\nhttps://apps.apple.com/us/app/traderverse/id6502639753",
          "score": 1,
          "created_utc": "2026-02-07 16:57:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44q07g",
          "author": "47Industries",
          "text": "Love seeing the Friday share energy! We've been working on MotoRev, a crash detection system for motorcycles. Lost a friend in an accident and realized how many riders go down without anyone knowing where they are or if they need help. The app monitors for crashes and automatically alerts emergency contacts with GPS location. Still in development but the mission keeps us going. Building something that could actually save lives feels different than typical SaaS projects. Always cool to see what everyone else is building too!",
          "score": 1,
          "created_utc": "2026-02-07 19:31:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o451d8t",
          "author": "Any-Scheme5954",
          "text": "[SoulLink AI](https://tr.ee/MtyBK3) This is a new generation companion product. We welcome everyone to use it and provide feedback. All feedback is welcome.",
          "score": 1,
          "created_utc": "2026-02-07 20:31:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45ka1k",
          "author": "Defiant-Chard-2023",
          "text": "I have successfully been selling my digital products — at least one sale a day.  \nI’m not an expert, but here are the **three simple ways I’m growing steadily**.\n\n**Step 1: Build one solid landing page**  \nDon’t overthink it. Create one clear landing page you send all traffic to.  \nIf people don’t immediately understand what you sell and who it’s for, they won’t buy.\n\n**Step 2: Capture the emails**  \nMost people won’t buy on the first visit.  \nGive them content they relate to, earn trust, and keep the conversation going.\n\n**Step 3: Automate the follow-up**  \nAutomate your email sequence.  \nThis is where the real money is made—because consistency beats motivation every time.\n\nThe hardest part isn’t the steps.  \nIt’s managing *everything* together:  \nlanding pages, emails, and payments.\n\nI use a single platform where I handle all of this in one place, which has made selling way easier for me.  \nIf you want to use the same setup to sell your digital product, you can get **free access here**:  \n👉 [https://dripforgeai.com/digital-product-offer](https://dripforgeai.com/digital-product-offer)",
          "score": 1,
          "created_utc": "2026-02-07 22:13:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46sxqi",
          "author": "Complex-Ad-5916",
          "text": "[https://www.dateready.app/](https://www.dateready.app/) \\- a personal dating coach that understands the conversations and suggest what to say next!",
          "score": 1,
          "created_utc": "2026-02-08 02:45:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxge5h",
      "title": "Self-hosted drag-and-drop automations that actually deploy in one command – no compose hell, no extra services",
      "subreddit": "indiehackers",
      "url": "https://www.reddit.com/r/indiehackers/comments/1qxge5h/selfhosted_draganddrop_automations_that_actually/",
      "author": "Southern_Tennis5804",
      "created_utc": "2026-02-06 12:33:23",
      "score": 6,
      "num_comments": 14,
      "upvote_ratio": 0.88,
      "text": "You know the feeling: you want to run your own automation server for privacy, no vendor lock-in, unlimited runs... but then you open the docs and it's \"install Postgres, set up Redis, configure queues, tweak env vars, pray the compose file doesn't explode on update.\"\n\nFor anything beyond a toy project, that tax kills the vibe fast. Especially when you're just trying to get a quick webhook → Slack flow or AI agent that summarizes emails running locally or on a VPS.\n\nI got fed up with it, so I open-sourced the full backend that powers **a2n.io** and made it ridiculously easy to self-host. Repo: https://github.com/johnkenn101/a2nio\n\nTry this one-liner right now:\n\n```bash\n\ndocker run -d --name a2n -p 8080:8080 -v a2n-data:/data sudoku1016705/a2n:latest\n\n```\n\nOpen http://localhost:8080, create your admin account, and you're building flows. Embedded DB + Redis mean **zero** external dependencies for dev, testing, or small personal use. (For production, swap in your own DATABASE\\_URL and REDIS\\_URL – still simple.)\n\nWhat you actually get in that container:\n\n\\- Drag-and-drop canvas (React Flow style – feels familiar if you've used n8n)\n\n\\- 30+ built-in nodes: Webhook/Schedule triggers, Google Sheets/Slack/Notion/Telegram/Gmail/Discord/GitHub/Twilio/OpenAI/Claude/Gemini/Grok, HTTP/GraphQL/SQL, JS/Python code, filters/loops/if-else, file handling, and more\n\n\\- Real AI agent nodes that reason, call tools, and chain LLMs – no extra setup\n\n\\- Live execution monitoring + logs so you see runs happen in real time\n\n\\- MIT license – completely yours, **no white-label forced branding**, no phoning home, unlimited workflows/executions\n\nIt's MIT, so fork it, strip it, brand it, whatever. Your data never leaves your server.\n\nTrade-offs (being straight up):\n\n\\- Node library is smaller than n8n's massive ecosystem (growing, but focused on practical 80/20 stuff)\n\n\\- No ultra-advanced custom scripting depth yet (though JS/Python nodes exist)\n\n\\- Embedded mode is great for quick spins but use external DB/Redis + reverse proxy (Nginx/Caddy/Traefik) for anything exposed or high-traffic\n\n\\- Project is new – repo just went public, so community is tiny and battle-testing is early\n\nI've got mine humming on a cheap VPS for daily drivers (Sheet syncs, notification bots, AI summaries) – deploys fast, runs stable, feels light compared to heavier stacks.\n\nIf the usual self-host setup tax has kept you from running more automations privately, pull the image and mess around for 5 minutes. Worst case, you delete the container.\n\nWhat usually stops you from self-hosting workflow tools like this? The multi-service compose files, worrying about updates breaking things, missing niche nodes, or just \"hosted is easier for now\"? Real talk appreciated – this is meant to scratch that exact itch.",
      "is_original_content": false,
      "link_flair_text": "Self Promotion",
      "permalink": "https://reddit.com/r/indiehackers/comments/1qxge5h/selfhosted_draganddrop_automations_that_actually/",
      "domain": "self.indiehackers",
      "is_self": true,
      "comments": [
        {
          "id": "o3wdfx5",
          "author": "Outrageous_Phrase320",
          "text": "The 'no compose hell' part speaks to my soul. I love n8n, but every time I want to spin up a simple webhook on a small VPS, I dread the resource overhead and the DB configuration. Having an embedded DB/Redis option for lightweight flows is a massive UX win.\n\nQuick question: How's the migration path if I start with the embedded DB and want to scale to external Postgres later? Is it a simple env var swap or do I need to manually migrate the data?\"",
          "score": 1,
          "created_utc": "2026-02-06 13:34:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wkmkd",
              "author": "Southern_Tennis5804",
              "text": "Currently its manual migration, but soon we will add simple migration",
              "score": 1,
              "created_utc": "2026-02-06 14:13:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wtdvw",
          "author": "Hot_Ear_4161",
          "text": "One-liner Docker setup is exactly what I wish more self-hosted tools did.  \nQuick question: How does it handle failed runs? Auto-retry? Or manual re-trigger?  \nThat's usually where I get stuck with automation tools.",
          "score": 1,
          "created_utc": "2026-02-06 14:58:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3xdri1",
              "author": "Southern_Tennis5804",
              "text": "Auto retry and manual re trigger need to be added currently its not supported,",
              "score": 1,
              "created_utc": "2026-02-06 16:35:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3y95dt",
          "author": "SoloNM8",
          "text": "That's interesting idea. Are you using cloud resources or running some home server? I was thinking about automation as well, but anyhow came to Mac Mini",
          "score": 1,
          "created_utc": "2026-02-06 19:04:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o404srg",
          "author": "16GB_of_ram",
          "text": "Cool bro",
          "score": 1,
          "created_utc": "2026-02-07 01:00:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40gsqd",
          "author": "Sergiowild",
          "text": "the single binary approach is nice. n8n's compose setup definitely gets messy once you want persistence and proper backups. does this handle scheduled triggers or just webhooks right now?",
          "score": 1,
          "created_utc": "2026-02-07 02:14:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40zbk9",
          "author": "Ecaglar",
          "text": "the embedded db option is underrated. most self host tools assume youre running a production environment when really you just want to test something quickly. the docker one-liner approach is how more projects should ship",
          "score": 1,
          "created_utc": "2026-02-07 04:14:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o411a3u",
              "author": "Southern_Tennis5804",
              "text": "We supported external postgres DB also, environment variable details present in github",
              "score": 1,
              "created_utc": "2026-02-07 04:28:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o41yruv",
          "author": "WarCool5118",
          "text": "Hey this sounds pretty neat!  \nI have been using a local n8n on a server i own, it does the job well but its kind of annoying since you are somewhat limited in how you can make money from it.\n\nAre the workflows also JSON based?\n\nWill definitely have to check this out!",
          "score": 1,
          "created_utc": "2026-02-07 09:21:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42d6rr",
              "author": "Southern_Tennis5804",
              "text": "Yes Workflow are json based",
              "score": 2,
              "created_utc": "2026-02-07 11:40:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o42o7zr",
          "author": "Forsaken_Lie_8606",
          "text": "ive been in the same boat with trying to set up automation servers and its crazy how much of a headache it can be, especially when youre just trying to get something simple up and running. i remember one time i spent like 5 hours trying to get a zapier alternative working locally and i ended up giving%sup because the docs were so bad. imo, the fact that youve made it possible to self host with zero external dependencies is a total game changer, im definitely gonna have to check out the repo and give it a shot. ngl, the command to get started is ridiculously simple, i love it.",
          "score": 1,
          "created_utc": "2026-02-07 13:07:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43lq2g",
          "author": "selldomdom",
          "text": "Good luck with the app! sounds good.",
          "score": 1,
          "created_utc": "2026-02-07 16:11:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o451oiq",
          "author": "Any-Scheme5954",
          "text": "brilliant idea and Good luck",
          "score": 1,
          "created_utc": "2026-02-07 20:33:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}