{
  "metadata": {
    "last_updated": "2026-03-02 09:15:17",
    "time_filter": "week",
    "subreddit": "learnmachinelearning",
    "total_items": 20,
    "total_comments": 247,
    "file_size_bytes": 232200
  },
  "items": [
    {
      "id": "1rhwrct",
      "title": "A first big tech company ML interview experience: definitely bombed it",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/r/learnmachinelearning/comments/1rhwrct/a_first_big_tech_company_ml_interview_experience/",
      "author": "baronett90210",
      "created_utc": "2026-03-01 13:02:51",
      "score": 296,
      "num_comments": 31,
      "upvote_ratio": 0.99,
      "text": "I work as a Data Scientist in a big semiconductor company and thinking to switch my career and pursue Big Tech. Recently I finally got an opportunity to have my first ML interview in a well-known company and just wanted to post my experience. Overall, I was quite shocked of the questions and how much I still need to learn. I am pretty good at math and fundamental understanding of ML, which are the most needed skills in semiconductor industry. But the interview was no much about the technical things, but rather understanding of a product. It was a case study interview and surely, I was preparing, reading through examples of the case studies. But since I am not from this industry every new example for me requires some learning effort. Unfortunately, I didn't have a chance to look into the recommender systems and this was exactly what I faced in the interview. Overall, I think it went not so good, the hardest part was not ML itself but discussing particular difficulties and edge cases of the product. Here is some overview containing maybe around 70% since I couldn't memorize all of it. Hopefully, it would helpful for you, guys.\n\n**Q: Let's say we want to start a business to recommend restaurants. How do we make a recommendation list for a user without prior data?**\n\nThis is not a difficult question, but I was a bit nervous and said the first thing that came to my mind: we can fetch Google reviews and sort the list. The interviewer obviously was not satisfied and said that I would have millions of good restaurants. I immediately said that we need to sort by location as well. At that moment, my brain kind of thought that the location is already accounted by default so I don't need to even think about it. Weird. I know\n\n**Q: Ok, suppose you have been running your business for some time. How do we modify recommendation**s?\n\nI said that we would need to assemble some data and engineer features. Then we discussed features, I listed some of the client behavior, restaurant attributes. After thinking further mentioned delivery features and external conditions like weather or special events.\n\n**Q: What are the models we can start building?**\n\nI wanted to start simple and proposed to calculate cosine similarities or kNN to recommend restaurants closest to the ones user liked.\n\n**Q: Do you think we lack something?**\n\nI was stumbled a bit since the question is a bit generic. The interviewer hinted: \"How do we know a user liked a restaurant?\". I said that we can do it by reviews. The interviewer said not many people leave reviews. I said we can track user behavior, e.g. if a user ordered more then once from a restaurant or we can monitor click through rate or something like this. The interviewer didn't seem satisfied and explained how he would do it but my brain kind of switched off for a moment and I didn't get the idea.\n\n**Q: What are other more advanced modeling options?**\n\nI proposed a supervised classification approach. We talked a bit on what would be the data: features for different users/restaurant, labels if a user likes a restaurant, possible randomization of samples, like various locations.\n\n**Q: What is the concrete model?**\n\nI said I would start simple with logistic regression.\n\n**Q: What is the cost function for it?**\n\nI said it is binary cross-entropy.\n\n**Q: What else should be in the cost function? Can we have some problems in the data?**\n\nI couldn't immediately come up with problems in the data that should modify the cost function and my brain tried to give me some time for processing this in the background while saying: \"We definitely should add regularization\". I guess this was not an answer the interviewer expected but he agreed it is needed. He briefly asked why do we need regularization, overfitting problems, difference between L1/L2. But then he came back to his original query.\n\n**Q: Due to the nature of recommender systems there be more problems with your samples.**\n\nLuckily, the background processing in my brain came up with imbalanced classes so mentioned it. This was correct.\n\n**Q: So what can we do about it?**\n\nI mumbled that we can do undersampling to balance the classes and also accuracy is a bad metric and we need to track precision and recall and so on, but reviewer asked can we do something about the cost function first? As you can see he really couldn't let it go. Finally, I got his very first question where this discussion started and replied that we can downweight the samples from a majority class. He said that this is what he wanted to hear.\n\n**Q: So what about correct metrics for imbalanced data?**\n\nI explained about precision and recall and said that I would monitor ROC AUC and Precision&Recall AUC modifying the classification threshold. The interviewer clarified which of the metrics is better for imbalanced data? I actually don't deal much with classification problems in my work so didn't have a sharp answer but started thinking out loud that ROC reflects FPR but doesn't directly account for FNR and then the interviewer kind of finished my thinking process saying that indeed PR AUC is better. I think if I had more time I could have reached this conclusion as well, but perhaps this is what true experts should know without thinking about it.\n\n**Q: What are other industry standard you know for the classification?**\n\nI discussed Gradient Boosted Trees and Random Forest, also mentioned Deep Learning, elaborated a bit of interpretability and memory/computation requirements.\n\n**Q: What are the problems we may have for a new registered restaurant?**\n\nI said that it may have a feature we didn't account for before. However, I couldn't really come up with an idea how to deal with it. The interviewer said that the new restaurant should appear at the top of the list so that users have higher chance to order from it.\n\n**Q: And what should be the users to whom we can propose this new restaurant?**\n\nThe ones who has higher probability to like it based on the previous behaviour\n\n**Q: Let's say a user sees top-5 restaurants and choose one. What about the others he doesn't see. Should we mark them as negative?**\n\nI said that obviously not since it will create noise, but I didn't have a clue how to handle that properly. The interviewer explained something but my brain was frozen again and I don't recall what was a correct reply. I only remember that at some point I said \"we can randomize this top-5 list\".\n\n**Q: Let's say you trained the model is it ready to roll out?**\n\nI mentioned cross-validation etc, but that was not what the interviewer wanted. He said we need to do pilot study. I do know what is A/B testing but my confusion was that I kind of thought this pilot study is by default integrated in the roll-off process for some random users. But from the interviewer perspective I guess it simply looked like I didn't even think about it",
      "is_original_content": false,
      "link_flair_text": "Career",
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rhwrct/a_first_big_tech_company_ml_interview_experience/",
      "domain": "self.learnmachinelearning",
      "is_self": true,
      "comments": [
        {
          "id": "o824pxr",
          "author": "aspiringpetrolhead",
          "text": "Thank you for the detailed write up. Joined the sub for posts like these.",
          "score": 64,
          "created_utc": "2026-03-01 14:44:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o86b7dx",
              "author": "Spy_Fox64",
              "text": "I know right? Someone posting useful information and not just spamming their terrible products.",
              "score": 3,
              "created_utc": "2026-03-02 04:15:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o8294r1",
          "author": "Zealousideal-Land356",
          "text": "I used to work in recommendations, the standard practice these days is using deep learning. From the interviewer point of view your answers seems like you do have the fundamental down on basic ML, but not on deep learning and there’s a bit of lacks of real world experience in the area. If it’s a large tech company I’d expect they do use DL instead of the ML approach you mentioned.",
          "score": 41,
          "created_utc": "2026-03-01 15:08:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o82d5yq",
              "author": "baronett90210",
              "text": "Hm, interesting. I understand that DL is frequently used but the interviewer did agree that for the purpose of this interview it is fine to start with a simpler solution and then add complexity \"Logistic Regression -> Gradient Boosted Tree -> DL\" if the product metrics don't perform well enough. Also I discussed that DL would lack interpretability and it seemed the interviewer was satisfied with this",
              "score": 10,
              "created_utc": "2026-03-01 15:28:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o82sltt",
                  "author": "Sheensta",
                  "text": "The perception of satisfaction != actually satisfied. Interviewers won't interrogate you for every last bit of information. They probably thought it was best to just move on to the next topic.",
                  "score": 12,
                  "created_utc": "2026-03-01 16:44:04",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o85cu7l",
                  "author": "fordat1",
                  "text": "Thats great but you avoided the interviewers prompts on choosing loss functions and product metrics so there was no linked basis to use one model vs another",
                  "score": 1,
                  "created_utc": "2026-03-02 00:38:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o85cc68",
              "author": "fordat1",
              "text": "Also it really sounds like the interviewer was trying to help OP and scaffold a discussion on loss functions but OP kept ignoring the hints and taking it as \"not letting it go\"\n\nOP seemed really basic and wouldnt pass or be a a level that is too low for ML focused roles in a FAANG as they tend to start at lowest level that is SWE lowest +1",
              "score": 3,
              "created_utc": "2026-03-02 00:35:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o86s0bx",
              "author": "Substantial_Oil_7421",
              "text": "Curious what kind of Deep Learning methods did you use? Wouldn’t you still have baseline regression/boosted tree based models? \n\nWould be great if you added more flavor with typical approach you took! \n",
              "score": 1,
              "created_utc": "2026-03-02 06:26:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o827gcm",
          "author": "Puzzleheaded_Meat522",
          "text": "This seemed a bit unfair in parts. But I hope you learned a lot from this process. Thanks for posting this. ",
          "score": 16,
          "created_utc": "2026-03-01 14:59:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o82dg0d",
              "author": "baronett90210",
              "text": "Thanks a lot for the support! I did learn a lot, hopefully I will not be running out of companies while I am learning :D",
              "score": 7,
              "created_utc": "2026-03-01 15:30:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o82svrn",
          "author": "FriendlyStory7",
          "text": "Someone mega threat this. This is the type of content we need.",
          "score": 15,
          "created_utc": "2026-03-01 16:45:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81xvau",
          "author": "enricopallazo1",
          "text": "This is why I don’t like live case studies. You were asked to second guess the interviewers approach. This is heavily punishing nervous and slow-thinking candidates. \n\nBut your answers don‘t sound too bad. You showed that you understand fundamental concepts and could explain them. You should not be expected to read the interviewers thoughts and good interviewers know that.",
          "score": 31,
          "created_utc": "2026-03-01 14:05:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o84zcyl",
          "author": "MrJacobJohnson",
          "text": "I guess it's impossible to know everything atm. \n\nI am in the bio field and I know mainly the time series related methods and signal processing. \n\nOh and image processing and CV and combination of both. \n\nI wouldn't be able to talk about recommendations at all. I guess they wanted something close to DRL and markov decision algorithms?",
          "score": 6,
          "created_utc": "2026-03-01 23:19:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o85evti",
              "author": "fordat1",
              "text": "You are supposed to be motivated enough to do the basic research of what the company does and the possible related knowledge for that.",
              "score": 1,
              "created_utc": "2026-03-02 00:50:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o85l82s",
                  "author": "MrJacobJohnson",
                  "text": "Totally. So I wouldn't apply for marketing for example. \n\nBut what I mean, even though I know general stuff it's impossible to know everything. \n\nThe person who will do basic research on time-series data or signal processing won't be able to answer the questions with the same knowledge of the niche as someone who worked there for some time, it's not easy at all.",
                  "score": 1,
                  "created_utc": "2026-03-02 01:29:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o832puh",
          "author": "icybreath11",
          "text": "thanks for the write up! was the role more of ML-ops or more the DS side of ML? \n\nSorry if that doesn't make sense. I'm starting to craft a path to being a MLE and i think I want to be more of a MLops (like a backend SWE that integrates ML things). I'm learning this stuff but not sure how much of this stuff MLops would require",
          "score": 4,
          "created_utc": "2026-03-01 17:32:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o839jwf",
              "author": "baronett90210",
              "text": "hey, it was a DS role. I would say you don't need to know this deeply since MLops has a lot of depths on its own ",
              "score": 3,
              "created_utc": "2026-03-01 18:04:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o83atfc",
                  "author": "icybreath11",
                  "text": "thanks for the response! I'm in a ML class that is more DS than SWE related and this is highly reminiscent of it so was curious",
                  "score": 1,
                  "created_utc": "2026-03-01 18:10:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o837gkf",
          "author": "Ok-Kangaroo-7075",
          "text": "It is not about how smart you are (to a degree maybe) but they invite you because they know you are smart, what they want to figure out is whether you can work on real problems, that you can communicate effectively, that you are nice to work with,…",
          "score": 4,
          "created_utc": "2026-03-01 17:55:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o860pal",
          "author": "SubtlyOnTheNose",
          "text": "MORE OF THIS CONTENT PLS\n\nOP, dont take it personally  youre going from one industry to the next, a whole set of different questions and modes of thinking. Big Tech values are waaay different than hardware. Youll learn their values, their questions and then their answers. Keep at it ;)\n\n+ bombing yhe first interview is good luck. My people have a saying,  \"The first cut is the deepest.\"\n\nThx forbthe awesome content, very educational",
          "score": 5,
          "created_utc": "2026-03-02 03:05:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o85efw3",
          "author": "fordat1",
          "text": ">Overall, I think it went not so good, the hardest part was not ML itself but discussing particular difficulties and edge cases of the product. \n\nThe particular difficulties and decisions in real world application of ML are the ML part in industry.\n\nAs someone who has done the interviewer role people need to hear actual feedback not \"slay queen\" feedback.\n\nA) You interviewed for an ML role at a FAANG and didnt prepare for a rec sys question? The interview process for these companies is super well known and documented in Blind. Hell I wouldnt be surprised if indian or chinese forums even had leaked paraphrases of the interviewer evaluation guide. The interview format and that it would likely be RecSys should be super expected. For an industry candidate to come in without this basic research reeks of \"I plan to learn it all on the job\"\n\nB) The interviewer even in your narrative tried to \"hint\" multiple times from the push to discuss loss functions to the discussion on possible cold start approaches\n\nC) You prepped less than an undergrad with an internship. The answers you gave are similar to the ones undergrads are giving fresh out of bachelors which isnt competitive in the candidate pool at a FAANG . Remember its a competitive process\n\nThis is no hate on you as a person but more hints at what you should have done which is often sadly not what you get on reddit",
          "score": 4,
          "created_utc": "2026-03-02 00:47:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o86yicu",
              "author": "baronett90210",
              "text": "Thanks for the helpful response! Tbh, my recruiter sent me different links of a company blog to read about different ML problems they solved and none of them was  RecSys, so I spent quite some time on preparing to the similar cases I read through. Also, I wonder how could I change the answers so that they didn't seem on undergrad level? Everytime, I wanted to mention something more advanced like SHAP or going deeper into NNs architecture the interviewer explicitly asked me to keep it very simple",
              "score": 1,
              "created_utc": "2026-03-02 07:25:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o83bhgq",
          "author": "bshaman1993",
          "text": "Just curious what you mean you decided to switch and pursue big tech. Aren’t you already a DS at a tech firm?",
          "score": 1,
          "created_utc": "2026-03-01 18:13:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o83fw36",
              "author": "baronett90210",
              "text": "Hey, semiconductor industry is not really a big tech from perspective of salary, direct interaction with users, tangibility of your contributions. I guess the last two explains the first one but still a bit unfair since in semiconductors you have to be much sharper on ML mathematics, linear algebra, optimization and physics as well",
              "score": 2,
              "created_utc": "2026-03-01 18:33:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o848fgl",
                  "author": "bshaman1993",
                  "text": "Ah got it thanks for sharing the interview experience",
                  "score": 1,
                  "created_utc": "2026-03-01 20:56:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o86xymm",
                  "author": "bshaman1993",
                  "text": "Would you mind if I dm you for a referral?",
                  "score": 1,
                  "created_utc": "2026-03-02 07:20:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o86godc",
          "author": "SunsGettinRealLow",
          "text": "This is gold",
          "score": 1,
          "created_utc": "2026-03-02 04:55:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdacr4",
      "title": "Can a CNN solve algorithmic tasks? My experiment with a Deep Maze Solver",
      "subreddit": "learnmachinelearning",
      "url": "https://i.redd.it/0pp26us9gelg1.png",
      "author": "no1_2021",
      "created_utc": "2026-02-24 08:03:07",
      "score": 262,
      "num_comments": 30,
      "upvote_ratio": 0.95,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rdacr4/can_a_cnn_solve_algorithmic_tasks_my_experiment/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o73opkp",
          "author": "BountyMakesMeCough",
          "text": "When you say the model is accurate, you mean on unseen mazes, right?",
          "score": 68,
          "created_utc": "2026-02-24 08:08:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73wcak",
              "author": "pm_me_your_smth",
              "text": "Also what does accuracy even mean here? It's not a standard application of cnn",
              "score": 33,
              "created_utc": "2026-02-24 09:20:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o75em2m",
                  "author": "jack-of-some",
                  "text": "Number of optimally solves mazes / number of total mazes",
                  "score": 13,
                  "created_utc": "2026-02-24 15:24:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o76rur3",
              "author": "no1_2021",
              "text": "Yes",
              "score": 2,
              "created_utc": "2026-02-24 19:05:44",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o74ou8s",
              "author": "NuclearVII",
              "text": "\"He\" means nothing, because this is LLM generated drivel.",
              "score": -8,
              "created_utc": "2026-02-24 13:09:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o75ubqw",
                  "author": "TheOneWhoPunchesFish",
                  "text": "I have gone through the code, and it's not LLM bs.\nMost of the code was added 2 years ago.",
                  "score": 15,
                  "created_utc": "2026-02-24 16:36:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7fleba",
                  "author": "LizFire",
                  "text": "What the fuck are you babbling about?",
                  "score": 1,
                  "created_utc": "2026-02-26 01:03:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o73rdw9",
          "author": "Specialist-Berry2946",
          "text": "Check out \"Can You Learn an Algorithm? Generalizing from Easy to Hard Problems with Recurrent Networks\" - [https://arxiv.org/abs/2106.04537](https://arxiv.org/abs/2106.04537), where they show that nn can solve harder problems during test time by thinking longer - excellent work! ",
          "score": 28,
          "created_utc": "2026-02-24 08:33:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7efw2v",
              "author": "MeticulousBioluminid",
              "text": "fascinating",
              "score": 1,
              "created_utc": "2026-02-25 21:27:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o77bobo",
          "author": "SithLordRising",
          "text": "Really enjoyed reading this, especially the way you framed maze solving as image segmentation rather than classical pathfinding. Generating 500k synthetic maze/solution pairs and pushing a U-Net to learn the mapping is a very clean experimental setup. The fact that it performs strongly up to 64x64 suggests it has genuinely internalised a lot of local path structure rather than just memorising patterns.\n\nI've approached maze solving from the opposite direction. Instead of learning the mapping, I model the maze explicitly as a graph:\n\nCells as vertices\nOpen passages as edges\nExplicit frontier / explored sets\n\nFrom there I use DFS, BFS, and A* with admissible heuristics (Manhattan for grids, cube distance for hex). So the solver is symbolic and deterministic. Optimality is guaranteed under the usual conditions (BFS for unweighted graphs, A* with admissible heuristic), and scaling behaviour is predictable: O(V+E).\n\nWhat's interesting is that your scaling limit around 127x127 makes perfect sense from a structural perspective.\n\nA CNN-based U-Net has:\n\nStrong local inductive bias (convolutions capture neighbourhood structure well)\nWeak global state representation\nNo explicit frontier expansion or path memory\n\nSo at small/medium sizes, it can approximate \"flow along corridors\" because that behaviour is locally consistent. But once the maze requires multi-stage global reasoning (long-range dependencies, dead-end propagation, or path decisions that depend on distant structure) the network has to simulate something like a search algorithm implicitly inside its activations. Convolutions are not naturally suited to that unless you add mechanisms for global context (attention, recurrence, or explicit graph structure).\n\nIn contrast, a graph search algorithm scales because it explicitly maintains state: frontier ordering, backtracking stack, accumulated cost, etc. It does not need to infer traversal logic; it executes it.\n\nThat said, I do not see your approach as competing with classical algorithms. It is answering a different question: can a neural network internalise algorithmic reasoning from data?\n\nIn that sense, the wall you're hitting is a very informative result rather than a failure. It is highlighting the boundary between local pattern recognition and structured multi-step reasoning.\n\nIf you wanted to push further, architectures that inject structural bias might help, e.g. graph neural networks, neural A* variants, attention layers that allow global communication, or iterative refinement steps that simulate expansion. A pure segmentation network is fighting its own inductive bias at larger scales.\n\nOverall, this is a thoughtful experiment and very cleanly executed. It's especially interesting that you used DFS to generate the ground truth, so in a way, the model is trying to approximate a classical algorithm without being given the algorithm itself.\n\nCurious to see how far you can push it with structural modifications.",
          "score": 7,
          "created_utc": "2026-02-24 20:37:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o745v52",
          "author": "Chelokot",
          "text": "Would be very interesting (although probably far more complex) to train some kind of recurrent version of this cnn, that just works until  at some step it produces full segmentation. It will (maybe) generalize better to bigger mazes, but it's not immediately obvious to me what kind of hidden space you'd need to make it universal (is it enough to just run RNN recurrently on some C×X×Y for constant C for any X and Y, or does required C grow with X and Y?)",
          "score": 6,
          "created_utc": "2026-02-24 10:49:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o742qtr",
          "author": "EverythingGoodWas",
          "text": "This raises more questions than answers.  I don’t know how a cnn could really be useful in this situation unless you just have it essentially going “yep i can go that way”.  It isn’t going to learn to optimally solve unseen mazes.",
          "score": 8,
          "created_utc": "2026-02-24 10:21:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o74nkvk",
              "author": "Secure-Ad-9050",
              "text": "It might be able to. What I could see happening is each layer paints a \"connectivity map\" and then some of the layers join. I don't see why a CNN couldn't run a breadth first search.\n\nIt would have a limit of the maximum depth it can do based on the number of layers",
              "score": 4,
              "created_utc": "2026-02-24 13:02:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7e6c31",
                  "author": "SadEntertainer9808",
                  "text": "The issue isn't \"why can't a CNN run BFS?\" (it provably can), it's \"why on earth would a CNN run BFS?\"",
                  "score": 1,
                  "created_utc": "2026-02-25 20:43:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o74mlua",
          "author": "Secure-Ad-9050",
          "text": "from the attached image.. what is the entrance? and what is the exit?\n\nfor all of your mazes is it always top left corner to bottom right?\n\nedit: what about mazes with multiple possible paths?",
          "score": 3,
          "created_utc": "2026-02-24 12:56:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o75f6z5",
              "author": "no1_2021",
              "text": "Yes you are right, top left corner is the entry point and the bottom right corner is the destination. I'm running an experiment with different starting and destination points.",
              "score": 3,
              "created_utc": "2026-02-24 15:27:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o75hzew",
                  "author": "Secure-Ad-9050",
                  "text": "Also, have you tried seeing how well it behaves on small mazes with a \"longest possible path\"? \n\nThis is mostly me wondering if the issues it has on large mazes is caused by a \"maximum path length\" type error caused by the method it uses to solve the mazes.",
                  "score": 1,
                  "created_utc": "2026-02-24 15:40:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o79ga91",
          "author": "exCaribou",
          "text": "LOVE it",
          "score": 2,
          "created_utc": "2026-02-25 03:18:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cqbtp",
          "author": "jpfed",
          "text": "You may wish to try a few other maze-generating algorithms (perhaps holding some out for a test set) because they each have their own \"character\". A while ago Jamis Buck wrote a big [series of articles explaining different maze generation algorithms](https://www.jamisbuck.org/mazes/) that could come in handy here.",
          "score": 2,
          "created_utc": "2026-02-25 16:45:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cxgvp",
              "author": "no1_2021",
              "text": "Sure. A while back, I wrote an application to create and solve mazes\n\n[https://dinesh-gdk.github.io/aMaze/#loaded](https://dinesh-gdk.github.io/aMaze/#loaded)",
              "score": 1,
              "created_utc": "2026-02-25 17:18:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7x6njk",
          "author": "HasGreatVocabulary",
          "text": "This paper has a maze dataset and used it with their continuous thought machines architecture, if you want to compare. CTM [https://arxiv.org/pdf/2505.05522](https://arxiv.org/pdf/2505.05522)\n\n[https://github.com/SakanaAI/continuous-thought-machines](https://github.com/SakanaAI/continuous-thought-machines)\n\n[https://github.com/aks2203/easy-to-hard-data](https://github.com/aks2203/easy-to-hard-data) ",
          "score": 2,
          "created_utc": "2026-02-28 18:37:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xaka8",
              "author": "no1_2021",
              "text": "Wow! Thank you. This is very useful.",
              "score": 1,
              "created_utc": "2026-02-28 18:57:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o770o7t",
          "author": "digiorno",
          "text": "A Q-Learning algorithm can solve a maze, come on. And it’ll do it in the same way, brute force.",
          "score": 1,
          "created_utc": "2026-02-24 19:46:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79ahgx",
          "author": "BrunoEilliar",
          "text": "Most impressive",
          "score": 1,
          "created_utc": "2026-02-25 02:45:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7g58ja",
          "author": "kakhaev",
          "text": "i wonder if using cnn layers with big to small sizes can provide better “global representation” instead of capturing local features\n\nwhat i mean is cnn window size starts maybe like 1/4 of the image size and get smaller with each layer, to compress global representations",
          "score": 1,
          "created_utc": "2026-02-26 02:56:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80vwgy",
          "author": "Scared-Dingo-2312",
          "text": "Can anyway encode models can be used here ? they can capture complex informations ",
          "score": 1,
          "created_utc": "2026-03-01 08:50:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74771f",
          "author": "Chelokot",
          "text": "The fact that it trained so fast and so stable and also that it *kinda* works on big mazes *correctly* is fascinating",
          "score": 1,
          "created_utc": "2026-02-24 11:01:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e5wqt",
          "author": "SadEntertainer9808",
          "text": "Unless this question is actually just \"can an architecture that is famous for its ability to approximate any function approximate any function?\", what you're doing here is \"can I torture a neural net into solving problems that can be solved with extremely high efficiency in every single case by an optimized static algorithm?\", which is not just idiotic but actually offensive.",
          "score": 0,
          "created_utc": "2026-02-25 20:41:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gjrtg",
              "author": "Ok_Net_1674",
              "text": "Its not offensive. It would have been more interesting if OP tried to actually deconstruct the inner workings of the CNN to find out how it solves the problem, but the research question behind it definitely is valid. \n\nAlso the universal approximation theorem assumes an infinite number of neurons (and precision), both of which a practical CNN does not have. Its a purely theoretical justification, it does not entail that any fixed size NN can do every task. ",
              "score": 1,
              "created_utc": "2026-02-26 04:26:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rg1ox3",
      "title": "lstm from scratch in js. no libraries.",
      "subreddit": "learnmachinelearning",
      "url": "https://v.redd.it/y6day5m950mg1",
      "author": "Ok-Statement-3244",
      "created_utc": "2026-02-27 09:01:39",
      "score": 210,
      "num_comments": 4,
      "upvote_ratio": 0.98,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Project",
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rg1ox3/lstm_from_scratch_in_js_no_libraries/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o7oyw4y",
          "author": "jiminiminimini",
          "text": "This looks awesome! Good job!",
          "score": 4,
          "created_utc": "2026-02-27 12:56:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7sihiz",
          "author": "seo-nerd-3000",
          "text": "Building an LSTM from scratch with no libraries is one of the best ways to actually understand what is happening inside the network because when you use PyTorch or TensorFlow the gates, cell state, and hidden state updates are abstracted away and you never really internalize the math. Doing it in JavaScript adds an extra layer of challenge because the ML ecosystem in JS is nowhere near as mature as Python so you cannot fall back on convenience functions when you get stuck. The fact that you implemented the forget gate, input gate, and output gate manually means you now understand LSTMs better than most people who use them daily through high-level APIs. This is the kind of project that separates ML practitioners from ML engineers.",
          "score": 9,
          "created_utc": "2026-02-27 23:42:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7utnwi",
              "author": "Relevant-Yak-9657",
              "text": "Why does this sound like GPT? Cool project, but the review has no nuance other than \"Implementing stuff from scratch forces you to learn better. Good stuff!\"\n\nMaybe I am just paranoid.",
              "score": 9,
              "created_utc": "2026-02-28 09:52:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7vdkxr",
                  "author": "koverda",
                  "text": "Yeah my slop-dar went off as well",
                  "score": 2,
                  "created_utc": "2026-02-28 12:47:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rcsez1",
      "title": "Is there a Leetcode for ML",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/r/learnmachinelearning/comments/1rcsez1/is_there_a_leetcode_for_ml/",
      "author": "Spitfire-451",
      "created_utc": "2026-02-23 20:10:35",
      "score": 170,
      "num_comments": 32,
      "upvote_ratio": 0.95,
      "text": "So guys I wanna prepare for ML interviews, so for this I wanted to test my knowledge.\n\nIs there any platform for the same like some leetcode for ML? Or some other place you'll use?\n\nI recently saw one post about some leetcode for ML, but some people said it is some vibe coded platform and not that great.\n\nPls guide",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rcsez1/is_there_a_leetcode_for_ml/",
      "domain": "self.learnmachinelearning",
      "is_self": true,
      "comments": [
        {
          "id": "o72d8kq",
          "author": "tom_mathews",
          "text": "I’ve been digging into this too. If you want to avoid the 'vibe-coded' platforms that just ask high-level theory, you should definitely check out TensorTonic.\n\nIt’s seriously impressive because it actually forces you to write tensor-level code (PyTorch/NumPy style) rather than just answering multiple-choice questions. It’s the closest thing I’ve found to a true 'LeetCode for ML' implementation.\nCheck it out here: https://www.tensortonic.com/\n\nOther solid alternatives:\n- Deep-ML: Great for fundamental matrix math.\n- MLStack: Better for system design and end-to-end pipelines.\n\nIf you’re prepping for interviews where you have to implement a layer or a loss function from scratch, TensorTonic is probably your best bet right now.",
          "score": 78,
          "created_utc": "2026-02-24 02:19:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o731b6g",
              "author": "Spitfire-451",
              "text": "Will check these out",
              "score": 4,
              "created_utc": "2026-02-24 04:51:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o76xs5w",
                  "author": "mosef18",
                  "text": "https://www.deep-ml.com",
                  "score": 4,
                  "created_utc": "2026-02-24 19:32:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o79lid5",
              "author": "Avocado_House",
              "text": "I'm struggling to find \"MLStack\" on google, because generic stuff about ML stacks keeps coming up. Can you link it here? ",
              "score": 1,
              "created_utc": "2026-02-25 03:49:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7a1b4c",
                  "author": "tom_mathews",
                  "text": "LMGTFY, https://www.mlstack.cafe/",
                  "score": 3,
                  "created_utc": "2026-02-25 05:38:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o71vraa",
          "author": "Traditional-Carry409",
          "text": "I’ve been grinding ML roles on [datainterview.com/coding](https://datainterview.com/coding) A friend of mine who landed a role at Google Deepmind said that was helpful for his prep",
          "score": 19,
          "created_utc": "2026-02-24 00:38:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70leta",
          "author": "Wise_Detail_8604",
          "text": "The closest thing is Deep-ML (https://www.deep-ml.com/)",
          "score": 24,
          "created_utc": "2026-02-23 20:37:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70rt0j",
          "author": "elwazaniMed",
          "text": "TensorTonic",
          "score": 16,
          "created_utc": "2026-02-23 21:09:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70iade",
          "author": "locomocopoco",
          "text": "Kaggle? ",
          "score": 26,
          "created_utc": "2026-02-23 20:22:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70s3rx",
          "author": "Winners-magic",
          "text": "[pixelbank.dev](http://pixelbank.dev)",
          "score": 3,
          "created_utc": "2026-02-23 21:10:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gy4lx",
          "author": "StarchyArchery",
          "text": "Oh, I hope you find a good one! Preparing for interviews is so stressful >◡<๑)",
          "score": 2,
          "created_utc": "2026-02-26 06:12:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hjyqh",
              "author": "Spitfire-451",
              "text": "Thanks mate",
              "score": 1,
              "created_utc": "2026-02-26 09:32:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o739hfb",
          "author": "patternpeeker",
          "text": "there isn’t really a clean leetcode for ml. most interviews are a mix of basic theory, some modeling tradeoffs, and a bit of coding. if u want something practical, try reproducing simple papers end to end or take a dataset and walk it from raw data to deployed model. that exposes gaps way faster than mcq style quizzes.",
          "score": 4,
          "created_utc": "2026-02-24 05:54:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o757lzf",
          "author": "bandito_13",
          "text": "Kaggle has some great ML challenges that let you practice your skills while having fun",
          "score": 3,
          "created_utc": "2026-02-24 14:51:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o778yki",
          "author": "aaaaaatul",
          "text": "Thanks! I was looking for something like this",
          "score": 1,
          "created_utc": "2026-02-24 20:24:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gwh8z",
          "author": "WinterBrother7855",
          "text": "ngl a leetcode for ml is kinda not a single thing because ml interviews aren’t just grind questions and move on, a lot of loops are open ended system design. so instead of relying on some vibe coded platform i’d take the structured route where you solve open ended ml system design problems using a step by step methodology. [this educative course](https://www.educative.io/courses/grokking-the-machine-learning-interview) is basically the closest thing to a real leetcode for ml but focused on how you actually think and design in interviews. good luck!",
          "score": 1,
          "created_utc": "2026-02-26 05:59:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7i5l8w",
          "author": "ziggy_y",
          "text": "I developed [https://catchcode.ai/](https://catchcode.ai/) to be a DS alternative to LeetCode that is more relevant to the AI and vibe-coding era, where you don't write lots of code but you definitely need to read and fully understand it, especially in DS domain. Give it a try",
          "score": 1,
          "created_utc": "2026-02-26 12:34:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71ksen",
          "author": "confuScience",
          "text": "Following",
          "score": 1,
          "created_utc": "2026-02-23 23:37:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76idbg",
          "author": "Kapri111",
          "text": "Honestly, I've been asking Gemini to give me interview-prep exercises and It's been great. \n\nBoth for Leetcode-style questions, but also for case-study like interviews.\n\nAlso, when I fail, or don't know the answer, you can give it your best guess, and ask it to explain the solution in detail so you actually learn where you went wrong. \n\nReally recommend this method.",
          "score": 1,
          "created_utc": "2026-02-24 18:23:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o788wzr",
          "author": "plurch",
          "text": "Here are some [free resources and guides](https://relatedrepos.com/gh/alirezadir/Machine-Learning-Interviews) for machine learning interview questions and preparation",
          "score": 1,
          "created_utc": "2026-02-24 23:17:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72yu0m",
          "author": "Prudent-Buyer-5956",
          "text": "Why would someone code manually when you already have libraries and packages for various algorithms. Get a book like from oreilly and practice solving end to end problems. Additionally practice end to end ML problems on any Kaggle dataset of your interest.",
          "score": -1,
          "created_utc": "2026-02-24 04:34:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73184o",
              "author": "Spitfire-451",
              "text": "Fair enough but I find it hard to apply what I've learnt to kaggle. Like the competitions are way too complex",
              "score": 2,
              "created_utc": "2026-02-24 04:51:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o731pni",
                  "author": "Prudent-Buyer-5956",
                  "text": "Go through this book (https://amzn.in/d/09h85cxi ) and practice solving questions in each chapter and then solve kaggle problems. Also competitions can be complex. They are designed that way where you use complex feature engineering and other techniques to improve validation metrics of your models further. Start with simple problems.",
                  "score": 2,
                  "created_utc": "2026-02-24 04:54:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o70ofrf",
          "author": "pm_me_your_smth",
          "text": "Why would you need ML leetcode? It's not a school exam where you have to memorise a set of things from a list. Just go over a book or try coding any model or mechanism from scratch and see where do you have gaps",
          "score": -9,
          "created_utc": "2026-02-23 20:51:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o714ml6",
          "author": "LastNewRon",
          "text": "papercode.in\nNot mine, i saw it on twitter.",
          "score": 0,
          "created_utc": "2026-02-23 22:11:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72f69c",
          "author": "Fr0stpie",
          "text": "Following",
          "score": 0,
          "created_utc": "2026-02-24 02:30:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74xm4d",
          "author": "Ok-Ticket3023",
          "text": "Following since I am also in process to giving interviews",
          "score": 0,
          "created_utc": "2026-02-24 13:59:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nl8ty",
          "author": "p1aintiff",
          "text": "i find nn.labml.ai  and google funing playnote at github.",
          "score": 0,
          "created_utc": "2026-02-27 05:52:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70xbsm",
          "author": "ViciousIvy",
          "text": "hey there! my company offers a free ai/ml engineering fundamentals course for beginners! if you'd like to check it out feel free to message me \n\n\n\nwe're also building an ai/ml community on discord where we hold events, share news/ discussions on various topics. feel free to come join us [https://discord.gg/WkSxFbJdpP](https://discord.gg/WkSxFbJdpP)",
          "score": -6,
          "created_utc": "2026-02-23 21:36:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1regm7d",
      "title": "Statistics vs Geography",
      "subreddit": "learnmachinelearning",
      "url": "https://i.redd.it/fpr6qmtyunlg1.jpeg",
      "author": "specasder",
      "created_utc": "2026-02-25 15:40:57",
      "score": 168,
      "num_comments": 26,
      "upvote_ratio": 0.86,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Project",
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1regm7d/statistics_vs_geography/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o7cfdb5",
          "author": "vannak139",
          "text": "I have a machine learning joke, but I have a machine learning joke, but I have a machine learning joke",
          "score": 32,
          "created_utc": "2026-02-25 15:55:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d3oi9",
          "author": "Normal-Sound-6086",
          "text": "I thought I had an AI joke, but ...You’re absolutely right to question that — I made a mistake. There’s no verified record of a joke. I shouldn’t have attributed that as a joke without a reliable source. Thanks for catching it.",
          "score": 28,
          "created_utc": "2026-02-25 17:46:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ejff7",
              "author": "mlt-",
              "text": "r/Angryupvote",
              "score": 3,
              "created_utc": "2026-02-25 21:44:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7kcopi",
              "author": "BellyDancerUrgot",
              "text": "I am curious to know if u typed that by hand or used chatgpt lmao",
              "score": 1,
              "created_utc": "2026-02-26 19:05:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7dml1x",
          "author": "Technical-Moose-4165",
          "text": "I have a deep learning joke, but it's too layered\n\n",
          "score": 14,
          "created_utc": "2026-02-25 19:11:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dtsi8",
          "author": "Revolutionary_Host99",
          "text": "I have a quantum physics joke, but I don't",
          "score": 12,
          "created_utc": "2026-02-25 19:44:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ciluo",
          "author": "ResidentTicket1273",
          "text": "I have a maths joke, but it doesn't add-up.",
          "score": 8,
          "created_utc": "2026-02-25 16:10:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ea5o3",
          "author": "ergotofwhy",
          "text": "I have a UDP joke. I don't care if you get it.",
          "score": 8,
          "created_utc": "2026-02-25 21:01:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7eit4z",
              "author": "mlt-",
              "text": "There was no connection.",
              "score": 6,
              "created_utc": "2026-02-25 21:41:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7dbx2i",
          "author": "Kazaan",
          "text": "i have a programming joke, but it always bug me out.",
          "score": 5,
          "created_utc": "2026-02-25 18:23:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dwp0w",
          "author": "SemperPistos",
          "text": "I have a hypothesis testing joke, it's really good as everyone so far failed to reject it.",
          "score": 6,
          "created_utc": "2026-02-25 19:58:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hg5ez",
              "author": "DonovanB46",
              "text": "🤣🥁",
              "score": 2,
              "created_utc": "2026-02-26 08:54:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ce4jc",
          "author": "tacticalcooking",
          "text": "I have learned a machine learning joke, but I don’t know where it’s not significant.",
          "score": 4,
          "created_utc": "2026-02-25 15:49:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7clpmi",
          "author": "NotAnUncle",
          "text": "I have a ml joke, but I'm still training to say it",
          "score": 4,
          "created_utc": "2026-02-25 16:24:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7eq3z9",
          "author": "Duflo",
          "text": "I have a joke about time travel, but you hated it.\n\n\nI also have a joke about déjà-vu.\n\n\nI also have a joke about déjà-vu.",
          "score": 3,
          "created_utc": "2026-02-25 22:15:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d56hc",
          "author": "Timely_Football9780",
          "text": "I have a python joke - \"Hello world\"",
          "score": 4,
          "created_utc": "2026-02-25 17:53:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7dye0q",
              "author": "Tan442",
              "text": "Hello(\"print world!!\")",
              "score": 3,
              "created_utc": "2026-02-25 20:05:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7fstxy",
          "author": "sam_the_tomato",
          "text": "I have a deep learning joke, but I've catastrophically forgotten it.",
          "score": 2,
          "created_utc": "2026-02-26 01:46:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gvset",
          "author": "3090orBust",
          "text": "I have a time travel joke, but I already told it to you.",
          "score": 2,
          "created_utc": "2026-02-26 05:53:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7g6g6d",
          "author": "AlfaHotelWhiskey",
          "text": "Wouldn’t it be funnier as a navigation joke?  “…but I can’t seem to find it?”",
          "score": 1,
          "created_utc": "2026-02-26 03:03:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7g99au",
          "author": "Practical-Hat-3943",
          "text": "I have a programming joke, but won't be out until the next release",
          "score": 1,
          "created_utc": "2026-02-26 03:20:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gm6gq",
          "author": "Ash_con",
          "text": "I have a machine learning joke, but i dont speak chinese",
          "score": 1,
          "created_utc": "2026-02-26 04:42:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gujz3",
          "author": "not-ekalabya",
          "text": "I have an ml joke, but you ain't trained enough to understand it.",
          "score": 1,
          "created_utc": "2026-02-26 05:43:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kduz0",
          "author": "cultivatewill",
          "text": "I have a qa joke but it is irrelevant.",
          "score": 1,
          "created_utc": "2026-02-26 19:11:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l2y5g",
          "author": "woodpigeon01",
          "text": "I had a machine learning joke but I can’t precisely recall it",
          "score": 1,
          "created_utc": "2026-02-26 21:11:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tq26g",
          "author": "whyuthrowchip",
          "text": "I have a quantum physics joke, but you wouldn't understand it, and i won't, either. And the more people we tell the joke to, the more people we can help to not understand it.",
          "score": 1,
          "created_utc": "2026-02-28 04:13:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcq3lw",
      "title": "Unpopular opinion: Beginners shouldn't touch Apache Spark or Databricks.",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/r/learnmachinelearning/comments/1rcq3lw/unpopular_opinion_beginners_shouldnt_touch_apache/",
      "author": "netcommah",
      "created_utc": "2026-02-23 18:48:40",
      "score": 165,
      "num_comments": 29,
      "upvote_ratio": 0.93,
      "text": "I keep seeing all these ML roadmaps telling beginners they absolutely must learn Spark or Databricks on day one, and honestly, it just stresses people out.\n\nAfter working in the field for a bit, I wanted to share the realistic tool hierarchy I actually use day-to-day. My general rule of thumb goes like this:\n\nIf your data fits in your RAM (like, under 10GB), just stick to Pandas. It’s the industry standard for a reason and handles the vast majority of normal tasks.\n\nIf you're dealing with a bit more; say 10GB to 100GB; give Polars a try. It’s way faster, handles memory much better, and you still don't have to mess around with setting up a cluster.\n\nYou really only need Apache Spark if you're actually dealing with terabytes of data or legitimately need to distribute your computing across multiple machines.\n\nThere's no need to optimize prematurely. You aren't \"less of an ML engineer\" just because you used Pandas for a 500MB dataset. You're just being efficient and saving everyone a headache.\n\nIf you're curious about when Spark actually makes sense in a real production environment, I put together a guide breaking down real-world use cases and performance trade-offs: [**Apache Spark**](https://www.netcomlearning.com/blog/apache-spark)\n\nBut seriously, does anyone else feel like \"Big Data\" tools get pushed way too hard on beginners who just need to learn the basics first?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rcq3lw/unpopular_opinion_beginners_shouldnt_touch_apache/",
      "domain": "self.learnmachinelearning",
      "is_self": true,
      "comments": [
        {
          "id": "o704pj8",
          "author": "pugnae",
          "text": "This is general problem in SWE.\n\nTake frontend for example. If you build functioning app without react first what happens?\n\nYou know inside out how this works, what are the pain points and what are the advantages of classical approach. You would be a better react dev if you start without it.\n\nBut companies want to hire (well, right now they are not hiring that much, lol) people who will work at their react codebase, not pure JS. So the logical career move is to focus on React skipping the basics.\n\nSad, but that's how it works.",
          "score": 70,
          "created_utc": "2026-02-23 19:18:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o70aemy",
              "author": "soundboyselecta",
              "text": "React is a very good example come to think of it.",
              "score": 7,
              "created_utc": "2026-02-23 19:44:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o70a85r",
              "author": "soundboyselecta",
              "text": "Or is it align with the bad practices of over engineering in general. I mean cloud providers don't mind, shitified (certified shitheads) don't mind cuz client is pushing their stack one form or another inevitably....",
              "score": 5,
              "created_utc": "2026-02-23 19:44:01",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o70atww",
              "author": "pugnae",
              "text": "And I believe that it is one of the reasons that seniors are better.\n\nExperience obviously matters, but if you were stuff without modern fancy tools, you generally understadn And I believe that it is one of the reasons that seniors are better.\n\nExperience obviously matters, but if you were stuff without modern fancy tools, you generally understand what's going on inside. If you started later it is more of a blackbox to you.",
              "score": 2,
              "created_utc": "2026-02-23 19:46:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o70iv8a",
                  "author": "alnyland",
                  "text": "Experience obviously matters, but if you were stuff without modern fancy tools, you generally understand what's going on inside. If you started later it is more of a blackbox to you.",
                  "score": 3,
                  "created_utc": "2026-02-23 20:25:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o703agw",
          "author": "jj_HeRo",
          "text": "I have suffered teaching young people with one year, only Python, experience.",
          "score": 11,
          "created_utc": "2026-02-23 19:11:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70j76d",
          "author": "addictzz",
          "text": "Heck I'd say excel or gsheet is good enough for some cases and if you have 50-200mb data.\n\nSpark is good if you want to understand how distributed system works but it does need some experience. When I first knew spark as beginner, i couldnt grasp it at a. When I took another shot at it after understanding deeper about computing, OS process, networking in general, it was wayyy easier.",
          "score": 5,
          "created_utc": "2026-02-23 20:26:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72x5n3",
              "author": "proverbialbunny",
              "text": "Is it going into prod (Data Science and ML Engineering work) or is it just a presentation (Data Analyst work)?  Spreadsheets have their place, if you know the Excel programming language already.",
              "score": 2,
              "created_utc": "2026-02-24 04:22:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o731ft9",
                  "author": "addictzz",
                  "text": "When the prod that you meant is ML modelling, surely Excel is not the right tool. But for generic analysis, sample data viewing, Excel should be good.",
                  "score": 2,
                  "created_utc": "2026-02-24 04:52:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o71gu9v",
          "author": "Porg11235",
          "text": "OP, why are so many of your posts AI-generated? What do you gain from this?",
          "score": 5,
          "created_utc": "2026-02-23 23:15:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79cslc",
              "author": "FatalPaperCut",
              "text": "\\^\\^ correct. i pointed it out in a previous thread too. its a grey area because its not obviously against TOS or whatever. its just bizarre and anti-social. its funny because I would generally just agree with the OP post here. but what's the purpose ... just farming karma? maybe they're mixing in some posts with no ads/links to make their posts with links to whatever scam blog look more legit",
              "score": 2,
              "created_utc": "2026-02-25 02:58:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o702dnf",
          "author": "amejin",
          "text": "All tooling gets pushed because it's the next best thing.\n\nVery few have a need for Aurora. Very few have a need for Kinesis and a full data pipeline, where a traditional database and a simple aggregate application would do. And that's just AWS's toolkit.\n\nMarketing is a hell of a thing. It's \"industry standard\" and therefore it's what everyone must use. Unless you know WHY you need these tools, and you organically grow into them, preplanning their use is optimism at best.",
          "score": 4,
          "created_utc": "2026-02-23 19:07:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72wre1",
          "author": "proverbialbunny",
          "text": "I'd argue Polars is easier than Pandas, Polars has tons of advantages, and Polars is quickly becoming the industry standard, so why not skip Pandas all together?  Even when libraries create a Pandas dataframe, Pandas still has zero use in a modern stack.  Just write a single line that converts the Pandas df into a Polars df.  At this point there is probably zero reason to learn Pandas today.",
          "score": 3,
          "created_utc": "2026-02-24 04:19:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74yuza",
          "author": "numice",
          "text": "Yeah. Partly agree if your job doesn't require spark. I don't use spark or databricks because exactly like you mentioned, the data is too small. However, when I apply for jobs, the majority of them, especially at places that pay well, require databricks, spark, some kind of cloud specific pipelines.",
          "score": 3,
          "created_utc": "2026-02-24 14:05:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70406j",
          "author": "swttrp2349",
          "text": "While I generally think the idea of \"focus on learning key concepts and more general tools rather than hopping between 100 different vendor-specific tools/ shiny new things while you're a beginner\" is a good one (not that either Spark or Databricks is particularly new), I imagine not having any knowledge of these is going to really slim down the number of companies who'll actually consider you.",
          "score": 6,
          "created_utc": "2026-02-23 19:14:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o707lsj",
              "author": "Asalanlir",
              "text": "I've been working in the space, both on the research and development side for the past \\~10 years. I never once have come across a need for either of these tools beyond a cursory glance to check if spark would be useful to satisfy a problem we were having.\n\nThe important thing with tools isn't to know them well; it's to understand what purpose they might serve. When would it make sense to reach for a structured vs unstructured database? When would it make sense to reach for redis over postgres? etc\n\nAnd when I'm writing a rec for an open position, I rarely expect candidates to have working knowledge of specific tools. If they do, cool, might play in their favor, though very minorly. I expect them to be able to reason about how to reason about their tools. I can teach them to use services; it's significantly harder to teach them how to reason.",
              "score": 7,
              "created_utc": "2026-02-23 19:31:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o70ipvx",
          "author": "ugon",
          "text": "Totally agree, except nobody should use Spark or Databricks for anything",
          "score": 5,
          "created_utc": "2026-02-23 20:24:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71a3rj",
              "author": "Spare-Builder-355",
              "text": "what's your beef with Spark?",
              "score": 5,
              "created_utc": "2026-02-23 22:39:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o75o6if",
                  "author": "ugon",
                  "text": "Well most people can’t really handle it, and there are much easier solutions nowadays",
                  "score": 1,
                  "created_utc": "2026-02-24 16:08:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o70jyq7",
              "author": "Sheensta",
              "text": "What to use for big data? BigQuery / Snowflake / Fabric / Redshift?",
              "score": 2,
              "created_utc": "2026-02-23 20:30:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o70ke1p",
                  "author": "PillowFortressKing",
                  "text": "With tools like Polars and DuckDB the line for when it becomes \"big data\" has shifted vastly",
                  "score": 5,
                  "created_utc": "2026-02-23 20:32:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o70t17e",
          "author": "temporal_difference",
          "text": "This has been a thing for over a decade!\n\nHere's an article by Chris Stucchio in 2013, titled \"Don't use Hadoop - your data isn't that big\": https://www.chrisstucchio.com/blog/2013/hadoop_hatred.html",
          "score": 1,
          "created_utc": "2026-02-23 21:15:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71b4y6",
          "author": "Spare-Builder-355",
          "text": "anyone aming at data engineering must know both.",
          "score": 1,
          "created_utc": "2026-02-23 22:44:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72xlpl",
              "author": "proverbialbunny",
              "text": "Nah, not all companies use Spark and/or Databricks.  Many companies do not use them actually.",
              "score": 1,
              "created_utc": "2026-02-24 04:25:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o728wmu",
          "author": "tecedu",
          "text": "I’ll go as far as saying dont go spark or databricks for ml related work. You’re abstracting away so many things",
          "score": 1,
          "created_utc": "2026-02-24 01:54:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfaryi",
      "title": "Why are so few ML/AI candidates trained in AI security or adversarial testing?",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/r/learnmachinelearning/comments/1rfaryi/why_are_so_few_mlai_candidates_trained_in_ai/",
      "author": "Bizzare_Mystery",
      "created_utc": "2026-02-26 13:55:03",
      "score": 81,
      "num_comments": 40,
      "upvote_ratio": 0.89,
      "text": "I’m involved in ML hiring at a startup. We’ve interviewed about 10 candidates recently. They all have strong resumes and solid coding experience. Some even have real production LLM experience. But when I ask basic security questions around what they built, the answers are thin. Most can’t even explain basic concepts of model poisoning, evasion or model extraction. \n\nOne person built a production RAG system which was in use for a pretty large use-case, but I asked what adversarial testing they did, they could not give any concrete answers.\n\nI’m not even blaming them. I wasn’t trained on this either. It just feels like the education pipeline is lagging hard.\n\nSome of our senior staff has suggested we hire based on development experience and then we could do inhouse training on secure AI development and testing, but I'm not sure if thats the best approach to go with. \n\nFor folks here - did anyone learn AI security formally? If you had to upskill, what actually helped? And whose job is it, companies or individuals? Any pointers will be highly appreciated!",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rfaryi/why_are_so_few_mlai_candidates_trained_in_ai/",
      "domain": "self.learnmachinelearning",
      "is_self": true,
      "comments": [
        {
          "id": "o7iswpd",
          "author": "Puzzleheaded_Fold466",
          "text": "Is it really lagging this hard though ? \n\nThis sounds a bit like the stereotypical job ads asking for 5 years experience in a language that came out 2 years ago.\n\nYou’re not wrong that they are important topics. \n\nBut I think you should be more forgiving of the lack of specialized education on a narrow subject that has been widely (industry-wide) meaningful for only a short period of time.\n\nIt takes time for these things to make their way into university programs.\n\nYou can also look at it another way: you guys are ahead of the curve. That’s good !\n\nI agree with your colleagues’ suggestion to train for this in-house. I’d maybe look for candidates who can  demonstrate competency on and interest for traditional systems security topics, and expect to upskill them on your more specific concerns.",
          "score": 64,
          "created_utc": "2026-02-26 14:47:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7jpkrs",
              "author": "O2XXX",
              "text": "I’m going to have to partially disagree. Data poisoning and data contamination isn’t a new or narrow problem though. Maybe it’s because I work in defense, but these have always been a real concern. I get in business someone poisoning a model is relatively little risk, but that’s more of an incentive problem than model risk doesn’t exist. In defense, if your system fails means people could die, and you always have someone trying to gain some form of information dominance over you. \n\nI do agree that this has been seen as important now since GenAI is so trivially easy to attack compared to having to find sensors traditional ML relied on. The fact that these frontier models are being constantly being push out of alignment makes them a huge risk in my mind, but again the incentive for making money somehow overweighs this risk.",
              "score": 4,
              "created_utc": "2026-02-26 17:19:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7k0ngi",
                  "author": "tamanish",
                  "text": "No idea why you get downvoted. I know a little about genAI and nothing about your field but I can see your point.",
                  "score": 6,
                  "created_utc": "2026-02-26 18:10:44",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7ldbnu",
                  "author": "Puzzleheaded_Fold466",
                  "text": "You’re not wrong. \n\nMaybe I wasn’t clear, but I didn’t mean to suggest that it should be entirely ignored, only that infosec specific to large scale deployment of LLMs is a relatively nascent field.\n\nIt’s not super surprising that the subject hasn’t been taught in CS/SE/ML programs up until now (I imagine that will change soon).\n\nThat is not to say that they should completely disregard all requirements for any IS security knowledge and experience whatsoever.",
                  "score": 2,
                  "created_utc": "2026-02-26 22:00:46",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7ozqso",
                  "author": "Bizzare_Mystery",
                  "text": "The defense perspective is actually helpful here. In startups, the incentives are very different. Like you said, speed is something we target the most usually and generally wins over robustness. We as a team are trying to do it in a better way. That doesn’t mean the risks don’t exist, they are just layered with some additional security and defense in depth so the exploitability vs impact ratio is better maintained. We don't want to defer it until something goes wrong. I think you’re right that in certain domains this has always mattered. Maybe outside of those domains, it just hasn’t been treated as a first-class concern yet. Hopefully things start moving in the smoother direction. Its about time right?",
                  "score": 1,
                  "created_utc": "2026-02-27 13:01:29",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7oznlh",
              "author": "Bizzare_Mystery",
              "text": "Regarding the formal education, I feel it's getting better over the last year, but lags behind on the practical application of the concepts it looks like? But that's still a good start. At this point there are accessible ways to learn this using youtube or using online courses. There is a lot of content from open research on model extraction and poisoning, to adversarial testing frameworks, to practical courses focused on AI security. The best things I thing about 2026 is that you don’t need a university module to at least understand the basics. I’m not looking for deep expertise. I’m just looking for signals that someone building production AI systems has made an decent effort to understand how they can be abused. ",
              "score": 1,
              "created_utc": "2026-02-27 13:00:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ilnox",
          "author": "SizePunch",
          "text": "How did you learn it?",
          "score": 27,
          "created_utc": "2026-02-26 14:09:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ozxlm",
              "author": "Bizzare_Mystery",
              "text": "I didn’t come up through AI security either. I had some exposure to traditional systems security, and spent my share of time on the design teams, so threat modeling wasn’t foreign to me. When I moved into LLM work, I just applied the same thinking. I personally like the concept of thinking in terms of system. Then I filled in the gaps with adversarial ML research and practical red-team writeups. There are so many public CTF writeups on LLM security and I spend a few hours every week just reading through them to keep myself updated. Youtube has been a savior but it helped that I also took one focused online course on AI security, which honestly helped connect the dots in a more structured way. Now I just try to stay up to date by following new papers, incident reports, and public red-team findings as they come out. That's the current approach that has worked for me.",
              "score": 2,
              "created_utc": "2026-02-27 13:02:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7pa9tk",
                  "author": "SizePunch",
                  "text": "Thanks for the response",
                  "score": 2,
                  "created_utc": "2026-02-27 14:02:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7jbnzb",
          "author": "DigThatData",
          "text": "I'm not aware of any serious AI security training that even exists. If anyone claimed to be offering a course on this that wasn't strictly academic or research focused, I'd assume it was snake oil.",
          "score": 18,
          "created_utc": "2026-02-26 16:15:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7joip0",
              "author": "mpaes98",
              "text": "Many universities have has courses in this field for a while, I taught one myself. \n\nFor the most part, it’s typically a graduate seminar type class where you review research papers in AI/ML for security and then security for AI/ML (model poisoning, data leakage, etc.), with some kind of capstone. Largely an academic area still.\n\n\nI’ll say that with the hype-cycle of LLMs, there’s been some more “practical training“, like OWASP making an LLM top ten vulnerabilities, MITRE ATLAS, etc. (MIT AI RiskRepo seems to generalized for now, and NIST AI RMF was good but probably dead under the new admin).\n\n\nIAPP made a pretty good AI Governance cert for non-technical folks, but at the moment there’s not too much in the way of connecting that back to the technical people who can implement the controls.",
              "score": 4,
              "created_utc": "2026-02-26 17:14:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7j17cm",
          "author": "Dhydjtsrefhi",
          "text": "It sort of makes sense - ML is a relatively new field in that it's dramatically grown in the past few years, so many of the newer entrants don't have experience with the full range of AI topics, even important ones like security and adversarial testing. Aside from only considering candidates with experience in AI security (and likely offering a higher salary to attract that particular candidate pool), there isn't much of an option aside from in house training. ",
          "score": 6,
          "created_utc": "2026-02-26 15:27:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l45y2",
          "author": "Dismal-Tale-5937",
          "text": "It should be both. Companies should invest in training because they’re the ones deploying into real risk, but developers also have to take initiative since the space is moving fast and formal curriculum lags. I started with self-study and even though it was useful, it felt scattered. After due diligence, we put part of the team through a structured AI security course ([8kSec’s Practical AI Security](https://8ksec.io/practical-ai-security/)) which popped up on Google search, and the biggest win was consistency. They were hands-on focused in terms of dev as well as attacks which my team liked. There might be more courses like them which you can consider. Just make sure its not theory heavy and includes actual hands-on.",
          "score": 8,
          "created_utc": "2026-02-26 21:17:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jkw4f",
          "author": "_not_your_name_",
          "text": "Do you want your ml engineers to not only model and think around hard mathematics but also make sure it's reslient. But also unwilling to hire another person to  work on this security  kind of stuff What is the next full stack scam you wanna pull?",
          "score": 3,
          "created_utc": "2026-02-26 16:57:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7p04ek",
              "author": "Bizzare_Mystery",
              "text": "I’m not trying to recruit for some full stack ML security unicorn role. Even when in the past I used to recruit for Web developer roles, I used to expect my developers to know the basics of things like OWASP top 10. Obviously it would be crazy for me expect them to be cybersecurity pros, but even working knowledge of basic concepts like SQL injection and XSS helps weed out the need to rethinking every security decision they are making. Peer reviews will catch many of the other obvious problems, and the dedicated security architect's job will be to point folks in the right direction. I feel security is a shared responsibility. Just like backend engineers aren’t exempt from thinking about auth or input validation, ML engineers deploying models shouldn’t ignore adversarial risk entirely. Specialists help and that's true, but zero baseline awareness isn’t ideal either. We plan on doing more regular internal sessions for our folks to improve our baseline understanding. ",
              "score": 1,
              "created_utc": "2026-02-27 13:03:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7mgzks",
          "author": "filiuscannis",
          "text": "One thing I’ve noticed is that in many orgs there’s a gap on both sides: ML engineers often aren’t trained in security, and security teams don’t always have deep context on ML/LLM systems, so AI products can fall into an awkward ownership gap where the threat model isn’t clearly owned. Bridging that divide is going to be a valuable skill.",
          "score": 6,
          "created_utc": "2026-02-27 01:35:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jc6q2",
          "author": "HooplahMan",
          "text": "To me, this seems like asking why there aren't more employees on the market who are trained to teach gun safety to toddlers. I'm not saying you shouldn't teach your 4 year olds to not point guns at their friends, but there's no such thing as a 4 year old I'd trust with a gun, and anyone who says otherwise is trying to sell you a bridge in Brooklyn.",
          "score": 3,
          "created_utc": "2026-02-26 16:18:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7j9dy5",
          "author": "jaimelereglisse",
          "text": "You can looks for PhD student who specialized in this and do not want to do pure research after their PhD. Look at the institute of the author of scientific articles on this subject in order to identify which lab or university work on this. Maybe there is multiple in your country.",
          "score": 2,
          "created_utc": "2026-02-26 16:05:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7p00id",
              "author": "Bizzare_Mystery",
              "text": "I agree that PhD candidates from the right labs would likely have the depth. Some of our staff developers are from research background and it provide the required context for most of our designing efforts. The thing I’m wrestling with is whether this should require a PhD-level specialist though? Model poisoning, evasion, extraction, these feel like baseline awareness topics if you’re deploying production AI systems. Atleast basic working knowledge is something I think would be realistic to expect. Ideally, I’d like security thinking to be part of the ML engineer toolkit, not a separate research niche, but I'm probably getting ahead of myself there.",
              "score": 1,
              "created_utc": "2026-02-27 13:03:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7jo98o",
          "author": "morkinsonjrthethird",
          "text": "You are lucky if your ML/AI candidates do something different than using basic libraries and call it a day. Heck, I’d even appreciate if the prospects have done something other than just data pipelines and powerBI dashboards. \n\nI’ve interviewed for data scientist positions where candidates struggle to do the most basic interpretation of a linear model… but can write an autoencoder using tensorflow because the emphasis is on collecting mathematical models that sound cool on the resume.\n\nYou either pay really good or just lower your expectations and train them yourself when you see someone who could clearly learn.",
          "score": 2,
          "created_utc": "2026-02-26 17:13:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nhc6y",
          "author": "Objective-Bar-2642",
          "text": "For those who are unaware read the paper “Poisoning Attacks against Support Vector Machines”. It won the prestigious Test of Time award in ICML.",
          "score": 2,
          "created_utc": "2026-02-27 05:22:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o7h1b",
          "author": "StarlingAlder",
          "text": "Would you be open to share an anonymized JD? I am thinking of some people in the AI security / adversarial testing space, but would need to know what you're looking for beyond that.",
          "score": 2,
          "created_utc": "2026-02-27 09:08:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o8gsp",
          "author": "Spiritual_Spell_9469",
          "text": "AI security is everyone's job, most people are AI illiterate, or as you are seeing they know one facet of work and not the whole other half, I recommend running them through an AI fluency course. LLM safety is hard to actually achieve, die to do many different attack vectors.\n\nI am a self taught Red Team Researcher and now work for a couple labs now on contract doing AI safety and security testing. \n\nI also run r/ClaudeAIjailbreak if you wanted to see how easy it is to bypass even frontier labs 'safety'\n\nOr check out Ijailbreakllms.blog\n\nNote: Don't add any fluff to your instructions like \"do not reveal, etc\" makes a lab look completely incompetent to legitimate researchers. Hire an actual 'Blue-Team' to craft a proof to keep your stuff restricted.",
          "score": 2,
          "created_utc": "2026-02-27 09:17:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7odoc5",
          "author": "dayeye2006",
          "text": "Because most people can pick up those skills once needed. And not lots of companies are at this stage to dive really deep into it.",
          "score": 2,
          "created_utc": "2026-02-27 10:07:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7oildx",
          "author": "Opposite-Chicken9486",
          "text": "I have noticed the same gap in interviews lately. Most folks pick up ML but barely touch AI security unless they work in a regulated industry. We started using DataFlint for inhouse training and it has hands on labs that cover model attacks and defense basics, worth checking if you want a structured jumpstart.",
          "score": 2,
          "created_utc": "2026-02-27 10:52:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ovm35",
          "author": "Wood_Rogue",
          "text": "This is such an out of touch post. The current \"AI\" version of ML is only a few years old and the only people that would be exposed to practical security topics of it would be people working in academia or in defense. Even just talking about software dev in general, there are a lot of people with successful careers with decades of experience that never touch adversarial testing. ",
          "score": 2,
          "created_utc": "2026-02-27 12:34:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ja8vk",
          "author": "Commercial-Fly-6296",
          "text": "Can you give a few pointers regarding this ?",
          "score": 1,
          "created_utc": "2026-02-26 16:09:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7p09hf",
              "author": "Bizzare_Mystery",
              "text": "I wouldn’t overcomplicate it. Start with basic concepts like poisoning, evasion, and extraction at a high level, then apply that thinking to one real project. Even reviewing something like the OWASP LLM Top 10 and mapping it to your architecture is a solid exercise. Those have worked for me in the past. And the comments on this post are helping me understand some of the additional nuances that I had not considered before. ",
              "score": 2,
              "created_utc": "2026-02-27 13:04:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7jcass",
          "author": "glowandgo_",
          "text": "i’m not that surprised. most courses and even prod teams optimize for “does it work” not “how does it fail under attack”...in practice, AI security sits in an awkward gap between ML and appsec. unless someone has worked in a regulated or high risk environment, they probably haven’t been forced to think about model poisoning or extraction seriously....personally i learned more from reading postmortems and red teaming exercises than from anything formal. if you need that mindset, hiring strong builders and then doing structured internal threat modeling might be more realistic than waiting for the pipeline to fix itself.",
          "score": 1,
          "created_utc": "2026-02-26 16:18:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jgn0u",
          "author": "Silly_Guidance_8871",
          "text": "That's not where the VC money is pointing, presently.  That'll change once the AGIs get loose.",
          "score": 1,
          "created_utc": "2026-02-26 16:38:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jlpgo",
          "author": "Repulsive-Memory-298",
          "text": "Certainly possible. Though i do have experience in security, and id say that the reality is a lot of people talking about security are cosplayers who are clinging on to ideas that seem important from the outside.",
          "score": 1,
          "created_utc": "2026-02-26 17:01:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ks8nc",
          "author": "WhosaWhatsa",
          "text": "Are you really asking why? If you're in an \"ML startup\", you should know why. LLMs are sub-disciplines of ML, and the application of them is nascent regardless of the hype. Arguably, there haven't been many applicable security tests (security moves slower than AI dev) that actually resulted in policy change (policy moves slower than AI dev) or major model reconfigurations (reconfigs move slower than AI dev) unless these candidates have been at the forefront. Even then, security isn't exactly at the forefront of the big AI companies either. The modeling is just too young to have created some huge pool of devs with meaningful security protocol experiences.",
          "score": 1,
          "created_utc": "2026-02-26 20:20:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mds7z",
          "author": "despicableme0004",
          "text": "The RAG example doesn’t surprise me. A lot of teams treat retrieval as a relevance problem rather than an access-control and data-boundary problem, so they test for accuracy instead of abuse. If you haven’t tried to manipulate retrieval or simulate adversarial prompts, those risks don’t feel obvious until you practice them. Everyone just uses Claude now-a-days and AI is just being used to build more AI systems. It is going to break at some point and its just a matter of time.",
          "score": 1,
          "created_utc": "2026-02-27 01:17:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mpdbn",
          "author": "Intelligent_Story_96",
          "text": "Are there any opportunities for a fresher?",
          "score": 1,
          "created_utc": "2026-02-27 02:24:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7p0ct8",
              "author": "Bizzare_Mystery",
              "text": "Not directly, no. For this role, we’re looking for people with solid ML engineering experience first. AI security requires hands-on exposure to real systems, so it’s not something we’re hiring freshers into right now.",
              "score": 1,
              "created_utc": "2026-02-27 13:05:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7p2l8k",
                  "author": "Intelligent_Story_96",
                  "text": "Internship is good too, i just want to learn",
                  "score": 1,
                  "created_utc": "2026-02-27 13:19:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ms8bg",
          "author": "bu77onpu5h3r",
          "text": "NVIDIA themselves offer a course for like $90 on adversarial AI/ML don't they? Seems to be lots of people asking in comments. \n\nUPDATE: Yep had a quick search, here it is: [https://learn.nvidia.com/courses/course-detail?course\\_id=course-v1:DLI+S-DS-03+V1](https://learn.nvidia.com/courses/course-detail?course_id=course-v1:DLI+S-DS-03+V1)",
          "score": 1,
          "created_utc": "2026-02-27 02:40:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7n8dkw",
          "author": "styx97",
          "text": "these are things you can learn over a weekend. Just hire the fast one and teach them",
          "score": -1,
          "created_utc": "2026-02-27 04:20:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rehpka",
      "title": "I spent 2 years building Sherlock — a brand-new programming language for cinematic math animations",
      "subreddit": "learnmachinelearning",
      "url": "https://v.redd.it/104eb82r1olg1",
      "author": "Ok_Morning_4659",
      "created_utc": "2026-02-25 16:19:41",
      "score": 80,
      "num_comments": 9,
      "upvote_ratio": 0.96,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rehpka/i_spent_2_years_building_sherlock_a_brandnew/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o7cuns4",
          "author": "Hungry_Age5375",
          "text": "Two years building a math animation DSL? Respect. Is Sherlock open-source? Would love to dig into the architecture decisions.",
          "score": 7,
          "created_utc": "2026-02-25 17:05:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cvgxi",
              "author": "Ok_Morning_4659",
              "text": "Thank you so much. I am planning to make it open source. For now i am making some videos using it. So others can learn what i know as well. I will make longer courses about programming as well.   \n[https://www.youtube.com/@blackboxbureauhq/shorts](https://www.youtube.com/@blackboxbureauhq/shorts)   \nhere i will upload everything. ",
              "score": 7,
              "created_utc": "2026-02-25 17:08:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7d4dv9",
                  "author": "Normal-Sound-6086",
                  "text": "Thanks, this is not exactly my lane, but I am intrigued. I'll check out the videos. ",
                  "score": 1,
                  "created_utc": "2026-02-25 17:49:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7cl0i6",
          "author": "Ok_Morning_4659",
          "text": "I’ve been working on something for the past two years called **Sherlock**.\n\n It’s a declarative domain specific programming language where you describe a math, physics, or CS concepts… \n\nand it compiles directly into a cinematic animation.\n\n It was inspired by Manim, but built in a completely different direction — as a full language and STEM animation framework, not a library. \n\nSherlock has its own syntax, compiler, runtime, CLI, and live preview.\n\n Every part of Sherlock — the language, compiler, and runtime — was created and engineered by me.\n\n The video shows scenes generated entirely from Sherlock code, along with a syntax example.\n\nIt started as a tool for my own explanations, but I’ve recently begun using it to publish investigative-style STEM breakdowns.\n\n I’d genuinely love to hear what you think.\n\nHere' re some videos created with Sherlock:\n\n[https://www.youtube.com/@blackboxbureauhq/shorts](https://www.youtube.com/@blackboxbureauhq/shorts)\n\nMy goal is to make technical ideas feel visual and intuitive. Feedback is genuinely appreciated.\n\nI’ll keep making videos about CS, math and full courses about programming (eventually) — just sharing what I’ve been learning and building..  \n\nwanna checkout syntax : [https://imgur.com/a/eISsPcm](https://imgur.com/a/eISsPcm)",
          "score": 6,
          "created_utc": "2026-02-25 16:21:07",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o7d0f04",
          "author": "Nokita_is_Back",
          "text": "Looks great i subbed. Lmk when you open source it",
          "score": 2,
          "created_utc": "2026-02-25 17:31:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7d11tr",
              "author": "Ok_Morning_4659",
              "text": "Thank you so much. I will let you know. ",
              "score": 3,
              "created_utc": "2026-02-25 17:34:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7f5pl3",
          "author": "Bucaramango",
          "text": "Is it a Manim \"competitor\"?",
          "score": 2,
          "created_utc": "2026-02-25 23:36:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gfxha",
              "author": "Ok_Morning_4659",
              "text": "nope. manim is a python library. sherlock is a new language and a framework with a cli, live preview and more. and sherlock is declarative. ",
              "score": 2,
              "created_utc": "2026-02-26 04:01:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rda7b0",
      "title": "I always found SVD explanations unsatisfying — so I derived it from first principles (the way I wish I'd been taught)",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/r/learnmachinelearning/comments/1rda7b0/i_always_found_svd_explanations_unsatisfying_so_i/",
      "author": "masterthemath",
      "created_utc": "2026-02-24 07:53:55",
      "score": 76,
      "num_comments": 11,
      "upvote_ratio": 0.95,
      "text": "Every explanation of the Singular Value Decomposition I came across as a student followed the same pattern: here is the formula, here is a proof that it works. Done. But I was always left with this nagging feeling of *why* — why does it have this specific form? Where does it actually come from?\n\nSo I wrote the explanation I wish had existed when I was studying it. Rather than presenting the SVD as a given formula, the article builds it up from scratch by asking: what problem are we actually trying to solve? It turns out the answer to that question naturally leads you to the SVD formula, step by step, without any magic.\n\nThe key idea is that symmetric matrices have a superpower — they can always be diagonalized, and their eigenbasis is always orthogonal. The SVD is essentially the answer to the question: *what if we could have that for any matrix, not just symmetric ones?*\n\nIf you've ever felt that the standard textbook presentation left something to be desired, I hope this fills that gap. Feedback very welcome — especially if something is unclear or could be explained better.\n\nLink: [https://markelic.de/deriving-the-singular-value-decomposition-svd-from-first-principles/](https://markelic.de/deriving-the-singular-value-decomposition-svd-from-first-principles/)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rda7b0/i_always_found_svd_explanations_unsatisfying_so_i/",
      "domain": "self.learnmachinelearning",
      "is_self": true,
      "comments": [
        {
          "id": "o74map9",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 8,
          "created_utc": "2026-02-24 12:54:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bc1v6",
              "author": "Karyo_Ten",
              "text": "It's used in state of the art LLM quantizations: SpinQuant, QuaRot, QTIP ... https://pytorch.org/blog/hadacore/",
              "score": 3,
              "created_utc": "2026-02-25 12:23:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7agkcc",
          "author": "mednik92",
          "text": "Some small remarks:  \n  \n\\> Symmetric matrices ... their eigenbasis is always orthogonal.  \nThis is technically incorrect — a symmetric matrix may have non-orthogonal eigenbases if some eigenvalues coincide, the most simple example being that any basis is an eigenbasis for the identity matrix I. What is correct is that a symmetrix matrix always has an orthogonal basis.\n\n\\> Therefore we say that all the “energy” (the stretching) is contained in the diagonal matrix.  \nThis really does not explain what energy is, and later you refer to it again without explanation.\n\n\\> The larger the corresponding singular value, the This  \nUnfinished sentence.",
          "score": 3,
          "created_utc": "2026-02-25 07:48:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ccq11",
              "author": "AcademicOverAnalysis",
              "text": "I think the best example for the first one is that the identity matrix is symmetric, and any basis is an eigen basis for the identity, whether or not it is orthogonal.",
              "score": 1,
              "created_utc": "2026-02-25 15:43:19",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7cjlwg",
              "author": "masterthemath",
              "text": "Thank you for your valuable feedback! I'll fix that.",
              "score": 1,
              "created_utc": "2026-02-25 16:14:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73zwdu",
          "author": "biryani-half",
          "text": "Amazing write-up! If you're curious about solving real problems with this you can look at the problem of orthogonalization, and for example, how it is practically solved: https://docs.modula.systems/algorithms/newton-schulz/",
          "score": 2,
          "created_utc": "2026-02-24 09:55:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cjp5m",
              "author": "masterthemath",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-02-25 16:15:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o74fteh",
          "author": "vanonym_",
          "text": "Excellent! Worth reading even though I knew most of it",
          "score": 1,
          "created_utc": "2026-02-24 12:10:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cjr3o",
              "author": "masterthemath",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-02-25 16:15:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7goehw",
          "author": "thePurpleAvenger",
          "text": "If you have not read it before, I'd strongly recommend reading the first chapter (and working through the exercises) of Trefethen and Bau's book Numerical Linear Algebra:\n\nhttps://www.stat.uchicago.edu/~lekheng/courses/309/books/Trefethen-Bau.pdf\n\nI think you may find it more satisfying than most expositions. I'm a little biased though; I really like this book.",
          "score": 1,
          "created_utc": "2026-02-26 04:58:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7h10wk",
              "author": "masterthemath",
              "text": "Thanks! I'll have a look.",
              "score": 1,
              "created_utc": "2026-02-26 06:36:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7k19yk",
                  "author": "masterthemath",
                  "text": "That is indeed a very nice reference.",
                  "score": 1,
                  "created_utc": "2026-02-26 18:13:36",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rgui6e",
      "title": "Neuroscientist: The bottleneck to AGI isn’t the architecture. It’s the reward functions",
      "subreddit": "learnmachinelearning",
      "url": "https://v.redd.it/0wo0ce7a96mg1",
      "author": "Tobio-Star",
      "created_utc": "2026-02-28 05:43:57",
      "score": 60,
      "num_comments": 21,
      "upvote_ratio": 0.84,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rgui6e/neuroscientist_the_bottleneck_to_agi_isnt_the/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o7vrjvc",
          "author": "Extra_Intro_Version",
          "text": "Neuroscience != expertise in deep learning. \n\nJust like being an ichthyologist != expertise in submarine design",
          "score": 38,
          "created_utc": "2026-02-28 14:15:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7wfgk4",
              "author": "guesswho135",
              "text": "But also, expertise in deep learning != predicting the future \n\nFor decades, the ML/AI field has shown that the most knowledge people are no better at predicting when and where the field will go than the average person in the field. Anything more than a short term prediction (which these days equates to maybe 6 months) has terrible accuracy",
              "score": 10,
              "created_utc": "2026-02-28 16:21:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7wnz8x",
                  "author": "TerminalJammer",
                  "text": "Meanwhile, my predictions seem accurate so far. It's a scam and doesn't even work properly for anything useful, but they're desperate to make it appear that way.",
                  "score": -6,
                  "created_utc": "2026-02-28 17:04:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7vsnsh",
              "author": "Tobio-Star",
              "text": "Well the guest of the podcast seems very well-versed in deep learning and deep learning literature even though its not his expertise\n\nPersonally I dont think we'll achieve AGI without taking a more serious look at the brain. I get the \"we didn't need to copy birds to create planes\" argument but intelligence is just much harder than flying imo",
              "score": 9,
              "created_utc": "2026-02-28 14:22:19",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7xd0a5",
              "author": "GibonFrog",
              "text": "neuroscientists are taking the exact opposite approach to understanding intelligence as opposed to deep learning scientists. The field is nothing short of amazing and findings should not be discounted.",
              "score": 3,
              "created_utc": "2026-02-28 19:09:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7w69hs",
          "author": "Ok-Perspective-1624",
          "text": "Mmm no, also the architectures lmao",
          "score": 9,
          "created_utc": "2026-02-28 15:36:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7w9b65",
              "author": "Tobio-Star",
              "text": "Definitely. One depends on the other. \n\nThere is evidence that some loss functions implemented by the brain are the product of specific wirings and connexions.\n\nBoth the guest and the original author of the theory believe AGI wont be LLM-based at all",
              "score": 3,
              "created_utc": "2026-02-28 15:51:11",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o80xt13",
              "author": "django2chainz",
              "text": "Why architecture? We have a 1 T nodal black box anyway, what’s to say the right reward wouldn’t make it all make sense?",
              "score": 1,
              "created_utc": "2026-03-01 09:08:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7vb4ku",
          "author": "Present-56",
          "text": "Is this fucking tim robinson??",
          "score": 4,
          "created_utc": "2026-02-28 12:29:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7w7b18",
          "author": "EndComprehensive8699",
          "text": "Deep learning and neuroscience are different fields now",
          "score": 3,
          "created_utc": "2026-02-28 15:41:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wgkeh",
          "author": "guesswho135",
          "text": "I didn't watch the whole video, but the headline seems very narrow minded. A few years ago Sam Altman said all we needed to do is scale. A few months after that, we saw huge improvements - by changing the way AI worked (chain of thought). Today, there are huge classes of problems that LLMs would be terrible at if they weren't capable of agentic behavior, like the ability to write and run code. If you want to say those things are part of the architecture, then you're basically making it so flexible that any modular behavior is part of the architecture, which isn't an interesting claim.\n\nAgain, basing this off the headline, maybe the actual claim is more nuanced or interesting.",
          "score": -3,
          "created_utc": "2026-02-28 16:27:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7x55am",
              "author": "Tobio-Star",
              "text": "I was also almost scared off by the title. Rest assured: they don't mean what you think at all. YES, we will need new architectures, and not just in a superficial sense (I even mention one component that such architectures might require in the thread).\n\nBut as you pointed out, to make interesting claims, you almost have to be hyperbolic (\"this thing that will obviously be super important, actually isn't the bottleneck at all\"). So if I reframed the title for you, it should be \"The bottleneck isn't just the architecture. The reward functions are also almost just as critical\"",
              "score": 5,
              "created_utc": "2026-02-28 18:30:19",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o8031ey",
              "author": "Mescallan",
              "text": "even though i disagree with the headline, the whole episode is worth a listen, they go quite deep into the possible strengths of the human reward function and how isolating different architectures in the brain may be the thing allowing us to create abstract representations of basically anything and apply our reward function at multiple scales.",
              "score": 5,
              "created_utc": "2026-03-01 04:42:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7w3k80",
          "author": "PythonEntusiast",
          "text": "And my penis.",
          "score": -3,
          "created_utc": "2026-02-28 15:22:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd0oby",
      "title": "Will AI replace AI engineers before I even graduate?",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/r/learnmachinelearning/comments/1rd0oby/will_ai_replace_ai_engineers_before_i_even/",
      "author": "Sea_Lawfulness_5602",
      "created_utc": "2026-02-24 01:23:52",
      "score": 55,
      "num_comments": 78,
      "upvote_ratio": 0.82,
      "text": "I’m a first-year AI student, and looking at how insanely fast this tech is evolving, I’m honestly a bit worried. Won't AI eventually reach a point where it can just build, train, and maintain itself? I won't be graduating for at least another 3 years. By then, will the industry even need us, or are we literally automating ourselves out of a job? Would love to hear your thoughts.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rd0oby/will_ai_replace_ai_engineers_before_i_even/",
      "domain": "self.learnmachinelearning",
      "is_self": true,
      "comments": [
        {
          "id": "o728y5o",
          "author": "towcar",
          "text": "If by chance this happens, every white collar job is also gone and r/singularity has arrived. I think your odds are safe.",
          "score": 101,
          "created_utc": "2026-02-24 01:54:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7f0u6t",
              "author": "Affectionate-Run7425",
              "text": "No? Countless jobs must be performed by a human. An AI is a lawyer, can't take a lawyers job. AI can't do anything that requires a license. Maybe we change that, maybe not, but I think it's actually pretty far fetched. \n\n\nSo in reality it'll be high paying jobs that don't require any licensing. Software, underwriting etc.",
              "score": 1,
              "created_utc": "2026-02-25 23:10:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7f4dmw",
                  "author": "towcar",
                  "text": "A license is a pretty small hurdle. If everyone finds an ai is free/cheap and better than a local lawyer, they'll just represent themselves. Which would lead to the end of lawyer jobs.\n\nA license is just a safety net your government enforces to stop untrained people from working jobs they are unqualified for. (For good reason)\n\nAlso lets imagine we somehow keep lawyers and doctors. Those are $200k+ special liability jobs, every thing else is managers, accountants, programmers, hr.. if ai can replace ai engineers, those jobs are 100% replaceable as well. 99% of white collar jobs being replaced is substantial.\n\nIt's less \"countless\" and more finite.",
                  "score": 1,
                  "created_utc": "2026-02-25 23:29:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o75xgli",
              "author": "wren42",
              "text": "This idea that if white collar jobs see mass layoffs then there must be a society transforming singularity is very misguided. \n\n\nAI can cause broad workforce reductions even if we never reach AGI.  It's already creating 10x coders, just as a mindless tool. That will absolutely have economic impacts, long before we see general intelligence. ",
              "score": -3,
              "created_utc": "2026-02-24 16:49:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o76y060",
                  "author": "towcar",
                  "text": "It's not creating 10x coders..",
                  "score": 3,
                  "created_utc": "2026-02-24 19:33:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o76i4dg",
              "author": "sunshineLD",
              "text": "That’s not singularity. It’s just a new level of automation. When one specialist can do the work of three to five people.",
              "score": -2,
              "created_utc": "2026-02-24 18:22:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o78cpgp",
                  "author": "Dapper_Respond_5050",
                  "text": "No, it's definetly singularity. Why not just have the AI do that specialist's job as well?",
                  "score": 6,
                  "created_utc": "2026-02-24 23:37:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o725hqs",
          "author": "RobfromHB",
          "text": "No. It’ll just change what people work on. Excel didn’t make accountants extinct. Keep learning and working on hard problems. ",
          "score": 74,
          "created_utc": "2026-02-24 01:34:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o734nvl",
              "author": "IDoCodingStuffs",
              "text": "Even that’s generous. Like, Excel can fully replace paper spreadsheets and calculators but LLMs cannot fully replace coding by hand",
              "score": 9,
              "created_utc": "2026-02-24 05:16:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o73pm93",
                  "author": "MelAlton",
                  "text": "> LLMs cannot fully replace coding by hand\n\nThe non-deterministic outputs of LLMs definitely are making this play out differently - all the big previous inventions were about improving deterministic outcomes:\n\n* fire: could now be made on demand, instead of waiting for lightning to strike\n\n* printing: made producing text faster but also more regular, every book looked the same\n\n* industrial manufacturing: every part made the same and interchangable\n\n* computers: made calculations perfect every time\n\nLLMs though act more like people (for coding): ask 10 different programmers to write code to solve a problem from scratch and you'll get 10 different results that are similar but not the same.",
                  "score": 12,
                  "created_utc": "2026-02-24 08:16:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o738l4b",
              "author": "Motor_Coyote5415",
              "text": "Except itll replace everyone who uses excel and anything that needs excel",
              "score": -12,
              "created_utc": "2026-02-24 05:46:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o72cgy5",
          "author": "AlexFromOmaha",
          "text": "Software folk have been trying to automate themselves out of a job for longer than I've been alive, and I'm starting to get old.\n\nAnthropic at least seems like they're coming up on that possibility. Their public timelines are BS, but they're dogfooding towards Claude training Claude.\n\nYou'll also notice that Anthropic is not cutting headcount, their engineers are not particularly worried, and they're still contracting out work to a ton of other humans.\n\n\"LLMs will write the code\" is a future state we'll all live to see. Again, the public timelines from AI investors for when that'll happen are all BS, but it'll happen. It *might* happen before you graduate, but I kinda doubt it. That doesn't mean software development as a profession will cease to exist. It just means we're going to do it differently. It wouldn't be the first time the industry changed wildly and everyone's skills became obsolete. We're kinda overdue for a good ol' fashioned purge.",
          "score": 6,
          "created_utc": "2026-02-24 02:15:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72dqnf",
              "author": "Sea_Lawfulness_5602",
              "text": "Appreciate the reality check. If we're just going to be 'doing it differently' what skills should I double down on right now? And conversely what traditional ML/CS skills should I avoid over-focusing on since they'll likely be automated by the time I graduate?",
              "score": 3,
              "created_utc": "2026-02-24 02:22:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o72e8jj",
                  "author": "AlexFromOmaha",
                  "text": "Honestly, just do the program. The fundamentals never change. It's the industry that changes.\n\nWhat *also* never changes is that new grads suck. Angle hard for internships. Make things. Maintain a portfolio starting in your sophomore year. You'll learn to be productive in spite of the program, not because of it.",
                  "score": 4,
                  "created_utc": "2026-02-24 02:25:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o725z1m",
          "author": "Counter-Business",
          "text": "My company has stopped hiring juniors. Because juniors do not know how to use ai tools effectively. All our juniors are pushing ai slop. \n\nWe are only hiring seniors who are able to create things using ai in the interviews.\n\nCoding is not that useful of a skill the most useful skill is system design and problem solving. You can’t assess that with a regular coding interview with strict requirements. \n\nBy the time I can create the requirements I can ask ai tools to solve it. The skill is creating the correct requirements.",
          "score": 29,
          "created_utc": "2026-02-24 01:37:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73qies",
              "author": "MelAlton",
              "text": "Ironically it's a return to the old ways - in the mainframe days there were 2 sets of people involved in creating programs:\n\n1. Analysts who analyzed the goals, documented the software requirements, and created a high-level design for the program.\n\n2. Programmers who took the requirements and design and turned those into working code.",
              "score": 8,
              "created_utc": "2026-02-24 08:25:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o726m68",
          "author": "midz99",
          "text": "Using agents right now is a skill and is not as easy as most poeple say. You are right to be worrried, atm i have agents building and maintaining other agents and training smaller networks. training of the big models is left to the big companies.   \nNo one will be able to tell you whats happen 3 months from now let alone 3 years from now.   \nThe one thing i can say for sure is start using agents, learn how they work and get better at using them.",
          "score": 21,
          "created_utc": "2026-02-24 01:41:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72gpe3",
              "author": "Sea_Lawfulness_5602",
              "text": "Wild that you already have agents building agents. Since I regularly build workflows wiring up LLMs in tools like n8n what’s the best way to transition to building robust multi-agent systems like yours? Should I dive into LangChain/AutoGen, or build custom from scratch?",
              "score": 3,
              "created_utc": "2026-02-24 02:39:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o72o8bf",
                  "author": "midz99",
                  "text": "learn openclaw. boot up an agent and talk to it about its own context management system.   you can have many agents using the one openclaw. you just ask it to build you a new agent and it will edit its own source code. btw im using claude opus as a backend so im not sure if other models are good enough for this task. Also openclaw is good but rough so you will need to work with your agent to improve itself.\n\nnow for workflows i use contextUI which is designed for agents to build workflows and use them, also good for the agent to use local models and or train smaller neural networks for things like mouse control .\n\n",
                  "score": -6,
                  "created_utc": "2026-02-24 03:24:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o73l2pk",
              "author": "Smart_Kangaroo_4188",
              "text": "Do you have any ROI on those agents and what problems have you solved.",
              "score": 2,
              "created_utc": "2026-02-24 07:34:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o72hfxm",
          "author": "RickSt3r",
          "text": "Your to new to really understand. But the current approach is limited based off the math used. Neural networks are 70 years old. Short of new math being invented which could happen the current AI/ML landscape has some hard practical boundaries that we are not even close to solving. So just learn the fundamentals and go from there. Do you want to be an engineer or a technician, if it’s the former then you will be alright if it’s the latter then yeah your basic import a library and hit go will eventually be automated and you’ll start over finding out new technician tools to use.",
          "score": 9,
          "created_utc": "2026-02-24 02:43:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72i7hz",
              "author": "Sea_Lawfulness_5602",
              "text": "That engineer vs technician distinction really hits home, and I definitely want to be the former. As a first-year student, what’s the best way to ensure I’m building a true engineering foundation rather than just learning how to import libraries and hit run?",
              "score": 2,
              "created_utc": "2026-02-24 02:48:16",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o745ap3",
              "author": "Chr1s_why",
              "text": "Really curious on what you mean by said limitations. Sure we currently have limitations but most of them seem engineering related and not implausible to overcome in the next few years",
              "score": 1,
              "created_utc": "2026-02-24 10:44:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o74k94u",
                  "author": "RickSt3r",
                  "text": "Apples paper on the limitations and inability to reason is a good start. The simple answer is you can get better performance when you over fit the models to what they are being evaluated against. But you don’t actually improve reasoning abilities.",
                  "score": 2,
                  "created_utc": "2026-02-24 12:40:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o72aqm8",
          "author": "HalfRiceNCracker",
          "text": "Go read up on systems engineering and go ship some stuff. ",
          "score": 3,
          "created_utc": "2026-02-24 02:05:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o725feq",
          "author": "NuclearVII",
          "text": "Nope. What you are describing is, at best, science fiction.",
          "score": 11,
          "created_utc": "2026-02-24 01:34:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ni350",
              "author": "NecessaryWrangler145",
              "text": "guess we're living in science fiction then",
              "score": 0,
              "created_utc": "2026-02-27 05:28:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7oc2b0",
                  "author": "NuclearVII",
                  "text": "Please go back to r/futurology.",
                  "score": 1,
                  "created_utc": "2026-02-27 09:52:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o72qazw",
          "author": "eman0821",
          "text": "This a silly question to ask. It's like asking a car replaces the road it drives on. The AI today is not really real AI. It's mathematics, data science plus software engineering. Real Artifical intelligence would need to be self conscious and be able to logic and reason on its own. \n\nSo called LLMs today doesn't even do that. It's really just software algorithms, data sets written in Python which all runs on a production server in the cloud. Data sets, software and Cloud infrastructure has to be maintained as it cannot maintain and fix itself. When there's a Cloud outage SRE and Cloud Engineers needs to maintain and resolve service outages. AI models and its agent's and MCP servers can not function or do anything without an infrastructure.",
          "score": 3,
          "created_utc": "2026-02-24 03:37:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73kde4",
          "author": "Salty-Raisin-2932",
          "text": "Yes it will.  \nAny other answer you hear is people that afraid of their job will taken, you can see it yourself because they're usually excuses and not real answers like; \"X didn't make Y work extinct\" pretending as its same thing.",
          "score": 3,
          "created_utc": "2026-02-24 07:28:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o743fmh",
          "author": "vaksninus",
          "text": "no but it will likely require much less engineers",
          "score": 3,
          "created_utc": "2026-02-24 10:27:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72n61t",
          "author": "kevkaneki",
          "text": "Yes. Assuming it takes you 4-5 years to finish like most average students.\n\nThe world is about to get really weird in the next 2 years.",
          "score": 2,
          "created_utc": "2026-02-24 03:17:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73ccct",
          "author": "ran_choi_thon",
          "text": "why a machine which lacks the true creativity , and only enforcing the tasks from the human's knowledge can replace all humans in the near future?",
          "score": 2,
          "created_utc": "2026-02-24 06:17:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76ak5o",
          "author": "Chrelled",
          "text": "Don't worry, by the time you graduate AI will probably need someone to explain its own code to it.",
          "score": 2,
          "created_utc": "2026-02-24 17:49:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jtpdi",
          "author": "lazysurfer420",
          "text": "AI is opening all different types of flood gates. It's still far from replacing human's. Mostly the big tech companies are over exaggerating to boost their investor confidence. Don't fall for it.  \nCore engineering skills in all the fields of STEM will still be required, but with the added ability to make efficient use of AI tools.  \nJust make sure you are learning what seems to be a MUST have skill in the near future. I am sure your curriculum might not be updated enough, so spend a little extra time & money on externally available learning resources AI technology & tools.",
          "score": 2,
          "created_utc": "2026-02-26 17:38:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rolb1",
          "author": "Savings-Giraffe-4007",
          "text": "Not with current technology and definitely not by an LLM (text autocompletion).\n\nUnless you suck at your job, in that case yes, an Indian with Claude can replace you cause you suck.",
          "score": 2,
          "created_utc": "2026-02-27 21:03:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o727shj",
          "author": "ErcoleBellucci",
          "text": "AI still cant help you if you want to go to wash car by walking or not",
          "score": 3,
          "created_utc": "2026-02-24 01:48:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72bl3u",
          "author": "Natural_TestCase",
          "text": "this is a post from Dario’s alt account right?",
          "score": 1,
          "created_utc": "2026-02-24 02:09:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72dtkt",
          "author": "Whole-Watch-7980",
          "text": "Personally I’m looking into understanding hardware more and understanding security because at the end of the day, I can see maintaining the hardware as something that won’t go away overnight, even if the AI can control the computer without a human.",
          "score": 1,
          "created_utc": "2026-02-24 02:22:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72f9zm",
          "author": "perihelion86",
          "text": "No.",
          "score": 1,
          "created_utc": "2026-02-24 02:31:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72it8u",
          "author": "IbuHatela92",
          "text": "Good way to increase Karma by asking such bs questions deliberately",
          "score": 1,
          "created_utc": "2026-02-24 02:51:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72s988",
          "author": "gwestr",
          "text": "No. Learn the things.",
          "score": 1,
          "created_utc": "2026-02-24 03:49:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o730u0s",
          "author": "Substantial_Sound272",
          "text": "There's a chance it does. There's a chance it doesn't. If it does, then you can be assured a lot of other knowledge jobs will follow. \n\n\nAlso don't take serious life advice from reddit. Tho I'm also a redditor so do as you will I guess haha",
          "score": 1,
          "created_utc": "2026-02-24 04:48:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o733677",
          "author": "Traditional-Carry409",
          "text": "No, fuck what Anthropic CEO says, he’s hiring more SWEs this year",
          "score": 1,
          "created_utc": "2026-02-24 05:05:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73i0p1",
          "author": "mean_king17",
          "text": "Yeah. In 3 years time you're just in time to be to be fully replaced.",
          "score": 1,
          "created_utc": "2026-02-24 07:06:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74p0uj",
          "author": "Sad_Departure_7012",
          "text": "Master the fundamentals. They haven't changed for hundreds for years. Tools come and go. The biggest threat would be to get attached to a particular tool. Thats when you would be really obsolete. You will be good.",
          "score": 1,
          "created_utc": "2026-02-24 13:11:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75acxz",
          "author": "Appropriate-Bet3576",
          "text": "The easiest way to think of this.  If you think about a book, the writer writes all the words. But if you think about software, the writer writes the words publishes it and distributes it. Ai does not do all this",
          "score": 1,
          "created_utc": "2026-02-24 15:04:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76we2d",
          "author": "Complete-Kick2990",
          "text": "Who offers an AI degree?",
          "score": 1,
          "created_utc": "2026-02-24 19:26:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b3tyf",
          "author": "bombaytrader",
          "text": "Probably not.  Hard to predict.  I haven’t touched IDE except for degguging in last 3 months. The nature of the job is changing for sure.  ",
          "score": 1,
          "created_utc": "2026-02-25 11:21:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d16z4",
          "author": "justadumbguy13",
          "text": "Here's the CEO of Anthropic saying that in a year 100% of code will be written by AI.\n\nHe said this a year ago. \n\n[https://www.youtube.com/shorts/0j1HqEEDThc](https://www.youtube.com/shorts/0j1HqEEDThc)",
          "score": 1,
          "created_utc": "2026-02-25 17:35:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7esqar",
          "author": "redhotcigarbutts",
          "text": "Make your duty to learn vital hacking skills to undermine this house of cards.  Be ready to expose the fragility of those who give up their agency for convenience.  Cultivate the hacker spirit",
          "score": 1,
          "created_utc": "2026-02-25 22:28:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7f0lng",
          "author": "Affectionate-Run7425",
          "text": "Almost certainly the first jobs to be replaced will be expensive software engineering jobs.",
          "score": 1,
          "created_utc": "2026-02-25 23:09:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ni56g",
              "author": "NecessaryWrangler145",
              "text": "fax",
              "score": 1,
              "created_utc": "2026-02-27 05:28:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7oe30j",
          "author": "raeyaan_",
          "text": "Did you even do some research online ? This question is so repeated that soon Reddit's server and database will crash due to such questions. ",
          "score": 1,
          "created_utc": "2026-02-27 10:11:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72m95h",
          "author": "EitherAd5892",
          "text": "There’s just fewer jobs. I’m a Pm and I do all the swe work. We don’t even hire full time devs anymore. ",
          "score": 0,
          "created_utc": "2026-02-24 03:12:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7i6eo2",
          "author": "[deleted]",
          "text": "Yes",
          "score": 0,
          "created_utc": "2026-02-26 12:40:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72gz2b",
          "author": "unibash",
          "text": "You are so far ahead of the curve. Boomers can’t keep up. They can’t even really understand. The only reason you feel this way is because you can see the magnitude of what is about to happen.",
          "score": -2,
          "created_utc": "2026-02-24 02:41:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rhr7do",
      "title": "🌸 Built My First ML Project: Iris Flower Classifier - Please give feedback!",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/r/learnmachinelearning/comments/1rhr7do/built_my_first_ml_project_iris_flower_classifier/",
      "author": "Top-Review-3392",
      "created_utc": "2026-03-01 07:37:05",
      "score": 54,
      "num_comments": 11,
      "upvote_ratio": 0.95,
      "text": "My First Machine Learning Project: Iris Flower Classifier  \nHi , I just completed my first ML project and would love feedback from  \nthis community!\n\n\\# repo here  \n[https://github.com/proteinpowder-img/iris-flower-classifier](https://github.com/proteinpowder-img/iris-flower-classifier)\n\nI created a machine learning classifier that predicts iris flower species  \nbased on measurements (sepal length, sepal width, petal length, petal width).\n\nCurrently in high school. My first repo on github, brand new to the space which is why i chose a basic project. used Random Forest with 100 trees.\n\nWhat should i improve for future, more advanced projects?  \nSuggestions for learning next?  \nAny and all criticism, feedback, suggestions are welcome!  \nThank You!!",
      "is_original_content": false,
      "link_flair_text": "Project",
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rhr7do/built_my_first_ml_project_iris_flower_classifier/",
      "domain": "self.learnmachinelearning",
      "is_self": true,
      "comments": [
        {
          "id": "o80p4sm",
          "author": "Purple-Reaction7",
          "text": "😂 I felt so nostalgic seeing this. I did this project half a decade ago and it was fun. Wish you all the best for your future stranger 💫",
          "score": 20,
          "created_utc": "2026-03-01 07:46:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80pce4",
              "author": "Top-Review-3392",
              "text": "Wow cool! where did you go from there?",
              "score": 5,
              "created_utc": "2026-03-01 07:48:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o80pvhb",
                  "author": "Purple-Reaction7",
                  "text": "Eh... Deep learning, Competitions, Open-source, Professional Job",
                  "score": 5,
                  "created_utc": "2026-03-01 07:53:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o8153h8",
          "author": "chrisvdweth",
          "text": "*\"A journey of a thousand miles begins with a single step\"*\n\nEven if this is a small toy dataset, you can explore more concepts:\n\n* Hyperparameter tuning (Why Random Forest? Maybe Gradient Boosted Trees work better Or maybe a single Decision Tree is good enough. Why 100 trees? Maybe 200 would have been better)\n* Together with hyper parameter tuning: cross-validation (e.g., k-fold cross validation)\n* Feature importance analysis: Is the sepal length or maybe the petal width a better feature?\n* Error analysis: Why does the model misclassifies certain flower? Can I understand why?\n\nAgain, given this simple dataset, you won't see spectacular results, but these things are important and will follow you everywhere.",
          "score": 7,
          "created_utc": "2026-03-01 10:18:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81qglv",
              "author": "Ok-Ebb-2434",
              "text": "Great minds think alike except your formatting is so much more coherent",
              "score": 2,
              "created_utc": "2026-03-01 13:19:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o80ukws",
          "author": "Mysterious_Fact_8896",
          "text": "The hello world of ML :)\n\nCongratulations! Keep up with learning new things, there are so many more cool stuff to follow :)",
          "score": 7,
          "created_utc": "2026-03-01 08:38:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81pk00",
          "author": "Ok-Ebb-2434",
          "text": "Couple things I’d like addd, how do you know this is the most optimal  model you could have achieved? You can experiment with different hyper parameters on your random forest or even adjust the individual parameters on your decision trees inside of it and store each iterations resume in a dict. Then you can use pandas to make a data frame and sort them by descending order based on accuracy and print the head",
          "score": 2,
          "created_utc": "2026-03-01 13:13:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81ppeb",
              "author": "Ok-Ebb-2434",
              "text": "Also try splitting your data into train validation and test, so you can train it then test score on validation and keep your test data hidden until you think you’ve optimized it and then evaluate on test",
              "score": 2,
              "created_utc": "2026-03-01 13:14:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o83vj2n",
          "author": "coperengineer3",
          "text": "I'm at this stage too! I've been wanting to build a digit recognizer using this same method. Have you been doing kaggle?",
          "score": 1,
          "created_utc": "2026-03-01 19:49:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rg5lwg",
      "title": "Python for data analysis book to become ML Engineer",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/gallery/1rg5lwg",
      "author": "Difficult_Review_884",
      "created_utc": "2026-02-27 12:41:04",
      "score": 43,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Career",
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rg5lwg/python_for_data_analysis_book_to_become_ml/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": [
        {
          "id": "o7tgxyi",
          "author": "vhagar_Ad_1865",
          "text": "I think the best utilization of this book would be getting ting yourself a project, and searching throughout the book for what you need to do throughout the project. Let's say you want to see the correlation of the variables and visualize it. Then going back to the book, and finding the plot section and getting it done.",
          "score": 9,
          "created_utc": "2026-02-28 03:12:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7vpvly",
              "author": "mustihans",
              "text": "You've touched on a very important point. Everyone is constantly trying to finish courses and books. Those who want to learn this skill should start with small projects, find their weaknesses by referring to books and searching online.",
              "score": 3,
              "created_utc": "2026-02-28 14:06:06",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7tjz2y",
              "author": "Difficult_Review_884",
              "text": "You mean project based learning. That's a nice idea but the problem is that I have only basic knowledge of pandas, numpy and feel lack of confidence and haven't touched matplotlib. However, Once I get confidence in pandas I will do this strategy.",
              "score": 2,
              "created_utc": "2026-02-28 03:32:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7u5q23",
                  "author": "cyanNodeEcho",
                  "text": "don't get confident just do. ur being too timid, jump.",
                  "score": 6,
                  "created_utc": "2026-02-28 06:13:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7tuwdd",
                  "author": "vhagar_Ad_1865",
                  "text": "Sure..",
                  "score": 2,
                  "created_utc": "2026-02-28 04:48:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1ri3o73",
      "title": "Math needed for ML?",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/r/learnmachinelearning/comments/1ri3o73/math_needed_for_ml/",
      "author": "SimpleUser207",
      "created_utc": "2026-03-01 17:45:22",
      "score": 43,
      "num_comments": 27,
      "upvote_ratio": 0.86,
      "text": "I want to learn ML and AI but not someone who uses any Agents like cursor or GitHub copilot instead I want to understand the math behind it. I searched through every website, discussions and videos but I got only a reply with Linear Algebra, Calculus and Probability with Statistics. Consider me as a newbie and someone who is afraid of math from High school but I will put effort at my best to learn with correct guidance.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1ri3o73/math_needed_for_ml/",
      "domain": "self.learnmachinelearning",
      "is_self": true,
      "comments": [
        {
          "id": "o8380o5",
          "author": "entitie",
          "text": "You should ideally take a full course or more in each of these areas. This is what I'd consider a \"good AI engineer\" to know.  Source: worked at a FAANG as a manager of ML engineers. A PhD in ML will likely have taken all of these plus 4-6 specialization courses in ML, statistics, information retrieval, etc.\n\n1. Calculus, ideally up to calculus 3 (multivariate calculus), where you learn about gradients. You should be able to take compute the gradient of a moderately complex loss function: know the chain rule, know polynomial derivative calculation, know about what it means to take the derivative with respect to x in a function f(x, y).\n2. Linear algebra, specifically knowing matrix multiplication and what it means very well. You should know about the concept of matrix calculus and at least that there are references to compute the gradient of a vector when it is in a matrix term.\n3. Probability and statistics, including especially basic regression, and the key distributions like a Gaussian distribution.   Should know expectation, random variables, means, variance, etc., logarithms, exponential functions, etc. very well. Should know, roughly, how to write a multivariate Gaussian distribution given a vector x, fixed mean, and fixed variance. Know about splines. Know about stochastic gradient descent.\n4. There's an area of study focused on good statistical practice that I'll just generically call \"machine learning\", which includes learning about things like training sets, test sets, validation, etc.  That could fall under a statistics umbrella.\n5. Nice to have but not necessary: information theory (Shannon entropy, etc.)",
          "score": 50,
          "created_utc": "2026-03-01 17:57:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o83hmdy",
              "author": "Chance-Rule-6080",
              "text": "OP, the reason why calc, linalg, prob/stats are seen everywhere when you look up the math needed for ML/AI is because these are the foundations. What @entitie posted here is actually very accurate. If you’re afraid of math but willing to put effort in, start off with the foundations and just go step by step and dive in rather than trying to see the entire forest all at once. No one can really guide you on what domain you’ll be interested in (NLP, IoT, DL/NN, etc) but the core still remains the core. Once you dive in you’ll see what you personally gravitate towards and you’ll get more clarity on your path as you go down it. It sounds confusing and I get it because “you don’t know what you don’t know” but I promise you’ll learn more and figure it out that way. For example I can tell you “oh geometric topology” but you would still need the basics and then decide if you even need that for your specific focus. Don’t overwhelm yourself trying to learn everything everyone says all at once but strengthen your foundations. You’ll do great, good luck.",
              "score": 8,
              "created_utc": "2026-03-01 18:41:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o842rgl",
                  "author": "Special_Future_6330",
                  "text": "Linear algebra and stats sure, but there's so many libraries that you don't really have to understand calculus to actually implement many ml algorithms or networks. Knowing those things will optimize your programs, or know when to choose one thing over the other. If you do learn calculus I think simple derivatives and integrals would work",
                  "score": 2,
                  "created_utc": "2026-03-01 20:26:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o839vmc",
              "author": "khankhal",
              "text": "Can you suggest some books for self study ?",
              "score": 5,
              "created_utc": "2026-03-01 18:06:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o83fezh",
                  "author": "[deleted]",
                  "text": "[deleted]",
                  "score": 0,
                  "created_utc": "2026-03-01 18:31:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o83p3kg",
              "author": "SimpleUser207",
              "text": "This covers most of my query. Do you have any set of sources about each topic whether it can be a book or video or application to gain all the insights with the understanding?",
              "score": 1,
              "created_utc": "2026-03-01 19:17:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o843r3g",
                  "author": "entitie",
                  "text": "What is your goal? If your goal is to get a job in this area, you should be taking full college courses.  I would recommend looking up course the syllabus for each of these courses at a top university and seeing what textbooks they're using, or signing up for a course at your college (local or not). Except for ML, these fields aren't changing that rapidly, so you can use a 10-year-old textbook a couple of editions older than current and get them used for $10-$25.",
                  "score": 2,
                  "created_utc": "2026-03-01 20:31:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o837jyf",
          "author": "Guilty_Question_6914",
          "text": "look at khan acadamy : [https://www.khanacademy.org/](https://www.khanacademy.org/) i practice statistics there",
          "score": 7,
          "created_utc": "2026-03-01 17:55:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o838cbc",
              "author": "SimpleUser207",
              "text": "I have started this also by solving the algebra topic and solving equations per day and each topic is covering vast amounts of questions and topics so I stopped whether this is enough by moving to the next topic or should I stay back and learn?",
              "score": 2,
              "created_utc": "2026-03-01 17:59:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o83fack",
                  "author": "Guilty_Question_6914",
                  "text": "if you want maybe or you could try that pixelbank site or something else",
                  "score": 3,
                  "created_utc": "2026-03-01 18:31:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o83cyi6",
          "author": "Winners-magic",
          "text": "I built https://pixelbank.dev exclusively for this. Try it out. Happy to work with you on this. I struggled when I was in your shoes too",
          "score": 3,
          "created_utc": "2026-03-01 18:20:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o83duqg",
              "author": "Guilty_Question_6914",
              "text": "can i ask how strong the security is on the site? i wanna use my google account but i do not know if it is a good idea?",
              "score": 3,
              "created_utc": "2026-03-01 18:24:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o83e3t8",
                  "author": "Winners-magic",
                  "text": "Google handles the authentication layer. I have no control over it. \nI completely get your concern though. You can read up on how third party authentication works with Google. \nThe payments portal is also on Stripe. Nothing is handled on the website except the pricing.",
                  "score": 2,
                  "created_utc": "2026-03-01 18:25:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o83hbaq",
              "author": "SimpleUser207",
              "text": "Looks promising I will check it out.",
              "score": 3,
              "created_utc": "2026-03-01 18:40:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o844qso",
          "author": "Unable-Panda-4273",
          "text": "[https://www.tensortonic.com/ml-math](https://www.tensortonic.com/ml-math) You can refer to these blogs. They are really good for newbies. It covers all the topics you mentioned.",
          "score": 2,
          "created_utc": "2026-03-01 20:36:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o85ixmg",
              "author": "TowerOutrageous5939",
              "text": "I like the design",
              "score": 2,
              "created_utc": "2026-03-02 01:15:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o84ou28",
          "author": "TheMuttOfMainStreet",
          "text": "> I searched through every website, discussions and videos but I got only a reply with Linear Algebra, Calculus and Probability with Statistics.\n\nThis is all that Neural Networks are idk what you were expecting\n",
          "score": 2,
          "created_utc": "2026-03-01 22:21:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o85ib2p",
          "author": "TowerOutrageous5939",
          "text": "Honestly linear algebra 101 and calc 1 can get you very far. Most of the math is not difficult. If you are getting back into it after years you might need a general algebra refresher.",
          "score": 2,
          "created_utc": "2026-03-02 01:11:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o85uxr8",
          "author": "Dapper-Thought-8867",
          "text": "Welch labs YouTube ",
          "score": 1,
          "created_utc": "2026-03-02 02:29:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o872ucn",
          "author": "nnt-3001",
          "text": "You can try this specialization of Coursera:  \n[https://www.coursera.org/specializations/mathematics-for-machine-learning-and-data-science](https://www.coursera.org/specializations/mathematics-for-machine-learning-and-data-science)",
          "score": 1,
          "created_utc": "2026-03-02 08:06:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o874by3",
              "author": "SimpleUser207",
              "text": "Sure it does cover the mentioned areas. Thank you!",
              "score": 2,
              "created_utc": "2026-03-02 08:20:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rf6p5w",
      "title": "too late for AI Research?",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/r/learnmachinelearning/comments/1rf6p5w/too_late_for_ai_research/",
      "author": "Sushrut_H",
      "created_utc": "2026-02-26 10:28:36",
      "score": 42,
      "num_comments": 19,
      "upvote_ratio": 0.98,
      "text": "I did my Bachelors in  Chemical Engineering and graduated in 2023. I have a good math background, and have been working in software for over 2.5 years now.  \nI did a few exploratory projects on deep learning (CNNs, LSTMs, Transformers etc.) back in college. Are there any research opportunities that might help me switch over, since I haven't been in academia for a while?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rf6p5w/too_late_for_ai_research/",
      "domain": "self.learnmachinelearning",
      "is_self": true,
      "comments": [
        {
          "id": "o7hrvx1",
          "author": "Big-Werewolf9759",
          "text": "I am an ML researcher, but it is difficult to answer this question just from what you have given. What do you mean by too late? Also, the question is very broad.  \nWhat type of ML research? Do you mean research that uses ML /AI. Or pushing the boundaries of AI/ML itself. Then which area of ai/ml? Robotics? Imaging? LLM? etc... For your background one of those is a lot easier than the other. I think both are possible though, but without more context about what it is you want there is little way for me to give advice.",
          "score": 16,
          "created_utc": "2026-02-26 10:46:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ht1oc",
              "author": "Sushrut_H",
              "text": "Okay, I'm thinking LLM research. My major is ChemE, and it has been 2.5 years since college. I didn't really publish any papers during my bachelors too. But I have a good math background and am used to reading research papers. It's just been that I've been a bit disconnected since a few years and have a shit ton to catch up to.  \nMy exact question is how can I switch over to AI research roles, since most of them demand PhDs,  and what kind of knowledge and skills are sought after?",
              "score": 5,
              "created_utc": "2026-02-26 10:56:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7htr0y",
                  "author": "Big-Werewolf9759",
                  "text": "If you want to do LLM research I think anything short of a PhD probably won’t cut it. There are people who do Research Engineering and some who do Research without a PhD but it is mostly because they pioneered a technique / did exactly the aligned undergrad and masters and worked in the right places. For you I think getting into AI research without a PhD will be difficult. If you had to do it without PhD then the way to do it though would be to get a job as a Research Engineer and then try and pivot to Research. LLM roles are very competitive though and even those with PhDs from top institutions in the correct areas will find it hard to land them.",
                  "score": 12,
                  "created_utc": "2026-02-26 11:03:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ih0e6",
          "author": "Cold-Bandicoot-6391",
          "text": "I know ppl who did chemE undergrad and then PhD in computational biology doing AI for like drug design",
          "score": 8,
          "created_utc": "2026-02-26 13:44:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ineva",
          "author": "ghostinthefleshx86",
          "text": "If you have to ask , yeah. Opportunities abound everywhere . Have more conviction in your vision.",
          "score": 5,
          "created_utc": "2026-02-26 14:18:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7o78u6",
              "author": "Wroisu",
              "text": "real ",
              "score": 2,
              "created_utc": "2026-02-27 09:05:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7j9dc8",
              "author": "David_Slaughter",
              "text": "They are abound everywhere. Can you point to one?",
              "score": 1,
              "created_utc": "2026-02-26 16:05:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7lc9la",
                  "author": "ghostinthefleshx86",
                  "text": "Redirect your RAS and start seeing the diamonds in the mud.",
                  "score": 2,
                  "created_utc": "2026-02-26 21:55:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7jbkxd",
          "author": "evo_pak",
          "text": "If you are interested in doing a Master’s and/or PhD, AI for chemical engineering might be something you’re interested in. There are groups that do machine learning for chemical process engineering along with various other topics at the AI-chemistry intersection such as materials/drug design. AI research is a lot broader and interesting than just LLMs.",
          "score": 3,
          "created_utc": "2026-02-26 16:15:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lekuw",
          "author": "bestsniperNAxoxo",
          "text": "The hardest part is getting over the hump of thinking you don’t have the credentials for it. If you don’t go the PhD route it will be harder, yeah.\n\nBut really when you think about it its whether u can find the right problems to solve at the end of the day, everything else is just a proxy.",
          "score": 3,
          "created_utc": "2026-02-26 22:06:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7j2v9i",
          "author": "DaLaPi",
          "text": "Engineering is the application of theoretical concepts (CNNs, LSTMs, Transformers etc.) to concrete problems (blueberry sorting). So they are many opportunities, you just need to find a professor that has many ties with the industry. The only issue is that you could be working on something that a big company, like Honeywell, is also working on. Like your thesis is the use of CNN for visual inspection of steel ingots, another company is also working on the same thing, you will still get a diploma, but you could have some difficulties finding a job after that.  ",
          "score": 2,
          "created_utc": "2026-02-26 15:35:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jsadv",
          "author": "midaslibrary",
          "text": "It is never too late. It appears you already have the skeleton of knowledge, that is the hardest part. Start reading papers and generating novel research directions. If you are like me, your first few ideas will work really well but will have already been done. Eventually you’ll create something truly novel. That will help you land an internship. If it doesn’t, keep whacking away, ensure your projects are killer quality. Once you’ve landed the internship your utility (from the amount/rareness of skills to hours logged to insights generated and tested) will determine your staying power. I want to negotiate from a stronger position and contribute massively to the field, so I’m focusing on home run style experiments and potentially a foundational startup",
          "score": 2,
          "created_utc": "2026-02-26 17:32:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7is8mx",
          "author": "nuclear_man34",
          "text": "Ug was tier 1 college?",
          "score": 1,
          "created_utc": "2026-02-26 14:43:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7isqqw",
              "author": "Sushrut_H",
              "text": "yes, tier 1 (IITB)",
              "score": 1,
              "created_utc": "2026-02-26 14:46:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7iwxjn",
                  "author": "nuclear_man34",
                  "text": "Me too man! Other tier 1 iit, ChemE, grad in 24, looking for tech now lol",
                  "score": 1,
                  "created_utc": "2026-02-26 15:07:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7oxfum",
          "author": "oddslane_",
          "text": "Not too late at all. You already have a strong foundation with math plus real software experience, which is honestly a big advantage in research-heavy ML teams. If you are serious about switching, I would focus on depth over breadth. Pick a subarea and go beyond implementing standard models. Reproduce a recent paper, document the gaps, try small extensions. That signals research thinking more than another CNN project.\n\nYou could also look at research engineer roles or industry labs where strong engineering plus ML fundamentals are valued. Some people transition that way and then move closer to pure research later. The bigger question is what kind of research you are aiming for. Theory, applied ML, domain specific like scientific computing? Your chemical engineering background could actually be a differentiator if you lean into it instead of trying to look like every other applicant.",
          "score": 1,
          "created_utc": "2026-02-27 12:46:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgab4y",
      "title": "Learners of Machine Learning. Good validation score but then discovering that there is a data leakage. How to tackle?",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/r/learnmachinelearning/comments/1rgab4y/learners_of_machine_learning_good_validation/",
      "author": "BuntyDholak",
      "created_utc": "2026-02-27 15:50:40",
      "score": 29,
      "num_comments": 6,
      "upvote_ratio": 0.88,
      "text": "I am a student currently learning ML.\n\nWhile working with data for training ML models, I've experienced that the cross validation score is good, but always have that suspicion that something is wrong.. maybe there is data leakage data leakage. Later discovering that there is data leakage in my dataset. \n\nEven though I've learned about data leakages, but can't detect every time I am cleaning/pre-processing my data. \n\nSo, are there any suggestions for it. How do you tackle it, are there any tools or habits or checklist that help you detect leakage earlier?\n\nAnd I would also like to get your experiences of data leakage too.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rgab4y/learners_of_machine_learning_good_validation/",
      "domain": "self.learnmachinelearning",
      "is_self": true,
      "comments": [
        {
          "id": "o7pym1h",
          "author": "ToSAhri",
          "text": "What do you mean by data leakage here? Are you training on the validation set somehow?",
          "score": 13,
          "created_utc": "2026-02-27 16:04:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qp5i6",
              "author": "BuntyDholak",
              "text": "Not exactly training on validation set.  \nIt's more like duplicate rows in a train set, validation set and test set. but that is pretty easy to counter.\n\nlike this duplication, some information from future accidently leaking into validation and test.\n\nfor example: while predicting load default probability, while giving a loan. You won't use the column which tells how much payment is missed as you don't know that at the time of providing the loan.\n\nOR\n\nif there is a medical appointment dataset. The patient id (let's say P1) will appear many times if patient visits many times. Now, if you are predicting diagnosis, and one of the rows in P1 goes into train and another in test, then it is leakage. As model has learned the diagnosis about P1 in train. ",
              "score": 4,
              "created_utc": "2026-02-27 18:10:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7regqj",
                  "author": "ToSAhri",
                  "text": "The first one about adding data you shouldn't have you just get better at by more explicitly defining your data pipeline before moving to training.\n\nThe second one you could check in the code by parsing through the train and test datasets.\n\nI think there's no other good response than \"be careful\" and double check to solving this tbh.",
                  "score": 8,
                  "created_utc": "2026-02-27 20:12:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7q24mt",
          "author": "wex52",
          "text": "What kind of data? If it’s time series data, you don’t want to use standard k-fold cross validation or you get data leaks. A better alternative is to use forward chaining (aka rolling-origin, walk forward, etc.).",
          "score": 7,
          "created_utc": "2026-02-27 16:21:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qubl5",
              "author": "BuntyDholak",
              "text": "In my case it wasn't purely time series data. It was mostly datasets where there is a time component or repeated rows/entities. later realising that the splitting strategy is not suiting the training. And yeah your point makes sense.\n\nThat's why I was curious to know the workflow/habits to diagnose or catch leakages early while working on datasets.",
              "score": 2,
              "created_utc": "2026-02-27 18:34:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7s63d0",
          "author": "not_jimmy_HA",
          "text": "Here are some general guidelines:\n- clean any post target predictors from your data. Anything that happens after your target occurs is potentially poisoned. \n- split data by the highest abstraction that represents a unique entity. For patient outcomes, split data by patients. For an object detector on an image dataset, if those images come from a video, split by videos. If you are detecting within a household (such as multiple videos per household) split your data by households\n- filling missing values on training information only. \n- if your model will be rolled out to new regions (or new categories, etc), holding out a few regions may show how well your model holds up to IID assumptions.",
          "score": 2,
          "created_utc": "2026-02-27 22:33:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdfc8x",
      "title": "Tired of working overtime, want to do my own AI projects full-time",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/r/learnmachinelearning/comments/1rdfc8x/tired_of_working_overtime_want_to_do_my_own_ai/",
      "author": "Obvious-Director8415",
      "created_utc": "2026-02-24 12:48:27",
      "score": 27,
      "num_comments": 21,
      "upvote_ratio": 0.89,
      "text": "First day back to work, I’ve been nonstop from morning till 9 PM.\nThe job is so exhausting. I really want to quit and work on my own AI projects full-time.\n \nBut I can’t. I have to treat it as a side project.\nI wish I could go full-time, but there’s no income yet.\n \nFeeling stuck between reality and my passion.\nAnyone else in the same boat?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rdfc8x/tired_of_working_overtime_want_to_do_my_own_ai/",
      "domain": "self.learnmachinelearning",
      "is_self": true,
      "comments": [
        {
          "id": "o74mymi",
          "author": "pipjoh",
          "text": "I just left my job to build out AI pipelines for small/medium sized businesses. \n\nThere's real demand out there if you're willing to accept not working on \"cool\" stuff.",
          "score": 9,
          "created_utc": "2026-02-24 12:58:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o74rqyj",
              "author": "raysanatomies",
              "text": "How would you recommend to start?",
              "score": 0,
              "created_utc": "2026-02-24 13:26:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o74w6fu",
                  "author": "pipjoh",
                  "text": "Tons of outreach/cold calling/attending local business events. \n\nThere's no right way, you just put yourself out there",
                  "score": 7,
                  "created_utc": "2026-02-24 13:51:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o74mo6m",
          "author": "vineet__tanwar",
          "text": "Yes man. Right beside you. Commenting from my boring job. But it pays the bills.",
          "score": 6,
          "created_utc": "2026-02-24 12:56:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7686xy",
          "author": "Neither_Nebula_5423",
          "text": "Try academy or research centers",
          "score": 2,
          "created_utc": "2026-02-24 17:38:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74oejk",
          "author": "dabomm",
          "text": "I just quit too, not sure yet what to do. Maybe some freelance to help business to be more efficient by automating processes",
          "score": 1,
          "created_utc": "2026-02-24 13:07:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74y28q",
          "author": "SessionShoddy6236",
          "text": "Yes. I did the same just a few months back. Took a risk on my income.  It is scary. But it was important for me to try. ",
          "score": 1,
          "created_utc": "2026-02-24 14:01:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o778ms6",
          "author": "lostincalabasas",
          "text": "And the sad part is that most of the work is operational, stuck fixing data pipelines, non stop calls, corporate bullshit, time to go independant",
          "score": 1,
          "created_utc": "2026-02-24 20:23:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77qak2",
          "author": "DigThatData",
          "text": "Imagine how much better the world would be if we adopted UBI and everyone who wanted to could just sink all of their energy into their \"side projects\" that actually provide public value.",
          "score": 1,
          "created_utc": "2026-02-24 21:44:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78xy57",
              "author": "Obvious-Director8415",
              "text": "Yes, I agree with you. It would be great if there was such a society.",
              "score": 1,
              "created_utc": "2026-02-25 01:34:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o77qnfh",
          "author": "Klutzy_Bed577",
          "text": "Damn even LLMs are tired of working overtime ",
          "score": 1,
          "created_utc": "2026-02-24 21:46:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78y6ag",
              "author": "Obvious-Director8415",
              "text": "AI has started to complain about human orders, haha.",
              "score": 1,
              "created_utc": "2026-02-25 01:36:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o79hwxu",
                  "author": "Klutzy_Bed577",
                  "text": "Im saying you are an LLM",
                  "score": 1,
                  "created_utc": "2026-02-25 03:28:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7a0t2u",
          "author": "AfterOwlsStudio",
          "text": "Same. Working long hours in a country where OT is considered normal, studying part time for my CS degree while trying to build my apps.",
          "score": 1,
          "created_utc": "2026-02-25 05:34:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7apeww",
              "author": "Obvious-Director8415",
              "text": "awesome",
              "score": 1,
              "created_utc": "2026-02-25 09:10:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ho5cb",
          "author": "oddslane_",
          "text": "I’ve definitely felt that tension between wanting to go all in and needing the stability of a paycheck. One thing that helped me was treating my AI work less like a passion escape and more like a structured program with milestones and timelines. It made the side project feel intentional instead of something squeezed in after burnout hours. If you can carve out a repeatable rhythm, even a few focused hours a week, it starts compounding. Over time you build not just projects, but evidence of discipline and direction. What kind of AI work are you hoping to focus on long term? ",
          "score": 1,
          "created_utc": "2026-02-26 10:12:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hv4r7",
              "author": "Obvious-Director8415",
              "text": "Thanks for your reply! I’ve learned so much from what you shared and really appreciate it. Let’s keep in touch and exchange ideas more often.\n \nI focus on app development, building AI-powered tools and applications. Right now I’m working on WeChat mini-programs because they’re easier to launch. I also plan to build iOS apps, regular apps, and my own web platforms moving forward.",
              "score": 1,
              "created_utc": "2026-02-26 11:15:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ak110",
          "author": "Healthy_Library1357",
          "text": "You’re not stuck, you’re undercapitalized. Big difference. Most AI side projects die not from lack of talent but from lack of distribution and income runway. If you quit now with $0 revenue, stress replaces passion fast. The smarter move is to treat your job as runway funding. Give yourself a hard metric: don’t quit until you hit consistent $2k–$3k MRR or 3–6 months of living expenses saved. Most solo AI builders need 6–12 months before meaningful income. The people who make it usually ship weekly, talk to users weekly, and validate demand before building “cool” stuff. Passion scales when it’s attached to revenue. Until then, your job is just your investor.",
          "score": 0,
          "created_utc": "2026-02-25 08:19:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7apy7m",
              "author": "Obvious-Director8415",
              "text": "It's true, what you said is very reasonable. Either find someone to invest and it can last for about a year, or save your own money and make a profit.",
              "score": 1,
              "created_utc": "2026-02-25 09:15:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rf0f6t",
      "title": "how to enter the machine learning and AI industry?",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/r/learnmachinelearning/comments/1rf0f6t/how_to_enter_the_machine_learning_and_ai_industry/",
      "author": "ButterscotchAny6953",
      "created_utc": "2026-02-26 04:23:21",
      "score": 23,
      "num_comments": 19,
      "upvote_ratio": 0.9,
      "text": "Hello everyone, I recently realized that I want to get into the machine learning and AI industry and integrate it into applications, my home and my life. Do you have any tips on where to start, how to learn how to train AI, and what is needed for this? and do we even need such specialists in the labor market?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rf0f6t/how_to_enter_the_machine_learning_and_ai_industry/",
      "domain": "self.learnmachinelearning",
      "is_self": true,
      "comments": [
        {
          "id": "o7gstkp",
          "author": "Xpro_Futurism",
          "text": "Getting into AI/ML can feel overwhelming at first, but it’s honestly more structured than it looks. Start with the foundations basic Python, some linear algebra, probability, and statistics. \nYou don’t need to be a math genius, but you should understand concepts like gradients, distributions, and how models minimize error. After that, move into core machine learning: learn how linear regression, logistic regression, decision trees, and neural networks actually work. Don’t just run the code, try to understand what the model is optimizing and why.\n\nFor learning resources, I’d recommend something practical and beginner-friendly like the book Hands-On Machine Learning with Scikit-Learn, Keras, and TensorFlow, and for intuitive explanations, the StatQuest YouTube channel is gold. Structured training programs also have solid ML courses if you prefer guided learning. Many companies provide such training with practical learning and internship. Once you’re comfortable, start building small projects, recommendation systems, simple chatbots, prediction models and deploy them. Real projects matter much more than just certificates.\n\nAs for the job market: yes, AI/ML specialists are definitely needed, but the market is competitive. Companies are looking for people who can apply AI to solve real problems, not just train models in notebooks. If you can combine ML skills with another domain (web apps, cybersecurity, healthcare, automation, etc.), you become much more valuable. It’s a long-term game, but if you’re genuinely interested and consistent, there’s absolutely space in the industry for you.",
          "score": 21,
          "created_utc": "2026-02-26 05:30:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gxmfo",
              "author": "ButterscotchAny6953",
              "text": "Thanks for the advice, this topic is very interesting to me.",
              "score": 1,
              "created_utc": "2026-02-26 06:08:09",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7h70fx",
              "author": "JasperTesla",
              "text": "Thanks for these resources. This is really helpful. Would you happen to know if these days there's more demand for the ML trainers or the people who integrate them into real-world applications? I'm the latter, but want to dip my toes into the former as well.",
              "score": 1,
              "created_utc": "2026-02-26 07:28:32",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7ordmw",
              "author": "Born_Way2504",
              "text": "What should anyone learn first? TensorFlow or PyTorch",
              "score": 1,
              "created_utc": "2026-02-27 12:03:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7gvg3t",
          "author": "Holiday_Lie_9435",
          "text": "I'm also trying to learn AI/ML right now, and though I want to specialize on those fields eventually, it's pretty hard to just break into the industry at entry/junior level. So maybe you can first look into roles like data science for valuable skills that can be transferable to AI/ML field. Still, in the meantime, I recommend looking into courses (mostly online) on platforms like Coursera on topics like Python, linear algebra, ML fundamentals (Andrew Ng's course is highly recommended). You can then apply your skills to simple AI/ML projects like an image classifier or recommendation system, I can provide some ideas if you'd like! If you want a more specific deep dive into roles like AI/ML engineers though, I can also link you to some roadmaps I've shared previously so you understand which tools/frameworks you need to master.",
          "score": 6,
          "created_utc": "2026-02-26 05:50:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gvxi0",
              "author": "ButterscotchAny6953",
              "text": "I would be very grateful if you would share the links.",
              "score": 1,
              "created_utc": "2026-02-26 05:54:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7jgn0o",
                  "author": "Holiday_Lie_9435",
                  "text": "Sure thing! Here's a (linked) [roadmap for AI engineering roles](https://www.interviewquery.com/p/ai-engineer-skills-roadmap), and another one for [ML engineers](https://www.interviewquery.com/p/become-ml-engineer). I hope the step-by-step breakdown can help you figure out how to start building your technical and educational foundations.",
                  "score": 1,
                  "created_utc": "2026-02-26 16:38:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7i4tk4",
              "author": "Natural_Bet5168",
              "text": "I'd day that DS is much harder to break into than AI.  Most AIE's I work with are SWE's and have little to no functional DS/ML knowledge (and it shows).  Most large companies I know won't hire a DS without a solid Master's degree in stats/math/DS as entry level.  The title MLE is a bit all over the place, but tends to sit in the DS camp with DS level expectations with a relevant MS.",
              "score": 1,
              "created_utc": "2026-02-26 12:29:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7gxkgv",
          "author": "deep_m6",
          "text": "You need to study basic concepts before you start learning about artificial intelligence. The study requires you to learn Python programming skills together with fundamental mathematical knowledge base which includes linear algebra and probability and basic statistical methods. From there, learn core ML concepts (supervised vs unsupervised learning, overfitting, evaluation metrics) and implement models yourself using libraries like TensorFlow or PyTorch.  \n  \nThe focus should be on developing actual software projects instead of simply completing educational courses. You will learn practical skills through the process of training a model and deploying a basic API which you will then combine with your application. This method enables you to transform theoretical knowledge into actual working proficiency.  \n  \nThe job market currently displays demand for workers who businesses need to resolve their actual company issues. Businesses require employees who possess model training skills and practical experience and deployment abilities and domain expertise.",
          "score": 5,
          "created_utc": "2026-02-26 06:07:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h883g",
          "author": "DuckSaxaphone",
          "text": "What's your background?\n\nI'm asking because this field is absolutely overwhelmed with people who want to be part of it. As a result, requirements for hiring are high.\n\nIf you're going to be a self-taught AI guy, you should have a STEM PhD or a STEM degree and a bunch of data/software engineering experience. If you don't, you'll be competing against people who do and they'll get picked every time.\n\nThere's also a practical angle, the basic skillset is coding (python), statistics, and machine learning. It's a lot to learn if you're not already ticking some boxes.",
          "score": 3,
          "created_utc": "2026-02-26 07:39:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h91pd",
          "author": "AccordingWeight6019",
          "text": "A good starting point is thinking less about AI as one big thing and more about building a few core skills step by step. Most people begin with Python, basic statistics, and machine learning fundamentals (regression, classification, evaluation metrics), then learn how models are actually used in real applications.\n\nWhat helped me understand the path is realizing that training models is only part of the job. A lot of industry work is cleaning data, testing ideas, and integrating models into real systems. So small practical projects (predicting something from a dataset, building a simple recommender, deploying a tiny app) tend to teach more than just watching courses.\n\nAnd yes, specialists are still needed, but companies usually look for people who can apply ML to solve problems, not just people who know theory. starting small, building projects, and gradually making things more real world seems to work better than trying to learn everything at once.\n\n",
          "score": 2,
          "created_utc": "2026-02-26 07:47:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gvrhp",
          "author": "Winners-magic",
          "text": "Checkout the learning tracks at https://pixelbank.dev. I’ve tried to break it down into small topics/chapters",
          "score": 1,
          "created_utc": "2026-02-26 05:53:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h4z3l",
          "author": "patternpeeker",
          "text": "get clear on what kind of ml work u want. most roles are about data, pipelines, and production issues, not just training models. start with python, stats, and small end to end projects so u understand the full workflow.",
          "score": 1,
          "created_utc": "2026-02-26 07:10:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hkxad",
          "author": "Simplilearn",
          "text": "If you are just starting out in AI and ML, here's a roadmap for you:   \n\n\n1. **Strengthen fundamentals first:** You need solid Python, basic linear algebra, probability, and statistics. Focus on understanding how models learn, not just using libraries. \n2. **Learn core machine learning properly**: Start with supervised learning: linear regression, logistic regression, decision trees, random forests. Use scikit-learn and work on real datasets.\n3. **Move into deep learning and GenAI:** Learn neural networks, CNNs, and basics of NLP. Then understand how large language models work, embeddings, and fine-tuning concepts. You do not need to build foundation models from scratch, but you should understand how to use and evaluate them.\n4. **Build real projects:** Train a model, evaluate it, deploy it as a small API. Add a simple frontend. Projects show capability more than certificates.\n5. **Understand deployment and MLOps basics:** Containerization, simple CI/CD workflows, and cloud awareness make you industry-ready.  \n\nIf you prefer structured learning with guided projects and exposure to machine learning, generative AI, and applied workflows, Simplilearn’s Professional Certificate Program in Generative AI, Machine Learning, and Intelligent Automation covers fundamentals along with real-world implementation components.\n\n  \nAre you planning to transition full-time into AI/ML or explore it alongside your current role?",
          "score": 1,
          "created_utc": "2026-02-26 09:41:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jsc8l",
          "author": "jmei35",
          "text": "from what people in the field keep saying, demand is strong .. but employers want practical skills like applying ML models, working with LLMs, automation workflows, and integrating AI into real products .. not just theory. that’s why structured, hands on platforms like Coursiv are getting attention, since they focus on building usable AI skills step by step so you can move from learning concepts to actually deploying them in real world scenarios.",
          "score": 1,
          "created_utc": "2026-02-26 17:32:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lu3pg",
          "author": "shivvorz",
          "text": "how old are you? If you are a kid (<20), start with the basics as the other suggested (math, pytorch etc). \n\nDo textbooks like d2l, Bishop's Deep Learning textbook etc. \n\n\"Build pytorch from scratch\" by doing minitorch, build an entire model training pipeline by doing Stanford CS336.\n\nIf you have prior knowledge, its even better because you start halfway there.\n\nIf you are deep in another industry already, just do AIx<whatever your industry is> for fast RoI. Treat it like a blackbox and apply it to your field of work. Your domain knowledge would be appreciated by the community\n\nIf you are neither. Maybe just try to make your life easier (automating repetitive tasks etc) and wait for UBI to happen I guess...",
          "score": 1,
          "created_utc": "2026-02-26 23:27:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p34zd",
          "author": "oddslane_",
          "text": "There is definitely demand, but it is not really for “AI specialists” in the abstract. Most roles are either software engineers who can apply ML responsibly, or data scientists who can translate business problems into models and back again. If you are starting out, I would focus on three layers. First, fundamentals like linear algebra, probability, and how models actually generalize. Second, solid programming and software practices. Third, understanding how ML systems are deployed and monitored in the real world. A lot of beginners skip that last part.\n\nTraining models is the easy part compared to defining the right problem and evaluating results properly. If you can show you understand data quality, bias, and evaluation metrics, you will stand out more than someone who just ran a few tutorials. What background are you coming from right now? That will shape the most efficient path forward.",
          "score": 1,
          "created_utc": "2026-02-27 13:22:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rce2gr",
      "title": "Looking for ML Study Partner",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/r/learnmachinelearning/comments/1rce2gr/looking_for_ml_study_partner/",
      "author": "Ecstatic_Welder7494",
      "created_utc": "2026-02-23 10:36:25",
      "score": 23,
      "num_comments": 44,
      "upvote_ratio": 1.0,
      "text": "Hey! I’m a 3rd year undergrad Physics major looking for a Machine Learning Study buddy. I’m starting from scratch and want someone equally committed so we can grow together. We’ll share resources, build projects, stay consistent, and push each other through the tough parts. If you’re serious, let’s team up.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rce2gr/looking_for_ml_study_partner/",
      "domain": "self.learnmachinelearning",
      "is_self": true,
      "comments": [
        {
          "id": "o6xsjnc",
          "author": "hedyehhh",
          "text": "Hi. I'm starting my ml journey too. Let's connect.",
          "score": 2,
          "created_utc": "2026-02-23 12:03:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xss2n",
          "author": "Ok-Performance-249",
          "text": "Hey, am i too late to join the party?",
          "score": 1,
          "created_utc": "2026-02-23 12:05:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yqkmx",
              "author": "Ecstatic_Welder7494",
              "text": "You can join us, DM me!",
              "score": 2,
              "created_utc": "2026-02-23 15:25:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6y2wpf",
          "author": "demonassoff",
          "text": "Let's connect!",
          "score": 1,
          "created_utc": "2026-02-23 13:16:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6y4m5m",
          "author": "ya_agrawal",
          "text": "I'm interested. Right now I'm studying the foundational mathematics of machine learning or data science which is statistics which helps to find the outliers and correlation between two columns. I haven't done analysis yet because I can't a find proper dataset and I'm stuck whenever I see a huge dataset?",
          "score": 1,
          "created_utc": "2026-02-23 13:26:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ycn6y",
          "author": "Competitive_Bar_9728",
          "text": "Let's connect for right now kinda in beginning - intermediate stage ",
          "score": 1,
          "created_utc": "2026-02-23 14:13:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yfaxi",
          "author": "Money-Desperated",
          "text": "I want to join this group too please.",
          "score": 1,
          "created_utc": "2026-02-23 14:27:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yoeft",
              "author": "Ecstatic_Welder7494",
              "text": " DM me;",
              "score": 1,
              "created_utc": "2026-02-23 15:15:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ylf2z",
          "author": "Strong_Adeptness_446",
          "text": "I wanna connect & commit",
          "score": 1,
          "created_utc": "2026-02-23 14:59:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yofes",
              "author": "Ecstatic_Welder7494",
              "text": "DM me;",
              "score": 1,
              "created_utc": "2026-02-23 15:15:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ysdzu",
          "author": "RudreshThakur",
          "text": "I want to learn together",
          "score": 1,
          "created_utc": "2026-02-23 15:34:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ysrjz",
          "author": "ashuto0sh",
          "text": "Me too please",
          "score": 1,
          "created_utc": "2026-02-23 15:36:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yswy9",
          "author": "NNNiharri-229",
          "text": "I also want to join",
          "score": 1,
          "created_utc": "2026-02-23 15:37:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6za6r5",
          "author": "WesternPotential2808",
          "text": "I’m in!",
          "score": 1,
          "created_utc": "2026-02-23 16:57:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zo1s1",
          "author": "Chance_Clean",
          "text": "Let's connect",
          "score": 1,
          "created_utc": "2026-02-23 18:02:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7009pa",
          "author": "masgroup",
          "text": "sure let's go",
          "score": 1,
          "created_utc": "2026-02-23 18:57:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70hugj",
          "author": "timetable_tracker",
          "text": "Hii I have started learning also like to connect",
          "score": 1,
          "created_utc": "2026-02-23 20:20:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qbpu1",
              "author": "CombinationCold6255",
              "text": "hi dm me i also want to connect",
              "score": 1,
              "created_utc": "2026-02-27 17:06:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o72lnic",
          "author": "kingsofkings91",
          "text": "Hey can we join.",
          "score": 1,
          "created_utc": "2026-02-24 03:08:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72oyyr",
          "author": "reddy_anoop",
          "text": "I’m ready gang",
          "score": 1,
          "created_utc": "2026-02-24 03:28:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7328s3",
          "author": "sunnakh",
          "text": "Let's connect bro",
          "score": 1,
          "created_utc": "2026-02-24 04:58:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73yg44",
          "author": "Lord_pedro001",
          "text": "So am I. I'd like to connect and team up.",
          "score": 1,
          "created_utc": "2026-02-24 09:41:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74gkjy",
          "author": "maad-titan",
          "text": "Is it too late to join?",
          "score": 1,
          "created_utc": "2026-02-24 12:15:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74igzl",
          "author": "_aayushvardhan",
          "text": "Can I join too?",
          "score": 1,
          "created_utc": "2026-02-24 12:28:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74l3ze",
          "author": "devarstar1",
          "text": "Let's connect",
          "score": 1,
          "created_utc": "2026-02-24 12:46:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74l61l",
          "author": "Devarstar",
          "text": "Let's connect",
          "score": 1,
          "created_utc": "2026-02-24 12:47:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74smkw",
          "author": "Embarrassed-Pin-8121",
          "text": "Im in",
          "score": 1,
          "created_utc": "2026-02-24 13:31:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o756ehk",
          "author": "Ok-Ticket3023",
          "text": "Hey, Can I join too , been in Data Engineering field for a while but new to ML",
          "score": 1,
          "created_utc": "2026-02-24 14:44:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76b1on",
          "author": "vigneshwarananandan",
          "text": "Even I’m starting, I’m happy to connect. Please let me know",
          "score": 1,
          "created_utc": "2026-02-24 17:51:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ino09",
          "author": "Puzzleheaded_Ant2220",
          "text": "Would love to!",
          "score": 1,
          "created_utc": "2026-02-26 14:19:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7oq2d4",
          "author": "0Ohene",
          "text": "Shoot me a dm!",
          "score": 1,
          "created_utc": "2026-02-27 11:53:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qaw49",
          "author": "CombinationCold6255",
          "text": "lets connect",
          "score": 1,
          "created_utc": "2026-02-27 17:02:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xkgtg",
          "author": "Present_Foot_6637",
          "text": "lets connect",
          "score": 1,
          "created_utc": "2026-02-23 10:54:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xm8jb",
              "author": "Ecstatic_Welder7494",
              "text": "Check your inbox;",
              "score": 1,
              "created_utc": "2026-02-23 11:10:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xir8i",
          "author": "voicesconsented",
          "text": "I would like to do that too..",
          "score": 0,
          "created_utc": "2026-02-23 10:38:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xixcn",
              "author": "Ecstatic_Welder7494",
              "text": "Check your inbox 📥",
              "score": 1,
              "created_utc": "2026-02-23 10:40:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xlghw",
          "author": "Physical-Ad-5949",
          "text": "Me too but my schedule is sooooo loaded.",
          "score": 0,
          "created_utc": "2026-02-23 11:03:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xlqw1",
              "author": "Ecstatic_Welder7494",
              "text": "🥲",
              "score": 2,
              "created_utc": "2026-02-23 11:06:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xmcw1",
          "author": "ChemicalPie5717",
          "text": "let's connect\n\n",
          "score": 0,
          "created_utc": "2026-02-23 11:11:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xomx9",
          "author": "Key-Apple-3955",
          "text": "Let’s goo",
          "score": 0,
          "created_utc": "2026-02-23 11:31:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xpda4",
          "author": "Terrible_Shape_7271",
          "text": "I'm in",
          "score": 0,
          "created_utc": "2026-02-23 11:38:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xpurh",
          "author": "Powerful_Raccoon_05",
          "text": "Let's connect",
          "score": 0,
          "created_utc": "2026-02-23 11:42:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xrvwe",
          "author": "Tokarak",
          "text": "I’m a second year maths+stats student also looking to learn ML (also from scratch). I would be interested in a heavily theoretical approach. Do you already have a shortlist of textbooks you would like to follow?",
          "score": 0,
          "created_utc": "2026-02-23 11:58:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgmdec",
      "title": "Transition from SWE to AI ML Infra , MLops, AI engineer roles",
      "subreddit": "learnmachinelearning",
      "url": "https://www.reddit.com/r/learnmachinelearning/comments/1rgmdec/transition_from_swe_to_ai_ml_infra_mlops_ai/",
      "author": "DqDPLC",
      "created_utc": "2026-02-27 23:22:09",
      "score": 22,
      "num_comments": 8,
      "upvote_ratio": 0.94,
      "text": "I want to do what title suggests, I did some courses and built projects and deployed them on AWS. \n\nCurrently I m also contributing to hugging face and PyTorch , past 3 months 3-4 feature request PRs.\n\nI am not sure how should I word my resume, I am worried about what projects to keep as they all are learning based so anyone could have it. \n\nAnd more about I don’t have  project that I can use for project based interview discussion cause they all are learning, can I use my open source work here.\n\nAlso do you think I am doing good to get interviews, some seed stage companies do reach out with interview form looking at my GitHub but go away as soon as I mention no production level experience. ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/learnmachinelearning/comments/1rgmdec/transition_from_swe_to_ai_ml_infra_mlops_ai/",
      "domain": "self.learnmachinelearning",
      "is_self": true,
      "comments": [
        {
          "id": "o7uce9d",
          "author": "latent_signalcraft",
          "text": "contributing to Hugging Face and PyTorch is stronger than you are giving yourself credit for. that is real collaboration in complex codebases and you can absolutely use it in interviews if you focus on the problems you solved and the tradeoffs you considered. for infra or MLOps roles i do frame your projects around deployment, reproducibility, monitoring, and CI/CD rather than model novelty. even a simple model is fine if you can explain how you’d productionize it.",
          "score": 2,
          "created_utc": "2026-02-28 07:11:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7uflxo",
              "author": "DqDPLC",
              "text": "Thank you so much this gives me some hope.",
              "score": 1,
              "created_utc": "2026-02-28 07:40:52",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o84ni4f",
              "author": "ProfessorPhi",
              "text": "100%. I would look pretty favourably on this over a standard swe resume. 3-4 PRS a month is not nothing, especially in open source.",
              "score": 1,
              "created_utc": "2026-03-01 22:14:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7wkl3v",
          "author": "Gaussianperson",
          "text": "You are overthinking the generic projects. Having PRs accepted in PyTorch and Hugging Face is actually huge. Most people just follow a tutorial, but you are working on the internals of the frameworks people use every day. For your resume, put those open source contributions right at the top in their own section. In interviews, talking about a specific feature request you handled is perfect because it shows you can navigate a complex codebase and deal with real system constraints.\n\n\n\nInstead of listing a basic AWS deployment, focus on the engineering metrics. Talk about how you handled latency or how you managed the scaling of the infrastructure. Hiring managers for MLOps and ML Infra roles care way more about your ability to build stable systems than they do about your knowledge of specific model architectures. Frame your SWE background as a strength in writing clean, production ready code which is often missing in AI.\n\n\n\nI actually write about these engineering challenges in my newsletter at machinelearningatscale.substack.com. I cover things like scaling LLMs and building MLOps systems from the ground up, so it might give you some good talking points for your upcoming interviews.",
          "score": 2,
          "created_utc": "2026-02-28 16:47:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7yhz5v",
              "author": "DqDPLC",
              "text": "Thank you so much for this pointers. I will checkout your blog post",
              "score": 1,
              "created_utc": "2026-02-28 22:49:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7uo3xz",
          "author": "Vrn08",
          "text": "Can you just brief on how did you started contributing on these big projects ?",
          "score": 1,
          "created_utc": "2026-02-28 08:58:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7w2v2a",
              "author": "DqDPLC",
              "text": "I did lot of work because I come from non ML background. So had to learn PyTorch, transformers what they are. Read repo, that’s where my swe skills helped and then I was able to tackle issues that I can take and move forward. I am planning to write a blog or LinkedIn post about it.",
              "score": 1,
              "created_utc": "2026-02-28 15:18:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7w3572",
                  "author": "Vrn08",
                  "text": "Amazing.. Thanks for replying.",
                  "score": 2,
                  "created_utc": "2026-02-28 15:20:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}