{
  "metadata": {
    "last_updated": "2026-02-11 17:29:58",
    "time_filter": "week",
    "subreddit": "Marketresearch",
    "total_items": 5,
    "total_comments": 19,
    "file_size_bytes": 27173
  },
  "items": [
    {
      "id": "1qxp92c",
      "title": "Pricing and packaging study",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qxp92c/pricing_and_packaging_study/",
      "author": "Dangerous-Race-5591",
      "created_utc": "2026-02-06 18:13:43",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Pricing and packaging strategy\n\nHey everyone,\n\nI am hoping to base a packaging and pricing strategy on some research that doesn’t involve conjoint (there is no budget and the same would be too small for analysis), what would you recommend?\n\nEdit: with a heavy preference for a somewhat qualitative, maybe informal type of research (again due to sample and type of industry) where the sample size would be small. \n\nThe goal is to as result repackage the service offering for a client.\n\nFeel free to share any dos and donts too.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qxp92c/pricing_and_packaging_study/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o3ybs7g",
          "author": "rucolamara",
          "text": "If you are under significant budget constraints, I would recommend going first with a pricing comparison approach, finding out at what price point are the competitors selling similar solutions. In parallel proceed with cost-based approach, topping up fixed + variable costs and margin to understand what is a profitable price range. Once you combine the 2 info, you get at least an understanding of where you’ll land with your price. This won’t tell you how much consumers are willing to pay, but I would highly discourage against any qualitative approach when it is about pricing.",
          "score": 2,
          "created_utc": "2026-02-06 19:17:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zw28y",
              "author": "Dangerous-Race-5591",
              "text": "Makes sense. I might just follow your advice.",
              "score": 2,
              "created_utc": "2026-02-07 00:09:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e5pku",
          "author": "SG-Man1990",
          "text": "If no conjoint/maxdiff, your best bet would be Van Westerndorp or Gabor Granger which you can make do without the modelling or design elements.",
          "score": 2,
          "created_utc": "2026-02-09 06:35:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4eled2",
          "author": "VyprConsumerResearch",
          "text": "With small samples and no conjoint, I’d lean on qualitative price sensitivity instead of precision. Structured interviews that walk people through trade-offs (“what would make this feel expensive vs fair?”, “what would you drop if the price went up?”), simple package comparisons and card-sorting exercises work surprisingly well. The key do/don’t: anchor discussions in real decisions and budgets, not hypotheticals. Don’t ask people what they *would* pay, ask when they’d hesitate, upgrade, or walk away.",
          "score": 2,
          "created_utc": "2026-02-09 09:04:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4esegs",
              "author": "Dangerous-Race-5591",
              "text": "I like this. I might just give it a shot. Thank you.",
              "score": 2,
              "created_utc": "2026-02-09 10:14:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4jv4uo",
          "author": "coffeeebrain",
          "text": "just talk to 10-15 customers. show them different package options, watch their reactions. they'll tell you what makes sense and what doesn't.\n\nask what they'd actually pay and what they pay competitors now. hypothetical answers are useless.\n\nif you have existing customers that's easiest to recruit. otherwise platforms like cleverx or userinterviews work but need budget for incentives.\n\nsales team also knows which features close deals if you have one.",
          "score": 1,
          "created_utc": "2026-02-10 03:10:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qw5dmw",
      "title": "Consumer insights to competitive intelligence",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qw5dmw/consumer_insights_to_competitive_intelligence/",
      "author": "heyyyou90",
      "created_utc": "2026-02-04 23:56:59",
      "score": 3,
      "num_comments": 9,
      "upvote_ratio": 0.72,
      "text": "Has anyone successfully pivoted from my background and consumer insights to a true competitive intelligence role? I’m mid career in consumer insights, seeking a new role, and I’m really interested in competitive intelligence roles, but for my experience is obviously fairly different. Has anyone successfully made this transition? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qw5dmw/consumer_insights_to_competitive_intelligence/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o3nc6d5",
          "author": "coffeeebrain",
          "text": "haven't done this pivot but the skills transfer pretty well. you're just researching companies instead of consumers.\n\nyou already know how to find patterns, synthesize messy info, and present insights. that's like 80% of ci work.\n\ngap is probably business strategy knowledge and market analysis frameworks. maybe brush up on that stuff before applying.\n\ni'd pitch it as \"i turn complex research into actionable recommendations\" without overemphasizing the consumer part.",
          "score": 2,
          "created_utc": "2026-02-05 02:34:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wccqn",
              "author": "Odd_Dog6616",
              "text": "This is a little bit of speculation because I haven’t worked in a role specifically titled as Competitive Analysis, but I would also suggest that a lot of true value in that function is piecing together competitors’ consumer strategies and outcomes. It’s that way, having a background in consumer insights could make you effective because you’re able to quickly understand and dissect what is going right/wrong for competitors relative to the company you work for. Not to force fit the two roles - competitive intelligence is going to have plenty of strategy and financial analysis as well, but at the end of the day, consumer companies that win are those who serve and speak to their specific audience better than competitors. In that way, there’s a strong analogue between the two roles and you should be set up to be effective. You’re basically doing consumer insights work on competitors’ audiences",
              "score": 1,
              "created_utc": "2026-02-06 13:28:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o425fwf",
          "author": "silver70seven",
          "text": "I did it for a hot minute. The biggest differences between more traditional research and competitive intelligence is mainly related to where the data comes from and what industries youre focused on.  Competitive Intelligence providers tend to use many different data sources across the omnichannel environments including cookie data, alternative data sets like transactional data from credit cards, store performance metrics based on site visits and projected conversions, offline data, etc. traditional MRs tend to stick to the basics like surveys, expert IDIs, and traditional qual. So, there are some different skill sets and such to take into consideration, especially on the tech side as AI is now helping to simplify as well as complicate the infrastructures of said providers.",
          "score": 2,
          "created_utc": "2026-02-07 10:27:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mkx34",
          "author": "The_Scrabbler",
          "text": "You’re going to have to be more descriptive because these are pretty vague labels and roles, and they generally overlap depending on organisation",
          "score": 4,
          "created_utc": "2026-02-05 00:00:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3n9jzb",
          "author": "Super_Fishing9564",
          "text": "There is no money in ’analysis’ and AI is about to gobble those jobs up.\n\nLearn how to sell data/analytics if you want to make money.",
          "score": 0,
          "created_utc": "2026-02-05 02:19:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mm1y3",
          "author": "AdOriginal3767",
          "text": "I fo see alot of comp intelligence roles. I argue its very different from a traditional market research role",
          "score": 0,
          "created_utc": "2026-02-05 00:06:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3movo4",
              "author": "heyyyou90",
              "text": "In what ways would you say it’s different? Note, I tend to agree that that it seems pretty different. What types of backgrounds do you see in competitive intelligence?",
              "score": 1,
              "created_utc": "2026-02-05 00:22:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3n0f24",
                  "author": "AdOriginal3767",
                  "text": "They are more strategy types and even BI. That said, no one is stopping you. Its just a different skill set less focused on running primary research and more on secondary to build learnings. ",
                  "score": 3,
                  "created_utc": "2026-02-05 01:27:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qz3sx4",
      "title": "Can this research be done without individual debrief/consent under GDPR? (Does it count as anonymous?)",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qz3sx4/can_this_research_be_done_without_individual/",
      "author": "Vymir_IT",
      "created_utc": "2026-02-08 08:38:55",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 0.81,
      "text": "Hi there. I'm in Germany and I need to conduct a research for an upcoming startup - target audience in population. \n\nI'll be approaching people on the streets with a casual conversation and a call for simple action in order to collect the data that will look like this in the end:\n\nOverall count: 234\nResponded: 47\nResponses:\nResponder 1 (\nGroup 1 traits - Negative\nGroup 2 traits - Positive\nConversational commitment: strong\nActionable commitment: denied\n),\nResponder 2 (\nGroup 1 traits...\nGroup 2 traits...\n)...\n\nWhat \"group traits\" are and which questions define that in the collected data will not be elaborated, it's something I keep in my head. \n\nThe core requirement for this investigation is that responders don't know it's a research, they should be thinking we are having a regular conversation, to not prime them - otherwise data will become biased and useless.\n\nCan I do this legally without debriefing and collecting consent, does this count as anonymous data?\n\nThanks.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qz3sx4/can_this_research_be_done_without_individual/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o491w1h",
          "author": "These-Virus8028",
          "text": "Yeah honestly: no, not really legal in Germany/EU.\nIf you’re systematically recording people’s answers + tagging them into “traits/groups” for a startup study, that’s data collection under GDPR, even if you don’t take names. It’s usually not truly anonymous, and doing it without telling them it’s research breaks the transparency/consent rules.\nBest move: give a super light disclosure like “quick question for a project, totally anonymous, 1 min” and don’t store individual profiles.\n(Not legal advice, but your current “they must not know” setup is very risky.)",
          "score": 2,
          "created_utc": "2026-02-08 13:47:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o495361",
          "author": "alexisappling",
          "text": "I doubt you’d get this past ESOMAR or MRS guidance. Post-hoc debrief is expected and MRS specifically says that covert research of any nature is only allowed in very tight circumstances. You’d also probably not get this past GDPR either. I am usually the one pushing to bend rules where I can, but this makes me uneasy.",
          "score": 2,
          "created_utc": "2026-02-08 14:06:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1cjsu",
      "title": "Typing tool for recruitment screener",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1r1cjsu/typing_tool_for_recruitment_screener/",
      "author": "mrdllnt",
      "created_utc": "2026-02-10 20:42:29",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 0.72,
      "text": "Hi everyone! I am after some recos, thoughts and ideas on how to create a typing tool for qual recruitment.\n\n**Historical Context**: I used to work with one of the big MR agencies. In some of our qual recruitment, we used typing tools to get specific segments our clients were targeting. From memory, a few of the typing tools came from client (based on their quant studies); others were created by our resident data science guy who build them out of Excel—- using attitudinal and behavioral attributes from our clients’ segments (or from whatever data they have provided him). Basically we ask a series of questions, respondents select the best statements that describe them, there is a corresponding score for each and depending on the total score, it would generate what segment the respondents are. So it can automatically calculate and generate the respondent’s segment. I used that information to convene groups based on which segment they fit in. Most of the time I have used typing tools, they were pretty accurate on recruiting specific segments. But it’s been a while since I last used them. So I have no idea if it’s still a thing or not.\n\n**Current context**: I am working for a company that has identified their different audience segments but dont know how to recruit them. I thought of typing tool and have mentioned my experience with it. They have not heard of such things, but open to learning more.\n\n**Questions:**\n\n• Is anyone still using typing tool for specific segment recruitment? \n\n• Or anyone has any thoughts on it — is it worth pushing for or just forget about it?\n\n• Any recos on how I can do it? IF I decide to be stubborn and push the idea. We dont have a data science guy in my current company.\n\n• Any alternatives to typing tool for recruitment?\n\nHelp, please. 🥺 \n\nTHANK YOU. 🫶",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1r1cjsu/typing_tool_for_recruitment_screener/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o4omdy8",
          "author": "coffeeebrain",
          "text": "yeah typing tools are still a thing. most survey platforms like qualtrics or alchemer can do the scoring logic pretty easily.\n\nthe tricky part is making sure your questions actually differentiate segments. seen too many companies build fancy screeners that just recruit professional survey takers instead of real segment reps.\n\nif you need to recruit based on those segments, respondent works well for b2c, cleverx is better for b2b segments. both let you add custom screeners. but honestly if your segments are super attitudinal you might just need the full custom screener approach with scoring.",
          "score": 7,
          "created_utc": "2026-02-10 20:58:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4onm31",
          "author": "Yemfy",
          "text": "I am mainly in Ops and Recruitment in qual so take this with a grain of salt.\n\nA handful of researchers still use typing tools but in my experience they are the larger more complex businesses, but as the participant facing apparatus, I do try and note to the researcher that typing tools in generally are fickle, more meaning that the survey taker given the same question 5 minutes apart may fall into a different segment types depending on recent experience. \n\nI think as a tool it is not terrible but from my experience with them, it’s a cumbersome part and usually causes issues downstream ie. a segment type is very rare due to a segment profile missing the mark. \n\nNo real recommendations on how, as I personally have not done a lot of building of typing tools but the simpler the better so instead of matrix/table of answer values and weights, rather it’s a combination of some of the other questions in your survey/research. But this isn’t much of a typing tool as you describe! \n\nAlternative, this is more of my professional experience but a “self diagnosed” typing tool has often been used as an alternative when speed and complexity is weighing our choices. But to boil it down rather than a bunch of questions, simply describe the audience profiles and have the user identify what profile most aligns with their self view. It’s not perfect but felt like I had experience here worth sharing!",
          "score": 6,
          "created_utc": "2026-02-10 21:04:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4pbab7",
              "author": "_1nfiniteZest",
              "text": "Great advice here. You don’t just invent a “typing tool” out of nothing, but you can create a detailed screener. Typing tools are most useful for segmentations, which are themselves a multistage, sometimes multi-quarter, and very often expensive form of research that is only really appropriate for very advanced research teams with complex needs",
              "score": 3,
              "created_utc": "2026-02-10 22:59:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4oyswy",
          "author": "analyticated",
          "text": "You create the typing tool by undertaking a discriminant analysis on the data used to create the initial segmentation, typically using a reduced question set (identified using the f statistic) as the final inputs.\n\nThis then gives you an algorithm for each segment which you can use to determine the most likely segment a respondent would belong to.",
          "score": 2,
          "created_utc": "2026-02-10 21:56:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pmtgl",
          "author": "Saffa1986",
          "text": "How did they identify their target segments? What differentiates them?\n\n\nTyping tool still very much in use, but probably more applicable to quant and new age qual panels than traditional qual. \n\n\nOften I (the quanty) may determine segments and provide a typing tool, but the recruiters won’t know how / don’t want to use the algorithm on the fly to assign segments when recruiting, so often get asked to provide an a-priori self select. \n\n\nSo let’s say you have a battery of 10-12 statements that defines a segment and you have an algorithm of typing tool, and this produces your four segments. We might have a one sentence pen portrait of that segment and we might say “which one of these best reflects you?”. It’s far from best practice, but better than nothing.",
          "score": 1,
          "created_utc": "2026-02-11 00:03:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1zx3h",
      "title": "MaaS market growth forecasts: how reliable are long-term projections like this?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1r1zx3h/maas_market_growth_forecasts_how_reliable_are/",
      "author": "Fragrant-System-7755",
      "created_utc": "2026-02-11 15:11:15",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "I came across a North America Mobility-as-a-Service forecast projecting growth from \\~$80B to \\~$764B by 2033 (32%+ CAGR).\n\nWhat caught my attention is that the growth narrative is strongly tied to the integration of ride-hailing and delivery ecosystems through multimodal platform shifts, including solutions like Onde app and comparable platforms supporting services such as Uber or Instacart, rather than passenger transport alone.\n\nFor those working in market research:\n\nHow do you typically validate long-term CAGR projections in emerging sectors?\n\nI’m genuinely curious how professionals here approach forecasts of this scale.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1r1zx3h/maas_market_growth_forecasts_how_reliable_are/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o4t7s88",
          "author": "Winter_Spell_5304",
          "text": "So it is majorly decided based on YoY growth of sales of companies in the market to get an base rough growth figure. Atleast last 3-5yrs sales are taken into consideration. On top of that, Another factors includes current ambitions of market, Investment done in market, partnerships/acquisitions, R&D efforts and launch if new product/services and any Government decisions/laws/support or any challenges are taken into consideration to decide the final CAGR",
          "score": 1,
          "created_utc": "2026-02-11 15:16:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4t8uys",
              "author": "Fragrant-System-7755",
              "text": "That makes sense, especially the point about anchoring projections in recent 3–5 year performance rather than relying purely on forward assumptions.\n\nIn the MaaS case, I guess the tricky part is that the structure of the market itself is shifting (ride + delivery convergence, platform expansion, etc.), which makes sales a bit harder to interpret.",
              "score": 1,
              "created_utc": "2026-02-11 15:22:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4tagct",
                  "author": "Winter_Spell_5304",
                  "text": "Yeah, but thats what market research is all about. Regarding the market shift, All recent developments, govnt policies and other major factors are taken into consideration. Primary interviews and surveys are conducted with the industry stakeholders from both demand and supply sides. This gives an idea whether if the market shift is optimistic or pessimistic. This further helps to decide the CAGR",
                  "score": 2,
                  "created_utc": "2026-02-11 15:29:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4t84i5",
          "author": "Larik_Kroft",
          "text": "I think that usually look at whether the projected CAGR is driven by real behavior change or just modeling assumptions.\n\nWith MaaS, I’d check whether users are actually adopting these combined services and whether revenue per user is increasing, not just overall volume.\n\nAnd aren’t the forecasts for EVs too optimistic?",
          "score": 1,
          "created_utc": "2026-02-11 15:18:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tne3l",
          "author": "DataBeeGood",
          "text": "I don’t know that sector specifically, but I know that forecasts from well-known companies in the tech field that the analysts who are creating forecasts are putting a lot of very subjective assumptions into CAGR estimates. Excuse me, I mean “subject matter expert” assumptions 😜",
          "score": 1,
          "created_utc": "2026-02-11 16:30:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4tps3n",
              "author": "Fragrant-System-7755",
              "text": "Maybe. But it’s not just assumptions, most forecasts also pull from real data across different sources: past sales, investments, partnerships, product launches, regulations, etc.\n\nThat said, you’re right - in fast-moving sectors like this, projections rarely end up being 100% accurate. ",
              "score": 1,
              "created_utc": "2026-02-11 16:41:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4to1sr",
          "author": "VyprConsumerResearch",
          "text": "When looking at projections that aggressive, it usually helps to break the forecast into its component assumptions rather than taking the CAGR at face value. Analysts often start by validating each driver, market adoption rates, regulatory tailwinds, competitor moves, and adjacent ecosystem growth, using a mix of primary interviews, historical analogues, and triangulation across multiple secondary sources. Scenario analysis can also help, showing how sensitive the CAGR is to changes in a few key assumptions. Emerging sectors are tricky because small shifts in consumer behaviour or policy can swing the numbers dramatically, so layering multiple lenses, quantitative, qualitative, and ecosystem-level, is critical.",
          "score": 1,
          "created_utc": "2026-02-11 16:33:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}