{
  "metadata": {
    "last_updated": "2026-02-01 16:49:57",
    "time_filter": "week",
    "subreddit": "Marketresearch",
    "total_items": 7,
    "total_comments": 30,
    "file_size_bytes": 41225
  },
  "items": [
    {
      "id": "1qoqm5q",
      "title": "Curious if anyone has transitioned away from a client facing role",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qoqm5q/curious_if_anyone_has_transitioned_away_from_a/",
      "author": "knopucs",
      "created_utc": "2026-01-27 21:06:37",
      "score": 18,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "I currently work at an independent quantitative research firm, and my day-to-day includes all the general tasks:\n\n \\-questionnaire development\n\n\\-creating the slide decks\n\n\\-organizing the data\n\n\\-monitoring field\n\netc.\n\nHowever, I **sincerely** hate this job mostly due to the general corporate bs and workload. My company has so many wasteful meetings that drive me insane, I'm just totally overworked, and I think part of that is due to the fact that it's client-facing and my company is **needing to make deadlines shorter in order to stay competitive**. \n\nI'm curious to know if anyone out there has switched to an in-house role where it's way less deadline/client heavy, but still a lot of the same tasks. I imagine there's not really much out there, but I'm just wondering if my skill set could apply elsewhere, and I'm curious if anyone here has experienced that.\n\n  \nIf this is the wrong place to be posting this, I do apologize, and if anyone has any other subreddit recommendations for me to look into, I would really appreciate that.\n\n  \nTLDR: Looking to apply all the skill sets of this job to something way less deadline-focused, and wondering if anyone was able to successfully pivot their career to such a job.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qoqm5q/curious_if_anyone_has_transitioned_away_from_a/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o23yeeg",
          "author": "Bulky_Coach8820",
          "text": "I imagine the corporate bs and politics to be greater on the client side. I feel that in agencies, much of the animosity is focused outwards",
          "score": 12,
          "created_utc": "2026-01-27 23:01:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o252zxg",
              "author": "ReginaldsMember",
              "text": "Exactly this",
              "score": 3,
              "created_utc": "2026-01-28 02:31:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o23ele4",
          "author": "The_Scrabbler",
          "text": "I moved from agency-side to client-side a couple years ago and absolutely love it. \n\nPay bump, albeit with slower progression. More focused work and longer deadlines (typically).\n\nIf you join a matured function in a relatively junior role then you’ll get to focus on the work itself. Otherwise, you’re still networking around the business, drumming up project sponsorship and driving the project management.",
          "score": 8,
          "created_utc": "2026-01-27 21:29:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23qc7f",
          "author": "YouGottaBeKitten",
          "text": "I’ve done both and generally prefer in-house because you better understand business challenges and can be more agile. But I also kind of miss the deep specialty and ability to bounce ideas off of smart people at an agency. Depending on how long the in-house research function has been at a company, the roles can sometimes be more about internal client management and “selling” your dept and offerings. I think you could take 2 routes: 1.) start more junior at a company that has a large existing team; 2.) basically be a one-person research team at companies which are looking to grow research as a capability. \n\nI got let go from my client-side role last year when I was pregnant and just started applying/interviewing again this month. Even with experience client side it’s tougher out there than it was 5 years ago when I got my last role. So just be prepared to hone in on what you can bring beyond project management (ex- strategic thought, socializing data skills etc.)",
          "score": 6,
          "created_utc": "2026-01-27 22:22:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26juqn",
          "author": "Capital_Shower_7698",
          "text": "I’ve done both - went agency, client, and back to agency.\nI thought client side would be what you’ve described, but it has its own frustrations: even more meeting heavy, much less of your job is doing research it’s more about managing stakeholders and getting anything agreed / signed off through layers and layers of management and red tape, it’s constantly changing priorities, it’s scoping out the research needs which is slow and requires even more meetings. The companies are typically much larger which means being a tiny fish in a huge pond that only speaks in corporate gibberish so you never know what’s going on and everyone else just pretends they do. \nYou’re also much more at risk of redundancy - agencies can typically be more flexible and adapt but clients will roll out redundancies often, and marketing/research are often the first to go. \n\nWho the company is makes a difference of course. But when I switched back to agency it was a huge relief, despite each day being busier.",
          "score": 5,
          "created_utc": "2026-01-28 08:37:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2b9on9",
              "author": "knopucs",
              "text": "As I mentioned in another comment reply, my main priority is truly work-life balance. I suppose I could suffer through meetings, but I just can't be working 50-hour work weeks. So do you think general work-life balance is better on the client side or the agency side?",
              "score": 1,
              "created_utc": "2026-01-28 23:30:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2t8kdj",
                  "author": "Capital_Shower_7698",
                  "text": "Client side is slower, for sure. But I have found better managing workload and resource agency-side to minimise long hours is a more effective thing to focus on than the career change. For context I have 2 young kids and do most drop offs and pickups, and still wouldn’t go back to client side.\nI also feel much more secure vs a constant fear that one of the constant restructures client side is going to end up with me out of a job.",
                  "score": 1,
                  "created_utc": "2026-01-31 16:28:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o23dxp2",
          "author": "AbroadAmbitious9372",
          "text": "I’m working at a Qual firm. I do have many client facing opportunities but mostly the work is to conduct IDIs which can be exhausting. Thinking about transitioning to client side as well",
          "score": 5,
          "created_utc": "2026-01-27 21:26:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23wtqj",
          "author": "swmccoy",
          "text": "I’ve done both - currently in house - and I also prefer client side to agency side. But what your work and work load looks like will be dependent on industry, budget, and size of the department. I did way more complex and interesting work agency side since I have a very limited budget in house. It was also fun working across so many industries. But it’s much easier in-house and you have more of an impact on strategy.",
          "score": 3,
          "created_utc": "2026-01-27 22:54:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2b9h6i",
              "author": "knopucs",
              "text": "I'm honestly not passionate about this industry at all, but it's what I ended up going into and what I have the most experience in, so it might make sense for me to stay in it. With that being said, if my priority is finding the best work-life balance, the least amount of stress, and less deadlines, do you think being on the client side versus agency is the way to go?",
              "score": 1,
              "created_utc": "2026-01-28 23:29:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2gmz2l",
          "author": "CompiledIO",
          "text": "On a side note, if you need to built questionnaires/surveys, you can make use of revuloop which makes building surveys and analyzing them real easy.",
          "score": 1,
          "created_utc": "2026-01-29 19:00:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kw8ud",
          "author": "LastLivingMember",
          "text": "I transitioned from being a client-facing quail/quant researcher to more of a panel management and member engagement role. Early on I realized that while I was comfortable speaking to clients, I didn’t like the specific types of stress that came from research delivery. I would agonize over improving presentations and trying to balance the brain space needed for analyzing data / providing insights against the need to respond to client communication urgently and attending meetings. \n\nOver time I took on a role where I still supported plenty of client interactions (mostly in sales calls and kick-off) but it was in a consultative way that made it clear I’d be working in the background to support the project. \n\nRight now I have zero interaction with clients. Having a research background helps me immensely and gives me a very different perspective than other members of my team.",
          "score": 1,
          "created_utc": "2026-01-30 10:33:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqn87j",
      "title": "Anyone else U/E'd thinking what to exit to?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qqn87j/anyone_else_ued_thinking_what_to_exit_to/",
      "author": "Single-Regular8766",
      "created_utc": "2026-01-29 22:28:11",
      "score": 5,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Long term viewer, 1st time posting here.\n\nLooking for anonymous feedback if anyone else feels like our industry's in for a long-term contraction, especially given Dynata's layoffs just recently. I'm thinking of exiting completely but I'm almost 40 and frankly, completely unsure what that would be. I've gotten discouraged how I'm probably not alone in seeing popping over to \\[X\\] type of marketing (or product management) isn't that easy. Been searching for 6 months now. \n\nAny insight into what former MRXers have exited to?\n\nMy profile: 9+ years agency-side client service (good name recognition: Kantar/Ipsos/Comscore), qual/quant/digital analytics, FS/B2B/Consumer Durables. Last role was quant inno director.\n\nThanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qqn87j/anyone_else_ued_thinking_what_to_exit_to/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o2k18k6",
          "author": "SG-Man1990",
          "text": "Question: 9+ year agency side, but you are 40 now, may I check what did you do before 30 years old? Another industry?\n\nYou mentioned Dynata's layoffs: however that is mainly on the online panel supplier side and not research agency side (well of course, they have some offices doing full E2E research work).\n\nWell I would generally say your potential trajectories could be:\n\n1. Research Agency - still Quant (hands on research)\n2. Research Agency - less hands on research, more Commercial (think Chief Client Officer types)\n3. Online panel - migrate into Sales or Project Management\n4. Re-explore the Ipsos arms - Ipsos IS / Strategy3?\n5. Client side - Insights / MR in-house roles, explore some of the clients that you used to deal with\n6. Tech research platforms - think Qualtrics / Savanta / QuestionPro types of companies, or one of those AI-driven research platforms popping out everyday",
          "score": 2,
          "created_utc": "2026-01-30 06:03:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sbom6",
              "author": "AdOriginal3767",
              "text": "What is ipsos arms you mention? Can you provide more details ",
              "score": 1,
              "created_utc": "2026-01-31 13:34:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2wk28l",
                  "author": "SG-Man1990",
                  "text": "I meant the different divisions within Ipsos - like S3 (consulting), IIS (online work), ERM (HR work) etc",
                  "score": 1,
                  "created_utc": "2026-02-01 02:45:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2lg5ce",
          "author": "silver70seven",
          "text": "I’ve got a career exclusive to MR for about 20 years. I have tried to escape but never really could for long. I’ve been unemployed now for 2 years and I don’t think I will recover.",
          "score": 2,
          "created_utc": "2026-01-30 13:01:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m134k",
          "author": "coffeeebrain",
          "text": "yeah the market's definitely shifting. ai is taking over the execution stuff and junior/mid roles are disappearing.\n\nwhat i've seen people exit to are product management (harder than it sounds though), customer success at saas companies, or strategy/insights roles with more stakeholder management and less hands on work.\n\nyour 9 years at those agencies is solid. b2b saas research might be worth looking at if you want to stay research adjacent. recruitment is brutal but there's demand.",
          "score": 1,
          "created_utc": "2026-01-30 14:51:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qou2we",
      "title": "Are big brands moving away from sampling altogether?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qou2we/are_big_brands_moving_away_from_sampling/",
      "author": "0nin_",
      "created_utc": "2026-01-27 23:15:33",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I use what I believe to be the best sample sources for external panel sample and layer on a few of what I believe are the best fraud detection and poor quality behavior, detection tools on top of that, and even still, I can’t help, but wonder if big wigs at large brands have decided that maybe the traditional panel is not as higher priority as other methods of obtaining customer centric data as it used to be perceived to be.\n\nCurious if anybody knows of any trends around this",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qou2we/are_big_brands_moving_away_from_sampling/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o257vas",
          "author": "lsuillini",
          "text": "I have been doing large focus group projects (n=100-150) with in/post-group surveys. That way, we can delete the data for anyone who doesn't pass the sniff test in the group. \n\nThis is for a group in a very large company who has lost faith in panels and has the money to do these large projects.",
          "score": 2,
          "created_utc": "2026-01-28 02:57:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o262p3w",
              "author": "0nin_",
              "text": "Thats a great process",
              "score": 1,
              "created_utc": "2026-01-28 06:12:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o251t48",
          "author": "Hillbilly555",
          "text": "Depends on what questions they are trying to answer. \nIf they need to update brand health or segments, then general online panels are needed.\nIf they want to focus on their current customers, then they may just use their database.",
          "score": 1,
          "created_utc": "2026-01-28 02:25:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a47mn",
          "author": "coffeeebrain",
          "text": "yeah i've noticed this too. traditional panels are struggling because you can't verify who these people actually are.\n\nfor b2b especially you need actual decision makers with verifiable linkedin profiles. platforms like [respondent](https://www.respondent.io/) or [cleverx](https://cleverx.com/) let you see verified profiles before you talk to someone. traditional market research panels just give you whoever clicked through and you're basically hoping they're legit.",
          "score": 1,
          "created_utc": "2026-01-28 20:20:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpli6p",
      "title": "Software to Create Modern Looking Toplines from SPSS Data Files",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qpli6p/software_to_create_modern_looking_toplines_from/",
      "author": "hmrtime",
      "created_utc": "2026-01-28 19:34:43",
      "score": 5,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "Hi - I've been using an old  version of SPSS to generate very simple topline frequency reports (counts and percentages). However, I'm looking to see if there's something a little more modern/fresh out there to improve presentation. I'd like something that can read my .sav file with labels and quickly spit out frequency charts - preferably horizontal bar charts - without much (or any) manual interaction. It would be great to just print to a PDF or export to Word/Excel. For my needs, I have multiple surveys (differing scripts/structures) to report in a day, so I am not looking for something with a lot of manual setup each time. I've briefly looked at AddMaple, SavQuick, DisplayR, Office Reports. All seem to have a TON of capabilities, but not seeing where to get the simple reports I need quickly. Thanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qpli6p/software_to_create_modern_looking_toplines_from/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o2a2ldl",
          "author": "Saffa1986",
          "text": "Q Research Software or DisplayR will be the best. \n\nIn Q, I can create a dozen bar charts, setup and weight, custom colours and fonts in under 5 minutes.",
          "score": 8,
          "created_utc": "2026-01-28 20:13:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2a4i5q",
              "author": "analyticated",
              "text": "Q is the only answer here, it's great!",
              "score": 3,
              "created_utc": "2026-01-28 20:21:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2awnbg",
                  "author": "hmrtime",
                  "text": "Thanks - I will dig back in to my DisplayR trial tomorrow to see what I can do there. If only SPSS could look like the cool kids these days...",
                  "score": 1,
                  "created_utc": "2026-01-28 22:25:37",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2arpj3",
              "author": "imref",
              "text": "we switched from SPSS to DisplayR a few years ago and never looked back.",
              "score": 2,
              "created_utc": "2026-01-28 22:03:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2jcp39",
          "author": "SouthSet7206",
          "text": "Researchscape. And it populates to ppt.",
          "score": 1,
          "created_utc": "2026-01-30 03:22:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a4kfl",
          "author": "coffeeebrain",
          "text": "honestly for quick and dirty toplines i just export to excel and use pivot tables. not pretty but fast.\n\nif you need something that looks better automatically, displayr can do what you're describing but yeah it's overkill for basic frequencies. the learning curve sucks if you just need simple bar charts.\n\nhave you tried just building a template in powerpoint or google slides and copy pasting the spss output? i know it sounds manual but once you have the template it's pretty quick.",
          "score": 0,
          "created_utc": "2026-01-28 20:22:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqyldo",
      "title": "How to ask more questions as an MR intern",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qqyldo/how_to_ask_more_questions_as_an_mr_intern/",
      "author": "Downtown_Bus_6437",
      "created_utc": "2026-01-30 07:11:23",
      "score": 4,
      "num_comments": 6,
      "upvote_ratio": 0.84,
      "text": "Hi everyone - I’m new to the market research industry, I graduated with my bs in cogsci in 2025 and started an internship this week at a boutique MR consultancy. I haven’t been able to land a full time job post grad and I’m hoping to do well enough to get a return offer from this place. For context I’ve done two internships in the past: one in UXR and another one in legal survey research. \n\n**Here’s my current issue** \\- I’m struggling to ask meaningful questions when I’ve been given kind of menial tasks this week? I’ve been mainly checking for bad cases in the large datasets the company receives in my first week here, and I don’t really have an issue with asking Qs for the task at hand but I feel like I’m not asking meaningful questions if that makes sense. \n\nI met with the ceo of the company and he told me he plans to check in with me weekly so I can ask him plenty of questions about MR. But I feel like I’m scrambling to even think of any! Especially given I’m mainly supporting the analysts and PMs in simple work if that makes sense? I just don’t want to come off as not curious but I’m hoping some senior MRs in this community can give me some insight in to what kind of meaningful questions I should be asking for my career development. \n\nTLDR first week as an MR intern at a boutique consultancy but with the simple (but high priority)tasks I’ve been given, I’m struggling to ask meaningful Qs for my career/skill development",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qqyldo/how_to_ask_more_questions_as_an_mr_intern/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o2kcua3",
          "author": "The_Scrabbler",
          "text": "Good instincts - I would suggest doing some of your own learning about market research, its utility and the end to end process. \n\nI recommend looking into the University of Georgia Principles of Market Research course (the company might even sponsor you for it), or at least the UC Davis courses on Coursera. \nYou can also look into reading Market Research in Practice, Strategic Market Research and the McKinsey Way. \n\nThose materials will give you better foundations to ask intelligent questions. \n\nRegarding the CEO- don’t bother with anything project specific unless it’s about the strategic impact of the work. I would ask about what advice they would have liked at your level, what specialisations they see becoming most valuable in the years to come, where they think the industry is heading towards and what resources they use to keep up to date with industry movements.",
          "score": 3,
          "created_utc": "2026-01-30 07:38:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ku9pk",
              "author": "LastLivingMember",
              "text": "I strongly agree with this comment re: what to ask the CEO. If the CEO is making time for you each week, that means they are invested in your future at the company.\n\nSome things you might ask:\n-  How do we position COMPANY to stand apart from the competition and win new business?\n-  How do you decide which areas of the company to invest in (for staffing, engineer time, 3rd party tools)?\n-  What should I be doing to network with peers in the industry and build long-term connections?\n-  What are the big wins you had early in your career that helped set you on the path to creating / managing COMPANY?",
              "score": 3,
              "created_utc": "2026-01-30 10:16:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kco3b",
          "author": "SG-Man1990",
          "text": "I was a MR intern in a big 4 agency more than a decade ago, after graduating from Bachelor's.\n\nI suppose your objective is to showcase that you are a good intern, in return for a full-time conversion.\n\nI would consider asking / sharing the following:\n\n1. If there is a disconnect in insight between the dataset, and what the client believes to be true - what is the method that our agency uses to validate this disconnect? \n2. What are the key behaviors that I need to exhibit as an intern in order to be converted full time? \n3. When there is a new client engagement, is it possible for me to shadow a senior analyst so I can learn about how to ask important discovery questions to aid the research? I am also happy to take the lead in preparation for such a meeting.\n4. What defined an average researcher versus a top researcher?\n5. I am interested in a X course by ESOMAR that I could take to upskill my knowledge and use it in this firm, how can I get a sponsorship from the company?\n6. I noticed that Y colleague tends to do this task in a certain way, why is that so? How about exploring an alternative such as \\_\\_\\_\\_\\_\\_ ?",
          "score": 2,
          "created_utc": "2026-01-30 07:36:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kp1ta",
          "author": "sauldobney",
          "text": "Ask about the sample and the sampling frame - Where did the data come from? Why this sample approach? Why this particularly data source? How does the data you're looking at relate to the rest of the questionnaire? Why were the questions designed in the way they were? What the process for getting to field was - steps and milestones in design and validation? What happens next with the data? What are they looking for that makes it 'good' or useful data for clients? What questions are they trying to solve for their client's businesses? What other approaches did they look at? What benchmark data they have, or use for weighting? How do they ensure the data is 'rep'?\n\nAnything to help understand what the research is aiming for and so why some cases are seen as 'bad' and how you can confirm that data and cases are actually real or about reality.",
          "score": 2,
          "created_utc": "2026-01-30 09:28:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m1cdy",
          "author": "coffeeebrain",
          "text": "you're overthinking this honestly. first week doing data cleaning is normal, everyone starts there.\n\ndon't force questions just to seem curious. that comes across weird. ask questions when you're actually confused or notice patterns in the data that seem off.\n\nmeaningful questions come later when you understand the context. right now just focus on doing the menial work really well and fast. that's what gets you the return offer.\n\nonce you see a few full projects end to end, you'll naturally have better questions about methodology or client management or whatever. it takes time.",
          "score": 2,
          "created_utc": "2026-01-30 14:52:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2oszu5",
              "author": "Downtown_Bus_6437",
              "text": "Ok thank you this is really reassuring and helpful - I’m not really the type to ask questions for the sake of it really, and want to make sure im approaching my coworkers with good Qs here, thank you!",
              "score": 1,
              "created_utc": "2026-01-30 22:29:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qpnucf",
      "title": "How hard it is to learn Qualtrics as a tool?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qpnucf/how_hard_it_is_to_learn_qualtrics_as_a_tool/",
      "author": "What_next_fertility",
      "created_utc": "2026-01-28 21:00:21",
      "score": 4,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "I am interviewing for a company and they need someone with Qualtrics experience. I thought it’s similar to survey monkey and said I do have the experience. Now I am worried about saying so. Is it too hard as a tool to learn? What could be the learning curve?\n\nPS I am trying to get a job since November and I need something as I am draining all my savings now.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qpnucf/how_hard_it_is_to_learn_qualtrics_as_a_tool/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o2c25x3",
          "author": "_1nfiniteZest",
          "text": "Qualtrics is a lot like Excel, where the basics are easy enough to grasp, but some people (like me lol) go super far with customization and advanced features. You should have no problem creating a basic survey, but it is *much* more advanced and *much* more powerful than SurveyMonkey.\n\nIf you feel have to lie, don’t say you “advanced” or “expert” knowledge. Instead, say that you have basic familiarity “but it’s been a few years and some things might have changed…”",
          "score": 9,
          "created_utc": "2026-01-29 02:02:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gzhtv",
              "author": "What_next_fertility",
              "text": "Thanks a ton. Thats my approach too.",
              "score": 1,
              "created_utc": "2026-01-29 19:59:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ajrhc",
          "author": "EyedLuvUTo",
          "text": "Very easy if you understand the basics of how to program a survey. Watch some YouTube tutorials. There’s a lot of support info out there.",
          "score": 9,
          "created_utc": "2026-01-28 21:28:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hd5v2",
              "author": "What_next_fertility",
              "text": "Thank you so much. I am almost using AI for getting some quick fact checks. Hopefully they don’t go too deep on it during the interview",
              "score": 1,
              "created_utc": "2026-01-29 21:05:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2by5zg",
          "author": "SG-Man1990",
          "text": "I have used Qualtrics intermittently for a year when my previous agency decided to trial researchers in scripting their own questionnaires versus using a dedicated scripting team.\n\nAs a researcher, the system is easy to grasp because I already had the research know-how however you may not use all functions that you pay for (think paying for 100 functionalities, but you only use the base 15-20). Learning curve is harder than SurveyMonkey for sure.\n\n  \nI am now the panel-supplier side who deals with clients that uses Qualtrics and just want to link their surveys to the panel. Unfortunately, the knowledge gap on using Qualtrics is really huge - we often have to help them to troubleshoot on how to do a certain task (namely survey redirects, quota setting, public dashboard etc).\n\nWe've had customers who didn't know what they were doing and accidentally deleted all the responses that were collected in the survey.\n\n  \nI guess you are interviewing on the client side?",
          "score": 3,
          "created_utc": "2026-01-29 01:40:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gxn0p",
              "author": "What_next_fertility",
              "text": "I am interviewing on the agency side.",
              "score": 1,
              "created_utc": "2026-01-29 19:50:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2bfe88",
          "author": "ohsnapdevin",
          "text": "If you know foundations stuff and are good at reading documentation you’re good - it’s highly customizable and permissions are a bitch. Depends what role you’ll play (admin, programming, design, all of them lol)\n\nIt’s very different from survey monkey in architecture and execution.",
          "score": 2,
          "created_utc": "2026-01-29 00:00:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2f1s0z",
              "author": "pnutbutterpirate",
              "text": "Permissions are awful! So granular, so not intuitive.",
              "score": 1,
              "created_utc": "2026-01-29 14:41:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2f620w",
                  "author": "ohsnapdevin",
                  "text": "It’s the bane of my existence daily lol",
                  "score": 1,
                  "created_utc": "2026-01-29 15:02:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2adlgz",
          "author": "Saffa1986",
          "text": "Id never used it. Inside of a day, had the hang of programming. Did some pretty advanced stuff with hover over, custom containers for CSS, all thanks to Gemini. \n\n\nYou’ll be grand.",
          "score": 2,
          "created_utc": "2026-01-28 21:01:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c25ti",
          "author": "abdush",
          "text": "It is an easy tool to learn. There are many advanced features- based on the type of company interviewing some of those will be relevant for you. This page has the complete set : https://www.qualtrics.com/support/survey-platform/getting-started/qualtrics-topics-a-z/",
          "score": 1,
          "created_utc": "2026-01-29 02:02:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2d3ofe",
          "author": "supriya_l89",
          "text": "People who have experience with SurveyMonkey will find that Qualtrics provides them with an easy learning experience. The system allows users to create surveys and implement logic and share their work through distribution and generate reports which function as basic tools. Users can master the basic functions of the system but need to invest time to learn about advanced features like embedded data and dashboard controls. The person should explain that he needs time to learn new skills while he begins his first two tutorials because he will succeed in his tasks.",
          "score": 0,
          "created_utc": "2026-01-29 05:55:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr5bt9",
      "title": "Interview Guidance",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qr5bt9/interview_guidance/",
      "author": "MaxGearshift",
      "created_utc": "2026-01-30 13:22:51",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I have been interviewing for different market research roles and I have been struggling explaining research projects in a short time frame (1-3 minutes). \n\nI have mostly worked on end-to-end projects (from drafting research questions, designing surveys to analyzing the data) - and I am unable to express it to an interviewer during an interview.  I feel I haven’t covered enough terminology or may have missed out something. \n\nIn case you guys have any suggestions, please shoot up! Much appreciated ❤️\n\nIf anyone could help me practice a mock-interview, or provide any YouTube video that helps with this, it would work wonders! \n\nLately, it’s been so difficult to get through interviews here in Canada - and I don’t want to miss any opportunity that comes my way 🙏🏼",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qr5bt9/interview_guidance/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o2ndf0x",
          "author": "PolskaPunk04",
          "text": "We are analysts and often get stuck wanting to provide too much detail or minutia. But a big part of any MR job is being able to effectively communicate with non-analyst-minded folks. Start at a high level and if somebody wants details, they will ask or you can invite their questions.\n\nTry to write a quick outline on the high points of your project and then whittle it down repeatedly: Write the overall topic with 4-5 bullets and 2-3 sub-bullets under each one. No more than two sentences a piece. Then, re-write it starting with a brief overall topic with 2-3 bullets and 1 sub-bullet. \n\nIf you need help, Chat GPT can be a helpful start to the process and force you to make decisions.\n\nBest of luck! You got this! 💪",
          "score": 3,
          "created_utc": "2026-01-30 18:28:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2p4rah",
              "author": "MaxGearshift",
              "text": "Ya, this sounds reasonable. I haven’t tried writing down in bullet format though. I’ll give it a shot now.\n\n\nAnd yes, been using GPT for drafting and polishing the answers. Gotta keep practising 💪🏻",
              "score": 1,
              "created_utc": "2026-01-30 23:31:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2qfd48",
          "author": "keepturning1",
          "text": "Terminology like fieldwork, survey questionnaire, statistically significantly different, quantitative/qualitative, chart instead of graph, survey panel, omnibus, data cleaning, five point scale, unipolar/bipolar scale etc. will help if you drop them in.",
          "score": 2,
          "created_utc": "2026-01-31 04:04:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2s8yfm",
              "author": "MaxGearshift",
              "text": "I guess I have to mention some terminologies in the HR round so they know that we aware of the things needed 😆",
              "score": 1,
              "created_utc": "2026-01-31 13:17:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}