{
  "metadata": {
    "last_updated": "2026-01-18 02:39:57",
    "time_filter": "week",
    "subreddit": "Marketresearch",
    "total_items": 10,
    "total_comments": 60,
    "file_size_bytes": 58836
  },
  "items": [
    {
      "id": "1qdmenv",
      "title": "Layoffs at research agencies?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qdmenv/layoffs_at_research_agencies/",
      "author": "DataBeeGood",
      "created_utc": "2026-01-15 15:23:45",
      "score": 12,
      "num_comments": 17,
      "upvote_ratio": 0.94,
      "text": "I get that 2025 was hard for a lot of research agencies. But anecdotally, it seems some have suffered more than others. I know Dyanata had layoffs last year (I think when they filed for bankruptcy?). But I don't think Ipsos had any. What others had layoffs?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qdmenv/layoffs_at_research_agencies/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nzqvo93",
          "author": "Much-Quote5604",
          "text": "NielsenIQ cleaned house throughout 2025. Some people were even let go right before Christmas. Staff were impacted at every level, from entry level analysts to senior leadership in almost every business unit across the world. Former parent company Nielsen has been downsizing quite a bit too but they were already slowly shrinking after the split. I’ve heard of some layoffs over at Kantar & Ipsos due to slowdown in business too but nowhere as bad as NIQ probably because they just went public.",
          "score": 15,
          "created_utc": "2026-01-15 15:51:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzrgelz",
              "author": "jollyrowger",
              "text": "PE ownership and stake of NIQ means a return is expected unfortunately.  GfK acquisition was expensive, too, I’m sure.",
              "score": 3,
              "created_utc": "2026-01-15 17:24:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzs5ft2",
              "author": "DataBeeGood",
              "text": "Thanks--I had not heard that even Kantar and Ipsos were not immune.",
              "score": 3,
              "created_utc": "2026-01-15 19:16:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nztkdnd",
                  "author": "jollyrowger",
                  "text": "The big ones (NIQ, Ipsos, Kantar) are at the mercy of their top 20ish clients.  Depending on the industry alignment (CPG, Tech, B2B), if that client base cuts back…the big firms have a looming cut.  The insights space is rapidly transforming, firms like this are playing catch up to remain competitive and attractive to work with.",
                  "score": 8,
                  "created_utc": "2026-01-15 23:17:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqt6ua",
          "author": "whattheblank",
          "text": "Morning Consult had some this week",
          "score": 10,
          "created_utc": "2026-01-15 15:40:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzrer0p",
              "author": "SageNSeaGlass",
              "text": "Morning consult has been plagued with them for a long time due to their sloppy business structure and plan",
              "score": 6,
              "created_utc": "2026-01-15 17:17:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzvb8aw",
              "author": "Aggressive_Paper_913",
              "text": "What areas were impacted at MC?",
              "score": 2,
              "created_utc": "2026-01-16 05:20:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzsvbbr",
          "author": "mrdllnt",
          "text": "Kantar had several layoffs as well.",
          "score": 7,
          "created_utc": "2026-01-15 21:16:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzv1el2",
          "author": "quadaxial",
          "text": "Material (formerly LRW) had a bunch last year and for several years before.  An absolute dumpster fire.  Steer clear.",
          "score": 6,
          "created_utc": "2026-01-16 04:14:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o06mxj5",
              "author": "Cautious-Poem7911",
              "text": "Yayks! I was desperate to leave my shitty little company (psychotic CEO) so applied there. Luckily I didn't get it, as after the first interview I read their glassdoor review and damn! Sad times..",
              "score": 1,
              "created_utc": "2026-01-17 22:17:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzrle3k",
          "author": "0nin_",
          "text": "Sample buying a bit slower this last year, not surprised",
          "score": 6,
          "created_utc": "2026-01-15 17:47:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzs7rqi",
          "author": "Nearby_Wishbone555",
          "text": "Have any smaller agencies suffered?",
          "score": 2,
          "created_utc": "2026-01-15 19:27:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzs90ro",
              "author": "Dangerous-Race-5591",
              "text": "Small agencies I’ve worked for have either gone bust or significantly reduced their activities while the largest have been acquired. To me the past 10 years in general have been brutal for the traditional market research industry as a whole.",
              "score": 7,
              "created_utc": "2026-01-15 19:32:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nztsn6p",
              "author": "Dubsteprhino",
              "text": "I worked for a small agency until Monday. I am a software engineer that worked ata small agency but analysts also got let go. Not going to reveal the name for privacy ",
              "score": 2,
              "created_utc": "2026-01-16 00:02:14",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzwcl1r",
              "author": "callunu95",
              "text": "Savanta had a fair few cuts nearing year end, and QUMind as well after they were acquired.",
              "score": 1,
              "created_utc": "2026-01-16 10:40:48",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o06nf65",
              "author": "Cautious-Poem7911",
              "text": "Mine did. Went from 20+ to about... 8 (and 3 of us put our notices in). They are not even trying to fill any of the roles, and we were sooo damn close to not being able to make payroll past December (well, we only have 2~ months left of cash to pay salaries, assuming no further work comes in)",
              "score": 1,
              "created_utc": "2026-01-17 22:19:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qcgcpx",
      "title": "Tracksuit",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qcgcpx/tracksuit/",
      "author": "Sea_Contribution_734",
      "created_utc": "2026-01-14 06:47:33",
      "score": 11,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "I have a small boutique agency and recently came up against Tracksuit.  I’m curious if anyone has experience with them and could give a perspective on their data quality.  I saw a few numbers and they did not pass face validity with me—the awareness numbers seemed suspect.  \n\nI’m not sure if that is true though, and I thought this might be a good place to get some anonymous perspectives from practitioners.  \n\nMy understanding is that they use Dynata for panel.  I generally think Dynata is not great on quality (even by panel supplier standards) due to them not always using closed panels, also river sampling, also the cheapest. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qcgcpx/tracksuit/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nzibs1f",
          "author": "yianni_",
          "text": "They’re a tech company posing as a research company. They basically run omnibus surveys and wrap them up in slick online dashboards, have very little rigour in what they do, but it appeals to a client with a low budget who wants self-service tracking. \n\nI don’t come up against them much these days because my clients want more consultancy but they’re great at marketing themselves. I’ve spent time using their platform, it’s not good, their samples are low and non-representative, and there’s very little insight. Works for a specific type of client but not the ones who need support.",
          "score": 6,
          "created_utc": "2026-01-14 08:52:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzibqy0",
          "author": "curlyfries2323",
          "text": "Tracksuit are very good at marketing themselves, as you would expect from any company holding tens of millions in VC funding, but they are not good at brand research. As a researcher you know when awareness numbers look suspect they usually are.\n\nTake a look at their TikTok report (The Awareness Advantage) for example. It is presented as major evidence that awareness drives performance, but the effective dataset is tiny. They start with a much larger pool of brands, then filter it down to 11 brands, leaving around 60 data points underpinning the headline claims. From that, they publish big, confident multipliers and thresholds that get repeated as fact.\n\nThat is not defensible brand research. They are effectively running simple regressions on messy, observational brand data and then making broad claims about behaviour. Awareness, spend, distribution, brand size, and category effects are all tangled together, but none of that is properly accounted for. What they mostly end up rediscovering is that big, well-funded brands perform better. Tracksuit position this back to marketers as insight.\n\nYou are right on data quality too. We never use Dynata for the same reasons you mention. Tracksuit appeals to teams that are time-poor, budget-constrained, and want something simple they can screenshot into a slide, even if it is not true. Sadly, that is not unique to our industry, but it does a lot of damage.",
          "score": 3,
          "created_utc": "2026-01-14 08:52:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhz295",
          "author": "Saffa1986",
          "text": "I come up against them often here down under. \n\n\nTheir awareness figures will be based on people who have interacted with the client’s category in the last 3 months. \n\n\nLook, it’s hard to compete in general. It’s a slick system, it hits the notes a marketer wants, it’s self serve, and their Coach T emails are pretty awesome. \n\n\nBut - there’s limited customisation, limited support, limited sample. So anything which is a more nuanced audience, a client who wants interpretation and recommendation, or has specific things of interest - a boutique solution will win out. Plus, you just have access to same data as everyone else in your category, so the glorified syndicated nature of it will limit competitive advantage if everyone buys in.",
          "score": 3,
          "created_utc": "2026-01-14 06:54:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzl645c",
          "author": "CountNo3351",
          "text": "As a side note, Mark Ritson is an investor in Tracksuit and peddles their product in his Mini MBA course which a lot of client-side marketers attend. Seems pretty dodgy since his recommendations clearly aren’t independent.",
          "score": 2,
          "created_utc": "2026-01-14 18:51:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzow17c",
              "author": "Sea_Contribution_734",
              "text": "I saw that and I noticed they play that card a lot.  Seems like a money grab both ways, don’t you think?",
              "score": 2,
              "created_utc": "2026-01-15 07:28:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzk5c4s",
          "author": "coffeeebrain",
          "text": "i haven't used tracksuit specifically but i've used dynata panels for research before and yeah, quality can be hit or miss. the river sampling thing is a real problem - you don't know where participants are actually coming from.\n\nthe awareness numbers seeming off doesn't surprise me. panels in general struggle with quality control, especially for brand awareness studies where people might just click through without really thinking.\n\nfor b2b research i've moved away from dynata entirely. i use cleverx now when i need panel recruitment - way better quality control and you actually know the participants are who they say they are. dynata works okay for some consumer stuff but even then i'm always skeptical of the data.\n\nif the numbers don't pass face validity, trust your gut. i've had clients push back on research findings before because the data just didn't make sense, and usually when we dug into it there was a sampling or quality issue.",
          "score": 1,
          "created_utc": "2026-01-14 16:06:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwazx3",
          "author": "ConnectionOpening505",
          "text": "From a market standpoint, tracksuits have shifted from purely sportswear to everyday athleisure, driven by comfort, price sensitivity, and social media trends. Demand is strong in mass and mid segments, but differentiation now comes from fabric quality, fit, and branding, not just price. Validating target customer and price band before scaling is key.",
          "score": 0,
          "created_utc": "2026-01-16 10:26:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbnuu0",
      "title": "DIY Surveys vs. Full-Service Agency",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qbnuu0/diy_surveys_vs_fullservice_agency/",
      "author": "_forgotmyownname",
      "created_utc": "2026-01-13 10:24:19",
      "score": 10,
      "num_comments": 15,
      "upvote_ratio": 1.0,
      "text": "I’m at a turning point with the team and I’d like to know when you decided to move from self-service platforms to working with a dedicated agency. So far we’ve managed internally, but I’ve noticed that on the B2B side the response rate is very low.  \n  \nOn top of that, the data we collect is noisy and, to be honest, we can’t draw clear conclusions for next year’s strategy. I initially feared that a full-service agency would be far beyond our budget, but I’ve come to the conclusion that we can no longer rely on intuition and quickly made forms.  \n  \nAt the moment I’m in advanced discussions with [Vision One Research](https://visionone.co.uk) and I’m thinking about starting a collaboration with them. I was attracted by the fact that they seem to have the necessary experience in the UK market and an entry-level financial threshold more accessible than I expected from an agency of that caliber.  \n  \nIt would be a big relief to have them take care of all the logistics with respondent recruitment and data cleaning. Has anyone worked with them or do you have any other advice before I sign the contract and take this step?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qbnuu0/diy_surveys_vs_fullservice_agency/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nzc4ac3",
          "author": "grimorg80",
          "text": "Some agencies truly bring another level of expertise. Drafting the survey is just one task, and good agencies start by understanding the strategic problem you have, identify what to go on the field for, design and run the study, then provide detailed and actually actionable insights.\n\nA truly good research agency is basically a data-grounded strategy consultancy. Good ones are absolutely worth it, although some of the boutique ones only work with very big companies (like we do) while larger agencies have pipeline for smaller clients (which sounds like your case)",
          "score": 3,
          "created_utc": "2026-01-13 11:39:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbyert",
          "author": "bb82020",
          "text": "Check Forsta (formerly Confirmit and Focus Vision), they are saas, but offer implementation services. Can also help with sample if required.",
          "score": 2,
          "created_utc": "2026-01-13 10:48:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbyop8",
          "author": "The_Scrabbler",
          "text": "I haven’t worked with Vision One but I can speak a little to the trade off of DIY vs. Agency.\n\nEssentially you just need to work out the costs (incurred and salaried hours) of doing it yourself vs. delegating it to the agency. \n\nThere are other considerations too - like their specialist expertise, the time you could spend doing other things, their knowledge of competitors; though you will have to stay on top of directing them. \n\nIMO, it’s worth a trial and see if you’re satisfied with the outputs and value delivered. And then if you get more work to send their way.",
          "score": 2,
          "created_utc": "2026-01-13 10:51:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzclo67",
          "author": "CornerNo3544",
          "text": "You mentioned your team is getting “noisy data” and that bit hit home because that’s exactly what happens when you try to do B2B surveys with quick forms. Vision One might look tidy on paper, but the real shift happens when you get people who can actually reach senior decision makers rather than blasting invites into the void. The moment you said the response rate was low, that told me your sample frame is the real problem, not the questions. A proper agency isn’t just cleaner data, it’s access to humans who actually know what they’re talking about. If you go ahead, judge them on who they can recruit, not on how shiny their proposal looks.",
          "score": 2,
          "created_utc": "2026-01-13 13:37:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcoxd2",
          "author": "EnergyBrilliant540",
          "text": "That transition from self-service to an agency is a big step, but B2B data noise is a very common breaking point for internal teams.\n\nSince you are reviewing the contract, it might be worth clarifying specifically *how* the previous tools failed so you can ensure the agency covers that gap. When you say the data was 'noisy,' was that mostly due to irrelevant respondents (targeting issues) or did the forms themselves lack the validation logic to filter out low-quality answers?\n\nPinpointing that distinction might help you define the specific 'data cleaning' deliverables you need them to commit to.",
          "score": 2,
          "created_utc": "2026-01-13 13:54:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzd06bg",
          "author": "creativeinnovator3",
          "text": "u/_forgotmyownname what B2B area are you in? Financial services? Healthcare? Tech?\n\nI have been in your position as I lead a team in healthcare and have led teams in financial services too in the corporate side of research. I’d give Vision One a try. I’m US based, fo context.",
          "score": 2,
          "created_utc": "2026-01-13 14:53:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc2izj",
          "author": "VyprConsumerResearch",
          "text": "A lot of teams reach this point when the challenge isn’t running surveys anymore, but turning the results into clear, strategic direction. Agencies can be helpful for that, though they can come with longer timelines and higher costs than expected. If you're still interested in using a self-serve platform, ours at Vypr uses behavioural science to reduce noise and bias from respondents and returns results within hours.   \n  \nIt's worth doing a trial with Vision One to see what you get, but if it's not what you're looking for, there are self-serve platforms out there that offer responsive and instructive insights.",
          "score": 3,
          "created_utc": "2026-01-13 11:24:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzd1ygu",
          "author": "coffeeebrain",
          "text": "B2B recruitment is brutal - I feel this. 10% response rates on LinkedIn are my good days.\n\nBefore going full agency, have you tried someone like [Respondent](https://www.respondent.io/)? They're middle ground between DIY and full-service. You still design the study but they handle recruitment. Way cheaper than agencies and decent for B2B.\n\nAlso I just got an email about [CleverX](https://cleverx.com/) launching some AI-first research platform? Haven't tried it yet but might be worth checking. They do both B2B and B2C recruitment i think.\n\nThe \"noisy data\" thing though - is that a recruitment problem or a study design problem? Sometimes better respondents help but if your questions are vague you'll still get messy data.\n\nI don't know Vision One specifically. Before signing I'd ask: what's their B2B panel size in your segment? How do they verify respondents? What's included vs add-ons?\n\nAgencies make sense when your time costs more than their fee. Just figure out if it's a recruitment problem or a methodology problem first.",
          "score": 1,
          "created_utc": "2026-01-13 15:02:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhqfhm",
          "author": "0nin_",
          "text": "Rep Data has best DIY sampling, if you mean full survey builder end to end, Pollfish has some cool AI abilities but not as robust as something like Dechipher",
          "score": 1,
          "created_utc": "2026-01-14 05:42:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhzr1x",
          "author": "Ghost-Rider_117",
          "text": "honestly the hybrid approach works pretty well too - you can handle the survey design and programming yourself (super easy with tools like Qualtrics or Forsta these days) but outsource just the panel/recruitment piece. saves a ton of money and you still get quality data. also depending on your B2B market, sometimes LinkedIn surveys or even cold outreach gets you better respondents than traditional panels. just my 2 cents from doing a bunch of these!",
          "score": 1,
          "created_utc": "2026-01-14 07:00:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi14ih",
          "author": "marks_kel",
          "text": "I would suggest to get some more offers with other companies. I am representing tehrihills.com. we are working with many big companies but always glad to help small and mis size business. Contact me if you are interested",
          "score": 1,
          "created_utc": "2026-01-14 07:12:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlw1k3",
          "author": "DataBeeGood",
          "text": "Be sure to avoid any bait and switch situations. I’ve been burned more than once by hiring a research agency that had an amazing team selling me, but then, as soon as the work started, they delegated all my work down to far too junior level people. And I ended up having to catch all the mistakes. Ask them to guarantee a named person who’s going to be your primary point of contact and who is not a junior researcher. Also make sure that they have a commitment about the quality of any panel sources that they use for your data collections. Which panel providers do they normally work with? Dynata or Pure spectrum? It’s different.",
          "score": 1,
          "created_utc": "2026-01-14 20:48:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwbaiy",
          "author": "ConnectionOpening505",
          "text": "From a research standpoint, DIY surveys are effective for early stage validation, pulse checks, and budget constrained projects, provided the team has solid skills in questionnaire design and data cleaning. Full service agencies are better suited for high-impact decisions, complex sampling, niche audiences, or when methodological rigor, bias control, and insight synthesis are critical. In practice, many teams use a hybrid approach DIY for speed and learning, agencies for depth and decision confidence.",
          "score": 1,
          "created_utc": "2026-01-16 10:29:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qergjs",
      "title": "Open ended vs structured questions which do you actually rely on early on?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qergjs/open_ended_vs_structured_questions_which_do_you/",
      "author": "Sufficient_Usual_857",
      "created_utc": "2026-01-16 20:37:30",
      "score": 6,
      "num_comments": 16,
      "upvote_ratio": 0.88,
      "text": "When you’re at the early research stage, how do you usually approach questions?\n\nI like open ended ones because people sometimes surprise you with things you didn’t even think to ask. But they also get messy fast and are harder to analyze.\n\nStructured questions are cleaner and easier to compare, but I sometimes worry they box people in too much.\n\nDo you start broad and then narrow down? Or do you mix both from the beginning?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qergjs/open_ended_vs_structured_questions_which_do_you/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nzzmyy3",
          "author": "Narrow-Hall8070",
          "text": "What’s the research objective",
          "score": 10,
          "created_utc": "2026-01-16 20:46:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzn83k",
          "author": "Saffa1986",
          "text": "I try to use both. \n\n\nSome questions are only open, some are only promoted, but when it’s important I use both side by side. \n\n\nThe open gives good verbatim in their own words, but you can’t guarantee people will talk precisely about what you want. So the prompted / structured gives you a firm grip on the precise percentage.",
          "score": 5,
          "created_utc": "2026-01-16 20:47:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzznf5r",
          "author": "The_Scrabbler",
          "text": "This question came up earlier. If you’re doing exploratory research then you should be interviewing people with open ended questions, you can structure the answers in analysis. \n\nIf you’re trying to measure something you already know, then code frames in surveys.",
          "score": 5,
          "created_utc": "2026-01-16 20:48:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzwigk",
          "author": "Noodiler",
          "text": "Close ended all the way.  I actively try to avoid open-ended.  I usually have a max of 2 OEs. And usually don’t report them unless the insights don’t make sense",
          "score": 5,
          "created_utc": "2026-01-16 21:31:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04h3ck",
              "author": "ilovefunc",
              "text": "Why do you avoid open ended?",
              "score": 1,
              "created_utc": "2026-01-17 16:01:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzzqh82",
          "author": "coffeeebrain",
          "text": "i almost always start open-ended early on because yeah, people surprise you. you think you know what the problem is and then someone says something totally sideways that reframes everything.\n\nthe mess is the point at that stage honestly. you're exploring, not measuring.\n\nonce i have a sense of what matters, then i get more structured. like if 8 out of 10 people mention pricing as an issue, i'll ask more specific pricing questions in the next round.\n\nmixing both from the beginning can work but it's tricky. open-ended takes longer so if you have limited time per participant, structured questions eat into exploration time.",
          "score": 3,
          "created_utc": "2026-01-16 21:02:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01c07b",
          "author": "jelybely8",
          "text": "Guessing this is a bot of some sort?  They're just reposting generic questions that were already asked a week ago.",
          "score": 2,
          "created_utc": "2026-01-17 02:18:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04b2v2",
              "author": "LeatherEconomics8604",
              "text": "Lol yes we are in their experiment - researching the researchers is smart",
              "score": 1,
              "created_utc": "2026-01-17 15:33:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o04t0tr",
                  "author": "jelybely8",
                  "text": "This is just a poorly implemented AI agent trying to codify industry info.",
                  "score": 1,
                  "created_utc": "2026-01-17 16:57:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o01rpsf",
          "author": "Proper-Independent49",
          "text": "Closed end with other, specify option is the way",
          "score": 2,
          "created_utc": "2026-01-17 03:59:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01s7mz",
          "author": "ilovefunc",
          "text": "It really depends on how many people you want to survey and how accessible they are. For example, if it's few people (1-30), and you can follow up with them via messaging / calls, then keep things mostly open ended.\n\nIn general, the more the people you survey, or the lesser accessible they are, keep things less open ended.\n\n  \nAlso, what I do is to create one version of the survey and post it to a small set of my user pool, and see what I get back, and then refine the survey (change question wording, ordering, but NOT semantics), and post again to a different set and so on. \n\nWhat tool are you using for conducting the survey? Are you open to trying a tool where an AI conducts the survey?",
          "score": 2,
          "created_utc": "2026-01-17 04:02:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04h0n6",
              "author": "ilovefunc",
              "text": "For those interested in exploring an Ai agent based survey, checkout a tool I made: https://deepinterview.trythis.app",
              "score": 1,
              "created_utc": "2026-01-17 16:01:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o03evis",
          "author": "Odd_Dog6616",
          "text": "Two clarifying questions:\n1. Are you talking about interviews/qual work or surveys/quant work, or is the question which to start with between those two? Asking because you could have “open-ended” and “structured questions” in both qual and quant, so that influences the response here.\n\n2. When you say early on, do you mean early in the research process for a given topic, or early within any single interview? It sounds to me like you’re asking if people recommend starting with more open-ended questions early in the research PROCESS to help uncover topics and vocabulary that should be included in the overall study, but that same principle could apply to a single interview if you’re talking about Qual specifically here",
          "score": 2,
          "created_utc": "2026-01-17 12:25:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04auds",
          "author": "LeatherEconomics8604",
          "text": "I ask what I want to know  - for example: would anyone reading this thread be open to paying $65 for a 2 hour workshop that will teach you how to overcome ANY challenge you are facing in 3-weeks? \n\nIf not, what objections do you have?\n\nWhat questions do you need answered to make it feel worth it? \n\nWhat outcome would you be looking for at that price point?",
          "score": 2,
          "created_utc": "2026-01-17 15:32:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06v9jl",
          "author": "sauldobney",
          "text": "It depends on if you're exploring or measuring. The more exploratory, the more you use open questions to uncover thoughts and ideas. The more your are measuring (how many), correlating and testing you need structured questions. Open ends aren't great for measurement and remember the importance of the sample and bias and what population you are trying to represent in the research",
          "score": 1,
          "created_utc": "2026-01-17 22:59:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qegda9",
      "title": "Has anyone used Listen Labs before? I can't find information about their pricing",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qegda9/has_anyone_used_listen_labs_before_i_cant_find/",
      "author": "catwithbillstopay",
      "created_utc": "2026-01-16 13:46:44",
      "score": 5,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I'm trying to understand pricing models in the interview/research space but can't find anything other than how much they've raised and some other key \"investor\" figures. There's a rough video of how the program works but I'd like to dig a little deeper.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qegda9/has_anyone_used_listen_labs_before_i_cant_find/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nzy5kul",
          "author": "AforAI",
          "text": "Mostly research projects are priced based on project scope. So if you just need info, platforms are unlikely to show you numbers.   \nIf you want service, you can also check out outset, biobrain, knit.. these all do qual research.. which are your interviews.",
          "score": 2,
          "created_utc": "2026-01-16 16:45:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdw4gp",
      "title": "Feedback on Cint as panel provider?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qdw4gp/feedback_on_cint_as_panel_provider/",
      "author": "pnutbutterpirate",
      "created_utc": "2026-01-15 21:17:38",
      "score": 5,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Haven't worked with them before but am considering them for a B2B study.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qdw4gp/feedback_on_cint_as_panel_provider/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nztctpx",
          "author": "Deep_Diver_1",
          "text": "You get what you pay for in sample; I wouldn’t expect to field a B2B survey with Cint without having to replace many during QC checks - they’re an aggregated sample provider. \n\nPretty useful for gen pop, but I would shop someone with more security for the more targeted groups.",
          "score": 13,
          "created_utc": "2026-01-15 22:38:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt8vv0",
          "author": "Narrow-Hall8070",
          "text": "🚮",
          "score": 5,
          "created_utc": "2026-01-15 22:19:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztfqhs",
          "author": "Belloz22",
          "text": "My take. \n\nUsed them for many years for B2C research - all good. \n\nThen, it's all fallen off a cliff and the service has become terrible; I think they were acquired / acquired a company and changed all their processes. Hasn't been the same since. \n\nStopped using them now.",
          "score": 4,
          "created_utc": "2026-01-15 22:53:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztg5lc",
          "author": "Saffa1986",
          "text": "Average. \n\n\nThey charge you little, pay people less. Data quality is mediocre. \n\nIf it’s a low incidence and high incentive job, be prepared for bot farms and scammers / AI. \nIf it’s a complex topic, be prepared for weak responses.",
          "score": 3,
          "created_utc": "2026-01-15 22:55:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw6ukk",
          "author": "VyprConsumerResearch",
          "text": "What you're getting with Cint is an aggregated panel rather than a single, managed panel, which can be a drawback for B2B. You’re often dealing with mixed sources, variable recruitment standards, and limited visibility into how respondents are actually verified, which can hurt consistency and face validity. It can work for quick, broad reads, but I’d be cautious if the study needs precise targeting or high-confidence insights.",
          "score": 2,
          "created_utc": "2026-01-16 09:49:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvdeyd",
          "author": "alexisappling",
          "text": "Cint isn’t a sample provider per se but an aggregator of sample. They don’t actually deal in panel management, they just connect you with as much unduplicated sample as they can. \n\nIf you know a quality sample provider, then you’re always better off with them.",
          "score": 1,
          "created_utc": "2026-01-16 05:35:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbr8tg",
      "title": "CAWI recomendations for West Africa",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qbr8tg/cawi_recomendations_for_west_africa/",
      "author": "Adorable_Milk5433",
      "created_utc": "2026-01-13 13:26:07",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Hello!\n\nI am on the lookout for Market-Research agencies that could assist with CAWI research.\n\nThe target group would be adult that have traveled to Europe via plane in the last 2 years. \n\nWe would be looking for people that live in the urban areas of Senegal, DRC, Cameroon and Côte d'Ivoir.\n\nSince I am based in Europe I do not know this market very well. \n\nAny recomendations who would be a good Option in those countries?\n\nThanks a lot!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qbr8tg/cawi_recomendations_for_west_africa/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nzczfg0",
          "author": "jollyrowger",
          "text": "Cint or Borderless Access to start, if anything.  Those markets are not going to be easy to do online.  You’re better off with a F2F/CAPI agency.",
          "score": 2,
          "created_utc": "2026-01-13 14:49:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzemyiz",
              "author": "alexisappling",
              "text": "Yep. Borderless Access are essentially the expensive, but good, go-to in those places. Cint aggregates, but I doubt would reach all of those.\n\nHowever, OP, beware that CAWI as you know it doesn’t really exist in those markets. Mostly we’re talking smaller smartphones, and very rarely laptops etc. so, if you’re asking big complex likerts then stop right now. You have to design absolutely for usability and ease both for your quality and cost. \n\nAnd, also, that often when you’re targeting you think you’re speaking to the adult that travelled by plane, but in fact you’re talking to the uncle of the adult who travelled by plane, because they think that they’re all one and the same.\n\nEdit: oh, also, it’ll need to be in French. Sorry, you probably already knew that!",
              "score": 3,
              "created_utc": "2026-01-13 19:34:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzhmd88",
          "author": "TravisHunterJr",
          "text": "Wow, what a niche audience in some interesting markets. I have no recommendation, just interested. Best of luck!!",
          "score": 1,
          "created_utc": "2026-01-14 05:12:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi4nv6",
          "author": "Noodiler",
          "text": "From experience, its much better to go with F2F in these markets compared to CAWI. \n\nBut like the rest said,  borderless access would be the go to.",
          "score": 1,
          "created_utc": "2026-01-14 07:44:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwarub",
          "author": "ConnectionOpening505",
          "text": "For West Africa CAWI, panel depth and device compatibility are key challenges. In our experience, combining local panel providers with strong mobile penetration and supplementing with hybrid methods (CAWI + CATI) helps improve sample quality and response rates, especially outside Tier-1 urban centers. Panel performance also varies significantly across Nigeria, Ghana, and Francophone markets, so country level validation is essential. Happy to connect and share more practical insights based on similar studies, if helpful.",
          "score": 1,
          "created_utc": "2026-01-16 10:24:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdm5e8",
      "title": "“What are you looking for in your next role?”",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qdm5e8/what_are_you_looking_for_in_your_next_role/",
      "author": "tulipsandcaramels",
      "created_utc": "2026-01-15 15:13:55",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "What is a strong response for this job interview question? I’ve been interviewing for sr. research manager positions and twice now I’ve been asked this question and didn’t feel like I was prepared to respond. Once I said “room for learning and growth”, the other time I said something in the lines of being trusted to independently do my job. Both times I was bullshiting  to be honest - as one does in job interviews. Neither felt right. \n\nFor context, I work mostly on quant ad-hoc studies as a sr research manager. Make $100K. Applying for similar positions with a bit of a pay bump, $110-$120K would be nice. \n\nThank you for advising! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qdm5e8/what_are_you_looking_for_in_your_next_role/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nzqq0go",
          "author": "Narrow-Hall8070",
          "text": "Well. What's your answer to the question?",
          "score": 2,
          "created_utc": "2026-01-15 15:25:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqsqnm",
              "author": "tulipsandcaramels",
              "text": "I don’t know if honest answers are the way to succeed in job interviews lol. My answer is I’m looking for a change, I can’t stand the culture of my current company anymore, and it seems like a good time to job hop, as I’m approaching 4 years at my current job and I could use the type of pay increase that comes with getting a new job. I’m in my late 20s BTW if that makes a difference",
              "score": 1,
              "created_utc": "2026-01-15 15:38:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzqywh4",
                  "author": "Narrow-Hall8070",
                  "text": "I don't know that canned answers are the right way to succeed either.  \n\nI think your answer is great if you polish it up some.  Talk about what about your current culture you want a change from and what you perceive about the culture of the company you are interviewing with that seems better.  Have you reached a ceiling at your current company?",
                  "score": 2,
                  "created_utc": "2026-01-15 16:06:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzukzr1",
          "author": "Contra1to",
          "text": "Maybe just use the company you're applying for as guidance for your answer? Is it a different business category/ industry? (\"I've been working on skincare brands in the last X years and I want to expand my knowledge and experience in hospitality\"). Does the company have a different consumer market? (\"I would like to learn more about premium consumers and their purchase behaviors, as my experience were in mass market\"). Is there a change in scope for the company/ role? (\"I would like to experience designing and implementing multi-market/ country research)",
          "score": 1,
          "created_utc": "2026-01-16 02:39:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qeg3qk",
      "title": "Have you ever paid for market research and still felt stuck afterward?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qeg3qk/have_you_ever_paid_for_market_research_and_still/",
      "author": "OkNeighborhood4811",
      "created_utc": "2026-01-16 13:35:27",
      "score": 3,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "I’ve seen cases where companies invested serious money in research, got a polished report, and then… nothing really changed.\n\nNo clearer prioritization, no stronger conviction, just “interesting insights.”\n\nCurious how common this is, and what people felt was missing.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qeg3qk/have_you_ever_paid_for_market_research_and_still/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nzx2lzf",
          "author": "lsuillini",
          "text": "As a researcher, I've seen this happen. Usually it's because someone in leadership believes their idea is better than what their users/customers told us.",
          "score": 16,
          "created_utc": "2026-01-16 13:41:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzzdqqd",
              "author": "alexisappling",
              "text": "As a researcher I’ve also seen this happen. Usually it’s because the market research agency didn’t say “we can’t research that, it’s impossible”, and instead went “sure, money, sure!”  \n\nWay too often senior agency leaders are promising the earth when they don’t understand if it can be delivered. And clients end up with a disappointing ride which results in them no longer believing in research.",
              "score": 5,
              "created_utc": "2026-01-16 20:02:48",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzxv0mu",
              "author": "jelybely8",
              "text": "100% this.",
              "score": 3,
              "created_utc": "2026-01-16 15:58:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzxnbtp",
          "author": "cf858",
          "text": "Often happens when you simply ask the wrong questions. You shouldn't be investing a lot in research if you haven't already done a lot of work to figure out what you need to know.",
          "score": 5,
          "created_utc": "2026-01-16 15:24:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxx8x8",
          "author": "toragirl",
          "text": "Insights teams (agency and within an org) need to have a clear plan for research - how does the consumer insights feed into marcom or product team planning? Have the stakeholders received the information in a format that they can create action from? \n\n  \nOR...\n\n  \nWas the research confirmatory, and didn't move the needle on changing the planning?",
          "score": 4,
          "created_utc": "2026-01-16 16:08:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzy3yy6",
          "author": "sandysadie",
          "text": "It is the clients job to ensure the supplier is delivering actionable insights",
          "score": 3,
          "created_utc": "2026-01-16 16:38:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzn3q6",
          "author": "coffeeebrain",
          "text": "this happens constantly, honestly. i've been on both sides - doing research that gets ignored and also being the consultant delivering reports that probably collected dust.\n\nthe missing piece is usually that research happened too late. like the exec team already decided what they want to build, they just needed research to validate it. so when research says something else, they ignore it or cherry-pick what fits their narrative.\n\nother times it's just that the research answered the wrong question. client asks \"should we build feature x?\" but the real question was \"what problem are customers actually trying to solve?\" totally different.\n\nalso sometimes researchers (myself included) deliver too much. 40-slide deck with every finding instead of \"here are the 3 things you need to know and what to do about them.\"",
          "score": 3,
          "created_utc": "2026-01-16 20:46:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00zbjy",
          "author": "silver70seven",
          "text": "I agree with all the above but also I feel usually ego exists at the top and no action is invested in the ideas brought forth. Sometimes that can be if the scope is too broad to give good clarity on next steps, or if the the research report is somewhat vague.\n\nAlso, respect that there is always questionable data and that it’s a gamble. If it’s a decision to be made that depends on data and your gut says it’s untrustworthy, it’s sensible to withhold action and maybe do another pass at the question.",
          "score": 3,
          "created_utc": "2026-01-17 00:58:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzx709c",
          "author": "Legitimate-Net6717",
          "text": "Yep, this happens *all the time*. Market research can be beautifully done but still feel useless if it doesn’t include clear next steps. Data alone isn’t enough — you need prioritization, actionable recommendations, and someone to translate insights into decisions.\n\nA lot of reports just list trends or stats without helping you answer: *“What should I do tomorrow?”* That’s the part that’s usually missing.",
          "score": 4,
          "created_utc": "2026-01-16 14:04:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04jm7z",
          "author": "OkNeighborhood4811",
          "text": "What’s interesting to me is how many of these issues show up before data collection even starts , wrong questions, late timing, unclear decision ownership. It makes me think the real leverage isn’t “better research,” but better decision framing upstream.",
          "score": 1,
          "created_utc": "2026-01-17 16:13:55",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1qeu4on",
      "title": "How do you avoid biased samples in online surveys? It feels really easy to accidentally survey the wrong people.",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qeu4on/how_do_you_avoid_biased_samples_in_online_surveys/",
      "author": "Sufficient_Usual_857",
      "created_utc": "2026-01-16 22:21:42",
      "score": 2,
      "num_comments": 7,
      "upvote_ratio": 0.67,
      "text": "You share a survey, get responses quickly, and only later realize they’re all from the same type of user or channel.\n\nWhat do you actually do to reduce bias?\nDifferent distribution channels? Screening questions? Weighting responses afterward?\n\nWould love to hear what’s worked (or failed) for you.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qeu4on/how_do_you_avoid_biased_samples_in_online_surveys/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o00823a",
          "author": "The_Scrabbler",
          "text": "Quality screener section, quotas of age and gender and location, trap questions",
          "score": 10,
          "created_utc": "2026-01-16 22:26:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o008f6d",
              "author": "Hillbilly555",
              "text": "Paying for responses from a panel as well helps.... Vs putting a survey up on Reddit. We all know Redditors are not 'normal' 😉",
              "score": 12,
              "created_utc": "2026-01-16 22:28:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o008hsr",
              "author": "Belloz22",
              "text": "Basically then. \n\nAlso, checking your data afterwards - I also report bad respondents to the panel provider and get them replaced.",
              "score": 6,
              "created_utc": "2026-01-16 22:29:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o011o4x",
          "author": "ThePirateBee",
          "text": "Increase screening requirements and build in demo quotas, nested if they're really important. Soft launch, pausing after 10% to check data, then adjust if necessary. Pace completes to ensure representation from people available on different days/different times a day. Regularly inspect responses during sampling and remove/replace respondents who fail trap checks and put gibberish into open ends.\n\nIf after all that you still realize you messed something up, then yes, you can weight the data. But that still won't save you if the responses weren't collected well.",
          "score": 1,
          "created_utc": "2026-01-17 01:12:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06wcx8",
          "author": "sauldobney",
          "text": "Slow down the sample. Firstly to ensure you have sensible time-of-day coverage - you wouldn't expect working people to reply during working hours. Secondly to avoid the fraudsters who will jump in for anything new to get their points. Thirdly, so you can do proper quota control and data quality monitoring to catch issues early. \n\nOnce you have the sample, weighting is too late - it's better to control responses in field. You probably don't need responses that quickly, and definitely not if they are misleading or fake. Give yourself some time.",
          "score": 1,
          "created_utc": "2026-01-17 23:04:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}