{
  "metadata": {
    "last_updated": "2026-02-16 09:18:16",
    "time_filter": "week",
    "subreddit": "Marketresearch",
    "total_items": 3,
    "total_comments": 18,
    "file_size_bytes": 33956
  },
  "items": [
    {
      "id": "1r3dufy",
      "title": "For those who have only been client side, what’s your impression of researchers on agency side.",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1r3dufy/for_those_who_have_only_been_client_side_whats/",
      "author": "KevinOnTheRise",
      "created_utc": "2026-02-13 03:01:53",
      "score": 13,
      "num_comments": 19,
      "upvote_ratio": 0.94,
      "text": "I enjoy talking to my clients about this because we’re curious about the grass on the other side of the fence. \n\nI’m a lifetime agency-side researcher (so far, looking to go client) - and client side to me seems like a lot more impact / ownership, deeper business knowledge, higher pay, and usually better perks and /or WLB. Obviously this is a generalization and varies for some companies (I’d never go client side in the gaming industry..)\n\nBut I’ve heard lifetime client-side researchers look at agency side with a bit of admiration. It’s faster, you learn a lot more, work across a ton of different types of brands and work, and ultimately become a bit of a Swiss Army knife. \n\nWould love to hear everyone else’s thoughts and experiences - especially those who are lifetime client-side. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1r3dufy/for_those_who_have_only_been_client_side_whats/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o55ljpm",
          "author": "-pjdq-",
          "text": "Having worked 16 years client side, I most enjoyed the business impact and business relations. Agency side is faster paced, more variety and potentially better pay - but you're never sure of the impact you've had. On the client side you have to be more patient, but ultimately you do get to see the result of your \"predictions\". \n\nAnd if there's good integration or collaboration with analytics, you can even go full circle. For example, identify a consumer segment with needs in insights, help develop products and campaigns to serve that audience and then measure the impact of marketing and product on said consumer segment - ideally confirming that insights nailed it from the start. \n\nIt's a level of business impact and appreciation that's challenging to achieve on the client side, but completely impossible on the agency side. I loved working with agencies and always appreciated their fresh perspective and innovation - but for me the business impact outweighed it all.",
          "score": 9,
          "created_utc": "2026-02-13 12:47:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o570po2",
              "author": "KevinOnTheRise",
              "text": "Thanks! This is exactly what drives my desire to switch over - getting to see “behind the curtain” and where our insights go. \n\nSo what happens when you hire researchers now? Are you skeptical of agency folks being able to slow down and really focus on impact and integration? Or anything else?\n\nAlso, I’m curious what value you see in hiring agencies (if you all do). Someone below mentioned that they’re often too busy to go deep.",
              "score": 1,
              "created_utc": "2026-02-13 17:09:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o572n2s",
                  "author": "-pjdq-",
                  "text": "Yes, former agency folks getting bored or being too imaptient is the nr1 concern when bringing them client side. \n\nThis also typically manifests itself in promotion impatience by the way - agencies have much more steps on the career ladder, whereas you won't get a new title as quickly on the client side.\n\nGood expectation management and thorough understanding of their motivations is essential. Prevents disappointment on both sides.\n\nI've recently left insights but I'd still value agencies because they bring capabilities, resources, speed and thinking that's different from \"the inside\".",
                  "score": 2,
                  "created_utc": "2026-02-13 17:19:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o540l2r",
          "author": "Hillbilly555",
          "text": "I'm not sure it is better pay. I guess depends on your level across both sides. I do very well agency side",
          "score": 7,
          "created_utc": "2026-02-13 04:44:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55qfat",
          "author": "alexisappling",
          "text": "Typically not higher pay, unless you do it for 20 years at a big multinational. It’s way easier to become ‘director’ at an agency at get paid the mega bucks. \n\nI don’t think anyone clientside is looking at agency with admiration. Generally, honestly, really honestly, we all wonder why in hell you do it. Also, we think most of the agency folk are a bit crap. \n\nIn the right clientside role you work on far more diverse methods and projects than you ever will in an agency. But you’re paid less. But you work less. So, yep.",
          "score": 5,
          "created_utc": "2026-02-13 13:17:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56oalr",
              "author": "KevinOnTheRise",
              "text": "Appreciate the candor. I wonder why I do it too, but the longer I do the harder it becomes to switch client side (I’m also in the US, where there is a a guy slapping tariffs all over the place which heavily affects client side hiring). \n\nA few questions for you:\n\n1) Why do you (or your peers) think most agency people are crap?\n\n2) if you were hiring a researcher, would it go against them if they’ve only ever been agency side?",
              "score": 2,
              "created_utc": "2026-02-13 16:10:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o56xiq9",
          "author": "dreymarie17",
          "text": "I moved from agency to client side 4 years ago. IMO the work life balance is so much better on the client side, I’m not rushing to get decks out or meet unrealistic deadlines. Pay and benefits are much better (I am at a Fortune 200 though so likely depends) plus you get a bonus which feels rare or nonexistent on agency side. And you actually get to impact strategy and be at the table for decisions.\n\nThere are downsides though. Navigating internal politics can be a nightmare—you have to work with tons of cross functionals that have their own opinions and may or may not want to listen to you. Career growth takes longer, fewer promotions, and overall more deflated titles. \n\nWe obviously appreciate what agency side people do and we work with them a ton, but they honestly seem overworked which causes a lack of detail. I have caught a number of big mistakes by agency’s/vendors over the years. It can become a tedious back and forth to get things right/how we need them.",
          "score": 4,
          "created_utc": "2026-02-13 16:54:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o57014n",
              "author": "KevinOnTheRise",
              "text": "Thanks! How do the internal politics you navigate now differ from the politics you navigated agency side? Albeit less cross functional, I still find myself navigating political environments with peers and clients (especially when a peer becomes an internal client because their ego is attached to the client account). \n\nLack of detail from burnout makes a ton of sense. Tbh, I’ve always felt like companies hire us as a last resort when they don’t have the capacity or capability to do the work (not everyone has the analytical tools for segmentations and conjoints).",
              "score": 1,
              "created_utc": "2026-02-13 17:06:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5795cy",
                  "author": "dreymarie17",
                  "text": "I think the main difference is that on the client side you have to work with people who don’t have a market research background who can become skeptical or just choose to discredit results/insights if it doesn’t support their ideas or goals. At least when I was on the agency side we all understood the value of our work. On the client side, there always seems to be a few people who just don’t find it valuable and want to do what they want even if the data doesn’t support it. Sometimes there are other pressures at play too and it’s not really anyone’s fault, but we have to do things that aren’t really supported by the research.",
                  "score": 3,
                  "created_utc": "2026-02-13 17:50:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5acmed",
          "author": "Dependent_Computer_8",
          "text": "I switched from vendor to client side a little under 10 years ago. I think in general, vendor side personnel are more ambitious and competent, as there's more things that can get them fired. On the other hand, I also consider them less trustworthy. Agencies/vendors aren't usually allowed to be totally honest because admitting when something doesn't work means potentially losing business. That doesn't mean they're always lying; if you hire a good team chances are that the instances are rare. But even then, you can't trust them completely.\n\nThe client side personnel have much less incentive to be dishonest, except maybe about whether they intend to renew, or whether whatever is going wrong is their fault.",
          "score": 2,
          "created_utc": "2026-02-14 04:11:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5adb9v",
              "author": "KevinOnTheRise",
              "text": "This is fascinating to me. I’ve never really thought about how the stakes of the work influence the trust you can place in the people next to you. Not even about them as people but that the inability to be wrong and feel secure in it are different. \n\nHow do you see other agency people adjust when they make the switch too? Do you think they’re overconfident, afraid to be wrong, or something else?",
              "score": 1,
              "created_utc": "2026-02-14 04:16:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5cbd9w",
                  "author": "Dependent_Computer_8",
                  "text": "I have seen that, actually. All of this varies from one person to another, but I have an employee from an agency background who put up a strong front of competence but was terrified of giving negative responses. Client side wore her down eventually... or I did. Still, I think that the experience is valuable. Having that higher level of expectations put on you early in your career gives you a strong competitive advantage among peers who might be more casual/less careful in their approach. ",
                  "score": 2,
                  "created_utc": "2026-02-14 14:12:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ckwvx",
          "author": "creativeinnovator3",
          "text": "I have been on both agency and client-side at various points in my career. I started on the agency side for about five years and I was fortunate because my client brought me on board as their research analyst and it was a package good company so it was a lot of fun and I got a lot of experience there and it allowed me to get my MBA without paying for it because it was covered 100% at that time as I had Bs or better. \n\nClient-side puts you close to decisions. You own outcomes, not deliverables. The greatest challenge I see is the ROI on research, if that’s not something easily measured.  I have been in different client roles over 20 years and then #1 thing I do is   spend a lot of time on influence and Stakeholder alignment. And this is also challenging because sometimes we don’t have budgets that allow us to do the work we want to do and we might have to bring some of that in house. We have a CX team that does all of our CSAT/vOC Sand my team does all of the primary qual and quant Market Research. Data analytics used to be a part of my team but now they moved into finance versus marketing. I will caveat that I am in life sciences (not Pharma) Budget cycles. Legal, privacy, procurement, brand, compliance. \n\nAgency work earns real admiration from client-side. You sharpen craft fast because you see many categories and business models. You get reps in briefing, design, fieldwork, analysis, and storytelling and you build strong project management under pressure. I have been there! \n\nClient-side has tradeoffs people miss.\nYou go deep on one business unless your business offers different sectors or services/ products. You live with messy realities and competing priorities and having to work with people who may not see value in your work. You fight for focus and budgets. You translate insights into roadmaps, comms, training, and change management. You get measured on business movement, not on a great deck - in fact I sometimes need to rewrite an agencies deck. \n\nI view the relationship I have with agency as a partnership. There is give and take on both sides but in the end we should craft and collaborate together. \n\nIf you want to move client-side, lead with examples showing impact.\n\nShow a decision you influenced and the metric movement after.\n\nShow how you handled dissent and got stakeholders to commit.\n\nSpeak the language of revenue, margin, cost, retention, conversion - depending on the client.\n\nShow judgment on when research earns its seat versus when teams should shift and learn.\n\nInterview questions worth asking: \n\nWhere research reports, and who sponsors it at VP level. I’ve typically been within marketing but have also been in Mar/Comms too. \n\nWhat happens after insights land. Who owns actions. Make sure you ask if would be able to work with stakeholders who will be using the research vs just research. \n\nWho controls budget and how procurement works. I had always spent other people’s money (i call it OPM). Research may pay for some syndicated offerings and tools like Qualtrics, an online community, etc. \n\nWhat success looks like at 3, 6, and 12 months? \n\nHappy to compare notes on what you want in the move and what kind of client-side role fits your strengths.",
          "score": 2,
          "created_utc": "2026-02-14 15:07:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ja9eo",
          "author": "SouthSet7206",
          "text": "I’ve also done both, although the client side was very early in my career. The thing is a lot of agencies have had layoffs the last couple of years. And there’s a lot of pressure for researchers to get repeat business from clients, and as you become more senior on the agency side you will be expected to do sales. They’ll call it business development or account management, but it’s sales.",
          "score": 1,
          "created_utc": "2026-02-15 17:03:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5lv65h",
              "author": "KevinOnTheRise",
              "text": "Recently just made it into senior leadership - it’s a sales team. Hence the interest in client side!!",
              "score": 2,
              "created_utc": "2026-02-16 01:14:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r1cjsu",
      "title": "Typing tool for recruitment screener",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1r1cjsu/typing_tool_for_recruitment_screener/",
      "author": "mrdllnt",
      "created_utc": "2026-02-10 20:42:29",
      "score": 4,
      "num_comments": 10,
      "upvote_ratio": 0.76,
      "text": "Hi everyone! I am after some recos, thoughts and ideas on how to create a typing tool for qual recruitment.\n\n**Historical Context**: I used to work with one of the big MR agencies. In some of our qual recruitment, we used typing tools to get specific segments our clients were targeting. From memory, a few of the typing tools came from client (based on their quant studies); others were created by our resident data science guy who build them out of Excel—- using attitudinal and behavioral attributes from our clients’ segments (or from whatever data they have provided him). Basically we ask a series of questions, respondents select the best statements that describe them, there is a corresponding score for each and depending on the total score, it would generate what segment the respondents are. So it can automatically calculate and generate the respondent’s segment. I used that information to convene groups based on which segment they fit in. Most of the time I have used typing tools, they were pretty accurate on recruiting specific segments. But it’s been a while since I last used them. So I have no idea if it’s still a thing or not.\n\n**Current context**: I am working for a company that has identified their different audience segments but dont know how to recruit them. I thought of typing tool and have mentioned my experience with it. They have not heard of such things, but open to learning more.\n\n**Questions:**\n\n• Is anyone still using typing tool for specific segment recruitment? \n\n• Or anyone has any thoughts on it — is it worth pushing for or just forget about it?\n\n• Any recos on how I can do it? IF I decide to be stubborn and push the idea. We dont have a data science guy in my current company.\n\n• Any alternatives to typing tool for recruitment?\n\nHelp, please. 🥺 \n\nTHANK YOU. 🫶",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1r1cjsu/typing_tool_for_recruitment_screener/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o4omdy8",
          "author": "coffeeebrain",
          "text": "yeah typing tools are still a thing. most survey platforms like qualtrics or alchemer can do the scoring logic pretty easily.\n\nthe tricky part is making sure your questions actually differentiate segments. seen too many companies build fancy screeners that just recruit professional survey takers instead of real segment reps.\n\nif you need to recruit based on those segments, respondent works well for b2c, cleverx is better for b2b segments. both let you add custom screeners. but honestly if your segments are super attitudinal you might just need the full custom screener approach with scoring.",
          "score": 12,
          "created_utc": "2026-02-10 20:58:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o539iud",
              "author": "mrdllnt",
              "text": "Thanks! I have not seen the report where the segments come from but I know they have done a full scale quant so maybe there are more info that differentiates the segments.",
              "score": 1,
              "created_utc": "2026-02-13 01:49:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4onm31",
          "author": "Yemfy",
          "text": "I am mainly in Ops and Recruitment in qual so take this with a grain of salt.\n\nA handful of researchers still use typing tools but in my experience they are the larger more complex businesses, but as the participant facing apparatus, I do try and note to the researcher that typing tools in generally are fickle, more meaning that the survey taker given the same question 5 minutes apart may fall into a different segment types depending on recent experience. \n\nI think as a tool it is not terrible but from my experience with them, it’s a cumbersome part and usually causes issues downstream ie. a segment type is very rare due to a segment profile missing the mark. \n\nNo real recommendations on how, as I personally have not done a lot of building of typing tools but the simpler the better so instead of matrix/table of answer values and weights, rather it’s a combination of some of the other questions in your survey/research. But this isn’t much of a typing tool as you describe! \n\nAlternative, this is more of my professional experience but a “self diagnosed” typing tool has often been used as an alternative when speed and complexity is weighing our choices. But to boil it down rather than a bunch of questions, simply describe the audience profiles and have the user identify what profile most aligns with their self view. It’s not perfect but felt like I had experience here worth sharing!",
          "score": 9,
          "created_utc": "2026-02-10 21:04:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4pbab7",
              "author": "_1nfiniteZest",
              "text": "Great advice here. You don’t just invent a “typing tool” out of nothing, but you can create a detailed screener. Typing tools are most useful for segmentations, which are themselves a multistage, sometimes multi-quarter, and very often expensive form of research that is only really appropriate for very advanced research teams with complex needs",
              "score": 4,
              "created_utc": "2026-02-10 22:59:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4x79w3",
          "author": "Hanlans_Dreaming",
          "text": "Yes, we use them and also create them in excel and also program them into the survey platform do we can manage segment quotas live rather than tagging them after the fact. I actually had a meeting today with a client walking them through one created for their segments.",
          "score": 2,
          "created_utc": "2026-02-12 03:34:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5392m6",
              "author": "mrdllnt",
              "text": "Did they give you data where their segments come from?",
              "score": 1,
              "created_utc": "2026-02-13 01:47:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o54e3pu",
                  "author": "Hanlans_Dreaming",
                  "text": "My company created the segments so I already had that. We do give them all the info on an excel file however so they can program it into other trackers they have or run it on some other data.",
                  "score": 1,
                  "created_utc": "2026-02-13 06:30:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4oyswy",
          "author": "analyticated",
          "text": "You create the typing tool by undertaking a discriminant analysis on the data used to create the initial segmentation, typically using a reduced question set (identified using the f statistic) as the final inputs.\n\nThis then gives you an algorithm for each segment which you can use to determine the most likely segment a respondent would belong to.",
          "score": 2,
          "created_utc": "2026-02-10 21:56:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pmtgl",
          "author": "Saffa1986",
          "text": "How did they identify their target segments? What differentiates them?\n\n\nTyping tool still very much in use, but probably more applicable to quant and new age qual panels than traditional qual. \n\n\nOften I (the quanty) may determine segments and provide a typing tool, but the recruiters won’t know how / don’t want to use the algorithm on the fly to assign segments when recruiting, so often get asked to provide an a-priori self select. \n\n\nSo let’s say you have a battery of 10-12 statements that defines a segment and you have an algorithm of typing tool, and this produces your four segments. We might have a one sentence pen portrait of that segment and we might say “which one of these best reflects you?”. It’s far from best practice, but better than nothing.",
          "score": 1,
          "created_utc": "2026-02-11 00:03:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4v35rs",
          "author": "Send_Me_Puppies",
          "text": "I'm writing this as I'm working on a segmentation - typing tools dont appear out of thin air. Segmentation is possibly the most complex type of research to do, and is thus very expensive.\n\nIf your client doesn't know what a typing tool is, forget it because how will you create one? You can't just dream up segment portraits too.",
          "score": 1,
          "created_utc": "2026-02-11 20:33:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1zx3h",
      "title": "MaaS market growth forecasts: how reliable are long-term projections like this?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1r1zx3h/maas_market_growth_forecasts_how_reliable_are/",
      "author": "Fragrant-System-7755",
      "created_utc": "2026-02-11 15:11:15",
      "score": 4,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "I came across a North America Mobility-as-a-Service forecast projecting growth from \\~$80B to \\~$764B by 2033 (32%+ CAGR).\n\nWhat caught my attention is that the growth narrative is strongly tied to the integration of ride-hailing and delivery ecosystems through multimodal platform shifts, including solutions like Onde app and comparable platforms supporting services such as Uber or Instacart, rather than passenger transport alone.\n\nFor those working in market research:\n\nHow do you typically validate long-term CAGR projections in emerging sectors?\n\nI’m genuinely curious how professionals here approach forecasts of this scale.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1r1zx3h/maas_market_growth_forecasts_how_reliable_are/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o4t7s88",
          "author": "Winter_Spell_5304",
          "text": "So it is majorly decided based on YoY growth of sales of companies in the market to get an base rough growth figure. Atleast last 3-5yrs sales are taken into consideration. On top of that, Another factors includes current ambitions of market, Investment done in market, partnerships/acquisitions, R&D efforts and launch if new product/services and any Government decisions/laws/support or any challenges are taken into consideration to decide the final CAGR",
          "score": 1,
          "created_utc": "2026-02-11 15:16:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4t8uys",
              "author": "Fragrant-System-7755",
              "text": "That makes sense, especially the point about anchoring projections in recent 3–5 year performance rather than relying purely on forward assumptions.\n\nIn the MaaS case, I guess the tricky part is that the structure of the market itself is shifting (ride + delivery convergence, platform expansion, etc.), which makes sales a bit harder to interpret.",
              "score": 2,
              "created_utc": "2026-02-11 15:22:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4tagct",
                  "author": "Winter_Spell_5304",
                  "text": "Yeah, but thats what market research is all about. Regarding the market shift, All recent developments, govnt policies and other major factors are taken into consideration. Primary interviews and surveys are conducted with the industry stakeholders from both demand and supply sides. This gives an idea whether if the market shift is optimistic or pessimistic. This further helps to decide the CAGR",
                  "score": 2,
                  "created_utc": "2026-02-11 15:29:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4t84i5",
          "author": "Larik_Kroft",
          "text": "I think that usually look at whether the projected CAGR is driven by real behavior change or just modeling assumptions.\n\nWith MaaS, I’d check whether users are actually adopting these combined services and whether revenue per user is increasing, not just overall volume.\n\nAnd aren’t the forecasts for EVs too optimistic?",
          "score": 1,
          "created_utc": "2026-02-11 15:18:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4v6lmn",
              "author": "Fragrant-System-7755",
              "text": "May be. EV forecasts often look optimistic because they factor in policy support, infrastructure build-out, and manufacturer roadmaps. But real-world adoption can slow down due to charging access, pricing, supply chains, or consumer hesitation.\n\nI was reading here about forecasts for the future and new mobility technologies - [https://onde.app/blog/growth-hacks/mobility-trends-in-north-america-2026-report](https://onde.app/blog/growth-hacks/mobility-trends-in-north-america-2026-report)",
              "score": 2,
              "created_utc": "2026-02-11 20:50:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4tne3l",
          "author": "DataBeeGood",
          "text": "I don’t know that sector specifically, but I know that forecasts from well-known companies in the tech field that the analysts who are creating forecasts are putting a lot of very subjective assumptions into CAGR estimates. Excuse me, I mean “subject matter expert” assumptions 😜",
          "score": 1,
          "created_utc": "2026-02-11 16:30:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4tps3n",
              "author": "Fragrant-System-7755",
              "text": "Maybe. But it’s not just assumptions, most forecasts also pull from real data across different sources: past sales, investments, partnerships, product launches, regulations, etc.\n\nThat said, you’re right - in fast-moving sectors like this, projections rarely end up being 100% accurate. ",
              "score": 2,
              "created_utc": "2026-02-11 16:41:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4to1sr",
          "author": "VyprConsumerResearch",
          "text": "When looking at projections that aggressive, it usually helps to break the forecast into its component assumptions rather than taking the CAGR at face value. Analysts often start by validating each driver, market adoption rates, regulatory tailwinds, competitor moves, and adjacent ecosystem growth, using a mix of primary interviews, historical analogues, and triangulation across multiple secondary sources. Scenario analysis can also help, showing how sensitive the CAGR is to changes in a few key assumptions. Emerging sectors are tricky because small shifts in consumer behaviour or policy can swing the numbers dramatically, so layering multiple lenses, quantitative, qualitative, and ecosystem-level, is critical.",
          "score": 1,
          "created_utc": "2026-02-11 16:33:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4u8u7d",
              "author": "Fragrant-System-7755",
              "text": "Super clear and practical way to think about it. Love how you separated the headline CAGR from the underlying assumptions. ",
              "score": 3,
              "created_utc": "2026-02-11 18:10:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o55mfst",
          "author": "No_Training_6988",
          "text": "honestly man forecasts like that are half math half magic lol. Mordor Intelligence says the global [MaaS market](https://www.mordorintelligence.com/industry-reports/mobility-as-a-service-market) is hitting $374.55B in 2026 and $716.3B by 2031! Professionals validate this by checking if real habits—like ride-hailing and delivery merging—actually stick or if it's just hype. 13.85% CAGR is the safe bet.",
          "score": 1,
          "created_utc": "2026-02-13 12:53:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}