{
  "metadata": {
    "last_updated": "2026-02-19 09:09:59",
    "time_filter": "week",
    "subreddit": "Marketresearch",
    "total_items": 4,
    "total_comments": 39,
    "file_size_bytes": 59457
  },
  "items": [
    {
      "id": "1r3dufy",
      "title": "For those who have only been client side, what’s your impression of researchers on agency side.",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1r3dufy/for_those_who_have_only_been_client_side_whats/",
      "author": "KevinOnTheRise",
      "created_utc": "2026-02-13 03:01:53",
      "score": 17,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "I enjoy talking to my clients about this because we’re curious about the grass on the other side of the fence. \n\nI’m a lifetime agency-side researcher (so far, looking to go client) - and client side to me seems like a lot more impact / ownership, deeper business knowledge, higher pay, and usually better perks and /or WLB. Obviously this is a generalization and varies for some companies (I’d never go client side in the gaming industry..)\n\nBut I’ve heard lifetime client-side researchers look at agency side with a bit of admiration. It’s faster, you learn a lot more, work across a ton of different types of brands and work, and ultimately become a bit of a Swiss Army knife. \n\nWould love to hear everyone else’s thoughts and experiences - especially those who are lifetime client-side. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1r3dufy/for_those_who_have_only_been_client_side_whats/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o55ljpm",
          "author": "-pjdq-",
          "text": "Having worked 16 years client side, I most enjoyed the business impact and business relations. Agency side is faster paced, more variety and potentially better pay - but you're never sure of the impact you've had. On the client side you have to be more patient, but ultimately you do get to see the result of your \"predictions\". \n\nAnd if there's good integration or collaboration with analytics, you can even go full circle. For example, identify a consumer segment with needs in insights, help develop products and campaigns to serve that audience and then measure the impact of marketing and product on said consumer segment - ideally confirming that insights nailed it from the start. \n\nIt's a level of business impact and appreciation that's challenging to achieve on the client side, but completely impossible on the agency side. I loved working with agencies and always appreciated their fresh perspective and innovation - but for me the business impact outweighed it all.",
          "score": 8,
          "created_utc": "2026-02-13 12:47:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o570po2",
              "author": "KevinOnTheRise",
              "text": "Thanks! This is exactly what drives my desire to switch over - getting to see “behind the curtain” and where our insights go. \n\nSo what happens when you hire researchers now? Are you skeptical of agency folks being able to slow down and really focus on impact and integration? Or anything else?\n\nAlso, I’m curious what value you see in hiring agencies (if you all do). Someone below mentioned that they’re often too busy to go deep.",
              "score": 1,
              "created_utc": "2026-02-13 17:09:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o572n2s",
                  "author": "-pjdq-",
                  "text": "Yes, former agency folks getting bored or being too imaptient is the nr1 concern when bringing them client side. \n\nThis also typically manifests itself in promotion impatience by the way - agencies have much more steps on the career ladder, whereas you won't get a new title as quickly on the client side.\n\nGood expectation management and thorough understanding of their motivations is essential. Prevents disappointment on both sides.\n\nI've recently left insights but I'd still value agencies because they bring capabilities, resources, speed and thinking that's different from \"the inside\".",
                  "score": 2,
                  "created_utc": "2026-02-13 17:19:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o540l2r",
          "author": "Hillbilly555",
          "text": "I'm not sure it is better pay. I guess depends on your level across both sides. I do very well agency side",
          "score": 6,
          "created_utc": "2026-02-13 04:44:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55qfat",
          "author": "alexisappling",
          "text": "Typically not higher pay, unless you do it for 20 years at a big multinational. It’s way easier to become ‘director’ at an agency at get paid the mega bucks. \n\nI don’t think anyone clientside is looking at agency with admiration. Generally, honestly, really honestly, we all wonder why in hell you do it. Also, we think most of the agency folk are a bit crap. \n\nIn the right clientside role you work on far more diverse methods and projects than you ever will in an agency. But you’re paid less. But you work less. So, yep.",
          "score": 4,
          "created_utc": "2026-02-13 13:17:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56oalr",
              "author": "KevinOnTheRise",
              "text": "Appreciate the candor. I wonder why I do it too, but the longer I do the harder it becomes to switch client side (I’m also in the US, where there is a a guy slapping tariffs all over the place which heavily affects client side hiring). \n\nA few questions for you:\n\n1) Why do you (or your peers) think most agency people are crap?\n\n2) if you were hiring a researcher, would it go against them if they’ve only ever been agency side?",
              "score": 3,
              "created_utc": "2026-02-13 16:10:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o56xiq9",
          "author": "dreymarie17",
          "text": "I moved from agency to client side 4 years ago. IMO the work life balance is so much better on the client side, I’m not rushing to get decks out or meet unrealistic deadlines. Pay and benefits are much better (I am at a Fortune 200 though so likely depends) plus you get a bonus which feels rare or nonexistent on agency side. And you actually get to impact strategy and be at the table for decisions.\n\nThere are downsides though. Navigating internal politics can be a nightmare—you have to work with tons of cross functionals that have their own opinions and may or may not want to listen to you. Career growth takes longer, fewer promotions, and overall more deflated titles. \n\nWe obviously appreciate what agency side people do and we work with them a ton, but they honestly seem overworked which causes a lack of detail. I have caught a number of big mistakes by agency’s/vendors over the years. It can become a tedious back and forth to get things right/how we need them.",
          "score": 6,
          "created_utc": "2026-02-13 16:54:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o57014n",
              "author": "KevinOnTheRise",
              "text": "Thanks! How do the internal politics you navigate now differ from the politics you navigated agency side? Albeit less cross functional, I still find myself navigating political environments with peers and clients (especially when a peer becomes an internal client because their ego is attached to the client account). \n\nLack of detail from burnout makes a ton of sense. Tbh, I’ve always felt like companies hire us as a last resort when they don’t have the capacity or capability to do the work (not everyone has the analytical tools for segmentations and conjoints).",
              "score": 1,
              "created_utc": "2026-02-13 17:06:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5795cy",
                  "author": "dreymarie17",
                  "text": "I think the main difference is that on the client side you have to work with people who don’t have a market research background who can become skeptical or just choose to discredit results/insights if it doesn’t support their ideas or goals. At least when I was on the agency side we all understood the value of our work. On the client side, there always seems to be a few people who just don’t find it valuable and want to do what they want even if the data doesn’t support it. Sometimes there are other pressures at play too and it’s not really anyone’s fault, but we have to do things that aren’t really supported by the research.",
                  "score": 3,
                  "created_utc": "2026-02-13 17:50:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5acmed",
          "author": "Dependent_Computer_8",
          "text": "I switched from vendor to client side a little under 10 years ago. I think in general, vendor side personnel are more ambitious and competent, as there's more things that can get them fired. On the other hand, I also consider them less trustworthy. Agencies/vendors aren't usually allowed to be totally honest because admitting when something doesn't work means potentially losing business. That doesn't mean they're always lying; if you hire a good team chances are that the instances are rare. But even then, you can't trust them completely.\n\nThe client side personnel have much less incentive to be dishonest, except maybe about whether they intend to renew, or whether whatever is going wrong is their fault.",
          "score": 3,
          "created_utc": "2026-02-14 04:11:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5adb9v",
              "author": "KevinOnTheRise",
              "text": "This is fascinating to me. I’ve never really thought about how the stakes of the work influence the trust you can place in the people next to you. Not even about them as people but that the inability to be wrong and feel secure in it are different. \n\nHow do you see other agency people adjust when they make the switch too? Do you think they’re overconfident, afraid to be wrong, or something else?",
              "score": 1,
              "created_utc": "2026-02-14 04:16:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5cbd9w",
                  "author": "Dependent_Computer_8",
                  "text": "I have seen that, actually. All of this varies from one person to another, but I have an employee from an agency background who put up a strong front of competence but was terrified of giving negative responses. Client side wore her down eventually... or I did. Still, I think that the experience is valuable. Having that higher level of expectations put on you early in your career gives you a strong competitive advantage among peers who might be more casual/less careful in their approach. ",
                  "score": 2,
                  "created_utc": "2026-02-14 14:12:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ckwvx",
          "author": "creativeinnovator3",
          "text": "I have been on both agency and client-side at various points in my career. I started on the agency side for about five years and I was fortunate because my client brought me on board as their research analyst and it was a package good company so it was a lot of fun and I got a lot of experience there and it allowed me to get my MBA without paying for it because it was covered 100% at that time as I had Bs or better. \n\nClient-side puts you close to decisions. You own outcomes, not deliverables. The greatest challenge I see is the ROI on research, if that’s not something easily measured.  I have been in different client roles over 20 years and then #1 thing I do is   spend a lot of time on influence and Stakeholder alignment. And this is also challenging because sometimes we don’t have budgets that allow us to do the work we want to do and we might have to bring some of that in house. We have a CX team that does all of our CSAT/vOC Sand my team does all of the primary qual and quant Market Research. Data analytics used to be a part of my team but now they moved into finance versus marketing. I will caveat that I am in life sciences (not Pharma) Budget cycles. Legal, privacy, procurement, brand, compliance. \n\nAgency work earns real admiration from client-side. You sharpen craft fast because you see many categories and business models. You get reps in briefing, design, fieldwork, analysis, and storytelling and you build strong project management under pressure. I have been there! \n\nClient-side has tradeoffs people miss.\nYou go deep on one business unless your business offers different sectors or services/ products. You live with messy realities and competing priorities and having to work with people who may not see value in your work. You fight for focus and budgets. You translate insights into roadmaps, comms, training, and change management. You get measured on business movement, not on a great deck - in fact I sometimes need to rewrite an agencies deck. \n\nI view the relationship I have with agency as a partnership. There is give and take on both sides but in the end we should craft and collaborate together. \n\nIf you want to move client-side, lead with examples showing impact.\n\nShow a decision you influenced and the metric movement after.\n\nShow how you handled dissent and got stakeholders to commit.\n\nSpeak the language of revenue, margin, cost, retention, conversion - depending on the client.\n\nShow judgment on when research earns its seat versus when teams should shift and learn.\n\nInterview questions worth asking: \n\nWhere research reports, and who sponsors it at VP level. I’ve typically been within marketing but have also been in Mar/Comms too. \n\nWhat happens after insights land. Who owns actions. Make sure you ask if would be able to work with stakeholders who will be using the research vs just research. \n\nWho controls budget and how procurement works. I had always spent other people’s money (i call it OPM). Research may pay for some syndicated offerings and tools like Qualtrics, an online community, etc. \n\nWhat success looks like at 3, 6, and 12 months? \n\nHappy to compare notes on what you want in the move and what kind of client-side role fits your strengths.",
          "score": 2,
          "created_utc": "2026-02-14 15:07:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ja9eo",
          "author": "SouthSet7206",
          "text": "I’ve also done both, although the client side was very early in my career. The thing is a lot of agencies have had layoffs the last couple of years. And there’s a lot of pressure for researchers to get repeat business from clients, and as you become more senior on the agency side you will be expected to do sales. They’ll call it business development or account management, but it’s sales.",
          "score": 1,
          "created_utc": "2026-02-15 17:03:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5lv65h",
              "author": "KevinOnTheRise",
              "text": "Recently just made it into senior leadership - it’s a sales team. Hence the interest in client side!!",
              "score": 2,
              "created_utc": "2026-02-16 01:14:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r65q5o",
      "title": "Is specialized visual storytelling for research actually needed, or am I forcing a niche?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1r65q5o/is_specialized_visual_storytelling_for_research/",
      "author": "DiamondEmbarrassed02",
      "created_utc": "2026-02-16 10:03:03",
      "score": 9,
      "num_comments": 28,
      "upvote_ratio": 1.0,
      "text": "I need some honest industry perspective.\n\nIt’s been a year since my partner and I started our freelance studio. We niched down into supporting market research and healthcare insight teams with presentations, reports, newsletters, data visuals, the whole storytelling side of research.\n\nBefore this, I worked in the same space full-time(for Lumanity through my comapny), so it felt like the natural niche to build around.\n\nAnd it’s not that we haven’t got work.  \nWe have.\n\nWe’ve had decks presented at ESOMAR 25.  \nWork shown at a conference in Singapore recently.  \nWe’ve worked with insight consultancies and independent researchers.\n\nBut it’s been inconsistent.\n\nMost of the time, we’re brought in when in-house designers are overloaded or when something needs a quick turnaround before a big presentation. We haven’t really cracked retainers. And the people promoting us most are independent researchers(semiotics, ethnography; basically not our targeted field), not the companies we originally thought would need us.\n\nSo now I’m honestly in a dilemma.\n\nIs this actually a real ongoing need inside research and healthcare teams?  \nOr is it mostly overflow work and \"nice to have\" support?\n\nI’m starting to wonder if niching into healthcare specifically is becoming a barrier, and whether we should broaden out instead of sticking so tightly to one space.\n\nAny perspective from people inside agencies or insight teams would genuinely help. I’d really appreciate honest input while we’re figuring out our next move :)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1r65q5o/is_specialized_visual_storytelling_for_research/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o5o0lww",
          "author": "WhiteSpaceRebel",
          "text": "I’m contributing to the above post because I’m a partner in the business and closely involved in this journey.++  \n  \nWe used to work on projects for a company called Lumanity in the UK through our previous organisation. In one six-month period, more than 1,000 decks were shared with us, and the two of us were responsible for completing them. Overall, we’ve handled 2,000+ decks across fresh visualisation builds and full redesigns of older materials.\n\nNow we’re looking for that same level of intensity because we know we can handle it. We’re genuinely trying to understand where we might be getting stuck.",
          "score": 3,
          "created_utc": "2026-02-16 11:33:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5o1on0",
          "author": "tchock23",
          "text": "Friend of mine runs this exact business targeting the MR niche. It’s very project driven with swings in revenue. It’s not a huge market but he has done ok for himself.",
          "score": 3,
          "created_utc": "2026-02-16 11:42:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o62fkba",
              "author": "DiamondEmbarrassed02",
              "text": "Yeah, that makes sense. I guess expecting steady retainers in this niche might be a bit unrealistic. It does seem very project-driven, with natural swings in revenue.\n\nGood to know he’s managed to make it work though :)",
              "score": 2,
              "created_utc": "2026-02-18 15:25:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qft7v",
          "author": "alexisappling",
          "text": "I’ve spent probably most of my career clientside, and agency presentations are generally terrible. Even when they think they’re good. They’re too long, they jump about, and they miss key insights. They’re almost universally terrible. However, I rarely tell them. I’ve given up. I used to try to tell them, and we’d go back and forth and back and forth, and they’d never get better. So, now, I take the deck, and ask for EVERYTHING as well. All the notes, the data, the everything. And I do it myself afterwards. Agencies really need your services, but they don’t think they do. That’s the problem.",
          "score": 3,
          "created_utc": "2026-02-16 19:12:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o626csp",
              "author": "DiamondEmbarrassed02",
              "text": "THIS. EXACTLY!!\n\nThank you for saying this, because this is honestly one of the biggest problems we face. Even when agencies post decks publicly, we sometimes redesign a few slides just to show what’s possible and demonstrate our thinking. But they genuinely believe what they’re doing is completely fine.\n\nIt starts to feel like a lost cause, because if they don’t see the problem, they won’t see the need.\n\nSo yes, hearing this from someone client-side is oddly validating. It really does feel like broadening out might be the only practical solution at this point. Thank you for sharing this :\")",
              "score": 2,
              "created_utc": "2026-02-18 14:41:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5tna1l",
          "author": "supriya_l89",
          "text": "The way you create your niche position I believe to be correct.   \n  \nResearch requires specialized visual storytelling because it needs to demonstrate research results through board decks and conferences like ESOMAR and client pitches. Most insight teams fail to budget for this expense because they consider it as additional work instead of essential resources.   \n  \nYour agency receives more referrals from independent professionals than from agencies which indicates success. Smaller consultancies often feel the storytelling pain more acutely and don’t have internal design support.   \n  \nI want to test a new position for our existing work before we start expanding. The current description as \"design support\" needs to change into \"helping insights drive decisions and stakeholder buy-in\" because I want to show its value. The shift transforms it from \"nice to have\" into \"revenue-impacting.\"",
          "score": 3,
          "created_utc": "2026-02-17 06:23:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o62f8zc",
              "author": "DiamondEmbarrassed02",
              "text": "You’ve put this really well, especially the point about moving from “nice to have” to something revenue-impacting. That’s exactly where we feel stuck.\n\nWhat’s interesting is that the independent researchers referring us aren’t even in healthcare. They’re mostly in ethnography, semiotics, cultural insights, etc. They liked our work and even suggested we broaden out into LinkedIn branding because we captured their positioning so well.\n\nSo I’m a bit unsure how to position ourselves. We’ve been using “Turning Healthcare Research into Visual Stories,” which sounds clear in theory, but I’m not sure it’s actually helping commercially.\n\nPart of me feels we need to reframe around impact and decision-making, but part of me wonders if we should broaden beyond just healthcare!",
              "score": 2,
              "created_utc": "2026-02-18 15:23:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5nszyy",
          "author": "material-pearl",
          "text": "I’m interested in this as a consultant. Design is critical to conveying the meaning of information, especially in the face of attention scarcity. \n\nDo you have examples of your work to share?",
          "score": 2,
          "created_utc": "2026-02-16 10:24:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nx1pw",
              "author": "DiamondEmbarrassed02",
              "text": "Hi, thanks again for your comment. I’ll send you a DM with our website!",
              "score": 2,
              "created_utc": "2026-02-16 11:01:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5o5zqj",
          "author": "RepublicLiving5358",
          "text": "Maybe there's a positioning thing? Agencies may see you primarily as research-expert designers. Personally I contract work with designers as and when my in-house designers don't have time to do it. If agencies see you as more data storytelling that's something they'd plan in more - although it does raise the question of whether it is helping or hindering in-house researcher development. Everyone's supposed to be brushing up their visual storytelling at my agency.\n\nI think sector matters more to the latter than the former.",
          "score": 2,
          "created_utc": "2026-02-16 12:15:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5opsap",
              "author": "MarMar2617",
              "text": "Agree…staff should know how to story tell so would turn to this service on adhoc as needed basis.  Also, presentations and reports are the bread and butter for the agencies so doesn’t make too much sense to outsource these things on an ongoing basis.",
              "score": 2,
              "created_utc": "2026-02-16 14:18:10",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o62abof",
              "author": "DiamondEmbarrassed02",
              "text": "We mostly work with healthcare insight and research teams, so maybe like you said, the healthcare market itself is part of the hurdle. It’s highly regulated, very data-sensitive, and that might naturally push us more into the “support” bucket rather than something they proactively plan for.\n\nBut then again, other sectors can be just as sensitive about their data, so that’s another layer we’re trying to think through.\n\nWe position ourselves as people who can do data storytelling from scratch, not just polish slides. But at the same time, we don’t mind supporting or helping teams brush up their own storytelling either. It’s just figuring out how to frame that without undermining in-house capability.\n\nStill working that one out, to be honest :')",
              "score": 2,
              "created_utc": "2026-02-18 15:00:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5onapm",
          "author": "MarMar2617",
          "text": "I worked in a large large MR agency, so perhaps not your target. For us I would say we would only need this type of help in an overflow situation as we did have visual design folks on staff.",
          "score": 2,
          "created_utc": "2026-02-16 14:04:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5oqvue",
              "author": "MarMar2617",
              "text": "We did use contractors a lot though…but they typically would help with full project management so from survey design to reporting. There def is a need for contractors as big companies tend to have lean staff.",
              "score": 1,
              "created_utc": "2026-02-16 14:23:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o62b8oy",
                  "author": "DiamondEmbarrassed02",
                  "text": "Yes, that makes sense.\n\nEven some mid-sized agencies we’ve spoken to had outsourced management teams who handled formatting and basic data clean-up. Where they felt the gap was more in high-end visualisation and sharper storytelling.\n\nBut in one case, when things started moving forward, they required a $1M insurance cover in case of any data breach. That obviously changes the equation completely, especially for a small studio. And even after that, there still wasn’t a guarantee of consistent work.\n\nSo the need is there, but the structure around it makes it quite complex!",
                  "score": 2,
                  "created_utc": "2026-02-18 15:05:06",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5q2lig",
          "author": "Noodiler",
          "text": "Would be interested to see some of your output / website if possible please.",
          "score": 2,
          "created_utc": "2026-02-16 18:12:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o62au8u",
              "author": "DiamondEmbarrassed02",
              "text": "Hey, sure sending you our website and capabilities!",
              "score": 2,
              "created_utc": "2026-02-18 15:03:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qg3o4",
          "author": "Send_Me_Puppies",
          "text": "My firm may be interested in this service. Can I have more details?",
          "score": 2,
          "created_utc": "2026-02-16 19:14:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o62b1m8",
              "author": "DiamondEmbarrassed02",
              "text": "Yess, I’ll DM you with our website and capabilities!",
              "score": 2,
              "created_utc": "2026-02-18 15:04:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5sykf4",
          "author": "hiimcass",
          "text": "Have you thought about monetizing teaching teams how to do this?  It is important, especially in the analytic department of agencys",
          "score": 2,
          "created_utc": "2026-02-17 03:23:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o62bp0a",
              "author": "DiamondEmbarrassed02",
              "text": "Yes, we’ve actually thought about that a few times, but never really acted on it.\n\nI think we always assumed agencies already have designers in-house or outsource design anyway, so they wouldn’t necessarily need training on this side of things. But honestly, I might be wrong and it’s probably something we should revisit more seriously :)",
              "score": 2,
              "created_utc": "2026-02-18 15:07:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o66r9lu",
                  "author": "hiimcass",
                  "text": "Agencies pay for training for sure, but many choose video content.",
                  "score": 1,
                  "created_utc": "2026-02-19 04:28:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o63ci7l",
          "author": "coffeeebrain",
          "text": "the overflow problem is real and honestly pretty common for specialist services. teams don't think about storytelling until two days before a deadline.\n\nthe retainer thing is tough because most insight teams just don't budget for ongoing design support. it's always reactive.\n\nbut the independent researcher angle is worth leaning into more. they have the insight, usually lack the polish, and they refer to each other constantly. might be a more reliable base than chasing agencies.",
          "score": 1,
          "created_utc": "2026-02-18 17:54:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6xfgb",
      "title": "Digital Twins for market research?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1r6xfgb/digital_twins_for_market_research/",
      "author": "PlantIllustrious516",
      "created_utc": "2026-02-17 05:23:46",
      "score": 8,
      "num_comments": 24,
      "upvote_ratio": 0.83,
      "text": "I’ve been thinking about whether digital twins could eventually replace traditional market research panels.\n\nInstead of recruiting participants for every survey, imagine building structured behavioral models of real individuals (regularly updated by people themselves) and then running simulations on those models.\n\nIn theory, this could:\n\n* Reduce recruitment overhead\n* Enable faster iteration\n* Allow continuous testing instead of one-off surveys\n\nBut I’m unsure about a few things:\n\n1. Would brands trust simulated outputs?\n2. How accurate could behavioral models realistically be?\n3. Where does this break down — edge cases, bias, drift?\n4. Would this complement research or attempt to replace it?\n\nCurious what people in market research or product think.\n\nIs this direction inevitable, flawed, or somewhere in between?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1r6xfgb/digital_twins_for_market_research/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o5tmwce",
          "author": "cf858",
          "text": "The problem with these types of approaches is that asking someone what they think of something is akin to the creation of new data, asking a digital version of that person the same thing produces an inference based on existing data. Sometimes the inference and the new data will be the same or close, but the new data has so many more degrees of freedom than the inferred data that you are potentially missing many possible outcomes.",
          "score": 15,
          "created_utc": "2026-02-17 06:19:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tq8wi",
              "author": "PlantIllustrious516",
              "text": "That is a fair point, so if we were to reword the original hypothesis \n“Digital twins could come close and be a quick alternative to the long time taking and costly process of conducting market research”\nAccording to data I read online only 23% of firms globally do market research. Would digital twins help the other 77% then?",
              "score": 1,
              "created_utc": "2026-02-17 06:48:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ve556",
                  "author": "cf858",
                  "text": "I still think you run into the new v inferred problem regardless. Here is a thought experiment, LLMs had been invented prior to the iPhone and people had digital twins. Based on everything we knew about phones before Apple released the iPhone, would digital twins have responded positively to it? Because everything at that time had a keyboard and everyone was happy with the keyboard and there were almost no examples of touchscreens on phones, there's a high chance the digital twin would have reacted poorly because all prior behavior would have inferred a keyboard less phone wouldn't be popular.\n\nIf you'd done a survey of people at that time, there's a high chance you could have discovered the latent demand for a keyboardless phone by measuring trade-offs they would be willing to make. Which is one of the key differences between a digital twin and a human. A human has conscious beliefs and unconscious motivations that can be in conflict. It would be very hard to simulate this in a digital twin. Product opportunities often reside at the edge of human dissonance, not logical inference.",
                  "score": 4,
                  "created_utc": "2026-02-17 14:35:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5ts7dt",
                  "author": "curlyfries2323",
                  "text": "I really don't get this narrative \"the long time taking and costly process of conducting market research\". I feel like this is a positioning statement from the tech industry looking for non-existent problems to solve with AI.\n\nMarket research has never been faster, whether quantitative or qualitative. Whether I want to talk to 10 people or 1,000 people, I can have answers from real people in a matter of hours.",
                  "score": 3,
                  "created_utc": "2026-02-17 07:05:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5tw3bh",
          "author": "_os2_",
          "text": "You are describing what market research companies are marketing as “synthetic respondents”, which is one of the hottest trends in 2026 :)\n\nI am not a big fan and actually wrote a quite lengthy article on their shortcomings and limitations… and consequently where they can he useful.\n\nhttps://skimle.com/blog/synthetic-respondents-in-research-promise-pitfalls-and-when-to-use-in-2026",
          "score": 4,
          "created_utc": "2026-02-17 07:41:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5u3oo7",
              "author": "RepublicLiving5358",
              "text": "Nice article - I like the point about calibrated emotions. Another reminder of the uncertainty that arises when you lose 'real' referentials for the data you're looking at. ",
              "score": 2,
              "created_utc": "2026-02-17 08:53:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5tgyn8",
          "author": "Hillbilly555",
          "text": "I think there is potential in the future, but it will be a slow adaptation due to trust.\nIt will be helpful for initial idea reduction from a long list to some key product ideas. However I doubt anyone will trust it to decide on flavour presence or be accurate in identifying the specifics of why ideas do or don't perform.\n\nI've spoken to a few people over the past year who have tried something like this and compared to a parallel consumer panel. They would not touch synthetic data again with a bargepole. Hence accepting improvements will take a long time to build trust in my opinion",
          "score": 3,
          "created_utc": "2026-02-17 05:31:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tjs00",
              "author": "PlantIllustrious516",
              "text": "But the output is only as good as the input training data.  \nLets say in an ideal world, people created their own digital twin. Grounded in behavioural data that they themselves provided.   \nIf I were to teach my digital twin on a daily basis what decisions I took that day and my rationales.   \nSimilar to how they interact with surveys. Do you think then it has value for market research.  \n  \nI see it like doing surveys in advance and storing them. But obviously there will be some questions or scenarios that are not captured which will be inferred.\n\nThis is an experiment that Google Deepmind and Stanford did - [https://arxiv.org/pdf/2411.10109](https://arxiv.org/pdf/2411.10109)\n\nThey made people sit and give AI interviews (adaptive) for 2 hours straight  \nthen they asked the digital twin and the real person to fill a survey. 85% match found.  \nthey then asked the person to come back and fill the survey again a week later. they found 85% match between the real person's responses as well.",
              "score": 0,
              "created_utc": "2026-02-17 05:54:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ue7xd",
                  "author": "Common-Finding-8935",
                  "text": "Those test results mean jack shit as it all depends on to what extent the training data correlates to the inferred data. You just can’t have people talking for two hours and expect that a resulting model can infer everyting about these people. ",
                  "score": 5,
                  "created_utc": "2026-02-17 10:33:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5u3676",
          "author": "RepublicLiving5358",
          "text": "The fundamental issue with the idea of digital twins 'replacing' human respondents is that the LLMs that power these tools are more like libraries than people. This means that they are not that bad in predicting outcomes they have close matches for, but they often fall over when they have to predict beyond their training set. In tests I've run, the models are pretty good at reflecting values (e.g. if you tell them to roleplay as a Malaysian consumer, they are likely to cite their religious faith) but are poor at applying these values to actual decisions.\n\nDigital twins also struggle with scarcity economics. The profiles they have the most data for and find it easiest to simulate (i.e. the public) are the cheapest to reach out to. When a human respondent costs $2 and you can get 1000 of them in a day, any alternative will need to be very slick indeed.\n\nThis makes me think that digital twins will probably swallow up the most repetitive use cases (e.g. early stage ad testing, ideation) but will be mostly additive for other use cases (e.g. brand strategy).\n\nMy main concern is corporate power / C-suite capture: I currently have a brief from a very respectable brand who are asking for a \"full synthetic\" brand tracker because the CEO is excited about AI. The Insight Manager thinks it's a terrible use case but needs to show that they are not being obstructive, so we're designing a very complex trial that allows all parties to back out without embarrassment if it doesn't work.  ",
          "score": 2,
          "created_utc": "2026-02-17 08:49:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u5sgq",
          "author": "Ghost-Rider_117",
          "text": "super interesting idea! i've been working on similar stuff with synthetic respondents\n\n\n\nfew thoughts:\n\n\\- accuracy really depends on your training data. if you're modeling niche segments or emerging behaviors, your \"twin\" is basically just extrapolating from limited data\n\n\\- edge cases are where this falls apart ime. models tend to smooth out the weird/unexpected responses that sometimes matter most\n\n\\- i think this works best as a complement rather than replacement - use it for quick iteration and hypothesis testing, then validate with real panels for critical decisions\n\n\n\nbtw there's some research on \"agent based modeling\" in social science that's pretty relevant here if you wanna dig deeper",
          "score": 1,
          "created_utc": "2026-02-17 09:14:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vww37",
          "author": "Tim_Lidman",
          "text": "Interesting direction. I would frame it as augmentation, not replacement.\n\nBrands already question panel quality, so simulated outputs will face an even higher bar. Trust will hinge on back testing. If a digital twin predicts real world behavior better than a panel, people will listen. If not, it stays experimental.\n\nAccuracy is the hard part. Stated preferences drift. Context changes behavior. Incentives matter. A model that is “regularly updated” still depends on what people choose to report and what data you can legally use.\n\nWhere it likely breaks first is edge cases and novelty. Models extrapolate from history. Truly new products or cultural shifts are where human feedback still matters most.\n\nI could see this complementing research in early concept screening or rapid iteration, then validating with real respondents before big bets.\n\nThe bigger question might be organizational. Even if the models work, will insights teams trust something they cannot directly observe?",
          "score": 1,
          "created_utc": "2026-02-17 16:08:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xssql",
          "author": "ResearchGuy_Jay",
          "text": "interesting concept but i think it breaks down faster than people expect. the core problem is that human behavior isn't static. people change jobs, change priorities, have bad weeks, discover new tools. any model you build starts drifting from reality almost immediately. and  the whole point of research is catching the stuff you didn't predict. a simulation can only tell you things within the bounds of what you already know about someone. i work with startups on customer research and the most valuable insights almost always come from stuff i didn't expect. someone mentions a workaround nobody on the team knew about. someone describes the problem completely differently than we assumed. you can't simulate surprises.  where i think something like this could work is for quick directional stuff. like \"would segment A or segment B respond better to this positioning.\" basically replacing low-stakes quant surveys where you just need a rough signal. fine for that. but for anything where you actually need to understand why people do what they do, you still need to talk to real humans. and honestly talking to 10-15 real people gives you better signal than simulating 10,000 modeled ones in my experience. the recruitment overhead problem is real though. that part i agree with. but the fix is better recruitment tools and faster research methods, not replacing people with models.",
          "score": 1,
          "created_utc": "2026-02-17 21:32:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5z5ep0",
          "author": "No-Activity-1064",
          "text": "I feel like it's basically what GWI is?",
          "score": 1,
          "created_utc": "2026-02-18 01:47:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o620l5i",
          "author": "CompiledIO",
          "text": "I believe the future will be a mix of the two. People would still want to get feedback from real people but simulated data could streamline the process to the point where you can build great hypothysis and then go out in the real world to confirm it. \n\n[Revuloop.com](http://Revuloop.com) is heading in this direction and we already use AI to simulate \"Users\" taking your survey to give you feedback on your survey's design.",
          "score": 1,
          "created_utc": "2026-02-18 14:11:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63b6al",
          "author": "coffeeebrain",
          "text": "the idea is interesting but i think it runs into the same wall that synthetic data always hits... you're modeling based on past behavior, which means you're essentially predicting how people will respond to new things using old patterns. that breaks down fast for anything genuinely novel.\n\nthe trust question is the real one for me. brands already struggle to trust research outputs from actual humans. adding a simulation layer makes that harder not easier.\n\ni could see it working as a complement, like early stress testing before you run real studies. but replacing panels entirely feels like a stretch, especially for anything with emotional or contextual nuance.",
          "score": 1,
          "created_utc": "2026-02-18 17:48:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64xfbf",
          "author": "Business-Bandicoot50",
          "text": "A simulation of reality is always a simulation and not reality.  Accurate simulations need to know in advance the parameters and starting points (results) to provide meaningful simulations.  Ironically, that means you need to have done a larger study before creating the simulation.  The longer you run the simulation and the further it gets from just repeating what was inputed the wilder the outcome swings/ inaccuracy.  This was the fundamental finding from Chaos Theory.  What starts out looking right rapidly goes wrong.\n\nEngineers and operations researchers who invented the concept of digital twins know this, and they are constantly feeding real data back into their models and making short-term predictions on very tightly defined parameters. \n\nI've been running simulations and forecasting for a long time, and while predictions can look like the past, they almost always fail to predict real changes.   That is where qualitative/ expert judgement comes in to test 'what if'.  In short, humans can feel highly predictable at an aggregate level in retrospect.  ",
          "score": 1,
          "created_utc": "2026-02-18 22:13:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6rmm3",
      "title": "Best solutions for recruiting B2B respondents for Qual interviews",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1r6rmm3/best_solutions_for_recruiting_b2b_respondents_for/",
      "author": "Routine_Somewhere_85",
      "created_utc": "2026-02-17 00:52:43",
      "score": 6,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "I’ve been freelancing since getting laid off from a small research agency in May. I specialize in B2B qualitative research, mostly focused on technology/software. So far, the companies I’ve worked with have handled respondent recruiting, but I’m now preparing a proposal for a client with no prior market research experience.\n\nI’ve received quotes from a few recruiting firms I’ve used in the past for B2B audiences (e.g., IDR, IRG), but I suspect the client may hesitate at the cost ($490–$590 per participant given the recruit profile). As a result, I’m exploring more DIY options.\n\nI’ve used User Interviews before, but I’m unsure I could fully source my target sample there (\\~N=30). I also looked into LinkedIn Sales Navigator, though InMail limits and a tight timeline may constrain how many participants I can recruit through that channel.\n\nHas anyone had success with lower-cost / DIY recruiting approaches for B2B qualitative research? If so, what sources or methods worked best for you? Or, in your experience, is it usually better to focus on helping clients understand the value of professional recruiting?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1r6rmm3/best_solutions_for_recruiting_b2b_respondents_for/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o5u52we",
          "author": "RepublicLiving5358",
          "text": "Depends what you value your time at. DIY is a massive time-sink but is cheap if you have the time. Your day rate is probably higher than your recruiter's, so unless it's a really easy spec I'd focus on positioning the benefits they'd get from great recruits. I've sometimes focused on bringing to life just how long they will have with these important decision makers, contrasting it with how hard it is to get a meeting etc.",
          "score": 3,
          "created_utc": "2026-02-17 09:07:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ubpv2",
          "author": "silver70seven",
          "text": "Most B2B sample out there is limited to directors and below, still with highly suspect authenticity. Most suppliers will disgress from recruiting to qual because scammers will not opt in due to fear of being caught. iRG for example is a panel I would steer clear from. What target audience are you looking for?",
          "score": 2,
          "created_utc": "2026-02-17 10:10:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xvmq3",
          "author": "ResearchGuy_Jay",
          "text": "i'm in a similar boat. freelance researcher, mostly b2b startups. recruiting is always the hardest part. few things that have worked for me:\n\n1. user interviews is decent for some b2b segments but you're right that sourcing 30 from there alone is unlikely depending on the target. i usually get maybe 10-15 from there and fill the rest through other channels.  \n\n2. linkedin sales navigator works but it's a grind. the inmail limits are real. what i do instead is connect first with a short personal note, then message them after they accept. slower but better response rate than cold inmails.\n\n3. ask the client to share their own customer list or prospect list. even if they've never done research before they probably have contacts. warm outreach from their side converts way better than cold recruiting. sometimes i draft the outreach email and they send it from their account.\n\n4. industry slack groups and communities. depending on the software/tech niche there are usually active communities where you can post a recruiting ask. doesn't scale but the quality is usually good. on the cost question. $490-590 per participant is pretty standard for specialized b2b. i've found it's usually better to help the client understand why that cost exists rather than trying to cut corners on recruiting. bad participants waste way more money than expensive good ones. i frame it as \"you can pay $500 for a real conversation with your target buyer or waste 45 minutes talking to someone who isn't actually in your ICP.\"   \n  \nthat said for 30 participants i'd probably do a mix. professional recruiting for the hardest to reach segments and diy for the ones you can find yourself. keeps the total cost down without sacrificing quality on the important interviews.",
          "score": 2,
          "created_utc": "2026-02-17 21:45:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zhicp",
          "author": "AllTheHorsiesAreMine",
          "text": "I own a qual recruiting company, we do B2B all the time and work within client budgets as much is feasible based off the project specification. If you’d like to send me a message I’d be happy to look at specs and provide a ballpark idea! \n\nFor B2B to ensure authenticity you’ll need vetting, I’d recommend staying away from sites like User Interview it’s not a guarantee you’d find the right people. \n\nLinkedIn In mail marketing could work but it’s tough since so many people see those messages (yours truly) and ignore them 99% of the time. You’ll basically be throwing a dart at the board to see what sticks and follows through for the interview.",
          "score": 2,
          "created_utc": "2026-02-18 02:51:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63akyq",
          "author": "coffeeebrain",
          "text": "b2b qual at n=30 with a tight timeline is rough, especially for tech buyers.\n\ni've used cleverx for similar profiles and the match quality was better than i expected for b2b. worth looking at if you haven't.\n\nthat said honestly sometimes the professional recruiters are just worth it. two weeks of chasing bad leads adds up fast.",
          "score": 2,
          "created_utc": "2026-02-18 17:46:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63sw42",
          "author": "SouthSet7206",
          "text": "Trying to reach authentic B2B respondents through brute force via social media, etc., you’ll probably end up tossing at least half of your recruited participants because they’re not gonna pass your re-screening or you’re going to get on a call with them and realize that,  gosh, isn’t it interesting that 80% of our respondents all have the same accent? Hire a qual recruiting firm. The cost per complete might give you pause, but when you think about how much time you’re going to waste on bad respondents, you will likely realize it’s worth it.",
          "score": 2,
          "created_utc": "2026-02-18 19:06:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sb2bw",
          "author": "jelybely8",
          "text": "I've had good luck using Emporia for white collar recruits. They use LinkedIn and other professional networks to recruit. Costs are very reasonable.",
          "score": 3,
          "created_utc": "2026-02-17 01:01:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5t1d39",
          "author": "nk90600",
          "text": "those b2b recruiting quotes hit different when you're explaining them to a client who's never commissioned research before — $15k just to recruit before you even pay for moderation is a tough sell.\n\n\n\nthats why we simulate the screener and discussion guide with ai personas first, validate you're targeting the right people with the right questions, then spend the money on real recruits once the script is tight.\n\n\n\nhappy to share how it works if you're curious",
          "score": 1,
          "created_utc": "2026-02-17 03:41:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wkr9a",
          "author": "sk_queen",
          "text": "Zintro, Ivey Exec, Focus Crossroads are some qual B2B recruiters I’ve used for tech projects. …and even L&E can find some people through their gamer panel. CPR fees will vary.",
          "score": 1,
          "created_utc": "2026-02-17 18:05:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xvj9x",
          "author": "mijimijim",
          "text": "Respondent.io - similar to User Interviews, use both if you need a wider reach",
          "score": 1,
          "created_utc": "2026-02-17 21:44:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}