{
  "metadata": {
    "last_updated": "2026-02-06 09:09:58",
    "time_filter": "week",
    "subreddit": "marketing",
    "total_items": 17,
    "total_comments": 222,
    "file_size_bytes": 209611
  },
  "items": [
    {
      "id": "1qvkhp0",
      "title": "ChatGPT briefs are driving me crazy",
      "subreddit": "marketing",
      "url": "https://www.reddit.com/r/marketing/comments/1qvkhp0/chatgpt_briefs_are_driving_me_crazy/",
      "author": "CopySniper",
      "created_utc": "2026-02-04 09:54:49",
      "score": 211,
      "num_comments": 89,
      "upvote_ratio": 0.97,
      "text": "I'm a conversion copywriter.   \n  \nI've noticed an increasing number of my clients are using AI to write their briefs to me. I have a standard brief template but they'll either get AI to fill it out or they send me their own overlong, clunky, repetitive brief that has been written by ChatGPT.\n\nNot only does it take me longer to read the damn things because I have to wade through the same instructions repeated in 5 different sections, AI is garbage and tells me nothing meaningful. \n\nFor my VIP week clients I write the brief alongside them live in the first 60 minutes of their week and this works really well, however it's only possible because they've paid me upfront already. \n\nWhat process is everyone else using to account for the rise in nothingburger AI briefs? ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/marketing/comments/1qvkhp0/chatgpt_briefs_are_driving_me_crazy/",
      "domain": "self.marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3i6f3d",
          "author": "AutoModerator",
          "text": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-04 09:54:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i7kec",
          "author": "pickjohn",
          "text": "I have an ai that summarizes the brief submitted in my web form and then pulls some key bullets and sends an email asking them a question about one of the bullets to \"confirm\" the other key areas 😂. If you can't beat'em join'em. Most respond and actually take away one of the bullets. Only 50% answer the question in their first reply.",
          "score": 164,
          "created_utc": "2026-02-04 10:05:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jjjsg",
              "author": "BananafestDestiny",
              "text": "https://preview.redd.it/h5zlk60pvhhg1.jpeg?width=1200&format=pjpg&auto=webp&s=5573a898e88a039264d5c53c1356d33e3adc6d58",
              "score": 94,
              "created_utc": "2026-02-04 15:17:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3klbeq",
                  "author": "boomerbmr",
                  "text": "It’s like the people using ai to write their resume do it and be sorted and distilled by the ai doing the hiring. Ludicrous.",
                  "score": 6,
                  "created_utc": "2026-02-04 18:11:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3i9gv0",
              "author": "CopySniper",
              "text": "That is diabolical 😂 But clever.",
              "score": 37,
              "created_utc": "2026-02-04 10:22:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3jc105",
                  "author": "enjoi-it",
                  "text": "What are you guys talking about \"briefs\"? You send your clients a few questions for them to answer, they fill it out, send it back, and you create content from that \"brief\" ? Just trying to understand:)",
                  "score": 7,
                  "created_utc": "2026-02-04 14:39:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3joyn9",
              "author": "quantumjedi",
              "text": "Fighting fire with fire, I love this.",
              "score": 3,
              "created_utc": "2026-02-04 15:42:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3iat4v",
          "author": "Vidguy1992",
          "text": "Yep it's so ridiculous, I'm using AI to summarise unnecessary 10 page briefs that could be 1 page max.\n\nIt makes it so much harder to actually understand what they want with all this useless filler.",
          "score": 53,
          "created_utc": "2026-02-04 10:35:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ibeyf",
              "author": "CopySniper",
              "text": "A one page brief is much harder to write but produces much better output than a 10 page brief.\n\n\nI can remember when I was in agency land back when God was a boy, the veteran suits would write a 1 page brief for a $100 million dollar campaign and every.single.word meant something. \n\n\nStrategic constraint makes for good creative. ",
              "score": 59,
              "created_utc": "2026-02-04 10:40:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3iodfk",
                  "author": "gimmethelulz",
                  "text": "I always liked the quote, \"There’s not much to be said about the period except that most writers don’t reach it soon enough.\" Seems particularly apt these days thanks to AI garbage lol",
                  "score": 17,
                  "created_utc": "2026-02-04 12:24:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3inzmz",
                  "author": "Vidguy1992",
                  "text": "Beautiful. Every single word meant something is such a lost art now, it's volume and slop I hate it",
                  "score": 12,
                  "created_utc": "2026-02-04 12:21:40",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3ieybr",
                  "author": "Smoky_Ninja",
                  "text": "Gonna print and frame that last phrase in my office if you don't mind",
                  "score": 5,
                  "created_utc": "2026-02-04 11:11:41",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3khvmx",
                  "author": "Itsdawsontime",
                  "text": "TL;DR: Provide them with templates to help AI not be so AI and save the environment at least *a little bit* more.\n\n——\n\nIf you’re noticing it a lot, might i suggest talking with your team to meet them where they are? AI unfortunately is not going away any time soon, people are “wearing more hats” with layoffs, and not everyone has writing talent - so they do what they can. \n\n[typing quickly before a meeting, so hopefully the point comes across and you all can improve on language] \n\nWhat I would suggest is seeing if your org would agree if you can put together a “How to capitalize on AI to ensure the most complete and quickest turn around on briefs.”\n\nTest it with a friendly, open and willing client to see if they find the process easier and for feedback. Then, meet with clients and tell them that you are starting a new guide to help both teams ensure all details are captured or put it in your submission guidelines - \n\n“Here’s a guide to utilizing this brief and AI together to debate [insert sentence about making it simplest for both of us (clearly needs better wording)]. Using this document to then copy and paste details provides and expedited process to turnaround with less work for all those involved.\n\nWith organizations busier than ever, this is a time and money saving method.”\n\nProvide what they should input for a prompt, what key information should be provided to AI to ensure it outputs, and any other key details needed. \n\n**Why do this?** Minimize waste environmentally for your org and the clowns. I have built a number prompt templates for personal and professional use so I don’t waste as much energy with AI, and drastically expediting processes.",
                  "score": 2,
                  "created_utc": "2026-02-04 17:55:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3i7650",
          "author": "griselde",
          "text": "I have a client who died this. Even worse: they re-write my strategies and content sending back the blandest, emptiest, useless gpt-generated stuff that tells me they didn’t even put in a barely decent prompt. I wasted my time reading it just the first time, now I scan through it and go back to them with actual questions, asking them one by one so they don’t feel overwhelmed and don’t resort to AI.\n\nThat said, I am an AI rewrite away from dropping them entirely: I find it demeaning and a waste of my time.",
          "score": 15,
          "created_utc": "2026-02-04 10:01:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i9qtq",
              "author": "CopySniper",
              "text": "Oh God, I hate this. I now have it in my terms that I will not 'tidy' AI slop. It takes me way longer to try to make meaning from AI output than it does for me to write something good from scratch. ",
              "score": 11,
              "created_utc": "2026-02-04 10:25:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ipsgh",
          "author": "Radiant-Security-347",
          "text": "a couple years back we took on a client who needed a marketing plan and website. Dude gave me a 47 page brief. I’ve never seen anything like it in 37 years of being in business. \n\nit was written like it was for someone who knew nothing about web dev, typography, ux/ui - specifying everything from fonts to element placement to “must use Java…” When I asked about what the Java and Ajax requirements were for, he had no idea. \n\nThis was early in GPT history so it took me a bit to figure out it was written by GPT and never reviewed or proofed.\n\nI billed him $3k just to go through the brief. What a waste of time and energy for him. 95% of it was defenestrated.",
          "score": 10,
          "created_utc": "2026-02-04 12:34:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3mpfho",
              "author": "CopySniper",
              "text": "According to this AI brief \"all 4 of our key target audiences must be addressed on every page\". \n\nSigh. ",
              "score": 1,
              "created_utc": "2026-02-05 00:25:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3imjzk",
          "author": "drteq",
          "text": "“Why this matters now”",
          "score": 8,
          "created_utc": "2026-02-04 12:11:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jahq8",
              "author": "Jackdaw1989",
              "text": "What's the reference here? #outOfTheLoop",
              "score": 1,
              "created_utc": "2026-02-04 14:31:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3je2vl",
                  "author": "drteq",
                  "text": "It’s the most common ai summarization headline\n\nYou’re absolutely right!",
                  "score": 3,
                  "created_utc": "2026-02-04 14:50:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ij4w1",
          "author": "thesupermikey",
          "text": "“Sorry, you didn’t fill out my form. Once **you** have, we can talk about next steps”",
          "score": 6,
          "created_utc": "2026-02-04 11:46:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3j516i",
              "author": "emsumm58",
              "text": "this is what we do now. we made a form and they have to fill it out. at least we get the info we need / want",
              "score": 2,
              "created_utc": "2026-02-04 14:03:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3mpr6q",
                  "author": "CopySniper",
                  "text": "This is actually the best idea yet.\n\nI'll get my team to create a landing page with the brief as a form. Much easier for me to file, automate and manage too.\n\nBetter customer experience too as I can add tooltips.\n\nCan't believe I didn't think of it.",
                  "score": 3,
                  "created_utc": "2026-02-05 00:26:57",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3jfm5k",
          "author": "sonisonata",
          "text": "Oh my god, I completely agree! I am head of brand strategy at an agency that largely serves legacy B2B tech clients, and the sheer laziness is sometimes unbelievable to me. I generally end up rewriting the brief myself and asking for their approval. I’ve given templates, tips - hell, I even hosted a daylong WORKSHOP titled “how to write a winning brief.” \n\nNone of these things worked. I’m debating an executive position working in house at one of these corporations (got poached by a client); the upside is that I’ll be the only person on their team with enough strategic capability do these seemingly basic things. The incompetence / unwillingness at the top never ceases to amaze me though!",
          "score": 4,
          "created_utc": "2026-02-04 14:58:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ls2mc",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-02-04 21:31:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3ls2pw",
                  "author": "AutoModerator",
                  "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-02-04 21:31:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3me7e8",
              "author": "CopySniper",
              "text": "Right? When I was client side in brand strategy (I've worked both sides of the equation) I was taught that one of the most high-impact hard skills you needed to develop was to learn to distill insights into strategy and strategy into a solid agency brief.\n\nWe did almost none of the WORK work ourselves. When you're client side your two core hard skills are as a strategist and a project manager. What possible value are they providing their companies in 2026 when they wont even commit mental bandwidth to their BRIEFS. ",
              "score": 1,
              "created_utc": "2026-02-04 23:23:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3mzz9a",
                  "author": "sonisonata",
                  "text": "I think we are going to see a lot of mediocre manager positions evaporate in the next AI wave. Totally agree.",
                  "score": 2,
                  "created_utc": "2026-02-05 01:24:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ii4cq",
          "author": "PPC_Chief",
          "text": "It's frustrating because the clients themselves don't know what was written as they will not bother to read all that mountain of text. I think fight fire with, get your own AI to extract the key points and you send them client for confirmation so that you are both on the same page and you have that in writing.\n\nVery soon it will be my AI speaking to your AI, my AI speaking to their AI and their AI speaking speaking to my AI while we all just watch :)",
          "score": 6,
          "created_utc": "2026-02-04 11:38:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ii4ef",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 0,
              "created_utc": "2026-02-04 11:38:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3sr8d7",
          "author": "cTemur",
          "text": "Can't you use that at your advantage? Like adding question for ChatGPT like \"Ask the user about their ideal customer\" and stuff like that. ",
          "score": 2,
          "created_utc": "2026-02-05 22:21:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3syiju",
              "author": "CopySniper",
              "text": "Like have a GPT that asks the questions and based on the clients answers produces a brief? That's actually a pretty great idea. ",
              "score": 1,
              "created_utc": "2026-02-05 22:59:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3igcnr",
          "author": "hasits_thorns",
          "text": "Look for a new job. Copywriting is being taken over by AI. My best friend has a degree, worked at a good company for over 5 years, and they laid her off to move into AI and shrink the copy team (which was already just her and one other person). The only copy job she could find after that was literally training AI. She's since moved on to a new career path.",
          "score": 9,
          "created_utc": "2026-02-04 11:23:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ij8kf",
              "author": "thesupermikey",
              "text": "Ai copy performed significantly worse in every test I’ve done.",
              "score": 28,
              "created_utc": "2026-02-04 11:46:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3ja9rc",
                  "author": "SugoiHubs",
                  "text": "AI’s improving constantly. What you said was true for me a year ago but now I’m consistently getting control beating copy from Claude (ChatGPT sucks for marketing copy). I deal with video sales letters a lot - basically 15-20 min videos selling an offer. These used to take 2 months and $30,000 to produce and now they can be produced in 3 days using AI for like $100. They don’t convert as well initially but it’s still an optimal workflow because of how fast you can test and iterate. Anyone who’s a copywriter without additional marketing skills to fall back on in 2026 is legit fucked.\n\nEdit: I see we have a lot of salty frustrated copywriters in this sub.",
                  "score": -6,
                  "created_utc": "2026-02-04 14:30:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3iozuv",
              "author": "gimmethelulz",
              "text": "She's smart. I first stumbled into a marketing career about 15 years ago now. Even then it was pretty obvious that niche marketing roles were going away in favor of Jack of all trades type positions. That became even more obvious when I moved into being a marketing consultant at a digital marketing SaaS company. It felt like every year my clients were telling me about their marketing teams getting laid off or shrinking. People wonder why most marketing is shit these days. That's a big part of why.",
              "score": 6,
              "created_utc": "2026-02-04 12:28:39",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3isqjs",
              "author": "MissDisplaced",
              "text": "Yeah, my last job had several copywriters and they’re all laid off. Current company won’t hire any freelance copywriters because they think AI can do it. While AI is ok for writing some things - it’s better if you feed it something professionally written, like a whitepaper, and then ask it to format your emails, posts, blog, etc. from the larger piece. It’s a tool; it doesn’t really think.",
              "score": 10,
              "created_utc": "2026-02-04 12:53:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3jqny7",
                  "author": "Form_Function",
                  "text": "I think the real move is going to be having a professional copywriter at the helm of all ai generated copy so it can sort through what is needed. Almost like a curator. \n\nBut that’s not what I see in the industry. I see marketing teams laying off their content teams entirely and Sally the intern producing copy via Chat Gpt and it comes out either too long, repetitive, or just meaningless.",
                  "score": 2,
                  "created_utc": "2026-02-04 15:50:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3mg9s7",
              "author": "CopySniper",
              "text": "I'm actually busier than ever but I do sales copy, not content. I'm not sure how content writers are faring.   \n  \nWith model breakdown, AI is getting worse at writing in English at the same time that consumers are getting more discerning. \n\nI've also got 2 decades of experience and a solid track record of delivering significant ROI so that helps.  \n  \nI'm certainly not foolish enough to believe that it can't all come crashing down but people have been telling me I'm about to go out of business for 3 years and over that time my business has steadily grown. ",
              "score": 3,
              "created_utc": "2026-02-04 23:34:38",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3imyjz",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-02-04 12:14:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3imym5",
                  "author": "AutoModerator",
                  "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-02-04 12:14:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ilroq",
          "author": "lollllllops",
          "text": "Use AI to un-shitify the brief, send back to them as your ‘understanding’ and get them to sign off on your version.",
          "score": 2,
          "created_utc": "2026-02-04 12:05:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3iygdq",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-04 13:27:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3iygfh",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-04 13:27:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3j33o3",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-04 13:53:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3j33rr",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-04 13:53:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jebeb",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-04 14:51:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jebnh",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-04 14:51:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3lkpie",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-04 20:56:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lkpk2",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-04 20:56:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3lredh",
          "author": "Rell_Lauren",
          "text": "We use them at work and we're a Marketing org. It's frustrating because that's the job of copywriters, but apparently we don't have enough on staff so people bypass them. I mentioned this in an off-site to not use AI, but let out SMEs/agencies create copy. If it takes longer, it takes longer.",
          "score": 1,
          "created_utc": "2026-02-04 21:27:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3o9f4b",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 06:16:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3o9f71",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-05 06:16:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ofgwl",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 07:09:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ofgxs",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-05 07:09:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ojk9q",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 07:46:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ojkav",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-05 07:46:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3op93c",
          "author": "i-know-right-",
          "text": "Content generated using ai is truly garbage",
          "score": 1,
          "created_utc": "2026-02-05 08:40:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pdii6",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 12:17:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pdilc",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-05 12:17:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3perqd",
          "author": "Former_Tea1131",
          "text": "Use ai to analyse the brief and summarize action points...",
          "score": 1,
          "created_utc": "2026-02-05 12:26:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pvcf4",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 14:06:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pvchv",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-05 14:06:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qls17",
          "author": "QuantumWolf99",
          "text": "AI briefs are clients outsourcing the thinking you need them to do... they're paying you to convert prospects but won't invest 20 minutes articulating what makes their offer unique... start charging consultation fees to extract actual strategy or only work with clients who've already proven they understand their business well enough to brief you properly.",
          "score": 1,
          "created_utc": "2026-02-05 16:17:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3r8iig",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 18:02:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3r8ime",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-05 18:02:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3sscmc",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 22:27:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3sscoo",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-05 22:27:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3u4ts2",
          "author": "newdad710",
          "text": "Man, even worse than a brief is when they try to overruled your strategy with GPT. Ive had great success this year and am hitting on every AI Search or paid strategy that would be recommended. But they still think they can outsmart me by writing a one sentence prompt and that the punchlist they get is better. \n\n9/10 times the lost is what Im already doing. What they are already getting sent for review. What I have already ranked and acquired traffic for.... but they can't understand that Chat GPT doesn't actually do research h unless you ask it to.",
          "score": 1,
          "created_utc": "2026-02-06 03:04:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jagrb",
          "author": "SugoiHubs",
          "text": "Use AI to summarize.",
          "score": 1,
          "created_utc": "2026-02-04 14:31:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jkbwj",
          "author": "jarie",
          "text": "I use AI to summarize them and then have it ask critical questions about it. I then ask those questions or at least review what it said.\n\nI also use it for consistency checking since that’s usually the worse part about a brief.",
          "score": 1,
          "created_utc": "2026-02-04 15:21:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qx62cx",
      "title": "Super Bowl Ads Being Dominated by GLP-1 Drugs",
      "subreddit": "marketing",
      "url": "https://www.healthline.com/health-news/glp1-super-bowl-commercials-stigma-weight-loss-drugs",
      "author": "mcpoyles",
      "created_utc": "2026-02-06 03:00:56",
      "score": 168,
      "num_comments": 20,
      "upvote_ratio": 0.97,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "News",
      "permalink": "https://reddit.com/r/marketing/comments/1qx62cx/super_bowl_ads_being_dominated_by_glp1_drugs/",
      "domain": "healthline.com",
      "is_self": false,
      "comments": [
        {
          "id": "o3u49de",
          "author": "AutoModerator",
          "text": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 03:00:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3u6u3r",
          "author": "Practical_Draw_6862",
          "text": "That’s like saying why do so many different beers advertise, it’s all the same.\n\nThey just want you to keep popping pills.",
          "score": 33,
          "created_utc": "2026-02-06 03:16:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3u9h9d",
              "author": "PhAnToM444",
              "text": "GLP-1s are (we think) basically as close as we’ve gotten to a miracle drug since the smallpox vaccine though.\n\nIt’s not like this is an ad for Oxy, or that drug that helps you with constipation from taking too much Oxy.\n\nJust feels odd to complain about a rare thing in our society that is just unambiguously good.",
              "score": 12,
              "created_utc": "2026-02-06 03:33:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3usn75",
                  "author": "RadBrad4333",
                  "text": "I think there’s big difference between small box and a pill that makes you skinny though.\n\nI understand obesity is an epidemic in America but i don’t blame anyone for feeling weird the solution is something else to buy.",
                  "score": 4,
                  "created_utc": "2026-02-06 05:46:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3u7obc",
              "author": "mcpoyles",
              "text": "Yea but they are unique beer brands whereas these websites are all selling the same generic GLP-1. But I see your point.",
              "score": 3,
              "created_utc": "2026-02-06 03:21:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3u8en4",
                  "author": "Imaginary-Owl-3759",
                  "text": "There’s not much unique about bud light vs Michelob ultra vs coors light etc etc from a product perspective; they all taste the same, have the same CEPs, meet the same need, sit at similar price points. So they need to throw dollars at you to keep spending on theirs vs the others. It’s part of how bud light screwed themselves so hard - there was nothing irreplaceable about the product itself to keep people buying it.\n\nSame for GLP-1s; it’s a wonderful drug for companies right now. Hundreds of dollars a month per customer, likely lifetime need, get them in on your brand today and watch that recurrent revenue flow. \n\n(Said as someone who doesn’t mind the occasional beer and is taking a glp-1)",
                  "score": 5,
                  "created_utc": "2026-02-06 03:26:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3u975h",
          "author": "mctrees91",
          "text": "Who cares about distinguishing when you can reach 100+ million people at once. \n\nBlast the message - try to be the louder message that sticks in peoples minds more. \n\nAs you said, it’s the same product across the board, so what’ll separate them to a consumer is how they talk to them. If they stay out of the SB they’re essentially giving that space to the competitor.",
          "score": 7,
          "created_utc": "2026-02-06 03:31:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uu21g",
          "author": "Adventurous_Crab_0",
          "text": "Hey if you afford and want to lose weight, go for it. Honestly gave up on alcohol. Best thing ever.",
          "score": 3,
          "created_utc": "2026-02-06 05:57:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uhpzr",
          "author": "Pubsubforpresident",
          "text": "Ok so we get 60 minutes of football and 4 hours of all the side effects that this will kill you. Stop taking glp1 of you're allergic to glp1.",
          "score": 2,
          "created_utc": "2026-02-06 04:26:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uv9pq",
          "author": "_Bipolar_Vortex_",
          "text": "Ozympic is kickin’ Hollywood’s ass! - Kat Williams",
          "score": 2,
          "created_utc": "2026-02-06 06:07:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3u6iyb",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-06 03:14:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3u6j0a",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-06 03:14:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3utd6d",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-06 05:52:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3utd7i",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-06 05:52:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3utqtu",
          "author": "Haunting_Theory_8512",
          "text": "Tim Robinson in Rippling's has been my favorite this year hands down. That commercial was great.",
          "score": 1,
          "created_utc": "2026-02-06 05:55:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v9shg",
          "author": "zmoit",
          "text": "America has a fat problem.",
          "score": 1,
          "created_utc": "2026-02-06 08:15:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vdnjb",
          "author": "Jets237",
          "text": "Better than crypto or gambling ads",
          "score": 1,
          "created_utc": "2026-02-06 08:53:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uarw6",
          "author": "JC_Everyman",
          "text": "Best targeting for idiotically shallow fat Americans who are apathetic and don't bare nominal price.",
          "score": -7,
          "created_utc": "2026-02-06 03:41:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrabsq",
      "title": "I’m going from marketing associate straight to head of marketing.",
      "subreddit": "marketing",
      "url": "https://www.reddit.com/r/marketing/comments/1qrabsq/im_going_from_marketing_associate_straight_to/",
      "author": "queenfi_",
      "created_utc": "2026-01-30 16:33:02",
      "score": 74,
      "num_comments": 56,
      "upvote_ratio": 0.9,
      "text": "So I made a career pivot from being a healthcare professional for almost 10 years, to working in a junior marketing position for the past year. \n\nI’ve just been poached by a mutual connection to be their head of marketing, in an industry that blends all my career experience together. I’m getting really good vibes about the new company and I already have the offer letter, offering me a lot more financially and responsibility wise than my current role. I’ve made a list of the pros and cons and I’m heavily leaning towards taking the new role. There are no obvious red flags in my view. \n\nMy main hesitation is that this is a startup (higher risk) and I’m at a stage where I’m looking for stability due to where I’m at in my life.\n\nI’m also feeling intimated about stepping into such a senior position after a short period of time in this career, despite my broader professional experience. \n\nI’m not usually a risk taker but if I didn’t take this opportunity, I think I’d regret it. Has anyone made a similar leap? I know it’ll be a lot of work, but can you give me realistic advice about making this step?",
      "is_original_content": false,
      "link_flair_text": "Support",
      "permalink": "https://reddit.com/r/marketing/comments/1qrabsq/im_going_from_marketing_associate_straight_to/",
      "domain": "self.marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2mncxa",
          "author": "AutoModerator",
          "text": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 16:33:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2p777p",
          "author": "varit104",
          "text": "It really depends on the size and breadth of the ownership and the support system you’ll have in place. head of marketing can look very different at different companies and Marketing is such a broad field.\n\nMy main question/concern would be around will you be the ONLY marketing hire, or will you have support either above or below you? If you have support and are a humble, curious person willing to keep learning from those around you or your direct reports, I don’t think it’s that crazy. On the other hand, if you’re being asked to lead strategy and do everything yourself I’d be very concerned, particularly at a startup where work life balance can be difficult.",
          "score": 62,
          "created_utc": "2026-01-30 23:44:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2pieo1",
              "author": "therallykiller",
              "text": "We had a call center guy become a marketing director at a mom'n pop HVAC place.\n\nIt was also all of these things (pay, responsibility, title), but how will it scale?\n\nWhat if you job hunt and this transition is analyzed by recruiters and HR?\n\nAdditionally -- and only you'll know this -- if you're over your skis in this role (ill-equipped to deliver to expectations or excellence).\n\nBut you can learn anything -- as your experience has shown.",
              "score": 7,
              "created_utc": "2026-01-31 00:46:12",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2tg5ms",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-31 17:04:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2tg5pl",
                  "author": "AutoModerator",
                  "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-31 17:04:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2r721y",
          "author": "Jenikovista",
          "text": "The problem is that a Head of Marketing job is a lot different than an associate job, and startup execs are under INTENSE scrutiny from investors. \n\nYou will be held accountable for:\n\n* Go to market plans. \n* Generating revenue and scaling quickly\n* Building dashboards and tracking all key revenue and conversion KPIs.\n* Building out the marketing tech stack and choosing tools that will serve company through at least Series A until the B round, and working with engineers to build out your data workflows, automation, and tracking. \n* Hiring performance marketing and PR agencies (if you're lucky). \n* All product marketing, including collateral, sell sheets, FAQs\n* Website creation, photography, copy etc.\n* PR launches. Events. Email marketing. Social media.\n* Executive presentations and speaking scripts\n* Plus there's a good chance the CEO will treat you as an administrative assistant on top of everything else\n\nStartup marketing is crazy. Leading marketing for a startup will be one of the most high-pressure jobs of your life, and the rug can be pulled at any minute. It's a phenomenal experience but if you aren't prepared for all of that, I would let them find someone who is.",
          "score": 18,
          "created_utc": "2026-01-31 07:43:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2tkehe",
              "author": "Practical-Juice9549",
              "text": "I agree with this. I worked at a lot of startups in the tech space and marketing was always the scapegoat when things didn’t go well. Not saying that it will, as long as you feel confident that you can generate revenue and accomplish goals meeting KPI’s then I think you should be fine.",
              "score": 2,
              "created_utc": "2026-01-31 17:25:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2zna4c",
                  "author": "gawpin",
                  "text": "Yup, can attest to this. Marketing is the “fall guy” when things go bad, and the forgotten when things go well. 🙃",
                  "score": 5,
                  "created_utc": "2026-02-01 16:07:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2p9vqw",
          "author": "kubrador",
          "text": "you already took the job in your head, you're just looking for permission. the startup risk is real but you've got 10 years of professional credibility to fall back on, which most people jumping into head of marketing don't have. worst case you fail spectacularly and go back to being someone's marketing associate, which honestly sounds worse than failing upward.",
          "score": 10,
          "created_utc": "2026-01-30 23:59:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2pc8tq",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-31 00:12:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2pc8w1",
                  "author": "AutoModerator",
                  "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-31 00:12:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2p9ow4",
          "author": "Out3rWorldz",
          "text": "😂😂😂It’s always a start-up. The most meaningless title on a resume. 😂😂😂",
          "score": 20,
          "created_utc": "2026-01-30 23:58:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34lu3o",
              "author": "thebaddestbleep",
              "text": "True",
              "score": 2,
              "created_utc": "2026-02-02 09:17:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2p7kuq",
          "author": "chief_yETI",
          "text": ">this is a startup\n\nget out of there, **fast**\n\nedit: Wait a minute, this is a bot account isn't it",
          "score": 28,
          "created_utc": "2026-01-30 23:46:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33salo",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-02-02 05:00:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o33sani",
                  "author": "AutoModerator",
                  "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-02-02 05:00:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2rrogp",
          "author": "FiveFruitADay",
          "text": "Will you be the only marketing person there? What processes do they already have in place? How experienced are your team?\n\nI made the mistake of going from junior marketing to head of marketing for a small company and it's caused me so much stress. I entered a company who had no processes in place, no room for any kind of marketing budget and a fucked up CRM that is taking months to properly clean. I was told I'd have \"marketing support\" which essentially meant a dirt cheap agency in India who have no marketing knowledge whatsoever and unpaid interns. \n\nMy first ever job was a startup. The pay was awful but I loved it. The difference is that there were people there who knew what the fuck they were doing. The CEO wasn't afraid to bring in external support. There was clear communication",
          "score": 3,
          "created_utc": "2026-01-31 10:58:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sqyg1",
          "author": "pantrywanderer",
          "text": "The title matters less than what you are actually expected to own and how supported you will be. At early stage companies, head of marketing often means builder, operator, and firefighter all at once, not strategist with a team. The risk question is real, so I would get very clear on runway, expectations for the first 6 to 12 months, and what success looks like if things do not go perfectly. Feeling intimidated is normal, especially when the role jumps faster than the years suggest, but your prior career experience still counts a lot in leadership and decision making. If the company understands what they are hiring you for and you understand the tradeoffs, it can be a great learning curve. Regret usually comes more from unclear scope than from taking the risk itself.",
          "score": 3,
          "created_utc": "2026-01-31 15:01:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qmwa4",
          "author": "bluuuujayyyy",
          "text": "How much more $$ we talking?",
          "score": 2,
          "created_utc": "2026-01-31 04:56:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2r83mw",
          "author": "LBDazzled",
          "text": "No such thing as a stability / start-up combination.",
          "score": 2,
          "created_utc": "2026-01-31 07:53:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sou2m",
          "author": "stoplandingonmeflies",
          "text": "In a start up you’ll likely be doing a lot of work a junior Marketer would do any how so don’t worry.\nThey like your maturity perhaps and broader experience, hence the trust as a senior role. Go for it",
          "score": 2,
          "created_utc": "2026-01-31 14:50:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33snzy",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-02-02 05:02:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o33so1m",
                  "author": "AutoModerator",
                  "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-02-02 05:02:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2wsqot",
          "author": "NewBid9053",
          "text": "Think of it this way. You have skills you can fall back on if it goes pear shaped.",
          "score": 2,
          "created_utc": "2026-02-01 03:39:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32xt9i",
          "author": "SuccessfulKiwi415",
          "text": "If you want stability, go back to healthcare. Marketing is the opposite of stability for all but the top brands… and even then tenure of marketing executives is brief",
          "score": 2,
          "created_utc": "2026-02-02 01:55:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2q8ek9",
          "author": "Raidrew",
          "text": "First time?",
          "score": 3,
          "created_utc": "2026-01-31 03:19:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pjk7h",
          "author": "BusinessStrategist",
          "text": "Maybe start by getting on the “same page” about “expectations.”\n\nYou will report to?\n\nAnd this person has outlined the criteria used to evaluate your performance?\n\nWhat are the business goals and objectives? OKRs?\n\n\nYou now have a starting framework around which to “fill gaps” and “overcome obstacles.”",
          "score": 2,
          "created_utc": "2026-01-31 00:52:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rc5oh",
          "author": "WonkyConker",
          "text": "'promotion' - nice!\n\n'start-up' -...oh",
          "score": 2,
          "created_utc": "2026-01-31 08:31:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2poct7",
          "author": "willacceptpancakes",
          "text": "You’re totally fucked. This is not a reasonable career progression. \n\nIt’s gonna get stressful my friend.",
          "score": 1,
          "created_utc": "2026-01-31 01:20:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2p902t",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-30 23:54:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2p9055",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-30 23:54:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2qyejw",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-31 06:26:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qyelm",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-31 06:26:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2qzwl3",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-31 06:39:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qzwmi",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-31 06:39:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2r5hru",
          "author": "chaawuu1",
          "text": "Depending on how involved it is may really dictate how this goes. \n\nDo you have any direct reports? Are you expected do everything, vertically integrated as a one man show? Or do you have a copywriter, graphics person, etc? \n\nI'd say this should be your gauge because ultimately the head of a group wears many hats but you still need subject matter experts executing & sharing that responsibility.\n\nOf course as a startup it likely isn't the case, in which case you should cover yourself and explicitly mention because even just the things I mentioned can be entire departments in themself.",
          "score": 1,
          "created_utc": "2026-01-31 07:29:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2s0xj2",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-31 12:18:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2s0xkz",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-31 12:18:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2sf1oq",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-31 13:54:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sf1q0",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-31 13:54:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2tgti3",
          "author": "janenotdaria",
          "text": "Glass cliff.",
          "score": 1,
          "created_utc": "2026-01-31 17:07:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2tun42",
          "author": "Salt-Wear-1197",
          "text": "Wow that’s really nice :) i started at entry level marketing coordinator 4 years ago at a different company, 2 years ago did 5 rounds of interviews at my current company for a Marketing Manager level position only for them to pull the rug out at the 5th interview and say even though we went  with a different candidate for the manager position, we really liked you and want to offer you an associate position. (Huge red flag in hindsight). \n\nWhether or not I was really “ready” for manager level 2 years ago was arguable, sure. Now? I most certainly am after the extensive skill and knowledge gain ive accrued after being at this 2nd company for years and the marketing industry for 4. My knowledge and skill are vastly beyond the other associate level employees currently on the team. They’ve had me working the same workload as the other managers mind you because theyve said they want to promote me (another huge red flag, I know).\n\nThen comes last week, company wide review time where promotions are given out. My boss let me know she put me forward for promotion consideration last November. I know the timeline of 2 years at the company works at associate level to get to manager level because that’s exactly the timeline for one of my coworkers.\n\nThen, not only do I find out this shit company added in an extra step before manager level (senior associate) and that’s what I was under consideration for, its not up to my boss - it’s up to the executives. This is a huge company and I never interact with them. I do like and trust my boss shes great but the executives are shit. And my boss let me know this week that the executives decided to not promote me to senior associate at this time as they want to see more of how I work at this manager level workload.\n\nMind you I was handed the manager level workload 3 months after I was initially hired 2 years ago. \n\nSo anyways yeah I know they’re blatantly taking advantage of me, they’re blatantly taking advantage of a lot of people at this company. And every time I doubt myself whether or not I’m really qualified to be at manager or senior manager or higher level, I look at some of my peers in marketing who are my same age and have my same years of experience and they are higher than me, and I remember that I have legitimately been working at manager level for 2 years now, just haven’t had the title. Oh and this company was about to hire me at manager level 2 years ago too.\n\nI’m hot on the job search, I have a very strong lead for manager level and I’m trying to get the fuck out of this shit place asap. I really, really want to leave this company high and dry with the conference I’m managing and not even give them my 2 weeks after this slap in the face - and for so many other reasons, a laundry list of grievances against this company and how they don’t treat me or any of us working there right. I hope this strong manager lead goes somewhere and then I’m gone in just a few weeks.\n\nMy point is: don’t be worried about whether or not you can handle it. If you like marketing, take this position. Being a head of a marketing team will be amazing for your resume and experience, and if you find you don’t like it and want a more low-stress option, you can do that later. With this under your belt, you’ll be able to pretty much do whatever level role you want in marketing forever after. That’s my advice since you’re at this early stage.",
          "score": 1,
          "created_utc": "2026-01-31 18:13:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2u6ltq",
          "author": "oblivionrpg",
          "text": "Head of marketing means you manage people. This is the hardest part. I went from digital marketing specialist to CMO and now I am CCO. Went from managing 0 to 4 to 15 right now (6 directly). They need to respect you and trust you. This is the key. \nAlso, you need to know your main KPI - is it turnover? You need to think about your team like puzzle which together creates the result. \nAnd also.. Don’t be weak..",
          "score": 1,
          "created_utc": "2026-01-31 19:10:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wc4ja",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-01 01:57:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2wc4lb",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-01 01:57:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o31cb3m",
          "author": "Intelligent_Mango878",
          "text": "It sounds like you are on the fence and with good reason!\n\nHigh risk.....High Reward for someone who claims minimal experience in marketing. \n\nIf this is healthcare, how much marketing is there really and how bored might you become?\n\nIf you can get back in marketing somewhere else (junior, not senior) and have the finances to support yourself for 6 months till that happens, go for it!\n\nOtherwise stay where you are and work your way up.\n\nThere are no overnight successes ANYWHERE. Everyone pays their dues (unless they are nepo babies).",
          "score": 1,
          "created_utc": "2026-02-01 20:50:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31xicj",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-01 22:34:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31xiix",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-01 22:34:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o32s79e",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 01:23:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32s7bg",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-02 01:23:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o33sr8z",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 05:03:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33srak",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-02 05:03:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3a9buq",
          "author": "Putin_inyoFace",
          "text": "Must be nice. I’ve been in marketing for 10 years at shitty add biotech start ups and I keep getting dicked around given specialist roles. \n\nThis industry is killing me. Physically. Mentally. Emotionally.",
          "score": 1,
          "created_utc": "2026-02-03 04:03:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2p6eqb",
          "author": "AdamYamada",
          "text": "What is the expectation to grow the marketing for this startup? \n\n\nI assume it's Healthcare SaaS? ",
          "score": 1,
          "created_utc": "2026-01-30 23:40:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrz41r",
      "title": "cold drink poster",
      "subreddit": "marketing",
      "url": "https://i.redd.it/z4rg2hbayngg1.jpeg",
      "author": "reddishgreen_",
      "created_utc": "2026-01-31 10:39:11",
      "score": 62,
      "num_comments": 17,
      "upvote_ratio": 0.85,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/marketing/comments/1qrz41r/cold_drink_poster/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2rpjkv",
          "author": "AutoModerator",
          "text": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-31 10:39:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rw6ee",
          "author": "Imaginary-Owl-3759",
          "text": "3D and other attention grabbing out of home is always fun. \n\nSpecsavers do some really simple, clever, funny stuff.",
          "score": 13,
          "created_utc": "2026-01-31 11:39:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sandm",
              "author": "reddishgreen_",
              "text": "yeah, i really liked what they did with the boder/outline",
              "score": 1,
              "created_utc": "2026-01-31 13:27:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ry2b8",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-31 11:55:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ry2dk",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-31 11:55:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2s5oc9",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-31 12:54:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2s5oh0",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-31 12:54:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2yfe14",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-01 11:46:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yfe2h",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-01 11:46:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2yj1rs",
          "author": "PossibleFirm7095",
          "text": "I LIKE this",
          "score": 1,
          "created_utc": "2026-02-01 12:16:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z30mq",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-01 14:26:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2z30q5",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-01 14:26:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o34zv90",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 11:27:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34zvad",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-02 11:28:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3o40js",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 05:33:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3o40lb",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-05 05:33:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pjxi7",
          "author": "jpisafreakingbeast",
          "text": "That is interesting!",
          "score": 1,
          "created_utc": "2026-02-05 13:00:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qumg37",
      "title": "Burned out in startups, what marketing roles value broad experience without constant chaos?",
      "subreddit": "marketing",
      "url": "https://www.reddit.com/r/marketing/comments/1qumg37/burned_out_in_startups_what_marketing_roles_value/",
      "author": "Baybeli",
      "created_utc": "2026-02-03 08:21:07",
      "score": 62,
      "num_comments": 33,
      "upvote_ratio": 0.97,
      "text": "Every startup I join somehow feels more extreme than the last. I now work at a tech startup. I’m juggling an absurd amount of work, constantly context-switching, owning way too many things at once, and I’ve been overwhelmed for… honestly, about a year now. I’m exhausted and unhappy, and I’m tired of feeling like I’m always complaining about my job but I genuinely don’t know how much longer I can do this.\n\nThe thing is: I know I’m good at what I do. I work in marketing, but I’m not a deep specialist in one narrow area. Instead, I’ve done pretty much everything over the years: strategy, content, brand, PR, events, social, working with agencies and freelancers, project managing, firefighting, all of it. Mostly because I had to. I understand how long things actually take, what resources are needed, how things should be structured, and what breaks when they’re not.\n\nBut I’m so tired of doing the jobs of 10 people in environments with constant ambiguity, changing priorities, and zero follow-through from others. The “everything is urgent, everything keeps changing” culture is completely frying my brain.\n\nYesterday was kind of a breaking point. I had a meeting where I suddenly just… blanked. I was supposed to explain something fairly basic — the goal of a press release and the story behind it. But after weeks of constant story changes, lack of decisions, people not doing what we agreed on, and me juggling a million things at once, I genuinely didn’t know what to say anymore. I realized I don’t even know what our story is right now. My brain just shut down.\n\nThat scared me, because I’ve always been high-functioning and resilient. But now it feels like my brain is overloaded and I can’t structure things properly anymore.\n\nSo my question is: if I start looking for another job in marketing, what kinds of roles should I be looking for? Ones where broad experience is actually valued but where I don’t have to live in constant chaos or sacrifice my health. I don’t want to grind myself into the ground anymore. I just want a normal, sustainable workload with clearer structure.\n\nIf you’ve been through something similar or made a move out of this kind of environment, I’d really appreciate hearing what worked for you.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/marketing/comments/1qumg37/burned_out_in_startups_what_marketing_roles_value/",
      "domain": "self.marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3c01l4",
          "author": "ayhme",
          "text": "You go work for a larger company. \n\nRoles are hard to get currently.",
          "score": 50,
          "created_utc": "2026-02-03 12:48:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pia62",
              "author": "ActuallyIndianAI",
              "text": "should be super grateful to have a job in marketing at all, marketers currently have the fiercest competition in job market rn",
              "score": 2,
              "created_utc": "2026-02-05 12:49:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cdoiu",
          "author": "Dramatic_Raisin",
          "text": "You could try marketing in higher Ed, that’s where I started. Very calm, practically built for generalists. But the pay is abysmal, unfortunately. I really liked the work though and you wouldn’t believe some of the cool shit you could get to do",
          "score": 20,
          "created_utc": "2026-02-03 14:07:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3dziu1",
              "author": "dougielou",
              "text": "Same with non-profit work.",
              "score": 5,
              "created_utc": "2026-02-03 18:42:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3kibf6",
              "author": "Gonzzz",
              "text": "Especially if you have kids and the school offers free tuition to dependents. ",
              "score": 1,
              "created_utc": "2026-02-04 17:57:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3mbgcm",
                  "author": "Dramatic_Raisin",
                  "text": "Seriously. The school I worked for offered 75% off for dependents, even that is significant.",
                  "score": 2,
                  "created_utc": "2026-02-04 23:08:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3c7zcm",
          "author": "alone_in_the_light",
          "text": "I've been avoiding startups for many years. My experience has been more related to big companies. And, more recently, to academia. \n\nBut my problem is not with startups by itself. Startups used to be great. But now too many of them don't even assume they are startups and think they are mature. And too many startups are treating people like laptops. Expensive in the beginning, but then overworked until they break and are replaced by a newer model.\n\nAnd it doesn't mean that other companies are necessarily good. There are big companies that are basically a bigger chaos.\n\nSo, it's not about the roles to me. But targeting the right companies for me. Often, with networking being an important part of the process to get those jobs.",
          "score": 18,
          "created_utc": "2026-02-03 13:36:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c7hyo",
          "author": "blackboyx9x",
          "text": "It's simple. You need to find a bigger company with more structure. Also, decide if you want to specialize in something or become more of a strategist.",
          "score": 15,
          "created_utc": "2026-02-03 13:33:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c3ywy",
          "author": "Captain_Softrock",
          "text": "Be smart and take your time finding a new role. I can tell you I’m at an established large nonprofit right now and it feels exactly how you’re describing. I know it shouldn’t, but that’s the way leadership has made it. Just because you’re at a larger company doesn’t guarantee it will be different. Interview, get a feel for various companies, give yourself time in this environment. I recommend a professional coach, or maybe even a therapist to help you deal with chaos now to get to your ideal next. Good luck!",
          "score": 10,
          "created_utc": "2026-02-03 13:13:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cnzx7",
          "author": "postgradcopy",
          "text": "I went from head of marketing at a seed stage startup where I was doing essentially this to a product marketing role at a large asset manager. \n\nThe hours aren’t much better, but the pay is. And the best part is that there’s a somewhat clear line of upward progression, managers that actually know how to manage, and timelines that are somewhat doable. \n\nIt was a pain to switch because the startup was unknown. The things that worked for me were:\n* Focus on the niche that you’re already working in\n* Network like crazy and ask for referrals (literally ask the person to email the HM to vouch for you)\n* If you don’t have a referral, try to figure out the HM or someone in the role already and send them an email about why you’d be a great fit. \n\nIt took me about 8 months to find a director level role. I would expect it to take a bit longer now given how roles have dried up.",
          "score": 10,
          "created_utc": "2026-02-03 15:02:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cjthf",
          "author": "The_Hoff901",
          "text": "Yeah, my Series C startup was recently acquired by a multi-billion dollar company. It’s been two months and I’m basically being told to do optional onboarding training and start looking into events/campaigns for H2 as there are already a ton of events in flight and product packaging and narrative is still being worked out. \n\nNot having a ton to do is causing me some anxiety as I have always been a visibly high performer, but I’m enjoying having more free time for hobbies, puttering around the house. \n\nIf you’re burnt out, I’d look at big tech if you can get in. \n\nI’m going to see how things shake out and enjoy some vesting equity, but I’m also missing the hustle of startups. And the lotto tickets from early stage meaningful equity grants.",
          "score": 8,
          "created_utc": "2026-02-03 14:40:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3e518m",
          "author": "atrain714",
          "text": "I'm in the same boat. Actually thinking of starting my own company. Now all the chaos will be my own doing lol",
          "score": 5,
          "created_utc": "2026-02-03 19:07:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3enele",
          "author": "Logical_Bite3221",
          "text": "Non-profit can be just as bad as startups. A lot of red tape and a lot of the time just as disappointing of a group to work with.",
          "score": 5,
          "created_utc": "2026-02-03 20:34:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gznhe",
          "author": "janenotdaria",
          "text": "It’s not you, startups and foundoooooooorrrssss *are* getting worse and startup culture is rotting every enterprise to bits.",
          "score": 4,
          "created_utc": "2026-02-04 04:02:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ohmpb",
              "author": "jamiefox23",
              "text": "This!! So true. Left my very stable MNC job for a startup, expecting exposure and growth. And boy, oh boy, I did grow, but the prize I had to pay was steep. Quit the job in December, the best decision that id made in a while.",
              "score": 1,
              "created_utc": "2026-02-05 07:28:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cb3t3",
          "author": "NaturalSelecty",
          "text": "I used to also be a generalist, but figured focusing on specializing in paid ads is more likely to increase earning potential and open up better opportunities. It also creates a higher barrier to entry. Ditch a startup and work for an established company. \n\nMany of the YouTube university marketers (tons in this subreddit) flooding the market can’t easily move into these roles since they often require a degree which is a huge plus.",
          "score": 7,
          "created_utc": "2026-02-03 13:53:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hhx3c",
          "author": "polygraph-net",
          "text": "Larger companies bring their own problems - boredom, politics, bureaucracy, HR departments…\n\nSounds like you need a holiday and a heart to heart with your boss. \n\nThe economy is bad, and it’s going to get worse (we’re headed for a terrible depression) so don’t quit until you have another job.",
          "score": 2,
          "created_utc": "2026-02-04 06:12:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3is7rs",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-02-04 12:49:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3is7ty",
                  "author": "AutoModerator",
                  "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-02-04 12:50:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3hpujk",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-04 07:20:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hpulg",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-04 07:20:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hsimf",
          "author": "Ashley_said_what",
          "text": "You’d do so well in an agency given all the areas you’ve worked in before. But also unrelated question and hope someone can respond to this - do startups pay more than established companies? I’m curious why people choose them esp given that you have to do multiple people’s work with not many resources",
          "score": 1,
          "created_utc": "2026-02-04 07:44:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i4pn8",
              "author": "Happy_N_Mountains",
              "text": "Getting into a startup is typically much easier to join than a large established company.",
              "score": 1,
              "created_utc": "2026-02-04 09:38:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3o70j8",
              "author": "TaurusMoon007",
              "text": "For me, I prefer the autonomy that comes with a startup. I’ve had equity in the last two brands I worked (though they didn’t amount to anything while I was there) and most importantly, I’m either remote or hybrid.",
              "score": 1,
              "created_utc": "2026-02-05 05:56:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ipg2l",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-04 12:31:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ipg5o",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-04 12:31:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3j1g2d",
          "author": "Fred-swe",
          "text": "Aim for a role within your comfort zone for a few years. Where you can excel more easily",
          "score": 1,
          "created_utc": "2026-02-04 13:44:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jirp1",
          "author": "kubrador",
          "text": "look for marketing manager/coordinator roles at established companies or mid-size b2b firms. they're boring in the best way possible. your broad experience makes you overqualified, which means you actually own fewer things and have budget/headcount to delegate instead of doing it all yourself.\n\nfortune 500 marketing departments, insurance companies, enterprise software, healthcare. places where the chaos comes from bureaucracy not uncertainty. you'll miss the \"impact\" but you won't miss the burnout. the job posting will say \"3-5 years experience\" and you'll be the most experienced person on the team, which is the vibe you want right now.",
          "score": 1,
          "created_utc": "2026-02-04 15:13:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3lljgl",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-04 21:00:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lljk1",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-04 21:00:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3u8rcy",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-06 03:28:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3u8rer",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-06 03:28:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1quleis",
      "title": "Passed second interview: worried company is toxic",
      "subreddit": "marketing",
      "url": "https://www.reddit.com/r/marketing/comments/1quleis/passed_second_interview_worried_company_is_toxic/",
      "author": "Starlyns",
      "created_utc": "2026-02-03 07:17:18",
      "score": 50,
      "num_comments": 53,
      "upvote_ratio": 0.89,
      "text": " Today was second interview with lets say comp A. They are large 1000 to1500 employess in diff states. Their own skin products and medical offices. So a lot of income and room to grow and marketing opportunities.  But the job description said $65k for marketing director which seemed too low. Red flag 1. They have no linkedin profile as company. Red flag 2? No glassdoor profile so no reviews there red flag 3. So used ai to find any and found they have 2.7/5 in indeed 300+ reviews from staff.  \nThe person that interviewed me was the CMO.\n\nIdk if am walking into a trap. \n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/marketing/comments/1quleis/passed_second_interview_worried_company_is_toxic/",
      "domain": "self.marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3brzun",
          "author": "Doinganart",
          "text": "I disagree with the other poster. a company with 1000-1500 employees that has no linkedin presence not even for just employer branding, and a marketing director role at just 65k? In that size company? I would trust your gut, unless you are desperate in which case just take it and immediately start looking for something else.",
          "score": 141,
          "created_utc": "2026-02-03 11:51:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3bxecm",
              "author": "azuresou1",
              "text": "Forget the salary for a second. \n\nHow TF does a company have 1k+ 'employees' yet not have a LinkedIn page? While they sell both skin products and have medical offices? \n\nThis screams at best MLM and at worst some elaborate type of scam. I'd avoid.",
              "score": 73,
              "created_utc": "2026-02-03 12:30:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3bsesp",
              "author": "polygraph-net",
              "text": "Look at her post history. She's long term unemployed and \"desperate\". She isn't in a position to be so picky.",
              "score": 8,
              "created_utc": "2026-02-03 11:54:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3dx0te",
                  "author": "Starlyns",
                  "text": "I am however  they are 3 other companies am intwrviewing this same week",
                  "score": 5,
                  "created_utc": "2026-02-03 18:31:24",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3bxhcl",
          "author": "dandesim",
          "text": "It’s an MLM",
          "score": 53,
          "created_utc": "2026-02-03 12:31:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cd71m",
              "author": "coljung",
              "text": "Definitely. “Skin” products should be a clear indication of this considering the lack of public visibility in LinkedIn and other platforms.",
              "score": 15,
              "created_utc": "2026-02-03 14:05:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3bvpq3",
          "author": "JohnMaddn",
          "text": "65k/y is a joke. It's a junior marketing assistant level salary. Negotiate 4 days a week or a rev share bonus.",
          "score": 29,
          "created_utc": "2026-02-03 12:18:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3byd08",
          "author": "Captain_Softrock",
          "text": "For a for-profit of that size, a marketing director should earn roughly double that. $65,000 is typically close to what a junior marketer would earn with 2 or 3 years of experience. (I’ve worked in marketing for 20 years and routinely hire people at my job)",
          "score": 13,
          "created_utc": "2026-02-03 12:37:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bvwmu",
          "author": "Mamashahk",
          "text": "Sounds super sketchy. I would trust your gut. Just for reference. I’m at a company with a quarter of that many employees as a MD, clearing 200k in the Boston area.",
          "score": 7,
          "created_utc": "2026-02-03 12:20:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3byf65",
          "author": "NaturalSelecty",
          "text": "Walk away. $65k for a marketing director role is laughable. I make more than that in a basic paid ads specialist role.",
          "score": 5,
          "created_utc": "2026-02-03 12:37:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c3uru",
          "author": "mimis-emancipation",
          "text": "If you don’t have another job at the moment, take it because it’s still money coming in. And if it’s w2, you’re contributing to your unemployment benefits.",
          "score": 3,
          "created_utc": "2026-02-03 13:12:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cb7fo",
          "author": "Kataboo666",
          "text": "65k is a salary for someone low or mid level in marketing depending on where they live. i’d pass, even if it is a real company you’ll probably be doing more work than the moneys worth",
          "score": 3,
          "created_utc": "2026-02-03 13:54:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c1yxx",
          "author": "Pristine_Battle_2636",
          "text": "This doesnt sound like a real company. If they have that many employees they will have a linkedin since so many people have it on their profile. This is way too low of a salary for that job. Director should be making double that at least.",
          "score": 6,
          "created_utc": "2026-02-03 13:00:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c2806",
          "author": "blackboyx9x",
          "text": "Run for your life. This is sketchy.",
          "score": 5,
          "created_utc": "2026-02-03 13:02:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c4qq7",
          "author": "cornelmanu",
          "text": "No LinkedIn profile and no Glassdoor, is out for me. Sounds super shady",
          "score": 4,
          "created_utc": "2026-02-03 13:17:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cxahb",
          "author": "thesecretmarketer",
          "text": "Call them out on it. Ask them the company structure. Who owns it. What other names has it been known by. Have you looked at the LinkedIn profiles of the people who interviewed you?",
          "score": 2,
          "created_utc": "2026-02-03 15:46:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c2jlz",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 13:04:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c2jos",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-03 13:04:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cfd8a",
          "author": "Bentheredonethat_",
          "text": "This sounds like a roach company. Look them up.\n\nThey offer higher position marketing titles like  manager or lead and when you talk with them about the actual job they'll have you selling an MLM product door to door. Complete scam.",
          "score": 1,
          "created_utc": "2026-02-03 14:17:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cud3j",
          "author": "Quick_Dot_9660",
          "text": "I would look in further although I do agree with everyone else that there are alot of red flags here. While it may not be an MLM in the literal sense, I'd enquire about their use of 'direct marketing' which is essentially corporatised MLM practices. \n\nThis -at least to me- reads recent rebrand as I think indeed let's you take over your previous accounts, whereas Glassdoor you've got to make a new account for every new name (I could be wrong about this it's been a while) \n\nI'm not US based so idk about the salary but in my experience fashion, health and beauty tend to advertise cheaper as they are 'desirable' fields so attract more talent. \n\nI'd trust your gut more than anything, if you're recognising red flags it's from your own experience I'd take a critical eye to the indeed reviews more than anything and maybe look up some former employees on linkedin.",
          "score": 1,
          "created_utc": "2026-02-03 15:33:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cyvqp",
          "author": "HoytG",
          "text": "Trust your gut",
          "score": 1,
          "created_utc": "2026-02-03 15:54:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dlift",
          "author": "BC122177",
          "text": "I saw this listing and as soon as I saw that “salary range” and skin care industry, I had a feeling it’s some sort of scam or MLM. \n\nI got sucked into one of those MLM interviews once. Everything as far as the listing went looked legit. It was a marketing role. Cant remember the exact title but there was nothing indicating it could be a scam. So I applied and got an interview. Turned out to be a “group” interview. Once the interviewer mentioned “you could be your own boss in a short time. Wouldn’t you like that?!” I hung up.",
          "score": 1,
          "created_utc": "2026-02-03 17:39:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dvtbv",
          "author": "Starlyns",
          "text": "More context: they are a medical network. Have their own skin products. 100+ local offices to take care of patients. Doctors nurses medical staff etc. Do is not an mlm or some scamm.\n\nThe red flags are all previous and the so many bad reviews staff and patients have left about local offices threatment. \n\nIt could be CMO wants some seo specialist/ social media person to hands on the daily tasks but give the marketing manager title.\n\nI asked for $175 and he said you better be worth it. as I know what am bringing to the table. If they let me do my job am sure they will see a mayor increasement in sales and lead generation. \n\nJust worried they hire and then say theres no budget for anything or limit everything I do.",
          "score": 1,
          "created_utc": "2026-02-03 18:25:58",
          "is_submitter": true,
          "replies": [
            {
              "id": "o3etz5x",
              "author": "Physical_Crow_8154",
              "text": "I mean go to the interviews and see where they lead if you’re unemployed. Why not? The fact that no one’s on linkedin is ridiculous. I’m in a sales dept and most salespeople will at least try to use LinkedIn for outreach",
              "score": 1,
              "created_utc": "2026-02-03 21:04:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3e08s1",
          "author": "ferocious_coug",
          "text": "Run.",
          "score": 1,
          "created_utc": "2026-02-03 18:45:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3e1o6l",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 18:52:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3e1o9f",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-03 18:52:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ec6fx",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 19:41:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ec6is",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-03 19:41:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3fpisf",
          "author": "bridler",
          "text": "It’s 💯scam / MLM / pyramid scheme. Ghost them.",
          "score": 1,
          "created_utc": "2026-02-03 23:40:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3heiyf",
          "author": "Logical_Bite3221",
          "text": "Oh this for sure is an MLM. If it’s in UT or a UT based company it’s definitely an MLM. FL and TX are states with the second most MLMs. Ask them if it is one and if they give you any garbage about it being “direct marketing” it’s an MLM. \n\nMarketing director for $65K is ridiculous. But a job is a job and if you need to take something to bring in income while you find something better then take it. I would just recommend not updating your LinkedIn profile or resume with that role.",
          "score": 1,
          "created_utc": "2026-02-04 05:45:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i143z",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-04 09:04:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i145s",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-04 09:04:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ld3by",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-04 20:19:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ld3eu",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-04 20:19:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3rgdys",
          "author": "theVirginAmberRose",
          "text": "Really how badly you need a job. I worked in a lot of different industries and I tell you almost every job has a level of toxicity",
          "score": 1,
          "created_utc": "2026-02-05 18:39:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3rm7tn",
              "author": "Starlyns",
              "text": "Yes of course. I have another line up for 90k that are more responsive but their niche products are B2B industrial so am alittle worried will be totally different from all I done before.",
              "score": 1,
              "created_utc": "2026-02-05 19:05:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3breyd",
          "author": "polygraph-net",
          "text": "I don't really agree with any of this.\n\nIt's an employers job market right now and marketing roles are considered low value. $65k is a good salary depending on the location. **The days of giant marketing salaries are coming to an end**.\n\nCompanies don't need to have LinkedIn profiles.\n\nCompanies don't need to have Glassdoor profiles.",
          "score": 4,
          "created_utc": "2026-02-03 11:46:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3bv7kv",
              "author": "DarthKinan",
              "text": "False. At a company of this size directors should be clearing 100K on the low end. This company doesn't value marketing and that's clear. They're looking for someone green so they can give them an inflated title and work them to the bone before eventually firing them. \n\nDon't undersell marketing. Companies who understand the value of marketing are investing in putting together the best in teams they can right now.",
              "score": 0,
              "created_utc": "2026-02-03 12:15:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3c1cb7",
                  "author": "polygraph-net",
                  "text": "We don't know the location.\n\nAlso, in this economy, marketing roles are dead.",
                  "score": 2,
                  "created_utc": "2026-02-03 12:56:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3dyb1u",
              "author": "Starlyns",
              "text": "New jersey. They are  large medical network that includes their own skin products. \n\nThey have a CMO which means he might be getting paid 200+",
              "score": 1,
              "created_utc": "2026-02-03 18:37:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3c64ge",
          "author": "arkitector",
          "text": "Run. Not even for the lack of LinkedIn and Glassdoor presence, but because $65k is what a junior marketing coordinator makes. If you’re truly shooting for a director role that would be $120k or higher depending on location.",
          "score": 0,
          "created_utc": "2026-02-03 13:25:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qv9kaf",
      "title": "Example of persuasive marketing in modern politics.",
      "subreddit": "marketing",
      "url": "https://i.redd.it/xtr9azc6idhg1.jpeg",
      "author": "Out3rWorldz",
      "created_utc": "2026-02-04 00:34:30",
      "score": 49,
      "num_comments": 11,
      "upvote_ratio": 0.9,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/marketing/comments/1qv9kaf/example_of_persuasive_marketing_in_modern_politics/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o3fzf5z",
          "author": "AutoModerator",
          "text": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-04 00:34:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g0us0",
          "author": "Volcano_Jones",
          "text": "It's not persuasive. It's called lying and manipulation.",
          "score": 36,
          "created_utc": "2026-02-04 00:42:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g0h8w",
          "author": "FTblaze",
          "text": "Thoughts? Goebbels would be proud.",
          "score": 17,
          "created_utc": "2026-02-04 00:40:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g3t99",
          "author": "The_Paleking",
          "text": "Mt is a metric ton.\n\nIn some contexts this may be noteworthy.\n\nA bar graph can indeed be misleading.\n\n1% can be a meaninful improvement metric, but best left at just that.",
          "score": 11,
          "created_utc": "2026-02-04 00:58:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g0vzp",
          "author": "Competitive_Dance478",
          "text": "People read less nowadays, or have shorter attention span \n\nThey see the text and the big gap between red and green and they move on",
          "score": 5,
          "created_utc": "2026-02-04 00:42:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g0s7u",
          "author": "TeslasAndComicbooks",
          "text": "I love how they truncated the Y axis to make it look more significant 😂",
          "score": 5,
          "created_utc": "2026-02-04 00:42:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g45xm",
          "author": "ToddDearborn",
          "text": "There’s a good short book called “How To Lie with Statistics” and it goes over basically every tactic like this that’s used. Basically never believe a graph you see, perhaps ever 🤣",
          "score": 5,
          "created_utc": "2026-02-04 01:00:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3gb77x",
              "author": "Useful-ldiot",
              "text": "My favorite is example is 9/10 dentists recommend colgate.\n\nIf you ask 1000 dentists and 9 recommend colgate, you can still say 9/10 recommend it. It's unfortunate, but that's how it goes.",
              "score": 1,
              "created_utc": "2026-02-04 01:40:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3gj33n",
                  "author": "OfferLazy9141",
                  "text": "Or you could say, do you recommend Colgate over no toothpaste?",
                  "score": 1,
                  "created_utc": "2026-02-04 02:24:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3g58rr",
          "author": "awshuck",
          "text": "As Mark Ritson would say “y axis fuckery”",
          "score": 1,
          "created_utc": "2026-02-04 01:06:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g9rai",
          "author": "MailSynth",
          "text": "To be fair, the people who continue to believe things coming from this white house...",
          "score": 1,
          "created_utc": "2026-02-04 01:32:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qs71wo",
      "title": "How are small, local businesses keeping ad creatives fresh without burning time?",
      "subreddit": "marketing",
      "url": "https://www.reddit.com/r/marketing/comments/1qs71wo/how_are_small_local_businesses_keeping_ad/",
      "author": "dancingoatmeal",
      "created_utc": "2026-01-31 16:36:51",
      "score": 15,
      "num_comments": 23,
      "upvote_ratio": 0.86,
      "text": "I own a dance studio, so running local Facebook ads is pretty simple for me. My challenge is that creating new graphics and ad copy takes a lot of time because I have to keep everything fresh in our area and keep our CPL low. Is there an AI tool that can help automate some of this? Or would it make sense to hire a VA from the Philippines to track results and optimize the ads for me?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/marketing/comments/1qs71wo/how_are_small_local_businesses_keeping_ad/",
      "domain": "self.marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2u2udr",
          "author": "UprightGroup",
          "text": "Didn't you ask this like a couple weeks ago in another subreddit? Feeling deja vu.\n\nWhat percentage of your city has enough disposable income to take dance classes? Facebook has one of the highest percentage low income user bases. Instagram slightly attracts a higher income demo than Facebook. If your city has its own subreddit, I would advertise there as Reddit has a higher income demo as well. Building a LinkedIn network would also attract the top income earners with the income for dance classes. Yelp is a double edged sword, but it does have a higher income user base.",
          "score": 5,
          "created_utc": "2026-01-31 18:52:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yhs02",
              "author": "AdventurousSharkByte",
              "text": "Where did you get that HHI demo stat from",
              "score": 1,
              "created_utc": "2026-02-01 12:06:22",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o32mwcq",
              "author": "thejournalizer",
              "text": "Probably a bot or spammer offering up some AI tool",
              "score": 1,
              "created_utc": "2026-02-02 00:52:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2tgxrl",
          "author": "polygraph-net",
          "text": "Not the question you asked, but when your goal is low CPL you almost always end up optimizing for bots. That's because bot traffic is cheap and bots are programmed to submit real looking fake leads.",
          "score": 9,
          "created_utc": "2026-01-31 17:08:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2v4zoy",
              "author": "AntrePrahnoor",
              "text": "How does one audit and prevent bots in an age where script kiddies are the new norm?",
              "score": 1,
              "created_utc": "2026-01-31 21:58:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2x2md1",
                  "author": "polygraph-net",
                  "text": "You use a competent bot detection company. One which specializes in modern bots rather than being a generalist. \n\nI'm a researcher in this area and work for a bot detection company and I've noticed the generalist bot detection companies tend to miss most modern bots and have too many false positives (think of how often Cloudflare asks you to prove you're a human).\n\nYou also need to avoid the IP address blocking services (gimmick) and \"AI detection\" companies (gimmick).",
                  "score": 2,
                  "created_utc": "2026-02-01 04:45:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2y8pt5",
          "author": "pantrywanderer",
          "text": "For small local campaigns, I have seen the biggest efficiency gains come from creating a repeatable template system rather than reinventing every ad. Even simple Canva templates with interchangeable copy and images let you rotate creatives quickly. A VA can help a lot with tracking results, pulling reports, and swapping assets, especially if you give clear instructions and a simple workflow. AI tools can assist with copy variations, but you still want someone to review for local tone and relevance. The key is building a system that scales without you doing everything manually.",
          "score": 2,
          "created_utc": "2026-02-01 10:47:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zddn9",
          "author": "No-Sea7346",
          "text": "the biggest time-saver I've found for local Facebook ads isn't producing more creatives, it's knowing exactly when your current ones start dying so you're not refreshing prematurely or too late. What I'd do at $200/day-ish local spend: run 3-4 ad variations at a time and watch the CTR trend line at the ad level, not the ad set level. When an individual ad's CTR drops below your account average by 20%+ over a 3-day window, that's your signal to swap it out. Most people don't refresh enough or refresh way too often because they're guessing. For the actual creative production: batch it. Spend one afternoon per month shooting 15-20 short clips at the studio (students dancing, class energy, instructor moments) and screenshot 8-10 testimonials or reviews. That gives you enough raw material to remix into new ads weekly with just a Canva template swap. The \"fresh\" part that Meta's algorithm cares about isn't radical redesigns, it's new creative IDs with slightly different hooks and visuals. The benefit of lots of creatives is only tangible if the messaging, ad type, and demo representation in the assets are diverse, which meta auction rewards by unlocking unique reach. On the VA question: a VA for optimization is risky unless they deeply understand Meta's auction dynamics. What works better at your scale is having a clear system, a simple spreadsheet tracking CPL by ad by week and letting that data tell you what to change rather than relying on someone's gut.",
          "score": 2,
          "created_utc": "2026-02-01 15:20:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ugi2v",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-31 19:57:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ugi6x",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-31 19:57:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o30fsj1",
          "author": "United_Broccoli_4032",
          "text": "Definitely sounds like you’re juggling a lot, and keeping your creatives fresh without burning time is the trick. Instead of manually cranking out new graphics and copy or relying on VAs who still need guidance, a tool like Didoo AI could save you heaps of hassle. It studies what’s working with your dance studio audience and automatically spins up new ad variants that actually perform, so you’re not stuck guessing or burning time on constant tweaks. It’s basically an autopilot for your local Facebook ads, optimizing around the clock to keep those CPLs down while testing new angles for you. Way less grind, more focus on running your studio and less stress on ad fatigue.",
          "score": 1,
          "created_utc": "2026-02-01 18:17:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34i32e",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 08:41:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34i33j",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-02 08:41:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o39o73z",
          "author": "humanexperimentals",
          "text": "I'll make you your own automation.",
          "score": 1,
          "created_utc": "2026-02-03 01:59:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3b0jhl",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 07:36:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3b0jix",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-03 07:36:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3iar5m",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-04 10:34:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3iar6p",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-04 10:34:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2wjft4",
          "author": "Tall_Flatworm_7003",
          "text": "If you're running a dance studio, you shouldn't need many creatives. \"Picture of person dancing, + Headline (General theme) \"Davncee your heart out, Valentines dancing special\" 1 (scratched out) 2 free trial classes. Show something with 5 stars in the picture, mention some awards etc. Copy and paste 1 ad per month.\n\nValentines (February)  \nWinter (March)  \nSpring (April-May)  \nSummer (June - August)  \nEtc Etc. I\n\nIf you have time you can make them more niche and switch every 2 weeks, but probably isn't even necessary. \n\nTake all the time you saved on ads and invest it into getting Google reviews on your GMB listing.",
          "score": 1,
          "created_utc": "2026-02-01 02:41:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zgqyq",
          "author": "bryan321446",
          "text": "i've been seeing ServiceStories come up alot when people talk about keeping content fresh for local businesses. It automatically turns your completed jobs into stories and content you can repurpose for ads, social, whatever, so you're not constantly starting from scratch. Worth checking out since you're already spending time on ad creatives anyway.",
          "score": 0,
          "created_utc": "2026-02-01 15:36:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qv4u2d",
      "title": "Opinions from leadership",
      "subreddit": "marketing",
      "url": "https://www.reddit.com/r/marketing/comments/1qv4u2d/opinions_from_leadership/",
      "author": "Alarming-Cow676",
      "created_utc": "2026-02-03 21:27:34",
      "score": 13,
      "num_comments": 15,
      "upvote_ratio": 0.89,
      "text": "How do you handle suggestions from leaders in the company/organization about what channels to advertise in? Often people see a publication, and with it being highly visible to them, they immediately think/suggest we should be advertising in it. At some point it feels easier to make them feel good and accept the suggestion since measurements from print sources for example are nearly non-existent.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/marketing/comments/1qv4u2d/opinions_from_leadership/",
      "domain": "self.marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3eyyl3",
          "author": "AutoModerator",
          "text": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-03 21:27:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f1q74",
          "author": "wanabeproducer",
          "text": "The smell of burning money is my favorite thing in the morning. /s\n\nHonestly just ask them: Are you the target person? Is this visible to you because you want to buy our (their) product/service? If the answer is yes, do it. If not (most probably), don’t do it.",
          "score": 11,
          "created_utc": "2026-02-03 21:40:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gq68i",
          "author": "polygraph-net",
          "text": "Choose your battles.\n\nPromotions are based on relationships, not how hard you pushed back.",
          "score": 8,
          "created_utc": "2026-02-04 03:05:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3h34wu",
          "author": "Successful_Mall_3825",
          "text": "Ask them what KPIs to use to measure success. \n\nI had a leader that gets “business leader profiles” publications. Didn’t care about clicks or leads. Only cared about being perceived as their peer.",
          "score": 3,
          "created_utc": "2026-02-04 04:24:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3h5wol",
          "author": "pantrywanderer",
          "text": "This comes up a lot, especially when visibility gets confused with impact. What’s worked best for me is reframing the conversation around decision criteria instead of the channel itself. If a leader suggests a publication, I try to walk through audience fit, measurable outcomes, and opportunity cost compared to what’s already working. Sometimes that naturally cools the idea down without a hard no.\n\nWhen measurement is weak, I also like to position it as a test with clear expectations upfront. Budget, timeframe, and what success would realistically look like, even if it’s directional. If leadership still wants it after that, at least it’s a conscious tradeoff rather than a default yes. Over time, having that consistent framework builds trust and reduces the random channel suggestions.",
          "score": 3,
          "created_utc": "2026-02-04 04:43:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3n4jv2",
          "author": "AdTechGinger",
          "text": "This is the classic dilemma of working in marketing-- almost everyone has a bias toward thinking their personal media consumption habits are shared by others. Especially in leadership, in my experience they have a really hard time believing that what THEY read/watch/use might be completely different than what the target customer/audience does. Trust me I've spent SO very many hours working to convince a 60 yr old white guy client that the actual buyer they are targeting spends a lot more time with TikTok than the WSJ print edition, or that no, I don't think college football games are the best placement to reach moms buying household items.   \nYou have to make a choice, which requests are so egregious that you push back, and where can you toss them an inexpensive \"vanity buy\" (like the billboard near the CEO's house, or the inexpensive print ad they can have on their coffee table and feels so \"tangible\"), without sacrificing the actual effectiveness of your media buys overall.",
          "score": 3,
          "created_utc": "2026-02-05 01:50:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3h7slx",
          "author": "Competitive_Dance478",
          "text": "Intuition and data \n4P + 1P\n\nPersona + marketing 4Ps",
          "score": 2,
          "created_utc": "2026-02-04 04:56:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3h9qcv",
          "author": "wocsdrawkcab",
          "text": "If its cheap enough we tell them to go for it. In my industry print media is typically recouped from the OEM so it doesn't matter if it actually works or not.  \n\nI don't go seeking out those types of media but every now and then they come up.",
          "score": 2,
          "created_utc": "2026-02-04 05:10:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ktuew",
          "author": "0ctaviusRex",
          "text": "This comes up a lot, especially when visibility gets mistaken for effectiveness. What’s worked best for me is reframing those suggestions as hypotheses instead of directives.\n\nWhen a leader brings up a channel, I’ll usually ask what problem they believe it solves and what signal we’d expect to see if it’s actually working. If we can’t define even a proxy metric, that’s usually a sign it’s more about reassurance than results.\n\nIn practice, I’ll often run small, time boxed tests or compare the suggested channel against where we’re already seeing real audience pull. Looking at where customers are already talking, asking questions, or expressing intent tends to ground those conversations. Pulling patterns from organic discussions using tools like Syndr AI has helped me show leadership where attention is actually concentrated, which makes it easier to push back on it feels visible arguments without making it personal.\n\nThat way you’re not rejecting ideas outright, you’re anchoring decisions to observable signals instead of gut feel or anecdotal exposure.",
          "score": 2,
          "created_utc": "2026-02-04 18:49:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pf66y",
          "author": "lil_tink_tink",
          "text": "The new one I am getting is \"SEO is dead! We need to show up on AI\".\n\nAs if it isn't almost the same exact work to do both....",
          "score": 2,
          "created_utc": "2026-02-05 12:28:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3rvcaw",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-02-05 19:48:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3rvcgv",
                  "author": "AutoModerator",
                  "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-02-05 19:48:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3fi3h2",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 23:00:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3fi3ji",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-03 23:00:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qttmr6",
      "title": "Wallpaper ad strategy not working",
      "subreddit": "marketing",
      "url": "https://www.reddit.com/r/marketing/comments/1qttmr6/wallpaper_ad_strategy_not_working/",
      "author": "sfwills",
      "created_utc": "2026-02-02 12:24:00",
      "score": 9,
      "num_comments": 31,
      "upvote_ratio": 0.77,
      "text": "Started working with a knowledgeable digital marketing freelancer who runs our meta ads campaigns for us, burnt through £4K in 4 months: <5 sample orders (in total!!) and not a single conversion to sale. Assets, product & pricing seem good, what could be wrong? Struggling here. Now moved to PPC, but not having much faith in that either. Anybody in the wallpaper (and interior fabrics) industry who could offer some insight? ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/marketing/comments/1qttmr6/wallpaper_ad_strategy_not_working/",
      "domain": "self.marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3571vz",
          "author": "AutoModerator",
          "text": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 12:24:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3591kj",
          "author": "alone_in_the_light",
          "text": "I'm not in the wallpaper industry and wallpapers aren't a thing in my country. But it seems you covered tactics (Promotion, Product, Price) and are not really considering strategy (Segmentation, Targeting, Positioning). Even a Ferrari doesn't do well if the strategy makes it crash against a wall.\n\nFor example, if ads are not relevant in decision making or if ads are targeting the wrong audience, then ads are not expected to work well. \n\nStrategy comes long before ads to me. Maybe with marketing research and marketing analytics. I want to evaluate if ads are worth it long I start spending money on it.",
          "score": 10,
          "created_utc": "2026-02-02 12:38:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35eln5",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-02-02 13:14:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o35elpi",
                  "author": "AutoModerator",
                  "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
                  "score": 2,
                  "created_utc": "2026-02-02 13:14:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3683m9",
          "author": "polygraph-net",
          "text": "Did he have the audience network turned on?\n\nWas he using instant forms?\n\nDid you get lots of leads who didn't remember filling out your form or didn't know who you are?",
          "score": 3,
          "created_utc": "2026-02-02 15:49:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f9ei6",
          "author": "Realistic-Ad9355",
          "text": "Meta isn't the problem. Neither is Google ads.\n\nThe problem is your marketing -- and the fact that your marketer (and most marketers in general) don't understand the difference between buying traffic and a marketing strategy. Which leads to situations like this.... bouncing from media to media thinking none of them work.\n\nThink of it like this: Let's say you wrote a book that wasn't very good. The plot boring, characters uninteresting, and the story a jumbled mess. Barely anyone read it. And the ones who did hated it. So, how much sense would it make for you to publish the same book in a different format? Maybe an E-book? Perhaps a graphic novel or podcast series?\n\nOf course it would make no sense. A shitty story is a shitty story regardless of format.\n\nBut that's exactly what you're doing now. Your marketer wrote a shitty book and it crashed and burned on Meta. Now he's trying it on Google.\n\nGo back to the fundamentals. Create a killer offer. Figure out the best way to present it. Decide how to get eyeballs on it. Then learn how to maximize each new client's value. Get these 4 steps right (i.e. write a solid story), and you can use any traffic channel you want.",
          "score": 3,
          "created_utc": "2026-02-03 22:16:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37b66w",
          "author": "Bleacherbum95",
          "text": "As others have said, this isn't likely a case where you need someone else in the industry. Something about the targeting or setup of those campaigns is wrong. Meta is too good at optimizing for properly set up goals to be turning up nothing.\n\nI can tell you, if by switching to PPC means you're now just optimizing for clicks, there is next to zero chance that improves things for you. You'll likely burn money even faster.",
          "score": 2,
          "created_utc": "2026-02-02 18:48:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37qo6k",
              "author": "sfwills",
              "text": "Thank you for confirming my suspicions. A costly and lenghty lesson and such a waste of runway. Going to halt the PPC and think about next steps.",
              "score": 1,
              "created_utc": "2026-02-02 20:00:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o39kzdg",
                  "author": "Bleacherbum95",
                  "text": "Do you know if there was a clear purchase conversion set up prior to running the campaign? Or were you optimizing for the sample requests? If it was the latter, that should still have a lead (or custom) signal set up for a conversion campaign. My guess would be something was off there. Short of something completely wrong with the audience targeting (not impossible with Advantage+), Meta usually casts a wide net and reels it in as it learns.\n\nAlso, I should clarify there's nothing wrong with a PPC campaign for upper funnel if you're looking at a longer sales cycle, but it would usually be complimented by a retargeting campaign to follow those people around until you get a purchase.\n\nNot sure what your average purchase is, but I would think a regular sales campaign should at least be generating view thru purchases, which is where we circle back to my first hunch.\n\nI hope this helps a little. Basically trying to say, don't write off Meta because of one bad experience.",
                  "score": 1,
                  "created_utc": "2026-02-03 01:40:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o35s7ql",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 14:30:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35s7tf",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-02 14:30:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o36oq8a",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 17:06:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36oqb4",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-02 17:06:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o374qur",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 18:19:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o374qxg",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-02 18:19:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o37i6y6",
          "author": "cuteman",
          "text": "Who do you want to reach? (???)\n\nWhat do you want to tell them? (important)\n\nWhat do you want them to do? (sales)",
          "score": 1,
          "created_utc": "2026-02-02 19:20:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38oje1",
          "author": "UnionAdAgency",
          "text": "Is your audience searching for your product on meta? Some of our clients find more success on Google than meta, to the point where we decided that meta was acting more as a brand awareness platform than a lead gen one. \nHave you tried Pinterest?",
          "score": 1,
          "created_utc": "2026-02-02 22:42:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39dkj5",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 00:58:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39dkns",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-03 00:58:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ah6l7",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 04:57:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ah6nc",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-03 04:57:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3b6gkm",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 08:32:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3b6gll",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-03 08:32:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o35e3fq",
          "author": "PearlsSwine",
          "text": "\"'what could be wrong? \"\n\nYou hired an incompetent scammer probably on Fiver or Upwork. \n\nSack them and find someone good.",
          "score": -2,
          "created_utc": "2026-02-02 13:11:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35fiu3",
              "author": "sfwills",
              "text": "Almost wish that was the case then I would have cut my losses earlier. He’s UK-based and came recommended. Honestly the guy seems decent, that’s why I’m so worried.",
              "score": 1,
              "created_utc": "2026-02-02 13:20:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o36cf35",
                  "author": "WonkyConker",
                  "text": "Just out of curiosity who was the recommendation from?",
                  "score": 1,
                  "created_utc": "2026-02-02 16:10:06",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3hubop",
                  "author": "exciting_username_",
                  "text": "People whom you hire to run ads are not the same people you hire to do MARKETING strategy. The skills are so specialized, in reputable marketing agencies these are completely different roles. \n\nAlso, how is your sales process? Where is the traffic bring directed to? Did the ads not generate any increased in traffic at all?",
                  "score": 1,
                  "created_utc": "2026-02-04 08:00:23",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o35kijr",
                  "author": "PearlsSwine",
                  "text": "Seeming decent, and being decent are two very different things.\n\nSpending four large on ads and not seeing a single sale means they don't know what they are doing.\n\nShould have realised that after a couple of weeks, tbh.\n\nAds are quick to get results.\n\nI have 23 years experience, I'd be happy to take a look at the account for free and explain where they have fucked up. If you want.",
                  "score": 0,
                  "created_utc": "2026-02-02 13:49:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qxb4km",
      "title": "How do I deal with a marketing company that I fired but sent me a huge final bill after they overpromised and underperformed?",
      "subreddit": "marketing",
      "url": "https://www.reddit.com/r/marketing/comments/1qxb4km/how_do_i_deal_with_a_marketing_company_that_i/",
      "author": "OrlandoWashington69",
      "created_utc": "2026-02-06 07:24:11",
      "score": 8,
      "num_comments": 16,
      "upvote_ratio": 0.9,
      "text": "Hired a marketing company to run my first ad campaign for my ecommerce store, along with a weekly email campaign to go with it. Basically, it didn’t work.\n\nI paid them up front for the first month. 20 days in we had a chat (the only one) to discuss metrics. They sounded confused and not sure what the results we had gathered thus far were saying about the campaign, but my account manager said ‘we should know by the 30 day mark if we should continue’.\n\n10 more days later and I’ve made like 5 sales from the ads and zero from email. We pulled the plug on the ads. I realize ads take time to really dial in, but we were far, far off the mark they promised at this point to continue.\n\nNow Ive been sent a large final bill from them. I need to go over the contract again but damn… even if they did what it says, they underperformed so badly that I feel like I’m getting scammed for what they are asking price wise. I’m curious if others have dealt with this type of situation and how I might approach it.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/marketing/comments/1qxb4km/how_do_i_deal_with_a_marketing_company_that_i/",
      "domain": "self.marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3v46zi",
          "author": "AutoModerator",
          "text": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 07:24:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v7qwy",
          "author": "WonkyConker",
          "text": "If they are performing within the letter of the contract, then no you aren't getting scammed. I would be very comfortable betting they didn't put any minimum performance type clauses in, and you wouldn't be here if you did. So no, probably not getting scammed.",
          "score": 10,
          "created_utc": "2026-02-06 07:56:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vbhxq",
              "author": "dubdubABC",
              "text": "Yeah, unless they were in breach of contract you should pay them and take is as a learning experience. \n\nAlso, FWIW, it sounds like you were running a campaign at less than $20/day per platform. There are a lot of variables in play, but it's entirely possible that after 1 month they are just getting enough data on Meta, or wherever you're running the ads, to really start the process of dialing in a campaign. In my experience, it is not unreasonable for it to take longer than 1 month for a campaign to become cost effective, and by pulling the plug so quickly like you did you just incinerated money. ",
              "score": 4,
              "created_utc": "2026-02-06 08:32:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3v4ysu",
          "author": "phatazznutz",
          "text": "How much did you pay for a 1 month campaign? Sales people will certainly over promise sometimes but sometimes clients have a pretty low monthly budget and expect unrealistic results. 5 sales from the ads in the first month of the campaign isn’t bad depending on how much you paid them.",
          "score": 4,
          "created_utc": "2026-02-06 07:31:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3v5t2l",
              "author": "k_rocker",
              "text": "And we have no info on what they sell. Books and kitchens have way different journeys for customers.",
              "score": 2,
              "created_utc": "2026-02-06 07:38:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3v9sik",
              "author": "OrlandoWashington69",
              "text": "I sell apparel. It ended up being around $120 of adspend per sale. My AOV is $40.",
              "score": 2,
              "created_utc": "2026-02-06 08:15:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3vatyd",
                  "author": "Fearless_Parking_436",
                  "text": "So you spent $600? It doesnt make sense to have agency  manage your ads if you spend $600. Did they check the conversion flow and tag set up beforehand?",
                  "score": 3,
                  "created_utc": "2026-02-06 08:25:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3vb58i",
          "author": "alone_in_the_light",
          "text": "I don't know the details of the contract. \n\nBut, as a marketing strategist, I've hired marketing agencies. And I want to be clear about what the promise is, how me measure performance, and how we pay for the services. \n\nFor example, sales are affected by many factors, not only advertising. If the product is bad, the price is too high, or the distribution system is not working well,  then sales can be low even with amazing ads. \n\nBasically, I expect companies to follow the brief. That's the promise, that's what they should deliver. Not sales. \n\nMaybe the company didn't sell because my creative brief is bad. But then I should improve my work. If the agency still delivered according to the brief, the agency should be paid, regardless of the sales.",
          "score": 3,
          "created_utc": "2026-02-06 08:28:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v5o2m",
          "author": "k_rocker",
          "text": "Cold marketing is hard. \n\nDid you supply the email addresses (then your data is what they’re working with). \n\nWe work on the basis that your first month is information and data gathering - it will tell you who clicks, who reacts and engages. It shows the pathways for the following months. \n\nIf they told you something would happen in month 1 then they’re idiots, if you thought you could magically sell a shed load just by throwing money at it, you’re the idiot. \n\nThe biggest time investment of a campaign for an agency is at the start, structure, checking set ups, building - it gets easier over time but month 1 is all hands on deck. \n\nGood marketing is refined over time. Just pay them and let them go, they don’t deserve your impatience.",
          "score": 1,
          "created_utc": "2026-02-06 07:37:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3v9z72",
              "author": "OrlandoWashington69",
              "text": "I supplied them with upfront data from my past sales and Opened up my email list, which is around 1000 past purchasers.",
              "score": 1,
              "created_utc": "2026-02-06 08:17:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3vdlpl",
                  "author": "Critical_Hedgehog451",
                  "text": "Do you mind if I ask, were those sales generated through some kind of advertisement?",
                  "score": 1,
                  "created_utc": "2026-02-06 08:52:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3vckm9",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-06 08:42:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vckn8",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-06 08:42:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vdae3",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-06 08:49:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vdaf7",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-06 08:49:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3v7yaa",
          "author": "Hellfiger",
          "text": "We had a terrible experience with a marketing agency. We just didn't pay them. They were sending tons of emails but the boss didn't care. It worked",
          "score": -3,
          "created_utc": "2026-02-06 07:58:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qx9rzs",
      "title": "How are you actually using influencer marketing in 2026?",
      "subreddit": "marketing",
      "url": "https://www.reddit.com/r/marketing/comments/1qx9rzs/how_are_you_actually_using_influencer_marketing/",
      "author": "William45623",
      "created_utc": "2026-02-06 06:06:46",
      "score": 6,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Influencer marketing seems to be everywhere, but the results feel very mixed depending on the approach.\n\nI’m curious how people here are *really* using it:\n\n* What types of influencers are working best for you (micro, niche, large)?\n* Which platforms are driving actual ROI (YouTube, X, Instagram, TikTok, LinkedIn)?\n* What kind of collaborations convert best reviews, tutorials, UGC, affiliates, long-term partnerships?\n\nWould love to hear what’s working, what’s not, and any lessons learned from real campaigns.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/marketing/comments/1qx9rzs/how_are_you_actually_using_influencer_marketing/",
      "domain": "self.marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3uv5xi",
          "author": "AutoModerator",
          "text": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 06:06:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uw90b",
          "author": "Constant-Loquat-310",
          "text": "Influencer marketing works best in 2026 when it’s micro/niche creators + performance tracking, not big-name influencers.\n\nWhat’s converting:\n\n* Micro creators (5k–100k followers) → higher trust, better ROI\n* TikTok & YouTube for demos/reviews, Instagram for UGC\n* UGC-style videos, tutorials, and affiliate links\n* Long-term partnerships beat one-off posts\n\nBig lesson: don’t pay for reach—pay for creators who drive actual clicks and sales.",
          "score": 3,
          "created_utc": "2026-02-06 06:15:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uwi2k",
          "author": "Cool-Professional261",
          "text": "I am not my client have zero budget for this 🥲",
          "score": 1,
          "created_utc": "2026-02-06 06:17:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3v0rw6",
              "author": "useomnia",
              "text": "😩 Sounds terrible",
              "score": 2,
              "created_utc": "2026-02-06 06:54:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3v8asa",
                  "author": "Cool-Professional261",
                  "text": "I suggested starting with micro-influencers, but they said no.\nIt gets frustrating when clients try to act like marketers instead of being clients.”",
                  "score": 1,
                  "created_utc": "2026-02-06 08:01:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3v9j9y",
          "author": "chocho20",
          "text": "Agree with the micro-influencer approach mentioned above, but there is a massive caveat in 2026: **Bot Inflation.**\n\nBecause brands started shifting to 'Micro', the bot farms followed. We found that 30-40% of so-called 'niche' creators have completely manufactured engagement pods.\n\nThe only way we actually see ROI now is by **Auditing** before paying. We literally run our own scrapes on their follower lists to flag bot patterns (generic usernames, weird geo-locations) instead of trusting their media kits.\n\nIf you aren't validating their audience data yourself (using scraping tools or 3rd party auditors), you're likely paying for 'reach' that doesn't exist.",
          "score": 1,
          "created_utc": "2026-02-06 08:13:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1quah28",
      "title": "How long did it take for your business/brand to get its first sale? What type of business is it?",
      "subreddit": "marketing",
      "url": "https://www.reddit.com/r/marketing/comments/1quah28/how_long_did_it_take_for_your_businessbrand_to/",
      "author": "Zestyclose-Growth543",
      "created_utc": "2026-02-02 22:49:46",
      "score": 5,
      "num_comments": 22,
      "upvote_ratio": 0.78,
      "text": "Just a general question,can’t wait to hear your guys responses.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/marketing/comments/1quah28/how_long_did_it_take_for_your_businessbrand_to/",
      "domain": "self.marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o38px3o",
          "author": "AutoModerator",
          "text": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-02 22:49:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ckfhv",
          "author": "pantrywanderer",
          "text": "For me it was surprisingly quick once I stopped overthinking and just reached out to actual people instead of hoping traffic would magically appear. My first “sale” came within the first couple of weeks of active pitching, even though the business was small service-based work. It felt way faster than I expected, mostly because I was focused on solving a real problem for someone rather than waiting for perfection.\n\n",
          "score": 5,
          "created_utc": "2026-02-03 14:43:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ckpql",
              "author": "Zestyclose-Growth543",
              "text": "Ah i love that   !!",
              "score": 1,
              "created_utc": "2026-02-03 14:45:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3cllmd",
                  "author": "pantrywanderer",
                  "text": "Exactly! It’s crazy how much just taking action beats perfect planning. Even a small, imperfect first sale teaches way more than weeks of overthinking ever could. Did you have a moment like that with your first client too?",
                  "score": 1,
                  "created_utc": "2026-02-03 14:49:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o38udwc",
          "author": "jo0stjo0st",
          "text": "Hearing aids - first leads on first day, first sale on third  \nLandscaping - first leads on first day, first sale after two weeks (including appointment to design the garden)",
          "score": 4,
          "created_utc": "2026-02-02 23:13:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3912rv",
              "author": "Zestyclose-Growth543",
              "text": "Congratulations 💖🥰✌️",
              "score": 1,
              "created_utc": "2026-02-02 23:50:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o39bguy",
          "author": "PerformanceLiving495",
          "text": "For me, it took about two weeks to get my first sale. I was running a small online store selling niche accessories. The first sale felt huge, a mix of excitement and relief!",
          "score": 3,
          "created_utc": "2026-02-03 00:46:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39g0xc",
              "author": "Zestyclose-Growth543",
              "text": "Ah congratulations!!",
              "score": 2,
              "created_utc": "2026-02-03 01:12:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3buygg",
                  "author": "LevelAssist4",
                  "text": "Thanks so much!",
                  "score": 2,
                  "created_utc": "2026-02-03 12:13:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o38qt4a",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 22:54:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38qt73",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-02 22:54:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o39cug4",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 00:54:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39cuhx",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-03 00:54:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3a785c",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 03:50:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3a787g",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-03 03:50:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3i8g36",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-04 10:13:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i8g4i",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-04 10:13:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3k2aw3",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-04 16:44:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3k2azh",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-04 16:44:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3kzfkr",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-04 19:15:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3kzfo5",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-04 19:15:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qr5cjs",
      "title": "Quiz funnel contact data for B2C automotive industry",
      "subreddit": "marketing",
      "url": "https://www.reddit.com/r/marketing/comments/1qr5cjs/quiz_funnel_contact_data_for_b2c_automotive/",
      "author": "nataliya_brite",
      "created_utc": "2026-01-30 13:23:45",
      "score": 4,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Hi fellow marketers. I have a doubt and would appreciate your experience, may be from other industries.\n\nDo you put contact data request before quiz questions or after them to get results?\n\nI incline to put them before and maybe to lose some not ready to buy leads. What is your experience?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/marketing/comments/1qr5cjs/quiz_funnel_contact_data_for_b2c_automotive/",
      "domain": "self.marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2lk0dl",
          "author": "AutoModerator",
          "text": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 13:23:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zus6i",
          "author": "ad6mly",
          "text": "AB test it. Get the right answer for your specific circumstances",
          "score": 3,
          "created_utc": "2026-02-01 16:42:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m9jut",
          "author": "gptbuilder_marc",
          "text": "This usually isn’t just a UX thing. Moving the contact gate changes the kind of signal you get, not just how many people finish. Are you trying to maximize raw leads right now, or do you care more about how people behave after the quiz?",
          "score": 2,
          "created_utc": "2026-01-30 15:31:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36f0u3",
              "author": "nataliya_brite",
              "text": "Leads are the goal, for sure. Putting the phone number question at the beginning will cut some \"just looking\" visitors, but also could cut those who do not feel comfortable receiving the call.  \nOn the contrary, putting it at the end of the test, could give us more data about what people are looking for even without having those as leads. We could use this information to create a specific promotion.",
              "score": 1,
              "created_utc": "2026-02-02 16:22:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3g0xij",
                  "author": "Out3rWorldz",
                  "text": "When if doubt AB test each thought. You can always have an idea of which will do what, but you won’t know until test. The data will win out.",
                  "score": 1,
                  "created_utc": "2026-02-04 00:42:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2meqnv",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-30 15:54:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2meqt6",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-30 15:54:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2t23am",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-31 15:57:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t23dk",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-31 15:57:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qrlv5k",
      "title": "Stumped by google ad images",
      "subreddit": "marketing",
      "url": "https://www.reddit.com/r/marketing/comments/1qrlv5k/stumped_by_google_ad_images/",
      "author": "thistle95",
      "created_utc": "2026-01-30 23:33:22",
      "score": 4,
      "num_comments": 11,
      "upvote_ratio": 0.75,
      "text": "Howdy! I’m a founder of an education company with considerable marketing background, but I had never run google ads. I’m utterly stumped on what to include for images. Since we don’t have a physical product, there’s no real need for an image, and I positively despise the stock images of people around a whiteboard.\n\nI’m AI fluent, but AI returns a lot of cliched and creepy ideas. How do people go about deciding on images? Where do you look for inspiration? Thanks!",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/marketing/comments/1qrlv5k/stumped_by_google_ad_images/",
      "domain": "self.marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o2p56kn",
          "author": "AutoModerator",
          "text": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-30 23:33:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pafbi",
          "author": "itwasntevenme",
          "text": "Ai. You just have to do more work than surface level ai.",
          "score": 5,
          "created_utc": "2026-01-31 00:02:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2pauly",
              "author": "thistle95",
              "text": "I suppose my question is: what does that more work entail?",
              "score": 1,
              "created_utc": "2026-01-31 00:04:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2pbe8a",
                  "author": "itwasntevenme",
                  "text": "Learn how to prompt exactly what you want. Used to be all cringe stuff but now it’s pretty easy to make what we used to pay models thousands for.",
                  "score": 1,
                  "created_utc": "2026-01-31 00:07:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2rbu0j",
          "author": "WonkyConker",
          "text": "You're asking 'how do people communicate visually' ?",
          "score": 2,
          "created_utc": "2026-01-31 08:28:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2szqrx",
          "author": "Reasonable-Survey724",
          "text": "This is a wild take that won’t help your marketing: \nSince we don’t have a physical product, there’s no real need for an image.\n\nLook at the ads of any non-physical software company or service. Images are the quickest way to communicate, they add emotion and nuance that limited ad text can’t.\n\nDM if you want someone to quickly workshop your company’s visual identity and ads with you. \n\nI currently work in lifecycle marketing/ marketing ops, doing in-house and moonlight at an agency, but got my degree is in visual communication/ arts and have been through a couple of re-brands. ",
          "score": 1,
          "created_utc": "2026-01-31 15:45:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwfk1c",
      "title": "Maximise clicks or maximise conversion for a window cleaning business?",
      "subreddit": "marketing",
      "url": "https://www.reddit.com/r/marketing/comments/1qwfk1c/maximise_clicks_or_maximise_conversion_for_a/",
      "author": "LividManufacturer582",
      "created_utc": "2026-02-05 08:10:26",
      "score": 4,
      "num_comments": 17,
      "upvote_ratio": 0.75,
      "text": "I run a small local window cleaning / exterior cleaning business and I’m testing Google Ads on a pretty tight budget.\n\nI’m torn between Maximise Clicks and Maximise Conversions.\n\nOn one hand, clicks seem cheaper and I get more traffic. On the other, conversions should mean better leads — but I don’t have heaps of conversion data yet.\n\nFor a local service business (phone calls + quote form), early-stage account, limited daily budget —\n\nwhat have you found actually works better in practice?\n\nWould appreciate advice from anyone who’s run ads for trades / local services.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/marketing/comments/1qwfk1c/maximise_clicks_or_maximise_conversion_for_a/",
      "domain": "self.marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3om3ds",
          "author": "AutoModerator",
          "text": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 08:10:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qo78v",
          "author": "QuantumWolf99",
          "text": "Max Clicks with manual CPC cap until you hit 30 conversions then switch to Max Conversions... new campaigns lack conversion data so algo can't optimize for conversions yet... tight budget means burning it on expensive low-quality clicks will kill your account before learning phase completes.",
          "score": 7,
          "created_utc": "2026-02-05 16:28:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3rzeym",
              "author": "LividManufacturer582",
              "text": "What would you recommend for CPC limit for a 38 dollar budget",
              "score": 1,
              "created_utc": "2026-02-05 20:07:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3v9b8c",
                  "author": "ScreamingEnglishman",
                  "text": "Work back from your typical conversion rate on your website as a starter.\n\nThen just experiment with different cpcs on different keywords to see what drives the value and what you're prepared to spend on a click",
                  "score": 1,
                  "created_utc": "2026-02-06 08:11:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3oo6lz",
          "author": "Copthill",
          "text": "Conversions. \n\nMaximise clicks makes the job you're asking Google to do too easy and your ads will get served to less and less relevant people. \n\nGoing for conversions will also help you to focus on improving your conversion funnel.",
          "score": 3,
          "created_utc": "2026-02-05 08:30:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pgj14",
          "author": "GrrasssTastesBad",
          "text": "For local services, maximize conversions. Clicks are vanity. With limited budget, you want qualified leads who actually want to pay, not random tire kickers.\n\nGoogle needs about 30-50 conversions to properly optimize. Until you hit that, manually set your bid strategy to maximize clicks, but track every single interaction carefully. Once you've got enough data, switch to conversions.",
          "score": 2,
          "created_utc": "2026-02-05 12:38:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p8s9r",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 11:41:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p8sbq",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-05 11:41:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3plrs7",
          "author": "alone_in_the_light",
          "text": "I have to assume a lot here, like assuming that Google is a good platform for you, and my assumptions can be wrong. \n\nBut conversions is the standard answer, unless you have strategic reasons to believe otherwise. \n\nI've encountered situations when clicks are preferred. Like long processes when clicks are not expected to lead to conversions that will happen much later. Then, awareness and education about new products may be the goal thinking about the long term, not immediate conversion. But that's more like an exception.",
          "score": 1,
          "created_utc": "2026-02-05 13:11:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q82m7",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-05 15:13:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q82od",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-05 15:13:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3s7leb",
          "author": "EconomyTrouble324",
          "text": "Maximize conversions by targeting local customers with tailored offers that address their specific window cleaning needs.",
          "score": 1,
          "created_utc": "2026-02-05 20:46:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3s7ys2",
          "author": "Manarel",
          "text": "For a window cleaning business, prioritize maximizing conversions to attract serious customers and improve ROI; utilizing targeted local SEO strategies can enhance visibility among your ideal clientele, while a clear call to action on your website should directly address their specific needs.",
          "score": 1,
          "created_utc": "2026-02-05 20:48:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3spjz0",
          "author": "Some-Ad-3938",
          "text": "Conversion",
          "score": 1,
          "created_utc": "2026-02-05 22:13:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3u2c1j",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-06 02:49:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3u2c48",
              "author": "AutoModerator",
              "text": "Your account must be 30+ days old and it must have 300+ karma to post in r/Marketing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-06 02:49:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pl3di",
          "author": "von_sip",
          "text": "Are you nurturing clickers in a way that leads to a higher conversion rate?\n\nIf not, focus on initial conversions.",
          "score": 0,
          "created_utc": "2026-02-05 13:07:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwnzns",
      "title": "Cybersecurity Vendor working with MSPs",
      "subreddit": "marketing",
      "url": "https://www.reddit.com/r/marketing/comments/1qwnzns/cybersecurity_vendor_working_with_msps/",
      "author": "ImpossibleSummer9440",
      "created_utc": "2026-02-05 15:18:10",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.84,
      "text": "Hi everyone. I’m doing field & channel marketing for a cybersecurity vendor that sells via MSPs, and I feel like I’m a bit too deep in my own bubble right now. I joined the company a few months ago and I feel like I get too operational and I don't enjoy having 90% process-based activities.\nWould love to chat with someone who’s into B2B/ SaaS/channel or partner marketing and just… bounce ideas. No pitch, no agenda;  just a casual chat to spark some fresh, usable ideas I can try out.\nIf you’ve worked with MSPs, cybersecurity, or partner-led marketing, I would love chatting with you. \nIf you’re up for it, comment or DM.\nAppreciate it. Thanks! ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/marketing/comments/1qwnzns/cybersecurity_vendor_working_with_msps/",
      "domain": "self.marketing",
      "is_self": true,
      "comments": [
        {
          "id": "o3q92oq",
          "author": "AutoModerator",
          "text": "If this post doesn't follow the rules [report it to the mods](https://www.reddit.com/r/marketing/about/rules/). Join our [community Discord!](https://discord.gg/looking-for-marketing-discussion-811236647760298024)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/marketing) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-05 15:18:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}