{
  "metadata": {
    "last_updated": "2026-01-10 02:26:46",
    "time_filter": "week",
    "subreddit": "Marketresearch",
    "total_items": 9,
    "total_comments": 50,
    "file_size_bytes": 43270
  },
  "items": [
    {
      "id": "1q68xzs",
      "title": "Using b2b lead gen agency as a research tool",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1q68xzs/using_b2b_lead_gen_agency_as_a_research_tool/",
      "author": "Alone-Arm-7630",
      "created_utc": "2026-01-07 07:21:39",
      "score": 14,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": " Outbound campaigns generate qualitative feedback that’s often overlooked. I’m curious whether anyone has intentionally used agencies to gather market insights rather than just leads. Did that approach add value?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1q68xzs/using_b2b_lead_gen_agency_as_a_research_tool/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "ny6ltzk",
          "author": "coffeeebrain",
          "text": "I'm in UX research not lead gen, but I've thought about this.\n\nThe problem is lead gen agencies optimize for sales conversations, not research conversations. The people who respond are expecting a pitch, not an interview. Makes it hard to get honest feedback.\n\nFor B2B research I use dedicated research platforms instead. Like I've used CleverX and Respondent to recruit executives and decision-makers for interviews. Full disclosure, I've used them as a consultant. They're expensive but people expect research conversations, not sales, so you get better insights.\n\nUsing sales outreach for research feedback feels like a byproduct rather than intentional research. Probably better to separate the two.",
          "score": 2,
          "created_utc": "2026-01-07 11:37:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny5u304",
          "author": "kubrador",
          "text": "honestly this is kind of genius in a lazy way\n\nyou're basically paying for rejection data. every \"not interested\" comes with a reason if your SDRs aren't braindead. problem is most agencies optimize for meetings booked, not \"why did they say no\" so the intel gets lost\n\ni've seen it work when you brief the agency properly upfront that you want the objections documented. otherwise you're paying lead gen prices for half-assed survey responses",
          "score": 1,
          "created_utc": "2026-01-07 07:27:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny6vszg",
          "author": "EnoughDig7048",
          "text": "Running targeted campaigns through an agency like OutreachBloom can help validate product-market fit without committing a huge internal team.",
          "score": 1,
          "created_utc": "2026-01-07 12:47:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q217hl",
      "title": "University of Georgia - Qualitative Market Research",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1q217hl/university_of_georgia_qualitative_market_research/",
      "author": "Commander-Yu-Gi-Oh",
      "created_utc": "2026-01-02 15:17:26",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Hi folks, \n\nHope you're having a great start in 2026!\n\n  \nI'm refreshing my background in market research (I'm a freelance qualitative analyst) and considering the University of Georgia's QMR course. Has anyone done it before, and what are your thoughts on it?\n\n  \n[https://www.georgiacenter.uga.edu/professional-programs/qualitative-market-research/](https://www.georgiacenter.uga.edu/professional-programs/qualitative-market-research/)\n\n  \nThank you all!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1q217hl/university_of_georgia_qualitative_market_research/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nxaaczu",
          "author": "AbroadAmbitious9372",
          "text": "Go for the MMR program. The QMR is outdated and not credible enough to land u a job, unless you just need a refresher",
          "score": 4,
          "created_utc": "2026-01-02 17:24:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxaar6q",
              "author": "Commander-Yu-Gi-Oh",
              "text": "I see! Thanks for the input.",
              "score": 1,
              "created_utc": "2026-01-02 17:26:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxb7w5m",
          "author": "ECSJack",
          "text": "Most of the UGA courses are fairly rudimentary and really best as an intro or refresher. I’d recommend looking into Research Rockstar or RIVA regarding their qual courses and other content. There may be some others as those were the ones off the top of my head.",
          "score": 5,
          "created_utc": "2026-01-02 20:01:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxb836o",
              "author": "Commander-Yu-Gi-Oh",
              "text": "Amazing! Thanks",
              "score": 1,
              "created_utc": "2026-01-02 20:02:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxcwr26",
          "author": "Ghost-Rider_117",
          "text": "honestly depends on what you're trying to get out of it. if you're just getting started with qual research, UGA's course is solid for fundamentals - they do a good job covering interviewing techniques and analysis basics. but yeah like others said, it's more of an intro level thing.\n\n\n\nif you already have some experience i'd def look into more advanced stuff or just dive into actual projects. hands-on experience beats most courses tbh",
          "score": 2,
          "created_utc": "2026-01-03 01:17:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxe8i5b",
              "author": "Commander-Yu-Gi-Oh",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-01-03 06:25:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pyuerq",
      "title": "How do you sell an experience, not a product?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1pyuerq/how_do_you_sell_an_experience_not_a_product/",
      "author": "Active-Tour4795",
      "created_utc": "2025-12-29 18:44:32",
      "score": 6,
      "num_comments": 11,
      "upvote_ratio": 0.88,
      "text": "I’ve been thinking a lot about how differently people perceive buying a tangible product versus buying an experience. With products, there are specs, alternatives, and easy price comparisons. With experiences, the value often only becomes clear after someone has actually lived through it.\n\nFor those who’ve worked with experience-based or service products, what truly helped people understand the value before buying?  \nWas it storytelling, reviews, how it was framed, some form of trial, or something else?\n\nI’d really appreciate real examples and lived experience, not theory.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1pyuerq/how_do_you_sell_an_experience_not_a_product/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nwm161e",
          "author": "coffeeebrain",
          "text": "I sell consulting which is basically selling an experience, and honestly the only thing that's worked is past client results and word of mouth.\n\nPeople don't really get what research consulting is worth until they've seen it work. So I focus on showing concrete examples - like \"helped this company validate their pricing model, saved them from building the wrong features\" with specific outcomes.\n\nTrials don't really work for consulting because the value is in the full process, not a sample. What works better is being really specific about what problem you solve and showing proof you've solved it before.\n\nAlso most of my clients come from referrals because someone they trust vouched for the experience. That's way more powerful than any messaging or positioning I could do.",
          "score": 5,
          "created_utc": "2025-12-29 20:58:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlp68x",
          "author": "toragirl",
          "text": "Are you familiar with Jobs To Be Done frameworks? Understanding what people get from your experience or service is critical.",
          "score": 4,
          "created_utc": "2025-12-29 19:59:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwlz00l",
              "author": "Saffa1986",
              "text": "This. JTBD is a fantastic framework for thinking about this.",
              "score": 1,
              "created_utc": "2025-12-29 20:47:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwpruaw",
          "author": "tolga-kizilkaya",
          "text": "Reviews beat marketing every time, especially when they describe feelings not features.",
          "score": 3,
          "created_utc": "2025-12-30 11:43:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlgn9p",
          "author": "qwerSr",
          "text": "Watch any advertisement for a Disney cruise or theme park. They have been masters of selling experiences for decades. I suspect, if you analyze their approach, you'll conclude that they are selling the benefits of making family memories.",
          "score": 2,
          "created_utc": "2025-12-29 19:18:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlxuub",
          "author": "Blossom1111",
          "text": "Outcomes and emotions. Focus on how you want to feel. An example would be a yoga retreat or a spa day. It focuses on the outcome of feeling better.",
          "score": 2,
          "created_utc": "2025-12-29 20:42:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlysl2",
          "author": "belledamesans-merci",
          "text": "Hard to say without knowing more about the product. Lots of experiences *do* have equivalents of specs, prices and alternatives — consider cruises. Different cruises will have different amenities and excursions, cost per day, other lines/companies. What kind of experience were you thinking of?",
          "score": 2,
          "created_utc": "2025-12-29 20:46:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwm3tw6",
          "author": "SouthSet7206",
          "text": "It can vary a bit if you’re talking about business to business services or consumer services. In the consumer world, some of the things that I’ve seen include the power of nostalgia, for example, people being willing to pay more for a specific brand of camping equipment because that’s the brand that they used when they went camping with their grandparents as a child. Another thing that can be really big is the power of status, which sometimes is about aspiration or wanting to project a certain social status to a friend group. In these cases, you may find that a certain segment of your target population is willing to pay more because they want something that conveys status.",
          "score": 1,
          "created_utc": "2025-12-29 21:11:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmfmob",
          "author": "sauldobney",
          "text": "People buy moods. So you sell the outcome and mood experience. The wow and pop. Refreshing (Coke). The happy smile (Colgate). Excitement (roller coaster). Wonder and awe (Disney). Laughter (most beer commercials). Social reaction (fashion and diets). Access to elite society (perfume).  Relief (most medications). Anti-frustration (Apple). Comfort or safety (most modern car ads - used to be sexual attractiveness). Reliability (most business purchases). What mood are you selling to your buyer? How much is that mood 'worth'?",
          "score": 1,
          "created_utc": "2025-12-29 22:08:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwnmb2m",
          "author": "Careeropportunity365",
          "text": "Feelings. Illicit feelings",
          "score": 1,
          "created_utc": "2025-12-30 01:59:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwo853t",
          "author": "Lex_Rock",
          "text": "The thing vs what happens around the thing - value drivers (emotional and functional benefits).",
          "score": 1,
          "created_utc": "2025-12-30 04:02:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q1x0o2",
      "title": "What’s the most common mistake people make when writing survey questions?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1q1x0o2/whats_the_most_common_mistake_people_make_when/",
      "author": "External_Forever_453",
      "created_utc": "2026-01-02 12:09:04",
      "score": 6,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "I review a lot of surveys and see leading questions everywhere.\n\nThings like “How helpful was our amazing product?” 😅\n\nFrom a research perspective, what mistakes do you see most often  and how do you usually fix them?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1q1x0o2/whats_the_most_common_mistake_people_make_when/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nx9iwjx",
          "author": "why_is_not_real",
          "text": "Leading questions that assume the answer you want to hear.\n\nI've been doing customer research for a product we're building, and I keep seeing surveys that ask things like \"How much do you love our new feature?\" instead of \"How would you rate this feature?\"\n\nOther big one: asking multiple things in one question. \"How satisfied are you with our speed and accuracy?\" Which one am I rating?\n\nFrom the managers I've talked to, the best survey questions are:\n- One thing per question\n- Neutral wording\n- Simple scale (1-5 is enough, don't overthink it)\n- Optional comment box for context\n\nTiming matters more than perfect wording though. A mediocre question asked at the right moment beats a perfect question sent too late.",
          "score": 5,
          "created_utc": "2026-01-02 15:14:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxcdv3m",
          "author": "Naughteus_Maximus",
          "text": "A common one I see is screwing up the question logic / piping. This destroys the entire survey after an early question because people keep getting asked irrelevant questions. You really need to test the flow in preview mode, by selecting different answers, and send it to colleagues to complete in preview as well. \n\nAlso forgetting a \"not applicable\" type answer in MCQs, which forces people who don't have anything to say on the topic  to give a made up answer just to advance through the survey, or abandon the survey. \n\nIdeally, you would give the survey to another professional researcher to try to break - they should be able to spot things you may not have foreseen regarding how real respondents may misinterpret a question, or find themselves trapped by your logic when you wrote a question, because it does not fit their experience / opinion. \n\nIn the past year I completed 3 surveys (via Reddit / a friend), written by university-level researchers, which were pretty shocking to be honest. I don't know how they made it through their research supervisor.",
          "score": 4,
          "created_utc": "2026-01-02 23:32:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxdhfbc",
              "author": "catwithbillstopay",
              "text": "This. A feature in something I made has the standard “let AI make a survey based on what you need blah blah”. It’s nifty, and I’m hoping to ease survey analytics drudge work, but honestly AI can’t do quite a lot. And likely won’t ever be great at doing logic and piping. \n\nI mixed on NA because sometimes you want to “direct” an answer and have people reveal an opinion. And too many NAs can screw up flow as well or render counter factual questions invalid. But it really does depend.\n\nGreat advice!!",
              "score": 1,
              "created_utc": "2026-01-03 03:18:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxa18ut",
          "author": "Common-Finding-8935",
          "text": "Asking questions that require elaborate, complex and nuanced answers. ",
          "score": 2,
          "created_utc": "2026-01-02 16:41:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxtoeeh",
          "author": "VyprConsumerResearch",
          "text": "A lot of the most common survey mistakes come down to biased or leading questions, unclear objectives, and over-reliance on self-reported intentions rather than actual behaviour. One effective approach is to design questions that are neutral and focused on real-world actions, then combine them with robust consumer segmentation and behavioural filters to ensure the responses reflect your target audience. Adding qualitative checks like short video or open-text responses can also reveal nuances that numbers alone miss, giving a more reliable, actionable view of how people actually experience your product or brand.",
          "score": 1,
          "created_utc": "2026-01-05 14:44:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q2my3b",
      "title": "How do you avoid biased samples when running online surveys?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1q2my3b/how_do_you_avoid_biased_samples_when_running/",
      "author": "Pretend-Raspberry-87",
      "created_utc": "2026-01-03 06:07:17",
      "score": 4,
      "num_comments": 9,
      "upvote_ratio": 0.84,
      "text": "It’s easy to end up surveying the “wrong” audience.\n\nHow do you usually control for bias when distributing surveys online?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1q2my3b/how_do_you_avoid_biased_samples_when_running/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nxen65q",
          "author": "Belloz22",
          "text": "Bit confused by your question. \n\nBut essentially:\n\n- set screener questions based on who you need to speak to\n- set quotas to try and control representativeness\n- data clean afterwards\n- potentially include a trap / attention check question \n\nGenerally with online panels, I don't trust their panel data is up to date, hence I set an Incidence Rate and then will use my own screener questions.",
          "score": 11,
          "created_utc": "2026-01-03 08:30:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxrk58b",
              "author": "creativeinnovator3",
              "text": "This! Always always screen for the right people. But bias is not just sample; it can be the way a question is written too.",
              "score": 1,
              "created_utc": "2026-01-05 04:54:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxean51",
          "author": "Saffa1986",
          "text": "What bias are you concerned about?",
          "score": 4,
          "created_utc": "2026-01-03 06:43:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxrn6ry",
          "author": "soleana334",
          "text": "I’m mostly concerned about bias caused by a mismatch with the decision context, when the sample is clean but respondents would never face the tradeoff the insight is meant to inform.",
          "score": 1,
          "created_utc": "2026-01-05 05:15:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxtixhd",
          "author": "coffeeebrain",
          "text": "I'm in UX research not market research, but sampling bias is a problem for us too.\n\nWhat I do: be really specific about screening criteria upfront. Like if I need \"small business owners who use accounting software,\" I screen for company size, revenue, and what tools they actually use. Generic screening gets you generic people who don't match your target.\n\nAlso avoid convenience sampling if you can. Like don't just post a survey link on Twitter and call it research - you'll only get Twitter users who saw your tweet.\n\nFor B2B stuff, I've used panels like Respondent and UserInterviews. Also tried CleverX a couple times when I needed really specific business roles (like CISOs or finance directors). Full disclosure, I've used it as a consultant. Definitely more expensive than consumer panels but the targeting is better if you need senior people.\n\nThe main thing is know who you're actually reaching and be honest about the limitations. Every sampling method has bias, you just need to be aware of it.",
          "score": 1,
          "created_utc": "2026-01-05 14:14:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxtnw1c",
          "author": "VyprConsumerResearch",
          "text": "The biggest lever is being intentional about who you sample, not just how many responses you collect. Clear screening criteria, balanced quotas, and behaviour-based questions help reduce bias, and it’s important to sense-check results against real-world behaviour rather than taking survey answers at face value.",
          "score": 1,
          "created_utc": "2026-01-05 14:42:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxz3f71",
          "author": "Business-Bandicoot50",
          "text": "Stratified random sampling and survey design that is inclusive and/ or uses approaches to target less responsive groups.  If it helps, I put together an [article ](https://erisstrategy.com.au/using-behavioural-science-to-improve-your-community-research/)on this local government, community and other clients that faced issues with low response rates from some segments.",
          "score": 1,
          "created_utc": "2026-01-06 08:23:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny139n3",
          "author": "Ghost-Rider_117",
          "text": "great q! one thing that helps is using post-stratification weighting when you know your population parameters. even if your sample skews a certain way, you can adjust for it in analysis.\n\n\n\nalso worth checking completion rates by different demo groups - if certain segments are dropping out more, that tells you something about potential bias. and yeah quotas are clutch but make sure they're based on actual population stats not just gut feel",
          "score": 1,
          "created_utc": "2026-01-06 16:21:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q1628x",
      "title": "How do you usually turn survey charts into clear insights without over interpreting the data?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1q1628x/how_do_you_usually_turn_survey_charts_into_clear/",
      "author": "soleana334",
      "created_utc": "2026-01-01 14:58:42",
      "score": 4,
      "num_comments": 6,
      "upvote_ratio": 0.84,
      "text": "I usually keep it to one neutral, data led sentence per chart and avoid recommendations unless they’re explicitly asked for. Curious how others handle this.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1q1628x/how_do_you_usually_turn_survey_charts_into_clear/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nx3t373",
          "author": "DataBeeGood",
          "text": "I always suggest to my junior researchers: first look for what’s universal, like does the chart show that everybody in this target population has a consistent attitude or behavior (“ high satisfaction with product X among recent buyers is nearly universal”).  Second, look for differences: is this an attitude or a behavior that varies a lot perhaps by a demographic variable? Because if you start to see that recurring as a pattern that can be really valuable insights: hypothetically, “a recurring theme in the data is that gender and frequency of product usage  are strong predictors of satisfaction with product X”. Though of course with that statement, if those two variables are colinear you should point that out.",
          "score": 7,
          "created_utc": "2026-01-01 17:13:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx45xrg",
          "author": "ghost_suburbia",
          "text": "It depends on your role. If you are supply side, highlight universal truths and points of difference. If you are client side, your job is interpretation.  The executive summary is recommending action, and only slides supporting that summary appear before the appendix divider. The headlines are explicit about why the slide is important. If the slide isn't a answering a question or demonstrating an insight, it goes to the back of the deck. If you find your recommendations are unwelcome or poorly received, then presocializing and workshopping findings need to happen first.",
          "score": 4,
          "created_utc": "2026-01-01 18:18:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx3cu5c",
          "author": "soleana334",
          "text": "One thing I also watch for is whether the chart answers a question or just shows a number. Curious if others think about it that way.",
          "score": 3,
          "created_utc": "2026-01-01 15:46:42",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "nx3j3fx",
          "author": "coffeeebrain",
          "text": "I do qualitative research mostly, not surveys, but same principle applies - let the data speak for itself.\n\nI usually write what I see (\"60% of users said X\"), then one level of interpretation (\"this suggests Y might be happening\"), then stop. If stakeholders want recommendations, they'll ask.\n\nThe temptation is always to jump to \"so we should do Z\" but yeah, that's overstepping unless they specifically want that.\n\nHonestly most executives ignore the nuance anyway and just look at the charts, so keeping it simple probably helps more than hurts.",
          "score": 3,
          "created_utc": "2026-01-01 16:20:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx443qe",
          "author": "gropbot",
          "text": "I'd say it depends on your role in the company. As a researcher, the more senior I got, the more my job was less about delivering data but sparring with stakeholders, helping them to think using those data. Try to present an invitation to think and discuss rather than presenting bland numbers or your take on possible solutions?",
          "score": 1,
          "created_utc": "2026-01-01 18:09:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q06ubm",
      "title": "Are completely free survey tools actually usable for real research?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1q06ubm/are_completely_free_survey_tools_actually_usable/",
      "author": "Candid_Positive8832",
      "created_utc": "2025-12-31 07:13:14",
      "score": 4,
      "num_comments": 10,
      "upvote_ratio": 0.84,
      "text": " I’ve been looking into different survey platforms for internal research like employee feedback, customer satisfaction, and NPS. One thing that stands out is how many tools heavily limit responses or questions unless you upgrade.\n\nI recently came across a platform that claims to be fully free with unlimited surveys and responses, which made me curious (and a bit skeptical).\n\nFor those with experience in market research:\n\n* Have you used any truly free survey tools beyond small tests?  \n* Where do they usually fall short  data quality, logic, exports, privacy?  \n* Do you think they’re suitable for internal or exploratory research, or do paid tools always win in the long run?  \n\nNot sharing a survey here  just looking to learn from real experiences.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1q06ubm/are_completely_free_survey_tools_actually_usable/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nwvnzpj",
          "author": "Saffa1986",
          "text": "Nothing in life is free. \n\n\nYou can probably get away with things like Microsoft / Google surveys / forms, but they won’t have advanced tools and techniques, and fall short on logic. \n\n\nBut decent platforms - free means limited functionality or responses.",
          "score": 8,
          "created_utc": "2025-12-31 07:34:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvr2t5",
              "author": "kindtree2",
              "text": "Perhaps also the survey company also then owns and can use the results from the data gathered via the free tool?",
              "score": 2,
              "created_utc": "2025-12-31 08:03:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwxtddf",
                  "author": "jelybely8",
                  "text": "If you ever see something to that effect in the terms of a survey tool, RUN!",
                  "score": 1,
                  "created_utc": "2025-12-31 16:45:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwvvp9h",
          "author": "vikram-suthar",
          "text": "Frustrated with the same limitations, I've built a tool which can give you 10k free response. Adavance logic building and integrations. \nCharges only for removing the branding.\n\nIf this sounds something that might interest, I can share the link here.",
          "score": 2,
          "created_utc": "2025-12-31 08:46:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwz5tix",
          "author": "why_is_not_real",
          "text": "I think the real question is what you're trying to achieve with the research.\n\nFor one-off market research projects, free tools (Google Forms, Typeform free tier) are honestly pretty solid. You get responses, you can export the data, you're good to go.\n\nThe gap I've seen (technical founder here, doing a lot of user research) is when you need *systematic* feedback - like recurring customer satisfaction measurement, post-purchase surveys, or continuous feedback loops. Free tools fall apart because:\n\n1. **No automation** - You're manually sending surveys each time\n2. **No integration** - Can't trigger surveys based on customer behavior or events\n3. **No workflow** - Feedback sits in a spreadsheet, doesn't route to the right people\n\nFor research, you're probably doing projects, so free tools work fine. For B2B companies trying to measure customer health continuously, that's where paid tools start making sense.\n\nWhat's your use case specifically?",
          "score": 1,
          "created_utc": "2025-12-31 20:54:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxsbq4o",
          "author": "stevenbellomy",
          "text": "Google forms is free but it falls short due to lack of features. Jotform has a free plan that has tons of features and templates but it limits the number of forms you can create and submissions you can receive. Every tool has its tradeoff.",
          "score": 1,
          "created_utc": "2026-01-05 08:41:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwy2e0o",
          "author": "productman2217",
          "text": "Not exactly free but you can generate one report using my product for free [https://reviewbuddy.site/](https://reviewbuddy.site/). It does comprehensive analysis of Trustpilot customer reviews for any company. Yours or your competitors. Find gaps, improve support, grow sales based on the AI feedback. [https://reviewbuddy.site/](https://reviewbuddy.site/)",
          "score": 0,
          "created_utc": "2025-12-31 17:30:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q1jzdm",
      "title": "Social Listening Research Pay and Job Titles",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1q1jzdm/social_listening_research_pay_and_job_titles/",
      "author": "Cherylblossoms",
      "created_utc": "2026-01-02 00:30:48",
      "score": 4,
      "num_comments": 2,
      "upvote_ratio": 0.84,
      "text": "For anyone working in a social listening job, what is the typical pay and job title (especially in house)? \n\nSecondary question is how prevalent these jobs are compared to traditional market research jobs. Do most companies have them or are they still pretty rare? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1q1jzdm/social_listening_research_pay_and_job_titles/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "nx6p9q0",
          "author": "soleana334",
          "text": "Social listening roles are often part of insights or research teams rather than fully standalone positions. Compensation is generally similar to MR roles at comparable levels. In practice, the role tends to gain influence only when the outputs are framed as decision inputs rather than volume or sentiment reports. The main difference is whether insights are used in decision-making or primarily for reporting.",
          "score": 8,
          "created_utc": "2026-01-02 02:32:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q5nwvm",
      "title": "Open ended questions or structured ones which do you lean on more?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1q5nwvm/open_ended_questions_or_structured_ones_which_do/",
      "author": "bhargavwv",
      "created_utc": "2026-01-06 16:51:53",
      "score": 4,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "When you’re early in research, do you prefer letting people talk freely, or keeping things structured?\n\nOpen-ended answers often bring great insights, but they can get messy fast. Structured questions are easier to analyze, but sometimes feel limiting.\n\nHow do you usually balance the two?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1q5nwvm/open_ended_questions_or_structured_ones_which_do/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "ny1yp7s",
          "author": "The_Scrabbler",
          "text": "It depends on the context. If you’re exploring a new-ish topic, then open ended; but if you’re starting on something you have a lot of existing knowledge on, then go for structured questions.",
          "score": 3,
          "created_utc": "2026-01-06 18:43:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny37vs4",
          "author": "sauldobney",
          "text": "Structured questions are used for measurement. Open ends are used for exploration. Measurement needs standardization. For things like estimating market share, market penetration, demand curves and trends or pre- post- product or ad testing you need measurement. Open ends alone are not good enough.",
          "score": 3,
          "created_utc": "2026-01-06 22:10:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny1rbj5",
          "author": "OkNeighborhood4811",
          "text": "I usually lean toward open-ended questions early on. At that stage, the goal for me is to understand how people frame the problem in their own words, not to test assumptions too quickly. Once patterns start to emerge, I find structured questions much more useful for validation and comparison.",
          "score": 1,
          "created_utc": "2026-01-06 18:10:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny2a7c8",
          "author": "mrdllnt",
          "text": "Depends on the length of survey, too. If you have too many OEs, it’s guaranteed respondent fatigue — either you get dropouts or sh*tty answers.",
          "score": 1,
          "created_utc": "2026-01-06 19:35:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny2jlyc",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-06 20:18:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny43779",
              "author": "Marketresearch-ModTeam",
              "text": "Sorry, no ads here please.",
              "score": 1,
              "created_utc": "2026-01-07 00:49:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "ny3bn0x",
          "author": "AbroadAmbitious9372",
          "text": "Are you talking about on a survey or a qual study?",
          "score": 1,
          "created_utc": "2026-01-06 22:28:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny45al1",
          "author": "kubrador",
          "text": "depends on if i actually know what i'm looking for yet\n\nearly stage? open-ended all the way. you don't know what you don't know, and people will tell you shit you never thought to ask about\n\nonce you've got themes emerging, then you lock it down with structured stuff so you can actually quantify it\n\nthe \"messy\" part is the whole point early on. if your qual data is clean and tidy you probably asked leading questions",
          "score": 1,
          "created_utc": "2026-01-07 01:00:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny6a1ve",
          "author": "Contra1to",
          "text": "If it's really early in the research stage, I tend to favor doing quals first before quant.",
          "score": 1,
          "created_utc": "2026-01-07 09:55:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny6lnzt",
          "author": "coffeeebrain",
          "text": "I'm in UX research not market research, but same principles apply.\n\nEarly on I always go open-ended. Like \"walk me through the last time you did X\" rather than \"do you use feature Y?\" You learn stuff you didn't know to ask about.\n\nOnce I understand the problem space better, I'll add more structured questions or even surveys to validate patterns at scale.\n\nThe mistake people make is jumping to structured questions too early because they're easier to analyze. But then you're only validating assumptions, not discovering new insights.\n\nStart messy, add structure later.",
          "score": 1,
          "created_utc": "2026-01-07 11:35:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny7f9a4",
          "author": "VyprConsumerResearch",
          "text": "Early research tends to work best with a hybrid approach: start open-ended to uncover unexpected insights, then layer in structured questions to capture patterns and make analysis easier. That way, you get rich, authentic feedback without losing the ability to quantify and compare responses.",
          "score": 1,
          "created_utc": "2026-01-07 14:37:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nydq6w1",
          "author": "Odd-Courage-",
          "text": "I usually start **open, then tighten**.\n\nEarly on, open-ended questions help you hear what you *didn’t know to ask*. That’s where the real insights show up. Once patterns emerge, I switch to structured questions to validate, compare, and prioritize.\n\nOpen for discovery. Structured for decisions.\n\nIf you lock things down too early, you miss context. If you stay open too long, you drown in noise. The balance is letting people talk first, then giving their answers a shape.",
          "score": 1,
          "created_utc": "2026-01-08 11:34:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyj5m43",
          "author": "LeatherEconomics8604",
          "text": "How would you define this post? In your view, did you ask an open ended question or a structured question?",
          "score": 1,
          "created_utc": "2026-01-09 03:34:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}