{
  "metadata": {
    "last_updated": "2026-01-27 16:59:04",
    "time_filter": "week",
    "subreddit": "Marketresearch",
    "total_items": 4,
    "total_comments": 16,
    "file_size_bytes": 19272
  },
  "items": [
    {
      "id": "1qku5w4",
      "title": "When do you actually trust your survey sample?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qku5w4/when_do_you_actually_trust_your_survey_sample/",
      "author": "Batson_Beat",
      "created_utc": "2026-01-23 15:41:54",
      "score": 12,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "This might be a basic question, but I keep second-guessing myself on it.\n\n\n\nYou run a survey, responses start rolling in, and everything looks fine… but then you start wondering if you just ended up hearing from the easiest people to reach.\n\n\n\nAt what point do you personally feel comfortable saying, “yeah, this is good enough to act on”?\n\n\n\nIs it when:\n\n\n\nthe demographics look roughly right?\n\n\n\nanswers start repeating?\n\n\n\nmore responses stop changing the takeaway?\n\n\n\nInterested to hear how others here think about this, especially in scrappier or early-stage research.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qku5w4/when_do_you_actually_trust_your_survey_sample/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o1ag774",
          "author": "alexisappling",
          "text": "A few things. Firstly, I never trust sample which has been cleaned by an agency. I want to know the spread of speeders and bots, and I compare that to past experience. If there aren’t enough of them, then I haven’t found them all yet. \n\nSecondly, I read verbatims. I sort by length and do a chart of it. I find all the ones written by AI, have a good giggle at the worst of them, throw them out, and focus on what looks real. Does it chime, and are there enough where it sounds like they actually have engaged a bit. \n\nLastly, I throw it all out and go to the pub, safe in the knowledge that a csv full of bullshit can’t harm me there.",
          "score": 11,
          "created_utc": "2026-01-23 19:06:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ffavw",
              "author": "_1nfiniteZest",
              "text": "Big plus one for verbatims. I always include one in every survey for this exact reason.",
              "score": 1,
              "created_utc": "2026-01-24 14:14:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1aj2fy",
          "author": "coffeeebrain",
          "text": "honestly i never fully trust survey data. people lie or don't know what they actually want.\n\nwhat i look for is when adding more responses stops changing the main takeaway. if the first 100 say one thing and the next 100 say the same thing, that's probably your answer.\n\nalso demographics mattering depends on what you're researching. if you're asking about product preferences, yeah demographics matter. if you're asking about a specific workflow problem, maybe less.\n\nbut real talk, i trust behavior way more than surveys. what people say they'll do vs what they actually do are usually different. if you can validate survey findings with usage data or interviews, that's way better.",
          "score": 7,
          "created_utc": "2026-01-23 19:20:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1cmvzk",
              "author": "0nin_",
              "text": "Agree. I like to look at what people Feel, Think, Say, Do. The feel and think is more a matter of “putting self in their shoes” which is generally frowned upon in this industry. But the say-do gap is huge. And combining them when possible is awesome, problem is it’s often not possible lol",
              "score": 1,
              "created_utc": "2026-01-24 01:43:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o199at0",
          "author": "Narrow-Hall8070",
          "text": "What sample are you using and how are you fielding it?",
          "score": 6,
          "created_utc": "2026-01-23 15:53:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19huuh",
          "author": "0nin_",
          "text": "Run it a second time from a different source to compare. Drop in some questions you already know the expected outcomes to compare. Lots can be done, even aside from vendor sample selection",
          "score": 2,
          "created_utc": "2026-01-23 16:31:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hrocx",
          "author": "improvedataquality",
          "text": "For me, the “good enough to act on” line starts *before* responses ever come in. You really have to sit down and be explicit about who actually needs to be in your sample to answer your research question. If you haven’t defined what “relevant” means for your decision, it’s easy to convince yourself that a clean-looking dataset is representative when it’s just convenient.\n\nThat said, representativeness is only one piece of the puzzle. In today’s survey world, you can’t take responses at face value anymore. Between AI agents, server farms, VPNs, and coordinated low-effort responding, a dataset can look perfectly reasonable on the surface and still be deeply compromised. That’s why I think “demographics look right” or “answers are stabilizing” are necessary but not sufficient signals.\n\nYou need checks and balances baked into the survey itself. That means screening for careless responding (instructed response items, consistency checks, response timing) *and* using tools or design features that help detect bots and fraudulent traffic. The goal isn’t to over-police respondents, but to make sure the patterns you’re seeing are coming from real people engaging with the questions as intended.\n\nSo when do I feel comfortable acting on the data? It’s when three things line up:  \nthe sample makes sense for the question, the results stop changing in meaningful ways, and I have reason to trust the responses themselves. If any one of those is shaky, I’m a lot more cautious about drawing conclusions, especially in scrappier or early-stage work.",
          "score": 1,
          "created_utc": "2026-01-24 20:43:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sf08x",
          "author": "VyprConsumerResearch",
          "text": "A good rule of thumb is when new responses stop changing the decision, not just the percentages. If the sample broadly matches who you’re trying to reach and insights start repeating across different segments or channels, it’s usually actionable, even if it’s not statistically perfect. In early-stage work, confidence comes from directional consistency and triangulation, not hitting an arbitrary sample size.",
          "score": 1,
          "created_utc": "2026-01-26 09:10:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19ihaj",
          "author": "SG-Man1990",
          "text": "I suppose you are referring to quantitative research, but you also mentioned early stage and scrappier research which is typically a premise for qualitative, so it depends on your objectives and topic.\n\n\nTrust in Quantitative is based on sample size, margin of error and representativeness - it is \"good to act on\" when you have surveyed n=1000 people who are representative of the population by Age, Gender or other census variables.\n\n\nIt is \"not good to act on\" even if it is n=1000 but your sample came from your high school (biased source).\n\n\nIn early stage or scrappier research, it is harder to do a full Quantitative piece as the questions you ask may not make sense - for example if you are launching a new product that does not even exist in the market yet. At this stage, numbers still matter but insights are treated as directional only.",
          "score": 0,
          "created_utc": "2026-01-23 16:34:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qizubu",
      "title": "Market research data for Southeast Asian countries",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qizubu/market_research_data_for_southeast_asian_countries/",
      "author": "monkeybread5",
      "created_utc": "2026-01-21 14:49:04",
      "score": 8,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I’ve always found that reports on SEA countries are very limited. \n\nFor industrial markets like paint, lubricants or even cleaning. Any recommendations for what type of data or research companies could be useful? \n\nI’d want to spend less than USD10k",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qizubu/market_research_data_for_southeast_asian_countries/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o10surv",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-22 10:09:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10w4ml",
              "author": "monkeybread5",
              "text": "From the sample reports, how can I know if the full report is going to be accurate? Any tips? I’m new to SEA countries :(",
              "score": 1,
              "created_utc": "2026-01-22 10:38:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1pkig5",
          "author": "abdush",
          "text": "voice of the customer driven qualitative insights should be possible within this budget.",
          "score": 1,
          "created_utc": "2026-01-25 22:47:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmmt4v",
      "title": "Do companies have dedicated Qualitative PMs anymore?",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qmmt4v/do_companies_have_dedicated_qualitative_pms/",
      "author": "itsjustme123446",
      "created_utc": "2026-01-25 15:56:15",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Many recruiting companies used to have dedicated qual PM teams however it’s rare to see job listings for that anymore. Do companies now only have combined qual and quant PM’s?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qmmt4v/do_companies_have_dedicated_qualitative_pms/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o1pkb0m",
          "author": "abdush",
          "text": "While there are still, the number of openings are very low of late.",
          "score": 5,
          "created_utc": "2026-01-25 22:46:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1npd8o",
          "author": "alexisappling",
          "text": "There are still qual PM in UK and IRL.",
          "score": 3,
          "created_utc": "2026-01-25 17:57:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1q0kx6",
          "author": "sk_queen",
          "text": "I’m a dedicated qual PM/operations manager at my boutique MR agency. I also have a dedicated quant counterpart at the company. We exist!",
          "score": 2,
          "created_utc": "2026-01-26 00:02:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1tj0b9",
              "author": "itsjustme123446",
              "text": "Glad to know qual PMs still exist!  I’ve worked qual HC and pharma for a few years. I will keep looking for opportunities.",
              "score": 1,
              "created_utc": "2026-01-26 14:06:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qm28i6",
      "title": "Interview advice",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qm28i6/interview_advice/",
      "author": "EmotionalMobile4626",
      "created_utc": "2026-01-24 23:17:26",
      "score": 6,
      "num_comments": 13,
      "upvote_ratio": 0.87,
      "text": "Hi all,\n\nI have an upcoming HR screening for a Market Research Manager role at Ipsos (North America), and I’d love any advice on how to stand out and move to the next round.\n\nI’ve been hoping to return to Ipsos for a while now — I started my career there and really valued the structure and rigor. I’m not sure which team this role is for (the recruiter didn’t specify), so I’m trying to prepare broadly.\n\nIf anyone has insights on these, would be great! \n\n• What HR typically looks for in Manager-level candidates\n\n• Any keywords, themes, or values that resonate with Ipsos NA culture\n\n• How to frame prior Ipsos experience in a way that stands out\n\nThanks in advance!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qm28i6/interview_advice/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o1irc61",
          "author": "MarMar2617",
          "text": "What is your background and how does it align with this role? \n\nIf your background is a good fit then really wouldn’t worry about HR interview.  It will be very basic and if you have experience that alings and can coherently answer questions then will move on to next round. \n\nThey do have “values” so yes look those up on their site. Can throw in somewhere during interview process that those values also resonate with you.  \n\nBest of luck",
          "score": 5,
          "created_utc": "2026-01-24 23:37:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1j6y76",
              "author": "EmotionalMobile4626",
              "text": "Thanks — that’s helpful to hear.\nMy background is in quant research across healthcare, MedTech, CPG, and tech. I have 3 years of experience and I actually started my career at Ipsos and really liked it, so I’m hoping to return at a Manager level now that I’ve had broader experience. I’ll definitely look up the values and weave them in — appreciate the reminder!",
              "score": 1,
              "created_utc": "2026-01-25 00:58:50",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1j8jl2",
              "author": "EmotionalMobile4626",
              "text": "I have experience in supporting the full project lifecycle on both brand tracking and ad hoc projects too.",
              "score": 1,
              "created_utc": "2026-01-25 01:07:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1jbgqa",
                  "author": "MarMar2617",
                  "text": "It’s challenging to find mangers with this exact experience (I’ve tried to fill this type of position) so imagine they would jump on your profile!  \n\nAs a hiring manager things I look for (outside of the basics like project management and analytic abilities) is someone who is curious, proactive, a problem solver.  Before bringing a problem to manager - you try to outline the solutions. \n\nNot needed at this stage, but bonus points if you are interested in business development for your career progression. Fewer people are so that’s something that can make you unique.",
                  "score": 1,
                  "created_utc": "2026-01-25 01:24:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1jhzez",
          "author": "Salt-Tree2257",
          "text": "FYI Kantar is currently hiring for the same level",
          "score": 2,
          "created_utc": "2026-01-25 02:00:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1jtw49",
              "author": "EmotionalMobile4626",
              "text": "Thanks for the info!",
              "score": 1,
              "created_utc": "2026-01-25 03:05:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ljjga",
          "author": "silver70seven",
          "text": "I think if you have previously worked there and had a good record and experience, you’re ahead of the pack. But they might dig to find out internal feedback.",
          "score": 1,
          "created_utc": "2026-01-25 10:48:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1nsoeg",
              "author": "EmotionalMobile4626",
              "text": "Oh thats a plus then, since I left on good terms with the previous team.",
              "score": 1,
              "created_utc": "2026-01-25 18:11:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1oa4rp",
                  "author": "silver70seven",
                  "text": "Why don’t you message your old boss or colleagues and let them know you applied and could use an internal reference",
                  "score": 2,
                  "created_utc": "2026-01-25 19:23:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1v3y8u",
          "author": "coffeeebrain",
          "text": "cant help much with ipsos specifically but for manager level hr screens they usually focus on leadership examples and how you handle stakeholder management.\n\nhave solid stories ready about managing conflict, prioritizing projects, and developing team members. hr wants to see youre ready for the people side not just the research side.\n\nmention any tools or platforms youve used that scale research. if youve worked with recruitment platforms like cleverx or similar it shows you think about ops and efficiency.\n\ngood luck, sounds like you already know the culture if you were there before. lean into that.",
          "score": 1,
          "created_utc": "2026-01-26 18:21:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}