{
  "metadata": {
    "last_updated": "2026-02-11 03:30:00",
    "time_filter": "week",
    "subreddit": "Marketresearch",
    "total_items": 3,
    "total_comments": 11,
    "file_size_bytes": 13878
  },
  "items": [
    {
      "id": "1qxp92c",
      "title": "Pricing and packaging study",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qxp92c/pricing_and_packaging_study/",
      "author": "Dangerous-Race-5591",
      "created_utc": "2026-02-06 18:13:43",
      "score": 8,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Pricing and packaging strategy\n\nHey everyone,\n\nI am hoping to base a packaging and pricing strategy on some research that doesn’t involve conjoint (there is no budget and the same would be too small for analysis), what would you recommend?\n\nEdit: with a heavy preference for a somewhat qualitative, maybe informal type of research (again due to sample and type of industry) where the sample size would be small. \n\nThe goal is to as result repackage the service offering for a client.\n\nFeel free to share any dos and donts too.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qxp92c/pricing_and_packaging_study/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o3ybs7g",
          "author": "rucolamara",
          "text": "If you are under significant budget constraints, I would recommend going first with a pricing comparison approach, finding out at what price point are the competitors selling similar solutions. In parallel proceed with cost-based approach, topping up fixed + variable costs and margin to understand what is a profitable price range. Once you combine the 2 info, you get at least an understanding of where you’ll land with your price. This won’t tell you how much consumers are willing to pay, but I would highly discourage against any qualitative approach when it is about pricing.",
          "score": 2,
          "created_utc": "2026-02-06 19:17:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zw28y",
              "author": "Dangerous-Race-5591",
              "text": "Makes sense. I might just follow your advice.",
              "score": 2,
              "created_utc": "2026-02-07 00:09:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e5pku",
          "author": "SG-Man1990",
          "text": "If no conjoint/maxdiff, your best bet would be Van Westerndorp or Gabor Granger which you can make do without the modelling or design elements.",
          "score": 2,
          "created_utc": "2026-02-09 06:35:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4eled2",
          "author": "VyprConsumerResearch",
          "text": "With small samples and no conjoint, I’d lean on qualitative price sensitivity instead of precision. Structured interviews that walk people through trade-offs (“what would make this feel expensive vs fair?”, “what would you drop if the price went up?”), simple package comparisons and card-sorting exercises work surprisingly well. The key do/don’t: anchor discussions in real decisions and budgets, not hypotheticals. Don’t ask people what they *would* pay, ask when they’d hesitate, upgrade, or walk away.",
          "score": 2,
          "created_utc": "2026-02-09 09:04:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4esegs",
              "author": "Dangerous-Race-5591",
              "text": "I like this. I might just give it a shot. Thank you.",
              "score": 2,
              "created_utc": "2026-02-09 10:14:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4jv4uo",
          "author": "coffeeebrain",
          "text": "just talk to 10-15 customers. show them different package options, watch their reactions. they'll tell you what makes sense and what doesn't.\n\nask what they'd actually pay and what they pay competitors now. hypothetical answers are useless.\n\nif you have existing customers that's easiest to recruit. otherwise platforms like cleverx or userinterviews work but need budget for incentives.\n\nsales team also knows which features close deals if you have one.",
          "score": 1,
          "created_utc": "2026-02-10 03:10:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qw5dmw",
      "title": "Consumer insights to competitive intelligence",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qw5dmw/consumer_insights_to_competitive_intelligence/",
      "author": "heyyyou90",
      "created_utc": "2026-02-04 23:56:59",
      "score": 4,
      "num_comments": 9,
      "upvote_ratio": 0.83,
      "text": "Has anyone successfully pivoted from my background and consumer insights to a true competitive intelligence role? I’m mid career in consumer insights, seeking a new role, and I’m really interested in competitive intelligence roles, but for my experience is obviously fairly different. Has anyone successfully made this transition? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qw5dmw/consumer_insights_to_competitive_intelligence/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o3nc6d5",
          "author": "coffeeebrain",
          "text": "haven't done this pivot but the skills transfer pretty well. you're just researching companies instead of consumers.\n\nyou already know how to find patterns, synthesize messy info, and present insights. that's like 80% of ci work.\n\ngap is probably business strategy knowledge and market analysis frameworks. maybe brush up on that stuff before applying.\n\ni'd pitch it as \"i turn complex research into actionable recommendations\" without overemphasizing the consumer part.",
          "score": 2,
          "created_utc": "2026-02-05 02:34:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wccqn",
              "author": "Odd_Dog6616",
              "text": "This is a little bit of speculation because I haven’t worked in a role specifically titled as Competitive Analysis, but I would also suggest that a lot of true value in that function is piecing together competitors’ consumer strategies and outcomes. It’s that way, having a background in consumer insights could make you effective because you’re able to quickly understand and dissect what is going right/wrong for competitors relative to the company you work for. Not to force fit the two roles - competitive intelligence is going to have plenty of strategy and financial analysis as well, but at the end of the day, consumer companies that win are those who serve and speak to their specific audience better than competitors. In that way, there’s a strong analogue between the two roles and you should be set up to be effective. You’re basically doing consumer insights work on competitors’ audiences",
              "score": 1,
              "created_utc": "2026-02-06 13:28:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o425fwf",
          "author": "silver70seven",
          "text": "I did it for a hot minute. The biggest differences between more traditional research and competitive intelligence is mainly related to where the data comes from and what industries youre focused on.  Competitive Intelligence providers tend to use many different data sources across the omnichannel environments including cookie data, alternative data sets like transactional data from credit cards, store performance metrics based on site visits and projected conversions, offline data, etc. traditional MRs tend to stick to the basics like surveys, expert IDIs, and traditional qual. So, there are some different skill sets and such to take into consideration, especially on the tech side as AI is now helping to simplify as well as complicate the infrastructures of said providers.",
          "score": 2,
          "created_utc": "2026-02-07 10:27:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mkx34",
          "author": "The_Scrabbler",
          "text": "You’re going to have to be more descriptive because these are pretty vague labels and roles, and they generally overlap depending on organisation",
          "score": 3,
          "created_utc": "2026-02-05 00:00:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3n9jzb",
          "author": "Super_Fishing9564",
          "text": "There is no money in ’analysis’ and AI is about to gobble those jobs up.\n\nLearn how to sell data/analytics if you want to make money.",
          "score": 0,
          "created_utc": "2026-02-05 02:19:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mm1y3",
          "author": "AdOriginal3767",
          "text": "I fo see alot of comp intelligence roles. I argue its very different from a traditional market research role",
          "score": 0,
          "created_utc": "2026-02-05 00:06:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3movo4",
              "author": "heyyyou90",
              "text": "In what ways would you say it’s different? Note, I tend to agree that that it seems pretty different. What types of backgrounds do you see in competitive intelligence?",
              "score": 1,
              "created_utc": "2026-02-05 00:22:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3n0f24",
                  "author": "AdOriginal3767",
                  "text": "They are more strategy types and even BI. That said, no one is stopping you. Its just a different skill set less focused on running primary research and more on secondary to build learnings. ",
                  "score": 4,
                  "created_utc": "2026-02-05 01:27:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qz3sx4",
      "title": "Can this research be done without individual debrief/consent under GDPR? (Does it count as anonymous?)",
      "subreddit": "Marketresearch",
      "url": "https://www.reddit.com/r/Marketresearch/comments/1qz3sx4/can_this_research_be_done_without_individual/",
      "author": "Vymir_IT",
      "created_utc": "2026-02-08 08:38:55",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 0.81,
      "text": "Hi there. I'm in Germany and I need to conduct a research for an upcoming startup - target audience in population. \n\nI'll be approaching people on the streets with a casual conversation and a call for simple action in order to collect the data that will look like this in the end:\n\nOverall count: 234\nResponded: 47\nResponses:\nResponder 1 (\nGroup 1 traits - Negative\nGroup 2 traits - Positive\nConversational commitment: strong\nActionable commitment: denied\n),\nResponder 2 (\nGroup 1 traits...\nGroup 2 traits...\n)...\n\nWhat \"group traits\" are and which questions define that in the collected data will not be elaborated, it's something I keep in my head. \n\nThe core requirement for this investigation is that responders don't know it's a research, they should be thinking we are having a regular conversation, to not prime them - otherwise data will become biased and useless.\n\nCan I do this legally without debriefing and collecting consent, does this count as anonymous data?\n\nThanks.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Marketresearch/comments/1qz3sx4/can_this_research_be_done_without_individual/",
      "domain": "self.Marketresearch",
      "is_self": true,
      "comments": [
        {
          "id": "o491w1h",
          "author": "These-Virus8028",
          "text": "Yeah honestly: no, not really legal in Germany/EU.\nIf you’re systematically recording people’s answers + tagging them into “traits/groups” for a startup study, that’s data collection under GDPR, even if you don’t take names. It’s usually not truly anonymous, and doing it without telling them it’s research breaks the transparency/consent rules.\nBest move: give a super light disclosure like “quick question for a project, totally anonymous, 1 min” and don’t store individual profiles.\n(Not legal advice, but your current “they must not know” setup is very risky.)",
          "score": 2,
          "created_utc": "2026-02-08 13:47:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o495361",
          "author": "alexisappling",
          "text": "I doubt you’d get this past ESOMAR or MRS guidance. Post-hoc debrief is expected and MRS specifically says that covert research of any nature is only allowed in very tight circumstances. You’d also probably not get this past GDPR either. I am usually the one pushing to bend rules where I can, but this makes me uneasy.",
          "score": 2,
          "created_utc": "2026-02-08 14:06:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}