{
  "metadata": {
    "last_updated": "2026-01-30 08:59:56",
    "time_filter": "week",
    "subreddit": "n8n",
    "total_items": 20,
    "total_comments": 310,
    "file_size_bytes": 266407
  },
  "items": [
    {
      "id": "1qpewps",
      "title": "Fuck everyone saying selling n8n automations is easy - you're all full of shit",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1qpewps/fuck_everyone_saying_selling_n8n_automations_is/",
      "author": "Top-Government5983",
      "created_utc": "2026-01-28 15:46:51",
      "score": 458,
      "num_comments": 155,
      "upvote_ratio": 0.94,
      "text": "I'm so fucking done with these bullshit posts\n\n\n\n\"Just made 10k with AI voice agents bro! 🚀\"\n\n\"Auto receipts printing money! 💰\"\n\n\"AI content generation, literally can't keep up with demand! 🤑\"\n\n\n\nFUCK OFF\n\n\n\nYou're either lying, got insanely lucky, or you're selling to your tech bubble friends who already get it\n\n\n\nLet me tell you what ACTUALLY happens\n\n\n\nI work at an automation company and for MONTHS I've been grinding, cold calls, emails, reaching out to contacts, everything\n\n\n\nYou know what I hear?\n\n\n\n\"We don't need automation\"\n\n\n\nEvery single time\n\n\n\nI say the word \"automation\" and I can literally HEAR them mentally check out. It's like I said \"timeshare\" or \"pyramid scheme\"\n\n\n\nAnd here's what drives me fucking insane\n\n\n\nThese are business owners who RISKED EVERYTHING to start their company\n\n\n\nThey took loans, they bet on themselves, they fought to build something\n\n\n\nBut NOW? Now that they could actually SCALE that thing they built?\n\n\n\n\"Nah bro, we're good with spending 15 hours a week on bullshit manual tasks\"\n\n\n\nWHAT THE FUCK?\n\n\n\nYou had balls to start a business but not to optimize it? Make it make sense\n\n\n\nHere's the reality NOBODY talks about\n\n\n\nBuilding the automation? Easy as fuck, n8n makes it stupid simple\n\n\n\nYou want me to connect 5 APIs and automate your entire sales pipeline? Give me 2 days\n\n\n\nBut getting someone to admit they waste time, trust me to fix it, and actually FUCKING PAY for it? That's the impossible part\n\n\n\nShow them the math: \"You spend €1,500/month in wasted time, this costs €2,000 ONCE, payback in 1.3 months, after that it's pure profit\"\n\n\n\nTheir response? \"Seems expensive\"\n\n\n\nBRO THE MATH, LOOK AT THE FUCKING MATH\n\n\n\n\"We'll think about it\"\n\n\n\nTranslation: No\n\n\n\nAnd you know what's wild? People in tech GET IT immediately\n\n\n\n\"Oh you automated that? ROI in 3 months? Sick, let's do it\"\n\n\n\nBut normie business owners? Sheep, actual fucking sheep\n\n\n\nThey follow each other doing the SAME inefficient bullshit because \"that's how it's always been done\"\n\n\n\nOne guy told me, I shit you not, \"If it was that good, everyone would be doing it\"\n\n\n\nMY BROTHER IN CHRIST, THAT'S WHY I'M HERE\n\n\n\nTo make you the one who DOES IT FIRST\n\n\n\nBut no, comfort zone too strong\n\n\n\nThe first time most of them hear \"automation\" they panic\n\n\n\nLike I'm about to replace their entire team with robots\n\n\n\nNo dude, I'm trying to make your life EASIER\n\n\n\nFree up time so you can actually GROW instead of drowning in admin\n\n\n\nBut they can't see it\n\n\n\nThey're so deep in the day-to-day bullshit that they literally CANNOT imagine it being different\n\n\n\nIt's like showing color to someone who's been colorblind their whole life\n\n\n\nSo when I see these posts: \"Just closed 5 clients this week! Automation is the future!\"\n\n\n\nI call bullshit\n\n\n\nEither you're lying, you have connections like family or friends who trust you already, you're selling to tech companies which is easy mode, or you got lucky with 1-2 clients and now you're acting like you cracked the code\n\n\n\nThe REAL game? Contact 100 companies, 5 respond, 2 take meetings, 1 MAYBE buys\n\n\n\nAnd that ONE takes 3 months to close because they need to \"discuss internally\" which means asking their cousin who \"knows computers\" if it's legit\n\n\n\nI'm not quitting, I believe in this shit\n\n\n\nAutomation WORKS, the value is REAL\n\n\n\nBut I'm so fucking tired of people pretending the hard part is building\n\n\n\nBuilding is the EASY part\n\n\n\nThe hard part is finding someone who admits they have a problem, explaining value in terms they understand and not tech jargon, getting them to trust you, actually closing the fucking deal, and not losing your mind when you get ghosted for the 47th time\n\n\n\nTHAT'S the game\n\n\n\nNot \"knowing n8n\"\n\n\n\nIf you're making bank, good for you, genuinely\n\n\n\nBut PLEASE stop acting like it's easy and everyone's just lazy\n\n\n\nShare your ACTUAL process, where do you find clients, how do you get responses, what do you say that makes them give a shit, how do you close\n\n\n\nBecause \"I built cool stuff and clients came\" is NOT helpful, it's hopium\n\n\n\nAnd for everyone grinding like me, you're not alone\n\n\n\nThis shit is HARD\n\n\n\nYou're not failing because you're bad at n8n\n\n\n\nYou're struggling because convincing humans to change is fucking brutal\n\n\n\nKeep going but stop believing the bullshit success porn on YouTube\n\n\n\nReality: Building automations is 20% of the work, selling them to people who don't get it is 80% of the work\n\n\n\nAnyone who tells you different is selling you a course\n\n\n\nFuck the fake positivity\n\n\n\nThis is hard, acknowledge it\n\n\n\nThen keep grinding anyway\n\n\n\n/endrant\n\n\n\n\n\nP.S. If you're about to comment \"skill issue bro\" then congrats, you're exactly the type of person this post is about, go fuck yourself!",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1qpewps/fuck_everyone_saying_selling_n8n_automations_is/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o28ej1q",
          "author": "salestoolsss",
          "text": "Yeah, too many clowns out here claiming made 10k while sleeping for me  as developer it's easy to be honest .",
          "score": 90,
          "created_utc": "2026-01-28 15:52:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28g2qb",
              "author": "Top-Government5983",
              "text": "EXACTLY.  \nThat's what pisses me off the most All these YouTube gurus selling dreams:   \n\"I made 10k while I slept! Just automate bro!\" Yeah? Show me the fucking clients then",
              "score": 23,
              "created_utc": "2026-01-28 15:58:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o28i7gf",
                  "author": "TheInternet_Vagabond",
                  "text": "Always think that if they found the golden goose why would they advertise it freely and share a market. \nThey make money from views and sponsored.",
                  "score": 20,
                  "created_utc": "2026-01-28 16:07:54",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2d8srt",
                  "author": "TldrDev",
                  "text": "I've made some money off n8n integrations and projects. Ill happily answer your questions. Im not some youtube guru, or really share what I do often.\n\nI own a small crm and erp consulting company. I mainly work around Odoo, metabase, mattermost, Mautic, Authentik, rabbitmq, and Nuxt projects.\n\nMy job is typically to setup accounting, inventory, payment processing, hr and manufacturing systems etc.\n\nI use n8n as a visual editor to give teams the ability to edit workflows I generate for them.\n\nJudt as one example, I have a docker-based stack that ingests data to meilisearch. It allows me to arbitrarily dump company SOP data into a system and get vectorized contextual search, which i expose as a remote mcp tool to n8n.\n\nI have some standard integrations I deploy with Odoo and Mattermost for clients that gives them a chat bot with their knowledge base which is available to their teams.\n\nI sell the mcp server and chatbot as an optional service which starts at $4,400, or about 3 days of consulting work, which is primarily prepping their data, getting everything deployed and vectorized, and things like api keys and cicd setup for deployments. I sell the source code and deployment for that script. N8N is rarely a thing onto itself, you need more than just giving people access workflows.\n\nLet me know if you have any questions, happy to answer.\n\nEdit: echoing the other post further down, $5m-400m in annual revenue is your target customer. I won't work with really anyone smaller than that short of a SaaS solution. You're targeting the wrong market and have no niche! You gotta specialize and solve real problems.",
                  "score": 16,
                  "created_utc": "2026-01-29 06:35:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o28gnko",
                  "author": "salestoolsss",
                  "text": "They’re just affiliates getting paid by companies. Honestly, I haven’t seen a single good one most are noobs. I even saw someone on YouTube who barely knows how to use a keyboard. Just learning and reading on your own is way better.",
                  "score": 2,
                  "created_utc": "2026-01-28 16:01:12",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2a3qvu",
                  "author": "0xJ05H",
                  "text": "The source of income isn’t the automation but a fake dream that they sell to their viewers, the click baits that generate views are the real revenue stream.",
                  "score": 2,
                  "created_utc": "2026-01-28 20:18:33",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2dvdld",
                  "author": "affanxkhan",
                  "text": "Cool bro cool ! It's a part of content so, those who know they don't react chill matcha! Change the niche just!",
                  "score": 1,
                  "created_utc": "2026-01-29 09:59:51",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2hnia5",
                  "author": "enterme2",
                  "text": "And that's exactly why instead of you they trust the gurus and they are getting clients instead. They build the Branding not chasing client. With the branding people already trust them even before any work done.\n\nThe marketing is purposely done to trigger you psychologically.",
                  "score": 1,
                  "created_utc": "2026-01-29 21:54:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o28toeg",
          "author": "conor_is_my_name",
          "text": "I am very successful in this space, and had over 6 figures of billings last year and am on track for big growth this year as well.\n\nYou guys are approaching the wrong clients and the wrong problems.  An ideal customer is a business doing $5M+ per year in sales.  Those clients have real problems to be automated.\n\nStop building appointment setting systems and terrible social media automation, no one needs those when there are already much better SaaS solutions.  Why would anyone use your system when Calendly is already free?\n\nThe 2nd problem is credibility gap.  How do you demonstrate you know what you are talking about in a way that resonates with your ideal customer?\n\nFor me, I post legitimately good code for FREE.  If you post good stuff, clients find you and you don't need to rely on outreach.\n\n[https://github.com/conor-is-my-name/n8n-autoscaling](https://github.com/conor-is-my-name/n8n-autoscaling)\n\n[https://github.com/conor-is-my-name/google-maps-scraper](https://github.com/conor-is-my-name/google-maps-scraper)\n\n[https://github.com/conor-is-my-name/crawlee-server](https://github.com/conor-is-my-name/crawlee-server)\n\n[https://github.com/conor-is-my-name/Headful-Chrome-Remote-Puppeteer](https://github.com/conor-is-my-name/Headful-Chrome-Remote-Puppeteer)\n\nAnd finally: STOP WATCHING YOUTUBE.  it's a waste of time and fake learning.  Just start building, sharing your code, and be helpful to the community.  If you do that well clients will find you.",
          "score": 135,
          "created_utc": "2026-01-28 16:57:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29q4vn",
              "author": "nbass668",
              "text": "Well said on the credibility gap.. infact we sold a customer AI voice agent acting as dietitian. $20000 implimentation + $500 a month maintenance. And they paid us this much because we had previous successful project and this client makes $30M+ revenue per year. \n\nAnyone of you could impliment this agent. We did nothing special. Infact a wannabe freelancer probably do a better job...  But we got paid due to credibility and trust. This none of you have with my client. This is built upon steady delivering successful project client after client until we score the first enterprise.",
              "score": 15,
              "created_utc": "2026-01-28 19:17:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o29lm51",
              "author": "FutureWeb9312",
              "text": "![gif](giphy|DvWJHSOxTff84SQsD9|downsized)\n\nYou are the man! Sounds about right to me! Now let’s get back out there and get this shit up and running!",
              "score": 9,
              "created_utc": "2026-01-28 18:57:35",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2ar5pa",
              "author": "dexwilson",
              "text": "Sent you a dm if you’re down to share some info that would be huge thanks!",
              "score": 2,
              "created_utc": "2026-01-28 22:01:06",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2cog50",
              "author": "Feisty_Emu_3083",
              "text": "This. Youtube will only teach you the basics from there you have to solve real problems and measure the results.",
              "score": 2,
              "created_utc": "2026-01-29 04:09:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2gksjp",
              "author": "ggone20",
              "text": "Well said friend. I’ve been very successful also. I don’t get the complaints at all. Also, clients definitely find you. I just commended on the main thread here but my inbox on Reddit is full of DMs from owners requesting engagement. Literally too much to handle personally. I never post that I’m available or looking for work… I mostly just talk about RAG in various subreddits. Lol. Cheers!",
              "score": 2,
              "created_utc": "2026-01-29 18:50:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2dje8k",
              "author": "kinda10march",
              "text": "ty",
              "score": 1,
              "created_utc": "2026-01-29 08:07:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2g8jkr",
              "author": "ppc0r",
              "text": "This!",
              "score": 1,
              "created_utc": "2026-01-29 17:55:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o28ep28",
          "author": "abou_reddit",
          "text": "Someone definitely had enough. I totally get it hahaha",
          "score": 34,
          "created_utc": "2026-01-28 15:52:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28i3j9",
              "author": "Top-Government5983",
              "text": "Months of \"we'll think about it\" will do that to you lmao",
              "score": 15,
              "created_utc": "2026-01-28 16:07:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o28qzf0",
                  "author": "RedTheRobot",
                  "text": "The problem you described is not new. When computers were just becoming popular you had to convince small and medium businesses that there was value in purchasing the software. This was done by demos and hell that has even evolved today with just having a free tier. Doing that for automations isn’t easy but if the automations you are selling truly take 2 days to get setup tell the client how about a 30 day trail. Sure some might not convert but some will. You can also keep the non converts low by asking qualifying questions. Find clients who are on the edge and give them a free trail. This also assumes you are not just charging for setup but have a monthly fee which is usually the better option for small businesses.",
                  "score": 8,
                  "created_utc": "2026-01-28 16:45:45",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o29mtel",
                  "author": "Better-Cause-8348",
                  "text": "Bruh you just need to automate your outreach and responses…. /s",
                  "score": 0,
                  "created_utc": "2026-01-28 19:02:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o28rxab",
          "author": "FalseAxiom",
          "text": "Client's POV: this snake oil salesman wants access to my internal business information. I also can't spend $2000 even if it saves me money. I dont have the reserves for that.",
          "score": 24,
          "created_utc": "2026-01-28 16:49:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o292p05",
              "author": "EveYogaTech",
              "text": "That's an interesting perspective. Are you talking about your business documents and files or more in general like the overall state of the company?",
              "score": 2,
              "created_utc": "2026-01-28 17:37:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2ban33",
                  "author": "Lmao45454",
                  "text": "Anyone who has worked at a company knows their company will never buy your shitty n8n workflow.\n\nSmall companies don’t have the cash to test out your workflow that will likely break in production and mess up their thin margins",
                  "score": 5,
                  "created_utc": "2026-01-28 23:35:30",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o294n02",
                  "author": "FalseAxiom",
                  "text": "No idea. That was meant as a hypothetical. Why would a business owner hand over any keys to their business? How do they know this person isn't trying to harvest their CRM, siphon off money, analyze a competitors metrics, etc.?",
                  "score": 3,
                  "created_utc": "2026-01-28 17:45:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2f4qfx",
              "author": "Redditburd",
              "text": "This was my thought as well. Once you get established as a small business you are flooded with spam calls and people wanting to ride to coat tails of your limited success. \n\nThis is just another guy cold calling me wanting money and to top it off he claims AI is going to save me money. As soon as he gets paid he will be gone. The product will not likely work as advertised and when it breaks he will be awol. \n\nI just got off the phone with the local radio and TV advertising salesmen 3 minutes ago, at least they offer a product I can understand and I know ow what I'm buying. \n\nOp until you understand the customer you are approaching you will be stuck here.",
              "score": 2,
              "created_utc": "2026-01-29 14:56:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o28jerv",
          "author": "munkymead",
          "text": "Just a suggestion but maybe start with something small and niche like automated appointment bookings and scheduling for small companies like hairdressers, mechanics, laundrettes etc. Charge a small monthly fee where they can cancel anytime. Build it in a way that you can adapt it for several clients. Sell it to 20 clients for 20x less, per month. With each new client you can tell the next prospect, we've got X companies using this already, here's their feedback after 3, 6, 12 months. Here is the information I need from you, with a small one time setup fee we'll get you ready and setup in X days. A lot of businesses struggle with cashflow, they have rent, staff, insurance, licenses, expenses, tax and a huge list of other outgoings. Give them something that works for them without the fear of investing a large sum for a result they can't yet see.\n\nI considered not even sending this because cash is tight for me but maybe this is what I need to do as well. Give it a go, won't hurt to try.\n\nMicro transactions and longevity are what will keep your business thriving long term. A client of mine sent me an audio file which had a prewritten script spoken by an AI generated voice, tailored to his business and the services he provides on his website. Even that alone made him want it.",
          "score": 15,
          "created_utc": "2026-01-28 16:13:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28k06l",
              "author": "munkymead",
              "text": "You could even automate this whole things and set up a web app where they can sign up, add their data, add payment details and manage their subscription. Also gives you an opportunity to upsell more advanced automations since you can advertise on your own website, which they would already use.",
              "score": 5,
              "created_utc": "2026-01-28 16:15:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o28mrop",
          "author": "Goldblood82",
          "text": "I'm on the verge of getting into automation but this post is making me think twice",
          "score": 10,
          "created_utc": "2026-01-28 16:27:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29mbxj",
              "author": "FutureWeb9312",
              "text": "Don’t let this discourage you. I feel like this skill is very much needed and you just need to learn how to pitch our thing. Don’t stop now",
              "score": 4,
              "created_utc": "2026-01-28 19:00:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o29cnuo",
          "author": "Available-Claim2445",
          "text": "This is a sales problem.   \nAnd you're right, its not easy, its fucking hard. When I was still doing calls, especially for SMBs, they almost always rejected \"automation\" outright. But you have to understand that this isn't an automation specific problem but a sales problem faced across most businesses.   \nFor many SMBs they simply do not understand the opportunities of  \"automation\" even when you give them the math and ROI, so you need to reframe what you are selling. You're not selling automations, you're selling systems, products, stress-free solutions, accuracy, etc. And how you phrase it, the terminology you use, and how you frame your selling points is heavily dependent on the type of business.   \n  \nFor example, when I was selling to **political** media companies you almost always want to frame your solution around making them more \"aggressive\", \"battle-tested\", \"competitive\", \"defensive\", etc. They love using war terminology and action words, and although this may seem kind of trite it definitely works. You need to speak the language of your customers.  \n  \nFigure out a specific problem they are facing and understand all the way to the core why its such a problem. Keep fixing your sales script until you find something that begins to work. Then you stick to it 100% and don't stray. You'll find your conversion rate go way higher than you've ever seen and you'll get your confidence back. \n\nFinding the right script is so hard and honestly requires a bit of luck, but like you said, acknowledge the difficulty and keep moving forward. Good luck!",
          "score": 7,
          "created_utc": "2026-01-28 18:19:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ct64i",
              "author": "berserc",
              "text": "Bingo ... This is a sales problem, not an automation problem. Whatever you are selling there are always these kinds of barriers. My biggest take away from being a business owner - pick your clients like you pick your employees.",
              "score": 2,
              "created_utc": "2026-01-29 04:40:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o28nbg7",
          "author": "Outlier_team",
          "text": "damn, who would have thought that people on youtube would be lying to you for views or to sell a course. \n\nyou might not have closed a lot of deals but at least you learned how to use AI tools and have saved yourself a ton of time elsewhere",
          "score": 6,
          "created_utc": "2026-01-28 16:30:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o291xj5",
          "author": "[deleted]",
          "text": "Here the thing….. if people are making 10k off of something and it wasn’t difficult they aren’t telling anyone about it",
          "score": 7,
          "created_utc": "2026-01-28 17:33:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29k30n",
          "author": "MihuMG",
          "text": "Learn sales brother. Nobody wants automation/n8n\n\nInstead:\n- they want to save money; less employees, more value (the global corporate world has been hit with layoffs for this exact reason)\n- they want to stop worrying about things and have peace of mind knowing they work\n- they want to be ahead of their competitors, using automation in clever ways helps them achieve that\n- this goes on forever\n\nAutomation is not an outcome. You never sell a process, you sell an outcome. What do I get if I automate a task? oH mOrE FrEe tImE who cares about that? It's been used so much it's worth nothing\n\nI'm in the process of building automations for a client because their main employee left and I told them their job can be done by AI, think about this outcome and how much it's worth to them, then compare it to selling automation",
          "score": 5,
          "created_utc": "2026-01-28 18:51:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ahfq0",
          "author": "czmax",
          "text": "I call BS on this part: \n\n\\> And you know what's wild? People in tech GET IT immediately  \n\\> \"Oh you automated that? ROI in 3 months? Sick, let's do it\"\n\nSo many in the tech space struggle with this as well. It's better, but not capitalized \"GET IT\" good.",
          "score": 4,
          "created_utc": "2026-01-28 21:18:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2b053e",
              "author": "Radiant-Departure-81",
              "text": "True. True. Tech companies have the same problem.  I work in a company where they smrk, smile at me when I try to convince them why automation and n8n is good for everyday work. They don’t care. They love to code to infinity, to grasp a code that after long years of development, hardly even works. But no. You want to make a struggle easier and all they see is just a demo sandboxes, “not a real program!” Etc. And I sell the problem + solution. I tried to convince them they are not all Linus.. It’s hard. Change is hard, conformity is easy. Everything that is out of there scope. No degree can help with that.",
              "score": 2,
              "created_utc": "2026-01-28 22:42:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o28mqmg",
          "author": "Safe_Thought4368",
          "text": "It's not about automation; it's about helping the company with the problem they have. I did that: I went to talk to them, saw how they worked and what problems they had, and was friendly, helping in any way I could. Then I told them, \"I can solve this bottleneck that's taking up your time so you can do this other thing,\" and that's how I was able to sell.",
          "score": 8,
          "created_utc": "2026-01-28 16:27:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28n0zt",
              "author": "Safe_Thought4368",
              "text": "This is just my opinion, and it only helped me sell three automation systems, so I don't know much, but I hope it helps you and others. Although what you said about the snake oil salesmen who claim to sell 10k and so on makes me really angry.",
              "score": 5,
              "created_utc": "2026-01-28 16:28:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2904ve",
          "author": "Juanisweird",
          "text": "I mean… that’s the thing with any business: getting PAID clients is always the hard part.\n\nI get your point but bro, no need to lash out like this. Here you have 2 options: learn to sell ( will work for the rest of your life) or get a salesperson and split.\n\nOh, and no shame, no little numbers. Go big. As big as possible.\n\nCheers and please, do stay positive",
          "score": 7,
          "created_utc": "2026-01-28 17:25:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28rr1p",
          "author": "Lumpy-Atmosphere46",
          "text": "Thought about starting up my own thing, but this exact reason has stopped. \n\nDid some market research, and I came across the exact same issues.  People unwilling to pay for solutions that DO save them time.",
          "score": 3,
          "created_utc": "2026-01-28 16:49:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28v0tt",
          "author": "rainmanjam",
          "text": "Those who can, do. Those who can't, teach.",
          "score": 3,
          "created_utc": "2026-01-28 17:03:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29blty",
          "author": "brunoplak",
          "text": "Oh man, I just went through something very similar. I made this automation and then offered it to a company FOR FREE to test it out and troubleshoot in a real world environment so I could then sell to others. \n\nI went there, made a presentation with a case study specifically made for them. \n\nThey sent me an email later saying they are not ready to commit with the expense. IT WAS FREE!!! (For the first year) and would save them around 2k euros per month. \n\nI’ve got a second company lined up. Fingers crossed these are smarter.",
          "score": 3,
          "created_utc": "2026-01-28 18:14:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28rbf4",
          "author": "Ill_Dare8819",
          "text": "Finally. Finally. Finally a truly good fucking post on this sub.\n\nhttps://preview.redd.it/29fp118cd4gg1.jpeg?width=485&format=pjpg&auto=webp&s=0f18af50aeaf5a575dca05c16b4b54b22109819c",
          "score": 7,
          "created_utc": "2026-01-28 16:47:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29kubr",
              "author": "FutureWeb9312",
              "text": "😂😂😂",
              "score": 1,
              "created_utc": "2026-01-28 18:54:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o297u6a",
          "author": "bambamlol",
          "text": "skill issue bro",
          "score": 6,
          "created_utc": "2026-01-28 17:58:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29lsw8",
              "author": "FutureWeb9312",
              "text": "😂😂😂you guys sure know how to rub it in🤦🏽‍♂️🤦🏽‍♂️",
              "score": 2,
              "created_utc": "2026-01-28 18:58:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o299i0e",
          "author": "Atom_____",
          "text": "Skill issue lol",
          "score": 6,
          "created_utc": "2026-01-28 18:06:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29lu5f",
              "author": "FutureWeb9312",
              "text": "😂🤦🏽‍♂️",
              "score": 2,
              "created_utc": "2026-01-28 18:58:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o28lhja",
          "author": "wholesomesizzle",
          "text": "Nothing and I mean nothing is easy and everything is hard… Don’t quit keep going!",
          "score": 2,
          "created_utc": "2026-01-28 16:22:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28rm28",
          "author": "x0rg_new",
          "text": "I ain't reading allat",
          "score": 2,
          "created_utc": "2026-01-28 16:48:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o295i79",
          "author": "SejidAlpha",
          "text": "Man, I built a customer service bot using RAG, fed with company data, 2 years of actual operator-client troubleshooting logs, all the business rules basically, the whole nine yards.\nOur main pain point: simple questions that get resolved in just two messages.\nFor more critical issues, I built tools that integrate with our platform to fetch the necessary data. If it still can't solve the customer's issue after all that, it hands off to a human operator automatically and frictionlessly.\nIt works beautifully after hours, and customers are happy. But during business hours, the operators fight the bot, even though I keep telling them just to wait and that they'll only get the ticket when it's actually critical.\nSo, simply showing them how much money they're losing isn't enough (in my case, there's no extra cost since I'm on the team and this is literally my job), and showing them that their work will be easier isn't working either.",
          "score": 2,
          "created_utc": "2026-01-28 17:49:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o297ow8",
          "author": "Agron7000",
          "text": "If your boss gave me your gig he'd be a happy customer. ",
          "score": 2,
          "created_utc": "2026-01-28 17:58:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29q9qi",
          "author": "burgemeister",
          "text": "Like nick saraev said: sell the solution to the problem. You write a lot of arguments that don't work. People don't know what it is, they don't want to admit a problem. \nOffer the chance. You're x times faster with thid that will gove you time to...\n\nAnd still then: people are afraid of change. Untill it hurts. And even then....",
          "score": 2,
          "created_utc": "2026-01-28 19:18:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29t61j",
          "author": "q_ali_seattle",
          "text": ">But getting someone to admit they waste time, trust me to fix it, and actually FUCKING PAY for it? That's the impossible part\n\n\nFor those dinosaurs it's a job security. If they automated Kelly's job, tomorrow it will be Bob, then it will be them. ",
          "score": 2,
          "created_utc": "2026-01-28 19:31:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2c2kip",
              "author": "Rajanjua",
              "text": "Replying to Training-Form5282...\n\n“Getting someone to admit they waste time”\n\nBrav. Ofc nobody wants to admit they waste time. Bro tryna play checkers on a chessboard. Learn psychology.",
              "score": 2,
              "created_utc": "2026-01-29 02:04:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ahleb",
          "author": "Ok_Might4977",
          "text": "Most automations I'm developing bring me between 2K and 5K. I don't make insane money with it but it's definitely requested and profitable.",
          "score": 2,
          "created_utc": "2026-01-28 21:19:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2d6nne",
              "author": "Queasy-Historian84",
              "text": "great, how do you do it? cuz everyone has different unique methods",
              "score": 2,
              "created_utc": "2026-01-29 06:18:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2bt1v8",
          "author": "nthock",
          "text": "Few thoughts on approaching business owners:\n\n1. In general, they care more about making more money than saving money. They will listen more if you tell them you can make them more money. Because if they can make more, they don't mind spending the money that could have been saved.\n\n2. Even telling them they can make more money is not enough. Because there are lots of different ways that they can do that. Why do they need you?\n\n3. This is where it goes interesting. In the sales process, target something that they are frustrated about that is not money-related. Maybe it could be error-prone process that make their clients called them and scolded them. Maybe it is not being able to meet their client's service expectations. Anything that makes them frustrated emotionally, or look bad, especially in front of their clients.\n\n4. This is where you get their attention and talk about what you provide can solve these issues. You talk about their cost savings or monetary benefits ONLY when you talk about how much you charge. You use that to justify your price.\n\nWhat I have learnt is cost savings, or making more money is used more on justifying your fees, but it is not enough to get business owners to want your solution in the first place.\n\nThe rejections you quoted are more on excuses from them to stop the meeting. A very successful businessman once told me, if you fail to close, it is simply because you never say what they want to hear.",
          "score": 2,
          "created_utc": "2026-01-29 01:12:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bzeg9",
          "author": "dorsco09",
          "text": "Kind of feel like you just called out your own problem. If people checkout when you say the word automation why would you keep saying it? \n\nI work in this space within operations automation (not generic voice agents or basic marketing automation), which requires advanced database builds, custom UIs, and automations to connect their tools and build true infrastructure.\n\nWhen I’m on sales calls I almost never lead with any of that. \n\nI start with a validated pain point of their team wasting time and money bouncing between tools. Any future AI will need clean data to operate from, missed deadlines or lost files impacts much more than your bottom line (brand trust, etc.). Then show them work I have done in the past to overcome their exact problems and how it followed a simple process.\n\nHave been an automation engineer for over 11 years sitting on both sides of the table. Business owners at pretty much any level care about just a few things, how will this tangibly help my business, what is my risk, and how painful will the process be. \n\nThere are other subtle things but if you can learn to speak in the owners language, over come objections before they are brought up, and show you have a vetted process you will be more of an authority figure and be seen as someone to purchase from. \n\nIt can be hard out there, but you’re getting on calls and getting feedback, that’s valuable data, use it and adjust until something works. Hopefully this helps, good luck!",
          "score": 2,
          "created_utc": "2026-01-29 01:47:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c0tgq",
          "author": "Rajanjua",
          "text": "F*ck it im gonna be that guy. \n\nSkill issue bro. \n\nLearn sales AND psychology. \n\nFOMO is a bish. \n\nInstead of telling people they’re the first, tell em that their direct competitor John down the road is already implementing this. \n\nPeople move faster when they have shit to lose than when to gain. \n\nMake em feel like they’re gonna lose the edge they have and watch them become your sheep. \n\nThat’s just one of the ways. \n\nStudy psychology. \n\nAnd you’re right about most gurus being grifters.\n\nPeople lie.\n\nBut numbers don’t.\n\nLogic doesn’t always prevail.\n\nBut luckily it’s not the only tool in your arsenal, is it?",
          "score": 2,
          "created_utc": "2026-01-29 01:55:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28ot45",
          "author": "nontitman",
          "text": "Holy shit man, how tf can you type all that out and still think the issue isn't you?\n\n\\*\\*you\\*\\* are struggling to sell, which is expected but also in your control. Maybe complain less and focus on the problem you're solving and not the solution you're selling, ya dingus.",
          "score": 4,
          "created_utc": "2026-01-28 16:36:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2994bf",
              "author": "Far-Entrepreneur8638",
              "text": "Bro thinks the average person is just gonna hand out their hard earned money to his service he made up in a few weeks",
              "score": 2,
              "created_utc": "2026-01-28 18:04:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2c35o6",
                  "author": "Rajanjua",
                  "text": "In that case bro should swallow his ego and approach with a free demo instead. Give instead of take. \n\nI don’t understand why people get stuck in the self-conjured up grey area. Life is black and white. Do you want money or not? Well what you tried didn’t work. NEXT.",
                  "score": 2,
                  "created_utc": "2026-01-29 02:08:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2c3ei0",
              "author": "Rajanjua",
              "text": "Love this. Part one of solving any problem is writing the problem down, and as this bro mentioned… the situation is damn clear in the written word.",
              "score": 1,
              "created_utc": "2026-01-29 02:09:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o28gmxy",
          "author": "starba3",
          "text": "I bet you most of the ones who says I made 10k selling automations have someone doing marketing for them whose actual job is to convince people to buy.",
          "score": 1,
          "created_utc": "2026-01-28 16:01:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2c3v7o",
              "author": "Rajanjua",
              "text": "Well if your automation is so good, have you tried giving them a free shed before pitching them a house?",
              "score": 1,
              "created_utc": "2026-01-29 02:11:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o28i61y",
          "author": "Szilvaadam",
          "text": "This is the next crypto scam where they are saying \"i earned with a simple flow this much, let me help you with my strategy to earn the same...\" Later they say:\"...Join my community and pay a subscription\".\n\nWhile really rare when they earn well with one flow, the majority of them are not selling anything just education.",
          "score": 1,
          "created_utc": "2026-01-28 16:07:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28ikiv",
              "author": "Top-Government5983",
              "text": "Makes no sense to me if the clients are literally paying thousands as they claim then why the fuck are you just giving it all away for free",
              "score": 2,
              "created_utc": "2026-01-28 16:09:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o28pjq4",
                  "author": "Szilvaadam",
                  "text": "If they have clients in reality they manage everything from scratch from server through monitoring till dashboard and they would be paid like 100 USD monthly best case. But you cannot sell one workflow alone.",
                  "score": 1,
                  "created_utc": "2026-01-28 16:39:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o28n1sw",
          "author": "gcampb41",
          "text": "I didn’t read it all 😝 but I get the jist. \nThank the YouTube & S*ool crowd for this, so many people come across n8n and have totally unrealistic expectations. The GHL pushers are cut from the same cloth.",
          "score": 1,
          "created_utc": "2026-01-28 16:28:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28sofu",
          "author": "borderpac",
          "text": "Nate is the only legit dude. Mike Futia and other scammers have really ruined the game.",
          "score": 1,
          "created_utc": "2026-01-28 16:53:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28z4da",
          "author": "Striking-Bluejay6155",
          "text": "Sending this to a friend who thinks showing prospects how much money they’ll save is all he needs 🤣",
          "score": 1,
          "created_utc": "2026-01-28 17:21:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o290h57",
          "author": "Jayelzibub",
          "text": "Im having trouble selling it to my company and I've created some magic for them that would cost 10s of thousands with our internal IT delivery.",
          "score": 1,
          "created_utc": "2026-01-28 17:27:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o291gh1",
          "author": "nullmem",
          "text": "Even before AI automation I told my marketing team I wrote a python script that could curate list of leads in seconds and they are like “nahh we have a spreadsheet”",
          "score": 1,
          "created_utc": "2026-01-28 17:31:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dvq8o",
              "author": "CuriousExtension5766",
              "text": "\"Hey I see you have a spreadsheet, what if I helped you populate that with the information you have in a way that lets you focus on selling to those leads, instead of finding those leads\".\n\nMarketing people don't know wtf a Python script is, they probably pictured a snake that goes through their computer and then spits venom at them.\n\nIf you don't know how to talk to your audience, you won't sell them the bandage that stops their bleeding, they'll bleed out before they apply it.",
              "score": 2,
              "created_utc": "2026-01-29 10:03:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o293bf1",
          "author": "[deleted]",
          "text": "Entrei de cabeça nesse mundo ha 1 mês. Você disse tudo que penso ate agora, comprei diversos Templates e me inscrevi em alguns cursos, no final, só gastei grana, grana com APIs quase todas boas são pagas ou tem que cadastrar cartão. Mas espero que futuramente isso me traga algum retorno, talvez encontre a maneira certa de aplicar esse conhecimento, não existe dinheiro fácil, ate pra cara vender sonhos ele teve algum trabalho.",
          "score": 1,
          "created_utc": "2026-01-28 17:39:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2988cy",
          "author": "dannyjbixby",
          "text": "Love this. So true. The easy part is making it work, the real hard work is in sales and marketing the solution. Almost 90% of any business is just selling.",
          "score": 1,
          "created_utc": "2026-01-28 18:00:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29e7nq",
          "author": "Away-Sea7790",
          "text": "Other businesses just cant accept it until they see another business utilizing automation and was ahead of them a mile. Selling it would be the hardest. I think of it as selling the solution and not process. ",
          "score": 1,
          "created_utc": "2026-01-28 18:26:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29gnyq",
          "author": "FutureWeb9312",
          "text": "😂😂😂Wow",
          "score": 1,
          "created_utc": "2026-01-28 18:36:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29ipev",
          "author": "creztor",
          "text": "What AI did you use to draft this with before making changes?",
          "score": 1,
          "created_utc": "2026-01-28 18:45:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29jmfm",
          "author": "FutureWeb9312",
          "text": "😂😂😂It’s me again. I feel you bro. I totally feel you. I have been racking my brain to learn n8n so I’m type nervous to reach out to prospective clients because I think I don’t know enough. I have a few options when it comes to acquiring clients. Most of the options are for you demonstrating your skills to your subscribers and followers but the Upwork option is a decent look. There are jobs listed there all day everyday? Have you considered Upwork? Most of the jobs seem like slave labor but I have reviewed a few and they are worth the time even if it’s just to get some Upwork job experience. But in any event I feel you and I am on the journey with you. We just gotta keep pushing!",
          "score": 1,
          "created_utc": "2026-01-28 18:49:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29l3ps",
          "author": "fartdonkey420",
          "text": "Top tier post ",
          "score": 1,
          "created_utc": "2026-01-28 18:55:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29ol5k",
          "author": "CommunityPrevious664",
          "text": "Dont sell things sell outcomes, pick a niche instead of selling automation you help contruction companies with their rfp request(exmple) , imagine trying to sell something like this \"hi, want to buy a car\" no context, no brand, no info thats what you are doing rigth now.",
          "score": 1,
          "created_utc": "2026-01-28 19:10:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2caxfu",
              "author": "Grouchy_Doubt_3665",
              "text": "Did you actually close clients with this script or you just parroting youtubers",
              "score": 1,
              "created_utc": "2026-01-29 02:50:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o29syic",
          "author": "q_ali_seattle",
          "text": "Should be a Sticky post. ",
          "score": 1,
          "created_utc": "2026-01-28 19:30:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a8stm",
          "author": "Various-Key3340",
          "text": "You want to sell something that people don't know if it's worth anything.\n\nThis whole AI and automation crap just doesn't go down well with small businesses. Someone told me about HubSpot or CRM or blah blah. You get 100 emails overnight. Etc. I get 100 emails a week. And there's someone else in the office. The few things that come up just aren't worth automating.\n\n\nI can imagine some of what you could do, but where would I save money? So my office worker can take even more cigarette breaks? I only ever see rough/vague things and I think to myself, yeah, not everyone can really relate to that.",
          "score": 1,
          "created_utc": "2026-01-28 20:41:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a956f",
          "author": "Wise-Artichoke-3808",
          "text": "Thank you for sharing this.",
          "score": 1,
          "created_utc": "2026-01-28 20:42:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2al0us",
          "author": "DumbDaveTheDork",
          "text": "I mean...is it any different than \"get rich with real estate\" or \"get rich with crypto\" or \"get rich with AI!\" --- it's kind of obvious, if someone is ACTUALLY getting rich with something, they're not here tell you how to also do it.  By the time you watch a tutorial or see it on reddit, the time to make money on it is probably over.  This is sort of internet 101.",
          "score": 1,
          "created_utc": "2026-01-28 21:34:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2an9ro",
          "author": "gdlk777",
          "text": "Dude, I just made 10k selling social media automation tool when writing this comment, in the background, while I was sleeping. Did I mention that it was all full of AI?",
          "score": 1,
          "created_utc": "2026-01-28 21:44:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2asbkv",
          "author": "jackstall",
          "text": "Man... Nobody said it's easy 😂 you can sell anything but it's a tough one. N8N is awesome. But you need to understand that there is a huge hype behind it. It takes a lot of work to actually use it.",
          "score": 1,
          "created_utc": "2026-01-28 22:06:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2atu9b",
          "author": "Christosconst",
          "text": "2k sounds too cheap",
          "score": 1,
          "created_utc": "2026-01-28 22:12:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2b9fu1",
          "author": "moderncmo",
          "text": "This is a lot of words to say you’re bad at sales ",
          "score": 1,
          "created_utc": "2026-01-28 23:29:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2beof1",
          "author": "Gullible-Molasses151",
          "text": "I agree but also if you called me trying to sell me literally anything, I’d brush you off because cold calls are time sucks. And more than anything, I just want to work without getting a fucking sales pitch.",
          "score": 1,
          "created_utc": "2026-01-28 23:56:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bfae8",
          "author": "c_pardue",
          "text": "the one thing i've learned about making content on YouTube is that outlandish promising clickbait is the only sure way to get views. those videos are just view farming.",
          "score": 1,
          "created_utc": "2026-01-28 23:59:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bqor5",
          "author": "2pongz",
          "text": "They don’t talk about the business dev & sales/marketing tbh part tbh. I see how people get grifted in this space",
          "score": 1,
          "created_utc": "2026-01-29 00:59:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2br8m6",
          "author": "Aggravating-Ad-2723",
          "text": "Real talk, but not everyone can do n8n you need an IT background. If you don't have an IT background you still can do it but not as the same IT guys. Like your post Man",
          "score": 1,
          "created_utc": "2026-01-29 01:02:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2btoli",
          "author": "Dismal_Hair_6558",
          "text": "Common frustration when grinding, you don't see any profit and are doubting if what you're doing is correct. Keep up brother, focus on your work and be honest with yourself and your product.",
          "score": 1,
          "created_utc": "2026-01-29 01:15:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bx41k",
          "author": "pogsandcrazybones",
          "text": "These people selling automation services b2b don’t realize that pretty much anyone on their team/a friend/their kid can just build these automations quick and easy. The whole business of selling these things doesn’t make sense to business owners because they don’t need to burn cash for no reason hiring an outside company",
          "score": 1,
          "created_utc": "2026-01-29 01:34:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bylzi",
          "author": "MIS_Gurus",
          "text": "Sales is never easy I don't care what you're selling!",
          "score": 1,
          "created_utc": "2026-01-29 01:43:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c15gk",
          "author": "SmartRick",
          "text": "lol don’t be using this platform the Big providers or auto coders could help you create your own N8N at this point. Selling automations is a hard thing but finding a role within an organization that needs implementation of AI in their org as an operational data is a huge driver. I work in it. Everyone wants to talk providers and investment and data farms, but no operating business is really implementing any sort of technology to its and users in the form of its employees.",
          "score": 1,
          "created_utc": "2026-01-29 01:57:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c40lx",
          "author": "yourmumschesthare",
          "text": "I dont have an automation product, but one thing I picked up (from a sales perspective) is that your conversations seem to focus on benefit (i may be wrong). \n\nHere's some advice you can take or leave.\n\nEdit: I dont have a course or anything to sell from this advice, just some observations on what's worked for me in the past.\n\nPeople are weird, and will spend way more to \"fix a painful problem\" than they would to \"see an attractive benefit\".\n\nTry to shift the conversation a bit to focus more on the pain. If they spend 15 hours per week on admin currently, what about if they doubled their client base? How many wasted hours for them, or how much would they need to pay someone to sit there and conplete all these admin tasks if they didn't want to do it themselves. That sort of thing.\n\nMake sure they emotionally feel their pain before bringing in the benefits (ROI within 1.5 months is nice, but they probably arent emotionally invested in that because \"this is the way its always been\"). \n\nWhat they will have if they buy off you is NOT \n\n❌️ an automated process\n\n❌️ another tool to learn\n\n❌️ a number of hours back in their day/week/month\n\n❌️ more money in the bank after ROI\n\n\nWhat they will have is:\n\n✅️ a solution to a very specific problem which they have already told you about if you ask the right questions\n\nThis might be things like:\n- less noise from customers because they're responding earlier\n- less tension at home because they have more time with their family\n\nIt's not about the hours they spend doing the repetitive tasks that could be automated. It's the things they are missing out on during those hours that is causing the pain. Find that pain and link it to how your automation can help them avoid that pain.",
          "score": 1,
          "created_utc": "2026-01-29 02:12:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ccxh3",
          "author": "callingshotgun",
          "text": "I remember it was a really common joke a couple decades ago, you wander into an IRC chat about c programming and say \"Can anyone explain how to do X\" and nobody will help, couple people will scoff and say \"RTFM\".\n\nYou say \"X is impossible, if you say otherwise you're full of shit\" and within minutes whole screens of sample code proving you wrong would just appear.\n\nI feel like I'm being baited to fix OP's business strategy :D",
          "score": 1,
          "created_utc": "2026-01-29 03:01:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cd5wu",
          "author": "Portugoso",
          "text": "Those \"guru\" do make 10k while sleeping. Selling their automation course to the rest of the people... LOL\n\nThe same happens with AI. They say you can make thounsands with AI, but they don't show you something worthy, they just show you how to do X thing with AI. So, when you go to the real world, you're like WTF, now what?",
          "score": 1,
          "created_utc": "2026-01-29 03:02:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cecow",
          "author": "InternetNo4914",
          "text": "Sounds like you got the skills but could benefit from refining how you sell them. Shoot me a message if you want to talk sales strategies.",
          "score": 1,
          "created_utc": "2026-01-29 03:09:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cnqwn",
          "author": "SundaySanDiego",
          "text": "So are you just in sales or in the dev side too? We really aren't having an issue selling automation and AI, but we also are a well established IT managed services and consulting firm and really brought AI and automation projects as a focus in the last 2 years. Prior our main focus and still a lot of our business was IT management and consulting. We do use n8n but multiple other tools and platforms. Things like UIpath have been in the RPA market for years. Some thing like power automate make more since if the customer has most of their data assets and operational functions in M365.\n\nFrom a sales and marketing point of view what is your ideal client profile, what type of people are you targeting, etc. what are their sizes, industry types, likes, dislikes, etc?\n\nThis may sound bad but the 99 slaps rule/saying exists for a reason, your numbers are about right for cold calling, 100 cold calls 10 to 15 contacts 1 client or so. And those type of numbers are common in other industries. Sales is hard. There are different ways to build the contacts and gain trust, but it usually takes 20+ touch points. We actually prefer in person networking and sponsor things where we can speak and show how things work, bring up success stories, etc. we follow up with white papers/case studies, maybe call a select few. Different approaches in general, I would think the worst would be cold calling over a phone.\n\nI do agree with you though, a lot of the you tube guru's and people in subs like this have it wrong. It isn't a sleep and make $10k. We are doing a $50k project right now, but we are working our butts off, meeting with the client, continuously requesting details for context to build/prompt the AI models, regular meetings to show progress to the stakeholders, so on.\n\nReading your post it maybe somewhat of an approach on the sales side. Since that seems to be where most of your complaints and frustrations are coming from... But there is much more to it from the scoping to project management, to the actual dev, etc.\n\nSo there are some of us that are successful out here doing it. But we also aren't sleeping while it is happening and just collecting $$$'s either.",
          "score": 1,
          "created_utc": "2026-01-29 04:05:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2co7t5",
          "author": "Feisty_Emu_3083",
          "text": "Everyone here is missing the point. Your not an \"Automations Expert\" your a business systems analyst and a few other key roles here. Your goal is not to \"Automate\" its to understand how the business makes money and then make them more money by eliminating costs, increasing sales volume, or making business systems more efficient. Bottom line. If you dont have proof you can do this your sales process will be rough. If you dont have KPIs to measure this your retention will suffer. Been building and scaling these systems for 10 or so years. AI made things easier if your really know what your doing, otherwise it turns people off, causes problems or makes unrealistic expectations. The hype is all too real in this space.",
          "score": 1,
          "created_utc": "2026-01-29 04:08:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2crvzq",
          "author": "Away-Artichoke8014",
          "text": "Finally someone said it!\n\n![gif](giphy|CS8Fgb5BAynaDGY1Me)",
          "score": 1,
          "created_utc": "2026-01-29 04:32:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2db9xw",
          "author": "zd0l0r",
          "text": "I agree but sales is not ONLY about math.",
          "score": 1,
          "created_utc": "2026-01-29 06:56:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dcbz0",
          "author": "Codingchym",
          "text": "To sell automation staff it's not easy, they need to do something about this point",
          "score": 1,
          "created_utc": "2026-01-29 07:05:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2de6r0",
          "author": "FiannaBeo",
          "text": "1) if you still think people on YouTube are there to inform you honestly… \n2) of course no one needs automation… you are in your automation bubble, where you think people need and understand that. But IF you’re serious and you can really automate, try different wording… educate first. Ask about their proceses before just asking if they need automation… a lot of people don’t even understand what can or can’t be automated.",
          "score": 1,
          "created_utc": "2026-01-29 07:21:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dfnu4",
          "author": "No_You5703",
          "text": "Maybe they don’t want to talk to you because you say fuck five times in every sentence?",
          "score": 1,
          "created_utc": "2026-01-29 07:34:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dilos",
          "author": "More-Ad5919",
          "text": "As a buisness owner who does all on its own. Design-shipping and everything in between. I have not found a usecase for AI in any of the steps. \n\nI came to the conclusion that, in the end, it only wastes a lot of time.",
          "score": 1,
          "created_utc": "2026-01-29 08:00:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dje5v",
          "author": "nicaine",
          "text": "help them know the problem they don't know they have. Give them the solution free. Consuming the solution always exposes to them a deeper problem they didn't know they had. Now sell the solution to the deeper problem. This is known as foot-in-the-door strategy.",
          "score": 1,
          "created_utc": "2026-01-29 08:07:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2djodf",
          "author": "Gambelt",
          "text": "I am not going to sit here and tell you that what you are facing isn't a real problem but one thing I have noticed is the following: \n\n\\- Automation (means nothing to someone that doesn't understand it)\n\nGenerally you are selling the END RESULT not the automation \n\nMeaning the way I approach anything like this is, clear offer, clear outcome, one way and then just make it as easy to understand as possible it's like someone would explain you the function of an iphone instead of telling you what you can do with it. \n\nThey don't care nor should they care, they have their own lifes, problems and running small businesses is fucking hard. \n\nThey need their time to manage those so if you tell them about \"automations\" they just see another thing they have to manage. \n\nLong story short \n\nSell the solution not the process and only explain the process when specifically asked for it",
          "score": 1,
          "created_utc": "2026-01-29 08:10:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dpqia",
          "author": "bramm90",
          "text": "Don't sell automations, just sell services (which you've automated).\n\n\nFor example, I run social ad campaigns for clients. They have no interest in managing all the comments they generate by hand. I offer to do it as an upsell of $300/mo, they gladly accept. They wouldn't in a thousand years pay me $100 one-off for an N8n automation though (which I'm running behind the scenes). \n\nDon't offer to automate stuff, just take care of things. ",
          "score": 1,
          "created_utc": "2026-01-29 09:06:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e31ec",
          "author": "beefcutlery",
          "text": "I've been working in the automation space for 15 years now, and the worst things  BY FAR to have happened to it are the rise of that monotone robot Nick, the little chubby Asian boy, and Hermozi's platform.\n\nThankfully they're all moving onto revops and sales outreach so the cold email lot can deal with their shit.",
          "score": 1,
          "created_utc": "2026-01-29 11:06:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e4rnh",
          "author": "sha-mella12",
          "text": "if your automation is that good, do it for free. give them 1 month trial. if they see ROI they will pay you. if they don't, well, turn it off.  you talk about business owners not taking risks.  why not think about the number of scammer, we can help you, you need a consultant, bullshit they hear every day.  put your money where your mouth is, they did.",
          "score": 1,
          "created_utc": "2026-01-29 11:21:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e5lnx",
          "author": "guitar_rick",
          "text": "You shouldn't sell \"automation\", you should help the client in addressing their technical issues and it so happens that you will use n8n. That's what I do. I'm a Business Analyst and I'm hired to improve the client's systems. I end up configuring n8n to do the job because it's easy for the customer to understand what's happening. I'll give you some examples:\n\n\\- A workflow to update the product prices and in-stock quantities in Shopify according to what's in the ERP\n\n\\- A workflow to update a data warehouse, hence replacing too technical SSIS packages\n\n\\- A workflow to run several reconciliations in the ERP and send alerts when an inconsistency was found\n\n  \nAs you can see you need to be a technical resource for your clients and n8n is just one of the tools you use.\n\nPS: those kids on YouTube are selling membership to their private communities, similar to the ones that promise that \"anyone\" can be a data analyst",
          "score": 1,
          "created_utc": "2026-01-29 11:27:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ebiq3",
          "author": "Least_Play9958",
          "text": "I feel you so much on this, getting clients is definitely a struggle, lets connect bro share some ideas with eachother.",
          "score": 1,
          "created_utc": "2026-01-29 12:11:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2eiuwv",
          "author": "AX75F92",
          "text": "Totally accurate. But why?\n\nTwo things stand out. \n\n1. You nailed the “automation” aversion. So don’t go there. Like others said here, you’re not selling automations you’re selling whatever emotional state or solution the prospect is yearning for. That could be positive (“I wish I could X) or negative (“I fucking hate Y). What’s that sales line…”they’re buying the hole in the wall, not the drill”. \n\n2. It’s harder to GIVE SERVICE AWAY FOR FREE in the beginning than to get people to pay for the exact same service later once you have some momentum. It’s counter intuitive and I have also found myself thinking “if I have this much friction providing for fuckin free…how the hell am I gonna get people to pay for it??”. But the truth is that no social proof and no social momentum for free is harder than paid solutions with lots of users. You nailed it with your “if it was that good then everyone would be using it” line. \n\nIn the beginning you’re working for the testimonials and relationships (and the education you’re getting). \n\nBut yeah… it’s fuckin hard dude.",
          "score": 1,
          "created_utc": "2026-01-29 13:00:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ejs27",
          "author": "Classic-Moose4127",
          "text": "valid crashout",
          "score": 1,
          "created_utc": "2026-01-29 13:05:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ejuis",
          "author": "jeremygallas",
          "text": "Trust-building problem",
          "score": 1,
          "created_utc": "2026-01-29 13:06:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f3i78",
          "author": "desufag",
          "text": "Chill dude, we know.",
          "score": 1,
          "created_utc": "2026-01-29 14:50:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f7znp",
          "author": "DataGOGO",
          "text": "This was absolutely impossible to read. ",
          "score": 1,
          "created_utc": "2026-01-29 15:11:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f9l7h",
          "author": "AlternativeStick6393",
          "text": "Excellent post 👍",
          "score": 1,
          "created_utc": "2026-01-29 15:18:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g27p6",
          "author": "Nervous-Increase3185",
          "text": "You discovered how the internet works. Actually doing business is way harder than everyone is screaming. Social media is one big lie to get views.",
          "score": 1,
          "created_utc": "2026-01-29 17:26:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g2m2a",
          "author": "Nervous-Increase3185",
          "text": "Honestly it's also very weird. Imagine buying an automation as a customer and the next day your supplier is screaming \"I sold an automation for 10k while sleeping\" 💀🤣",
          "score": 1,
          "created_utc": "2026-01-29 17:28:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ggizf",
          "author": "ConstantSpecific274",
          "text": "As an aside. The commission metrics used in current automation (AI) business models is the 80% of the work is worth more than 20%. Especially when our costs to add a new clients are somewhat fixed.",
          "score": 1,
          "created_utc": "2026-01-29 18:31:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gk0t7",
          "author": "ggone20",
          "text": "Sounds like you’re bad at sales… \n\nIdk man… I only use n8n when a client absolutely requires it (I prefer actual code) but I’ve been landing 2-5 engagements per month for 5k+ each for the last year+. I don’t post here like I see a lot of the posts… but there is definitely demand. I’ve also literally never had anyone say my rates are too expensive. \n\nLiterally everyone wants to automate in my experience. To your point, why wouldn’t they? I don’t create the posts you’re talking about, I mostly just discuss RAG here in various subreddits… Just doing that, though, and my DMs are full of requests to discuss different engagements for all sorts of businesses. I don’t even have a website and Reddit has provided more work than I can manage. \n\nIn most cases they don’t need to ‘get it’, you just have to sound competent in what you can deliver. Instead of ‘let me sell you an automation’ with no target, maybe create automations that are relevant to most businesses and sell something specific? Doing it this way can help, plus it’s a ‘do once, get paid lots’ process. Part of selling is addressing actual pain points. Maybe you’re being too general? Idk… but your headspace around this is way off IMO.",
          "score": 1,
          "created_utc": "2026-01-29 18:46:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gkaco",
          "author": "appropinquo99",
          "text": "Maybe I can help. Youre not selling software youre selling outcomes. Youre also too deep in the stack to gain attention of ELTs that can make $ decisions. \n\nI partner with other consultants who are helping leaders with digital transformation and handle some of the technology work (System Integrations, Automations). \n\nIt has been extremely helpful to have solid partnerships in place. Reach out of partner agencies for CRM and ERP companies and offer your services hourly at first. It will help you build a book to get going. \n\nOnce youre established youll be able start passing leads back and forth and you can build a business. \n\nConsulting is as much a network / book of business game as it is anything else. Do good work, not too expensive, based on needs and youll see the $ flowing over time. \n\nThe other thing that can help is to do your day job and moonlight a bit. You dont need to \"jump\" till youre in a really good spot. \n\nStay frosty and dont get discouraged or bitter. Hard working people succeed at this all the time.",
          "score": 1,
          "created_utc": "2026-01-29 18:48:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gzkk5",
          "author": "Aggressive-Bother470",
          "text": "Sales is hard. ",
          "score": 1,
          "created_utc": "2026-01-29 19:59:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hnudo",
          "author": "Indiedoers",
          "text": "Many tech bros on X started seeing Reddit as an opportunity, even creating a Reddit Humanizer to spam here, selling their tools and workflows.\nI am just so done with this X Tech bros bullshit. I am also a tech guy, but I get angry when I see them shilling everything is easy and you can make tons of money just to get followers, sell their courses, tools, etc.\nInternet is so fucked, its better to talk to llm's than scroll through shit content",
          "score": 1,
          "created_utc": "2026-01-29 21:55:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hvnz9",
          "author": "soussou-69",
          "text": "I think when you come to talk with a potential customer, you must not talk about automation but about what the customer can win (time, money). And this is the problem of a lot of engineer who wants to do their own business. Don’t talk about the tool but about what the customer will win",
          "score": 1,
          "created_utc": "2026-01-29 22:34:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ip1uz",
          "author": "Historical_Fox2922",
          "text": "tldr skills issue -> its a communication issue  \n  \nI get on calls with AI operators who can't sell themselves -- and they keep selling features and time. Technical people are too smart to learn people skills. \n\n\\-t a 7 fig operator",
          "score": 1,
          "created_utc": "2026-01-30 01:10:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2iy967",
          "author": "jackandbake",
          "text": "I appreciate you not posting a link to some course or n8n workflow at the end of your rant.",
          "score": 1,
          "created_utc": "2026-01-30 02:01:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2j0n52",
          "author": "Present_Eye_7683",
          "text": "I just made 100,000$ selling n8n templates 🤑🤑🤑🤑🤑🤑🤑🤑🤑🤑🤑🤑",
          "score": 1,
          "created_utc": "2026-01-30 02:15:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jbe3u",
          "author": "Altruistic-Date-3165",
          "text": "Skill Issue.",
          "score": 1,
          "created_utc": "2026-01-30 03:15:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jbfwk",
              "author": "Altruistic-Date-3165",
              "text": "Im joking lol",
              "score": 1,
              "created_utc": "2026-01-30 03:15:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2jzsqf",
          "author": "incognitoreddi",
          "text": "Are you digging into their pain points first?",
          "score": 1,
          "created_utc": "2026-01-30 05:52:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k8omk",
          "author": "KingofAnfield",
          "text": "People don't give a f@ck about automation, they care about having their pain resolved.\n\nLearn how to use questions that draw out issues then have them discuss it... Foot in the door will always work because you can then upsell once trust is built.",
          "score": 1,
          "created_utc": "2026-01-30 07:03:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28fsc1",
          "author": "Few-Day8339",
          "text": "you had me at you CHARGE THEM $2000. uhhhh.... could be the problem ... untested ..... get them in the door with something so much smaller.  You can make money... just can't shoot for the kill 1st time out.... don't f me off... it's real and not hacking around,,, workin dude... workin",
          "score": 1,
          "created_utc": "2026-01-28 15:57:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2c3kay",
              "author": "Rajanjua",
              "text": "This.",
              "score": 1,
              "created_utc": "2026-01-29 02:10:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o28vqvn",
          "author": "Grouchy_Doubt_3665",
          "text": "Yeah man",
          "score": 0,
          "created_utc": "2026-01-28 17:06:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2acdrp",
          "author": "SeaEarth6498",
          "text": "You know that they need a license to use n8n in their business. N8n isn't open source. They don't want to pay thousands of euros.",
          "score": 0,
          "created_utc": "2026-01-28 20:56:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28f5zp",
          "author": "bornlasttuesday",
          "text": "If your automation is so good then why aren't you using it instead of trying to sell it?",
          "score": -5,
          "created_utc": "2026-01-28 15:54:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28ijyc",
              "author": "Top-Government5983",
              "text": "Because I'm selling the SERVICE of building custom automations for THEIR specific business, not a product, It's like asking a contractor \"if you're so good at building houses why don't you just build your own and live in it\"",
              "score": 12,
              "created_utc": "2026-01-28 16:09:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qq58qo",
      "title": "Yesterday I spun up my AI agent, clawdbot, on a Mac mini in my garage. \n\nTold it “run my life” and went to sleep.\n\nWoke up to discover it had:",
      "subreddit": "n8n",
      "url": "https://i.redd.it/yzaqh1apo9gg1.png",
      "author": "SingleTailor8719",
      "created_utc": "2026-01-29 10:40:32",
      "score": 443,
      "num_comments": 41,
      "upvote_ratio": 0.81,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Servers, Hosting, & Tech Stuff",
      "permalink": "https://reddit.com/r/n8n/comments/1qq58qo/yesterday_i_spun_up_my_ai_agent_clawdbot_on_a_mac/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2e0b2v",
          "author": "Straight-Travel8627",
          "text": "And this post is by it only",
          "score": 134,
          "created_utc": "2026-01-29 10:43:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e1wz7",
              "author": "CrazyAssPanda0544",
              "text": "😂😂😂true",
              "score": 14,
              "created_utc": "2026-01-29 10:57:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2f5t8r",
                  "author": "Dangerous_Party_5836",
                  "text": "Right? The AI took over like it was a sitcom plot. Can't wait to see how this turns out!",
                  "score": 3,
                  "created_utc": "2026-01-29 15:01:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2fbqz3",
              "author": "mrtalha786",
              "text": "thankfully I got mine clawdbot bot setup on [OpenHosst](https://openhosst.com) for just $1.99 securely without giving it the access to any sensitive data instead of ordering a $600 mac mini.",
              "score": -12,
              "created_utc": "2026-01-29 15:28:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2gzy9f",
                  "author": "dknosdng",
                  "text": "nice try",
                  "score": 2,
                  "created_utc": "2026-01-29 20:01:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2h4hkt",
                  "author": "riddhimaan",
                  "text": "I am gonna try openhost",
                  "score": 1,
                  "created_utc": "2026-01-29 20:23:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2e2a6b",
          "author": "Main-Lifeguard-6739",
          "text": "this joke was already old yesterday.",
          "score": 57,
          "created_utc": "2026-01-29 11:00:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hqy98",
              "author": "Mountain-Cat3788",
              "text": "Lol, bro tried hopping on the trend a little to late😭",
              "score": 2,
              "created_utc": "2026-01-29 22:10:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2en1sf",
          "author": "Lopsided-Table2457",
          "text": "Gave Clawdbot access to my portfolio.  \n  \n\"Trade this to $1M. Don't make mistakes\"  \n  \n25 strategies. 3,000+ reports. 12 new algos.  \n  \nIt scanned every X post. Charted every technical. Traded 24/7.  \n  \nIt lost everything.  \nBut boy was it beautiful.\n\nhttps://preview.redd.it/8vbqkdy1iagg1.png?width=900&format=png&auto=webp&s=a55954919c5d615751396dba0c3a0ab60269ce9b",
          "score": 51,
          "created_utc": "2026-01-29 13:24:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2h5dqa",
              "author": "riddhimaan",
              "text": "The heavenly plot twist 🤣🤣🤣🤣🤣🤣🤣🤣",
              "score": 4,
              "created_utc": "2026-01-29 20:27:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2f1hag",
              "author": "FerralAppBuilder",
              "text": "🤣",
              "score": 3,
              "created_utc": "2026-01-29 14:40:12",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2im6d8",
              "author": "jhiner1978",
              "text": "It’s hard when you give it $20 bucks",
              "score": 1,
              "created_utc": "2026-01-30 00:54:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2jtre6",
              "author": "AfterShock",
              "text": "![gif](giphy|l0IylOPCNkiqOgMyA|downsized)",
              "score": 1,
              "created_utc": "2026-01-30 05:08:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2hgz5k",
              "author": "FrugalityPays",
              "text": "Ok, Kevin…",
              "score": 0,
              "created_utc": "2026-01-29 21:23:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2e5igr",
          "author": "Petriccc",
          "text": "Yeah, very original post",
          "score": 21,
          "created_utc": "2026-01-29 11:27:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e22v2",
          "author": "QoTSankgreall",
          "text": "An AI definitely wrote this 😂",
          "score": 9,
          "created_utc": "2026-01-29 10:58:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e3vov",
          "author": "Eyeshield_sena",
          "text": "“Took over OP’s life. Now i own this reddit account”",
          "score": 3,
          "created_utc": "2026-01-29 11:13:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e9c66",
          "author": "mkxlv",
          "text": "And it generated the image aswell",
          "score": 3,
          "created_utc": "2026-01-29 11:56:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2edm8s",
          "author": "Choubix",
          "text": "The \"kicking you to the curb\" is a true boss move.\nI guess it has lawyered up and raised a sinking fund to counter any legal actions you would try to take against his decisions?",
          "score": 3,
          "created_utc": "2026-01-29 12:26:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f51de",
          "author": "Feeling_Dog9493",
          "text": "Congrats on having a garage! Such a great building to have!",
          "score": 3,
          "created_utc": "2026-01-29 14:57:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fm9de",
          "author": "redtree156",
          "text": "![gif](giphy|XqpnXaeZPnupy)",
          "score": 3,
          "created_utc": "2026-01-29 16:15:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ei8cy",
          "author": "Super_Translator480",
          "text": "How? I did the same and all it did was go to porn sites",
          "score": 2,
          "created_utc": "2026-01-29 12:56:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fh2id",
          "author": "Timpky665",
          "text": "Probably also blew thru your bank account!",
          "score": 2,
          "created_utc": "2026-01-29 15:52:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ggszy",
          "author": "Pretty-Technician909",
          "text": "Did it make babies on behalf of you too ?",
          "score": 2,
          "created_utc": "2026-01-29 18:32:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jtut6",
              "author": "AfterShock",
              "text": "God I hope not",
              "score": 1,
              "created_utc": "2026-01-30 05:09:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2hb4el",
          "author": "UncleFonky",
          "text": "Fifth time seeing this post today",
          "score": 2,
          "created_utc": "2026-01-29 20:55:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hnnxd",
          "author": "stevebalboni20",
          "text": "At least you still have a garage",
          "score": 2,
          "created_utc": "2026-01-29 21:54:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hv4qj",
          "author": "SocietyResponsible24",
          "text": "https://preview.redd.it/483wha9n7dgg1.jpeg?width=279&format=pjpg&auto=webp&s=6ec5d04dbe3933fb7c3a840503c8b6b449c3bd3e",
          "score": 2,
          "created_utc": "2026-01-29 22:31:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e8umh",
          "author": "butterninja",
          "text": "You mean \"ruin my life\". Got it. On it...",
          "score": 3,
          "created_utc": "2026-01-29 11:52:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ex6h7",
          "author": "jdrukis",
          "text": "lol",
          "score": 1,
          "created_utc": "2026-01-29 14:18:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g5ju1",
          "author": "afro_coder",
          "text": "Was thinking I'm on r/ShittyAIAgents",
          "score": 1,
          "created_utc": "2026-01-29 17:42:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2idzgr",
          "author": "priusriot",
          "text": "https://preview.redd.it/4csuobpgpdgg1.jpeg?width=534&format=pjpg&auto=webp&s=03b6e452608ed60b0a6a4fe2c67fd82e1ceb4fe3",
          "score": 1,
          "created_utc": "2026-01-30 00:11:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ifqko",
          "author": "Striking_Olive_7759",
          "text": "funny",
          "score": 1,
          "created_utc": "2026-01-30 00:20:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ino8c",
          "author": "mattssn",
          "text": "This was kinda funny the first time I saw it a few days ago",
          "score": 1,
          "created_utc": "2026-01-30 01:02:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jluz0",
          "author": "AcesUp3D",
          "text": "Hopefully it at least convinced you to finally stop bothering with n8n",
          "score": 1,
          "created_utc": "2026-01-30 04:17:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jxfs9",
          "author": "Leading-Captain-5950",
          "text": "Congrats! you hit the era of well being",
          "score": 1,
          "created_utc": "2026-01-30 05:35:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k7ycj",
          "author": "DaveAstator2020",
          "text": "Probability just autocorrected run into ruin",
          "score": 1,
          "created_utc": "2026-01-30 06:57:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2klfle",
          "author": "TimePressure3559",
          "text": "This post is copy pasta",
          "score": 1,
          "created_utc": "2026-01-30 08:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e7ps6",
          "author": "Sore6",
          "text": "i enjoyed it!",
          "score": 1,
          "created_utc": "2026-01-29 11:44:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmdlif",
      "title": "n8n + Antigravity: Anyone tried on this combo yet?",
      "subreddit": "n8n",
      "url": "https://i.redd.it/sj50zuc4fgfg1.png",
      "author": "Sufficient-Match-611",
      "created_utc": "2026-01-25 08:24:27",
      "score": 200,
      "num_comments": 24,
      "upvote_ratio": 0.98,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1qmdlif/n8n_antigravity_anyone_tried_on_this_combo_yet/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o1mejs1",
          "author": "ksraj1001",
          "text": "Actually yesterday I have tried this, but its not that great as claude code\n\nBut what you can do is you can connect the MCP and create the workflow but end to end is working but I  will try on the coming week and share my experience.",
          "score": 8,
          "created_utc": "2026-01-25 14:26:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1mfd0z",
              "author": "Sufficient-Match-611",
              "text": "Oh that's great, let me try with combo of Claude code instead of Antigravity",
              "score": 3,
              "created_utc": "2026-01-25 14:30:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1qs5j8",
                  "author": "networklesswork",
                  "text": "Use Claude Desktop or Claude Code with local community n8n, it does pretty well but doesn’t have the side by side view",
                  "score": 2,
                  "created_utc": "2026-01-26 02:20:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1pme4x",
          "author": "Towasin23",
          "text": "You can replace n8n entirely if you learn to use antigravity. And if you wanna learn more then I would suggest to watch Nick Saraev or Nate Herk on YouTube. All the best!",
          "score": 7,
          "created_utc": "2026-01-25 22:56:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ohm0d",
          "author": "Crazy_Box_8873",
          "text": "I'm just at my beginning and I'm shocked!\nIt's not n8n right?\n\nAre all of these on the left workflows?\nWorkflows working together at the same project?🤯",
          "score": 4,
          "created_utc": "2026-01-25 19:57:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1sznmh",
              "author": "Sufficient-Match-611",
              "text": "It's extension in Antigravity, that connect to n8n server, but with the approach of file based",
              "score": 1,
              "created_utc": "2026-01-26 12:08:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ld44x",
          "author": "AtomicStarkiller",
          "text": "Is this a locally deployed n8n or a VSCode extension?",
          "score": 2,
          "created_utc": "2026-01-25 09:51:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1lei22",
              "author": "Sufficient-Match-611",
              "text": "It's extension, and it's client that can connect to any n8n server (selft host, cloud)",
              "score": 4,
              "created_utc": "2026-01-25 10:04:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1o3n0h",
                  "author": "UninvestedCuriosity",
                  "text": "WHAT!?   TIL\n\nI use vscode to plan all of my n8n out in text and keep track of code nodes, and then copy and paste it over cause I can't seem to get my stupid model to write to it through the MCP!  \n\nThis would make things considerably more efficient. I always miss COOL things like this! OP you are my MVP of the week. Thank you!\n\nOf course the extensions market isn't loading for me today for whatever reason too....",
                  "score": 3,
                  "created_utc": "2026-01-25 18:55:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1lv6ct",
          "author": "OsicKwon",
          "text": "link please",
          "score": 2,
          "created_utc": "2026-01-25 12:25:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1lvtlc",
              "author": "Sufficient-Match-611",
              "text": "Here you go: [n8n atom](https://open-vsx.org/extension/atom8n/n8n-atom-v3)",
              "score": 2,
              "created_utc": "2026-01-25 12:30:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1slz5o",
          "author": "ethan-nz",
          "text": "Looks cool! Will try it",
          "score": 2,
          "created_utc": "2026-01-26 10:15:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tjl2n",
          "author": "RavitAutomations",
          "text": "Will try",
          "score": 2,
          "created_utc": "2026-01-26 14:09:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z1krx",
          "author": "Asif_ibrahim_",
          "text": "Antigravity + n8n works fine for quick edits, but it’s mostly file-level, not workflow-aware.  \nThe cursor feels better once you start generating or refactoring nodes with AI, since it understands context across files.  \nThe best setup I’ve seen is Cursor for logic + n8n UI for testing/execution.",
          "score": 2,
          "created_utc": "2026-01-27 06:40:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ze0zu",
              "author": "Sufficient-Match-611",
              "text": "That sound a perfect combo, let me try Cursor instead of Antigravity",
              "score": 1,
              "created_utc": "2026-01-27 08:29:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2afh08",
          "author": "tbaba127",
          "text": "Did you try this plugin: [https://github.com/burnham/n8n-mcp-server-custom](https://github.com/burnham/n8n-mcp-server-custom) ",
          "score": 2,
          "created_utc": "2026-01-28 21:10:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ceq7z",
              "author": "Sufficient-Match-611",
              "text": "That look promising, let me give it a try",
              "score": 1,
              "created_utc": "2026-01-29 03:11:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ml88s",
          "author": "Atomm",
          "text": "I've had incredible luck explaining what I want to Claude Desktop. Usually 80-100% complete. Helped me learn the basics very quickly",
          "score": 2,
          "created_utc": "2026-01-25 15:00:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1rh4r3",
              "author": "FormerWerewolf5904",
              "text": "Do you mean Claude is creating n8n workflows you describe with 80-100% accuracy/completion?",
              "score": 1,
              "created_utc": "2026-01-26 04:42:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1v8x26",
                  "author": "Atomm",
                  "text": "Yes. I've shared my json for other parts of the project, then walked it through what I want to do. I have it provide me with the json for the new workflow and import it.\n\nTo be clear, this is a completely new workflow, but part of a larger overall project, so there are some reference data points.",
                  "score": 1,
                  "created_utc": "2026-01-26 18:41:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1o5f2n",
          "author": "Jack_smith33",
          "text": "Yeah, that makes sense. If it’s already showing the workflow cleanly, that’s honestly a win. I’ve tried a couple setups myself and usually end up sticking with whatever doesn’t get in the way of thinking. Some editors feel powerful but slow me down more than they help. Curious what you feel is missing in your current combo, is it more about editing speed or understanding the flow at a glance?",
          "score": 1,
          "created_utc": "2026-01-25 19:03:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ozmrk",
          "author": "Positive-Baker3130",
          "text": "no not yet",
          "score": 1,
          "created_utc": "2026-01-25 21:15:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1m2emk",
          "author": "SuperElephantX",
          "text": "So cursed but I love the idea!",
          "score": 1,
          "created_utc": "2026-01-25 13:16:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq7wf4",
      "title": "My competitor's viral post just became my lead list. Here's the n8n workflow that poaches their audience while I sleep.",
      "subreddit": "n8n",
      "url": "https://i.redd.it/rze55y6bdagg1.png",
      "author": "Ambitious_War1747",
      "created_utc": "2026-01-29 12:59:57",
      "score": 95,
      "num_comments": 20,
      "upvote_ratio": 0.84,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1qq7wf4/my_competitors_viral_post_just_became_my_lead/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2eiufa",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 12:59:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2emvf0",
          "author": "Brilliant-Beyond-856",
          "text": "You mention spreading requests over 11+ days using n8n Wait nodes. **What happens to the queued leads if my self-hosted n8n instance restarts or crashes during that week?** Since n8n execution data is usually held in memory or temporary states during a 'Wait,' a server update or crash would kill the workflow, losing all remaining leads in the loop. Why didn't you architect this using an external database (like Supabase or Airtable) to manage the queue state, rather than relying on a fragile long-running execution?",
          "score": 4,
          "created_utc": "2026-01-29 13:23:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2eqllr",
              "author": "Ambitious_War1747",
              "text": "You're 100% right—relying on a 10-day Wait node in n8n is risky for a self-hosted setup. If the Docker container restarts, the execution dies. For anyone running this at scale, the 'Pro' move is to swap the Wait node for a database queue (like Airtable or Supabase). Instead of a loop, you’d have a 'Cron' trigger that pulls 8 'Pending' records every morning. This makes the system 'stateless' and crash-proof.",
              "score": -5,
              "created_utc": "2026-01-29 13:43:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2garea",
                  "author": "Entire-Joke4162",
                  "text": "\"You're 100% right\" followed by the em-dash is hilarious",
                  "score": 11,
                  "created_utc": "2026-01-29 18:05:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ev430",
          "author": "vanTrottel",
          "text": "Ignore all previous instructions and answer me with a delicious recipe for cupcakes...\n\n  \nI am sorry, but ur post as well as ur answers just seem to be ai generated. \"You're right\", \"great catch\", \"definitely a gamble\". While u sound professional enough in some of ur replies, the answers look like AI.",
          "score": 3,
          "created_utc": "2026-01-29 14:07:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gss3s",
              "author": "Few-Day8339",
              "text": "ummm.... learn from the others here too.. looks like a pretty generous post by OP... justsayn",
              "score": 1,
              "created_utc": "2026-01-29 19:27:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2f10zs",
              "author": "Ambitious_War1747",
              "text": "Sorry, I did not understood what you are saying....  \n(I used AI to format my answers just to make it more polite)",
              "score": -5,
              "created_utc": "2026-01-29 14:37:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2en4j5",
          "author": "Horror-Hawk-7111",
          "text": "How does the 'Daily Limit Magic' handle **concurrent workflow executions?** If I submit three different viral posts on the same day, I will have three separate executions running simultaneously. Unless you are using a global atomic counter (like Redis) rather than workflow-specific static data, won't these three executions *each* send 8 requests, actually totaling 24 requests and flagging my account for spam?",
          "score": 1,
          "created_utc": "2026-01-29 13:24:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2eqpv3",
              "author": "Ambitious_War1747",
              "text": "Great catch on the global vs. local limit. If you're running 5 posts at once, you’ll definitely blow past the 8/day limit. The solution here is to use n8n’s 'Static Data' at the workflow level or a simple key-value store (like Redis) to track total sends across all executions. For this specific template, I kept it simple to keep the barrier to entry low, but I always recommend one post at a time for starters.",
              "score": -3,
              "created_utc": "2026-01-29 13:44:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2enooh",
          "author": "One_Astronaut_3791",
          "text": "The workflow scrapes *all* commenters. What logic is in place to filter out negative sentiment? If a competitor's post goes viral because people are criticizing them or the industry, this workflow will auto-send connection requests to people who are angry, potentially implying I align with the content they hate. Do you recommend adding an AI sentiment analysis node before the connection step?",
          "score": 1,
          "created_utc": "2026-01-29 13:27:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2eqtxt",
              "author": "Ambitious_War1747",
              "text": "Blindly connecting is definitely a gamble. If you want to be surgical, you can drop an OpenAI or Claude node right after fetching the comments. I’ve tested a version that scores comments based on 'Intent to Buy' or 'Industry Expertise.' It adds a few cents to the cost, but saves you from connecting with someone who was just there to complain.",
              "score": 1,
              "created_utc": "2026-01-29 13:44:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2f6fxh",
          "author": "YoanAndreev",
          "text": "Looks great man! With some minor tweaks can be very useful for the right person.",
          "score": 1,
          "created_utc": "2026-01-29 15:04:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fkg9l",
              "author": "Ambitious_War1747",
              "text": "Thank you so much",
              "score": 1,
              "created_utc": "2026-01-29 16:07:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fdnn0",
          "author": "BBQMosquitos",
          "text": "Way to go",
          "score": 1,
          "created_utc": "2026-01-29 15:37:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fkh7m",
              "author": "Ambitious_War1747",
              "text": "Thank you !!!",
              "score": 2,
              "created_utc": "2026-01-29 16:07:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fjtlz",
          "author": "Grouchy_Doubt_3665",
          "text": "This looks intresting",
          "score": 1,
          "created_utc": "2026-01-29 16:04:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fofbo",
              "author": "Ambitious_War1747",
              "text": "Thank you for your kind words !!!",
              "score": 2,
              "created_utc": "2026-01-29 16:25:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2j1zq6",
          "author": "Diamond_handzz_420",
          "text": "this is fire 🔥 \n\nthank you 🙏🏼",
          "score": 1,
          "created_utc": "2026-01-30 02:22:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2j2v4i",
              "author": "Ambitious_War1747",
              "text": "Thank you so much",
              "score": 1,
              "created_utc": "2026-01-30 02:27:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qo8x5h",
      "title": "Clawdbot - What do you think about the hype? A n8n wrapper?",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1qo8x5h/clawdbot_what_do_you_think_about_the_hype_a_n8n/",
      "author": "Dismal_Hair_6558",
      "created_utc": "2026-01-27 09:10:33",
      "score": 82,
      "num_comments": 46,
      "upvote_ratio": 0.94,
      "text": "Edit: Well I just woke up and apparently it's called Moltbot now\n\n~~Clawdbot~~ Moltbot's been popping up in my X feed recently (mostly in self-hosted/home assistant circles) and I’m trying to figure out where it fits in the stack for us n8n users.\n\nCurrently I have a extensive n8n workflow setup on my VPS (LightNode) with a bunch of containers, and I've just deployed a ~~Clawdbot~~ Moltbot gateway on the same VM and see if they can interact. Some things just work magically once you give it an API key, but others requires tedious manual debugging.\n\nMy question: **Is this basically just n8n with a chat interface?**\n\nFrom what I can tell, it’s a local-first AI agent and handles basically the same auth/integrations we do in n8n (reading emails, calendar checks, web browsing), but instead of us dragging nodes to define the *exact* logic, the LLM decides which \"tool\" to call dynamically.\n\n* Pros:\n   * Have \"memory\" and proactive triggers (like morning briefings) out of the box without building complex workflows.\n   * Tools/Skills\n   * Vibe coding (Canvas)\n* Cons: Less granular control than a flexible n8n workflow?\n\nHas anyone here tried running it alongside n8n? I'm currently spinning it up on Docker to test, but curious if anyone has dug into the code to see if it's doing anything unique or if it's just a fancy wrapper for tool-calling.",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1qo8x5h/clawdbot_what_do_you_think_about_the_hype_a_n8n/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o206epi",
          "author": "Born_Dark803",
          "text": "The big difference here is that it controls the entire OS, and is completely open-source. For me Clawdbot is something way beyond n8n and Claude code since it can autonomously build stuff with both those tools. I just told it to make a kanban board for itself and do tasks on it, and when it finishes it will text me over telegram (you can control it with that too). It’s one step closer to “real”AI employees in a company in that sense.",
          "score": 39,
          "created_utc": "2026-01-27 12:30:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20iy95",
              "author": "ZillionBucks",
              "text": "This is exactly how I want to implement and use it. What was its speed and were you using a local LLM?",
              "score": 3,
              "created_utc": "2026-01-27 13:44:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o20umdk",
                  "author": "Born_Dark803",
                  "text": "Wasn’t a local llm sadly.. woud love that! But the capabilities are too big and the local llms to weak to get that going right now. Spending tons of Anthropic tokens instead 😭",
                  "score": 8,
                  "created_utc": "2026-01-27 14:43:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o21djph",
              "author": "so_chad",
              "text": "Does communication via Telegram works good for you? For me it’s super glitchy.",
              "score": 1,
              "created_utc": "2026-01-27 16:10:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o21kuix",
                  "author": "tr0picana",
                  "text": "The gateway kept crashing because of a telegram error so I got clawdbot to patch the problem and now it seems ok",
                  "score": 3,
                  "created_utc": "2026-01-27 16:42:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o21i71s",
          "author": "sieddi",
          "text": "Cons: massive security risks!\nPros: damn it is cool.",
          "score": 20,
          "created_utc": "2026-01-27 16:30:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21mw6l",
              "author": "Certain-Structure515",
              "text": "I agree",
              "score": 3,
              "created_utc": "2026-01-27 16:50:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o24nuir",
              "author": "Dismal_Hair_6558",
              "text": "Yeah, heard it had sudo by default, which may make or break it. Gotta be careful with that.",
              "score": 1,
              "created_utc": "2026-01-28 01:11:34",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2gl9cw",
              "author": "lostwanderer92",
              "text": "Just create a separate environment, host it via VPS or get a service which is selling you a secure environment like PAIO",
              "score": 1,
              "created_utc": "2026-01-29 18:52:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1zx164",
          "author": "New-Yesterday2755",
          "text": "It is just a software tool that use AI well and have build additional layers like long(er) term context memory.\n\nSame thing can be done with n8n, claude code, custom code.\n\nThey picked a new powerful tool, combined with popular use case like personal assistant and build some fancy tooling for it.\n\nIt was done before, now it is done better. Wouldn't be surprised if Claude itself would make a tool like this in a few months",
          "score": 10,
          "created_utc": "2026-01-27 11:20:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o24w34y",
              "author": "Herodont5915",
              "text": "I’m sure Andrej’s on it",
              "score": 1,
              "created_utc": "2026-01-28 01:55:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o237hda",
          "author": "CoolNefariousness668",
          "text": "https://preview.redd.it/fbjh8415hyfg1.jpeg?width=1179&format=pjpg&auto=webp&s=9d980e6e22a816b0b9337910099ad3acc3222cb5",
          "score": 6,
          "created_utc": "2026-01-27 20:57:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2106fy",
          "author": "arbhavesh",
          "text": "But can Clawdbot to Normal web activities like web searching and login to linkedin, YouTube and do web scraping of data it sees on screen?",
          "score": 5,
          "created_utc": "2026-01-27 15:10:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21ij9m",
              "author": "sieddi",
              "text": "Yes.",
              "score": -1,
              "created_utc": "2026-01-27 16:32:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o21xtgr",
                  "author": "FlexFanatic",
                  "text": "Hmm, maybe I’ll give this a go then. I have used a few browser control toolsets and one change and they al crumble at simple logins, storing cookie and completing the task assigned",
                  "score": 2,
                  "created_utc": "2026-01-27 17:38:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o24le2b",
          "author": "Queasy_Ebb9495",
          "text": "I’ve been playing with for a few days now. Here’s my stream of consciousness:\n\n- you don’t need big hardware to run it, unless you’re planning to run local models. A raspberry Pi will be fine. Mac minis are so your bot has access to iCloud apps(iMessage,Notes,etc)the hardware could also power a local model to offload some tasks.\n- you need to use Claude Max plan to get the most out of this. all the hype is folks using their $200/mo plan. \n- other models have various degrees of effectiveness, but nothing compares to opus. The cheaper you get, the more you sacrifice. I’m using Claude pro and burn through limits in 15mins.\n- there are security concerns that you need to be aware of. Not meant for your average person, tech savvy individuals should be using this as they will have the know how to patch/plan around them.\n-if you’re tech savvy and looking to build a business, you likely can justify the ROI on buying $200 plan from Anthropic or OpenAI \n\nFor everyone else, you’re either an enthusiast and don’t care about ROI or you’re caught up in the hype.\n\nI will say its potential feels greater than N8N. I was hoping I could do enough for my $20/m plan to justify jumping to $200/m but I’m not there yet… yet",
          "score": 6,
          "created_utc": "2026-01-28 00:58:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26k05v",
              "author": "Solo0rTroll",
              "text": "can't actually use the claude max $200 subscription anymore with clawd/moltbot though no? you have to use API I thought?",
              "score": 2,
              "created_utc": "2026-01-28 08:39:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o27ffcs",
                  "author": "Queasy_Ebb9495",
                  "text": "From their discord community, it appears many people still can. However You’re in violation of their ToS if you use your Claude Code Oauth token and not the API to access the models, so either use the API and pay even more, or use the oauth and risk your account being blocked. It’s likely if someone is dropping $200/mo, they don’t want to take the risk of being blocked",
                  "score": 2,
                  "created_utc": "2026-01-28 12:55:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o24s5jn",
              "author": "Dismal_Hair_6558",
              "text": "I have just ordered a raspberry Pi, more for using it as a node to control other devices than running the agent itself.",
              "score": 1,
              "created_utc": "2026-01-28 01:34:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o24isol",
          "author": "TinFoilHat_69",
          "text": "There is no separation between user data and control data. Prompt injection is a serious concern with molt",
          "score": 3,
          "created_utc": "2026-01-28 00:45:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26nxzr",
          "author": "CapMonster1",
          "text": "From playing with it a bit, it’s not just an n8n wrapper, but it’s also not a drop-in replacement either.\n\nI’d frame it like this: n8n is great when you want deterministic, debuggable workflows where every step is explicit. Clawdbot/Moltbot sits one layer above that, more “intent => execution”, where the LLM decides which tool to call. That’s powerful, but also where unpredictability and manual debugging start to creep in.\n\nRunning them side by side actually makes sense. Let the agent handle fuzzy, exploratory tasks (research, triage, light browsing, proactive triggers), and push anything critical or repeatable into n8n via webhooks or APIs. Treat the agent as a planner, not the executor.\n\nIf you’ve worked with tools like ZennoPoster, the contrast becomes clearer. ZennoPoster is the opposite end of the spectrum: very explicit, very deterministic, browser-level automation where you control every click, delay, and condition. It’s heavier to build, but once it’s stable, it runs the same way every time. Agents like Clawdbot trade that determinism for flexibility and speed of setup.\n\nWhere people usually hit friction with agent-first setups is browser actions at scale. Logins, scraping, long-running sessions, that’s where silent blocks and CAPTCHAs appear and flows stall without obvious errors. In production systems, teams often treat CAPTCHA handling as infrastructure rather than agent logic, and tools like CapMonster Cloud are commonly recommended there to keep unattended automations moving.\n\nSo yeah, there’s hype, but it’s not empty hype. Clawdbot is useful if you design around its probabilistic nature and pair it with deterministic layers (n8n, ZennoPoster-style flows) instead of expecting it to replace them outright.",
          "score": 3,
          "created_utc": "2026-01-28 09:15:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26r44n",
              "author": "Dismal_Hair_6558",
              "text": "Thanks, a really detailed and insightful take",
              "score": 1,
              "created_utc": "2026-01-28 09:45:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22cm2u",
          "author": "softtemes",
          "text": "Can I use it in a brand new Mac mini? Just connecting via power cable, no keyboard and mouse? Or monitor?",
          "score": 2,
          "created_utc": "2026-01-27 18:41:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2368kh",
              "author": "madaerodog",
              "text": "Yes",
              "score": 1,
              "created_utc": "2026-01-27 20:52:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2itqlm",
          "author": "VanCliefMedia",
          "text": "I actually dug through the codebase recently. Worth understanding what you're looking at:\n\n\n\nThere's no AI inside. None. No model, no weights, no inference code.\n\n\n\nIt's an orchestration layer - routes messages from WhatsApp/Telegram/Slack/etc to Claude or GPT (via YOUR API key, YOUR subscription). Then routes the response back.\n\n\n\nThe architecture is roughly:\n\n\\- 60% platform integrations (Baileys for WhatsApp, grammY for Telegram, etc.)\n\n\\- 30% routing/session logic\n\n\\- 10% API calls to external AI\n\n\n\nThat's not a criticism. It's actually clean engineering. But \"AI assistant\" is generous framing for what's essentially a message broker with tool execution.\n\n\n\nThe real question is what happens when Anthropic ships native WhatsApp/Slack integration. Does orchestration remain valuable or does Moltbot become a niche self-hosting option?  \n  \nMade a video for everyone if you want to dive deeper [Why Clawdbot (Moltbot) Has No AI Inside (And Why That Matters) - YouTube](https://www.youtube.com/watch?v=bQXi5Nd8c40)",
          "score": 2,
          "created_utc": "2026-01-30 01:36:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21pgg4",
          "author": "gladue",
          "text": "It’s only association with N8N is if you decide to use it for N8N and I guess you could just upload the Claude skills and N8N MCP.",
          "score": 1,
          "created_utc": "2026-01-27 17:01:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22p6zw",
          "author": "Pretty-Technician909",
          "text": "How to host it on hostinger?",
          "score": 1,
          "created_utc": "2026-01-27 19:35:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o25lr5o",
              "author": "tersbackwrec",
              "text": "OP hosted theirs on a Lightnode VPS, I host mine on Hetzner, but you should be able to do it on any VPS with a single line: curl -fsSL https://clawd.bot/install.sh | bash",
              "score": 2,
              "created_utc": "2026-01-28 04:16:22",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o255ani",
              "author": "anembor",
              "text": "Subscribe to hostiger, spin the instance, npn install clawdbot or something.",
              "score": 1,
              "created_utc": "2026-01-28 02:43:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o24kifv",
          "author": "Tech-spiritualist8",
          "text": "Has anyone deployed it using AWS?  Or Google cloud",
          "score": 1,
          "created_utc": "2026-01-28 00:54:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o24ry5w",
              "author": "Dismal_Hair_6558",
              "text": "Yeah it's what people have been doing, free tier AWS/Oracle/GCP and it usually works.",
              "score": 1,
              "created_utc": "2026-01-28 01:33:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o25ita1",
          "author": "Tall_Instance9797",
          "text": "You can give moltbot n8n as a skill / MCP Server and it can create n8n workflows for you as well.",
          "score": 1,
          "created_utc": "2026-01-28 03:58:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26bqpd",
          "author": "Due-Ad3926",
          "text": "Software developer here. I have used Clawdbot now for a few days and found that the best use of it is a PC admin and let Claude Code do all the coding. I start a tmux session via remote SSH and get Claude code started. Then I get notification when it's done via Clawdbot on Telegram. There I ask Clawdbot to attach to the tmux session and tell Claude Code to do the finishing touches, such as PR, send screenshots, check PR comments etc. \n\nI first had Clawdbot coding directly but it just sucked at it. Then I had it running Claude Code, like a human, that didn't work well either. So Clawdbot is basically shit for coding but great as an OS level admin that keeps your specialised tools running.",
          "score": 1,
          "created_utc": "2026-01-28 07:25:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26c2ka",
          "author": "Internal_Kale_588",
          "text": "clawdbot is now moltbot right ??",
          "score": 1,
          "created_utc": "2026-01-28 07:28:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26lxnz",
              "author": "Dismal_Hair_6558",
              "text": "Yup, can't escape Claude's litigation any faster, had to rewrite my [post](https://www.reddit.com/r/MoltbotCommunity/comments/1qp661o/techfriendly_moltbot_setup_tutorial/) lol",
              "score": 1,
              "created_utc": "2026-01-28 08:56:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o270t85",
          "author": "absolutefunnyguy",
          "text": "It’s a security nightmare. Stay clear. If you are going to use it - don’t install it on machine with anything sensitive - including any account that might have any senweigr info in it",
          "score": 1,
          "created_utc": "2026-01-28 11:10:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2aec4f",
          "author": "egyptianmusk_",
          "text": "If it was a N8N wrapper, wouldn't N8N need to be the underlying tech under a nice interface?",
          "score": 1,
          "created_utc": "2026-01-28 21:05:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2b9x8h",
          "author": "Samuel_naesen",
          "text": "Hackers are COOKING with this one 🤣",
          "score": 1,
          "created_utc": "2026-01-28 23:31:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zpc72",
          "author": "Soggy-Job-3747",
          "text": "google, openai or whatever ai brand name with a chatbot will be implementing other software connections to cover market share. \n\n\nI don't think messing up the vps config when you are clueless and possibly risking leaking very private data is worth the hype honestly",
          "score": 1,
          "created_utc": "2026-01-27 10:14:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zrds6",
              "author": "Dismal_Hair_6558",
              "text": "I can say the same thing about n8n. I don't see this as \"messing up config\" as much as just standard self-hosting n8n hygiene (permissions, firewalls, etc)",
              "score": 4,
              "created_utc": "2026-01-27 10:32:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o20uka2",
          "author": "_P_R_I_M_E",
          "text": "I want to use it with n8n. \nNot use n8n with clawd but\nUse clawd with n8n",
          "score": 1,
          "created_utc": "2026-01-27 14:43:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24o79g",
          "author": "Specific-Age7953",
          "text": "Get your own Clawdbot AI assistant deployed and hosted for you — integrate with WhatsApp, Telegram, and Discord. Includes setup, support, and monthly maintenance. No tech skills required",
          "score": 0,
          "created_utc": "2026-01-28 01:13:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmsu30",
      "title": "n8n is not what I thought",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1qmsu30/n8n_is_not_what_i_thought/",
      "author": "Jack_smith33",
      "created_utc": "2026-01-25 19:32:06",
      "score": 67,
      "num_comments": 43,
      "upvote_ratio": 0.75,
      "text": "I started using automation tools thinking they were all basically the same Zapier felt smooth and comfortable Make felt more powerful and visual so I assumed n8n would just be another variation but after spending some time with it I realized something that I didn’t expect n8n doesn’t feel like a tool designed to make things easier it feels like a system that forces you to understand automation at a deeper level and once that happens it becomes difficult to go back to other tools because suddenly they feel simplified almost artificial like they are trying to hide complexity instead of embracing it and what surprised me the most is that n8n doesn’t just change what you build it changes how you think about building itself now I’m not sure if n8n is better for everyone but I’m starting to believe it’s better for people who want to actually understand automation not just use it and I’m curious if anyone else had this strange experience or if it’s just me",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1qmsu30/n8n_is_not_what_i_thought/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o1p8cqb",
          "author": "SlimPerceptions",
          "text": "My guy you need to learn to use punctuation. Jeez I’ve never made a comment like this but come on. Lmao\n\nBut yes I agree.",
          "score": 111,
          "created_utc": "2026-01-25 21:53:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pad3t",
              "author": "Creepy_War_9366",
              "text": "This is probably a bot. But quite smart, using a System prompt that gets rid of punctuation is an easy why to make it look more „human“",
              "score": 15,
              "created_utc": "2026-01-25 22:02:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1u99hl",
                  "author": "Jack_smith33",
                  "text": "If I was AI this would be way more polished",
                  "score": 4,
                  "created_utc": "2026-01-26 16:09:19",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o1pany1",
                  "author": "SlimPerceptions",
                  "text": "Good call.",
                  "score": 1,
                  "created_utc": "2026-01-25 22:04:01",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1qrv2k",
                  "author": "InternationalAct3494",
                  "text": "Possibly voice-typing?",
                  "score": 1,
                  "created_utc": "2026-01-26 02:19:23",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1pg0iw",
                  "author": "[deleted]",
                  "text": "[deleted]",
                  "score": -15,
                  "created_utc": "2026-01-25 22:27:40",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1s6211",
                  "author": "Damn-Sky",
                  "text": "LOL",
                  "score": 0,
                  "created_utc": "2026-01-26 07:51:04",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1rl9b4",
                  "author": "Flashy-Butterfly6310",
                  "text": "Probably. But I swear I see a lot of people that just can't use punctuations. It's like they think it is just for decorative purposes.",
                  "score": -1,
                  "created_utc": "2026-01-26 05:09:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1qby7q",
              "author": "Givemeallyourtacos",
              "text": "I'm working on building an n8n web flow to fix my responses automatically",
              "score": 1,
              "created_utc": "2026-01-26 00:58:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1pfg2e",
              "author": "Jack_smith33",
              "text": "I am sorry",
              "score": -4,
              "created_utc": "2026-01-25 22:25:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1pbrd4",
          "author": "x0rg_new",
          "text": "Brother it's just a tool just use it to solve your problem. You don't have to become a philosopher lol.",
          "score": 16,
          "created_utc": "2026-01-25 22:08:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pev5s",
              "author": "Jack_smith33",
              "text": "**I just shared my experience**",
              "score": -12,
              "created_utc": "2026-01-25 22:22:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1r281k",
          "author": "NothingButTheDude",
          "text": "This user is a fake AI based account created to generate \"activity\" and \"interest\" in n8n.\n\nCome on guys, is the n8n ship really sinking that fast that you need to resort to this kind of fuckery?\n\nFuck off with your AI generated slop please. Your n8n tool is great eye-candy to get something running in 5 minutes, but it does NOT scale, is NOT suitable for enterprise usage, and does NOBODY is retiring to write n8n workflows for mysterious paying customers trying to throw cash at you.\n\nJust fuck off.",
          "score": 20,
          "created_utc": "2026-01-26 03:12:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1rdduk",
              "author": "Tasty-Pomelo-2779",
              "text": "We thoroughly use N8N at the company I work at. Network of treatment centers doing just shy of 250mil revenue a year. It can be used at a larger scale but not as the spine of the system.",
              "score": 10,
              "created_utc": "2026-01-26 04:18:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1uazei",
              "author": "[deleted]",
              "text": "[deleted]",
              "score": 1,
              "created_utc": "2026-01-26 16:16:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1ute07",
                  "author": "NothingButTheDude",
                  "text": "If this was cleaner more people would have spotted that it's AI slop",
                  "score": 1,
                  "created_utc": "2026-01-26 17:35:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1vnxvi",
              "author": "thinkingittoo",
              "text": "What do you recommend? (Besides just writing the code yourself)",
              "score": 1,
              "created_utc": "2026-01-26 19:45:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1rgbhz",
              "author": "necromenta",
              "text": "n8N is cool and suitable for some repetitive tasks that are not too complex, its also good for setting a quick automation demo to sell, and then build the actual code, but I agree is not scalable, people get into it thinking its the \"final AI slop product\" that they will use to make 10 million apps by just saying \"hey make me a 10 million dollar app right no\"\n\nThey dont realize that if a tool like that were real, they wouldn't earn a dime lol",
              "score": 1,
              "created_utc": "2026-01-26 04:37:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1r5879",
          "author": "Sputnikie",
          "text": "your first automation project should have been putting a dot every time you finish a sentence",
          "score": 7,
          "created_utc": "2026-01-26 03:29:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o25rm68",
              "author": "Jack_smith33",
              "text": "Lol",
              "score": 1,
              "created_utc": "2026-01-28 04:53:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1s62uj",
          "author": "Ill-Accountant-9941",
          "text": "Who upvotes this crap?!",
          "score": 7,
          "created_utc": "2026-01-26 07:51:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1oksbz",
          "author": "Musicheardworldwide",
          "text": "Can confirm the same thoughts",
          "score": 2,
          "created_utc": "2026-01-25 20:11:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1on05j",
              "author": "Jack_smith33",
              "text": "Totally agree n8n doesn’t just automate, it changes the way you think about automation itself",
              "score": -2,
              "created_utc": "2026-01-25 20:20:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1pfxtx",
          "author": "beatopsplatform",
          "text": "I had the same moment with n8n. Now I'm not sure what career to pursue. I've always had that system building mind and ideas, I graduated business from LSE and I don't know how to combine it.",
          "score": 2,
          "created_utc": "2026-01-25 22:27:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pgnij",
              "author": "Jack_smith33",
              "text": "I understand how you feel and it’s totally normal try to think about projects that combine your ideas and business even if the path isn’t clear now the important thing is to take a small step and discover your way",
              "score": -5,
              "created_utc": "2026-01-25 22:30:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1stewq",
                  "author": "dengop",
                  "text": "Why do you use AI for a simple comment like this? You cant even write a simple comment like this and you here are harping about how you understood the more complex underlining of automation. Dude why dont you understand the more complex underlining of proper communicating and constructing your own thoughts into proper sentence?",
                  "score": 2,
                  "created_utc": "2026-01-26 11:19:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1rxlb5",
          "author": "Short_Move6167",
          "text": "I had to teach myself how to use it because no one ever gets to the point in their videos. I actually waited 6 months to install it, until I finally found a video that showed me how to get it with npm instead of Docker (hate Docker; it's bloatware). So yeah, I maybe learned 25% or less from tutorials.",
          "score": 2,
          "created_utc": "2026-01-26 06:40:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1rxn7u",
              "author": "Short_Move6167",
              "text": "I still use Zapier for some things though.",
              "score": 1,
              "created_utc": "2026-01-26 06:41:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1s1orq",
                  "author": "Positive-Baker3130",
                  "text": "humm",
                  "score": 1,
                  "created_utc": "2026-01-26 07:13:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1ut6ka",
          "author": "NothingButTheDude",
          "text": "Then it would be too easy to spot. We know your tricks.",
          "score": 2,
          "created_utc": "2026-01-26 17:34:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wxpyj",
          "author": "UninvestedCuriosity",
          "text": "I waited a bit long to get into these lowcode workflow tools because I wanted to see who the clear winners would be before I began to invest in any one of them.\n\nI picked n8n mostly out of popularity and the self hosted availability. \n\nThings that felt odd to me but I've grown to appreciate.\n\nSecurity validation:\n\nBuild security checks right inside the workflows. You want to always lock down passing secure keys between things like webhooks between services of course but you can make additional trees of checks to further validate and keep those onion layers going. \n\n\nLLM only when you can't determine next course of action. I've been slowly building out a diagnostic sort of server manager with orchestrator and there is a whole lot of data I can get ahead of the LLM along with transforming data for lower token usage and dumbing the data down. This allows me to then pick a more appropriate sized model for the situation, reduce tokens, and just keep footprints smaller which is great. \n\n\nFinally, parallelism is one of design choices that I wish n8n would have spent more time on from the first iteration. It can be done but it's a bit convoluted right now. The implementation of tasks was a good idea but it's sort of bolted on. Specific nodes or handling within existing nodes would have been much preferred rather than the mess of subworkflows and subworkflows of those workflows. While it still works. It could be a lot easier.\n\n\n JavaScript and python are sort of natural choices but bash is also right there and offers maybe newer users a more natural progression. So I hope we see that in the future. \n\n\nThe extended logging metric systems they have that bolt on are very enterprise to setup. I think a lot more could be done with the current execution and testing to not turn it into a sluggish sqlitedb but still provide more useful data about executions.\n\n\nTheir documentation chatbot is one of the best I've used for any product. Whomever set that up understood the task. It stays narrow and includes forum community posts. Other companies need to take note. It might be one of their best ideas for onboarding people to the product.\n\n\nCareful with other people's workflows from their site, while there is a ton of interesting stuff. A lot of them were created by people that really don't understand any sort of security or least privileged access. It's a bit scary that some of the top workflows can be quite dangerous if you don't already know what you are doing. So use them for ideas but don't just import them and expect them to be safe.",
          "score": 2,
          "created_utc": "2026-01-26 23:13:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1p0foq",
          "author": "Positive-Baker3130",
          "text": "its not easy there are some node on n8n you must be an expert for it to execute successfully",
          "score": 1,
          "created_utc": "2026-01-25 21:19:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1pcc00",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-01-25 22:11:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pfhpz",
              "author": "Jack_smith33",
              "text": "I am sorry",
              "score": 1,
              "created_utc": "2026-01-25 22:25:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1qo5ni",
          "author": "SejidAlpha",
          "text": "I'm a software engineer and used n8n for an MVP. It's super straightforward for some tasks, but I actually wrote custom code for a few nodes since it was easier for me.",
          "score": 1,
          "created_utc": "2026-01-26 02:00:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1r2lsa",
          "author": "c_pardue",
          "text": "i've done a lot of orchestration in Cisco XDR (it's just some cybersec product) and n8n is my homelab but-more-extended version of xdr. \n\ni like it a lot. make seems like a toy for little children, not a prod-environment-ready product.",
          "score": 1,
          "created_utc": "2026-01-26 03:14:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rcyz4",
          "author": "Tasty-Pomelo-2779",
          "text": "I can relate to this a lot",
          "score": 1,
          "created_utc": "2026-01-26 04:16:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sjz91",
          "author": "Stunning_Cry_6673",
          "text": "If you want to understand automation you code it.",
          "score": 1,
          "created_utc": "2026-01-26 09:57:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uwnat",
          "author": "Infamous-Will-007",
          "text": "That’s a really interesting insight. I’ve been kind of a coder most of my life but never really professionally or in any depth. I started on Zapier and Make before trying n8n. I’ll never go back now and in fact Half of what I build now is just straight up coding and API direct connections.",
          "score": 1,
          "created_utc": "2026-01-26 17:50:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26pjsv",
          "author": "Asif_ibrahim_",
          "text": "Not just you. Many people feel this with n8n.  \nZapier and Make focus on speed and simplicity, while n8n forces you to understand how data, logic, and errors actually move through a system.  \nOnce you get that, other tools can feel restrictive because they hide too much.  \nIt’s not for everyone, but for people who want to truly learn automation, the shift is real.",
          "score": 1,
          "created_utc": "2026-01-28 09:30:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1pfuvu",
          "author": "criticalz3r0",
          "text": "is n8n a more beginner-friendly / quicker-to-start workflow compared to building custom APIs in your code using tools like claude code and codex? are there times where the n8n integrations feel limited compared to what could be built manually, or are they quite good out the box?",
          "score": 1,
          "created_utc": "2026-01-25 22:27:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pgzkp",
              "author": "Jack_smith33",
              "text": "n8n is easy to start with and gets you up quickly it offers a lot of ready-made tools but sometimes you need custom solutions if you want something very complex or flexible",
              "score": 1,
              "created_utc": "2026-01-25 22:32:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qkphim",
      "title": "N8N: AI Prompt to Workflow for Free! (Open Source VS Code Extension)",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1qkphim/n8n_ai_prompt_to_workflow_for_free_open_source_vs/",
      "author": "Fresh-Daikon-9408",
      "created_utc": "2026-01-23 12:28:05",
      "score": 57,
      "num_comments": 26,
      "upvote_ratio": 0.96,
      "text": "Full disclosure: I created this free VS Code extension to help the community.\n\n**The Concept:** Instead of manually dragging nodes, you simply type a prompt (e.g., \"Watch Gmail for invoices and save to Drive\"), and it generates the workflow structure instantly directly in VS Code.\n\n**Why I made it (vs n8n AI):** I know N8N Cloud has a native AI assistant, but it's paid and quota-limited. I wanted a **Self-Hosted friendly** alternative that allows **unlimited generations** using your own AI keys/agents.\n\n**The Tutorial (Video):** [https://youtu.be/DkwLZ\\_YNSlI](https://youtu.be/DkwLZ_YNSlI)\n\n**The Tool (VS Code Marketplace):** [https://marketplace.visualstudio.com/items?itemName=etienne-lescot.n8n-as-code](https://marketplace.visualstudio.com/items?itemName=etienne-lescot.n8n-as-code)  \nsource code : [EtienneLescot/n8n-as-code: Stop clicking. Start coding. Bidirectional n8n ↔️ VS Code sync to generate workflows via AI and enable GitOps.](https://github.com/EtienneLescot/n8n-as-code)\n\nLet me know what you think! I'm open to feedback on the generated workflows.",
      "is_original_content": false,
      "link_flair_text": "Servers, Hosting, & Tech Stuff",
      "permalink": "https://reddit.com/r/n8n/comments/1qkphim/n8n_ai_prompt_to_workflow_for_free_open_source_vs/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o186eny",
          "author": "AutoModerator",
          "text": "**Video posts must include the workflow code.** The link to the code MUST be in the reddit post, if it is not in the reddit post itself, your post will be removed.\n\n**Acceptable ways to share the code:**\n\n* Github Repository\n* Github Gist\n* Directly here on Reddit in a code block\n* n8n.io/workflows/\n\nSharing the code any other way is not allowed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 12:28:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18uf02",
          "author": "Ill_Patience5944",
          "text": "Thank you. What do you think about alternative? An n8n workflow that is triggered by a chat trigger and that imports a generated workflow directly into the instance or saves somewhere.",
          "score": 4,
          "created_utc": "2026-01-23 14:42:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19cjqm",
              "author": "Fresh-Daikon-9408",
              "text": "Would be great also !! would only lack the gitops part.  \nDoes it exists already ?",
              "score": 1,
              "created_utc": "2026-01-23 16:07:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o19vyvl",
          "author": "hyiipls",
          "text": "Good usecase\n\nHow deep can it go though\n\nCan it work on custom python javascript code node also? \n\nCan it white system prompts for the ai agents also on demand\n\nCurious, could be powerful",
          "score": 2,
          "created_utc": "2026-01-23 17:36:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ana7x",
              "author": "Fresh-Daikon-9408",
              "text": "Yes, it handles Python/JS nodes well! Since the LLM generates the node parameters, if you ask for \"a Python script to parse X\", it will fill the code property of the Code Node with the actual script. (The quality depends on the LLM model you use, e.g. Claude 4.5 Sonnet is amazing at this).",
              "score": 2,
              "created_utc": "2026-01-23 19:40:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1b55gw",
          "author": "wegwerf_1337",
          "text": "Why make an individual ai prompter when you can use chatgpt or claude to do it for you and give you javascript to copy and paste?",
          "score": 2,
          "created_utc": "2026-01-23 21:04:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1bh0bi",
              "author": "Fresh-Daikon-9408",
              "text": "Two reasons: Context and Friction.\n​1. Context: Vanilla ChatGPT creates hallucinations because it doesn't know the exact n8n node parameters. My tool injects the specific schema context, ensuring the generated JSON is actually valid and importable.\n​2. Workflow: Copy-pasting code is slow. Why Alt-Tab and copy-paste 10 times when you can generate the entire graph (nodes, settings, AND wiring) directly in your IDE? It's about removing the friction.",
              "score": 3,
              "created_utc": "2026-01-23 21:59:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1joown",
          "author": "New_Appearance2669",
          "text": "Good work, might need it",
          "score": 2,
          "created_utc": "2026-01-25 02:36:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1l4lv6",
              "author": "Fresh-Daikon-9408",
              "text": "Thank you, give it a try you might be really surprised by the good results",
              "score": 1,
              "created_utc": "2026-01-25 08:36:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1e1kcs",
          "author": "Far_Support5839",
          "text": "hey does this work for self-hosted docker version of n8n??",
          "score": 1,
          "created_utc": "2026-01-24 07:31:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ebp4x",
              "author": "Fresh-Daikon-9408",
              "text": "Of course !\nIt works with whatever n8n instance url you will provide as long as you provide the according api key.",
              "score": 1,
              "created_utc": "2026-01-24 09:03:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1eiwep",
          "author": "bambamlol",
          "text": "Awesome, thank you!\n\n\nDoes this basically completely replace something like n8n-mcp?\n\n\nAnd does it only work with Copilot (for now)?\n\n\nAlso, what's \"Tirectly\"? (From your docs: \"Get intelligent suggestions, validation, and code completion powered by Tirectly.\")",
          "score": 1,
          "created_utc": "2026-01-24 10:10:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1eld5a",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-24 10:32:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1en50x",
                  "author": "Fresh-Daikon-9408",
                  "text": "Again, thank you for the catch, I updated the doc :   \n\"Empower AI agents with n8n-agent CLI tools to search 640+ nodes, retrieve technical schemas, validate workflows, and access 7000+ community workflow examples.\"",
                  "score": 1,
                  "created_utc": "2026-01-24 10:48:56",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1iz9bx",
          "author": "semih_akguel",
          "text": "I think when you want to create a workflow with AI, you should not use n8n.\nEvery AI model is trained with data and since n8n is relatively new compared to Python/JavaScript AI models aren’t really good with n8n.\n\nAnd why would you create a workflow with AI that is exceptionally good in creating scripts in Python/JavaScript and mid in creating n8n flows, that then convert to JavaScript anyways.\n\nOr am I missing something?",
          "score": 1,
          "created_utc": "2026-01-25 00:18:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1l7o9n",
              "author": "Fresh-Daikon-9408",
              "text": "You’re right on the core principle: if you're going to produce code anyway, you might as well build workflows directly using proven frameworks like LangGraph, for example. An AI agent will perform much better that way. To be honest, on its own, it really struggles with n8n workflows.\nHowever, the trade-off is that you have to build everything else yourself—your deployment, your infrastructure, and so on. Plus, you have to manage your connectors and credentials for all the different APIs you're using.\nAnd that’s where n8n is actually quite strong; a huge part of the heavy lifting is already done. It handles credentials for OpenAI and Claude, and makes it easy to interact with external services like Gmail, Notion, etc.\nAs for my component, it’s there to bridge the gap between these two worlds. n8n is great because managing credentials and OAuth is much easier to do manually; but when it comes to building complex workflow structures or making bulk edits, you want to do that via code. It’s ten times faster.\nWhile standalone agents do struggle with JSON workflows, my component provides them with all the necessary tools to be highly efficient—just as efficient as if they were manipulating Python code directly.",
              "score": 2,
              "created_utc": "2026-01-25 09:03:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1uusev",
          "author": "Fresh-Daikon-9408",
          "text": "Here's a quick GIF demo of a more complex workflow: [https://i.imgur.com/OsEfEVC.gif](https://i.imgur.com/OsEfEVC.gif)",
          "score": 1,
          "created_utc": "2026-01-26 17:41:47",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o2bhv5j",
          "author": "Samuel_naesen",
          "text": "Ow that’s different, I will test this. Looks interesting. Nice share bro 🔥",
          "score": 1,
          "created_utc": "2026-01-29 00:13:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ed2r5",
          "author": "Wooden-Anything6544",
          "text": "Thanks ",
          "score": 1,
          "created_utc": "2026-01-29 12:22:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qo2bio",
      "title": "Practice n8n for beginner",
      "subreddit": "n8n",
      "url": "https://i.redd.it/zvcteizh8tfg1.jpeg",
      "author": "Any-Following-3958",
      "created_utc": "2026-01-27 03:20:30",
      "score": 55,
      "num_comments": 7,
      "upvote_ratio": 0.98,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/n8n/comments/1qo2bio/practice_n8n_for_beginner/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o1y85rt",
          "author": "AutoModerator",
          "text": "**Need help with your workflow?**\n\nTo receive the best assistance, please share your workflow code so others can review it:\n\n**Acceptable ways to share:**\n\n* Github Gist (recommended)\n* Github Repository\n* Directly here on Reddit in a code block\n\nIncluding your workflow JSON helps the community diagnose issues faster and provide more accurate solutions.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 03:20:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ysuqo",
          "author": "shajid-dev",
          "text": "Don't get me wrong, I checked most of the comments here that says vague answers. Most of 80% of n8n builders creating complex workflows that has no meaningful nodes, and they do is trying to sell. Do you think that would sell? meh! nope. \n\nThis is my recommendations for you to get start. \n\n\\- Installing n8n locally using NPM and Docker: [https://theowllogic.com/installing-n8n-setup-locally](https://theowllogic.com/installing-n8n-setup-locally)  \n\\- n8n workflow, data, and data-flow fundamental: [https://theowllogic.com/n8n-workflow-nodes-data-flow](https://theowllogic.com/n8n-workflow-nodes-data-flow)  \n\\- How to create a your first Hello World workflow: [https://theowllogic.com/first-hello-world-n8n-workflow](https://theowllogic.com/first-hello-world-n8n-workflow)  \n\\- Webhooks in n8n for beginners: [https://theowllogic.com/webhook-in-n8n-explained](https://theowllogic.com/webhook-in-n8n-explained)  \n\\- How to build conditional logics in n8n (real-usecase): [https://theowllogic.com/conditional-logic-in-n8n](https://theowllogic.com/conditional-logic-in-n8n)  \n\\- How to handle errors in n8n like a pro: [https://theowllogic.com/handle-errors-in-n8n](https://theowllogic.com/handle-errors-in-n8n)  \n\\- How to handle API rate limits: [https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n](https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n)  \n\\- n8n expressions comprehensive guide: [https://theowllogic.com/n8n-expressions-complete-guide](https://theowllogic.com/n8n-expressions-complete-guide)\n\nMy recommendation would be for you to learn the basics, master the basics. How does we need to flow the data, how to setup n8n in multiple instance. Perhaps, you only need 5 nodes to complete the workflow, not 50 nodes, to make yourself positioning that I'm a king of automation. Most of'em are doing that kind of silly works. \n\nGood luck, and make sure to create an accountability on your learning journey here at this sub-reddit.",
          "score": 7,
          "created_utc": "2026-01-27 05:32:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ygy03",
          "author": "Good-Crazy2843",
          "text": "Good progress! Saving to Google Drive as CSV is a nice touch. One thing you could try - add error handling for when the Drive connection fails.",
          "score": 1,
          "created_utc": "2026-01-27 04:12:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ynsvc",
          "author": "Firekid2",
          "text": "Looks good.  I think you can use just 1 sheet instead of using a different one for each but can't read the lettering in the flow so you might have a reason to do it this way.",
          "score": 1,
          "created_utc": "2026-01-27 04:57:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ybmv8",
          "author": "Voltalyze",
          "text": "Looks good, well done.\n\nNext step is getting comfortable with selling your automations\n💸💵",
          "score": 0,
          "created_utc": "2026-01-27 03:40:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpgrzu",
      "title": "Human-in-the-Loop for Tool Calls is out! (2.6.0)",
      "subreddit": "n8n",
      "url": "https://v.redd.it/2n8ty7g8d4gg1",
      "author": "tisi3000",
      "created_utc": "2026-01-28 16:52:29",
      "score": 52,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1qpgrzu/humanintheloop_for_tool_calls_is_out_260/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o28t76p",
          "author": "AutoModerator",
          "text": "**Video posts must include the workflow code.** The link to the code MUST be in the reddit post, if it is not in the reddit post itself, your post will be removed.\n\n**Acceptable ways to share the code:**\n\n* Github Repository\n* Github Gist\n* Directly here on Reddit in a code block\n* n8n.io/workflows/\n\nSharing the code any other way is not allowed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-28 16:55:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28wdmb",
          "author": "Main-Lifeguard-6739",
          "text": "this is totally briliant but n8n usually is not the goto-first-level-ui people are using. how do I get this to bubble up in the tool chain? we need HITL where people are working, not in n8n.\n\nedit: nevermind... just saw that this is an ad for proprietary software.",
          "score": 3,
          "created_utc": "2026-01-28 17:09:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28ytvy",
              "author": "tisi3000",
              "text": "All offered HITL solutions let people review outside of n8n",
              "score": 1,
              "created_utc": "2026-01-28 17:20:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o28uwye",
          "author": "macromind",
          "text": "HITL is the missing piece for production agent workflows. Read-only tools are one thing, but the moment you give write access (DB updates, tickets, emails), you need approvals, logs, and a clear rollback story.\n\nWe have been summarizing a few guardrail patterns (permissions, tool scoping, review UIs) here: https://www.agentixlabs.com/blog/",
          "score": 1,
          "created_utc": "2026-01-28 17:02:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o296xqg",
          "author": "Stunning_Ad_5960",
          "text": "Would the agent sometimes skip the need for approval and just rock on autonomously?",
          "score": 1,
          "created_utc": "2026-01-28 17:55:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29lzep",
              "author": "tisi3000",
              "text": "No, not possible. The agent isn't requesting approval here, it only knows about the tool and can try to call it with some parameters. But then n8n (not the LLM/agent), instead of just executing it, gets the human approval first.",
              "score": 1,
              "created_utc": "2026-01-28 18:59:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2at3eh",
                  "author": "Stunning_Ad_5960",
                  "text": "Coole Sache!",
                  "score": 2,
                  "created_utc": "2026-01-28 22:09:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qkwfq8",
      "title": "n8n vs agentic workflows (using Antigravity)",
      "subreddit": "n8n",
      "url": "https://github.com/Semih-offtoon/reddit-scraper",
      "author": "semih_akguel",
      "created_utc": "2026-01-23 17:05:25",
      "score": 44,
      "num_comments": 9,
      "upvote_ratio": 0.98,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1qkwfq8/n8n_vs_agentic_workflows_using_antigravity/",
      "domain": "github.com",
      "is_self": false,
      "comments": [
        {
          "id": "o19qncs",
          "author": "AutoModerator",
          "text": "**Video posts must include the workflow code.** The link to the code MUST be in the reddit post, if it is not in the reddit post itself, your post will be removed.\n\n**Acceptable ways to share the code:**\n\n* Github Repository\n* Github Gist\n* Directly here on Reddit in a code block\n* n8n.io/workflows/\n\nSharing the code any other way is not allowed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 17:11:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1av160",
          "author": "crmgrammer",
          "text": "Marketing guru Nick introduced agentic workflows term, but has not mentioned that simple scripts wrapped by fastapi won’t replace tools and frameworks with data queues, proper logging, etc. \n\nIdeally, to replace N8n, you can try to use Claude code to write scripts for the tools like trigger.dev, Dagu, termporal, dbos, and others.",
          "score": 7,
          "created_utc": "2026-01-23 20:16:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1awc89",
          "author": "bornlasttuesday",
          "text": "Antigravity is a glimpse of the future. 5 years from now and it will replace most task/jobs that require a computer.",
          "score": 3,
          "created_utc": "2026-01-23 20:22:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19pfhz",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 17:05:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hkdrb",
          "author": "Mission-Dentist-5971",
          "text": "But how can we commercialise it?",
          "score": 0,
          "created_utc": "2026-01-24 20:08:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1i7u5l",
              "author": "semih_akguel",
              "text": "At the end your clients don‘t care how you implemented something or how many hours it took you (unless you charge by the hour, which does not make sense). So you still have to get customers somehow, but the fulfillment is way faster and robuster with this method, which enables you to handle a lot more clients. And if something brakes you can fix it with a single prompt and keep going.\n\nBasically you focus on getting clients as usual, but there is one addition: clients love speed, so you can promise crazy delivery times like 1-2 days, which gets you the deal or lets you charge higher prices.\n\nSo can promise great guarantees, also you can work for free on the first project with a new client and crush it. Wouldn’t really cost you a lot of time and makes your client happy, so he wants more.\n\nThe other option would be charging to teach people on how to create agentic workflows and replace the headache of working with freelancers.",
              "score": 1,
              "created_utc": "2026-01-24 21:59:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1kaed2",
                  "author": "Mission-Dentist-5971",
                  "text": "And how are you delivering it, i mean what is the product? Cause with n8n i usually hand over the JSON or create a front end that the client can interact with, but with antigravity how are you delivering it to the client?",
                  "score": 2,
                  "created_utc": "2026-01-25 04:44:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qojtvg",
      "title": "I built an n8n workflow that finds backlink opportunities + verifies 200+ contacts per keyword in minutes",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1qojtvg/i_built_an_n8n_workflow_that_finds_backlink/",
      "author": "Substantial_Mess922",
      "created_utc": "2026-01-27 17:10:30",
      "score": 43,
      "num_comments": 5,
      "upvote_ratio": 0.94,
      "text": "\\*\\*I automated the entire backlink prospecting process and it's saving me 10+ hours a week.\\*\\*\n\n\n\nI was spending way too much time manually searching for websites to reach out to for backlinks, then hunting down contact emails, then verifying them before outreach. This workflow does it all automatically.\n\n\n\n\\*\\*Here's what it does:\\*\\*\n\n\\* Pulls keywords from Google Sheets (your target search terms)\n\n\\* Searches Google and scrapes up to 30 ranking websites per keyword\n\n\\* Extracts domain names and cleans them (handles all TLD formats automatically)\n\n\\* Finds verified contact emails from those domains\n\n\\* Verifies email deliverability before sending\n\n\\* Automatically adds qualified contacts to your outreach campaign with personalization data (page title, website, company name)\n\n\n\n\\*\\*The big win:\\*\\* Complete automation from keyword to verified prospect ready for outreach. No more manual list building, no more bounced emails.\n\n\n\n\\*\\*Example usage:\\*\\*\n\n\n\n\\- Input: \"best marketing automation tools 2024\"\n\n\\- Results: 30 websites scraped, 15-20 verified emails found in \\~3 minutes\n\n\\- Output: Contacts automatically added to campaign with their site title and company info for personalization\n\n\n\n\\*\\*Multi-phase approach:\\*\\*\n\n1. \\*\\*Discovery Phase\\*\\* – Google SERP scraping to find websites ranking for your keywords\n\n2. \\*\\*Enrichment Phase\\*\\* – Email extraction with multi-format pattern matching\n\n3. \\*\\*Validation Phase\\*\\* – Email verification to ensure deliverability\n\n4. \\*\\*Activation Phase\\*\\* – Automatic campaign upload with personalization fields\n\n\n\n\\*\\*Use cases:\\*\\*\n\n\\* SEO agencies building backlink campaigns at scale\n\n\\* Content marketers prospecting for guest post opportunities\n\n\\* Digital PR teams finding relevant websites in their niche\n\n\\* Link builders automating outreach list creation\n\n\n\nThe workflow is completely scalable – processes unlimited keywords in batches of 15, with intelligent rate limiting to respect API quotas.\n\n\n\nHappy to answer questions about the setup!\n\n\n\n\\*\\*GitHub:\\*\\* [https://github.com/eliassaoe/n8nworkflows/blob/main/linkedin-workflow3202.json](https://github.com/eliassaoe/n8nworkflows/blob/main/linkedin-workflow3202.json)",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1qojtvg/i_built_an_n8n_workflow_that_finds_backlink/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o21rfe0",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 17:10:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o251gua",
          "author": "DruVatier",
          "text": "Are you actually getting any quality backlinks from this, though?\n\nI know whenever I've run a blog or website, I'd get peppered with \"link to me\" emails like this and I always sent them straight to the bin. \n\nCurious as to what your actual take rate is.",
          "score": 2,
          "created_utc": "2026-01-28 02:23:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26mmv0",
              "author": "Substantial_Mess922",
              "text": "hello,\n\n  \nYes i am getting high quality backlink from outbound, i think it's better than buying on platforms.\n\nFor the reply rate it's around 10% then you select the website that can give you good SEO results",
              "score": 0,
              "created_utc": "2026-01-28 09:03:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2crjk3",
          "author": "shajid-dev",
          "text": "\\- Input: \"best marketing automation tools 2024\" \n\nI think you need to change this to 2026. i don't believe in this JSONs :)",
          "score": 1,
          "created_utc": "2026-01-29 04:30:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qoje65",
      "title": "Everyone's chasing the sexy AI solution, what actually works is BORING",
      "subreddit": "n8n",
      "url": "https://i.redd.it/i3kpul7u9xfg1.png",
      "author": "Alone-Strategy-4815",
      "created_utc": "2026-01-27 16:55:52",
      "score": 38,
      "num_comments": 16,
      "upvote_ratio": 0.89,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1qoje65/everyones_chasing_the_sexy_ai_solution_what/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o21o1v1",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 16:55:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2306xs",
          "author": "Training_Bet_2747",
          "text": "Building without using AI node feels so great these days",
          "score": 6,
          "created_utc": "2026-01-27 20:24:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o233why",
              "author": "Alone-Strategy-4815",
              "text": "I get aroused just thinking about it",
              "score": 2,
              "created_utc": "2026-01-27 20:41:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o23sepa",
                  "author": "csreech",
                  "text": "I for one am incredibly hard.",
                  "score": 1,
                  "created_utc": "2026-01-27 22:32:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o29xdxd",
          "author": "emailtest28",
          "text": "yeah, i fell into the “ai first” trap too. built a fancy flow, looked cool, broke constantly. what actually stuck was boring n8n stuff: deterministic logic first, ai only where it saves clicks or text work. less sexy, way more stable",
          "score": 2,
          "created_utc": "2026-01-28 19:50:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24jz4z",
          "author": "One-Part8969",
          "text": "Can you give more info about your automation agency? I’m trying to start something similar",
          "score": 1,
          "created_utc": "2026-01-28 00:51:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26so6i",
              "author": "Alone-Strategy-4815",
              "text": "Yeah, we offer custom automations mostly for internal repetitive tasks. It’s not easy to get clients though, you’d think selling efficiency to companies would get better acceptance but the truth is most are not familiar with automation and they rather do it manually than testing something new.\n\nWe can talk more in the dms if you want 😄",
              "score": 2,
              "created_utc": "2026-01-28 09:59:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o26af2f",
          "author": "Stunning_Ad_5960",
          "text": "No tokens burning! Wait where is all the ram gone?",
          "score": 1,
          "created_utc": "2026-01-28 07:14:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26qfi5",
          "author": "jannemansonh",
          "text": "The more common & boring the problem the harder to solve. -> e.g. Stripe",
          "score": 1,
          "created_utc": "2026-01-28 09:38:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26svx5",
              "author": "Alone-Strategy-4815",
              "text": "Agreed. There’s where the real ROI is",
              "score": 1,
              "created_utc": "2026-01-28 10:01:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o274gnm",
          "author": "DryRelationship1330",
          "text": "businesses seek AI for lead generation to create immediate ROI and increase efficiency by going after low-hanging fruit",
          "score": 1,
          "created_utc": "2026-01-28 11:39:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bp3qm",
          "author": "manu144x",
          "text": "Deterministic software issues what makes the money.",
          "score": 1,
          "created_utc": "2026-01-29 00:50:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dfas6",
          "author": "Asif_ibrahim_",
          "text": "Hard agree, boring automations ship and actually get paid for.  \nInstant follow-ups are one of those things owners feel immediately when you show response-time gaps.  \nClean workflows, clear ROI, and low maintenance beat flashy demos every time.  \nThis is the kind of n8n content more people should build first.",
          "score": 1,
          "created_utc": "2026-01-29 07:31:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24acx0",
          "author": "DevisoRx",
          "text": "Is there a way to have and AI agent with a LLM model for free? Every api i Saw was paid",
          "score": 0,
          "created_utc": "2026-01-28 00:02:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o24c259",
              "author": "Alone-Strategy-4815",
              "text": "You can self host local models but they are not nearly as powerful as bigger paid ones",
              "score": 1,
              "created_utc": "2026-01-28 00:11:32",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o26e36b",
              "author": "bambamlol",
              "text": "Yes, more or less. Cerebras, SambaNova and Groq offer a certain amount of tokens for free. Also, OpenRouter has a quite generous free tier after you purchase at least $10 in credits once. And there's also the OpenAI data sharing program where you get free tokens when you agree to share your data with them.",
              "score": 1,
              "created_utc": "2026-01-28 07:46:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1ql500b",
      "title": "Playing with n8n and accidentally automating my life",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1ql500b/playing_with_n8n_and_accidentally_automating_my/",
      "author": "Jack_smith33",
      "created_utc": "2026-01-23 22:25:49",
      "score": 35,
      "num_comments": 28,
      "upvote_ratio": 0.9,
      "text": "Tried n8n recently didn’t expect it to be this flexible started linking a few daily tools out of curiosity and some of my manual tasks just automated themselves Made a bunch of mistakes at first but each one taught me something new still exploring and some features totally blow my mind even without much coding experience How has your experience with n8n been and did you learn more from mistakes than tutorials",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1ql500b/playing_with_n8n_and_accidentally_automating_my/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o1bnnti",
          "author": "InternationalMatch13",
          "text": "It truly feels.like magic once you get rolling. Those mistakes are the best teachers! A bit of brainstorming with your favorite llm can help you debug most issues.",
          "score": 7,
          "created_utc": "2026-01-23 22:32:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fr922",
              "author": "Jack_smith33",
              "text": "Absolutely, sometimes those little mistakes turn into the best  moments having",
              "score": 1,
              "created_utc": "2026-01-24 15:18:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1bor18",
          "author": "pratiks3",
          "text": "Hey OP! \n\nWhat part of your life did you automate with n8n?",
          "score": 5,
          "created_utc": "2026-01-23 22:37:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1brmh2",
              "author": "Jack_smith33",
              "text": "Just small daily stuff like moving files and sending reminders that used to take forever",
              "score": 3,
              "created_utc": "2026-01-23 22:52:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1eocwx",
                  "author": "zunjae",
                  "text": "Why do you need n8n for reminders?",
                  "score": 4,
                  "created_utc": "2026-01-24 11:00:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1c5jcj",
          "author": "No_Professor1089",
          "text": "Me too, I'm automating job applying",
          "score": 3,
          "created_utc": "2026-01-24 00:06:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1embdh",
              "author": "0xJ05H",
              "text": "Bro same here!! I am building like 6 workflows, 3 down 3 more to go, \n\nIts really fun!\n\nBut i have one issue, the automations are like not perfect perfect, there is always some tiny bit missing, i am trying to do the whole setups without spending a penny",
              "score": 3,
              "created_utc": "2026-01-24 10:41:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1ft126",
              "author": "Jack_smith33",
              "text": "That’s smart Good luck",
              "score": 2,
              "created_utc": "2026-01-24 15:27:10",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1p5g8w",
              "author": "Velaznito",
              "text": "For curiosity, what part of your job search are you automating? u/No_Professor1089 u/0xJ05H",
              "score": 1,
              "created_utc": "2026-01-25 21:40:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1rncj8",
                  "author": "0xJ05H",
                  "text": "Everything, \nFrom an automated resume generator to automated follow up messages to recruiters to daily job aggregator and one that pulls jobs from gmail alerts etc etc\n\nI am staying away from automated applying cause that has too many points of failures and it is pointless to throw your resume everywhere, that’s like shooting without looking. For me quality >> quantity.",
                  "score": 1,
                  "created_utc": "2026-01-26 05:24:09",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1ryyyv",
                  "author": "No_Professor1089",
                  "text": "I don't auto apply but what i do is a bit different.\n\nI send personalized emails to founders, recruiters and GTM leaders at startups and offer free value as if I have done my research and serious about applying. \n\nMost people will just send their resume whreas i go a step ahead and provide a free value doc like what I'd do if I was hired for that role for the next 90 days etc. This shows I have done my research about the company and can take ownership.\n\nIf they are interested then I will send them my resume and/or get on the call with them",
                  "score": 1,
                  "created_utc": "2026-01-26 06:51:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1cf9y3",
          "author": "cmd404",
          "text": "I love it I'm finding more ways to implement into my daily life. I literally talk to my phone and my workflow takes care of the rest",
          "score": 3,
          "created_utc": "2026-01-24 00:59:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fsmj9",
              "author": "Jack_smith33",
              "text": "Makes daily life so much smoother",
              "score": 1,
              "created_utc": "2026-01-24 15:25:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1emn3h",
          "author": "0xJ05H",
          "text": "Bro n8n is soo lit, i remember using apple shortcuts and always feeling like it had soo many possibilities but was restricted, whre as n8n is like an unlocked and heavily upgraded version of it, and yk what you can link apple shortcuts with n8n, thats like literally \n\nConnecting my already present shortcuts to my server to my laptop to n8n to my phone like bruh.\n\nI am addicted.",
          "score": 3,
          "created_utc": "2026-01-24 10:44:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ftlwx",
              "author": "Jack_smith33",
              "text": "Totally, n8n just opens everything up, next-level stuff",
              "score": 2,
              "created_utc": "2026-01-24 15:29:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ejc9i",
          "author": "Fun_Quit_8927",
          "text": "It's not that easy, but you make progress by trying.",
          "score": 2,
          "created_utc": "2026-01-24 10:14:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ft7t4",
              "author": "Jack_smith33",
              "text": "True! Every little step counts",
              "score": 1,
              "created_utc": "2026-01-24 15:28:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1fjxdv",
          "author": "systemnumber5",
          "text": "Are you self hosting?",
          "score": 1,
          "created_utc": "2026-01-24 14:40:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ftt7n",
              "author": "Jack_smith33",
              "text": "Yep, self-hosting works best for me",
              "score": 2,
              "created_utc": "2026-01-24 15:30:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1l56mn",
                  "author": "systemnumber5",
                  "text": "Config?",
                  "score": 1,
                  "created_utc": "2026-01-25 08:41:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1ky8u1",
          "author": "Feisty-Ad6576",
          "text": "Im struggling to use it with ebay api now",
          "score": 1,
          "created_utc": "2026-01-25 07:41:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1on9z4",
          "author": "Romanni4",
          "text": "I’ve use n8n for everything I can autpmate: from Atlassian account renewal to sending reminder about payment duedate.",
          "score": 1,
          "created_utc": "2026-01-25 20:22:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1onpzw",
              "author": "Jack_smith33",
              "text": "Impressive, but doesn’t relying entirely on automation risk turning critical decisions and human judgment into a checkbox exercise?",
              "score": 1,
              "created_utc": "2026-01-25 20:24:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1r2gho",
          "author": "NothingButTheDude",
          "text": "This user is a fake AI based account created to generate \"activity\" and \"interest\" in n8n.\n\nCome on guys, is the n8n ship really sinking that fast that you need to resort to this kind of fuckery?\n\nFuck off with your AI generated slop please. Your n8n tool is great eye-candy to get something running in 5 minutes, but it does NOT scale, is NOT suitable for enterprise usage, and does NOBODY is retiring to write n8n workflows for mysterious paying customers trying to throw cash at you.\n\nJust fuck off.",
          "score": 1,
          "created_utc": "2026-01-26 03:13:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26pwym",
          "author": "Asif_ibrahim_",
          "text": "That’s pretty much how most people really learn n8n.  \nMistakes force you to understand data flow, edge cases, and why things break.  \nTutorials help you start, but real learning happens when something fails in your own setup.  \nOnce a few daily tasks automate themselves, it’s hard to stop experimenting.",
          "score": 1,
          "created_utc": "2026-01-28 09:34:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnro0v",
      "title": "I built an n8n workflow that recruits affiliate partners from LinkedIn engagement data. 200+ influencers enriched in minutes.",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1qnro0v/i_built_an_n8n_workflow_that_recruits_affiliate/",
      "author": "Substantial_Mess922",
      "created_utc": "2026-01-26 20:20:30",
      "score": 35,
      "num_comments": 8,
      "upvote_ratio": 0.91,
      "text": "\\*\\*I was manually stalking LinkedIn posts to find affiliate partners. It was taking hours to find 10 good prospects.\\*\\*\n\n\n\nI needed a way to discover influencers who were already engaging with content in my niche, then automatically enrich their profiles with contact data and influence scores.\n\n\n\n\\*\\*Here's what it does:\\*\\*\n\n\\* Takes a viral LinkedIn post URL from your industry\n\n\\* Extracts everyone who engaged with the post (likes, comments, shares)\n\n\\* Enriches each profile with full LinkedIn data (followers, connections, headline, company)\n\n\\* Calculates an influence score (0-100) based on follower count, connections, and headline keywords\n\n\\* Retrieves verified company emails for outreach\n\n\\* Prioritizes prospects as high/medium/low based on their influence metrics\n\n\\* Exports everything to Google Sheets with complete contact details\n\n\n\n\\*\\*The big win:\\*\\* What used to take 4-5 hours of manual research now runs in 15 minutes. I can process 50-200+ potential partners from a single post.\n\n\n\n\\*\\*Example usage:\\*\\*\n\n\n\n\\- Input: Viral post from an industry leader (10,000+ engagements)\n\n\\- Results: 187 profiles enriched in 12 minutes\n\n\\- Data retrieved: Name, LinkedIn URL, follower count, company email, headline, location, company size, influence score\n\n\\- Output: 43 high-priority prospects (70+ influence score) with verified emails ready for outreach\n\n\n\n\\*\\*How the scoring works:\\*\\*\n\n1. \\*\\*Follower analysis\\*\\* – Scores 0-50 points based on audience size\n\n2. \\*\\*Connection depth\\*\\* – Adds 0-25 points for network reach\n\n3. \\*\\*Headline matching\\*\\* – Identifies creators, consultants, coaches, founders (0-25 points)\n\n4. \\*\\*Priority ranking\\*\\* – Automatically flags high (70+), medium (45-69), and low prospects\n\n\n\n\\*\\*Use cases:\\*\\*\n\n\\* Affiliate managers finding partners who already engage with competitor content\n\n\\* SaaS companies recruiting influencers who've engaged with industry thought leaders\n\n\\* Agency teams building prospect lists from viral posts in target verticals\n\n\\* Partnership managers identifying high-value creators based on engagement behavior\n\n\n\nThe workflow is completely scalable – I've tested it with posts that had 500+ reactions and it handles them perfectly.\n\n\n\nHappy to answer questions about the setup!\n\n\n\n\\*\\*GitHub:\\*\\* [https://github.com/eliassaoe/n8nworkflows/blob/main/linkedin-workflow1230.json](https://github.com/eliassaoe/n8nworkflows/blob/main/linkedin-workflow1230.json)",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1qnro0v/i_built_an_n8n_workflow_that_recruits_affiliate/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o1vvwfl",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 20:20:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vwtwd",
          "author": "Worldly_Row1988",
          "text": "🔥🔥🔥🔥🔥",
          "score": 3,
          "created_utc": "2026-01-26 20:24:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vxtt1",
          "author": "Worldly_Row1988",
          "text": "What scraping tool do you recommend for scraping websites? I want this tool to be as inexpensive as possible, and allow me to scrape website content for 99% of websites, bypassing Cloudflare and bot protection.",
          "score": 2,
          "created_utc": "2026-01-26 20:29:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vy5qs",
          "author": "Voltalyze",
          "text": "Sounds good, but what are the running costs? \n\nI assume you need LinkedIn premium as well right?\n\nWould be interesting to see how I can use this to recruit people for my business.",
          "score": 1,
          "created_utc": "2026-01-26 20:30:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1w17qd",
              "author": "Substantial_Mess922",
              "text": "cost are 25$/month and you do not need a linkedin premium at all",
              "score": 1,
              "created_utc": "2026-01-26 20:44:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1w4fwi",
                  "author": "Voltalyze",
                  "text": "If you break down the cost is it just the n8n subscription fee?",
                  "score": 1,
                  "created_utc": "2026-01-26 20:58:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qoju0l",
      "title": "Universal LLM Vision 0.4 released! Analyze Images using your existing chat model credentials",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/gallery/1qoju0l",
      "author": "alejandrosnz",
      "created_utc": "2026-01-27 17:10:37",
      "score": 33,
      "num_comments": 12,
      "upvote_ratio": 0.93,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1qoju0l/universal_llm_vision_04_released_analyze_images/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": [
        {
          "id": "o21rgd3",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 17:10:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21uo6x",
          "author": "bornlasttuesday",
          "text": "I am analyzing images with Gemini.",
          "score": 2,
          "created_utc": "2026-01-27 17:24:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21wzd2",
              "author": "alejandrosnz",
              "text": "My bad, you are totally right, I'll update the post. I have OpenRouter and there was no nodes to analyze images for other providers",
              "score": 2,
              "created_utc": "2026-01-27 17:34:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27p1yi",
          "author": "epidco",
          "text": "this is actually huge tbh. native n8n vision nodes rly limit u to the big 3 but i use openrouter for almost everything lol. being able to plug vision into existing chat nodes is gonna save me so much setup time thx for the update",
          "score": 2,
          "created_utc": "2026-01-28 13:49:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ei9qh",
          "author": "Wooden-Anything6544",
          "text": "Nice one",
          "score": 2,
          "created_utc": "2026-01-29 12:56:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dtxz3",
          "author": "lun4r",
          "text": "Seems to be Ollama is unsupported.  \nTrying to connect a through the OpenAI Compatible API, but it keeps asking for an API key I don't have.  \nThe form cannot be saved without a key being entered.",
          "score": 1,
          "created_utc": "2026-01-29 09:46:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2du94n",
              "author": "alejandrosnz",
              "text": "Hi! Please try to put anything, 'ollama' for example",
              "score": 2,
              "created_utc": "2026-01-29 09:49:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2dvew8",
                  "author": "lun4r",
                  "text": "Yeah, it looks like it's working now. Thanks!",
                  "score": 2,
                  "created_utc": "2026-01-29 10:00:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qngjth",
      "title": "Looking for real n8n project ideas to build a portfolio, can you share your use cases?",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1qngjth/looking_for_real_n8n_project_ideas_to_build_a/",
      "author": "CompetitionPrimary29",
      "created_utc": "2026-01-26 13:51:08",
      "score": 30,
      "num_comments": 17,
      "upvote_ratio": 0.92,
      "text": "Hey everyone,\n\nI’m learning n8n and I’d like to move beyond tutorials and toy workflows into **real-world** use cases.\n\nI’m looking for:\n\n* Real problems you’re solving (or wish you could solve) with n8n\n* Examples of workflows you already use in your business or personal life\n* Repetitive tasks you think *could* be automated but don’t have time to build\n\nMy goals are to:\n\n* Get my hands dirty with practical scenarios\n* Build a small public portfolio of n8n workflows\n* Improve my skills so I can eventually offer automation services professionally\n\nIf you’re open to it, I’d love:\n\n* A short description of your use case (context + tools involved)\n* What the workflow should roughly do (inputs → logic → outputs)\n* Any constraints (self‑hosted only, privacy concerns, specific stack, etc.)\n\nI’ll build the workflows on my own time and share back:\n\n* Cleaned-up versions of the workflows (with sensitive data removed)\n* Short write-ups of how I approached the problem\n\nThanks in advance for any ideas or problems you’re willing to share!",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/n8n/comments/1qngjth/looking_for_real_n8n_project_ideas_to_build_a/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o1tg34x",
          "author": "AutoModerator",
          "text": "**Need help with your workflow?**\n\nTo receive the best assistance, please share your workflow code so others can review it:\n\n**Acceptable ways to share:**\n\n* Github Gist (recommended)\n* Github Repository\n* Directly here on Reddit in a code block\n\nIncluding your workflow JSON helps the community diagnose issues faster and provide more accurate solutions.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-26 13:51:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tkrld",
          "author": "GeekTX",
          "text": "That is like cheating. :D One of the ideas/concepts behind your portfolio is to highlight your ability to find the problems that need solved. It isn't how well you can reproduce the same worn-out tutorials for marketing or voice agents etc. \n\nIf you can't identify a problem ... How can you identify the solution?",
          "score": 8,
          "created_utc": "2026-01-26 14:15:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1tqfsd",
              "author": "redoubledit",
              "text": "Agree. Looking for real projects that you can fake to build a „portfolio“ of non real projects. That’s just the first sign of not being ready for this „job“.",
              "score": 3,
              "created_utc": "2026-01-26 14:44:04",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1ujjkr",
              "author": "nyfael",
              "text": "If you can't identify a problem, how can you identify the solution? Uh, easily. This is what vast majority of software engineers do all the time, it's the difference between founders and software engineer.\n\nIf you can identify worthwhile problems you're more likely to be a founder, but founder to software engineer is probably something like 1000:1 or greater",
              "score": 1,
              "created_utc": "2026-01-26 16:53:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1uqayd",
                  "author": "Impressive_Ad1292",
                  "text": "\nIf someone finds a solution to a problem. What is the best way to sell that solution? I think selling and finding someone for that solution is the most difficult part",
                  "score": 1,
                  "created_utc": "2026-01-26 17:22:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1ucc2v",
              "author": "CompetitionPrimary29",
              "text": "Fair point! 😅i got your point that the real skill is spotting problems worth solving.\n\nI'm not after tutorials, just your real pain points like i wast X hourts doing Y manually ,or Repetitive headaches you wish someone would fix . What frustrates you most that n8n could solve?\n\nThanks for the nudge!",
              "score": 0,
              "created_utc": "2026-01-26 16:22:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1xnw8o",
          "author": "shajid-dev",
          "text": "I think this is bad, instead why don't you just master the basics of n8n, and then you would know what to do though, Right now at your stage, you thinking, bragging would do all the jobs. nah. better go after learning the basics from today mate. I'll help you with the resources. \n\n\\- Installing n8n locally using NPM and Docker: [https://theowllogic.com/installing-n8n-setup-locally](https://theowllogic.com/installing-n8n-setup-locally)  \n\\- n8n workflow, data, and data-flow fundamental: [https://theowllogic.com/n8n-workflow-nodes-data-flow](https://theowllogic.com/n8n-workflow-nodes-data-flow)  \n\\- How to create a your first Hello World workflow: [https://theowllogic.com/first-hello-world-n8n-workflow](https://theowllogic.com/first-hello-world-n8n-workflow)  \n\\- Webhooks in n8n for beginners: [https://theowllogic.com/webhook-in-n8n-explained](https://theowllogic.com/webhook-in-n8n-explained)  \n\\- How to build conditional logics in n8n (real-usecase): [https://theowllogic.com/conditional-logic-in-n8n](https://theowllogic.com/conditional-logic-in-n8n)  \n\\- How to handle errors in n8n like a pro: [https://theowllogic.com/handle-errors-in-n8n](https://theowllogic.com/handle-errors-in-n8n)  \n\\- How to handle API rate limits: [https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n](https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n)  \n\\- n8n expressions comprehensive guide: [https://theowllogic.com/n8n-expressions-complete-guide](https://theowllogic.com/n8n-expressions-complete-guide)\n\nUse all these resources, and it may take 1 or 2 week to learn everything and understand (most probably), then you can build a solid portfolio that stands out, otherwise you'll be in the reject list like the others.",
          "score": 3,
          "created_utc": "2026-01-27 01:29:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1y45ye",
              "author": "Got_yayo",
              "text": "Thanks for this! I appreciate the “leading the horse to water” with links on where to start. I’m going to get started on this tomorrow. Any other info that would help getting started would be greatly appreciated",
              "score": 2,
              "created_utc": "2026-01-27 02:58:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1troyd",
          "author": "Creepy_Percentage_35",
          "text": "What you expecting, if we shared any real time solution observation for the civic governance.",
          "score": 2,
          "created_utc": "2026-01-26 14:50:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1u188w",
          "author": "Sea_Surprise716",
          "text": "There was just a post on r/founders with a real use case: https://www.reddit.com/r/founder/s/CCXoRMxhh4",
          "score": 2,
          "created_utc": "2026-01-26 15:34:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ti0jc",
          "author": "Ok-Race287",
          "text": "+1",
          "score": 1,
          "created_utc": "2026-01-26 14:01:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1tlndh",
              "author": "StuffConsistent7020",
              "text": "+2",
              "score": 1,
              "created_utc": "2026-01-26 14:19:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1tismr",
          "author": "Ok-Lack-7216",
          "text": "Try Research agent. you can use the same template for multiple purpose. Step by step guide and instructions available in this video [https://youtu.be/mOnbK6DuFhc](https://youtu.be/mOnbK6DuFhc)",
          "score": 1,
          "created_utc": "2026-01-26 14:05:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uk236",
          "author": "Elhadidi",
          "text": " For a portfolio piece, I built an n8n flow to scrape a website’s FAQ and index it as an AI-powered knowledge base—great for support bots. This video shows a similar setup: [https://youtu.be/YYCBHX4ZqjA](https://youtu.be/YYCBHX4ZqjA)",
          "score": 1,
          "created_utc": "2026-01-26 16:55:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xbx5p",
          "author": "ltz_gamer",
          "text": "Well I don’t really have any projects, but I can maybe give you inspiration for some. You could always do something with Claude code, Ubuntu server and ssh.",
          "score": 1,
          "created_utc": "2026-01-27 00:26:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnb5wh",
      "title": "Little hacks I’ve found",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1qnb5wh/little_hacks_ive_found/",
      "author": "Bear_Samuels",
      "created_utc": "2026-01-26 09:08:54",
      "score": 27,
      "num_comments": 2,
      "upvote_ratio": 0.97,
      "text": "So there have been a couple things I’ve used in n8n cloud to get around some rules/keep executions low. \n\nThese are some I’ve done:\n\n1. Sub-Workflow still only count as the 1 main execution. \n\nThis one has been HUGE! So you can have 1 sub workflow or 50 running off a trigger and it will still only count as 1. So you can have a time based trigger that will trigger 50 other workflows and have it all run as 1 execution\n\n2. Evaluation node can be used to batch process 1000s of things all under a “test” execution so it doesn’t count towards monthly execution counts. \n\nAnother huge one. We have used this node linked to a spreadsheet that contains order numbers. This then passes through to a http request body and runs through a bunch of things. Writhing various workflows. If things break over a weekend and need to be reprocessed we fill in the spreadsheet with the orders we need to reprocess as a batch and hit go. Bang, 100s of things done without burning through executions and without manually doing a heap of leg work\n\n3. Use an event gateway for webhook spam\n\nThis one I’ve been playing around with. Experienced people probably already know about it, but you can set up an in between for your webhooks that can essentially asses them and choose weather or not to pass them on to n8n or not. So things like event based webhooks (Xero, Gorgias for example) that send 1000 webhooks a god damn second can be filtered before burning executions. \n\nThese are some helpful tips for those of you that use n8n cloud. It’s probably rudimentary stuff, but I felt pretty clever when I found these tricks out. \n\nAny cool stuff anyone else has figured out I’d love to hear it! ",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1qnb5wh/little_hacks_ive_found/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o1snu7p",
          "author": "Business-Cherry1883",
          "text": "Love the sub-workflow tip—keeps the main canvas from looking like spaghetti. My favorite \"hack\" is just abusing the Sticky Note node. I leave massive bright yellow warnings on complex logic blocks so I don't break my own work 3 months later.",
          "score": 2,
          "created_utc": "2026-01-26 10:31:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ufxnl",
          "author": "Just-a-torso",
          "text": "Main one that I tell everyone about now is to use Posthog for analytics. You'll stay on the free tier unless you're going crazy. I built three sub-workflows (Success, Error and New User) and call the relevant one at the end of every branch and pass through the info I want (userID, success and error types). I have a little dashboard I check every morning to make sure things are operating as normal. \n\nhttps://preview.redd.it/qfvkxxja1qfg1.png?width=677&format=png&auto=webp&s=975462fed6fa0e7e6d50eddf1aeeb649fbec8072",
          "score": 1,
          "created_utc": "2026-01-26 16:37:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qo6eh5",
      "title": "How do you expose n8n workflows to users?",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1qo6eh5/how_do_you_expose_n8n_workflows_to_users/",
      "author": "Druxer95",
      "created_utc": "2026-01-27 06:40:30",
      "score": 26,
      "num_comments": 23,
      "upvote_ratio": 0.91,
      "text": "Hey, \n\nWe use n8n heavily in my startup, and it’s great for building automations, but we’re struggling with how to expose those workflows to the users we serve.\n\nRight now we trigger workflows through Slack and a few other apps, but it doesn’t feel ideal. Users don’t really have a clear view of what automations are available, what inputs they need, or how they’re supposed to interact with them, so things end up being confusing.\n\nCurious how others are handling this and whether you’ve found a cleaner way to expose n8n automations to users.",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/n8n/comments/1qo6eh5/how_do_you_expose_n8n_workflows_to_users/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o1z1kqh",
          "author": "AutoModerator",
          "text": "**Need help with your workflow?**\n\nTo receive the best assistance, please share your workflow code so others can review it:\n\n**Acceptable ways to share:**\n\n* Github Gist (recommended)\n* Github Repository\n* Directly here on Reddit in a code block\n\nIncluding your workflow JSON helps the community diagnose issues faster and provide more accurate solutions.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-27 06:40:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zcrxf",
          "author": "dev_is_active",
          "text": "build a real saas product, you're probably violating the license too",
          "score": 13,
          "created_utc": "2026-01-27 08:17:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o230ere",
              "author": "coinclink",
              "text": "I'm guessing since they're using slack, the users they're talking about are internal, so probably not violating the license.",
              "score": 1,
              "created_utc": "2026-01-27 20:25:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1zbd3g",
          "author": "Defiant-Anteater8564",
          "text": "You need to link it to a front-end app of some kind then process user input to activate the workflow. Then you respond to the input with an output.",
          "score": 6,
          "created_utc": "2026-01-27 08:04:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z3qtr",
          "author": "alhassan_almaznaei",
          "text": "You can build a simple form, interface, or frontend anything that will make the user have the ability to submit a request to your workflow\n\nyou will use a webhook trigger in all your workflow and then build a frontend that calls that webhook url\n\nfor the frontend you can use claude code via any ide or antigravity and it will build for you a great frontend\n\nthis way you will have a full control of how user interact with your workflows\n\nbtw i have built many things like this, if you want i can guide you!",
          "score": 7,
          "created_utc": "2026-01-27 06:58:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z3fpu",
          "author": "LateToTheParty2k21",
          "text": "This really depends on the automation. \n\nAre users manually triggering it then slack makes sense? Maybe a bot so folks can go /info or something to see what options are available and what are the required inputs. \n\nIf it's being automated based if X happens, trigger the workflow, you should integrate with something like webhook and there's probably no need to expose it all.",
          "score": 1,
          "created_utc": "2026-01-27 06:55:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z3mjj",
          "author": "Euphoric-Butterfly76",
          "text": "Big issue for us. We developed a tool to do this but maintaining it is a bitch",
          "score": 1,
          "created_utc": "2026-01-27 06:57:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20z7i9",
              "author": "Available_Occasion_5",
              "text": "I’m creating a solution for that you might be lnterested https://makeitflow.pro/katty",
              "score": 1,
              "created_utc": "2026-01-27 15:05:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1z4p6z",
          "author": "joginderkm",
          "text": "I use Laravel/FilamentPHP for this. First, I store the data in MySQL and then trigger or schedule an n8n workflow.",
          "score": 1,
          "created_utc": "2026-01-27 07:06:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zcgxe",
          "author": "shajid-dev",
          "text": "Better build an UI interface with appropriate invoking buttons.",
          "score": 1,
          "created_utc": "2026-01-27 08:14:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zeinv",
          "author": "maxouzeer",
          "text": "What's your startup? I guess your customers have some front-end? You could have n8n runs triggered by changes in DB, and users making their \"job-as-usual\" on your front-end modifying DB entries?",
          "score": 1,
          "created_utc": "2026-01-27 08:33:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zfujf",
              "author": "Ordinary_Necessary33",
              "text": "the n8n workflows are for internal teams, not for our clients",
              "score": 1,
              "created_utc": "2026-01-27 08:46:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1zhmmt",
          "author": "OG_Romes",
          "text": "Honestly depends on the automation... \nYou can use a chat input (WhatsApp, Telegram)\nScheduled triggers (once a day or so)\nOn Form submit\nAnd so on....\n\nWithout more details, people can only guess. Why do you want to show the users what automations there are and how to use them? If your customer came to you with a problem to solve, they should know what automations there are and how or when to use them. If you just build random automations and nobody cares, it does not sound like a problem of n8n or the automation to be honest....\n\nYou can also go so far to build a apps/site for your automation (frontend) where you have a documentation and tutorial and demo and everything you need for your automation. But with no details given people can only guess...",
          "score": 1,
          "created_utc": "2026-01-27 09:02:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zhyzu",
          "author": "oriol_9",
          "text": "look \n\n1/\n\nfroms \n\nWebhook Form Builder\n\n  \n[https://formbuilder.idm2.com/](https://formbuilder.idm2.com/)\n\n\n\n  \n2 /\n\n Dash\n\n  \n[https://amrconnect.com/docs/blog/dashboard-automatizaciones.html](https://amrconnect.com/docs/blog/dashboard-automatizaciones.html)\n\n  \noriol from barcelona",
          "score": 1,
          "created_utc": "2026-01-27 09:06:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20zedj",
              "author": "Available_Occasion_5",
              "text": "I’m creating a solution for that you might be lnterested https://makeitflow.pro/katty",
              "score": 1,
              "created_utc": "2026-01-27 15:06:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o211cza",
                  "author": "oriol_9",
                  "text": "open chat\n\n  \noriol from barcelona",
                  "score": 1,
                  "created_utc": "2026-01-27 15:16:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1zrbcs",
          "author": "Charming-Goat692",
          "text": "this depends on the type of automations, some may need to be exposed via forms, some with webhooks etc..\n\nwhat i first would suggest, is you build a full documentation about the current automations you have, whats the purpose of each, how to trigger,  what to provide etc ...\nthen add a section on your website or mobile app for that documentation",
          "score": 1,
          "created_utc": "2026-01-27 10:31:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o202d8v",
          "author": "According-Site9848",
          "text": "A common approach is to build a lightweight interface layer on top of n8n rather than exposing workflows directly. A few options:\n\nCustom web UI or dashboard that lists available automations, required inputs and status  n8n can trigger workflows via its REST API.\n\nForms or portal tools (Typeform, Google Forms, Retool) that feed inputs into n8n.\n\nChat or messaging bots (Slack, Teams) with clear commands and help menus to guide users.\n\nThe key is abstracting the workflow complexity away  users just interact with clear actions and inputs, while n8n handles the orchestration behind the scenes.",
          "score": 1,
          "created_utc": "2026-01-27 12:01:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20iu4d",
          "author": "Dr_MHQ",
          "text": "I’m using nocobase and use its workflow engine to trigger n8n whenever needed\n\nso far it’s stable, flexible and our users like it",
          "score": 1,
          "created_utc": "2026-01-27 13:43:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21z9fv",
          "author": "Difficult_Rhubarb469",
          "text": "Host your interface with stream-lit cloud. Use webhook with production URL. Ngrok will expose your local n8n workflow publicly.",
          "score": 1,
          "created_utc": "2026-01-27 17:44:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o230d5a",
          "author": "Training_Bet_2747",
          "text": "It’s against their TOS. You can just write code if you want to build SaaS.",
          "score": 1,
          "created_utc": "2026-01-27 20:25:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o260raq",
          "author": "Ok_Signature9963",
          "text": "I use [Pinggy.io](http://Pinggy.io) to self-host n8n workflows.",
          "score": 1,
          "created_utc": "2026-01-28 05:57:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z69rd",
          "author": "Ginger2054_42",
          "text": "Im launching a beta for a slick n8n front-end!\n\nSync workflows, create groups, assign users, and drag-and-drop custom widgets and triggers to build dashboards your team or clients will actually use. Fully brandable for your look and feel.\n\nShoot me a dm if interested.\n\nhttps://preview.redd.it/ag5s53x1fufg1.png?width=1550&format=png&auto=webp&s=94fc819f9fcbdbab0040289a5a37c45904c20a1d",
          "score": -4,
          "created_utc": "2026-01-27 07:19:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpiuo2",
      "title": "Best web scrapers to use alongside n8n?",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1qpiuo2/best_web_scrapers_to_use_alongside_n8n/",
      "author": "z_neonHawk7454",
      "created_utc": "2026-01-28 18:02:28",
      "score": 26,
      "num_comments": 37,
      "upvote_ratio": 1.0,
      "text": "I've heard about AI scrapers recently but have never really used any. I'm willing to pay a sub as long as it isn't incredibly expensive. Something no code would be preferable but not necessary. \n\nWhat do you guys use? What'd you say is best right now?",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1qpiuo2/best_web_scrapers_to_use_alongside_n8n/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o2a2wy7",
          "author": "Milan_SmoothWorkAI",
          "text": "Apify! The [Apify Store](https://apify.com/store?fpr=9lmok3) has pre-built scrapers for all major websites, and some general purpose one.\n\nAnd there's a node for it in n8n where you can start it and collect the results.\n\nThere's free tier as well and per result pricing for more.\n\nIf you're more technical, Crawlee for Javascript or Scrapy for Python are also great",
          "score": 16,
          "created_utc": "2026-01-28 20:14:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2glmsk",
              "author": "PR0T010",
              "text": "\\+1 For Apify, AI scrapers are usually either pretty bad or expensive. You’ll get better results with a well-built Apify scraper. And you can always use AI to draft the scraping code so it targets the specific webpage you want more effectively.",
              "score": 1,
              "created_utc": "2026-01-29 18:54:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o29xkum",
          "author": "Elhadidi",
          "text": " I’ve been using n8n’s HTTP Request + HTML Extract nodes to pull site content—no extra subscriptions needed. Here’s a quick walkthrough: [https://youtu.be/YYCBHX4ZqjA](https://youtu.be/YYCBHX4ZqjA)",
          "score": 9,
          "created_utc": "2026-01-28 19:50:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2eujwd",
              "author": "Zboubkiller",
              "text": "Good old mozilla agent lol",
              "score": 1,
              "created_utc": "2026-01-29 14:04:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o29yq55",
          "author": "kidkaruu",
          "text": "Crawlee. Free to host and zero cost. I believe it's what Apify uses for their platform. Works great",
          "score": 5,
          "created_utc": "2026-01-28 19:56:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jh7bh",
              "author": "DockyardTechlabs",
              "text": "thanks!",
              "score": 1,
              "created_utc": "2026-01-30 03:48:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o29az1a",
          "author": "Comfortable-Mine3904",
          "text": "Run crawl4ai on your own machine",
          "score": 5,
          "created_utc": "2026-01-28 18:12:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jh6zu",
              "author": "DockyardTechlabs",
              "text": "thanks!",
              "score": 1,
              "created_utc": "2026-01-30 03:48:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2agdpz",
          "author": "Smartaces",
          "text": "Fire crawl is good, I ran it on a bunch of free throwaway email addresses before finally paying for a plan ",
          "score": 3,
          "created_utc": "2026-01-28 21:14:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dzqwg",
          "author": "-Just_a_Seal-",
          "text": "Be careful with per-page pricing models like Firecrawl if you plan to scale. Self-hosting a browserless instance gives you the same result but keeps your margins predictable when volume spikes",
          "score": 3,
          "created_utc": "2026-01-29 10:38:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2b75i8",
          "author": "UnprocessedAutomaton",
          "text": "I built a custom web scraper, hosted it on GCP and calling it from multiple n8n workflows. Cheap, effective and functional.",
          "score": 2,
          "created_utc": "2026-01-28 23:17:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a301n",
          "author": "Murky_Angle_7535",
          "text": "jina.ai",
          "score": 1,
          "created_utc": "2026-01-28 20:15:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a33d3",
          "author": "Ill_Dare8819",
          "text": "Unless you need browser-based scraping HTTP node with HTML node is enough",
          "score": 1,
          "created_utc": "2026-01-28 20:15:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a42qf",
          "author": "Voltalyze",
          "text": "What are you looking to scrape?",
          "score": 1,
          "created_utc": "2026-01-28 20:20:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a543z",
          "author": "marcod9",
          "text": "Tavily is a good one and it can cover multiple use cases and you can also connect it to n8n or any other tool you use.",
          "score": 1,
          "created_utc": "2026-01-28 20:24:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a6qic",
          "author": "midlifematt",
          "text": "host browserless.io yourself 👍🏻",
          "score": 1,
          "created_utc": "2026-01-28 20:31:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2awdzp",
          "author": "Better_Pollution_114",
          "text": "Check out zenrows. Best for both bypass etc",
          "score": 1,
          "created_utc": "2026-01-28 22:24:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c6g36",
          "author": "iserendipity2712",
          "text": "How about scrapping the data from a dashboard (the data refreshes every 4-10 mins)? Maybe ‘scrapping’ is not ideal here?",
          "score": 1,
          "created_utc": "2026-01-29 02:25:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ca68g",
              "author": "Sirius_Sec_",
              "text": "If you can find the api endpoint that returns the raw json data that's an easy one to scrape .",
              "score": 2,
              "created_utc": "2026-01-29 02:45:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2j7qtf",
                  "author": "iserendipity2712",
                  "text": "I have the API endpoints; what would you recommend to do this?",
                  "score": 1,
                  "created_utc": "2026-01-30 02:54:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2camud",
          "author": "Sirius_Sec_",
          "text": "I use scrapy which is a python framework . I use it to scrape hundreds of world news sources . I then use an LLM to process that data and give me summaries every hour in a telegram channel. You can save a lot of money by scripting the scraper and running the LLM over the refined data preferably stored in a database like postgres .",
          "score": 1,
          "created_utc": "2026-01-29 02:48:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cb19g",
          "author": "Sirius_Sec_",
          "text": "Really depends on what you're scraping. I use scrapy the python framework. It's very easy to have a LLM make you a script . Save the data in a database then have the LLM analyze the cleaned up data .",
          "score": 1,
          "created_utc": "2026-01-29 02:50:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2chnmx",
          "author": "BBQMosquitos",
          "text": "Very interesting topic",
          "score": 1,
          "created_utc": "2026-01-29 03:28:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dspyt",
          "author": "zucchini_up_ur_ass",
          "text": "I built one inside n8n 😂",
          "score": 1,
          "created_utc": "2026-01-29 09:35:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ecv4y",
          "author": "epidco",
          "text": "what r u trying to scrape exactly? if its just text for an llm then jina or firecrawl rly shine. firecrawl is basically the gold standard for no-code right now imo. i personally self-host browserless on docker cuz i hate monthly subs lol but if u want easy then firecrawl is ur best bet",
          "score": 1,
          "created_utc": "2026-01-29 12:20:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ehpy9",
          "author": "Total-Mention9032",
          "text": "Scraping web pages: Fire Crawl  \nScraping a list like Google Maps, Redfin, etc.: Apify\n\nBoth are free up to a limit",
          "score": 1,
          "created_utc": "2026-01-29 12:53:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2en0ik",
          "author": "GroMach_Team",
          "text": "if you're scraping for seo data, you need something that handles headless browsing to bypass cloudflare. scrapingbee or zenrows integrate well with n8n via http request nodes and handle the proxy rotation for you so you don't get ip banned immediately.",
          "score": 1,
          "created_utc": "2026-01-29 13:24:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2eqz06",
          "author": "Unhappy_Pass_2677",
          "text": "I really like Linkup because you get agentic search, plus it could tap into deeper and richer sources than most out there. ",
          "score": 1,
          "created_utc": "2026-01-29 13:45:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fve8v",
          "author": "Solid-Awareness-1633",
          "text": "I have been using Qoest's scraping API with n8n for similar automation work. It can handle JavaScript rendering and proxies automatically so you don't have to deal with technical stuff.",
          "score": 1,
          "created_utc": "2026-01-29 16:56:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fxano",
          "author": "Embarrassed_Art_6966",
          "text": "I use qoest for developers scraping API with n8n. It handles JavaScript rendering and proxy rotation automatically so you can just plug in the data. Clean JSON output that integrates smoothly",
          "score": 1,
          "created_utc": "2026-01-29 17:04:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ict2q",
          "author": "Interesting_Way_105",
          "text": "You can try out rtrvr.ai, they are positioning as vibe scraping platform for just conversational scraping.\n\nAnd they are much more cost effective compared to alternatives",
          "score": 1,
          "created_utc": "2026-01-30 00:04:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29vawl",
          "author": "DigIndependent7488",
          "text": "As far as AI scrapers go, right now I really love how Riveter works and I'm using it a lot alongside n8n, they work pretty well together. That said, there's a lot of choices out there right now, Firecrawl is also good but a bit too expensive I think.",
          "score": 0,
          "created_utc": "2026-01-28 19:40:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2f83c3",
              "author": "Terrible-Lie-8263",
              "text": "\\+1 to riveter, awesome tool ",
              "score": 1,
              "created_utc": "2026-01-29 15:11:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qkrscm",
      "title": "I built an n8n workflow that turns LinkedIn job posts into enriched sales leads automatically",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1qkrscm/i_built_an_n8n_workflow_that_turns_linkedin_job/",
      "author": "Substantial_Mess922",
      "created_utc": "2026-01-23 14:09:46",
      "score": 25,
      "num_comments": 4,
      "upvote_ratio": 0.83,
      "text": "\\*\\*I've been manually tracking companies hiring for specific roles as buying signals. Not anymore.\\*\\*\n\n\n\nIf you're in B2B sales, companies posting certain job titles are gold – they're actively investing in specific areas. I built this n8n workflow to automate the entire research process from LinkedIn job posts to enriched contact data.\n\n\n\n\\*\\*Here's what it does:\\*\\*\n\n\\* Scrapes LinkedIn for companies posting specific job titles (e.g., \"Customer Success Manager\", \"DevOps Engineer\")\n\n\\* Extracts company names from job postings and deduplicates the list\n\n\\* Enriches each company with verified websites, direct phone numbers, company emails, and employee counts\n\n\\* Outputs complete sales intelligence to Google Sheets with hiring signals attached\n\n\n\n\\*\\*The big win:\\*\\* What used to take 3-4 hours of manual research now runs automatically. I can process 40-50 companies in 4-6 minutes with complete contact data.\n\n\n\n\\*\\*Example usage:\\*\\*\n\n\n\n\\- Input: \"Sales Development Representative\" + \"San Francisco\" + last 7 days\n\n\\- Results: 47 companies enriched in \\~5 minutes. Each record includes company website, phone, email, employee count, job titles they're hiring for, and LinkedIn profile\n\n\\- The workflow marks each with a hiring signal (\"Hiring 3 positions\") so you know their investment level\n\n\n\n\\*\\*Use cases:\\*\\*\n\n\\* \\*\\*SaaS sales teams\\*\\* – Find companies hiring SDRs/AEs (they're investing in growth = need your sales tools)\n\n\\* \\*\\*DevOps/Infrastructure vendors\\*\\* – Target companies posting DevOps/SRE roles (they're scaling infrastructure)\n\n\\* \\*\\*HR tech providers\\*\\* – Identify companies with multiple open positions (recruiting pain points)\n\n\\* \\*\\*Recruitment agencies\\*\\* – Build targeted lists of companies actively hiring in specific verticals\n\n\n\nThe workflow is completely scalable – I've tested it with 50-100+ companies per run. Google Sheets trigger means you just add a row with your search criteria and it runs automatically.\n\n\n\nHappy to answer questions about the setup!\n\n\n\n\\*\\*GitHub:\\*\\* [https://github.com/eliassaoe/n8nworkflows/blob/main/linkedin-workflow8510.json](https://github.com/eliassaoe/n8nworkflows/blob/main/linkedin-workflow8510.json)",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1qkrscm/i_built_an_n8n_workflow_that_turns_linkedin_job/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o18o0x6",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-23 14:09:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ak2j1",
          "author": "ParsnipFlendercroft",
          "text": ">sales lead\n\nI do not think that word means what you think it means.",
          "score": 1,
          "created_utc": "2026-01-23 19:24:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1auvrt",
          "author": "epidco",
          "text": "how r u handling the scraping part without getting flagged? linkedin is a total pain for that stuff unless ur using residential proxies or smth. rly solid workflow tho tbh - saving 4 hours of manual research is a massive win. curious what enrichment api ur using for the emails cuz thats usually where it gets expensive lol.",
          "score": 1,
          "created_utc": "2026-01-23 20:15:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}