{
  "metadata": {
    "last_updated": "2026-02-26 09:09:57",
    "time_filter": "week",
    "subreddit": "n8n",
    "total_items": 20,
    "total_comments": 256,
    "file_size_bytes": 254070
  },
  "items": [
    {
      "id": "1r9q0kd",
      "title": "I have built n8n automations for a dozen startups this year. Here is what nobody tells you.",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1r9q0kd/i_have_built_n8n_automations_for_a_dozen_startups/",
      "author": "Warm-Reaction-456",
      "created_utc": "2026-02-20 08:36:32",
      "score": 484,
      "num_comments": 98,
      "upvote_ratio": 0.92,
      "text": "I have been using n8n for client work for a while now. Not hobby projects. Actual businesses paying real money to automate real workflows.\n\nAnd after doing this for long enough I have noticed some patterns that nobody in this community seems to talk about.\n\nFirst thing. Most founders have no idea what they actually want to automate. They come to me saying they want to \"automate their business\" which is the equivalent of going to a mechanic and saying \"fix my car.\" I spend the first week just watching them work and finding the one repetitive task that is quietly eating 3 hours of their day. That is where the money is.\n\nSecond thing. n8n is incredible until it isn't. The moment you start chaining more than 15 nodes together in a single workflow you are building a debugging nightmare. I have inherited workflows from other freelancers that look like circuit diagrams. Nobody can read them. Nobody can fix them when they break at 2am. I always split complex workflows into smaller ones that talk to each other. Boring but it works.\n\nThird thing. Everyone wants AI in the workflow now. Every single client asks if we can \"add AI\" somewhere. Sometimes it makes sense. Most of the time a simple IF condition does the same job faster and cheaper with zero hallucination risk. I have saved clients hundreds of dollars a month in API costs just by replacing an LLM call with a basic regex filter.\n\nThe actual stuff businesses pay for is not glamorous. Lead enrichment. Invoice parsing. Slack alerts when something goes wrong in the database. Syncing two tools that do not talk to each other natively.\n\nSimple problems. Boring solutions. Solid recurring revenue.\n\nAnyone else finding that the simplest automations are the ones clients renew contracts for every year?\n\nEdit - Since a few people asked in the comments and DMs, yes I do take on client work. If you are a founder looking to get an MVP built, automate a workflow, or set up AI agents for your business I have a few slots open. Book a call from the link in my bio and we can talk through what you need.\n",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1r9q0kd/i_have_built_n8n_automations_for_a_dozen_startups/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o6ebmo6",
          "author": "nolooseends",
          "text": "How do you charge your clients? Where do you run your n8n instances?",
          "score": 44,
          "created_utc": "2026-02-20 10:06:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ex8vm",
              "author": "Warm-Reaction-456",
              "text": "For charging, it depends on the project. Most of my client work is either a flat project fee upfront or a monthly retainer if they want me to maintain and expand the workflows over time. I stopped doing hourly a while back. Hourly billing punishes you for being fast and efficient which makes no sense.\n\nFor hosting, self hosted n8n on a cheap VPS. DigitalOcean or Hetzner usually. Hetzner especially if the client is in Europe. A 6 dollar box handles most small to mid sized workflow loads without breaking a sweat.\n\nI only use n8n cloud for clients who absolutely refuse to think about infrastructure or have a compliance reason to keep everything managed. It gets expensive fast so I try to avoid it unless the client insists and is willing to pay for it.\n\nThe setup is boring but it works and it never goes down.",
              "score": 56,
              "created_utc": "2026-02-20 12:55:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6eyz70",
                  "author": "nolooseends",
                  "text": "Thanks. \n\nAnd how do you do maintenance etc.? Like the pretty big recent security vulnerability? Do you have any failover?\n\nAfter a while the more client instances the more overhead?",
                  "score": 7,
                  "created_utc": "2026-02-20 13:06:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6m0a5z",
                  "author": "Used-Motor-2699",
                  "text": "Just out of curiosity, is there a big reason you use n8n rather than Microsoft Power Automate?\n\nThe reason I ask is that if the organisation already has a Microsoft enterprise license (which seems like most companies these days), then surely all you need to do is get their IT team to set you up with a service account where you could hold all of these automations in the web version of power automate, which would be no extra cost. If you want to add HTTP actions for API calls, you might need the premium Power Automate license to be acquired for the service account, which I think is something like £11/$15 per month, but with that you can run everything cloud-based on Microsoft’s servers with zero setup. \n\nI’m not super experienced in the field so I may have got some assumptions wrong / not understand enough about the pros/cons of each automation platform out there, but would be interesting to hear your thoughts on the above",
                  "score": 3,
                  "created_utc": "2026-02-21 15:13:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6eirzu",
              "author": "Koolerifyoudid",
              "text": "THIS is the stuff nobody tells you!",
              "score": 48,
              "created_utc": "2026-02-20 11:09:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6ep963",
              "author": "KarryLing18",
              "text": "I would think he basically spins the client their own N8N instance, configures it and builds their workflows. Then essentially becomes a retainer for maintenance as needed or future workflows.",
              "score": 10,
              "created_utc": "2026-02-20 12:00:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6k91fd",
              "author": "Possible-Road-4290",
              "text": "I make clients pay for their instance and run it on their domain using hostinger (they have a native addon now to host n8n)",
              "score": 2,
              "created_utc": "2026-02-21 06:34:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6eka0v",
          "author": "Grouchy-Wallaby576",
          "text": "The \"split complex workflows into smaller ones that talk to each other\" point is the single best piece of advice in this post. I run 52 active workflows on a self-hosted n8n instance and the ones that cause the most trouble are always the monoliths I haven't broken up yet.                                                                                                                                                                                                                                                                                 \n\n  On the AI point — completely agree. I went through a phase of throwing LLM calls at everything. Ended up replacing most of them with Code nodes doing regex or simple string matching. The ones where AI actually earns its cost are lead enrichment (extracting names from messy HTML) and content repurposing. Everything else is better served by a filter or a switch node.\n\n  One gotcha nobody warned me about: n8n's splitInBatches node swapped its output order in v2.6.x. Output 0 became \"done\" and Output 1 became \"loop\" — the opposite of what it was before. Had 4 workflows silently producing wrong results before I caught it. Always pin your version and test after upgrades.\n\n  What's your error handling strategy? I use a dedicated error workflow that catches failures across all 52 workflows and sends a Slack-style alert. Curious if you've found a better pattern for the 2am breaks.",
          "score": 17,
          "created_utc": "2026-02-20 11:22:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6h0dgh",
              "author": "knissamerica",
              "text": "So you manage self hosted n8n instances for all these different clients? How are you doing that? When I was doing self hosting on my own I was using docker and it was a real hassle.",
              "score": 1,
              "created_utc": "2026-02-20 19:00:05",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6sdu0l",
              "author": "Fast-Needleworker352",
              "text": "Can you give examples of what kind of work you'd first think to use an LLM for, but regex etc. would work better? I'd love to figure out if any of my stuff could be replaced",
              "score": 1,
              "created_utc": "2026-02-22 15:48:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ezpnk",
          "author": "Drogoff1489",
          "text": "this is so accurate lol\n\nthe \"i want to automate my business\" thing drives me crazy. i usually start by just watching them work for a few days - screen recordings, looking at their actual tools, what tabs they have open\n\nmost useful question i ask: \"what takes 30+ minutes every day that you dread doing?\" usually gets you to the real bottleneck\n\nagree on the maintenance point too. i've started building everything with error logs that go to telegram/slack so when something breaks i know immediately. also helps to use airtable or notion as the \"source of truth\" instead of buried deep in workflow nodes - way easier for clients to understand and update themselves",
          "score": 8,
          "created_utc": "2026-02-20 13:10:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6y4i3z",
              "author": "Carlitosblu",
              "text": "Com'è hai gestito ciò, ogni errore va direttamente su notion?",
              "score": 1,
              "created_utc": "2026-02-23 13:26:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ec7s6",
          "author": "darkchocolateagain",
          "text": "How do you reach these business?",
          "score": 6,
          "created_utc": "2026-02-20 10:11:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6elkef",
              "author": "locomotive-1",
              "text": "Pound the pavement",
              "score": 4,
              "created_utc": "2026-02-20 11:32:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6n2sdg",
                  "author": "zeen516",
                  "text": "What does that mean for you? How did you find them and what was the cold call like??",
                  "score": 1,
                  "created_utc": "2026-02-21 18:27:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6erbq5",
          "author": "h33b",
          "text": "Oh look, a regurgitated shit post that drops in here every day.\n\nAlways something \"nobody tells you\". \n\nAlways \"breaks at 2AM\".\n\nNever anything meaningful.\n\nShort sentences.\n\nThe Internet is dead.",
          "score": 33,
          "created_utc": "2026-02-20 12:15:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fsvoq",
              "author": "Ok-Scar8556",
              "text": "That's why I love Reddit You find all types of people The villains, the good guys, the idiots, the jealous ones, the geniuses All in the same place",
              "score": 9,
              "created_utc": "2026-02-20 15:41:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6fi0r6",
              "author": "Jin-Bru",
              "text": "Probably a regex written string on n8n autopost.",
              "score": 7,
              "created_utc": "2026-02-20 14:48:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6flb8p",
              "author": "Academic_Lemon_4297",
              "text": "Dude, you need sunlight pronto. \n\n\n&#x200B;\n\n\nNot everything has to be long, unique sentences, and especially not with newer technologies.",
              "score": -2,
              "created_utc": "2026-02-20 15:05:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6kox7h",
                  "author": "team_lloyd",
                  "text": "boo this man",
                  "score": 1,
                  "created_utc": "2026-02-21 09:07:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ekyux",
          "author": "financialv1rgin",
          "text": "It looks like ai writing for me and not in a good way.",
          "score": 16,
          "created_utc": "2026-02-20 11:28:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kmikk",
              "author": "Sea_Surprise716",
              "text": "AI;dr",
              "score": 3,
              "created_utc": "2026-02-21 08:43:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6xt3y6",
              "author": "The-FrozN",
              "text": "I agree",
              "score": 1,
              "created_utc": "2026-02-23 12:08:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fj4a2",
          "author": "hardcherry-",
          "text": "Right…because it’s an age old issue with clients.\n\nClient: I want a website…",
          "score": 5,
          "created_utc": "2026-02-20 14:54:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ebu58",
          "author": "helloyouahead",
          "text": "Can you provide an example of a node breaking? Why would it break if it is correctly configured? It is generally because of bad coding or API changes (which I assume would not happen in Zapier as they seem to have more native integrations with Google and others?)",
          "score": 3,
          "created_utc": "2026-02-20 10:07:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6eljhd",
              "author": "ncatalin94",
              "text": "what zapier mate? Were talking n8n",
              "score": 1,
              "created_utc": "2026-02-20 11:32:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6f3v4p",
                  "author": "hipster-no007",
                  "text": "Bro hallucinated.",
                  "score": 5,
                  "created_utc": "2026-02-20 13:34:17",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6fem7i",
                  "author": "helloyouahead",
                  "text": "Zapier has native integrations with Google workspace and most main platforms out there, which is not the case of N8N. I was just asking if that means the API or connection between N8N and Google for example is more likely to break than Zapier. Genuine question from someone who is definitely not an expert in automation or IT in general.",
                  "score": 3,
                  "created_utc": "2026-02-20 14:31:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6gq22q",
          "author": "flawinthedesign",
          "text": "This is a constructive thread. I dig it.",
          "score": 3,
          "created_utc": "2026-02-20 18:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i997m",
          "author": "Historical_Fox2922",
          "text": "I close AI dev deals as my job.  \nIts so fucking easy to close them when you tell them exactly where the biggest problem is.  \n99.999999999% of ppl can't articulate or find i b/c their biz is too complex, so they guess but its never right.  \n\"Its in marketing\" OK where  \n\"Its in ... well uh.... the content area, we can post more\"  \n\"OK where.  \n\"UHHHHH WELL WE NEED SCRIPTS\"  \n\"OK HWAT STEP OF THE SCRIPT PROCESS IS STALLING\"  \nAAAAAAAAAAAAAAAAAAAA\n\nSo you pinpoint, this is how I close $5000-10k retainers for what takes like a few weeks of audit + setup and I just install a person (human) to doulble check and iterate on the NEXT bottleneck.\n\nEz",
          "score": 3,
          "created_utc": "2026-02-20 22:42:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lhve1",
              "author": "Practical_Season_411",
              "text": "Oh yeah that's 100% right and that's the skills most miss.. Spot on..:)",
              "score": 2,
              "created_utc": "2026-02-21 13:24:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6eel36",
          "author": "SameImpression1646",
          "text": "Nobody tells you?\nBut there is a ton of posts like this",
          "score": 6,
          "created_utc": "2026-02-20 10:33:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6g3r6h",
              "author": "dsecareanu2020",
              "text": "What nobody tells you is that if you put a bit of effort into it actually everyone tells you. :))",
              "score": 2,
              "created_utc": "2026-02-20 16:31:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ev5og",
          "author": "Total-Mention9032",
          "text": "I do not think this post is genuine. It has a lot of structural flaws, and a lot of it is based on assumptions.\n\n1. Most startups are tech companies. Building n8n or Python automations is easy for their developers.\n2. If you are talking about non-tech startups, people usually do not come to you and say, “Automate my business.” Unless you already have an audience on YouTube, Instagram, LinkedIn, or somewhere else. I am saying this from my own experience.\n3. The people who contact automation agencies usually already know what they want to automate. That is why they reach out in the first place.",
          "score": 5,
          "created_utc": "2026-02-20 12:42:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ftk7b",
              "author": "keena147",
              "text": "I’m suspicious that they “spend the first week just watching”… Who could afford to do that?",
              "score": 3,
              "created_utc": "2026-02-20 15:44:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6r76c3",
              "author": "Guligal89",
              "text": "Yeah honestly I'm baffled that this half-truth air slop at best has got this much engagement and even leads\n\n\n\n",
              "score": 0,
              "created_utc": "2026-02-22 11:19:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6g0oyl",
          "author": "ds1841",
          "text": "Have you worked with retail? Any example of what could be done? No need to be specific, just some generic idea?",
          "score": 2,
          "created_utc": "2026-02-20 16:17:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fiy5t",
          "author": "babatz",
          "text": "Thanks for the post. How do you find customers ? I’d like to start offering my services.",
          "score": 3,
          "created_utc": "2026-02-20 14:53:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gsohj",
              "author": "eperon",
              "text": "By creating this post and making that EDIT",
              "score": 5,
              "created_utc": "2026-02-20 18:25:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6h31ej",
                  "author": "babatz",
                  "text": "Nice 😅",
                  "score": 1,
                  "created_utc": "2026-02-20 19:12:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6gqsjr",
          "author": "Clear_Geologist4516",
          "text": "Your calendar is awfully free; suspiciously free.",
          "score": 2,
          "created_utc": "2026-02-20 18:16:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gtcpf",
              "author": "Warm-Reaction-456",
              "text": "That's what happens when you do most of your business through referrals and not Reddit posts. First time linking publicly so yeah it's pretty open right now.",
              "score": 1,
              "created_utc": "2026-02-20 18:28:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6f81fx",
          "author": "loud-spider",
          "text": "Solid assessment of where most companies are in the race for \"AI automation now!\"",
          "score": 1,
          "created_utc": "2026-02-20 13:56:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g8zya",
          "author": "grizzlypeaksoftware",
          "text": "I have noticed this issue too with people asking for an automation but not knowing specifically what they want to automate,  Also, the complexity and brittleness of these low code workflows tends to make it easier to just use raw code in a lot of cases.",
          "score": 1,
          "created_utc": "2026-02-20 16:55:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6geaxs",
          "author": "Ajaysharma_7",
          "text": "Hey I Want To Get My First Project Anyone Can Help Me How I Get It ??",
          "score": 1,
          "created_utc": "2026-02-20 17:19:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rxncr",
              "author": "uaconserv",
              "text": "Start writing posts on Reddit 😁",
              "score": 1,
              "created_utc": "2026-02-22 14:27:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6gn4v6",
          "author": "hansvangent",
          "text": "The moment you start chaining more than 15 nodes together in a single workflow you are building a debugging nightmare. \n\n^^ this right here, the value of sub workflows is so underrated. It also makes it so much easier to reuse components from one workflow to another. Need to scrape in a lot of your workflows? A simple subworkflow that just calls firecrawl ir crawl4ai and returns the data, can be reused over and over again.\n\nAnd indeed the debugging is a nightmare when it is one big spaghetti board with nodes for meatballs.",
          "score": 1,
          "created_utc": "2026-02-20 18:00:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gtfia",
          "author": "ReadingHappyToday",
          "text": "Did you manage to build it into a recurring (semi-passice) income stream, or do you keep getting paid project by project.",
          "score": 1,
          "created_utc": "2026-02-20 18:28:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hemzn",
          "author": "Tricky-Peace3604",
          "text": "Do you think the automation market will grow in the future?",
          "score": 1,
          "created_utc": "2026-02-20 20:08:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6higed",
          "author": "WebLenn",
          "text": "Wondering about this week where you watch them work, how are you approaching this ? I guess at that point you don't know what you're gonna automate yet so how do you convince them to pay you to just watch how they do their business and how do you put a price on this ?",
          "score": 1,
          "created_utc": "2026-02-20 20:27:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hiom4",
          "author": "mr_bitoiu",
          "text": "What are you looking forward to use/test as an alternative/improvement to n8n?",
          "score": 1,
          "created_utc": "2026-02-20 20:28:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hx1sn",
          "author": "Salt-Property1534",
          "text": "What b is N8N ????\n\nAs I have build .https://uat-com.onhercules.app/",
          "score": 1,
          "created_utc": "2026-02-20 21:39:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hzdpg",
          "author": "Ok_Honey9603",
          "text": "Have you switched to just implementing automations with code? If so, what do you use? Also how do you find your clients?",
          "score": 1,
          "created_utc": "2026-02-20 21:51:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i1skn",
          "author": "FlyingYak65",
          "text": "Who are your typical customers?",
          "score": 1,
          "created_utc": "2026-02-20 22:03:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i3dsz",
          "author": "RealisticAd1133",
          "text": "So you offer either hosting it for them via n8n cloud or setup their own self host version for them, is that correct?",
          "score": 1,
          "created_utc": "2026-02-20 22:11:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ikevc",
          "author": "scbalazs",
          "text": "ok but like what though?",
          "score": 1,
          "created_utc": "2026-02-20 23:44:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6io4s7",
          "author": "Orenrhockey",
          "text": "How do you source clients",
          "score": 1,
          "created_utc": "2026-02-21 00:06:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6k8u2p",
          "author": "Possible-Road-4290",
          "text": "Hi there thanks for sharing \n\nIm also building no code/low code automation tools for SMBs in France and I can say you’re 100% right \n\nOne year and a half doing this and I did’t have any use case where adding AI was serving a clear business purpose \n\nStrong conditional logic/routing that sticks to the business processes are enough and do the job \n\nI wouldn’t say it’s the « simplest » automations that work, but most straightforward, definetly not the fancy « AI-powered agents » that look sexy on LinkedIn \n(in my opinion, these are non sense marketing products)",
          "score": 1,
          "created_utc": "2026-02-21 06:32:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6le5xz",
              "author": "Practical_Season_411",
              "text": "Great mate, seems like you know workflows well....\n\n",
              "score": 1,
              "created_utc": "2026-02-21 12:58:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6l0ddn",
          "author": "BrilliantRip3517",
          "text": "Appreciate you sharing this.\n\nAs someone new to client work, I’m curious about what an example of a workflow that suddenly broke and was painful to fix would be, trying to learn what usually goes wrong so I can design more defensively from the start.",
          "score": 1,
          "created_utc": "2026-02-21 10:59:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6l1vli",
          "author": "MaximumStay6875",
          "text": "Hey can I DM please",
          "score": 1,
          "created_utc": "2026-02-21 11:14:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ljpja",
          "author": "ThyroneWebDesigner",
          "text": "How do you do the lart where you eatch them work for a whole first week?",
          "score": 1,
          "created_utc": "2026-02-21 13:36:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lns1s",
          "author": "qwer640",
          "text": "Please explain briefly what do you mean with „(…) have saved clients hundreds of dollars a month in API costs just by replacing an LLM call with a basic regex filter.(…)„.\nThanks",
          "score": 1,
          "created_utc": "2026-02-21 14:01:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6m8vox",
          "author": "teyman11",
          "text": "I wanna ask something if they dont know what they wanna automate how do you pitch them or finding them without a proper or single product . I am asking seriously . Because I wanna do the same",
          "score": 1,
          "created_utc": "2026-02-21 15:57:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mbf4m",
          "author": "Ok_Editor_5090",
          "text": "About the point where everyone wants AI,\n\nQuite honestly a lot of non-tech savvy people won't know the difference between AI and a plain old procedural code and they do not care once they receive a working solution.\n\n them : I have a problem\nYou: I have a solution\nSimple as that.\nIf you can build a solution that solves the problem ( whether AI or not) then you are good. \n\nAlso, nowadays when someone mentions AI they mostly mean LLM and not the other AI tech that was there before it.",
          "score": 1,
          "created_utc": "2026-02-21 16:10:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mh7u8",
          "author": "IreneWinslow",
          "text": "Totally get this. In my experience, automation helps a lot but only if the process is clear and organized. otherwise, it can just cause more problems.",
          "score": 1,
          "created_utc": "2026-02-21 16:39:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nm26q",
          "author": "Delicious_Mix_3007",
          "text": "How do you find clients mostly? From which platforms or ways?",
          "score": 1,
          "created_utc": "2026-02-21 20:04:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6p28g8",
          "author": "scarbez-ai",
          "text": "I am sorry but I don't see it. What type of startups or businesses? Not challenging but trying to understand.\n\nI have worked for startups (software and biotechs) up to financial companies with up to 1.7T in AUM. I cannot imagine any of them paying an external contractor for n8n work.\n\nWhy?\n\nBecause n8n is an end user tool. Sure it is not Word but more like a Jira or SharePoint, products with which you can do a lot but you need little knowledge to do the minimal. And for those you need an admin and maybe some parameterizers (I purposely refrain from calling them developers).\n\nSo, unless those startups and businesses are from boomers or people who are technically challenged, I don't see why they would not have someone learn and do it themselves. I mean... It is not development. Not even vibe coding...\n\nIn the near future any technically-oriented worker will be able to use all those tools proficiently themselves, especially now that companies are pushing for employees to get up to speed with AI (or be shown the door).\n\nNot trying to be a dick but I seriously don't see it long term.",
          "score": 1,
          "created_utc": "2026-02-22 00:59:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qvrr7",
          "author": "Wet_Assistance",
          "text": "100%. Everyone asks for 'AI Agents' until they see the error rate. Then they just want a reliable script that parses invoices correctly every time. Simple problems, boring solutions, paid invoices. that's what i'd want too.",
          "score": 1,
          "created_utc": "2026-02-22 09:30:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ry6na",
          "author": "uaconserv",
          "text": "Great post, nicely put, we are still standing on the fence watching from sidewalks, the speed at which Claude and Antigravity are moving, unable to take a call should we initiate the N8N scaling or still hold on for another couple of months.",
          "score": 1,
          "created_utc": "2026-02-22 14:30:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6s1sq3",
          "author": "Apprehensive-Being34",
          "text": "I’m looking for someone to make me an n8n automation for my reels, I already use heygen to generate but then take the video and do manual editing, animation, captions etc. If you have done this before dm me.",
          "score": 1,
          "created_utc": "2026-02-22 14:49:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v2ag5",
          "author": "Reasonable-Book-6471",
          "text": "DMs",
          "score": 1,
          "created_utc": "2026-02-22 23:39:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zkzhp",
          "author": "agraciag",
          "text": "Just from curiosity, how often do your clients ask you to keep a man in the loop? Has happend to your workflow designs that you would think \"I wouldn't automate this\".",
          "score": 1,
          "created_utc": "2026-02-23 17:48:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o710qu3",
          "author": "niconsm",
          "text": "Nobody tells you: N8n have licenses",
          "score": 1,
          "created_utc": "2026-02-23 21:52:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74pmnx",
          "author": "NoTreacle1314",
          "text": "This is very true",
          "score": 1,
          "created_utc": "2026-02-24 13:14:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75g2rc",
          "author": "Born-Particular-4363",
          "text": "In my experience, I've found that the general public, including non technical business execs, often mistakes automation for AI",
          "score": 1,
          "created_utc": "2026-02-24 15:31:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75nvzm",
          "author": "likwid07",
          "text": "Can you show some of the automations you've built? I find too many people talking like an expert about automation, but nobody showing the actual automation. I'm not saying you're lying; I'm just saying that the helpful part is learning by seeing (not another \"here's what nobody tells you!\").",
          "score": 1,
          "created_utc": "2026-02-24 16:07:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o772t6f",
          "author": "RecentStab",
          "text": "Whats your best tip to keep things organized? Im in the start of my n8n process in the company I work for and sometimes it feels like a big mess, especially if you do multiple small workflows like you mentioned",
          "score": 1,
          "created_utc": "2026-02-24 19:56:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7aluuk",
          "author": "nrocevern",
          "text": "Sweet recap! Thanks!",
          "score": 1,
          "created_utc": "2026-02-25 08:37:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ayrgv",
          "author": "Sad_Limit_3857",
          "text": "The LLM vs regex point is so real. I’ve seen people throw AI at classification problems that a simple switch node could solve instantly. AI is powerful, but most business workflows are deterministic, not creative.",
          "score": 1,
          "created_utc": "2026-02-25 10:37:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fzfd0",
          "author": "johnmayermaynot",
          "text": "wtf does 'watching them work' mean ? you go in to their office and sit and look at their screen next to them? I call BS",
          "score": 1,
          "created_utc": "2026-02-26 02:23:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f5d7x",
          "author": "amritwaraich",
          "text": "What do you think about antigravity, claude code or open claw replaceing n8n in a year or two?",
          "score": 1,
          "created_utc": "2026-02-20 13:42:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rxexi",
              "author": "uaconserv",
              "text": "Watching closely, ready to pivot",
              "score": 1,
              "created_utc": "2026-02-22 14:26:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6em329",
          "author": "jannemansonh",
          "text": "the invoice parsing point is real... moved those workflows to needle app since it actually understands what's in the pdfs vs just extracting text. way easier than wiring together nodes for document stuff, especially when clients want custom fields parsed",
          "score": 0,
          "created_utc": "2026-02-20 11:36:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eon4s",
          "author": "Mobile_Throat9080",
          "text": "Absolutely right , before even going into the workflow , I always audit clients work ,this helps to understand if they want the automation or not.\n\nPeople have a tendency of thinking AI automations are some magic pill that will replace the human initiated efforts but it's just a tool to make your task smoother and faster .",
          "score": 0,
          "created_utc": "2026-02-20 11:56:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f7dpf",
          "author": "redtron3030",
          "text": "When you say most founders have no idea of what they want, that is exactly what good business owners do. They hire out expertise where they can’t roll out themselves. That should always be the expectation.",
          "score": 0,
          "created_utc": "2026-02-20 13:53:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6n4rrp",
          "author": "akirozen",
          "text": "Why didn't you build thousands of workflows\n Why not millions. Are you looser or what?",
          "score": 0,
          "created_utc": "2026-02-21 18:36:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ayps0",
          "author": "AgitatedDoctor9613",
          "text": "# Constructive Feedback\n\nYour insights on discovery and workflow modularity are solid, but the post lacks actionable specifics—what's your threshold for splitting workflows (15 nodes seems arbitrary), and do you have examples of when AI genuinely added ROI versus when it didn't? The third point cuts off mid-sentence, but consider addressing: how do you handle state management and error recovery when workflows \"talk to each other,\" since that's where distributed automation typically breaks down in practice.",
          "score": 0,
          "created_utc": "2026-02-25 10:36:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra50to",
      "title": "zerobounce wants $65 per 10k emails. neverbounce wants $80. hunter wants $100. i built the same thing in n8n for $0.",
      "subreddit": "n8n",
      "url": "https://v.redd.it/yzr0kj8fbpkg1",
      "author": "ayushopchauhan",
      "created_utc": "2026-02-20 19:31:07",
      "score": 204,
      "num_comments": 39,
      "upvote_ratio": 0.97,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1ra50to/zerobounce_wants_65_per_10k_emails_neverbounce/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o6i52zp",
          "author": "jake_that_dude",
          "text": "the catch-all domain problem is the edge case that'll bite you. some mail servers return \"mailbox exists\" for every address regardless, so your smtp check passes but the email still bounces. paid services maintain databases of known catch-all domains to flag these.\n\nworth adding a catch-all detection step and marking those as \"risky\" in the confidence score rather than valid.",
          "score": 23,
          "created_utc": "2026-02-20 22:20:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k7d2b",
              "author": "ayushopchauhan",
              "text": "good call but it's already in there. before checking the real email, the workflow sends a RCPT TO for a randomly generated gibberish address (something like xq9z7k2m4p8v@domain.com). if the server accepts that fake address, the domain is catch-all and every email on that domain gets flagged.  \n  \ncatch-all emails are capped at a lower confidence score (around 50 instead of 80+) and marked as risky, not valid. if the email also has a gravatar profile it gets bumped up slightly since that's at least some evidence a real person uses the address, but it never reaches \"safe to send\" on catch-all alone.  \n  \nthe result is cached per domain too so it only checks once per domain instead of sending a gibberish address for every email on the same domain.  \n  \nyou're right though, it's the hardest edge case. even paid services struggle with it. there's no way to confirm individual mailboxes on a catch-all domain. best you can do is flag it and let the user decide.",
              "score": 11,
              "created_utc": "2026-02-21 06:19:46",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6jmbzu",
              "author": "Plenty_Attorney_6658",
              "text": "That's what I faced. I made a lead generation and outreach but most of my mails didn't even delivered and I got flagged by that and my Gmail account got in danger",
              "score": 3,
              "created_utc": "2026-02-21 03:39:09",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6jmd30",
              "author": "Plenty_Attorney_6658",
              "text": "Any solution to this?",
              "score": 2,
              "created_utc": "2026-02-21 03:39:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6k7mmg",
                  "author": "ayushopchauhan",
                  "text": "yeah that's exactly what the workflow is for. the catch-all problem the comment above describes is one of the main reasons emails bounce even when the address \"looks\" valid.  \n  \nwhat probably happened is you scraped or collected leads, some of them were on catch-all domains, your verification (if you used one) said they were fine, and then when you sent to them they bounced. enough bounces and gmail flags your account.  \n  \nthis workflow catches that before you send. catch-all domains get flagged as risky so you can either skip them entirely or send to them slowly from a separate domain you don't mind warming up.  \n  \nthe free version i shared in the post does this. if you're doing outreach regularly the pro version handles it automatically through a telegram bot, just send it your list and it gives you back the csv of the safe ones and a full report as well.  \n  \nfor your gmail account, if it's already flagged you'll want to stop sending from it for a few days, lower your daily volume when you start again, and only send to verified addresses going forward.",
                  "score": 1,
                  "created_utc": "2026-02-21 06:22:06",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o6ytt79",
                  "author": "Mob_sterino",
                  "text": "this is actually the hardest part of the whole flow and most people don't realize it until their sender reputation tanks. catch-all domains are sneaky because your verifier says \"valid\"  or \"catch-all\" - and moving on leaving you with decision on what to use from you list .\n\nwe ran into this exact problem and ended up building something specifically for catch-all resolution. instead of just flagging them as unknown we run pattern analysis on the email structure + domain behavior to give a confidence score on whether the address likely exists. not perfect but way better than skipping 30-40% of your B2B list or sending blind.\n\nif anyone wants to test it out on their list, drop me a dm - still in beta so happy to run some emails through for free.\n\ngreat workflow btw u/ayushopchauhan, the segmentation logic for risky vs safe before sending is exactly the right approach regardless of what verification tool you use.",
                  "score": 1,
                  "created_utc": "2026-02-23 15:41:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o70xzyv",
              "author": "salestoolsss",
              "text": "use tomba.io for catch all",
              "score": 2,
              "created_utc": "2026-02-23 21:39:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6k9tlk",
          "author": "netmillions",
          "text": "Problem is the IPs. When you make enough requests, the ESPs will start blocking them. It's not the SMTP handshake result that you're paying these services for, it's the hundreds and thousands of IPs it takes to get those results. Test your system against a few valid Hotmail, Yahoo, AOL emails over several days and you'll see how quickly your IPs get flagged, if the entire Hetzner/Contabo block isn't already.",
          "score": 9,
          "created_utc": "2026-02-21 06:41:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kaqpg",
              "author": "ayushopchauhan",
              "text": "you're not wrong about the ip side. that's a real limitation and i should be upfront about it.  \n  \na few things the workflow does to deal with this:  \n  \nyahoo, aol, and icloud are already marked as unverifiable via smtp in the workflow. it doesn't even try. those get scored based on mx records, spf, dmarc, and other signals instead. for hotmail/outlook consumer addresses it uses microsoft's public GetCredentialType api to check if the account exists rather than relying on smtp alone.  \n  \nfor everything else the workflow does domain interleaving (shuffles emails so the same server doesn't get hit back to back), adaptive rate limiting (longer delays for google, shorter for different servers), and an auto-retry loop that waits a few minutes and retries anything that got temporarily blocked.  \n  \nbut yeah, if you're running 10k emails through a single hetzner ip every week, you'll get blocked eventually. that's just how it works. paid services rotate through thousands of ips and that's a real advantage they have at scale.  \n  \nthis is built more for people cleaning their own lists a few times a month. a few hundred to a couple thousand at a time. for that use case a single clean ip holds up fine in my experience. if you're running a verification service or doing this at high volume daily, you'd need an ip rotation setup on top of this or just use a paid service at that point.  \n  \nfair criticism though. the ip pool thing is genuinely the main advantage paid services have over a self-hosted approach.",
              "score": 4,
              "created_utc": "2026-02-21 06:50:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6kckh1",
                  "author": "netmillions",
                  "text": "Cheers for being honest! And all the best with the project. :)",
                  "score": 4,
                  "created_utc": "2026-02-21 07:06:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6kx5ct",
          "author": "Brussels_AI_Agency",
          "text": "Great job and great research.",
          "score": 4,
          "created_utc": "2026-02-21 10:28:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l1cr3",
              "author": "ayushopchauhan",
              "text": "thanks man, appreciate that! \n\n",
              "score": 1,
              "created_utc": "2026-02-21 11:09:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ihmu6",
          "author": "OneWholeJigglyByte",
          "text": "When you compared zerobounce's/hunter results to your n8n output was the result the same? If it was different was it by a lot?",
          "score": 3,
          "created_utc": "2026-02-20 23:28:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k7tp6",
              "author": "ayushopchauhan",
              "text": "i tested against zerobounce on a list of about 300 emails. the results matched on roughly 90% of addresses. the cases where they disagreed were mostly:  \n  \n\\- catch-all domains: zerobounce has a bigger internal database of known catch-all domains built up over years. my workflow detects catch-all in real time by probing the server, which works but some servers behave differently depending on when you check. end result is similar but not identical.  \n  \n\\- yahoo/icloud/protonmail: these providers block smtp verification entirely. both my workflow and zerobounce mark these based on other signals (dns records, domain reputation). zerobounce might have some proprietary data here that i don't have access to. my workflow scores them conservatively and marks them as risky rather than guessing.  \n  \n\\- the emails both agreed on (valid or invalid) were almost always the same verdict. smtp verification is smtp verification. if the mail server says the mailbox exists, that's the same answer regardless of who's asking.  \n  \nwhere paid services have an edge is historical data. they've verified billions of emails and remember which ones bounced before. my workflow checks everything fresh each time which is actually better for accuracy on active mailboxes but worse for catching addresses that recently went inactive.  \n  \nfor most use cases the difference won't matter. if you're sending cold outreach to a few hundred or a few thousand leads, the results are close enough that you won't notice a difference in bounce rates.",
              "score": 3,
              "created_utc": "2026-02-21 06:23:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6kruiz",
          "author": "GilDev",
          "text": "Your time is $0?",
          "score": 3,
          "created_utc": "2026-02-21 09:36:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l0037",
              "author": "ayushopchauhan",
              "text": "the opposite actually. i value my time a lot, which is why i automated it.\n\ni verify \\~1,350 emails every day for cold outreach. it runs in the background. upload csv, walk away, clean list comes back. zero hands-on time per run.\n\ntook about 20 hours to build. at my current volume the verification services would cost a few thousand a year. now it costs nothing.\n\nthe expensive option was keeping the subscription.",
              "score": 3,
              "created_utc": "2026-02-21 10:56:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6tlvv8",
                  "author": "afbdreds",
                  "text": "Opportunity cost problem. What this person is trying to say is that you have to compare the 700 year with your hour rate times hours taken to build this. There is no such thing as $0 as you wrote in post head.",
                  "score": 1,
                  "created_utc": "2026-02-22 19:08:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6l4w7e",
          "author": "nevertoolate1983",
          "text": "Very, very cool",
          "score": 3,
          "created_utc": "2026-02-21 11:42:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lse7o",
              "author": "ayushopchauhan",
              "text": "Thank you so much, man!",
              "score": 1,
              "created_utc": "2026-02-21 14:29:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6mmk5n",
          "author": "Aggravating-Base-883",
          "text": "Nice, will check it. Thank you.",
          "score": 2,
          "created_utc": "2026-02-21 17:05:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6mrw60",
              "author": "ayushopchauhan",
              "text": "thanks man! let me know if you need and help.",
              "score": 1,
              "created_utc": "2026-02-21 17:32:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6oik1i",
          "author": "Codingchym",
          "text": "N8n still the best, good work",
          "score": 2,
          "created_utc": "2026-02-21 22:59:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qiznq",
              "author": "ayushopchauhan",
              "text": "appreciate it, thanks!",
              "score": 2,
              "created_utc": "2026-02-22 07:28:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6qb4v4",
          "author": "testbot1123581321",
          "text": "Can setup my own email server on Linux cheaper",
          "score": 2,
          "created_utc": "2026-02-22 06:16:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qj6pp",
              "author": "ayushopchauhan",
              "text": "a mail server and an email verifier are two different things. a mail server sends and receives email. this workflow verifies whether other people's email addresses exist before you send to them.  \n  \nyou could run your own mail server for sending, sure. but you'd still need to verify your recipient list before sending through it or your server's ip gets blacklisted from bounces. that's what this does.",
              "score": 1,
              "created_utc": "2026-02-22 07:30:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6sbv7u",
          "author": "Big-Business-AJL",
          "text": "That's fantastic",
          "score": 2,
          "created_utc": "2026-02-22 15:39:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6u4lcn",
              "author": "ayushopchauhan",
              "text": "thanks man! ",
              "score": 1,
              "created_utc": "2026-02-22 20:42:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73sfha",
          "author": "Sad-Pain-2749",
          "text": "This is really awesome, thank you so much for sharing! I needed something exactly like this. Do you have any tools for scraping emails from online?",
          "score": 2,
          "created_utc": "2026-02-24 08:43:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73tr0l",
              "author": "ayushopchauhan",
              "text": "thanks man, appreciate that.  \n  \nfor scraping it depends on what you're going after. apollo and linkedin sales navigator are the main ones for b2b leads. apify has actors that pull from those plus google maps and a few other sources. works well for building targeted lists if you know what filters to set.  \n  \nwhat niche are you in? i can point you in the right direction.\n\n",
              "score": 2,
              "created_utc": "2026-02-24 08:55:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o775deg",
                  "author": "Sad-Pain-2749",
                  "text": "Thank you so much! I'm in sales focusing on contractors (i.e. plumbers, electricians, roofing companies, etc) and also on restaurants. ",
                  "score": 1,
                  "created_utc": "2026-02-24 20:07:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o741cw6",
          "author": "FullSpare1352",
          "text": "Nice",
          "score": 1,
          "created_utc": "2026-02-24 10:08:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7az9v5",
          "author": "AgitatedDoctor9613",
          "text": "# Constructive Feedback\n\n**Workflow robustness concerns:** Your SMTP verification approach lacks critical edge cases—you're not handling rate limiting from mail servers, timeout management across different providers, or retry logic for transient failures. Many servers will block or throttle direct SMTP connections, which could cause false negatives and skew your confidence scores.\n\n**Missing operational considerations:** The post doesn't address deliverability vs. validity (a mailbox can exist but reject mail), logging/audit trails for compliance, or how you're handling the Microsoft API's rate limits and authentication. For production use, you'll need monitoring, error handling, and a way to track which checks failed and why.\n\n**Better alternative framing:** Rather than positioning this as a complete replacement, consider it a *complementary tool* for low-volume verification. Commercial services handle infrastructure complexity (IP reputation, bounce management, legal compliance) that a self-hosted workflow doesn't solve—they're solving a different problem than just the technical check.",
          "score": 1,
          "created_utc": "2026-02-25 10:41:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ny6j8",
          "author": "ManyWitty4946",
          "text": "All emails you sent will go straight to spam or they wont even reach the destination. You dont understand how it works.",
          "score": 0,
          "created_utc": "2026-02-21 21:08:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qiy2y",
              "author": "ayushopchauhan",
              "text": "this workflow doesn't send any emails. it verifies them.  \n  \nit connects to the mail server, does the smtp handshake up to RCPT TO, gets the response (mailbox exists or doesn't), and disconnects. no DATA command is ever sent. no email body. no headers. nothing lands in anyone's inbox or spam folder.  \n  \nit's the same thing every paid verification service does. the smtp protocol lets you check if a recipient address is valid without actually delivering a message.",
              "score": 1,
              "created_utc": "2026-02-22 07:28:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6qjec6",
                  "author": "ManyWitty4946",
                  "text": "Ah ok, I misunderstood it then. Thank you!",
                  "score": 2,
                  "created_utc": "2026-02-22 07:32:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r95t1k",
      "title": "I built a fully automated job application pipeline in n8n — daily scheduling, AI cover letters, CV adaptation, and email sending",
      "subreddit": "n8n",
      "url": "https://i.redd.it/9olat4t2nhkg1.png",
      "author": "Fresh-Daikon-9408",
      "created_utc": "2026-02-19 17:41:57",
      "score": 98,
      "num_comments": 45,
      "upvote_ratio": 0.99,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1r95t1k/i_built_a_fully_automated_job_application/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o69yr3h",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-19 17:41:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6apdnv",
          "author": "Impressive_Flight219",
          "text": "This is fantastic! \nIt’s also augment Abel for other processes as well\nGood work",
          "score": 4,
          "created_utc": "2026-02-19 19:47:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6asohi",
              "author": "Fresh-Daikon-9408",
              "text": "Is augment Abel some kind of Reddit pass phrase ??\nOr did you genuinely meant augmentable ?\n😉",
              "score": 1,
              "created_utc": "2026-02-19 20:03:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6betp2",
          "author": "EntireExercise6779",
          "text": "Bro thats awesome. I built a workflow to get jobs from jobright and simplify and generate cover letter but jobright had too many jobs daily and i keep getting one or another error",
          "score": 3,
          "created_utc": "2026-02-19 21:52:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6bqba8",
              "author": "Fresh-Daikon-9408",
              "text": "thanks ;-)",
              "score": 1,
              "created_utc": "2026-02-19 22:51:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6c2md2",
          "author": "erock072",
          "text": "I’m all for the workflows and the build out of these alone…but I gotta know some results. Any interviews? Any offers?",
          "score": 3,
          "created_utc": "2026-02-20 00:03:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6clso9",
              "author": "CuriousExtension5766",
              "text": "Its pathetic in many ways that this is even necessary honestly.  Eventually we just gonna have bots organizing with other bots on a bot union that votes to sacrifice the meat entities.\n\nAnd I'm all for automation, but, I have never in my career had to apply to hundreds of jobs for an interview.  Most ever was probably 15 applications over a few months time.\n\nI realize I might not be the norm on that, but, sheesh, blanketing resumes to me always felt like you will not be happy with what you do get, because honestly, you're just putting yourself on a chum hook, and hoping a fish bites.",
              "score": 4,
              "created_utc": "2026-02-20 01:58:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6dvnhv",
                  "author": "Fresh-Daikon-9408",
                  "text": "It is not necessary.\nIt is a tool.\n\nThe workflow select job offers an craft an application based on your profile, not on thin air.\nYou review it and decide wether you apply or not.\n\nIn my personnal case I would never set it to send the mail directly to the recruiters, it is not even meant to be that way.\nIt sends mails to me of course.\n\nIn fact it replace the poorly selected job offers that you receive from platforms, and it attach for you a taylored job application.",
                  "score": 1,
                  "created_utc": "2026-02-20 07:35:52",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6dvaai",
              "author": "Fresh-Daikon-9408",
              "text": "I am afraid it will depends of how you feed the workflow.\nIt is not magical. It uses your real profile, xp and skills.",
              "score": 1,
              "created_utc": "2026-02-20 07:32:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6dbqz9",
          "author": "chowder138",
          "text": "My biggest worry with this is how these employers would react if they can tell that your application is AI written. Still a lot of stigma towards that in a lot of fields.",
          "score": 3,
          "created_utc": "2026-02-20 04:47:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6duwq8",
              "author": "Fresh-Daikon-9408",
              "text": "Recruiters use ai to review applications and they complain about ai made resumes 😂\n\nYou can edit the workflow to use your own writing an ask it to simply adapt to the targeted offer.\nIt is already what it is doing for résumes.\n\nIt is ai assisted but it is not made up",
              "score": 2,
              "created_utc": "2026-02-20 07:29:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6rr1tx",
                  "author": "chowder138",
                  "text": "Yep not saying it's fair, just that it's the way it is. I feel like it strongly depends on the writing style of the LLM. I think most employers would automatically reject an application that was clearly written in ChatGPT's overdramatic writing style. I've gotten professional emails from people that were written by ChatGPT and it even rubs me the wrong way. There are lots of ways that this workflow could avoid that though (giving it examples of your writing style, using an LLM that's not ChatGPT etc). \n\nBut my point is that I think your success rate with a workflow like this will be extremely dependent on whether your applications \"sound like\" they're written by AI.",
                  "score": 2,
                  "created_utc": "2026-02-22 13:49:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6dg9s3",
          "author": "DGC_David",
          "text": "I do find it oddly dystopian but nice job.",
          "score": 3,
          "created_utc": "2026-02-20 05:21:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f198u",
          "author": "Drogoff1489",
          "text": "nice workflow. the ai selection + tailored cover letter part is smart\n\none suggestion: add a quality gate before auto-sending. i'd have it save to a \"ready to send\" airtable base and then review the top matches manually before hitting send. takes 5 min/day but prevents embarrassing mismatches\n\nalso curious how you're handling application tracking - do you log which jobs got responses vs ghosted? that feedback loop would let you refine the AI selection criteria over time",
          "score": 2,
          "created_utc": "2026-02-20 13:19:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6flbfn",
              "author": "Fresh-Daikon-9408",
              "text": "Sure !  \nThe mail sending part is sending the mail to me.  \nIn the mail I have the cover letter, the resume and the application link.  \nrecruiter mails are never available, it is always via some job platform. This part is manual. I can't integrate all job application platform.  \nI don't track no.  \n ",
              "score": 1,
              "created_utc": "2026-02-20 15:05:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6g9zec",
                  "author": "Drogoff1489",
                  "text": "very cool! nice job",
                  "score": 2,
                  "created_utc": "2026-02-20 16:59:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6glk9q",
              "author": "Material-River-2235",
              "text": "I use gigup and it actually has both those features built in. you can set a manual review step before sending proposals, and it tracks all your application metrics to refine its matching over time.",
              "score": 1,
              "created_utc": "2026-02-20 17:53:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fdw70",
          "author": "Final-Donut-3719",
          "text": "This n8n setup is seriously impressive, especially the CV as code part. Most people forget that the hardest part of automation isn't the API connection. It's making sure the data enrichment stays high quality so you don't look like a bot. \n\nI've been using tools from LLM Relevance Directory to handle the strategic side of these workflows. They have specific playbooks and directory tools that help refine how you show up in AI search results and automate the boring parts of data enrichment. It definitely keeps the output feeling way more human. \n\nAre you finding that Gemini handles the CV adaptation well enough to pass through ATS filters without manual tweaks?",
          "score": 2,
          "created_utc": "2026-02-20 14:27:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fmc7p",
              "author": "Fresh-Daikon-9408",
              "text": "Thanks !  \nI use gemini 3 flash since it is very fast and cheap. It does the job quite well.  \nI could have slightly better results with gemini 3 pro or Sonnet 4.6, but not so much, since the workflow gives enough context to guide the llm correcly.",
              "score": 1,
              "created_utc": "2026-02-20 15:10:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fighc",
          "author": "Professional_Ebb1870",
          "text": "how long did this trake you \n\n",
          "score": 2,
          "created_utc": "2026-02-20 14:51:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fn2fz",
              "author": "Fresh-Daikon-9408",
              "text": "Not so much, thanks to my n8n-as-code helper. (2 hours total maybe)  \nIt was done mostly by chatting with an AI agent.  \nGive it a try if you are curious :  \n[EtienneLescot/n8n-as-code: Stop clicking. Start coding. Bidirectional n8n ↔️ VS Code sync to generate workflows via AI and enable GitOps.](https://github.com/EtienneLescot/n8n-as-code)  \nor search n8n as code in vscode marketplace.",
              "score": 1,
              "created_utc": "2026-02-20 15:13:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jnd0i",
          "author": "Chirag_160801",
          "text": "Great product, seems very useful for offcampus job hunters",
          "score": 2,
          "created_utc": "2026-02-21 03:46:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6l01k8",
          "author": "These-Paramedic835",
          "text": "This is a great workflow! Thanks for sharing.",
          "score": 2,
          "created_utc": "2026-02-21 10:56:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l3mmq",
              "author": "Fresh-Daikon-9408",
              "text": "You're welcome !",
              "score": 1,
              "created_utc": "2026-02-21 11:30:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6s6t4g",
          "author": "Jarvis037",
          "text": "Hi,\nI’m also working on a similar approach, and it’s functioning well so far. However, my biggest challenge is finding the correct email address to send my application to.\nHow are you identifying the email addresses for the roles you apply to? In other words, once you find a job that matches your skills, how do you locate the appropriate email address to submit your application?",
          "score": 2,
          "created_utc": "2026-02-22 15:15:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6sp0ww",
              "author": "Fresh-Daikon-9408",
              "text": "I don't, the email is sent to me. Then I apply via the application link.\nImpossible to have it all automatized !",
              "score": 1,
              "created_utc": "2026-02-22 16:37:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6speg2",
                  "author": "Jarvis037",
                  "text": "Ohhh okay that makes sense \nI'm this close 🤏 to automating this also.",
                  "score": 1,
                  "created_utc": "2026-02-22 16:39:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6a7x5x",
          "author": "MangoNeither8989",
          "text": "I use something similar but eventually switched to GigUp because maintaining the Upwork API integration and match scoring became a full time job itself. It handles the profile to job analysis and instant alerts so I can just focus on the proposals.",
          "score": 2,
          "created_utc": "2026-02-19 18:25:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6aui07",
              "author": "Fresh_Refuse_4987",
              "text": "Alright, I will go check it out.",
              "score": 1,
              "created_utc": "2026-02-19 20:12:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6bq9af",
          "author": "Fresh-Daikon-9408",
          "text": "I built it entirely from prompts with n8n-as-code by the way ;-)  \n[EtienneLescot/n8n-as-code: Stop clicking. Start coding. Bidirectional n8n ↔️ VS Code sync to generate workflows via AI and enable GitOps.](https://github.com/EtienneLescot/n8n-as-code)",
          "score": 1,
          "created_utc": "2026-02-19 22:51:41",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o6d5grj",
          "author": "CamelMurderer",
          "text": "I’m working on a similar workflow actually, how are you querying for jobs?",
          "score": 1,
          "created_utc": "2026-02-20 04:02:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6duzgq",
              "author": "Fresh-Daikon-9408",
              "text": "API",
              "score": 1,
              "created_utc": "2026-02-20 07:29:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6dzk2g",
                  "author": "froggidyfrog",
                  "text": "Which APIs do you recommend? I tried with Adzuna and Jsearch, but the results are messy and it seems that it can only find 1-2 jobs. Do you have any tips? I would be grateful",
                  "score": 1,
                  "created_utc": "2026-02-20 08:12:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6e694z",
          "author": "_373",
          "text": "Does this process really need to be so complicated?",
          "score": 1,
          "created_utc": "2026-02-20 09:15:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6e7exb",
              "author": "Fresh-Daikon-9408",
              "text": "Maybe not. If you think you can simplify it, go ahead, If you want to share you results, you are more than welcome !",
              "score": 1,
              "created_utc": "2026-02-20 09:26:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6eu0w8",
          "author": "Uniko_nejo",
          "text": "I feel like there should be a sub-workflow ",
          "score": 1,
          "created_utc": "2026-02-20 12:34:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6pmfcm",
          "author": "nqvuong99qn_",
          "text": "All are good. I love it. Any cost?",
          "score": 1,
          "created_utc": "2026-02-22 03:10:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71demn",
          "author": "Busy-Ad-5320",
          "text": "How do i use this?",
          "score": 1,
          "created_utc": "2026-02-23 22:56:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mh9yu",
          "author": "stecandela",
          "text": "Io con Canonity faccio una cosa più facile e più utile in 1 minuto",
          "score": 0,
          "created_utc": "2026-02-21 16:39:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mqyur",
          "author": "True-Rise-3949",
          "text": "Make full explanation please",
          "score": 0,
          "created_utc": "2026-02-21 17:28:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdadp2",
      "title": "I built a RAG pipeline using n8n that converts Google Drive documents into a searchable AI knowledge system.",
      "subreddit": "n8n",
      "url": "https://i.redd.it/x3lc064jeelg1.png",
      "author": "Least_Average7732",
      "created_utc": "2026-02-24 08:04:48",
      "score": 75,
      "num_comments": 20,
      "upvote_ratio": 0.87,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1rdadp2/i_built_a_rag_pipeline_using_n8n_that_converts/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o73ocvz",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-24 08:04:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o750f8o",
          "author": "-FurdTurgeson-",
          "text": "“Why are all your responses in quotes?”\n\nAnd that top comment and reply is a little too perfect. Me thinks we found a shitty ad, boys!",
          "score": 14,
          "created_utc": "2026-02-24 14:14:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76esb3",
              "author": "Least_Average7732",
              "text": "Haha, not an ad, boys! I’m just a non-technical guy learning n8n and building in public. I use ChatGPT/AI to help me clean up my English and format my posts because I want them to look clear and professional.\n\nAs for the workflow, I literally spent hours watching tutorials to get that Pinecone and Gemini link right. Happy to show a screen recording if you think I'm a bot! 😂",
              "score": 3,
              "created_utc": "2026-02-24 18:08:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o76f7bb",
                  "author": "-FurdTurgeson-",
                  "text": "alright ok. Pitchforks down, gentlemen. ",
                  "score": 2,
                  "created_utc": "2026-02-24 18:09:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o73ygdw",
          "author": "OG_Romes",
          "text": "Can your workflow create drive folders based on images? For example I have 500 product images and I would like them to be grouped in folders based on images.",
          "score": 2,
          "created_utc": "2026-02-24 09:41:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o742vve",
              "author": "Least_Average7732",
              "text": "\"That’s a very specific and interesting use case! Yes, it’s definitely possible with n8n. We can use an AI Vision model to analyze each product image, categorize it, and then use the Google Drive node to create folders and move files automatically. but I’d love to try building a prototype for this 'Image-to-Folder' automation.",
              "score": -4,
              "created_utc": "2026-02-24 10:22:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o745d79",
                  "author": "OG_Romes",
                  "text": "Yeah because I already built a automation that Downloads images and cross references from a Google sheet and sends them in batches of 3 images + meta info from sheet to an AI and the AI writes a prosuct description, keywords and other info always using the same template/user prompt.  But I forgot to build the Automation that groups the images in folders first. 😅",
                  "score": 1,
                  "created_utc": "2026-02-24 10:45:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7467ii",
          "author": "Rizz_Pineapple",
          "text": "Impressive dude",
          "score": 2,
          "created_utc": "2026-02-24 10:52:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o762shj",
              "author": "Least_Average7732",
              "text": "Thanks Dude.",
              "score": 1,
              "created_utc": "2026-02-24 17:13:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o784ld3",
          "author": "schnorreng",
          "text": "Isn’t this for NotebookLM is for? ",
          "score": 2,
          "created_utc": "2026-02-24 22:54:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73zpub",
          "author": "jannemansonh",
          "text": "nice work getting the vector store + embeddings wired up... that's always the trickiest part. hit the same wall with n8n and drive search before... ended up using [needle.app](http://needle.app) since you just describe what you need and it builds the rag workflow. way easier than configuring nodes, especially if you're not super technical",
          "score": 2,
          "created_utc": "2026-02-24 09:53:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o741dkf",
              "author": "Least_Average7732",
              "text": "\"Thanks a lot! You're right, wiring up the embeddings was definitely the trickiest part for me. I'll check out [Needle.app](http://Needle.app), but I really wanted to learn the 'under-the-hood' logic in n8n first to understand how it all connects. Appreciate the tip!\".\n\n",
              "score": 0,
              "created_utc": "2026-02-24 10:08:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o75hp92",
          "author": "cyber5234",
          "text": "What kind of documents does it support?",
          "score": 1,
          "created_utc": "2026-02-24 15:39:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7915bt",
          "author": "newplayerentered",
          "text": "If i upload new version of a document,  how do you make sure older version is ignored, and only new version of document is used?",
          "score": 1,
          "created_utc": "2026-02-25 01:53:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73phvd",
          "author": "Low-Opening25",
          "text": "there are hundreds of workflows that do it and it’s a 5 min job workflow. you didn’t do much",
          "score": -5,
          "created_utc": "2026-02-24 08:15:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o746arg",
              "author": "Rizz_Pineapple",
              "text": "Maybe for him it's an achievement",
              "score": 9,
              "created_utc": "2026-02-24 10:53:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o73ss5o",
          "author": "Least_Play9958",
          "text": "So what exactly is so special about this workflow? You can do it in less than 3 minutes, with watching a youtube video\n\n",
          "score": -6,
          "created_utc": "2026-02-24 08:46:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7418nm",
              "author": "Least_Average7732",
              "text": "\"I totally get that for experts it's a 5-minute task. But as someone from a non-technical background who started 1 months ago, finally getting the logic of RAG and Vector Stores right feels like a huge win. We all start somewhere, right? Cheers!\"",
              "score": 3,
              "created_utc": "2026-02-24 10:07:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rdnzf8",
      "title": "n8n v2 is pathetic",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1rdnzf8/n8n_v2_is_pathetic/",
      "author": "claqueure",
      "created_utc": "2026-02-24 18:17:15",
      "score": 61,
      "num_comments": 33,
      "upvote_ratio": 0.82,
      "text": "In n8n v1 you can use numpy and pandas. which is pretty much the default go to tool for any bigger data transformation.\n\n  \nin n8n v2 cloud you no longer can use the most usefull python tools at all.\n\nin selfhosted there is a fairytale of \"you can compile it into your runner every time you update but hm nobody sure if that really works out\".\n\n  \nI think n8n is going the absolute wrong direction in so many ways (terrible terrible explainer videos on youtube with some fat douche make me vomit, they take money from scammy nvidia, etc..)\n\nreminds me very much of the day wordpress told everyone to use gutenberg \"because it is good\".  \n",
      "is_original_content": false,
      "link_flair_text": "Servers, Hosting, & Tech Stuff",
      "permalink": "https://reddit.com/r/n8n/comments/1rdnzf8/n8n_v2_is_pathetic/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o76i4je",
          "author": "conor_is_my_name",
          "text": "Use this: [https://github.com/conor-is-my-name/n8n-autoscaling](https://github.com/conor-is-my-name/n8n-autoscaling)\n\nalready did all the hard work for you ",
          "score": 61,
          "created_utc": "2026-02-24 18:22:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77gcn8",
              "author": "Gburchell27",
              "text": "You are a god thank you",
              "score": 4,
              "created_utc": "2026-02-24 20:59:13",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o787b3e",
              "author": "Own_Bandicoot4290",
              "text": "I ran across your GitHub repo and it made setting up n8n so much easier. I wish I grabbed it after you made the change to not rely on cloudflare",
              "score": 1,
              "created_utc": "2026-02-24 23:08:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o77dnpo",
              "author": "EarthRise7",
              "text": "Hey this looks great! Would you recommend running this on a VM or an LXC? I’m using proxmox.",
              "score": 0,
              "created_utc": "2026-02-24 20:46:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o77eex6",
                  "author": "conor_is_my_name",
                  "text": "I use this with LXC on promox myself",
                  "score": 5,
                  "created_utc": "2026-02-24 20:50:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o76jk63",
              "author": "claqueure",
              "text": "hey conor,\n\nthat looks great! thank you. may the CEO of n8n get butt fucked by nvidia ceo.  \nwill try yours. seems to have it all. just imagine n8n would have been that mindfull\n\n",
              "score": -39,
              "created_utc": "2026-02-24 18:29:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o76og2x",
                  "author": "DerDave",
                  "text": "Dude, calm down! No need to get so aggressive over some business decisions you don't like. It's a startup that needs to make money - we can be glad they open sourced everything. How many companies do that?",
                  "score": 30,
                  "created_utc": "2026-02-24 18:50:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o76kfbf",
                  "author": "conor_is_my_name",
                  "text": "Hope you find it useful.  Made it in a way so that it can be used as a template to add anything else you might need on top.  ",
                  "score": 3,
                  "created_utc": "2026-02-24 18:32:57",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o76ryxg",
                  "author": "dworts",
                  "text": "Bro chill, it’s not that difficult to make external calls for complex data processing, you can’t include every external library on the planet in core",
                  "score": 5,
                  "created_utc": "2026-02-24 19:06:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o77olay",
          "author": "coinclink",
          "text": "I'm installing many, many modules into my python task runners with no issue in v2. I've installed numpy, pandas, opencv, and a ton of other stuff too, even native software like ffmpeg. They show instructions right on their documentation how to do it. \n\nIt is also MUCH better than the previous \"pyodide\" environment because it is running native python rather than some Frankenstein nodejs, wasl, precompiled version of python.\n\nI get that it's an extra step, but that's because it's a customization. Is there anything in particular that you're having trouble with? I'm not sure what your complaint is other than you just don't know how to do it.",
          "score": 6,
          "created_utc": "2026-02-24 21:36:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7b9prk",
              "author": "claqueure",
              "text": "but you can agree that it is kinda shit for ppl that use the n8n cloud,right?",
              "score": 1,
              "created_utc": "2026-02-25 12:07:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7cpjtx",
                  "author": "coinclink",
                  "text": "Yes, I guess, but I think n8n cloud is for very basic things in general. Javascript is also very limited in cloud. So are execution timeouts and many other things. I would guess 80%+ of anyone using n8n for anything critical or enterprise-grade are all self-hosting.",
                  "score": 1,
                  "created_utc": "2026-02-25 16:41:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o772sf0",
          "author": "chaos_battery",
          "text": "It's just standard docker container images. I extended the container image and added my own layer on top which incorporates things like scrapy for web scraping, load ash to efficiently manipulate JSON, and some other command line tools. Once you have the pattern and configurations set up how you want them, you can just keep adding in NPM packages or other tools which is pretty nice.",
          "score": 4,
          "created_utc": "2026-02-24 19:55:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78d1ej",
          "author": "zunjae",
          "text": "I do agree, V2 is pathetic and the setup for task runners is unnecessarily complex\n\nThen again you don’t have to do all this in n8n. Just wrap your complex calls in FastAPI and call that from n8n. It will scale better",
          "score": 4,
          "created_utc": "2026-02-24 23:39:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7b6zdo",
              "author": "claqueure",
              "text": "thank you for pointing me in this direction. ",
              "score": 1,
              "created_utc": "2026-02-25 11:46:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o77855c",
          "author": "Jomuz86",
          "text": "I have a separate python docker container with all my libraries installed and use the execute module to run the code in that. Just takes a little bit of setup is all.",
          "score": 3,
          "created_utc": "2026-02-24 20:20:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o773q9o",
          "author": "necromenta",
          "text": "Dude… you can actually use those? You just have a more headache of a setup to use them but I even managed to install polars on the runners, then I found n8n is just plain bad at python and switched over fastapi in a container with api calls\n\nOn n8n is better to use JS",
          "score": 2,
          "created_utc": "2026-02-24 20:00:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o775o4l",
              "author": "applescrispy",
              "text": "Yeah Fast API been working sweet for me",
              "score": 1,
              "created_utc": "2026-02-24 20:09:20",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o77q78q",
              "author": "coinclink",
              "text": "What do you mean by \"just plain bad at python\" - the task runners in v2 are running native python now and it works fine for me. If you got your task runners set up, what issue is it that you're having?",
              "score": 1,
              "created_utc": "2026-02-24 21:44:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o78f3gx",
                  "author": "necromenta",
                  "text": "I also have task runners and multiple code nodes in python, is just harder to understand and get up to the job, with JS you just do things far more easily in n8n, and setting the task runners is a pain",
                  "score": 1,
                  "created_utc": "2026-02-24 23:51:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7eb4he",
          "author": "Mstrmnds",
          "text": "https://...",
          "score": 1,
          "created_utc": "2026-02-25 21:05:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rayg8o",
      "title": "Complete beginner at n8n — where do I even start?",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1rayg8o/complete_beginner_at_n8n_where_do_i_even_start/",
      "author": "Latenight_vibecoder",
      "created_utc": "2026-02-21 18:23:53",
      "score": 59,
      "num_comments": 26,
      "upvote_ratio": 0.9,
      "text": "Hey everyone,\n\nI've been playing around with n8n for a few weeks now and \nhonestly kind of overwhelmed by how many nodes there are.\n\nI keep seeing people build crazy automations and I have no \nidea where they even started learning.\n\nFor those of you who are actually using n8n in real projects \n— what did you focus on first? Like which nodes actually show \nup in real workflows vs ones that look cool but you never \nactually use?\n\nAlso curious what kind of workflows you build day to day. \nIs it mostly AI stuff, email automation, connecting APIs? \n\nJust trying to figure out what's actually worth learning \nvs what's just tutorial bait 😅\n\nAny advice from people who've been through this would \nbe really helpful!",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/n8n/comments/1rayg8o/complete_beginner_at_n8n_where_do_i_even_start/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o6n24ol",
          "author": "AutoModerator",
          "text": "**Need help with your workflow?**\n\nTo receive the best assistance, please share your workflow code so others can review it:\n\n**Acceptable ways to share:**\n\n* Github Gist (recommended)\n* Github Repository\n* Directly here on Reddit in a code block\n\nIncluding your workflow JSON helps the community diagnose issues faster and provide more accurate solutions.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-21 18:23:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nptaq",
          "author": "shajid-dev",
          "text": "Forget about the nodes, If you have a problem that only requires 3 nodes to connect, and that's what we all called automations. NOT 50-100 nodes connected like bloody spaghetti noodle unless if there were any reasonable validation. However, learning n8n is good, and it will sustain another decade, but I suggest you learn the ecosystem, and how to think like a logical planner to build your automations. Start from what you'd do to save your time? find your repetitive tasks, and try to automate that and get that dopamine hits, next things would come in linear though. \n\nsince you're saying you're a beginner, and these resources would help you to get headstart with n8n. \n\nTheories Based for a beginner\n\n\\- How to install n8n locally (2026) - [https://theowllogic.com/installing-n8n-setup-locally](https://theowllogic.com/installing-n8n-setup-locally)  \n\\- Your first Hello World Workflow - [https://theowllogic.com/first-hello-world-n8n-workflow](https://theowllogic.com/first-hello-world-n8n-workflow)  \n\\- n8n Workflows, Nodes and Data-flow - [https://theowllogic.com/n8n-workflow-nodes-data-flow](https://theowllogic.com/n8n-workflow-nodes-data-flow)  \n\\- Webhooks in n8n for Beginners - [https://theowllogic.com/webhook-in-n8n-explained](https://theowllogic.com/webhook-in-n8n-explained)  \n\\- How to Handle API Rate Limits in n8n - [https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n](https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n)  \n\\- How to Handle Errors Like a Pro in n8n - [https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n](https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n)  \n\\- n8n Expressions Complete Guide - [https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n](https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n)  \n\\- How to Build Condition Logics in n8n (IF/Switch) - [https://theowllogic.com/conditional-logic-in-n8n](https://theowllogic.com/conditional-logic-in-n8n)  \n\\- How to Use n8n Loop Over Items - [https://theowllogic.com/how-to-use-loop-in-n8n](https://theowllogic.com/how-to-use-loop-in-n8n)  \n\\- How to Use Sub-Workflows in n8n - [https://theowllogic.com/n8n-sub-workflows](https://theowllogic.com/n8n-sub-workflows)\n\nWorkflows Based  \n\\- How to Plan a n8n Workflow - [https://theowllogic.com/plan-n8n-workflow](https://theowllogic.com/plan-n8n-workflow)  \n\\- 50 Boring Tasks You Can Automate With n8n - [https://theowllogic.com/automate-boring-tasks-n8n](https://theowllogic.com/automate-boring-tasks-n8n)  \n\\- How to Build a Follow-up Email Sequence - [https://theowllogic.com/n8n-followup-email](https://theowllogic.com/n8n-followup-email)  \n\\- How to Build an n8n AI Agent (Step by Step) - [https://theowllogic.com/n8n-ai-agent-workflow](https://theowllogic.com/n8n-ai-agent-workflow)",
          "score": 53,
          "created_utc": "2026-02-21 20:23:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6q3j88",
              "author": "boydjanmaat",
              "text": "Great answer, makes sense. Thanks! I’m a beginner in this as well. Would it be possible for you to describe limits and possibilities with n8n automation?",
              "score": 1,
              "created_utc": "2026-02-22 05:13:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6qf49c",
                  "author": "shajid-dev",
                  "text": "There are no limits AFAIK, because my contexts are small and effective, you have to find possibilities in your niche.",
                  "score": 2,
                  "created_utc": "2026-02-22 06:52:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6vetky",
              "author": "Mysterious-Ad-8656",
              "text": "Legend",
              "score": 1,
              "created_utc": "2026-02-23 00:50:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6z4l5d",
              "author": "GrGBchara",
              "text": "Thank for this, amazing!",
              "score": 1,
              "created_utc": "2026-02-23 16:31:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6n3glr",
          "author": "FaultofDan",
          "text": "Step 1 - find a problem that you're trying to solve. Asking where to start with n8n is like asking where to start with a table saw or a video camera. It's a tool. You need a project to work on.",
          "score": 19,
          "created_utc": "2026-02-21 18:30:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6pbaby",
              "author": "aidiscounts",
              "text": "Ameen ",
              "score": 1,
              "created_utc": "2026-02-22 01:57:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6n4rx1",
          "author": "onivell",
          "text": "To be honest i learned while trying to create automations!",
          "score": 5,
          "created_utc": "2026-02-21 18:36:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nxhjh",
          "author": "buttplumber",
          "text": "I found the problem I wanted to solve/automate and started talking with ChatGPT potting it in the role of Linux and n8n expert. The same evening I already had my n8n docker installed on my Ubuntu local server and already the first workflow running.\n\nThat's how I learned to ask the right questions and troubleshoot any obstacles on the way.",
          "score": 2,
          "created_utc": "2026-02-21 21:04:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qcvme",
          "author": "No_Addendum5565",
          "text": "Start from YouTube",
          "score": 2,
          "created_utc": "2026-02-22 06:32:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6n6iqv",
          "author": "Useful_Calendar_6274",
          "text": "honestly maybe learn to code first. if you already know, disregard",
          "score": 2,
          "created_utc": "2026-02-21 18:45:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6n9l1e",
          "author": "Royal-Wear-6437",
          "text": "I had a particular integration task that needed fixing. I could write most of the code in (UNIX/Linux) shell script so I had some PoC code that let me learn how to talk to the various APIs. Then I started with N8N. And Gemini, which is surprisingly helpful seeing as although I can read procedural languages like Javascript, I'm not at all good at writing it.",
          "score": 1,
          "created_utc": "2026-02-21 19:00:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6o8ani",
          "author": "Possible-Road-4290",
          "text": "Honestly when you see a +15 node-automation on LinkedIn with a title like « I give away my n8n workflow to build an AI agent that will do X » \n=> tutorial bait \n\nn8n workflow make sense when you have a boring process you want to automate \n\nOut of thin air, I doubt you will find anything to work on. That kind of process is to be found at companies with employees performing the same boring task multiple times a day \n\nWhen you find something, n8n being a low code tool you’ll have to try hard and figure out what to do. I personally learnt it while working on projects",
          "score": 1,
          "created_utc": "2026-02-21 22:02:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6p0gkj",
          "author": "molehill_io",
          "text": "You might like this tutorial that covers how to build a reddit scraper from scratch, with all of the technical details: https://molehill.io/blog/building_a_reddit_question_scraper_using_n8n",
          "score": 1,
          "created_utc": "2026-02-22 00:48:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6p8jvd",
          "author": "richard-b-inya",
          "text": "Honestly with MCPs you don't really even need it anymore.  Maybe it still has a place in some workflows.",
          "score": 1,
          "created_utc": "2026-02-22 01:39:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6pm00f",
              "author": "Useful_Disaster_7606",
              "text": "I guess for more deterministic workflows, wouldn't n8n still remain relevant?",
              "score": 1,
              "created_utc": "2026-02-22 03:07:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6po6pl",
                  "author": "richard-b-inya",
                  "text": "I mean it can be used for everything but building the app directly and then using MCPs, for example, is just more efficient.  More control and cheaper that way.  Plus not locked into the N8N ecosystem for everything.  \n\nFrom a building a company standpoint I would focus on sales and marketing and let someone else develop the solution if you are going to use N8N.",
                  "score": 1,
                  "created_utc": "2026-02-22 03:22:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6u7h9n",
          "author": "Big-Business-AJL",
          "text": "Going to be honest I started learning as I did it. Youtube, google, and chatgpt haha. Then through a lottttt of trial and error, I learned a lot",
          "score": 1,
          "created_utc": "2026-02-22 20:56:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6usshx",
          "author": "Bklynbiz",
          "text": "You don’t! Skip n8n and go straight to Claude code for building automations. You can only get so far with n8n.",
          "score": 1,
          "created_utc": "2026-02-22 22:46:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7awm8z",
              "author": "Ok-Science2686",
              "text": "Nope ! Try n8n to understand the logic of your workflow. It’s more easy to understand with it. Once you get it, go for Claude and code each step of your workflow.",
              "score": 1,
              "created_utc": "2026-02-25 10:17:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6v6uka",
          "author": "Elgon2003",
          "text": "Asking how to use a saw without having a piece of wood to cut wont allow you to go far. Find the problem and then attempt to fix it.",
          "score": 1,
          "created_utc": "2026-02-23 00:05:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w0ps7",
          "author": "BrilliantRip3517",
          "text": "I honestly think you learn best by just building. Find something simple you can automate for yourself or a friend and work through it. Or look at common workflows people build on YouTube and try recreating them on your own first, only check the tutorial if you get stuck. That way, you actually learn instead of just copying.",
          "score": 1,
          "created_utc": "2026-02-23 03:03:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79zgy4",
          "author": "Puzzleheaded-Dig-492",
          "text": "I’ve just crafted a docker compose stack with N8N, LLM gateway LiteLLM (with 30+ ollama cloud free models out of the box, just get your api key) and openwebui.\nIt’s very simple and yet completely functional starter kit.\n\nIt’s here https://github.com/wa91h/local-ai-toolkit",
          "score": 1,
          "created_utc": "2026-02-25 05:24:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1redj4i",
      "title": "This Client Paid Me to Automate his Telecom business. Full Case Study.",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1redj4i/this_client_paid_me_to_automate_his_telecom/",
      "author": "automatexa2b",
      "created_utc": "2026-02-25 13:41:54",
      "score": 56,
      "num_comments": 9,
      "upvote_ratio": 0.94,
      "text": "Just wrapped up a project for a telecom reseller in the US who works with vendors like Twilio and partners like CDW. Thought I'd share the breakdown because telecom billing automation is genuinely complex and I don't see many people talking about it specifically.\n\nTheir workflow was a mess. Everything scattered across emails, manual quote creation, spreadsheets everywhere. They were literally digging through emails to start every quote. No visibility into usage overages. No way to track margins properly. Invoicing took forever because everything was manual data entry.\n\nThey knew it was broken but didn't think automation could handle the complexity. Usage based billing mixed with subscriptions, multiple vendor tiers. Every quote needed different calculations depending on the customer, the service type, whether it was monthly or annual. They'd tried to figure it out themselves and gave up.\n\nSo I put together a detailed document showing exactly how I'd solve it. Workflow blueprints, logic diagrams, everything mapped out. Showed them how the pricing engine would work, how quotes would generate automatically, how everything would connect to their accounting system. Once they saw that, they were in.\n\n**Here's what I actually built using n8n:**\n\nWeb forms that capture leads automatically so they stop losing inquiries in email chaos. A pricing engine that calculates three tier costs... vendor to reseller to end customer, with the complex telecom billing logic baked in. It generates two different PDF quotes from one source because CDW needs annual bundled pricing while customers want detailed line items.\n\nOCR that pulls data from purchase orders and invoices straight into QuickBooks so nobody's retyping everything. Real time margin tracking so they actually know if they're making money on deals. The system also flags usage overages automatically. Before this they'd miss billable usage all the time because nobody was checking.\n\nEverything connects. Lead comes in, quote generates, customer signs, purchase order comes through, invoice creates itself, margins calculate in real time. One unified system instead of ten different tools and processes.\n\n**Stack:** n8n, Google Sheets, QuickBooks API, Avalara for tax, Gemini for OCR. Nothing exotic.\n\nThey were skeptical about Google Sheets as the CRM but once I showed them how it worked for their volume they got it. Sometimes simple is better than fancy.\n\nTook about five weeks of actual building plus two weeks of testing. Spent a week before that in multiple meetings just understanding their process. Where things broke down. What they'd already tried. That part matters more than people think. Most automation fails because people jump straight to building without really understanding what the business needs.\n\nThey're saving somewhere around fifteen to twenty hours a week. Already talking about expanding it... automated email sequences, vendor performance tracking, revenue forecasting.\n\nHappy to answer questions about the technical side, the pricing logic, or how I structured the discovery process if anyone's curious.",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1redj4i/this_client_paid_me_to_automate_his_telecom/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o7c0qp3",
          "author": "Fit-Sky8697",
          "text": "> Most automation fails because people jump straight to building without really understanding what the business needs. \n\nThere is so much skill in this too. There are many ways to model what the business requirements are and doing it well, documenting things clearly, and setting expectations are so important.\n\nMy only question: Why Google sheets over a DB? ",
          "score": 9,
          "created_utc": "2026-02-25 14:45:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cvgea",
              "author": "helloyouahead",
              "text": "A DB is probably overkill. Honestly. Maybe Airtable instead of Google Sheets?",
              "score": 1,
              "created_utc": "2026-02-25 17:08:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7gh3ah",
                  "author": "Fluffy_Comfortable16",
                  "text": "Yeah, I was thinking this too, why not airtable over sheets...",
                  "score": 1,
                  "created_utc": "2026-02-26 04:08:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7byjxy",
          "author": "chuanman2707",
          "text": "How much do you charge to fix his mess?",
          "score": 3,
          "created_utc": "2026-02-25 14:34:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bzbul",
              "author": "automatexa2b",
              "text": "Hey paid me almost 8k for the entire system",
              "score": 8,
              "created_utc": "2026-02-25 14:38:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7edov7",
                  "author": "CTCNCSU",
                  "text": "Just wanted to say thank you for giving an answer in the comments vs saying DM me. Good on you bro 👍🏼",
                  "score": 3,
                  "created_utc": "2026-02-25 21:17:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7cln45",
              "author": "Particular-Equal-191",
              "text": "i am just exploring this i tried cold mailing ppl but nobody wants automation how u r getting clients ?",
              "score": 2,
              "created_utc": "2026-02-25 16:23:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7fh224",
          "author": "TwoBitFoundry",
          "text": "Awesome job man. This is was a great read. I just wanted about your experience with how you went about with two parts:  \n  \n1) What was your approach for sussing out the information you needed to understand their system? Were you able to get the right people in the room? Did someone live demo what they did day to day?  \n  \n2) Did they give you access to play with real data scenarios or did you have to mock it up for the build? Then see how it did in the real world?",
          "score": 1,
          "created_utc": "2026-02-26 00:39:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h4zif",
          "author": "epidco",
          "text": "ngl discovery is the most underrated part of these projects. most ppl just wanna start building nodes but if u dont map out the logic first ur just automating a mess lol. i rly like the pragmatic stack too - sheets is fine for this volume and makes it way easier for the client to manage than a raw postgres db or smth. great work on the ocr part too gems is solid for that",
          "score": 1,
          "created_utc": "2026-02-26 07:10:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9718t",
      "title": "Built a fully automated Google Business Profile posting system with n8n - 625 images, AI captions, zero manual work",
      "subreddit": "n8n",
      "url": "https://i.redd.it/wkqfpprhuhkg1.png",
      "author": "Krishnan-sekar",
      "created_utc": "2026-02-19 18:25:33",
      "score": 55,
      "num_comments": 20,
      "upvote_ratio": 0.97,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1r9718t/built_a_fully_automated_google_business_profile/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o6a81g8",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-19 18:25:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a90rn",
          "author": "Motor_Fail3789",
          "text": "where is the code?",
          "score": 3,
          "created_utc": "2026-02-19 18:30:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ae32o",
              "author": "Krishnan-sekar",
              "text": "Just pushed it! Here you go: [https://github.com/krishnansekar17/N8N-Automations/tree/main/argos-gbp-daily-auto-post](https://github.com/krishnansekar17/N8N-Automations/tree/main/argos-gbp-daily-auto-post)\n\nWorkflow JSON + full README with node-by-node setup, prerequisite APIs, and the technical fixes I ran into (like JSON.stringify for AI captions breaking the GBP API payload).",
              "score": 5,
              "created_utc": "2026-02-19 18:53:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6abw7i",
          "author": "MasterOfDanger",
          "text": "I want ask what were the SEO results of 10 months posting? Or bigger customer engagement?",
          "score": 3,
          "created_utc": "2026-02-19 18:43:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a9n8t",
          "author": "DepartureNo2745",
          "text": "If you post a workflow, you must include a github link to the code ",
          "score": 2,
          "created_utc": "2026-02-19 18:33:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ae5ed",
              "author": "Krishnan-sekar",
              "text": "Apologies for the delay! Updated the post and here's the repo: [https://github.com/krishnansekar17/N8N-Automations/tree/main/argos-gbp-daily-auto-post](https://github.com/krishnansekar17/N8N-Automations/tree/main/argos-gbp-daily-auto-post)",
              "score": 6,
              "created_utc": "2026-02-19 18:54:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6aulnw",
          "author": "Sensitive-Piece-2449",
          "text": "Bellissimo lavoro!",
          "score": 2,
          "created_utc": "2026-02-19 20:13:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6d79hl",
              "author": "Krishnan-sekar",
              "text": "Grazie mille",
              "score": 1,
              "created_utc": "2026-02-20 04:15:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6c8pej",
          "author": "Mistic92",
          "text": "Good job and good job describing it",
          "score": 2,
          "created_utc": "2026-02-20 00:38:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fg7er",
          "author": "BBQMosquitos",
          "text": "But what if it generates terrible images?",
          "score": 1,
          "created_utc": "2026-02-20 14:39:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k1gvt",
              "author": "Krishnan-sekar",
              "text": "It doesn't generate images; it uses your own pre-shot product photos stored in Google Drive. The AI only generates the caption text. So image quality is entirely in your control.\n\nHere's what the live output looks like: [https://ibb.co/Dc3w454](https://ibb.co/Dc3w454)\n\nI pre-loaded 625 product photos, and the workflow picks the next one from the queue. The captions are the AI-generated part (GPT-4o-mini), each one unique with different angles and storytelling.",
              "score": 2,
              "created_utc": "2026-02-21 05:30:00",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6t9k6b",
              "author": "thalygutierrez",
              "text": "I agree. The possibilities make me anxious 😰 \nYour question makes me wonder if anyone in this thread has tried out Google Pomelli.",
              "score": 1,
              "created_utc": "2026-02-22 18:11:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6i3bos",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-20 22:11:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k1ltf",
              "author": "Krishnan-sekar",
              "text": "Appreciate that! Yeah, the JSON.stringify fix for the AI caption was one of those 2-hour debugging sessions that turned out to be one line of code. The GBP API is surprisingly strict about the payload format. Glad the documentation helped. That was the whole point of sharing it.",
              "score": 2,
              "created_utc": "2026-02-21 05:31:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ipwib",
          "author": "plexuses",
          "text": "Any examples of it being used?",
          "score": 1,
          "created_utc": "2026-02-21 00:16:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k1piw",
              "author": "Krishnan-sekar",
              "text": "Yes! Here are two recent auto-generated posts running live on the GBP: [https://ibb.co/Dc3w454](https://ibb.co/Dc3w454)\n\nImages are pre-loaded from Google Drive, captions are fully AI-generated (GPT-4o-mini), each one unique with mythology references, seasonal tie-ins, and product notes. Posts go out twice daily at 10 AM and 6 PM automatically.",
              "score": 1,
              "created_utc": "2026-02-21 05:31:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jmqvw",
          "author": "Mysterious_Draw_7882",
          "text": "Can I see the actual GBP applied?",
          "score": 1,
          "created_utc": "2026-02-21 03:41:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k1tor",
              "author": "Krishnan-sekar",
              "text": "Here you go, two live posts from the automation: [https://ibb.co/Dc3w454](https://ibb.co/Dc3w454)\n\nEach caption is AI-generated with a unique angle. The workflow JSON and full setup guide are on GitHub: [https://github.com/krishnansekar17/N8N-Automations/tree/main/argos-gbp-daily-auto-post](https://github.com/krishnansekar17/N8N-Automations/tree/main/argos-gbp-daily-auto-post)",
              "score": 1,
              "created_utc": "2026-02-21 05:32:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rdvfr5",
      "title": "I've transformed the way I manage my agents for Software Dev using a local N8N+Kanban style system called Bosun",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/gallery/1rdvfr5",
      "author": "Waypoint101",
      "created_utc": "2026-02-24 22:45:54",
      "score": 50,
      "num_comments": 3,
      "upvote_ratio": 0.95,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1rdvfr5/ive_transformed_the_way_i_manage_my_agents_for/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": [
        {
          "id": "o782xow",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-24 22:45:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o794b6w",
          "author": "b0red",
          "text": "Interesting approach combining n8n with a Kanban board for agent management. Taskade does something similar out of the box. AI agents live inside a workspace with Kanban, list, board, and timeline views. The agents have full project context and you can trigger them from within tasks.\n\nHow are you handling agent-to-agent handoffs in your setup?",
          "score": 2,
          "created_utc": "2026-02-25 02:11:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o795c9j",
              "author": "Waypoint101",
              "text": "Workflows have full context of the {{taskdescription}} the {{branch}}, the {{worktree}} -> etc, its all in variables, and can be handed off to a new agent trigger including launching it in the worktree directory - or multiple - so they can review, or do whatever with the current state of the task. Once it goes through your custom flows it can be merged in to the branch you configured on the task itself.",
              "score": 1,
              "created_utc": "2026-02-25 02:17:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rcgliz",
      "title": "Vibe coding is burning me out – anyone else feel this?",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1rcgliz/vibe_coding_is_burning_me_out_anyone_else_feel/",
      "author": "Deep-Strawberry1999",
      "created_utc": "2026-02-23 12:51:56",
      "score": 48,
      "num_comments": 38,
      "upvote_ratio": 0.89,
      "text": "The past few weeks I’ve been experimenting a lot with “vibe coding” – basically working with a bunch of AI agents and just switching between them to build small experimental projects.\n\nAt first it felt super powerful, but I’ve realized it’s draining me like crazy.\n\n**My day kind of looks like this now:**  \nI have multiple windows/tabs open, I keep switching between them, and whenever I see an AI has “stopped” or is waiting, I quickly throw in a new instruction. If I’m not giving them work, I feel like I’m “wasting” compute. When they generate artifacts with errors, I either report the issue back to the AI or ask it to debug itself, again and again.\n\nA lot of what the AI produces is outside my current knowledge, so I just reply AI fast and then try to point it in some direction. I’m like a supervisor (knowing little) trying to keep every powerful agent busy than a dev actually building and learning. \n\nBy the end of the day, my brain feels tired. I’ve been “busy” for hours, but I don’t feel like I actually achieved much or leveled up my skills. It’s just constant task-switching and telling AIs what to do.\n\n**Before vibe coding, my process was very different:**  \nI would carefully design a n8n workflow, read the API docs, debug errors myself, and really understand what was going on. Every day felt like real progress and growth. When something finally worked, the sense of achievement was huge. Now it feels… shallow in comparison.\n\nI’m starting to feel that this current way of working is not sustainable. I probably can’t keep going like this for long.\n\nI think part of the problem is that AI raised my expectations way too fast. Now I expect to build a brand-new website with a backend in two days, even though before AI I never would’ve thought that was realistic for me.\n\n**So I’m changing my approach:**\n\n* Slowing down my pace\n* Sticking with one main task instead of juggling 5 AI “personas”\n* When the AI is thinking or generating, I don’t rush to another window — I stay with the same task and think more deeply about the problem, the architecture, the edge cases, etc.\n\nThis has already made me feel a lot calmer. I get more time for deep thinking, I actually understand more, and the output quality is higher. It feels less like “herding AIs” and more like actually building something again.\n\nCurious if anyone else has gone through this with vibe coding / agent workflows?  \nHow do you balance using AI aggressively without burning out or losing the feeling of real progress?",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1rcgliz/vibe_coding_is_burning_me_out_anyone_else_feel/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o6y4t1m",
          "author": "Panometric",
          "text": "The human brain needs focus for sure. Perhaps put more effort into training your AI, agentic is a work in process, and there are clearly methods that do it better using skills, scaffolding and process. Instead of thrashing on the vibe product, treat every failed prompt like a bug to fix before you proceed.",
          "score": 10,
          "created_utc": "2026-02-23 13:27:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6y5wjz",
              "author": "Deep-Strawberry1999",
              "text": "good point. It's slower in current progress but faster in the long term. ",
              "score": 1,
              "created_utc": "2026-02-23 13:34:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6y3ou4",
          "author": "FalseAxiom",
          "text": "Do you *need* to be in the middle of all of that? Couldn't you manage just one that understands the context of the project and let it do the task switching?",
          "score": 6,
          "created_utc": "2026-02-23 13:21:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6y4wts",
              "author": "Deep-Strawberry1999",
              "text": "I runs 5 projects at the same time but not for 1 project with 5 tasks. Not sure whether this could be done for now. ",
              "score": 3,
              "created_utc": "2026-02-23 13:28:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6yt512",
                  "author": "FalseAxiom",
                  "text": "Oh, hmmmmm, yea that seems like a much more complex lift.",
                  "score": 3,
                  "created_utc": "2026-02-23 15:38:12",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o765pas",
                  "author": "RemoteCapital167",
                  "text": "You could still spin up an orchestrator type agent, that operates as your middle man.",
                  "score": 2,
                  "created_utc": "2026-02-24 17:27:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6y2o5x",
          "author": "idkbm10",
          "text": "Happens to us all\nNothing much to do\nJust document yourself on what si does and try to supervise everything \nThat's all folk",
          "score": 4,
          "created_utc": "2026-02-23 13:14:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6y51pt",
              "author": "Deep-Strawberry1999",
              "text": "maybe we have to accept it at current AI area. ",
              "score": 0,
              "created_utc": "2026-02-23 13:29:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6y7la2",
          "author": "mazdarx2001",
          "text": "Bro, you and me are the same!  I’m trying to figure out the cause. For me, I think it’s because every idea that I can think of is no longer a dream, I can just make it now. So I when 5 projects going at the same time and 5 more on deck, wash on a unique idea that doesn’t exist or a spin of one that does. We need to hang out, or maybe that will amplify things even worse!",
          "score": 3,
          "created_utc": "2026-02-23 13:44:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yekam",
              "author": "Deep-Strawberry1999",
              "text": "wow, I would say sometimes less is more makes more sense.",
              "score": 1,
              "created_utc": "2026-02-23 14:23:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6yvi4e",
          "author": "Plenty_Attorney_6658",
          "text": "Just take a break",
          "score": 3,
          "created_utc": "2026-02-23 15:49:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o724i6x",
          "author": "JustTinkeringAI",
          "text": "I feel you. As a dev with 10+ years under my belt, jumping into 'vibe coding' gave me actual vertigo and a sense of nausea. While the ideas were flowing, it was a breathtaking trip - almost addictive.\n\nI eventually reached a point where I could slow down, but until then... man, it was intense. I guess we’ll get used to it eventually, but right now we’re still in that phase where we have no real landmarks or points of reference. We're basically flying blind at Mach 2.",
          "score": 3,
          "created_utc": "2026-02-24 01:28:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72util",
              "author": "Deep-Strawberry1999",
              "text": "exactly, the important is to keep the balance between the efficiency and your comfortable feeling.",
              "score": 1,
              "created_utc": "2026-02-24 04:06:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6y8dvi",
          "author": "kylethenerd",
          "text": "I am struggling with project juggling as well. Something like 7 AI ideas in the pipe right now, but seeing them through is a pain. Im trying to focus on something that will bring a little income, so I could hire resources for the rest of the projects (art assets). I did just learn you can use Claude with Unity directly so maybe I can get a game idea out.",
          "score": 2,
          "created_utc": "2026-02-23 13:48:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yfudb",
              "author": "Deep-Strawberry1999",
              "text": "Oh, I played with unity 1 month ago and gave it up finally. The difficult part is not build something from scratch and usable, it's finishing the left 10% parts like fixing bugs, resolving performance, stability issues etc.   \n  \nAnd I read a report and gave it up quickly. It saying something like steam has x new games every day and only less than y% game could get more than z monthly revenue. It's already red sea. ",
              "score": 1,
              "created_utc": "2026-02-23 14:30:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ybsed",
          "author": "Mysterious_Draw_7882",
          "text": "The same applies when working with people.",
          "score": 2,
          "created_utc": "2026-02-23 14:08:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yg4lb",
              "author": "Deep-Strawberry1999",
              "text": "yes, and I'm more comfortable working with people  as it's in a slower pace. Not liking AI, may switching tasks in minutes. ",
              "score": 1,
              "created_utc": "2026-02-23 14:32:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ycysl",
          "author": "Alarming-Work6529",
          "text": "Just don't expect the entire workflow from an AI... It won't work. Get the idea and make it yourself.\n\nI had more success with Code nodes and AI though.",
          "score": 2,
          "created_utc": "2026-02-23 14:14:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yggxm",
              "author": "Deep-Strawberry1999",
              "text": "You like two weeks ago me. But one friend told me AI could build, run and test the full workflow and you need to try it. I tried it and it works well. Then everything changed. ",
              "score": 1,
              "created_utc": "2026-02-23 14:33:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6yh4cq",
                  "author": "Alarming-Work6529",
                  "text": "How? Is it n8n cloud or self hosted? Which AI platform?",
                  "score": 1,
                  "created_utc": "2026-02-23 14:37:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6zk6y3",
          "author": "Grouchy-Culture-4062",
          "text": "The same by me. I think it may be the combination of being only partly involved, not in full flow and at the same time some frustration / anxiety I don’t have it in control and it can break in many unpredictable ways. (Yes, I’m also doing stuff I wouldn’t be capable of doing without AI or that would take me so long that I just wouldn’t that time.)",
          "score": 2,
          "created_utc": "2026-02-23 17:44:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zmhmp",
          "author": "ConspicuousSomething",
          "text": "I’ve been doing a lot of this lately and, honestly, it’s been making me legitimately angry! \n\nAlready having ChatGPT Pro, I’ve been using that, and while it works, it also has a tendency to make everything really complicated if you let it come up with its own approach. In particular it’ll default to Code nodes instead of making use of other nodes out of the box. \n\nI’ve had much more success if I figure out how I want my workflow to work, getting it as far as I can on my own, then asking the AI for very specific help.",
          "score": 2,
          "created_utc": "2026-02-23 17:55:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71m2zu",
              "author": "Deep-Strawberry1999",
              "text": "Yeah, it feels good to ask ai to do something within your knowledge and feels bad if it’s out of your understanding and report strange errors.",
              "score": 1,
              "created_utc": "2026-02-23 23:44:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6zo8g5",
          "author": "ProperCelery7430",
          "text": "Not so much the vibe coding, more the sales process (even when semi automated)",
          "score": 2,
          "created_utc": "2026-02-23 18:03:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zpdmq",
          "author": "Snickers_B",
          "text": "This is kinda my mantra for the coming year. K on me thing at a time. This is hard cuz AI has led me to believe that doing many at once is the most optimal solution and it’s not. At least not for me anymore.",
          "score": 2,
          "created_utc": "2026-02-23 18:08:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zr59g",
          "author": "Rude-Map-459",
          "text": "Is anyone facing multiple request issue with whatsapp bot in n8n",
          "score": 2,
          "created_utc": "2026-02-23 18:16:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74f4an",
          "author": "Whack_Moles",
          "text": "I've tried vibecoding a couple of times, but every time I ended up writing the code myself, and use AI for some debug if needed.",
          "score": 2,
          "created_utc": "2026-02-24 12:04:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79g4ay",
          "author": "SnooEagles2610",
          "text": "Vibe coding is an intern building and Access DB and leaving a sh!t dump for real sys admins to have to deal with. The wheal turns… nothing ever changes…",
          "score": 1,
          "created_utc": "2026-02-25 03:17:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yvgjq",
          "author": "Plenty_Attorney_6658",
          "text": "How about try coding it yourself",
          "score": 1,
          "created_utc": "2026-02-23 15:49:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yzn2o",
              "author": "Deep-Strawberry1999",
              "text": "I don’t know how to coding for a website and it may take me 1 month to learn and achieve what 1 day I got via AI. \n\nI suspect whether it’s worth the efforts to learn coding by myself.",
              "score": 1,
              "created_utc": "2026-02-23 16:08:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6yzr7x",
                  "author": "Plenty_Attorney_6658",
                  "text": "I was joking bro! 💀",
                  "score": 2,
                  "created_utc": "2026-02-23 16:09:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rbheny",
      "title": "Roadmap to Learn n8n – How Long Does It Take to Get Good?",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1rbheny/roadmap_to_learn_n8n_how_long_does_it_take_to_get/",
      "author": "archimindai",
      "created_utc": "2026-02-22 09:20:41",
      "score": 40,
      "num_comments": 16,
      "upvote_ratio": 0.94,
      "text": "Can anyone please give me a proper roadmap to learn n8n? I want to understand what I should learn step by step and what type of things I should focus on.\nAlso, how much time does it usually take to gain good working knowledge of n8n?",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/n8n/comments/1rbheny/roadmap_to_learn_n8n_how_long_does_it_take_to_get/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o6qur2b",
          "author": "AutoModerator",
          "text": "**Need help with your workflow?**\n\nTo receive the best assistance, please share your workflow code so others can review it:\n\n**Acceptable ways to share:**\n\n* Github Gist (recommended)\n* Github Repository\n* Directly here on Reddit in a code block\n\nIncluding your workflow JSON helps the community diagnose issues faster and provide more accurate solutions.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-22 09:20:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6sbz89",
          "author": "Available_Cupcake298",
          "text": "skip the roadmap. pick one annoying task you actually do every day and try to automate it. you'll learn way faster fumbling through a real problem than watching tutorials. most people spend weeks learning the tool and then can't think of what to build.",
          "score": 7,
          "created_utc": "2026-02-22 15:40:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xkc36",
              "author": "Equivalent_Title_299",
              "text": "incredible advice but where I can found real problems that I will go and solve it?\n\n",
              "score": 1,
              "created_utc": "2026-02-23 10:53:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6rz4wf",
          "author": "mallrat32",
          "text": "There are a lot of videos that jump into AI way too soon. That made it incredibly daunting for me and I almost gave up\n\nWhat helped me was to try and figure out what I wanted to automate based on things I find tedious \n\nRight now the most complex tools I’m using are HTTP requests and code nodes which I do use an LLM to help write\n\nOnce you understand the syntax of the data and what nodes are available, it makes a lot more sense and the best way to do that is to fumble through your own projects which will take time",
          "score": 6,
          "created_utc": "2026-02-22 14:35:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rlos4",
          "author": "automator71",
          "text": "Learning n8n is less about coding and more about understanding data flow and workflow.\nIt depends on your current skill level, if you are coming from tech background, it'll take around 20-25 hrs, if not, 3x or 4x time.\nAlso, once you've learnt it, build your own workflows, then you'll learn the most.",
          "score": 5,
          "created_utc": "2026-02-22 13:16:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wfxxa",
          "author": "shajid-dev",
          "text": "Alright here it is. I don't want wanna bore you with advices. You can get into the topics right away. These are my resources in terms of learning n8n for non-coder or coder. These resources will teach you n8n softly, from beginner stage to advance stage with upto date information. \n\nTheories Based for a beginner\n\n\\- How to install n8n locally (2026) - [https://theowllogic.com/installing-n8n-setup-locally](https://theowllogic.com/installing-n8n-setup-locally)  \n\\- Your first Hello World Workflow - [https://theowllogic.com/first-hello-world-n8n-workflow](https://theowllogic.com/first-hello-world-n8n-workflow)  \n\\- n8n Workflows, Nodes and Data-flow - [https://theowllogic.com/n8n-workflow-nodes-data-flow](https://theowllogic.com/n8n-workflow-nodes-data-flow)  \n\\- Webhooks in n8n for Beginners - [https://theowllogic.com/webhook-in-n8n-explained](https://theowllogic.com/webhook-in-n8n-explained)  \n\\- How to Handle API Rate Limits in n8n - [https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n](https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n)  \n\\- How to Handle Errors Like a Pro in n8n - [https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n](https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n)  \n\\- n8n Expressions Complete Guide - [https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n](https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n)  \n\\- How to Build Condition Logics in n8n (IF/Switch) - [https://theowllogic.com/conditional-logic-in-n8n](https://theowllogic.com/conditional-logic-in-n8n)  \n\\- How to Use n8n Loop Over Items - [https://theowllogic.com/how-to-use-loop-in-n8n](https://theowllogic.com/how-to-use-loop-in-n8n)  \n\\- How to Use Sub-Workflows in n8n - [https://theowllogic.com/n8n-sub-workflows](https://theowllogic.com/n8n-sub-workflows)\n\nWorkflows Based  \n\\- How to Plan a n8n Workflow - [https://theowllogic.com/plan-n8n-workflow](https://theowllogic.com/plan-n8n-workflow)  \n\\- 50 Boring Tasks You Can Automate With n8n - [https://theowllogic.com/automate-boring-tasks-n8n](https://theowllogic.com/automate-boring-tasks-n8n)  \n\\- How to Build a Follow-up Email Sequence - [https://theowllogic.com/n8n-followup-email](https://theowllogic.com/n8n-followup-email)  \n\\- How to Build an n8n AI Agent (Step by Step) - [https://theowllogic.com/n8n-ai-agent-workflow](https://theowllogic.com/n8n-ai-agent-workflow)",
          "score": 3,
          "created_utc": "2026-02-23 04:46:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tpeso",
          "author": "emmettvance",
          "text": "skip the roadmap and just pick one manual task you do every day.. learning by trying to force an actual problem to work will teach you faster than watching ten hours of tutorials.. you will be functional in a week if you stick to basic triggers and the http request node..",
          "score": 2,
          "created_utc": "2026-02-22 19:25:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tqpnk",
          "author": "Available-Claim2445",
          "text": "Begin by trying to automate a specific task, try different nodes and connecting them with each other. I recommend watching Nate Herk as he has a ton of legitimately good tutorials. I had a really light tech background and picked it up within days. There isn’t a proper step by step process on learning; How fast or slow you learn is entirely up to you.",
          "score": 2,
          "created_utc": "2026-02-22 19:32:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ud8oe",
          "author": "psychonaut_eyes",
          "text": "I dont think you need a roadmap, just start doing some workflows to help with your life, like summarizing mails, an personal agent, so on.  with that you will eventually learn how stuff works and get more experience",
          "score": 2,
          "created_utc": "2026-02-22 21:25:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6r3cih",
          "author": "Acceptable_Host_7531",
          "text": "RemindmMe! 2 days",
          "score": 1,
          "created_utc": "2026-02-22 10:43:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rxcqn",
          "author": "adminsattitude",
          "text": "watch some youtube videos about fundementals of n8n, then ask some ai to give you some tasks you can then practice accomplishing with n8n. you can using opsily to host one n8n and start testing with it ",
          "score": 1,
          "created_utc": "2026-02-22 14:25:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wu791",
          "author": "Deep_Lifeguard_5039",
          "text": "u dont need n8n, you can just spend $10-20 on copilot or Cursor and get the same result",
          "score": 1,
          "created_utc": "2026-02-23 06:42:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xw5pi",
          "author": "Competitive_Cap9325",
          "text": "I will say Nate Herk’s on YouTube is SUPER helpful. He helped me a TON. Watch a few of his YouTube videos to get a feel for his style to see if you like him. I think he’s a great no-knowledge teacher. Try it; I think it’ll help you a lot.",
          "score": 1,
          "created_utc": "2026-02-23 12:31:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6sgneh",
          "author": "theLewisLu",
          "text": "It’s a lot of work to learn n8n. So when OpenClaw came out, I used it to run n8n. Works well for me.",
          "score": 0,
          "created_utc": "2026-02-22 16:00:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rb3p4",
          "author": "seevobuffet",
          "text": "https://youtu.be/jCTADO1A6B0\nWatch this vid to understand how to land your first client with n8n",
          "score": -2,
          "created_utc": "2026-02-22 11:55:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra5oiw",
      "title": "The skill that made us valuable (building workflows) is about to become a one-line prompt. Now what?",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1ra5oiw/the_skill_that_made_us_valuable_building/",
      "author": "Imaginary-Level1923",
      "created_utc": "2026-02-20 19:56:00",
      "score": 39,
      "num_comments": 24,
      "upvote_ratio": 0.92,
      "text": "n8n recently shipped \"AI Workflow Builder\" ([https://docs.n8n.io/advanced-ai/ai-workflow-builder/](https://docs.n8n.io/advanced-ai/ai-workflow-builder/)) where you describe what you want in plain English and it generates the workflow for you.\n\nZapier launched Agents in beta doing essentially the same thing. OpenAI dropped AgentKit with a visual agent builder at DevDay. And n8n 2.0 now lets you turn any workflow into a \"tool\" that an AI agent can call on its own when it decides it needs to.\n\nThe direction is pretty clear. \\~Two years from now, most people won't be dragging nodes around a canvas. They'll describe what they want and an agent will build it, test it, and probably fix it when it breaks.\n\nSo what actually happens to the skill of building automations? Right now knowing how to wire up a webhook to a database to an API is valuable because it's hard enough that most people can't do it. But if a prompt gets you 80% of the way there, does the remaining 20% become the only thing that matters? Things like knowing which edge cases will break in production, understanding rate limits, designing error handling that doesn't silently fail.\n\nI keep going back and forth on this. Part of me thinks the \"automation builder\" role just shifts from construction to architecture. You stop being the person who builds the workflow and start being the person who knows what the right workflow even is. The other part of me looks at how fast these tools are improving and wonders if even that gets automated away.\n\nCurious where you all land on this. Are you already using the AI builder features in your daily work? Has it actually replaced manual building for you or is it more of a starting point you still heavily edit?",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1ra5oiw/the_skill_that_made_us_valuable_building/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o6hi4zy",
          "author": "Cheap-Refrigerator92",
          "text": "I personally think as someone who just started getting into automating things people still won't do it. On their own it's going to be people like you still.\n\nI find it fun to vibe code/automate/ build things but there is still some complexity behind it that most people aren't going to take the time to figure out\n\n e.g supabase has 4 separate API keys took me like a hour my first time to figure out which one just view which ones edit rows etc.\n\nLet alone just building a process in general in my recent project I was uploading like 50+ ranging from 2-50mb each compressed folders and n8n would crash with to much data so had to figure out the loop node then the code node would crash with to much data figure out the set node getting it to filter correctly and update correctly I'm not smart but I'm not dumb either still took me like 3 days with all the crashes and errors and changing the flow to get it functional. \n\nI guess what I'm saying is long story short is I don't think much well change because \n1) people are lazy would rather pay someone to do \n2) people trust others who are experts or know more \n3) if they do start I bet alot give up after the first 3 failures and having to restart \n4) some people already don't trust AI let alone trust it enough to fully build something for their/a company that involves sensitive data or any data in general really\n5) alot of AI don't like you posting API keys in them at least that I have seen/done Gemini and open ai both would say delete the key you pasted it here it's exposed (I have to assume that they would fix that but well that be public then? Well that be used to train new models still?) \n\nJust my opinion I'm a landscaper personally I just like to build things for fun just started a few months ago just something to do after work.\nI personally plan to experiment around with n8ns Agent soon just to see what it's all about",
          "score": 13,
          "created_utc": "2026-02-20 20:25:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6hwm4j",
              "author": "Imaginary-Level1923",
              "text": "The Supabase API keys thing is such a good example. That's the kind of stuff no AI prompt is going to solve for you because you don't even know what to ask until you're already stuck. And yeah, 3 days of crashes and flow changes to handle large file uploads is exactly the gap between \"AI built me a workflow\" and \"I have a workflow that actually works\".   \n  \nI guess the real solution long term is agent-to-agent communication. Like Supabase has its own agent, n8n has its own agent, and they just talk to each other. The n8n agent asks the Supabase agent which key it needs, gets the right permissions, configures the connection. No more digging through docs for an hour. We're not fully there yet but that's clearly where it's heading.   \n  \nAlso respect for doing this after landscaping shifts, that's a solid hobby upgrade.",
              "score": 3,
              "created_utc": "2026-02-20 21:37:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6in2ye",
                  "author": "Cheap-Refrigerator92",
                  "text": "That would be interesting to see I agree 100% only way it could work would need a lot of copya on board tho I think if they are going to make it work it has to be that \n\nYes even just the little stuff I personal think AI just doesn't have good critical think ability Gemini gave me a lot of not productive ways to try and fix a file being to big  and crashing n8n after like 5 reworking the flow I finally realized I could just copy the file structure and past it into another  folder (granted that's not automated but needed to do it only 1 to catch up on a years worth of data) but just another example \n\nI would like to see it on a canvas to see where things break that would be terrible if there was no canvas to see where things are breaking and just blinding feeding AI prompts \n\nThanks yeah a lot better then video games lol",
                  "score": 2,
                  "created_utc": "2026-02-21 00:00:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6id7mz",
              "author": "misterjoshmutiny",
              "text": "This is my thinking behind it, as well. Building automations with a canvas was already not wildly complicated, in the first place, and companies STILL paid people to do it for them and keep it updated and running. They will continue to do that, even if it is someone just writing a prompt that generates the workflow, because it will still be cheaper than paying someone’s yearly salary and benefits in the long run.",
              "score": 2,
              "created_utc": "2026-02-20 23:03:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6io0i2",
                  "author": "Cheap-Refrigerator92",
                  "text": "I agree but when just learning there are many frustrating things in n8n that if you aren't fully committed or doing it for like fun your just going to give up quickly \n\nYeah for sure a lot cheaper! And less time consuming on their end",
                  "score": 1,
                  "created_utc": "2026-02-21 00:05:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6hft2l",
          "author": "buttplumber",
          "text": "Well, I’m already half way there, as It’s AI that tells me what nodes to put and how to set them up. And if something does not work, we troubleshoot together. I admire people that build all of that themselves from scratch, but I don’t have time and skill to learn all that. So I say what I need and the code is ready.",
          "score": 3,
          "created_utc": "2026-02-20 20:14:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6hvozt",
              "author": "Imaginary-Level1923",
              "text": "This is kind of exactly what I mean though. The \"skill\" is already shifting from knowing how to configure nodes to knowing what to ask for. Curious, when the AI sets things up for you and something breaks, do you find the troubleshooting part is where you actually learn the most about how n8n works? Because that's the part I don't think AI fully replaces yet.",
              "score": 2,
              "created_utc": "2026-02-20 21:32:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6lhvjy",
                  "author": "buttplumber",
                  "text": "Yes, that’s exactly it. What I’m actually learning the most isn’t how to configure nodes, it’s what questions to ask and what context to provide.\nThe real skill shift for me is being precise about inputs, outputs, error messages, and environment details. Once the AI has the right context, the fix is usually straightforward.\n\nI’ve started experimenting with Projects in ChatGPT, keeping structured markdown files that describe my workflows, and even using Git for versioning with AI helping me there too. So when I open a new troubleshooting chat, I can provide the full context and it already understands what I’m working with.\n\nThat’s where the biggest improvement in troubleshooting accuracy comes from.",
                  "score": 1,
                  "created_utc": "2026-02-21 13:24:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6hkupv",
          "author": "Thick-Protection-458",
          "text": "\\> So what actually happens to the skill of building automations?\n\nSame as all kinds of programming, essentially. Because that was a programming, even if specific kind.\n\n\\> Part of me thinks the \"automation builder\" role just shifts from construction to architecture\n\nBingo. ",
          "score": 3,
          "created_utc": "2026-02-20 20:38:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ib55p",
          "author": "DruVatier",
          "text": "Massive difference in knowing HOW to build workflows and knowing WHICH workflows to build.",
          "score": 2,
          "created_utc": "2026-02-20 22:52:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6oarlh",
              "author": "jzap456",
              "text": "how do u know which ones to build?? ask ppl to tell you?",
              "score": 1,
              "created_utc": "2026-02-21 22:15:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6id613",
          "author": "MrDork",
          "text": "Have you tried to set up anything with AI at scale?  It gets to a certain point, and it starts falling apart dramatically.  Now, a lot of that can be improved on by optimizing and tweaking the prompts.  But it still needs someone to keep the guardrails on.  We're not at the point where a layman can say \"Build a custom accounting platform for my 200 employee company.\" walk away, and come back to a finished, polished product.  Until that day comes, and it may never come (at least is this form), they will still need experienced humans involved.  Look at it on the positive side, less work and more volume for current developers.  Of course, the humans end up being the bottleneck in this scenario, but until AI \"just works\", that's what is going to keep you relevant. ",
          "score": 2,
          "created_utc": "2026-02-20 23:03:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xzm6k",
          "author": "inthebinary",
          "text": "The skill that makes you valuable has never been building workflows, it's been understanding bottlenecks in businesses and implementing solutions for them.\n\nThe tools will change but new problems will crop up 🙂",
          "score": 2,
          "created_utc": "2026-02-23 12:55:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i599h",
          "author": "seqcmd",
          "text": "Even if you Use AI you need to know what you want to achieve",
          "score": 1,
          "created_utc": "2026-02-20 22:21:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6iyly2",
          "author": "rekt_by_inflation",
          "text": "The value that we bring isn't so much the building of workflows, it's understanding what the client actually needs and being able to translate that into something.\n\nWe have to decipher what they need vs what they want",
          "score": 1,
          "created_utc": "2026-02-21 01:07:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jhrg3",
          "author": "hardcherry-",
          "text": "I let my AI leverage n8n workflows when necessary while building larger systems.",
          "score": 1,
          "created_utc": "2026-02-21 03:08:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jjjqe",
          "author": "UniForceMusic",
          "text": "Then its the skills to go beyond N8N.\n\nWhat if the system you're interfacing with has a ridiculous api interface? Would you know how to set up a little VPS to run a script that does the interfacing for you on webhooks?\n\nIf your workflow required an expensive API. Would you know how to recreate that functionality?\n\nIt's \"going beyond the prompt\" that will set you apart",
          "score": 1,
          "created_utc": "2026-02-21 03:20:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6l3hfp",
          "author": "Practical-Fox-4741",
          "text": "I view it as a shift from \"Construction\" to \"Architecture\n\nThe AI is great at building the \"happy path\" (when everything works perfectly). But as you mentioned, the real value is in handling the edge cases, API rate limits, and complex error handling logic.\n\nI treat the AI builder like a junior developer: I let it build the initial draft to save time, but I still have to review, optimize, and fix the logic. The \"what to build\" is becoming valuable than the \"how to build",
          "score": 1,
          "created_utc": "2026-02-21 11:29:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lliz4",
          "author": "logicru",
          "text": "That won't happen because it is not their goal. See n8n's implementation of this builder tool for example.\n\nYou start with 50 credits on a $20 plan. Each interaction will cost you 1 credit. \n\nIt is literally impossible to make a flow in 2-3 prompts. Yes, it is possible to do so if you really know n8n flows well. If you know it that well, then why would you get the $20 plan?",
          "score": 1,
          "created_utc": "2026-02-21 13:47:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ln7j5",
          "author": "Evanescent_contrail",
          "text": "Is this available on self hosted versions as well?",
          "score": 1,
          "created_utc": "2026-02-21 13:57:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ob3wf",
          "author": "jzap456",
          "text": "my guess is prompt to code is the next frontier IF the user experience is smooth and there’s no complexity (eg the app asks you to enter your supabase key without calling an AI model)\n\nanother interesting angle to this is running everything locally, with local AI models",
          "score": 1,
          "created_utc": "2026-02-21 22:17:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78b6f8",
          "author": "kerbion",
          "text": "Funny enough im no longer seeing this as an issue. I know that if AI tried to make my workflows it would take long enough to give it enough context to produce something accurate and on top of that, ai created technical flows need to be able to understood by a human at the end of the day for debugging and any shifts in the flow later. \n\nIf anything this will help me get the initial parts of a workflow figured out and I can get the more complex aspects finished. And maybe ill even be able to prompt chatgpt less for my code nodes lool",
          "score": 1,
          "created_utc": "2026-02-24 23:29:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6j6s5a",
          "author": "Useful_Disaster_7606",
          "text": "It feels like a loss of identity because we used to define ourselves by the 'build.'\n\nBut think of it this way, if a doctor uses AI to do 80% of the heavy lifting, their expertise is what prevents the 20% of errors that cost lives.\n\nThe same applies here. Our value is shifting from **building the machine** to **guaranteeing the outcome.** We’re moving from being the ones in the trenches to being the ones who decide where the trenches should be. Clients don't pay for the speed; they pay for the guarantee and reliability.\n\nAI may be amazing at creating sophisticated workflows but it does not replace the learned experience and intuition of an expert that ***knows*** where it could go wrong.\n\nAlso this may seem ironic since I needed AI's assistance in writing this comment but I simply used it to refine my analogy and then that's where I added my personal touch.",
          "score": 0,
          "created_utc": "2026-02-21 01:59:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jpcsm",
          "author": "DGC_David",
          "text": "Nothing new.... N8N is a solution to a problem, it is not a skill, it's literally Zapier and I've seen 65 yr old Accountants use Zapier. N8N as a skill is like saying I'm talented at sharpening my pencil. I'm sure it has its niche moments of usage but it's not a selling point about yourself.",
          "score": 0,
          "created_utc": "2026-02-21 03:59:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcktch",
      "title": "How earn money with N8n and what should i learn?",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1rcktch/how_earn_money_with_n8n_and_what_should_i_learn/",
      "author": "camilo_bouchard",
      "created_utc": "2026-02-23 15:41:50",
      "score": 37,
      "num_comments": 18,
      "upvote_ratio": 0.82,
      "text": "Hey everyone!\n\n​I’ve been diving deep into n8n lately, and I’m blown away by the flexibility of the self-hosted approach and the node-based logic. I’m at the point where I want to transition from just \"tinkering\" to actually making good money as an automation consultant/developer.\n\n​For those of you already successfully billing clients or running a business around n8n: What is the roadmap to high-ticket mastery?\n\n​I’d love to get your insights on:\n\n​Essential Tech Stack: Beyond n8n, what are the \"must-have\" tools? (e.g., PostgreSQL for data persistence, Supabase, Docker for scaling, or specific APIs like OpenAI/Anthropic?)\n\n​High-Value Skills: What specific tasks are clients actually willing to pay a premium for? (Is it complex CRM migrations, custom API wrappers, AI-driven agents, or something else?)\n\n​The \"Secret Sauce\": Are there specific programming languages that take your workflows to the next level? I’m assuming JavaScript/TypeScript for Function nodes is a given, but what else?\n\n​Business Model: Do you find more success with project-based builds, monthly maintenance retainers, or building \"Automation-as-a-Service\" products?\n\n​I'm ready to put in the work, I just want to make sure I'm practicing the right scales. Any advice, \"gotchas,\" or resources you wish you knew when you started would be massive.\n\n​Thanks in advance! 🛠️",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/n8n/comments/1rcktch/how_earn_money_with_n8n_and_what_should_i_learn/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o6ytwiw",
          "author": "AutoModerator",
          "text": "**Need help with your workflow?**\n\nTo receive the best assistance, please share your workflow code so others can review it:\n\n**Acceptable ways to share:**\n\n* Github Gist (recommended)\n* Github Repository\n* Directly here on Reddit in a code block\n\nIncluding your workflow JSON helps the community diagnose issues faster and provide more accurate solutions.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-23 15:41:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zi64j",
          "author": "Available_Cupcake298",
          "text": "honestly the tech stack matters way less than you think. most clients don't care if you use postgres or supabase or whatever - they care that their problem gets solved.\n\nwhat actually gets you paid: figuring out what's worth automating. a lot of people can build workflows. way fewer can look at a business and say 'this right here is costing you 10 hours a week and i can fix it.'\n\nthe premium stuff isn't complex CRM migrations. it's the boring repetitive stuff that's eating someone's time. data entry. report generation. syncing systems that should've been connected years ago.\n\nlearn enough docker and databases to not get stuck. but spend more time understanding common business processes. invoicing, lead management, inventory updates. that's where the money is.",
          "score": 27,
          "created_utc": "2026-02-23 17:35:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6zvr40",
              "author": "RedoHawk",
              "text": "Solid advice thanks for that \n\n\nWhere and how do you find clients?\n\n\nI feel like I don't have issues making automation that works, I did it for myself and my content creation but I struggle to know where to find those clients ...\n\n\nLike.. I don't know it's confusing between Upwork, cold calls, not sure \n\n\nI love automation but really genuinely don't know who to help ",
              "score": 2,
              "created_utc": "2026-02-23 18:37:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o70klzj",
                  "author": "Available_Cupcake298",
                  "text": "honestly i've had the most luck just talking to people i already know. someone mentions they're spending hours copy-pasting data or manually updating spreadsheets, that's your opening.\n\nupwork can work but you're competing on price with people in cheaper markets. cold outreach feels gross and has like a 1% response rate. waste of time.\n\nwhat's worked better: join communities where business owners hang out. local chambers of commerce, industry facebook groups, even linkedin. don't pitch. just be helpful when people complain about repetitive tasks. they'll ask what you do eventually.\n\nand honestly? most of my clients came from one good project that someone told their friend about. do one thing really well for someone, make their life noticeably easier, and referrals start happening.",
                  "score": 4,
                  "created_utc": "2026-02-23 20:33:28",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o703cgr",
                  "author": "Southern_Audience120",
                  "text": "I started using GigUp to automate the search. It scans for jobs that actually fit my profile and sends alerts, so I only see the good stuff. It cut out all the noise and let me focus on the work.",
                  "score": 2,
                  "created_utc": "2026-02-23 19:11:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6zxwa0",
              "author": "ConstructionOld8446",
              "text": "This. There's a key difference between building complex automations that look cool on paper with dead-simple automations that actually solve a business problem. I think jumping off of what available cupcake already wrote - there's so much buzz around tooling and data enrichment and bla bla bla, if you can demonstrate systems-level thinking paired with strong business acumen you will be in a great spot. ",
              "score": 2,
              "created_utc": "2026-02-23 18:47:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o75iicc",
              "author": "camilo_bouchard",
              "text": "Whoa dude , you were very clear and thanks for your advices, im grateful for your comment",
              "score": 1,
              "created_utc": "2026-02-24 15:42:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6z66u9",
          "author": "EaZyRecipeZ",
          "text": "Learn how to sell the product or find a client even if it's SAAS or just a single client. After you can do that, if the project is too big for you, you can always outsource it.",
          "score": 3,
          "created_utc": "2026-02-23 16:39:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6zsm8c",
              "author": "Intelligent-Ruin-74",
              "text": "How exactly can a person recognise a potential client and  pitch them for the product.",
              "score": 1,
              "created_utc": "2026-02-23 18:23:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6zt0ej",
                  "author": "EaZyRecipeZ",
                  "text": "it's either the client interested to pay or not to pay for the service.",
                  "score": 2,
                  "created_utc": "2026-02-23 18:25:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6znz1v",
          "author": "Winter-Data-4471",
          "text": "Where have you learned n8n?",
          "score": 2,
          "created_utc": "2026-02-23 18:02:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o732b7h",
              "author": "Future_Bit_9576",
              "text": "Same question, can someone recommend for training/workshops ahout n8n?",
              "score": 1,
              "created_utc": "2026-02-24 04:58:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6zbljl",
          "author": "Away-Sea7790",
          "text": "What solution can you offer with the use of n8n? That will always be the question",
          "score": 1,
          "created_utc": "2026-02-23 17:04:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73dw0t",
          "author": "No-Main-6177",
          "text": "I think n8n is a low coding solution,but it requires a lot refinement,otherwise it won’t work easily",
          "score": 1,
          "created_utc": "2026-02-24 06:30:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73fhju",
          "author": "hansei-Kaizen",
          "text": "If you have business experience in any area then that’s where you should start. Maybe you have connections you can ask about their pain points. \n\nI do B2B solutions in n8n but I had 15 years of experience in my business area before the switch. Just landed my first client today. \n\nIt’s much easier to reach out to people who have already heard your name.",
          "score": 1,
          "created_utc": "2026-02-24 06:44:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73mqbk",
          "author": "autodoc_founder",
          "text": "If you want to make real money with n8n, shift your mindset from “building cool workflows” to “reducing business risk.”\n\nClients don’t pay premium for nodes. They pay for reliability, clarity, and outcomes.\n\nHigh-ticket work usually isn’t flashy AI agents. It’s messy stuff: CRM migrations, fixing broken automations, replacing fragile Zap setups, connecting legacy systems, cleaning up duplicated data. Basically inheriting chaos and making it stable.",
          "score": 1,
          "created_utc": "2026-02-24 07:49:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73u2yz",
          "author": "rickydwrecked",
          "text": "How do you guys approach the case of having to set up some additional tools/databases/servers for the client if a project needs that. Do you set it up on your side and charge them for using it, or do you tell them that they’re going to need some additional setup which is going to cost them X monthly?",
          "score": 1,
          "created_utc": "2026-02-24 08:59:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76zc9z",
          "author": "vvsleepi",
          "text": "clients don’t really care that you use n8n, they care that you save them time or money. so focus first on understanding business problems instead of just mastering every node. technically, you should learn solid javascript for function nodes, understand APIs really well (auth, webhooks, REST), know basic databases like postgres or supabase, and be comfortable with docker and proper error handling. that alone makes you way more valuable than just being a “workflow builder.” what clients usually pay for is connecting tools that don’t talk to each other, automating lead flow, reducing manual data entry, cleaning messy data, and adding simple AI steps like summaries or tagging. start with project-based work, and once you understand a client’s system, move them to a small monthly maintenance plan for stability.",
          "score": 1,
          "created_utc": "2026-02-24 19:40:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdoa7m",
      "title": "Best stack for internal company knowledge bot? (100 PDFs, 4 users, ~$10/month)",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1rdoa7m/best_stack_for_internal_company_knowledge_bot_100/",
      "author": "ShortStandard472",
      "created_utc": "2026-02-24 18:27:58",
      "score": 36,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "\n\nHey everyone, looking for real-world advice on the best approach for this use case:\n\n**The setup:**\n- 4 employees asking questions in Spanish\n- ~100 internal PDF documents (manuals, policies, procedures)\n- Bot must answer ONLY from those PDFs — no hallucinations\n\n**What I want to know:**\n1. What tool/framework would YOU use for this in 2026? \n2. No-code/low-code vs custom code — worth it for something this small? \ngotchas or lessons learned from similar projects?\n\nNot looking for the \"perfect\" solution, just what actually works in production for a small internal team. Thanks!",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/n8n/comments/1rdoa7m/best_stack_for_internal_company_knowledge_bot_100/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o76jb0m",
          "author": "AutoModerator",
          "text": "**Need help with your workflow?**\n\nTo receive the best assistance, please share your workflow code so others can review it:\n\n**Acceptable ways to share:**\n\n* Github Gist (recommended)\n* Github Repository\n* Directly here on Reddit in a code block\n\nIncluding your workflow JSON helps the community diagnose issues faster and provide more accurate solutions.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-24 18:27:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76l8w8",
          "author": "Available_Cupcake298",
          "text": "honestly i haven't gone that deep with it. my setup is pretty basic - just pdf text extraction, chunk by page or paragraph (nothing fancy like recursive), dump into qdrant, query with openai embeddings. works for their use case since the PDFs are pretty clean.\n\nthe techniques you mentioned (docling for tables, graphrag) are way more sophisticated. if their docs have complex tables or need graph relationships that'd be the move. but for manuals and procedures i'd start simple and only add complexity if the basic chunking fails. what's your stack look like?",
          "score": 17,
          "created_utc": "2026-02-24 18:36:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76tsr8",
              "author": "ShortStandard472",
              "text": "Great, you're very kind, thank you.",
              "score": 3,
              "created_utc": "2026-02-24 19:14:38",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7etmcy",
              "author": "riceinmybelly",
              "text": "How are you doing that?\n\nRecursive chunking, \n\nstrip headers, footers etc\n\nMake sense of tables (docling)\n\nGraphrag and tesseract for images?\n\nLots of metadata and include citations",
              "score": 1,
              "created_utc": "2026-02-25 22:33:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o77959q",
          "author": "MasterOfDanger",
          "text": "Google notebooklm. Max 50 documents in one “folder” / project but for the start it’s really easy and is completely free.",
          "score": 11,
          "created_utc": "2026-02-24 20:25:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76rbwu",
          "author": "StarWarsJunkie42",
          "text": "RAG LLM with open-source LLM e.g. GPT-oss or mistral (no API costs) on lokal server with local vectorDB. LM Studio or Ollama as a framework for the LLMs. Virtual server is completely fine for the beginning. Think about permissions, users and credentials from the beginning. Simple ChatUI with e.g. Slack/Teams/webhook Don't even think about exposing this to the internet > GDPR. Turn off the following N8N parameters on the on-premise environment:\n\n* ﻿﻿N8N\\_SAVE\\_EXECUTIONS=false\n* ﻿﻿N8N\\_ENABLE\\_TUNNEL=false\n* ﻿﻿N8N\\_DIAGNOSTICS\\_ENABLED=false\n\n  \n",
          "score": 6,
          "created_utc": "2026-02-24 19:03:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76tfnn",
              "author": "ShortStandard472",
              "text": "Perfecto, muchas gracias!!",
              "score": 2,
              "created_utc": "2026-02-24 19:12:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o76kz57",
          "author": "Saaho3022",
          "text": "You need to develop a Rag based Chatbot to get your required results",
          "score": 3,
          "created_utc": "2026-02-24 18:35:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76q7q3",
          "author": "trpouh",
          "text": "We've built something similiar for a big publisher. The workflow is quite simple. Ingest the documents into a database of your liking (we use postgres, hosted by supabase, with vector extension). Add the RAG as a tool to your Agent and tweak the prompt accordingly. pretty easy setup with n8n",
          "score": 3,
          "created_utc": "2026-02-24 18:58:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76xdws",
              "author": "LegendaryAngryWalrus",
              "text": "How do you handle the api, guardrails , and keeping conversation history?",
              "score": 2,
              "created_utc": "2026-02-24 19:31:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o77c49v",
                  "author": "trpouh",
                  "text": "which api? mainly prompting, postgres memory",
                  "score": 1,
                  "created_utc": "2026-02-24 20:39:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o77byrj",
          "author": "basedradio",
          "text": "Do they use Microsoft products like sharepoint? If so, copilot does this out of the box no setup needed.",
          "score": 3,
          "created_utc": "2026-02-24 20:38:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76qj2p",
          "author": "Stunning_Ad_5960",
          "text": "You have a rag demo on n8n, but i found even better pipepline for my case because rag used to hallucinate.",
          "score": 2,
          "created_utc": "2026-02-24 18:59:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o772bzr",
          "author": "Competitive_Cat_2020",
          "text": "I'd create a knowledge graph tbh. It's more work upfront but creates one source of truth and an easily searchable database for a bot.\n\nThe fintech I worked for did this in 2024 so we could query a chatbot for company info. Clearly they just wanted to distill all of our knowledge into a wiki so they could replace us all with ai but hey ho",
          "score": 2,
          "created_utc": "2026-02-24 19:53:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7a388w",
          "author": "mraltuntas",
          "text": "notebooklm does the work i think, check it out.",
          "score": 2,
          "created_utc": "2026-02-25 05:53:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d696g",
          "author": "gawdofai",
          "text": "One thing to watch out with Spanish docs specifically: the default chunking strategies in most tutorials are tuned for English. If your PDFs have legal or policy language, you'll want to experiment with chunk sizes. I found \\~400-500 tokens per chunk works better for Romance languages because the sentence structures tend to run longer. Also, if you're on a tight VPS, Qdrant is lighter than Chroma for the vector DB side. The n8n RAG template gets you 80% of the way there, the last 20% is tuning retrieval so it actually pulls the right sections.",
          "score": 1,
          "created_utc": "2026-02-25 17:57:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rb4rbs",
      "title": "How 8 n8n workflows replaced our entire staff scheduling system",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1rb4rbs/how_8_n8n_workflows_replaced_our_entire_staff/",
      "author": "No_Savings4221",
      "created_utc": "2026-02-21 22:39:07",
      "score": 35,
      "num_comments": 8,
      "upvote_ratio": 0.89,
      "text": "For two years, our operations team ran on duct tape.\n\n\n\nEvery morning, someone had to:\n\n\n\n• Run a Google Apps Script to pull shift data\n\n• Export a CSV from one system\n\n• Import it into another\n\n• Manually check for conflicts\n\n• Send out the daily assignments\n\nMiss a step? Everything downstream breaks. Person on holiday? Hope they left good notes.\n\n\n\nIt wasn't anyone's fault. The system grew organically. One script here, one CSV export there. Before you know it, you've got 45 minutes of manual clicking that nobody fully understands anymore.\n\n\n\nWhat broke it\n\n\n\nThe person who wrote most of the Apps Scripts left. Documentation was... sparse. Suddenly we're reverse-engineering JavaScript from 2019 trying to figure out why the shift assignments aren't matching the availability sheet.\n\n\n\nThat's when I thought: what if this just ran itself?\n\n\n\nThe 8 workflows\n\n\n\n1. Availability sync — Pulls staff availability from our HR system every night. No more CSV exports.\n\n2. Shift requirement calculator — Looks at bookings for each location, calculates how many people we need and when.\n\n3. Auto-assignment — Matches available staff to required shifts based on location, role, and hours. Draft schedule ready by 5am.\n\n4. Conflict checker — Flags double-bookings, overtime issues, or people scheduled during requested time off. Runs before anything gets published.\n\n5. Schedule publisher — Pushes the approved schedule to our team app. Everyone sees their week without someone manually updating a shared calendar.\n\n6. Swap request handler.  Staff can request shift swaps. Workflow checks if it's valid, notifies the other person, updates the schedule if both agree.\n\n7. No-show alert - If someone hasn't checked in 15 minutes after shift start, manager gets a ping. Simple but saved us twice already.\n\n8. Weekly hours reconciliation that compares scheduled hours vs actual, flags discrepancies before payroll.\n\nWhat's different now\n\n\n\nNobody runs scripts manually anymore. Nobody imports CSVs. Nobody spends their first hour playing Tetris with a spreadsheet.\n\n\n\nThe ops coordinator who used to own the morning routine now focuses on actual problems — short-staffed days, training gaps, site issues. The mechanical stuff just happens.\n\n\n\nThe biggest lesson learned\n\n\n\nEarly on, I used n8n's built-in Google Sheets nodes. Seemed obvious right? we're reading and writing sheets, use the Sheets node.\n\n\n\n**BIG Mistake.**\n\n\n\nThe integrated nodes were flaky. Random timeout issues, weird edge cases with formatting, inconsistent behaviour with larger datasets. I spent more time debugging node quirks than actual logic problems.\n\n\n\nEventually I ripped them out and switched to raw HTTP requests against the Google Sheets API.  This is my **PRO-TIP -** steer clear of integrated nodes if they're not doing what you need.  A properly defined http request is much better for exploring an API. \n\n\n\nNight and day difference. More reliable, more control, better error handling. I could see exactly what was being sent and returned.\n\n\n\nPro tip: If you're building anything serious in n8n, don't assume the integrated nodes are your best option. HTTP Request nodes talking directly to APIs are often more comprehensive and way more predictable. The integrated nodes are convenient for quick stuff, but when reliability matters, go direct.\n\n\n\nWould I do it again?\n\n\n\nImmediately. The old system was a single point of failure disguised as \"how we've always done it.\" Now there's version control, error logs, and I can actually see what's happening.\n\n\n\nPlus I don't get panicked calls when someone's on holiday and forgot to run the script.\n\n\n\n\n\nBuilt with n8n. If you're replacing janky Apps Scripts with proper workflows, happy to compare notes.\n\n",
      "is_original_content": false,
      "link_flair_text": "Servers, Hosting, & Tech Stuff",
      "permalink": "https://reddit.com/r/n8n/comments/1rb4rbs/how_8_n8n_workflows_replaced_our_entire_staff/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o6ojcbe",
          "author": "DumplingDarling_1",
          "text": "This is such a relatable breakdown so many teams don’t realize how fragile things are until the one person who built it leaves. Moving from manual CSV juggling to automated workflows (especially the conflict checker and reconciliation) is a huge risk reducer.",
          "score": 4,
          "created_utc": "2026-02-21 23:03:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ok1ss",
              "author": "No_Savings4221",
              "text": "The guy on the team that I built it for actually likes to sit there at the scheduled time and watch his google sheets get cleaned out and populated with the new data.  He's real diligent so when he leaves or goes on vacation there's now something that is working for him. ",
              "score": 1,
              "created_utc": "2026-02-21 23:08:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6pc13q",
          "author": "RotatingMadness",
          "text": "How are you deploying this for production? Did you trial it locally and deploying by with a VPS provider like hostinger etc?",
          "score": 3,
          "created_utc": "2026-02-22 02:02:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6u0avg",
              "author": "No_Savings4221",
              "text": "I prefer Hetzner for cloud based but we have a production server now set up for use in the office so it's easier. But I think Hostinger offers a good solution for ease of use.",
              "score": 1,
              "created_utc": "2026-02-22 20:20:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ofvqa",
          "author": "Training_Bet_2747",
          "text": "Automation saves lot of time and agree HTTP nodes are some times better than native nodes because N8N native nodes tend to have fixed schema (boxes) sometimes which might change often",
          "score": 1,
          "created_utc": "2026-02-21 22:44:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ohekd",
              "author": "No_Savings4221",
              "text": "Agree - fixed schema might be better (easier) for beginners but if  you want to be sure you're getting full data from an API you need to use a correctly built call from a HTTP",
              "score": 2,
              "created_utc": "2026-02-21 22:52:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6qof0x",
          "author": "pvdyck",
          "text": "N8n nodes quality and maintenance are the issue here ... Proper partnership should have solved that ages ago. n8n, now that you are properly funded, don't hesitate to step in!",
          "score": 1,
          "created_utc": "2026-02-22 08:19:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rb1kc",
          "author": "seevobuffet",
          "text": "https://youtu.be/jCTADO1A6B0 \nThis helped me land my first client using n8n!",
          "score": 1,
          "created_utc": "2026-02-22 11:54:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdi12i",
      "title": "The one automation I will NEVER build or sell again (learn from my mistake)",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1rdi12i/the_one_automation_i_will_never_build_or_sell/",
      "author": "AmbitionNo5235",
      "created_utc": "2026-02-24 14:42:13",
      "score": 31,
      "num_comments": 28,
      "upvote_ratio": 0.71,
      "text": "I want to share the one type of automation I’ll never build or sell again:\n\n**Standalone, self-hosted custom software** for a single client (think custom CRM, custom chatbot, or micro-SaaS just for them).\n\nIt sounds profitable on paper. In reality? It’s a **maintenance nightmare.**\n\nHere’s what I learned the hard way:\n\nThe problem with standalone custom software\n\nWhen you sell one of these:\n\nYou’re not just selling a build\n\nYou’re accidentally selling lifetime responsibility\n\n* APIs change.\n* Integrations break.\n* Security updates are needed.\n* Auth methods expire.\n* Databases need care.\n* Logs need watching.\n* Infrastructure needs patching.\n\nAnd every time something breaks…\n\nyou’re the one they call.\n\n\n\n# My CRM disaster\n\nI once built a custom CRM automation for a shitty CRM called SuperOffice:\n\n* Connected to the CRM platform via API\n* Synced with Airtable\n* Had custom logic\n* Ran on the client cloud (Azure)\n\n\n\nWhat happened:\n\n**APIs started failing**\n\n* Airtable sent constant error notifications\n* Random edge cases popped up\n* Customer expected fixes… forever\n\nAnd the real mistake?\n\n👉 I didn't charge maintenance fees.\n\nSo I eventually had to tell them:\n\n“I can’t maintain this anymore, or we need to get paid for maintenance (they refused cuz the project cost a lot.”\n\nNow I no longer maintain it, and the client started ghosting me, and I just burned my cards with them due to bad expectation management.  \n\n\nAlso, this is the part nobody talks about enough.\n\nWhen you host:\n\nYou’re responsible for:\n\n* Server updates\n* Library vulnerabilities\n* Auth security\n* API key storage\n* Data protection\n* Downtime\n* Logs\n* Backups\n\n\n\nThat’s not “automation work.”\n\nThat’s software operations.  \n\n\n**And clients don’t want to pay SaaS-level prices…**\n\n**…but expect SaaS-level reliability.**\n\n\n\nWhy this model breaks **at scale**\n\nLet’s say you get:\n\n**10 clients**\n\nEach pays maintenance\n\nEach system is unique\n\n\n\nNow you have:\n\n* 10 workflows and databases\n* 10 infra configs\n* 10 potential failure modes\n* 10 different clients pinging you\n\n>even if you're taking 200$ for the 10 customers, that's 2000, but then also all of these could fail at the same time. If you're by yourself, you cannot get new customers and add them to this loop unless you need to hire somebody and just keep paying them to manage these servers.  And at this rate, you cannot hire full-time employees because you cannot afford them, so you end up hiring some shitty developer from Upwork who's unreliable and they bail on you at the time of need...\n\n\n\n**What I do now instead**\n\nI changed my offer completely:\n\nI now:\n\n* Build automations inside their stack\n* Deploy on their infra (or SaaS tools they own)\n* Train their team\n* Provide:\n   * Docs\n   * Debug help\n   * Limited guidance for their team, no maintenance support (ex: 5h/month)\n\n\n\nSo:\n\n* They own it\n* They maintain it\n* I support strategically\n* I don’t babysit systems forever\n* Much more sustainable.\n\n\n\n**My rule going forward**\n\nI will never again:\n\n❌ Build standalone micro-SaaS for a single client\n\n❌ Host custom apps for them\n\n❌ Be responsible for their infra long-term\n\n\n\n**TL;DR**\n\n* Custom standalone automations = hidden SaaS business\n* Without SaaS pricing\n* Without SaaS team\n* Without SaaS margins\n\n\n\nIf you’re selling automations:\n\nLearn from this before you build your first “custom CRM” for €2k and regret it 😅\n\nHappy to hear if others made the same mistake or am I the dumbass in this story... ",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1rdi12i/the_one_automation_i_will_never_build_or_sell/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o75is3y",
          "author": "RaccoonEnthuiast",
          "text": "I can smell the LLM off this wall of text",
          "score": 34,
          "created_utc": "2026-02-24 15:43:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75bo55",
          "author": "conor_is_my_name",
          "text": "I build full custom solutions all the time.  It's actually the point and what many clients specifically want because their needs do not match an off the shelf product.\n\n",
          "score": 7,
          "created_utc": "2026-02-24 15:10:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o75dwmi",
              "author": "AmbitionNo5235",
              "text": "How are you maintaining them, how big is your team?",
              "score": -2,
              "created_utc": "2026-02-24 15:21:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o75fn8q",
                  "author": "conor_is_my_name",
                  "text": "Maintenance is billed at my base hourly rate ",
                  "score": 4,
                  "created_utc": "2026-02-24 15:29:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o76mfh3",
                  "author": "Christosconst",
                  "text": "You charge for maintenance. If its lifetime maintenance, you just created a lifetime revenue stream.",
                  "score": 3,
                  "created_utc": "2026-02-24 18:41:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o75al2j",
          "author": "surfer808",
          "text": "God I hate these ChatGPT posts. I believe OP but the way ChatGPT makes these cookie cutter posts are so unappealing to read",
          "score": 22,
          "created_utc": "2026-02-24 15:05:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o75ba9g",
              "author": "devexis",
              "text": "“Happy to hear” or “Curious to hear” just ticks me off",
              "score": 5,
              "created_utc": "2026-02-24 15:08:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o75dssj",
                  "author": "AmbitionNo5235",
                  "text": "didn't mean to tick you off ",
                  "score": -6,
                  "created_utc": "2026-02-24 15:20:45",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o76jjf8",
          "author": "_afrenchguy",
          "text": "Are we on LinkedIn?",
          "score": 3,
          "created_utc": "2026-02-24 18:28:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o761eln",
          "author": "cvandyke01",
          "text": "Instrument so that you have a system health dashboard that shows each step of the process and where the error falls.  This way they have a dash board that shows external api failure and it becomes new integration work for you",
          "score": 2,
          "created_utc": "2026-02-24 17:07:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o789w3v",
          "author": "kerbion",
          "text": "reading this while actively building a custom crm...",
          "score": 2,
          "created_utc": "2026-02-24 23:22:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7598ly",
          "author": "OptionDegenerate17",
          "text": "Take a basic business course. It would help you.",
          "score": 2,
          "created_utc": "2026-02-24 14:58:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o75dy46",
              "author": "AmbitionNo5235",
              "text": "probably",
              "score": 1,
              "created_utc": "2026-02-24 15:21:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o75ieca",
          "author": "Dyonizius",
          "text": "i've been doing research on that and hear your pain points, hosting is a liability and compliance nightmare, instead one could offer to set up the cloud deployment and make the CRM as modularized as possible so new features dont break everything\n\n\nairtable and any kind of databases should be hostable by the client and version pinned, industry standard is to develop your code around the data not the other way around\n\n\n\n\n\nthat and be explicit on the contract/terms what you can or cannot do like  \n\n\nminor updates or features: some price  \n\nmajor updates or features that take a whole day: some other price",
          "score": 1,
          "created_utc": "2026-02-24 15:42:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75oa7b",
          "author": "Objective_Office_409",
          "text": "Muito obrigado por compartilhar sua experiência! Estou entrando agora nesse mercado e me ajudou muito. ",
          "score": 1,
          "created_utc": "2026-02-24 16:08:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76bq5b",
          "author": "ReadingHappyToday",
          "text": "Why didn't you offer managed services paid per hour?",
          "score": 1,
          "created_utc": "2026-02-24 17:54:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76fzd5",
          "author": "LoneFox4444",
          "text": "Skill issue.",
          "score": 1,
          "created_utc": "2026-02-24 18:13:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76tk4h",
          "author": "vvsleepi",
          "text": "\"Great insights!\"",
          "score": 1,
          "created_utc": "2026-02-24 19:13:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7afltn",
          "author": "Least_Play9958",
          "text": "Thank you, Gemini, its only the 15th post with the same layout for this day",
          "score": 1,
          "created_utc": "2026-02-25 07:39:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7asm1k",
          "author": "Pappa_karp",
          "text": "Let's say I rent a cloud desktop/server (aws, azure, etc). I use it to host an automation suite like ui path. \n\nIn theory I will be self hosting, but I don't see how the infrastructure becomes such an issue as security and updates and patching will be standard Microsoft updates.\n\nManaging API keys and credentials will be done within ui paths credential store. \n\nI guess my plan may differ in that my goal is to find clients who don't self host and basically run their entire company remotely. This means all their work is Internet facing which makes automation it within my environment feasible.\n\nI see the issues you ran into and this is something I've thought about a lot, thanks for sharing. \n\nI'm thinking of self hosting a server and managing as many automations as I can from it. I specifically want to avoid onsite customers. \n\nBut I will not connect to their systems or host their local apps. It'll limit business but that's ok.",
          "score": 1,
          "created_utc": "2026-02-25 09:40:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cnzzw",
          "author": "Remarkable-Task-4863",
          "text": "If you didnt put a maintenance or support contract to them when selling whats basically a SaaS solution thats on you",
          "score": 1,
          "created_utc": "2026-02-25 16:34:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fsfzt",
          "author": "crashnburn00",
          "text": "Sorry you had a rough go at it but recommending people don’t do something because you didn’t do it properly is just bad advice. If you are building custom tools for someone then you should be charging an appropriate price for that service. If it is prone to breaking because of 3rd party updates then you should be charging a monthly retainer fee for your time. I make over $10k a month just in retainer fees and probably spend a few hours a month on each client. This is a great time to offer these types of services.",
          "score": 1,
          "created_utc": "2026-02-26 01:43:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75701y",
          "author": "Resident-Bonus-6237",
          "text": "Thanks for the tips, heal self-hosting automations can be tricky ",
          "score": 1,
          "created_utc": "2026-02-24 14:47:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o75dzb3",
              "author": "AmbitionNo5235",
              "text": "thanks bro",
              "score": 0,
              "created_utc": "2026-02-24 15:21:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o75es2p",
          "author": "Delicious-One-5129",
          "text": "Custom one off builds quietly turn you into a SaaS company without SaaS pricing. Smart move shifting to their stack and limiting support.",
          "score": 0,
          "created_utc": "2026-02-24 15:25:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1re24t3",
      "title": "Has anyone else noticed most people are positioning AI completely wrong?",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1re24t3/has_anyone_else_noticed_most_people_are/",
      "author": "Ok_Interaction_102",
      "created_utc": "2026-02-25 03:30:24",
      "score": 29,
      "num_comments": 13,
      "upvote_ratio": 0.89,
      "text": "genuine question, has anyone else realised that most people are approaching AI completely wrong? like everyone's focused on the tech, talking about chatbots and automations, but most business owners don't even know what that means and don't care. the second you flip it and just talk about the outcome, like \"you'll never miss a call again\" or \"every lead gets booked automatically\", suddenly they're interested. feels like there's a massive disconnect right now. curious what everyone's experience has been\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1re24t3/has_anyone_else_noticed_most_people_are/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o79r65q",
          "author": "wrexs0ul",
          "text": "There's hype, and there's usability.\n\nMost people never touch on actual AI beyond Gemini or ChatGPT. To them the browser-based chat tool \\*is\\* AI. You can revamp a resume or add your wife's face to a funny picture, maybe scrape some PDFs into a table for your accountant. One-off, no-memory/no-context stuff.\n\nMy experience: I tell Claude Code to build an n8n automation tool that replaces Fyxer, saving me money every month. This includes an Anthropic AI integration so AI is calling itself after some algorithm stuff and guardrails. Then I have it synchronize various manual business processes in minutes that would've taken me a week to code. All the while any code is written in my preferred language, in my style, using reference libraries from my Git repo that've been in my code for years. None of the final project uses AI, but the code itself is easily maintained in there.\n\nThe latter is lifechanging. I still need to review, troubleshoot, and sometimes stop and redirect AI from going down a rabbit hole. But, the bullsh\\*t is just gone. I'm getting stuff done in minutes that would normally be a very late night after the normal work day is done.\n\n",
          "score": 6,
          "created_utc": "2026-02-25 04:26:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ckwtb",
              "author": "PM_ME_YOUR_GREENERY",
              "text": ">This includes an Anthropic AI integration so AI is calling itself after some algorithm stuff and guardrails. Then I have it synchronize various manual business processes in minutes that would've taken me a week to code. All the while any code is written in my preferred language, in my style, using reference libraries from my Git repo that've been in my code for years. \n\nCan you expand on this or links to docs? This sounds like a very good idea",
              "score": 1,
              "created_utc": "2026-02-25 16:20:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7eql1n",
                  "author": "wrexs0ul",
                  "text": "I used this blog: [https://medium.com/vibe-coding/i-replaced-a-270-year-email-tool-using-n8n-0f3e68b2b532](https://medium.com/vibe-coding/i-replaced-a-270-year-email-tool-using-n8n-0f3e68b2b532)\n\nIt's a little basic, but works as a great starting framework. After cleaning up the code and md a bit I made some changes using Claude Code to better mimic the experience I got from Fyxer.\n\nTruly amazing stuff. Claude Code edits and builds n8n Workflows which use Anthropic's API to classify email. All additions took about 15 minutes with some testing. Companies selling \"AI\" tools are in for some trouble now that you can use AI to build those same AI tools on your own.\n\nNot counting the monthly cost of my Max sub API costs are looking to be a few pennies.",
                  "score": 2,
                  "created_utc": "2026-02-25 22:18:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7a5ssh",
          "author": "Opposite_Language_19",
          "text": "Yes. \n\nDigital twin into a singular supabase with fastapi automations and dashboards tied to revenue generating activities and business owners salivate. Selling this exact stack for 6 figures.",
          "score": 3,
          "created_utc": "2026-02-25 06:14:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7b2wh8",
              "author": "cynicaloptimist72",
              "text": "Hey, this piqued my interest. Could you please elaborate a bit on this?",
              "score": 1,
              "created_utc": "2026-02-25 11:13:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7by3ts",
                  "author": "Opposite_Language_19",
                  "text": "Do you have AI? \n\nPaste it in \n\nEnrich it with this \"Imagine I'm a construction company that stocks and creates products and then explain it to me like I'm a 10 year old\"\n\nLet me know the response, then ask me something more specific. ",
                  "score": 0,
                  "created_utc": "2026-02-25 14:32:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ajk9o",
          "author": "IdeasInProcess",
          "text": "Yep. Took us an embarrassingly long time to work this out. We had slides about our architecture and what models we were using and all this stuff that we thought was impressive. Nobody on the other side of the table cared. What actually got people to book calls was saying something dead simple like \"that thing your team spends three hours on every Friday? We can make it take twenty minutes.\" I still go back and forth on whether that's a good thing or not honestly, feels reductive when the actual work is genuinely complex. But people don't want to hear about the complexity, they want to know what changes for them on Monday morning. I catch myself slipping back into the tech pitch all the time and have to stop myself.",
          "score": 3,
          "created_utc": "2026-02-25 08:15:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7a9zri",
          "author": "Nervous-Increase3185",
          "text": "Most people are not approaching business owners but other nerds to sell their course too. Actually helping businesses is way too difficult for them bedroom techies.",
          "score": 2,
          "created_utc": "2026-02-25 06:49:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ahuat",
          "author": "Low-Opening25",
          "text": "So what’s new exactly? This is how businesses have been approaching technology for ever. Bosses only care about outcomes and how much money those outcomes make, that was always the case -> .com bubble happened for a reason",
          "score": 2,
          "created_utc": "2026-02-25 07:59:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7au6vf",
          "author": "Certain-Structure515",
          "text": "Yeah you’re not imagining it. Most people are selling the tech, but business owners care about outcomes. “AI automation” is abstract; “never miss a lead again” is concrete",
          "score": 1,
          "created_utc": "2026-02-25 09:55:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b6li9",
          "author": "Ok_Interaction_102",
          "text": "actually just watched a video on this exact thing, this dude explains it way better than i can [https://www.youtube.com/watch?v=8NWW-joXgsU](https://www.youtube.com/watch?v=8NWW-joXgsU)",
          "score": 1,
          "created_utc": "2026-02-25 11:43:53",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1rf1sf0",
      "title": "Built an OCR automation pipeline using Sarvam Vision + n8n (messy scans → structured data)",
      "subreddit": "n8n",
      "url": "https://v.redd.it/l1z68x4gzrlg1",
      "author": "divyanshu_gupta007",
      "created_utc": "2026-02-26 05:33:33",
      "score": 24,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1rf1sf0/built_an_ocr_automation_pipeline_using_sarvam/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o7gxh7x",
          "author": "That-Log-3369",
          "text": "How's your AI automation progress going? Any earnings starting to come in (if you don't mind sharing)?",
          "score": 2,
          "created_utc": "2026-02-26 06:07:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h7c94",
          "author": "Plenty_Attorney_6658",
          "text": "Why so unnecessary. Mistral ocr exists",
          "score": 1,
          "created_utc": "2026-02-26 07:31:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7h845o",
              "author": "divyanshu_gupta007",
              "text": "Yes, Mistral AI OCR is built for strong multilingual document understanding with high accuracy across global formats, while Sarvam AI OCR is optimized for Indian languages and real-world Indian document use cases (Aadhaar, invoices, regional scripts)",
              "score": 1,
              "created_utc": "2026-02-26 07:38:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hcjft",
          "author": "No_More_Fail",
          "text": "Please share the workflow",
          "score": 1,
          "created_utc": "2026-02-26 08:19:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hcsq1",
          "author": "EffectCute5473",
          "text": "share workflow\n\n",
          "score": 1,
          "created_utc": "2026-02-26 08:22:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcvci4",
      "title": "Stop overpaying for email tools. Seriously.",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1rcvci4/stop_overpaying_for_email_tools_seriously/",
      "author": "salestoolsss",
      "created_utc": "2026-02-23 21:58:31",
      "score": 23,
      "num_comments": 18,
      "upvote_ratio": 0.69,
      "text": "https://preview.redd.it/i7xoue81gblg1.png?width=1256&format=png&auto=webp&s=30080ac2a609500ed15bc3ac68be56b986e991fd\n\nI just plugged Tomba.io into [n8n](https://n8n.io/integrations/tomba/) and honestly… why is everyone still paying $200+/mo for Apollo or zoominfo?\n\nHere's what Tomba's n8n node gives you:\n\n **Email Finder** — Drop in a name + domain, get a verified email. Done.\n\n **Catch-All Verification** — This is the one nobody else does right. While other tools mark catch-all domains as \"unknown\" and leave you guessing, Tomba actually verifies them. That's 30-40% of B2B emails other tools just… skip.\n\n **LinkedIn Enrichment** — Pull contact data straight from LinkedIn profiles. No more copy-pasting between 5 tabs.\n\n**📱 Phone Finder** — Yes, mobile numbers too. In the same workflow.\n\n **Email Verifier** — 97%+ accuracy. Not \"we think it's valid\" — actually verified.\n\nAnd the price? Tomba starts at a fraction of what you'd pay for Snov, Apollo, or Hunter for the same volume.\n\nNow connect that to n8n and you've got:\n\n→ Lead scraping → enrichment → verification → CRM push → All automated. All in one flow. No code.\n\nThe kicker? We tested Tomba head-to-head against 6 major competitors. **81.9% valid email discovery vs. the next best at 75.2%.** Most sat under 50%.\n\n  \nReal data. Same input. No human touch. Full transparency.\n\nWe ran a head-to-head test using the same 5000-line input file across multiple email-finding tools. No manual cleanup. No tweaks. Just raw results exported as full sheets.\n\n[https://docs.google.com/spreadsheets/u/1/d/1QhhHadxscI\\_3YcUBlKyHIpMPiwsulU53euK1-9u8Ed4/edit](https://docs.google.com/spreadsheets/u/1/d/1QhhHadxscI_3YcUBlKyHIpMPiwsulU53euK1-9u8Ed4/edit)\n\nIf you're building outbound workflows in n8n and you're NOT using Tomba, you're literally paying more for worse data.\n\nGo plug it in. Thank me later. 🚀\n\n  \nGitHub link [https://github.com/tomba-io/n8n-nodes-tomba](https://github.com/tomba-io/n8n-nodes-tomba)",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1rcvci4/stop_overpaying_for_email_tools_seriously/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o71219q",
          "author": "AutoModerator",
          "text": "**Google Drive and Google Docs links are no longer allowed.**\n\nWe've found that Google links often become inaccessible over time or require permissions that make them unreliable for the community.\n\n**Please share your workflow using one of these methods instead:**\n\n* Github Gist (recommended)\n* Github Repository\n* n8n.io/workflows/\n* Directly here on Reddit in a code block\n\nPlease update your post with a supported link. If not updated, your post may be removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-23 21:58:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72cwv8",
          "author": "Key-Hair7591",
          "text": "Vibe coded garbage.  Just tried for kicks.  More silly errors than I can count…",
          "score": 7,
          "created_utc": "2026-02-24 02:17:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o75rnqy",
              "author": "salestoolsss",
              "text": "You’re acting foolish. I’ve been in the code industry since 2015, and I’ve seen the kind of sloppy code some companies produce. I started developing this back in 2019 before COVID and before the whole AI hype. So don’t act like this just started yesterday",
              "score": -1,
              "created_utc": "2026-02-24 16:24:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o76axrm",
                  "author": "Key-Hair7591",
                  "text": "Whatever you say boss!",
                  "score": 2,
                  "created_utc": "2026-02-24 17:50:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o78zu3l",
                  "author": "Goldarr85",
                  "text": "“Code industry” had me cackling. Is that what the kids call it these days?",
                  "score": 1,
                  "created_utc": "2026-02-25 01:45:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o72dhs9",
              "author": "salestoolsss",
              "text": "Vibe coded !!",
              "score": -2,
              "created_utc": "2026-02-24 02:20:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o71d6fj",
          "author": "iNX0R",
          "text": "What are you using for lead scraping? I have company names, domains and job titles I'm interested in. \n\nI could go through linkedin sales navigator every time but that takes a lot of time.",
          "score": 2,
          "created_utc": "2026-02-23 22:55:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7a6kij",
              "author": "LostContribution2056",
              "text": "Sales navigator has the most reliable data you can try building lead lists there then use a waterfall enrichment tool like airscale to scrape and enrich lists from sales nav. ",
              "score": 1,
              "created_utc": "2026-02-25 06:20:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7as95z",
                  "author": "iNX0R",
                  "text": "Yeah I agree with the quality of LinkedIn. I just need to find a way to automate the linkedin search part. Was using Phantombuster for that but it's not efficient since I have to wait and poll to see if the search is ready and that I can export the results.",
                  "score": 1,
                  "created_utc": "2026-02-25 09:37:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o71fvhi",
              "author": "salestoolsss",
              "text": "What do you mean by lead scraping? If you’re asking where we get emails  we collect from across the entire web. Check our latest February update in the docs. You can use a domain or company name as input and get emails back. We also offer a Sales Navigator scraper.",
              "score": -1,
              "created_utc": "2026-02-23 23:10:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o73s1ru",
                  "author": "iNX0R",
                  "text": "No I meant\n\n**Input**: Company names and job titles\n\n**Output**: LinkedIn profile, Firstname, lastname, jobtitle, company name",
                  "score": 1,
                  "created_utc": "2026-02-24 08:39:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o76yoi2",
          "author": "vvsleepi",
          "text": "how does it hold up long term with bounce rates? like have you tested real campaigns after enrichment to see if deliverability actually improves?\n\n",
          "score": 2,
          "created_utc": "2026-02-24 19:37:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77rkx6",
              "author": "salestoolsss",
              "text": "We’ve tested this in real campaigns, and long-term deliverability holds strong  around 95% on average .\n\nIn cases where someone reports a bounce, it’s often not the email itself. Many addresses are sourced and validated with 80+ web sources . Most bounces we’ve analyzed were due to domain/server configuration issues or sender setup (SPF/DKIM/DMARC), not invalid data.",
              "score": 1,
              "created_utc": "2026-02-24 21:50:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o71218c",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-23 21:58:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71roi1",
          "author": "dreamchaser1337",
          "text": "Does this work with Claude code instead of n8n?",
          "score": 1,
          "created_utc": "2026-02-24 00:16:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71zrd5",
              "author": "sophie_auguste",
              "text": "The answer is always yes to this questions. N8N is just an orchestration layer for code.",
              "score": 5,
              "created_utc": "2026-02-24 01:01:04",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o723eo0",
              "author": "salestoolsss",
              "text": "# How to Install Tomba MCP in Claude Desktop\n\n1. 1 Open Claude Desktop Settings Click on Settings in Claude Desktop application\n2. 2 Browse Extensions Click to browse Extensions section\n3. 3 Go to Desktop Extensions Click on Desktop extensions tab\n4. 4 Search for Tomba Search for \"Tomba\" in the extensions search\n5. 5 Install and Configure Install the Tomba extension and configure it with your API key and API secret.",
              "score": -1,
              "created_utc": "2026-02-24 01:22:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73ff6r",
          "author": "riceinmybelly",
          "text": "Syntax validation checks if an email follows standard format rules like RFC 5322 using regex or libraries. SMTP probing connects to the mail server to verify if the specific recipient exists without sending a full email. These build on MX checks for more thorough validation.\n\n## Syntax Validation\nUse regex to catch obvious errors like missing @ or invalid characters before deeper checks.\n\n- Basic regex: `r'^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\\.[a-zA-Z]{2,}$'`\n- Python example:\n  ```\n  import re\n  regex = re.compile(r'^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\\.[a-zA-Z]{2,}$')\n  def is_valid_syntax(email):\n\n      return bool(regex.match(email))\n  ```\n\n  This flags invalid formats like \"user@.com\" but passes \"user@example.com\".\n\nLibraries like `email-validator` (`pip install email-validator`) handle edge cases better:\n\n```\n\nfrom email_validator import validate_email, EmailNotValidError\ntry:\n    validate_email('test@example.com')\nexcept EmailNotValidError:\n    pass\n```\n\n## SMTP Probing\nConnect to the MX server (port 25), simulate SMTP commands (EHLO, MAIL FROM, RCPT TO), and check the response code (250 = accepts recipient).\n\n- Python example (requires `dnspython` and `smtplib`):\n\n  ```\n  import smtplib\n  import dns.resolver\n  import socket\n\n  def smtp_probe(email):\n      domain = email.split('@')\n      mx_records = dns.resolver.resolve(domain, 'MX')\n      for mx in sorted(mx_records, key=lambda x: x.preference):\n          try:\n              mx_host = str(mx.exchange).rstrip('.')\n              server = smtplib.SMTP(timeout=10)\n              server.set_debuglevel(0)\n              server.connect(mx_host, 25)\n              server.helo('example.com')\n              server.mail('test@example.com')\n              code, _ = server.rcpt(email)\n              server.quit()\n              if code == 250:\n                  return True\n          except:\n              continue\n      return False\n  ```\n\n  Returns True if any MX accepts the RCPT TO.\n\n## Best Practices\nLayer checks: syntax > MX > SMTP probing; use timeouts to avoid hangs. SMTP probing risks blacklisting if overused, so limit rate (e.g., 1/sec) or use APIs like ZeroBounce. Always follow with double-opt-in emails for confirmation.",
          "score": 1,
          "created_utc": "2026-02-24 06:43:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9iazv",
      "title": "I tried “vibe coding” a full SaaS with Claude + n8n — this surprised me",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1r9iazv/i_tried_vibe_coding_a_full_saas_with_claude_n8n/",
      "author": "Ok_Interaction_102",
      "created_utc": "2026-02-20 01:49:21",
      "score": 18,
      "num_comments": 4,
      "upvote_ratio": 0.95,
      "text": "I built a small SaaS for a member using Claude Code + n8n and honestly didn’t expect it to work as smoothly as it did.\n\nClaude handled most of the logic, n8n glued everything together, and the result was a working product way faster than I thought was possible. It wasn’t perfect, but it was *good enough* to ship.\n\nCurious how others here are using AI for real builds (not just toy demos).  \nAre you letting AI write logic, or just using it as an assistant?\n\nI recorded the full build process if anyone wants to see how the workflow actually looked:  \n[https://youtu.be/ZPiDvUL4B7o](https://youtu.be/ZPiDvUL4B7o)\n\nJSON CODE HERE: [https://pastebin.com/Drv4JyXY](https://pastebin.com/Drv4JyXY)",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1r9iazv/i_tried_vibe_coding_a_full_saas_with_claude_n8n/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o6ckc5v",
          "author": "AutoModerator",
          "text": "**Video posts must include the workflow code.** The link to the code MUST be in the reddit post, if it is not in the reddit post itself, your post will be removed.\n\n**Acceptable ways to share the code:**\n\n* Github Repository\n* Github Gist\n* Directly here on Reddit in a code block\n* n8n.io/workflows/\n\nSharing the code any other way is not allowed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 01:49:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ckc4f",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 01:49:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d9uuo",
          "author": "DumplingDarling_1",
          "text": "It’s wild how smoothly AI + n8n can glue a whole SaaS together, makes building way less painful than I expected.",
          "score": 1,
          "created_utc": "2026-02-20 04:33:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6da7ug",
          "author": "Elhadidi",
          "text": " I used AI + n8n to spin up a WhatsApp AI agent in about 10 mins—AI wrote most of the logic and n8n glued it together. Might be a neat real-world example: [https://youtu.be/J08qIsBXs9k](https://youtu.be/J08qIsBXs9k)",
          "score": 1,
          "created_utc": "2026-02-20 04:36:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}