{
  "metadata": {
    "last_updated": "2026-02-23 03:09:58",
    "time_filter": "week",
    "subreddit": "n8n",
    "total_items": 20,
    "total_comments": 232,
    "file_size_bytes": 231603
  },
  "items": [
    {
      "id": "1r9q0kd",
      "title": "I have built n8n automations for a dozen startups this year. Here is what nobody tells you.",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1r9q0kd/i_have_built_n8n_automations_for_a_dozen_startups/",
      "author": "Warm-Reaction-456",
      "created_utc": "2026-02-20 08:36:32",
      "score": 432,
      "num_comments": 87,
      "upvote_ratio": 0.92,
      "text": "I have been using n8n for client work for a while now. Not hobby projects. Actual businesses paying real money to automate real workflows.\n\nAnd after doing this for long enough I have noticed some patterns that nobody in this community seems to talk about.\n\nFirst thing. Most founders have no idea what they actually want to automate. They come to me saying they want to \"automate their business\" which is the equivalent of going to a mechanic and saying \"fix my car.\" I spend the first week just watching them work and finding the one repetitive task that is quietly eating 3 hours of their day. That is where the money is.\n\nSecond thing. n8n is incredible until it isn't. The moment you start chaining more than 15 nodes together in a single workflow you are building a debugging nightmare. I have inherited workflows from other freelancers that look like circuit diagrams. Nobody can read them. Nobody can fix them when they break at 2am. I always split complex workflows into smaller ones that talk to each other. Boring but it works.\n\nThird thing. Everyone wants AI in the workflow now. Every single client asks if we can \"add AI\" somewhere. Sometimes it makes sense. Most of the time a simple IF condition does the same job faster and cheaper with zero hallucination risk. I have saved clients hundreds of dollars a month in API costs just by replacing an LLM call with a basic regex filter.\n\nThe actual stuff businesses pay for is not glamorous. Lead enrichment. Invoice parsing. Slack alerts when something goes wrong in the database. Syncing two tools that do not talk to each other natively.\n\nSimple problems. Boring solutions. Solid recurring revenue.\n\nAnyone else finding that the simplest automations are the ones clients renew contracts for every year?\n\nEdit - Since a few people asked in the comments and DMs, yes I do take on client work. If you are a founder looking to get an MVP built, automate a workflow, or set up AI agents for your business I have a few slots open. Book a call from the link in my bio and we can talk through what you need.\n",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1r9q0kd/i_have_built_n8n_automations_for_a_dozen_startups/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o6ebmo6",
          "author": "nolooseends",
          "text": "How do you charge your clients? Where do you run your n8n instances?",
          "score": 43,
          "created_utc": "2026-02-20 10:06:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ex8vm",
              "author": "Warm-Reaction-456",
              "text": "For charging, it depends on the project. Most of my client work is either a flat project fee upfront or a monthly retainer if they want me to maintain and expand the workflows over time. I stopped doing hourly a while back. Hourly billing punishes you for being fast and efficient which makes no sense.\n\nFor hosting, self hosted n8n on a cheap VPS. DigitalOcean or Hetzner usually. Hetzner especially if the client is in Europe. A 6 dollar box handles most small to mid sized workflow loads without breaking a sweat.\n\nI only use n8n cloud for clients who absolutely refuse to think about infrastructure or have a compliance reason to keep everything managed. It gets expensive fast so I try to avoid it unless the client insists and is willing to pay for it.\n\nThe setup is boring but it works and it never goes down.",
              "score": 52,
              "created_utc": "2026-02-20 12:55:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6eyz70",
                  "author": "nolooseends",
                  "text": "Thanks. \n\nAnd how do you do maintenance etc.? Like the pretty big recent security vulnerability? Do you have any failover?\n\nAfter a while the more client instances the more overhead?",
                  "score": 8,
                  "created_utc": "2026-02-20 13:06:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6m0a5z",
                  "author": "Used-Motor-2699",
                  "text": "Just out of curiosity, is there a big reason you use n8n rather than Microsoft Power Automate?\n\nThe reason I ask is that if the organisation already has a Microsoft enterprise license (which seems like most companies these days), then surely all you need to do is get their IT team to set you up with a service account where you could hold all of these automations in the web version of power automate, which would be no extra cost. If you want to add HTTP actions for API calls, you might need the premium Power Automate license to be acquired for the service account, which I think is something like £11/$15 per month, but with that you can run everything cloud-based on Microsoft’s servers with zero setup. \n\nI’m not super experienced in the field so I may have got some assumptions wrong / not understand enough about the pros/cons of each automation platform out there, but would be interesting to hear your thoughts on the above",
                  "score": 3,
                  "created_utc": "2026-02-21 15:13:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6eirzu",
              "author": "Koolerifyoudid",
              "text": "THIS is the stuff nobody tells you!",
              "score": 45,
              "created_utc": "2026-02-20 11:09:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6ep963",
              "author": "KarryLing18",
              "text": "I would think he basically spins the client their own N8N instance, configures it and builds their workflows. Then essentially becomes a retainer for maintenance as needed or future workflows.",
              "score": 10,
              "created_utc": "2026-02-20 12:00:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6k91fd",
              "author": "Possible-Road-4290",
              "text": "I make clients pay for their instance and run it on their domain using hostinger (they have a native addon now to host n8n)",
              "score": 2,
              "created_utc": "2026-02-21 06:34:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6eka0v",
          "author": "Grouchy-Wallaby576",
          "text": "The \"split complex workflows into smaller ones that talk to each other\" point is the single best piece of advice in this post. I run 52 active workflows on a self-hosted n8n instance and the ones that cause the most trouble are always the monoliths I haven't broken up yet.                                                                                                                                                                                                                                                                                 \n\n  On the AI point — completely agree. I went through a phase of throwing LLM calls at everything. Ended up replacing most of them with Code nodes doing regex or simple string matching. The ones where AI actually earns its cost are lead enrichment (extracting names from messy HTML) and content repurposing. Everything else is better served by a filter or a switch node.\n\n  One gotcha nobody warned me about: n8n's splitInBatches node swapped its output order in v2.6.x. Output 0 became \"done\" and Output 1 became \"loop\" — the opposite of what it was before. Had 4 workflows silently producing wrong results before I caught it. Always pin your version and test after upgrades.\n\n  What's your error handling strategy? I use a dedicated error workflow that catches failures across all 52 workflows and sends a Slack-style alert. Curious if you've found a better pattern for the 2am breaks.",
          "score": 15,
          "created_utc": "2026-02-20 11:22:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6h0dgh",
              "author": "knissamerica",
              "text": "So you manage self hosted n8n instances for all these different clients? How are you doing that? When I was doing self hosting on my own I was using docker and it was a real hassle.",
              "score": 1,
              "created_utc": "2026-02-20 19:00:05",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6sdu0l",
              "author": "Fast-Needleworker352",
              "text": "Can you give examples of what kind of work you'd first think to use an LLM for, but regex etc. would work better? I'd love to figure out if any of my stuff could be replaced",
              "score": 1,
              "created_utc": "2026-02-22 15:48:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ezpnk",
          "author": "Drogoff1489",
          "text": "this is so accurate lol\n\nthe \"i want to automate my business\" thing drives me crazy. i usually start by just watching them work for a few days - screen recordings, looking at their actual tools, what tabs they have open\n\nmost useful question i ask: \"what takes 30+ minutes every day that you dread doing?\" usually gets you to the real bottleneck\n\nagree on the maintenance point too. i've started building everything with error logs that go to telegram/slack so when something breaks i know immediately. also helps to use airtable or notion as the \"source of truth\" instead of buried deep in workflow nodes - way easier for clients to understand and update themselves",
          "score": 7,
          "created_utc": "2026-02-20 13:10:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ec7s6",
          "author": "darkchocolateagain",
          "text": "How do you reach these business?",
          "score": 6,
          "created_utc": "2026-02-20 10:11:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6elkef",
              "author": "locomotive-1",
              "text": "Pound the pavement",
              "score": 4,
              "created_utc": "2026-02-20 11:32:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6n2sdg",
                  "author": "zeen516",
                  "text": "What does that mean for you? How did you find them and what was the cold call like??",
                  "score": 1,
                  "created_utc": "2026-02-21 18:27:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6erbq5",
          "author": "h33b",
          "text": "Oh look, a regurgitated shit post that drops in here every day.\n\nAlways something \"nobody tells you\". \n\nAlways \"breaks at 2AM\".\n\nNever anything meaningful.\n\nShort sentences.\n\nThe Internet is dead.",
          "score": 32,
          "created_utc": "2026-02-20 12:15:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fsvoq",
              "author": "Ok-Scar8556",
              "text": "That's why I love Reddit You find all types of people The villains, the good guys, the idiots, the jealous ones, the geniuses All in the same place",
              "score": 9,
              "created_utc": "2026-02-20 15:41:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6fi0r6",
              "author": "Jin-Bru",
              "text": "Probably a regex written string on n8n autopost.",
              "score": 7,
              "created_utc": "2026-02-20 14:48:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6flb8p",
              "author": "Academic_Lemon_4297",
              "text": "Dude, you need sunlight pronto. \n\n\n&#x200B;\n\n\nNot everything has to be long, unique sentences, and especially not with newer technologies.",
              "score": -5,
              "created_utc": "2026-02-20 15:05:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6kox7h",
                  "author": "team_lloyd",
                  "text": "boo this man",
                  "score": 1,
                  "created_utc": "2026-02-21 09:07:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ekyux",
          "author": "financialv1rgin",
          "text": "It looks like ai writing for me and not in a good way.",
          "score": 15,
          "created_utc": "2026-02-20 11:28:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kmikk",
              "author": "Sea_Surprise716",
              "text": "AI;dr",
              "score": 3,
              "created_utc": "2026-02-21 08:43:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fj4a2",
          "author": "hardcherry-",
          "text": "Right…because it’s an age old issue with clients.\n\nClient: I want a website…",
          "score": 4,
          "created_utc": "2026-02-20 14:54:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ebu58",
          "author": "helloyouahead",
          "text": "Can you provide an example of a node breaking? Why would it break if it is correctly configured? It is generally because of bad coding or API changes (which I assume would not happen in Zapier as they seem to have more native integrations with Google and others?)",
          "score": 3,
          "created_utc": "2026-02-20 10:07:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6eljhd",
              "author": "ncatalin94",
              "text": "what zapier mate? Were talking n8n",
              "score": 1,
              "created_utc": "2026-02-20 11:32:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6f3v4p",
                  "author": "hipster-no007",
                  "text": "Bro hallucinated.",
                  "score": 4,
                  "created_utc": "2026-02-20 13:34:17",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6fem7i",
                  "author": "helloyouahead",
                  "text": "Zapier has native integrations with Google workspace and most main platforms out there, which is not the case of N8N. I was just asking if that means the API or connection between N8N and Google for example is more likely to break than Zapier. Genuine question from someone who is definitely not an expert in automation or IT in general.",
                  "score": 3,
                  "created_utc": "2026-02-20 14:31:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6gq22q",
          "author": "flawinthedesign",
          "text": "This is a constructive thread. I dig it.",
          "score": 3,
          "created_utc": "2026-02-20 18:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i997m",
          "author": "Historical_Fox2922",
          "text": "I close AI dev deals as my job.  \nIts so fucking easy to close them when you tell them exactly where the biggest problem is.  \n99.999999999% of ppl can't articulate or find i b/c their biz is too complex, so they guess but its never right.  \n\"Its in marketing\" OK where  \n\"Its in ... well uh.... the content area, we can post more\"  \n\"OK where.  \n\"UHHHHH WELL WE NEED SCRIPTS\"  \n\"OK HWAT STEP OF THE SCRIPT PROCESS IS STALLING\"  \nAAAAAAAAAAAAAAAAAAAA\n\nSo you pinpoint, this is how I close $5000-10k retainers for what takes like a few weeks of audit + setup and I just install a person (human) to doulble check and iterate on the NEXT bottleneck.\n\nEz",
          "score": 3,
          "created_utc": "2026-02-20 22:42:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lhve1",
              "author": "Practical_Season_411",
              "text": "Oh yeah that's 100% right and that's the skills most miss.. Spot on..:)",
              "score": 2,
              "created_utc": "2026-02-21 13:24:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6eel36",
          "author": "SameImpression1646",
          "text": "Nobody tells you?\nBut there is a ton of posts like this",
          "score": 6,
          "created_utc": "2026-02-20 10:33:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6g3r6h",
              "author": "dsecareanu2020",
              "text": "What nobody tells you is that if you put a bit of effort into it actually everyone tells you. :))",
              "score": 2,
              "created_utc": "2026-02-20 16:31:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ev5og",
          "author": "Total-Mention9032",
          "text": "I do not think this post is genuine. It has a lot of structural flaws, and a lot of it is based on assumptions.\n\n1. Most startups are tech companies. Building n8n or Python automations is easy for their developers.\n2. If you are talking about non-tech startups, people usually do not come to you and say, “Automate my business.” Unless you already have an audience on YouTube, Instagram, LinkedIn, or somewhere else. I am saying this from my own experience.\n3. The people who contact automation agencies usually already know what they want to automate. That is why they reach out in the first place.",
          "score": 6,
          "created_utc": "2026-02-20 12:42:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ftk7b",
              "author": "keena147",
              "text": "I’m suspicious that they “spend the first week just watching”… Who could afford to do that?",
              "score": 3,
              "created_utc": "2026-02-20 15:44:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6r76c3",
              "author": "Guligal89",
              "text": "Yeah honestly I'm baffled that this half-truth air slop at best has got this much engagement and even leads\n\n\n\n",
              "score": 0,
              "created_utc": "2026-02-22 11:19:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6g0oyl",
          "author": "ds1841",
          "text": "Have you worked with retail? Any example of what could be done? No need to be specific, just some generic idea?",
          "score": 2,
          "created_utc": "2026-02-20 16:17:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fiy5t",
          "author": "babatz",
          "text": "Thanks for the post. How do you find customers ? I’d like to start offering my services.",
          "score": 2,
          "created_utc": "2026-02-20 14:53:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gsohj",
              "author": "eperon",
              "text": "By creating this post and making that EDIT",
              "score": 7,
              "created_utc": "2026-02-20 18:25:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6h31ej",
                  "author": "babatz",
                  "text": "Nice 😅",
                  "score": 1,
                  "created_utc": "2026-02-20 19:12:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6gqsjr",
          "author": "Clear_Geologist4516",
          "text": "Your calendar is awfully free; suspiciously free.",
          "score": 3,
          "created_utc": "2026-02-20 18:16:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gtcpf",
              "author": "Warm-Reaction-456",
              "text": "That's what happens when you do most of your business through referrals and not Reddit posts. First time linking publicly so yeah it's pretty open right now.",
              "score": 1,
              "created_utc": "2026-02-20 18:28:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6f81fx",
          "author": "loud-spider",
          "text": "Solid assessment of where most companies are in the race for \"AI automation now!\"",
          "score": 1,
          "created_utc": "2026-02-20 13:56:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6g8zya",
          "author": "grizzlypeaksoftware",
          "text": "I have noticed this issue too with people asking for an automation but not knowing specifically what they want to automate,  Also, the complexity and brittleness of these low code workflows tends to make it easier to just use raw code in a lot of cases.",
          "score": 1,
          "created_utc": "2026-02-20 16:55:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6geaxs",
          "author": "Ajaysharma_7",
          "text": "Hey I Want To Get My First Project Anyone Can Help Me How I Get It ??",
          "score": 1,
          "created_utc": "2026-02-20 17:19:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rxncr",
              "author": "uaconserv",
              "text": "Start writing posts on Reddit 😁",
              "score": 1,
              "created_utc": "2026-02-22 14:27:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6gn4v6",
          "author": "hansvangent",
          "text": "The moment you start chaining more than 15 nodes together in a single workflow you are building a debugging nightmare. \n\n^^ this right here, the value of sub workflows is so underrated. It also makes it so much easier to reuse components from one workflow to another. Need to scrape in a lot of your workflows? A simple subworkflow that just calls firecrawl ir crawl4ai and returns the data, can be reused over and over again.\n\nAnd indeed the debugging is a nightmare when it is one big spaghetti board with nodes for meatballs.",
          "score": 1,
          "created_utc": "2026-02-20 18:00:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gtfia",
          "author": "ReadingHappyToday",
          "text": "Did you manage to build it into a recurring (semi-passice) income stream, or do you keep getting paid project by project.",
          "score": 1,
          "created_utc": "2026-02-20 18:28:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hemzn",
          "author": "Tricky-Peace3604",
          "text": "Do you think the automation market will grow in the future?",
          "score": 1,
          "created_utc": "2026-02-20 20:08:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6higed",
          "author": "WebLenn",
          "text": "Wondering about this week where you watch them work, how are you approaching this ? I guess at that point you don't know what you're gonna automate yet so how do you convince them to pay you to just watch how they do their business and how do you put a price on this ?",
          "score": 1,
          "created_utc": "2026-02-20 20:27:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hiom4",
          "author": "mr_bitoiu",
          "text": "What are you looking forward to use/test as an alternative/improvement to n8n?",
          "score": 1,
          "created_utc": "2026-02-20 20:28:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hx1sn",
          "author": "Salt-Property1534",
          "text": "What b is N8N ????\n\nAs I have build .https://uat-com.onhercules.app/",
          "score": 1,
          "created_utc": "2026-02-20 21:39:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hzdpg",
          "author": "Ok_Honey9603",
          "text": "Have you switched to just implementing automations with code? If so, what do you use? Also how do you find your clients?",
          "score": 1,
          "created_utc": "2026-02-20 21:51:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i1skn",
          "author": "FlyingYak65",
          "text": "Who are your typical customers?",
          "score": 1,
          "created_utc": "2026-02-20 22:03:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i3dsz",
          "author": "RealisticAd1133",
          "text": "So you offer either hosting it for them via n8n cloud or setup their own self host version for them, is that correct?",
          "score": 1,
          "created_utc": "2026-02-20 22:11:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i4l1k",
          "author": "InvestigatorExtra556",
          "text": "curious tho, how do you usually convince founders to drop the “add AI everywhere” idea when a simple rule works better?",
          "score": 1,
          "created_utc": "2026-02-20 22:17:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ikevc",
          "author": "scbalazs",
          "text": "ok but like what though?",
          "score": 1,
          "created_utc": "2026-02-20 23:44:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6io4s7",
          "author": "Orenrhockey",
          "text": "How do you source clients",
          "score": 1,
          "created_utc": "2026-02-21 00:06:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6k8u2p",
          "author": "Possible-Road-4290",
          "text": "Hi there thanks for sharing \n\nIm also building no code/low code automation tools for SMBs in France and I can say you’re 100% right \n\nOne year and a half doing this and I did’t have any use case where adding AI was serving a clear business purpose \n\nStrong conditional logic/routing that sticks to the business processes are enough and do the job \n\nI wouldn’t say it’s the « simplest » automations that work, but most straightforward, definetly not the fancy « AI-powered agents » that look sexy on LinkedIn \n(in my opinion, these are non sense marketing products)",
          "score": 1,
          "created_utc": "2026-02-21 06:32:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6le5xz",
              "author": "Practical_Season_411",
              "text": "Great mate, seems like you know workflows well....\n\n",
              "score": 1,
              "created_utc": "2026-02-21 12:58:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6l0ddn",
          "author": "BrilliantRip3517",
          "text": "Appreciate you sharing this.\n\nAs someone new to client work, I’m curious about what an example of a workflow that suddenly broke and was painful to fix would be, trying to learn what usually goes wrong so I can design more defensively from the start.",
          "score": 1,
          "created_utc": "2026-02-21 10:59:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6l1vli",
          "author": "MaximumStay6875",
          "text": "Hey can I DM please",
          "score": 1,
          "created_utc": "2026-02-21 11:14:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ljpja",
          "author": "ThyroneWebDesigner",
          "text": "How do you do the lart where you eatch them work for a whole first week?",
          "score": 1,
          "created_utc": "2026-02-21 13:36:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lns1s",
          "author": "qwer640",
          "text": "Please explain briefly what do you mean with „(…) have saved clients hundreds of dollars a month in API costs just by replacing an LLM call with a basic regex filter.(…)„.\nThanks",
          "score": 1,
          "created_utc": "2026-02-21 14:01:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6m8vox",
          "author": "teyman11",
          "text": "I wanna ask something if they dont know what they wanna automate how do you pitch them or finding them without a proper or single product . I am asking seriously . Because I wanna do the same",
          "score": 1,
          "created_utc": "2026-02-21 15:57:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mbf4m",
          "author": "Ok_Editor_5090",
          "text": "About the point where everyone wants AI,\n\nQuite honestly a lot of non-tech savvy people won't know the difference between AI and a plain old procedural code and they do not care once they receive a working solution.\n\n them : I have a problem\nYou: I have a solution\nSimple as that.\nIf you can build a solution that solves the problem ( whether AI or not) then you are good. \n\nAlso, nowadays when someone mentions AI they mostly mean LLM and not the other AI tech that was there before it.",
          "score": 1,
          "created_utc": "2026-02-21 16:10:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mh7u8",
          "author": "IreneWinslow",
          "text": "Totally get this. In my experience, automation helps a lot but only if the process is clear and organized. otherwise, it can just cause more problems.",
          "score": 1,
          "created_utc": "2026-02-21 16:39:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nm26q",
          "author": "Delicious_Mix_3007",
          "text": "How do you find clients mostly? From which platforms or ways?",
          "score": 1,
          "created_utc": "2026-02-21 20:04:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6p28g8",
          "author": "scarbez-ai",
          "text": "I am sorry but I don't see it. What type of startups or businesses? Not challenging but trying to understand.\n\nI have worked for startups (software and biotechs) up to financial companies with up to 1.7T in AUM. I cannot imagine any of them paying an external contractor for n8n work.\n\nWhy?\n\nBecause n8n is an end user tool. Sure it is not Word but more like a Jira or SharePoint, products with which you can do a lot but you need little knowledge to do the minimal. And for those you need an admin and maybe some parameterizers (I purposely refrain from calling them developers).\n\nSo, unless those startups and businesses are from boomers or people who are technically challenged, I don't see why they would not have someone learn and do it themselves. I mean... It is not development. Not even vibe coding...\n\nIn the near future any technically-oriented worker will be able to use all those tools proficiently themselves, especially now that companies are pushing for employees to get up to speed with AI (or be shown the door).\n\nNot trying to be a dick but I seriously don't see it long term.",
          "score": 1,
          "created_utc": "2026-02-22 00:59:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qvrr7",
          "author": "Wet_Assistance",
          "text": "100%. Everyone asks for 'AI Agents' until they see the error rate. Then they just want a reliable script that parses invoices correctly every time. Simple problems, boring solutions, paid invoices. that's what i'd want too.",
          "score": 1,
          "created_utc": "2026-02-22 09:30:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ry6na",
          "author": "uaconserv",
          "text": "Great post, nicely put, we are still standing on the fence watching from sidewalks, the speed at which Claude and Antigravity are moving, unable to take a call should we initiate the N8N scaling or still hold on for another couple of months.",
          "score": 1,
          "created_utc": "2026-02-22 14:30:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6s1sq3",
          "author": "Apprehensive-Being34",
          "text": "I’m looking for someone to make me an n8n automation for my reels, I already use heygen to generate but then take the video and do manual editing, animation, captions etc. If you have done this before dm me.",
          "score": 1,
          "created_utc": "2026-02-22 14:49:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v24t3",
          "author": "VelocityOption",
          "text": "Here's what no one tells you:\n\nThe SECRET:\n\nWhat I Use INSTEAD Of n8n To Close 6-Figure Enterprise Contracts:\n\n*(and other assorted clickbait headlines...)*\n\nThis was generated and posted by AI as part of inbound marketing for this guy's n8n service.\n\nOptimized to tap into query traffic for \"n8n for startups\".\n\nAnd the thing is it works - because that's what AI is best at - being \"good enough\" to get a 60-70% grade.\n\nBest way to get n8n clients?\n\nJust piggyback off zero-effort shitposts like these with your own authentic service pitch.\n\nI've been doing Marketing & Sales process architecture & CRM automation for SMBs for 10+ years. If you need someone that can call out BS and fix your fundamentals BEFORE you start automating, DM me.\n\nIn the age of AI takeover, being human sells.\n\nDrop that into your GPT5 so it can \"break it down cleanly for you - without the mysticism\".",
          "score": 1,
          "created_utc": "2026-02-22 23:38:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v2ag5",
          "author": "Reasonable-Book-6471",
          "text": "DMs",
          "score": 1,
          "created_utc": "2026-02-22 23:39:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6vvw1o",
          "author": "Old-Objective-863",
          "text": "This resonates with my data engineering work. The \"split complex workflows into smaller ones\" advice is golden - we learned this the hard way with Airflow DAGs. When a 50-task pipeline fails at step 47, debugging is a nightmare. Now we break everything into logical chunks that can run and be tested independently. Makes maintenance so much easier.",
          "score": 1,
          "created_utc": "2026-02-23 02:34:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f5d7x",
          "author": "amritwaraich",
          "text": "What do you think about antigravity, claude code or open claw replaceing n8n in a year or two?",
          "score": 1,
          "created_utc": "2026-02-20 13:42:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rxexi",
              "author": "uaconserv",
              "text": "Watching closely, ready to pivot",
              "score": 1,
              "created_utc": "2026-02-22 14:26:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6em329",
          "author": "jannemansonh",
          "text": "the invoice parsing point is real... moved those workflows to needle app since it actually understands what's in the pdfs vs just extracting text. way easier than wiring together nodes for document stuff, especially when clients want custom fields parsed",
          "score": 0,
          "created_utc": "2026-02-20 11:36:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eon4s",
          "author": "Mobile_Throat9080",
          "text": "Absolutely right , before even going into the workflow , I always audit clients work ,this helps to understand if they want the automation or not.\n\nPeople have a tendency of thinking AI automations are some magic pill that will replace the human initiated efforts but it's just a tool to make your task smoother and faster .",
          "score": 0,
          "created_utc": "2026-02-20 11:56:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f7dpf",
          "author": "redtron3030",
          "text": "When you say most founders have no idea of what they want, that is exactly what good business owners do. They hire out expertise where they can’t roll out themselves. That should always be the expectation.",
          "score": 0,
          "created_utc": "2026-02-20 13:53:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6n4rrp",
          "author": "akirozen",
          "text": "Why didn't you build thousands of workflows\n Why not millions. Are you looser or what?",
          "score": 0,
          "created_utc": "2026-02-21 18:36:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kuigt",
          "author": "Puzzleheaded_Case895",
          "text": "if anyone needs an automation or internal tool dm me , I already worked with multiple agancies and built multiple tools that are shown in my portfolio [https://portfoliohammer.vercel.app/](https://portfoliohammer.vercel.app/)",
          "score": -1,
          "created_utc": "2026-02-21 10:02:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra50to",
      "title": "zerobounce wants $65 per 10k emails. neverbounce wants $80. hunter wants $100. i built the same thing in n8n for $0.",
      "subreddit": "n8n",
      "url": "https://v.redd.it/yzr0kj8fbpkg1",
      "author": "ayushopchauhan",
      "created_utc": "2026-02-20 19:31:07",
      "score": 191,
      "num_comments": 31,
      "upvote_ratio": 0.97,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1ra50to/zerobounce_wants_65_per_10k_emails_neverbounce/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o6i52zp",
          "author": "jake_that_dude",
          "text": "the catch-all domain problem is the edge case that'll bite you. some mail servers return \"mailbox exists\" for every address regardless, so your smtp check passes but the email still bounces. paid services maintain databases of known catch-all domains to flag these.\n\nworth adding a catch-all detection step and marking those as \"risky\" in the confidence score rather than valid.",
          "score": 22,
          "created_utc": "2026-02-20 22:20:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k7d2b",
              "author": "ayushopchauhan",
              "text": "good call but it's already in there. before checking the real email, the workflow sends a RCPT TO for a randomly generated gibberish address (something like xq9z7k2m4p8v@domain.com). if the server accepts that fake address, the domain is catch-all and every email on that domain gets flagged.  \n  \ncatch-all emails are capped at a lower confidence score (around 50 instead of 80+) and marked as risky, not valid. if the email also has a gravatar profile it gets bumped up slightly since that's at least some evidence a real person uses the address, but it never reaches \"safe to send\" on catch-all alone.  \n  \nthe result is cached per domain too so it only checks once per domain instead of sending a gibberish address for every email on the same domain.  \n  \nyou're right though, it's the hardest edge case. even paid services struggle with it. there's no way to confirm individual mailboxes on a catch-all domain. best you can do is flag it and let the user decide.",
              "score": 11,
              "created_utc": "2026-02-21 06:19:46",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6jmbzu",
              "author": "Plenty_Attorney_6658",
              "text": "That's what I faced. I made a lead generation and outreach but most of my mails didn't even delivered and I got flagged by that and my Gmail account got in danger",
              "score": 3,
              "created_utc": "2026-02-21 03:39:09",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6jmd30",
              "author": "Plenty_Attorney_6658",
              "text": "Any solution to this?",
              "score": 2,
              "created_utc": "2026-02-21 03:39:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6k7mmg",
                  "author": "ayushopchauhan",
                  "text": "yeah that's exactly what the workflow is for. the catch-all problem the comment above describes is one of the main reasons emails bounce even when the address \"looks\" valid.  \n  \nwhat probably happened is you scraped or collected leads, some of them were on catch-all domains, your verification (if you used one) said they were fine, and then when you sent to them they bounced. enough bounces and gmail flags your account.  \n  \nthis workflow catches that before you send. catch-all domains get flagged as risky so you can either skip them entirely or send to them slowly from a separate domain you don't mind warming up.  \n  \nthe free version i shared in the post does this. if you're doing outreach regularly the pro version handles it automatically through a telegram bot, just send it your list and it gives you back the csv of the safe ones and a full report as well.  \n  \nfor your gmail account, if it's already flagged you'll want to stop sending from it for a few days, lower your daily volume when you start again, and only send to verified addresses going forward.",
                  "score": 1,
                  "created_utc": "2026-02-21 06:22:06",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6k9tlk",
          "author": "netmillions",
          "text": "Problem is the IPs. When you make enough requests, the ESPs will start blocking them. It's not the SMTP handshake result that you're paying these services for, it's the hundreds and thousands of IPs it takes to get those results. Test your system against a few valid Hotmail, Yahoo, AOL emails over several days and you'll see how quickly your IPs get flagged, if the entire Hetzner/Contabo block isn't already.",
          "score": 11,
          "created_utc": "2026-02-21 06:41:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kaqpg",
              "author": "ayushopchauhan",
              "text": "you're not wrong about the ip side. that's a real limitation and i should be upfront about it.  \n  \na few things the workflow does to deal with this:  \n  \nyahoo, aol, and icloud are already marked as unverifiable via smtp in the workflow. it doesn't even try. those get scored based on mx records, spf, dmarc, and other signals instead. for hotmail/outlook consumer addresses it uses microsoft's public GetCredentialType api to check if the account exists rather than relying on smtp alone.  \n  \nfor everything else the workflow does domain interleaving (shuffles emails so the same server doesn't get hit back to back), adaptive rate limiting (longer delays for google, shorter for different servers), and an auto-retry loop that waits a few minutes and retries anything that got temporarily blocked.  \n  \nbut yeah, if you're running 10k emails through a single hetzner ip every week, you'll get blocked eventually. that's just how it works. paid services rotate through thousands of ips and that's a real advantage they have at scale.  \n  \nthis is built more for people cleaning their own lists a few times a month. a few hundred to a couple thousand at a time. for that use case a single clean ip holds up fine in my experience. if you're running a verification service or doing this at high volume daily, you'd need an ip rotation setup on top of this or just use a paid service at that point.  \n  \nfair criticism though. the ip pool thing is genuinely the main advantage paid services have over a self-hosted approach.",
              "score": 4,
              "created_utc": "2026-02-21 06:50:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6kckh1",
                  "author": "netmillions",
                  "text": "Cheers for being honest! And all the best with the project. :)",
                  "score": 3,
                  "created_utc": "2026-02-21 07:06:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6kx5ct",
          "author": "Brussels_AI_Agency",
          "text": "Great job and great research.",
          "score": 5,
          "created_utc": "2026-02-21 10:28:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l1cr3",
              "author": "ayushopchauhan",
              "text": "thanks man, appreciate that! \n\n",
              "score": 1,
              "created_utc": "2026-02-21 11:09:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ihmu6",
          "author": "OneWholeJigglyByte",
          "text": "When you compared zerobounce's/hunter results to your n8n output was the result the same? If it was different was it by a lot?",
          "score": 3,
          "created_utc": "2026-02-20 23:28:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k7tp6",
              "author": "ayushopchauhan",
              "text": "i tested against zerobounce on a list of about 300 emails. the results matched on roughly 90% of addresses. the cases where they disagreed were mostly:  \n  \n\\- catch-all domains: zerobounce has a bigger internal database of known catch-all domains built up over years. my workflow detects catch-all in real time by probing the server, which works but some servers behave differently depending on when you check. end result is similar but not identical.  \n  \n\\- yahoo/icloud/protonmail: these providers block smtp verification entirely. both my workflow and zerobounce mark these based on other signals (dns records, domain reputation). zerobounce might have some proprietary data here that i don't have access to. my workflow scores them conservatively and marks them as risky rather than guessing.  \n  \n\\- the emails both agreed on (valid or invalid) were almost always the same verdict. smtp verification is smtp verification. if the mail server says the mailbox exists, that's the same answer regardless of who's asking.  \n  \nwhere paid services have an edge is historical data. they've verified billions of emails and remember which ones bounced before. my workflow checks everything fresh each time which is actually better for accuracy on active mailboxes but worse for catching addresses that recently went inactive.  \n  \nfor most use cases the difference won't matter. if you're sending cold outreach to a few hundred or a few thousand leads, the results are close enough that you won't notice a difference in bounce rates.",
              "score": 3,
              "created_utc": "2026-02-21 06:23:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6kruiz",
          "author": "GilDev",
          "text": "Your time is $0?",
          "score": 3,
          "created_utc": "2026-02-21 09:36:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l0037",
              "author": "ayushopchauhan",
              "text": "the opposite actually. i value my time a lot, which is why i automated it.\n\ni verify \\~1,350 emails every day for cold outreach. it runs in the background. upload csv, walk away, clean list comes back. zero hands-on time per run.\n\ntook about 20 hours to build. at my current volume the verification services would cost a few thousand a year. now it costs nothing.\n\nthe expensive option was keeping the subscription.",
              "score": 3,
              "created_utc": "2026-02-21 10:56:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6tlvv8",
                  "author": "afbdreds",
                  "text": "Opportunity cost problem. What this person is trying to say is that you have to compare the 700 year with your hour rate times hours taken to build this. There is no such thing as $0 as you wrote in post head.",
                  "score": 1,
                  "created_utc": "2026-02-22 19:08:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6l4w7e",
          "author": "nevertoolate1983",
          "text": "Very, very cool",
          "score": 3,
          "created_utc": "2026-02-21 11:42:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lse7o",
              "author": "ayushopchauhan",
              "text": "Thank you so much, man!",
              "score": 1,
              "created_utc": "2026-02-21 14:29:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6mmk5n",
          "author": "Aggravating-Base-883",
          "text": "Nice, will check it. Thank you.",
          "score": 2,
          "created_utc": "2026-02-21 17:05:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6mrw60",
              "author": "ayushopchauhan",
              "text": "thanks man! let me know if you need and help.",
              "score": 1,
              "created_utc": "2026-02-21 17:32:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6oik1i",
          "author": "Codingchym",
          "text": "N8n still the best, good work",
          "score": 2,
          "created_utc": "2026-02-21 22:59:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qiznq",
              "author": "ayushopchauhan",
              "text": "appreciate it, thanks!",
              "score": 2,
              "created_utc": "2026-02-22 07:28:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6qb4v4",
          "author": "testbot1123581321",
          "text": "Can setup my own email server on Linux cheaper",
          "score": 2,
          "created_utc": "2026-02-22 06:16:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qj6pp",
              "author": "ayushopchauhan",
              "text": "a mail server and an email verifier are two different things. a mail server sends and receives email. this workflow verifies whether other people's email addresses exist before you send to them.  \n  \nyou could run your own mail server for sending, sure. but you'd still need to verify your recipient list before sending through it or your server's ip gets blacklisted from bounces. that's what this does.",
              "score": 1,
              "created_utc": "2026-02-22 07:30:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6sbv7u",
          "author": "Big-Business-AJL",
          "text": "That's fantastic",
          "score": 2,
          "created_utc": "2026-02-22 15:39:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6u4lcn",
              "author": "ayushopchauhan",
              "text": "thanks man! ",
              "score": 1,
              "created_utc": "2026-02-22 20:42:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ny6j8",
          "author": "ManyWitty4946",
          "text": "All emails you sent will go straight to spam or they wont even reach the destination. You dont understand how it works.",
          "score": 0,
          "created_utc": "2026-02-21 21:08:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qiy2y",
              "author": "ayushopchauhan",
              "text": "this workflow doesn't send any emails. it verifies them.  \n  \nit connects to the mail server, does the smtp handshake up to RCPT TO, gets the response (mailbox exists or doesn't), and disconnects. no DATA command is ever sent. no email body. no headers. nothing lands in anyone's inbox or spam folder.  \n  \nit's the same thing every paid verification service does. the smtp protocol lets you check if a recipient address is valid without actually delivering a message.",
              "score": 1,
              "created_utc": "2026-02-22 07:28:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6qjec6",
                  "author": "ManyWitty4946",
                  "text": "Ah ok, I misunderstood it then. Thank you!",
                  "score": 2,
                  "created_utc": "2026-02-22 07:32:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r8e7m4",
      "title": "I got tired of managing my n8n workflows from mobile… so I built this.",
      "subreddit": "n8n",
      "url": "https://i.redd.it/8bnfjt54bbkg1.png",
      "author": "Ok-Scar8556",
      "created_utc": "2026-02-18 20:24:48",
      "score": 121,
      "num_comments": 46,
      "upvote_ratio": 0.88,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1r8e7m4/i_got_tired_of_managing_my_n8n_workflows_from/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o64rzeo",
          "author": "OG_Romes",
          "text": "Nice fake testimonials",
          "score": 21,
          "created_utc": "2026-02-18 21:49:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67jfvu",
              "author": "Ok-Scar8556",
              "text": "You're right to call that out \n\n my bad. Those were placeholder examples for the landing page mockup, definitely should have labeled them clearer. I'm actually removing them to focus on real user feedback. Appreciate the honesty 🙏",
              "score": -6,
              "created_utc": "2026-02-19 08:18:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o67kvj3",
                  "author": "Levfo",
                  "text": "No one actually cares, this was one person on Reddit.",
                  "score": 4,
                  "created_utc": "2026-02-19 08:32:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o67ximf",
                  "author": "the_elkk",
                  "text": "No worries, eventually, you'll have real testimonials to put in there. Thanks for the idea. Looking forward to the IOS version in the appstore and also willing to pay a yearly fee.",
                  "score": 2,
                  "created_utc": "2026-02-19 10:35:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o64tlaa",
          "author": "Palleri",
          "text": "Soo, this need to be able to connect from the internet back to my selfhosted instance?\n\nWhy do i need to create an account?\n\nI already have an account (my selfhosted n8n)\n\nThis does not connect directly to my selfhosted instance?",
          "score": 10,
          "created_utc": "2026-02-18 21:56:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67jst2",
              "author": "Ok-Scar8556",
              "text": "Good questions!\n\n1. **Connection**: Yes, the app connects directly to your instance via your API key/webhook. No proxy, no middleman — your data stays between your phone and your server.\n2. **Account**: It's required for now because it's beta + I'm building in lesson progress tracking (upcoming n8n courses feature). But I hear you: if you just want to manage workflows, the account step feels extra.\n\nQuick Q for you: Would you actually use a feature to host/manage multiple n8n instances *from* the app? Or is direct connection enough? Trying to prioritize what's useful vs. noise",
              "score": 3,
              "created_utc": "2026-02-19 08:21:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o67km1m",
                  "author": "Palleri",
                  "text": "For me, I only use single selfhosted instance. \n\nI cannot connect to my instance using fqdn (HTTPS selfsigned cert).\nJust a quick error (could not connect to instance or something lile that)\n\nCan check my logs later today that might help troubleshoot it.",
                  "score": 1,
                  "created_utc": "2026-02-19 08:29:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o666s6s",
          "author": "TheAnu-",
          "text": "Sorry, didn’t self-host so I pay 5-10$ per month for API wrapper. Would rather have an ipad.",
          "score": 6,
          "created_utc": "2026-02-19 02:22:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67jaoo",
              "author": "Ok-Scar8556",
              "text": "Fair point! If you're already happy with the iPad web UI, totally get it. I built this because I needed something faster for quick checks/triggering on the go. But yeah, for heavy workflow editing, a tablet or laptop is still king 👍",
              "score": 1,
              "created_utc": "2026-02-19 08:16:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o696nr3",
          "author": "epidco",
          "text": "tbh the n8n mobile browser experience is actual pain lol. been there when a workflow hangs and u gotta squint to find the execution log while ur out. i self host everything on hetzner using docker so if this handles instances behind cloudflare tunnels without issues im def interested. the direct api connection is a smart move too keeps things way more secure than using some random proxy. logic sounds solid if the keys stay local on the device.",
          "score": 3,
          "created_utc": "2026-02-19 15:26:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6e7nw8",
              "author": "Ok-Scar8556",
              "text": "Haha same, the mobile UI struggle is real 😅\n\nYep, works fine with Cloudflare Tunnels  just use your tunnel URL as the instance address. As long as it's HTTPS with a valid cert, you're good.\n\nAnd yeah, direct API + keys stored locally was a no-brainer for me too. No proxy, no middleman, just your phone talking to your server.\n\nIf you try it and something breaks with your Hetzner setup, lmk — happy to debug. Always down to make it work for real self-hosted flows.\n\nLink if you wanna test: [n8n hub app](http://n8n-hub.site/)\n\nCheers ",
              "score": 1,
              "created_utc": "2026-02-20 09:29:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6mi4vh",
          "author": "An0n_666",
          "text": "Just tried it, it's a great idea and thank you for putting this together!\n\nI'd love to be able to actually look at the nodes in a workflow so i can change anything that needs to be changed.\nDo you forsee that coming in the future at all?\n\nPersonally, I do a lot of work on the road, and if something goes wrong, like say an endpoint updates and i need to change the url, I'd like to be able to do that from my phone rather than waiting until I'm back at my pc for such a simple change.\n\nThis is great to monitor, though I'd assume many users have setup error notices to themselves. I love being able to quickly turn off a flow, that's very useful!\n\nThank you for building this. Looking forward to what is to come!",
          "score": 2,
          "created_utc": "2026-02-21 16:43:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6nyjmz",
              "author": "Ok-Scar8556",
              "text": "Thank you so much for taking the time to try it.\n\nThis is still the beta version. If you've encountered any problems or have any suggestions, I'd love to hear them.\n\nYou can even DM me directly if you prefer.",
              "score": 1,
              "created_utc": "2026-02-21 21:10:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6t9x1z",
          "author": "dszp",
          "text": "Looks interesting, signed up for iOS waitlist!\n\nDoes it support adding two custom HTTP headers to all HTTP requests? Would love to have it support CloudFlare Tunnel Service Tokens which would allow for REST API access without making it accessible to the public.\n\nI know some other apps do similar; one that’s not n8n specific is the “Plappa” iOS app for playing Audiobookshelf books—add two headers and values and now only the app can access the service over the internet. I’m sure there are others, but that’s the example I use personally all the time!",
          "score": 2,
          "created_utc": "2026-02-22 18:13:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tm55l",
              "author": "Ok-Scar8556",
              "text": "Thanks for signing up + the solid feedback \n\nCustom HTTP headers isn't supported yet, but it's a great idea  especially for Cloudflare Tunnel tokens. That's a smarter way to keep instances private than just \"public URL + hope\".\n\nI'll add this to the roadmap. \n\nQuick Q: would you need this for all requests, or just specific ones? Helps me scope it right.\n\nIf you're open to it, I can DM you when a test build with this feature is ready.\n\nmerci beaucoup.",
              "score": 1,
              "created_utc": "2026-02-22 19:09:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o67jkel",
          "author": "Motor_Fail3789",
          "text": "For everyone who is as disappointed as me about a paid wrapper post\n\nHere is a free n8n workflow manager iphone app if found  \n[https://apps.apple.com/us/app/nodera/id6758625563](https://apps.apple.com/us/app/nodera/id6758625563)",
          "score": 2,
          "created_utc": "2026-02-19 08:19:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67ks4b",
              "author": "Ok-Scar8556",
              "text": "Thanks for sharing Nodera!\n\nIt's always good to have options within the ecosystem.\n\nFor those comparing: n8n Hub places a greater emphasis on learning. I'm adding ready-made workflow templates and n8n mini-courses (with progress tracking) to help users improve their automation skills while managing their workflows.\n\n(By the way, n8n Hub is available on Android, and the iOS version is coming soon, in case anyone's interested.)\n\n Nodera = your workflow dashboard. n8n Hub = dashboard + Template n8n",
              "score": -1,
              "created_utc": "2026-02-19 08:31:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o65re9a",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-19 00:52:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o65rmd2",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-02-19 00:54:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o65s3zo",
                  "author": "Elgon2003",
                  "text": "Given how fresh the app is I wouldn't pay for it personally but I can see potential",
                  "score": 1,
                  "created_utc": "2026-02-19 00:56:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o67l0a6",
          "author": "Specialist_Garden_98",
          "text": "May I know how it works on the nodes side of things on N8N. Like are we using the webhook nodes to connect our instance to your platform or what? Basically can you tell me what steps are involved to go from our workflow working as is to managing them on your platform. You can tell me on DM if you want as well.",
          "score": 1,
          "created_utc": "2026-02-19 08:33:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67nma9",
              "author": "Ok-Scar8556",
              "text": "Excellent question! I'm happy to help \n\nShort answer: No webhook is required. The application connects directly to your n8n instance via its REST API (the same one used with curl or Postman).  \nAlso, if you're using basic authentication or custom headers, please let me know. I'll add support for these methods in the next update.",
              "score": 1,
              "created_utc": "2026-02-19 08:59:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o67v23z",
          "author": "GulfM7R",
          "text": "Any chance of a little more oversight on the app and code, not that I don't trust it, it's just that I don't trust anyone these days. This would be insanely helpful, however, I'm fearful of data leaks and breaching compliance metrics relating to my professional and licence obligations with the data.\n\nHow can I be sure it's entirely phone to instance, without a silent middleman?",
          "score": 1,
          "created_utc": "2026-02-19 10:12:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67w7h1",
              "author": "Ok-Scar8556",
              "text": "Totally valid concern \n\nand honestly, I respect the skepticism. In today's world, \"**trust but verify**\" is the only sane approach \n\nHow you can verify it's truly direct (no middleman):\n\n App permissions: The app only requests network access. No analytics SDKs, no tracking libraries, no background data collection.",
              "score": 1,
              "created_utc": "2026-02-19 10:23:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6drnpm",
          "author": "spellinn",
          "text": "Would your app be able to access  API keys stored in credential objects?",
          "score": 1,
          "created_utc": "2026-02-20 06:59:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6e7t17",
              "author": "Ok-Scar8556",
              "text": "Good question — short answer: no 🔐\n\nThe app can't access your n8n credential objects. You just paste your API key manually, and it stays encrypted on your phone (Keychain/Keystore). Never sent anywhere else.\n\nYou stay in control: generate/revoke the key anytime in n8n, and the app only uses basic API access — nothing deeper.\n\nIf you want to rotate the key later, just update it in settings. Takes 10 sec.",
              "score": 1,
              "created_utc": "2026-02-20 09:30:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6id1kt",
          "author": "ElFeyoMx",
          "text": "Solo sirve para ver el resultado de ejecuciones, activar y desactivar workflows? Que más tienes pensado implementar?",
          "score": 1,
          "created_utc": "2026-02-20 23:02:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ioc4t",
              "author": "Ok-Scar8556",
              "text": "It is currently in beta version But I also wanted to add other features like chat via a webhook, lessons, But I don't want to bombard people with features they won't find useful. I've already integrated the workflow, so we can download it directly into your instance. But after reaching my first 50 users,No one has uploaded a single workflow So I'm wondering if it's a good idea to add more features.",
              "score": 1,
              "created_utc": "2026-02-21 00:07:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o65e21e",
          "author": "PakLong2556",
          "text": "You can carry an iPad with you when you go out, it should solve your problem.",
          "score": 1,
          "created_utc": "2026-02-18 23:38:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67jua8",
              "author": "Ok-Scar8556",
              "text": "Haha, true! But my pocket disagrees 😅. I wanted something lightweight for quick checks without pulling out a tablet. But yeah, if you're already carrying an iPad, the web UI works fine!",
              "score": 1,
              "created_utc": "2026-02-19 08:22:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o661fxb",
          "author": "radujohn75",
          "text": "So, I want to install a few automations for myself. Will do a VPS with Dockers containers. How can I connect to all automations?",
          "score": 1,
          "created_utc": "2026-02-19 01:51:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67jx89",
              "author": "Ok-Scar8556",
              "text": "Yep, that's exactly what n8n Hub is for! You can add multiple instances in the app (each with its own API key), switch between them instantly, and monitor/trigger workflows across all your Docker containers. No need to SSH in or open multiple browser tabs. Let me know if you hit any setup issues \n\nhappy to help.",
              "score": 2,
              "created_utc": "2026-02-19 08:22:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o64ol6p",
          "author": "mandanda6",
          "text": "Absolutely magnificent I just saw that there are already templates that can be easily installed. Absolutely magnificent",
          "score": -2,
          "created_utc": "2026-02-18 21:33:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67jzj1",
              "author": "Ok-Scar8556",
              "text": "Thanks so much! 🙌 Glad you're finding the templates useful. I'm adding more every week \n\n if there's a specific workflow type you'd like to see, drop a suggestion. Happy automating",
              "score": 1,
              "created_utc": "2026-02-19 08:23:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o64am1r",
          "author": "TokenTallyDotApp",
          "text": "This sounds super helpful! Managing n8n workflows on mobile has always been a hassle, so having a dedicated app that connects directly to the instance without needing proxies is a smart move. Being able to activate or deactivate workflows and check logs quickly from your phone could save a lot of time and frustration, especially when you're out and a client needs a fix ASAP. I'd love to hear more about how you handle authentication and security since it connects directly to n8n instances. Also, do you plan to add any notification features for failed executions or other alerts? I'm definitely going to give it a try and see how it fits into my workflow. Thanks for building something like this!",
          "score": -7,
          "created_utc": "2026-02-18 20:28:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dig15",
              "author": "TokenTallyDotApp",
              "text": "Yikes. Crazy amount of hate. How come?",
              "score": 1,
              "created_utc": "2026-02-20 05:39:05",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o64bpaz",
              "author": "Ok-Scar8556",
              "text": "Thanks, I really appreciate that.\nSecurity was actually my main concern when building it. I didn’t want to introduce any middle layer or external server handling credentials.\nThe app connects directly to your n8n instance using your API key. There are no proxy servers and no backend owned by me in between. All communication goes straight from the device to your instance over HTTPS.\nAPI keys are stored locally on the device using encrypted storage (Android secure storage). They never leave the device and are never transmitted anywhere except directly to your n8n instance.",
              "score": -1,
              "created_utc": "2026-02-18 20:33:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o64epky",
                  "author": "TokenTallyDotApp",
                  "text": "Very cool",
                  "score": -1,
                  "created_utc": "2026-02-18 20:48:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o64bt2p",
              "author": "Ok-Scar8556",
              "text": "Regarding notifications: yes, that’s something I’m actively working on. The plan is to support:\n• Failed execution alerts\n• Workflow status change alerts\n• Possibly filtered notifications (only specific workflows)",
              "score": -1,
              "created_utc": "2026-02-18 20:34:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r6qq94",
      "title": "The 5-5-5 rule I use before building any automation",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1r6qq94/the_555_rule_i_use_before_building_any_automation/",
      "author": "Available_Cupcake298",
      "created_utc": "2026-02-17 00:13:25",
      "score": 95,
      "num_comments": 16,
      "upvote_ratio": 0.94,
      "text": "I used to automate things that didn't really need automating. Lost hours building n8n workflows for tasks I'd do twice a year.\n\nNow I check three things before building anything:\n\n1. Does it take 5+ minutes each time?\n2. Do I do it 5+ times per week?\n3. Will I still be doing it 5 months from now?\n\nIf yes to all three — build the workflow. If not, just do it manually.\n\nEmail triage? Yes. Monthly one-pager for a client? Borderline. One-off data export? No.\n\nSaved me from wasting time on automations that never ran after week one.\n\nAnyone else have a framework for deciding what's actually worth the build time?",
      "is_original_content": false,
      "link_flair_text": "Servers, Hosting, & Tech Stuff",
      "permalink": "https://reddit.com/r/n8n/comments/1r6qq94/the_555_rule_i_use_before_building_any_automation/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o5s9bq1",
          "author": "-whis",
          "text": "Automation is so much more than time saved. The biggest benefit in organizations is it being less error prone - and where there are errors, the error becomes consistent with automation.\n\nI’ll say it till I’m blue in the face despite me replying to an entirely AI written post lol",
          "score": 16,
          "created_utc": "2026-02-17 00:51:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5sje7t",
              "author": "Available_Cupcake298",
              "text": "the consistency point is massively underrated. when a human forgets a step, you have no idea why. when automation fails, at least you can debug it.\n\n(and guilty as charged on the AI-assisted post — though the 5-5-5 rule itself I actually use)",
              "score": 6,
              "created_utc": "2026-02-17 01:51:15",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6mgmi1",
              "author": "amyredford",
              "text": "Really good advice... Automation is not just about saving time its about reducing errors and creating consistency. Having a simple rule building anything helps avoid over doing an keeps things practical.",
              "score": 0,
              "created_utc": "2026-02-21 16:36:20",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6ngx3c",
              "author": "IreneWinslow",
              "text": "Totally agree, Automation does not just save time it helps avoid mistakes too. Even little changes can make work a lot easier. Makes me wish i started automating sooner.",
              "score": 0,
              "created_utc": "2026-02-21 19:37:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6o41rl",
              "author": "MaxMcregor",
              "text": "Exactly, automation makes results consistent, not just faster. When something breaks, you fix the system once instead of repeating the same mistakes. That reliability is what actually lets teams scale smoothly, because the process stays solid even as workload grows. ",
              "score": 0,
              "created_utc": "2026-02-21 21:39:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5spu8x",
          "author": "jeandenas",
          "text": "My only rule is: does the client want to pay for this automation? If yes, I do it.",
          "score": 9,
          "created_utc": "2026-02-17 02:30:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vghg9",
              "author": "New-Independence2031",
              "text": "This is it. And if they are willing to pay even more, i can hurry.",
              "score": 4,
              "created_utc": "2026-02-17 14:47:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5sbi32",
          "author": "Officialshotz",
          "text": "That’s a solid workflow to vet your workflows. \n\nI tend to explore until I find a piece of tech I don’t really understand. Then I force build an automation on something that I do ( even rarely) so I can build and learn that piece of tech and try to add it to my toolbox.\n\nI think building workflows for those one off can be beneficial if you implement a new framework or some sub action that uses a tool you might not be aware of. \n\nA new type of trigger, how to move/update data faster or more stable, custom gui options and dashboards!\n\nEverything is a lesson (I need a lesson on formatting , or maybe I should just allow ai to reformat everything I say at this point)\n\nMy framework to answer the actual question, apologies for the rant. \n\nIs there anything else to be gained from this type of workflow? Will this expand my toolkit but also get rid of an annoying task or time waste. How do I automate better and does this help achieve that. ",
          "score": 1,
          "created_utc": "2026-02-17 01:03:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sk3ca",
          "author": "DumplingDarling_1",
          "text": " simple and practical. I usually do a quick “time vs frequency vs impact” check too, and if the payoff isn’t clear, I skip the automation. Saves a ton of wasted effort.",
          "score": 1,
          "created_utc": "2026-02-17 01:55:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tylle",
          "author": "Vaibhav_codes",
          "text": "Love this simple and practical I use a similar rule: frequency × effort × longevity If a task is repetitive, time consuming, and likely to stick, it’s worth automating; otherwise, manual is fine Saves so much wasted build time",
          "score": 1,
          "created_utc": "2026-02-17 08:05:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5utt6z",
          "author": "jklaze",
          "text": "Sometimes I build something because I want to",
          "score": 1,
          "created_utc": "2026-02-17 12:37:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wrwlg",
          "author": "drockhollaback",
          "text": "If that works for you, great. Personally, some of my most useful automations are for things that I would only do once a month otherwise, but the time (and, honestly, the effort/mental lift) saved is absolutely worth the energy I put into setting up the automation.",
          "score": 1,
          "created_utc": "2026-02-17 18:38:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5x4mm2",
              "author": "Available_Cupcake298",
              "text": "yeah the mental lift piece is the one most people skip in the calculation. not having to context-switch back into a task you last touched a month ago is huge. the 5-5-5 rule is more of a gut-check for the obvious waste cases, not a veto on the low-frequency stuff.",
              "score": 2,
              "created_utc": "2026-02-17 19:37:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5x48vf",
          "author": "South_Programmer_951",
          "text": "So if it takes 1 minute but you do it 500x a week, you don't automate it? Maybe it's better to just automate it if it takes more than 25 minutes per week.",
          "score": 1,
          "created_utc": "2026-02-17 19:36:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xss8u",
              "author": "Available_Cupcake298",
              "text": "Fair point. Yeah if you're hitting it 500 times a week you should definitely automate. I guess the rule's more of a sanity check for things that happen less often. Frequency matters more than the actual time per task.",
              "score": 1,
              "created_utc": "2026-02-17 21:32:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5xuqq1",
                  "author": "South_Programmer_951",
                  "text": "if>5x5-5 rule",
                  "score": 1,
                  "created_utc": "2026-02-17 21:41:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r95t1k",
      "title": "I built a fully automated job application pipeline in n8n — daily scheduling, AI cover letters, CV adaptation, and email sending",
      "subreddit": "n8n",
      "url": "https://i.redd.it/9olat4t2nhkg1.png",
      "author": "Fresh-Daikon-9408",
      "created_utc": "2026-02-19 17:41:57",
      "score": 93,
      "num_comments": 44,
      "upvote_ratio": 0.99,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1r95t1k/i_built_a_fully_automated_job_application/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o69yr3h",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-19 17:41:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6apdnv",
          "author": "Impressive_Flight219",
          "text": "This is fantastic! \nIt’s also augment Abel for other processes as well\nGood work",
          "score": 4,
          "created_utc": "2026-02-19 19:47:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6asohi",
              "author": "Fresh-Daikon-9408",
              "text": "Is augment Abel some kind of Reddit pass phrase ??\nOr did you genuinely meant augmentable ?\n😉",
              "score": 1,
              "created_utc": "2026-02-19 20:03:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6betp2",
          "author": "EntireExercise6779",
          "text": "Bro thats awesome. I built a workflow to get jobs from jobright and simplify and generate cover letter but jobright had too many jobs daily and i keep getting one or another error",
          "score": 4,
          "created_utc": "2026-02-19 21:52:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6bqba8",
              "author": "Fresh-Daikon-9408",
              "text": "thanks ;-)",
              "score": 1,
              "created_utc": "2026-02-19 22:51:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6c2md2",
          "author": "erock072",
          "text": "I’m all for the workflows and the build out of these alone…but I gotta know some results. Any interviews? Any offers?",
          "score": 3,
          "created_utc": "2026-02-20 00:03:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6clso9",
              "author": "CuriousExtension5766",
              "text": "Its pathetic in many ways that this is even necessary honestly.  Eventually we just gonna have bots organizing with other bots on a bot union that votes to sacrifice the meat entities.\n\nAnd I'm all for automation, but, I have never in my career had to apply to hundreds of jobs for an interview.  Most ever was probably 15 applications over a few months time.\n\nI realize I might not be the norm on that, but, sheesh, blanketing resumes to me always felt like you will not be happy with what you do get, because honestly, you're just putting yourself on a chum hook, and hoping a fish bites.",
              "score": 5,
              "created_utc": "2026-02-20 01:58:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6dvnhv",
                  "author": "Fresh-Daikon-9408",
                  "text": "It is not necessary.\nIt is a tool.\n\nThe workflow select job offers an craft an application based on your profile, not on thin air.\nYou review it and decide wether you apply or not.\n\nIn my personnal case I would never set it to send the mail directly to the recruiters, it is not even meant to be that way.\nIt sends mails to me of course.\n\nIn fact it replace the poorly selected job offers that you receive from platforms, and it attach for you a taylored job application.",
                  "score": 1,
                  "created_utc": "2026-02-20 07:35:52",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6dvaai",
              "author": "Fresh-Daikon-9408",
              "text": "I am afraid it will depends of how you feed the workflow.\nIt is not magical. It uses your real profile, xp and skills.",
              "score": 1,
              "created_utc": "2026-02-20 07:32:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6dbqz9",
          "author": "chowder138",
          "text": "My biggest worry with this is how these employers would react if they can tell that your application is AI written. Still a lot of stigma towards that in a lot of fields.",
          "score": 3,
          "created_utc": "2026-02-20 04:47:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6duwq8",
              "author": "Fresh-Daikon-9408",
              "text": "Recruiters use ai to review applications and they complain about ai made resumes 😂\n\nYou can edit the workflow to use your own writing an ask it to simply adapt to the targeted offer.\nIt is already what it is doing for résumes.\n\nIt is ai assisted but it is not made up",
              "score": 2,
              "created_utc": "2026-02-20 07:29:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6rr1tx",
                  "author": "chowder138",
                  "text": "Yep not saying it's fair, just that it's the way it is. I feel like it strongly depends on the writing style of the LLM. I think most employers would automatically reject an application that was clearly written in ChatGPT's overdramatic writing style. I've gotten professional emails from people that were written by ChatGPT and it even rubs me the wrong way. There are lots of ways that this workflow could avoid that though (giving it examples of your writing style, using an LLM that's not ChatGPT etc). \n\nBut my point is that I think your success rate with a workflow like this will be extremely dependent on whether your applications \"sound like\" they're written by AI.",
                  "score": 2,
                  "created_utc": "2026-02-22 13:49:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6dg9s3",
          "author": "DGC_David",
          "text": "I do find it oddly dystopian but nice job.",
          "score": 3,
          "created_utc": "2026-02-20 05:21:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f198u",
          "author": "Drogoff1489",
          "text": "nice workflow. the ai selection + tailored cover letter part is smart\n\none suggestion: add a quality gate before auto-sending. i'd have it save to a \"ready to send\" airtable base and then review the top matches manually before hitting send. takes 5 min/day but prevents embarrassing mismatches\n\nalso curious how you're handling application tracking - do you log which jobs got responses vs ghosted? that feedback loop would let you refine the AI selection criteria over time",
          "score": 2,
          "created_utc": "2026-02-20 13:19:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6flbfn",
              "author": "Fresh-Daikon-9408",
              "text": "Sure !  \nThe mail sending part is sending the mail to me.  \nIn the mail I have the cover letter, the resume and the application link.  \nrecruiter mails are never available, it is always via some job platform. This part is manual. I can't integrate all job application platform.  \nI don't track no.  \n ",
              "score": 1,
              "created_utc": "2026-02-20 15:05:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6g9zec",
                  "author": "Drogoff1489",
                  "text": "very cool! nice job",
                  "score": 2,
                  "created_utc": "2026-02-20 16:59:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6glk9q",
              "author": "Material-River-2235",
              "text": "I use gigup and it actually has both those features built in. you can set a manual review step before sending proposals, and it tracks all your application metrics to refine its matching over time.",
              "score": 1,
              "created_utc": "2026-02-20 17:53:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fdw70",
          "author": "Final-Donut-3719",
          "text": "This n8n setup is seriously impressive, especially the CV as code part. Most people forget that the hardest part of automation isn't the API connection. It's making sure the data enrichment stays high quality so you don't look like a bot. \n\nI've been using tools from LLM Relevance Directory to handle the strategic side of these workflows. They have specific playbooks and directory tools that help refine how you show up in AI search results and automate the boring parts of data enrichment. It definitely keeps the output feeling way more human. \n\nAre you finding that Gemini handles the CV adaptation well enough to pass through ATS filters without manual tweaks?",
          "score": 2,
          "created_utc": "2026-02-20 14:27:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fmc7p",
              "author": "Fresh-Daikon-9408",
              "text": "Thanks !  \nI use gemini 3 flash since it is very fast and cheap. It does the job quite well.  \nI could have slightly better results with gemini 3 pro or Sonnet 4.6, but not so much, since the workflow gives enough context to guide the llm correcly.",
              "score": 1,
              "created_utc": "2026-02-20 15:10:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fighc",
          "author": "Professional_Ebb1870",
          "text": "how long did this trake you \n\n",
          "score": 2,
          "created_utc": "2026-02-20 14:51:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fn2fz",
              "author": "Fresh-Daikon-9408",
              "text": "Not so much, thanks to my n8n-as-code helper. (2 hours total maybe)  \nIt was done mostly by chatting with an AI agent.  \nGive it a try if you are curious :  \n[EtienneLescot/n8n-as-code: Stop clicking. Start coding. Bidirectional n8n ↔️ VS Code sync to generate workflows via AI and enable GitOps.](https://github.com/EtienneLescot/n8n-as-code)  \nor search n8n as code in vscode marketplace.",
              "score": 1,
              "created_utc": "2026-02-20 15:13:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jnd0i",
          "author": "Chirag_160801",
          "text": "Great product, seems very useful for offcampus job hunters",
          "score": 2,
          "created_utc": "2026-02-21 03:46:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6l01k8",
          "author": "These-Paramedic835",
          "text": "This is a great workflow! Thanks for sharing.",
          "score": 2,
          "created_utc": "2026-02-21 10:56:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l3mmq",
              "author": "Fresh-Daikon-9408",
              "text": "You're welcome !",
              "score": 1,
              "created_utc": "2026-02-21 11:30:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6s6t4g",
          "author": "Jarvis037",
          "text": "Hi,\nI’m also working on a similar approach, and it’s functioning well so far. However, my biggest challenge is finding the correct email address to send my application to.\nHow are you identifying the email addresses for the roles you apply to? In other words, once you find a job that matches your skills, how do you locate the appropriate email address to submit your application?",
          "score": 2,
          "created_utc": "2026-02-22 15:15:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6sp0ww",
              "author": "Fresh-Daikon-9408",
              "text": "I don't, the email is sent to me. Then I apply via the application link.\nImpossible to have it all automatized !",
              "score": 1,
              "created_utc": "2026-02-22 16:37:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6speg2",
                  "author": "Jarvis037",
                  "text": "Ohhh okay that makes sense \nI'm this close 🤏 to automating this also.",
                  "score": 1,
                  "created_utc": "2026-02-22 16:39:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6a7x5x",
          "author": "MangoNeither8989",
          "text": "I use something similar but eventually switched to GigUp because maintaining the Upwork API integration and match scoring became a full time job itself. It handles the profile to job analysis and instant alerts so I can just focus on the proposals.",
          "score": 2,
          "created_utc": "2026-02-19 18:25:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6aui07",
              "author": "Fresh_Refuse_4987",
              "text": "Alright, I will go check it out.",
              "score": 1,
              "created_utc": "2026-02-19 20:12:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6bq9af",
          "author": "Fresh-Daikon-9408",
          "text": "I built it entirely from prompts with n8n-as-code by the way ;-)  \n[EtienneLescot/n8n-as-code: Stop clicking. Start coding. Bidirectional n8n ↔️ VS Code sync to generate workflows via AI and enable GitOps.](https://github.com/EtienneLescot/n8n-as-code)",
          "score": 1,
          "created_utc": "2026-02-19 22:51:41",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o6d5grj",
          "author": "CamelMurderer",
          "text": "I’m working on a similar workflow actually, how are you querying for jobs?",
          "score": 1,
          "created_utc": "2026-02-20 04:02:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6duzgq",
              "author": "Fresh-Daikon-9408",
              "text": "API",
              "score": 1,
              "created_utc": "2026-02-20 07:29:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6dzk2g",
                  "author": "froggidyfrog",
                  "text": "Which APIs do you recommend? I tried with Adzuna and Jsearch, but the results are messy and it seems that it can only find 1-2 jobs. Do you have any tips? I would be grateful",
                  "score": 1,
                  "created_utc": "2026-02-20 08:12:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6e694z",
          "author": "_373",
          "text": "Does this process really need to be so complicated?",
          "score": 1,
          "created_utc": "2026-02-20 09:15:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6e7exb",
              "author": "Fresh-Daikon-9408",
              "text": "Maybe not. If you think you can simplify it, go ahead, If you want to share you results, you are more than welcome !",
              "score": 1,
              "created_utc": "2026-02-20 09:26:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6eu0w8",
          "author": "Uniko_nejo",
          "text": "I feel like there should be a sub-workflow ",
          "score": 1,
          "created_utc": "2026-02-20 12:34:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6pmfcm",
          "author": "nqvuong99qn_",
          "text": "All are good. I love it. Any cost?",
          "score": 1,
          "created_utc": "2026-02-22 03:10:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mh9yu",
          "author": "stecandela",
          "text": "Io con Canonity faccio una cosa più facile e più utile in 1 minuto",
          "score": 0,
          "created_utc": "2026-02-21 16:39:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mqyur",
          "author": "True-Rise-3949",
          "text": "Make full explanation please",
          "score": 0,
          "created_utc": "2026-02-21 17:28:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r65gnd",
      "title": "Free n8n workflows: Reddit story to video generator + automatic shorts clipper",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/gallery/1r65gnd",
      "author": "Ok_Friend_9829",
      "created_utc": "2026-02-16 09:46:44",
      "score": 89,
      "num_comments": 20,
      "upvote_ratio": 0.99,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1r65gnd/free_n8n_workflows_reddit_story_to_video/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": [
        {
          "id": "o5nowuk",
          "author": "AutoModerator",
          "text": "**Video posts must include the workflow code.** The link to the code MUST be in the reddit post, if it is not in the reddit post itself, your post will be removed.\n\n**Acceptable ways to share the code:**\n\n* Github Repository\n* Github Gist\n* Directly here on Reddit in a code block\n* n8n.io/workflows/\n\nSharing the code any other way is not allowed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-16 09:46:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5npd6e",
          "author": "OG_Romes",
          "text": "Sounds interesting and thanks for sharing, where can I access the free workflows? And are there any costs running one of you workflows? Are you only using free APIs? Can you share some of your results with your workflows?",
          "score": 2,
          "created_utc": "2026-02-16 09:51:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5npyer",
              "author": "Ok_Friend_9829",
              "text": "Hello, yeah it is free and uses only free services and tools. Please read the complete post for more infos and download link (on github)",
              "score": 1,
              "created_utc": "2026-02-16 09:56:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ns9ec",
                  "author": "OG_Romes",
                  "text": "Oh i see it now, when I saw the post the first time, it was not formatted and did not have any links 😆",
                  "score": 2,
                  "created_utc": "2026-02-16 10:17:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5nwk3m",
          "author": "mutonbini",
          "text": "Wow, that's great friend, very good job! I love that NCA-toolkit, I didn't know about it and it seems awesome. For the issue of uploading to social networks, you could add the upload-post API which has a free tier that's pretty good.",
          "score": 2,
          "created_utc": "2026-02-16 10:57:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nx3ea",
              "author": "Ok_Friend_9829",
              "text": "Thanks for the advice, upload-post works but the free tier is not really loose so it does not serve me really in this project, because all the other tools are either free, refills daily or has loose limits for free tier",
              "score": 2,
              "created_utc": "2026-02-16 11:02:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5o18b5",
          "author": "Deep-Strawberry1999",
          "text": "Thanks for the sharing and will check those workflows right away. ",
          "score": 2,
          "created_utc": "2026-02-16 11:38:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5owxzv",
          "author": "OscarEchoNovember",
          "text": "what a nice contribution, thanks man",
          "score": 2,
          "created_utc": "2026-02-16 14:55:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ozfrl",
              "author": "Ok_Friend_9829",
              "text": "My pleasure, hope it helps",
              "score": 1,
              "created_utc": "2026-02-16 15:08:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5p3so6",
          "author": "unicorn69love",
          "text": "cool workflows dude especially the local tts hack saves real cash but without the code link its kinda pointless rn. vidmachine does similar reddit-to-shorts automation with full auto-posting if youre cool paying for premium ai voices tho its way less hassle overall",
          "score": 2,
          "created_utc": "2026-02-16 15:30:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pbcl6",
          "author": "rolling6ixes",
          "text": "This is great been wanting to make something like this for a while",
          "score": 2,
          "created_utc": "2026-02-16 16:05:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qanme",
          "author": "Kings_empire2023",
          "text": "Cool",
          "score": 2,
          "created_utc": "2026-02-16 18:48:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rhsxo",
          "author": "pvdyck",
          "text": "Nice !",
          "score": 2,
          "created_utc": "2026-02-16 22:18:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5snx7i",
          "author": "ifuckinglovebrownies",
          "text": "Insane!",
          "score": 2,
          "created_utc": "2026-02-17 02:18:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5taunf",
          "author": "Responsible-Luck8174",
          "text": "Amazing flow ",
          "score": 2,
          "created_utc": "2026-02-17 04:46:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nowtj",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-16 09:46:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wh5t7",
          "author": "bluebeel",
          "text": "this is really cool, nice work. one thing i ran into when doing something similar was that local ffmpeg gets tricky when you want to scale it or run it on n8n cloud. ended up using renderio for the ffmpeg parts since its just api calls, so n8n handles the orchestration and renderio does the heavy lifting. but for local setups like yours this looks solid",
          "score": 1,
          "created_utc": "2026-02-17 17:49:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7d7gt",
      "title": "Controlling mobile devices (real and virtual) from n8n workflow. Self-healing mobile automation.",
      "subreddit": "n8n",
      "url": "https://v.redd.it/bavrby0ae3kg1",
      "author": "interlap",
      "created_utc": "2026-02-17 17:50:35",
      "score": 67,
      "num_comments": 11,
      "upvote_ratio": 0.96,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1r7d7gt/controlling_mobile_devices_real_and_virtual_from/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o64p1gw",
          "author": "BenAttanasio",
          "text": "Are all the comments in this subreddit ai or what? “The self healing part is what gets me”???",
          "score": 3,
          "created_utc": "2026-02-18 21:35:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xjfth",
          "author": "Skyton_wil",
          "text": "That's very interesting; I wonder how it would handle unforeseen events like notification alerts or other unexpected setbacks in other apps.",
          "score": 2,
          "created_utc": "2026-02-17 20:48:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o648ehe",
              "author": "interlap",
              "text": "In the worst-case scenario (if the script fails), it will go to the healing branch and add functionality to prevent this exact unforeseen occurrence.",
              "score": 2,
              "created_utc": "2026-02-18 20:18:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6961nt",
          "author": "epidco",
          "text": "how do u handle state resets if the ai mess up rly bad and gets the device into a weird loop? cuz if it starts clicking system settings by mistake instead of the app it could get messy fast. rly cool use of mcp tho i might try this for some basic app testing i gotta do soon. tbh the self-healing part is the only way mobile automation becomes actually viable long term lol",
          "score": 2,
          "created_utc": "2026-02-19 15:23:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o699r7n",
              "author": "interlap",
              "text": "The easiest way is probably to prompt it to “kill” itself as soon as it goes into a loop. But honestly, current models are pretty decent and usually don’t mess up as badly as you described.\n\nI’m also currently working on some safety nets that could be configured in the MobAI app. For example, preventing clicks on elements with predefined text (e.g., \"purchase\", \"login\", etc.), or blocking all actions except closing the app, going to the home screen, or pressing the back button (on Android) if the AI enters a specified application or screen.",
              "score": 1,
              "created_utc": "2026-02-19 15:41:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ws80g",
          "author": "Available_Cupcake298",
          "text": "the self-healing part is what gets me. most people manually handle edge cases forever. having the agent inspect the UI tree, find what broke, and fix the script itself is a completely different mental model. how long does the recovery loop take in practice?",
          "score": 4,
          "created_utc": "2026-02-17 18:40:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wvrdw",
              "author": "interlap",
              "text": "Not much. In my workflow, I send the agent the exact place where the failure occurred, along with the elements present on the broken screen. It may also perform some actions on the device if it thinks they are needed. In my case, it took about 1 minute 10 seconds to recover after the onboarding screen went missing. Of course, it may need to loop through this self-healing process multiple times, but I simplified the workflow for demo purposes.",
              "score": 1,
              "created_utc": "2026-02-17 18:56:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5x3xg0",
                  "author": "Available_Cupcake298",
                  "text": "1m10s for a full self-repair is pretty solid. curious if you've hit cases where it loops more than 2-3 times without converging -- do you have a max retry cap built in, or does it usually resolve in one pass?",
                  "score": 2,
                  "created_utc": "2026-02-17 19:34:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o63mgku",
          "author": "Drogoff1489",
          "text": "this is sick. the self-healing part is what gets me, having Claude analyze the screenshot and figure out what went wrong is exactly what I've been doing in my own workflows. I use Claude for error handling in a few n8n automations and it's wild how well it recovers from stuff that would normally just crash. How's the latency on the screenshot → Claude analysis → action loop? That's usually where things get slow for me.",
          "score": 0,
          "created_utc": "2026-02-18 18:37:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64a412",
              "author": "interlap",
              "text": "My main goal with MobAI is to make this process as fast as possible. Unfortunately, most of the time is spent on Claude’s analysis. Taking a screenshot and retrieving the UI tree in my app are sub-second operations. It can probably be optimized with better prompting, for example by instructing Claude not to overthink the analysis in order to constrain the reasoning depth",
              "score": 1,
              "created_utc": "2026-02-18 20:26:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r9718t",
      "title": "Built a fully automated Google Business Profile posting system with n8n - 625 images, AI captions, zero manual work",
      "subreddit": "n8n",
      "url": "https://i.redd.it/wkqfpprhuhkg1.png",
      "author": "Krishnan-sekar",
      "created_utc": "2026-02-19 18:25:33",
      "score": 54,
      "num_comments": 20,
      "upvote_ratio": 0.98,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1r9718t/built_a_fully_automated_google_business_profile/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o6a81g8",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-19 18:25:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a90rn",
          "author": "Motor_Fail3789",
          "text": "where is the code?",
          "score": 3,
          "created_utc": "2026-02-19 18:30:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ae32o",
              "author": "Krishnan-sekar",
              "text": "Just pushed it! Here you go: [https://github.com/krishnansekar17/N8N-Automations/tree/main/argos-gbp-daily-auto-post](https://github.com/krishnansekar17/N8N-Automations/tree/main/argos-gbp-daily-auto-post)\n\nWorkflow JSON + full README with node-by-node setup, prerequisite APIs, and the technical fixes I ran into (like JSON.stringify for AI captions breaking the GBP API payload).",
              "score": 6,
              "created_utc": "2026-02-19 18:53:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6abw7i",
          "author": "MasterOfDanger",
          "text": "I want ask what were the SEO results of 10 months posting? Or bigger customer engagement?",
          "score": 3,
          "created_utc": "2026-02-19 18:43:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a9n8t",
          "author": "DepartureNo2745",
          "text": "If you post a workflow, you must include a github link to the code ",
          "score": 2,
          "created_utc": "2026-02-19 18:33:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ae5ed",
              "author": "Krishnan-sekar",
              "text": "Apologies for the delay! Updated the post and here's the repo: [https://github.com/krishnansekar17/N8N-Automations/tree/main/argos-gbp-daily-auto-post](https://github.com/krishnansekar17/N8N-Automations/tree/main/argos-gbp-daily-auto-post)",
              "score": 6,
              "created_utc": "2026-02-19 18:54:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6aulnw",
          "author": "Sensitive-Piece-2449",
          "text": "Bellissimo lavoro!",
          "score": 2,
          "created_utc": "2026-02-19 20:13:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6d79hl",
              "author": "Krishnan-sekar",
              "text": "Grazie mille",
              "score": 1,
              "created_utc": "2026-02-20 04:15:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6c8pej",
          "author": "Mistic92",
          "text": "Good job and good job describing it",
          "score": 2,
          "created_utc": "2026-02-20 00:38:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fg7er",
          "author": "BBQMosquitos",
          "text": "But what if it generates terrible images?",
          "score": 1,
          "created_utc": "2026-02-20 14:39:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k1gvt",
              "author": "Krishnan-sekar",
              "text": "It doesn't generate images; it uses your own pre-shot product photos stored in Google Drive. The AI only generates the caption text. So image quality is entirely in your control.\n\nHere's what the live output looks like: [https://ibb.co/Dc3w454](https://ibb.co/Dc3w454)\n\nI pre-loaded 625 product photos, and the workflow picks the next one from the queue. The captions are the AI-generated part (GPT-4o-mini), each one unique with different angles and storytelling.",
              "score": 2,
              "created_utc": "2026-02-21 05:30:00",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6t9k6b",
              "author": "thalygutierrez",
              "text": "I agree. The possibilities make me anxious 😰 \nYour question makes me wonder if anyone in this thread has tried out Google Pomelli.",
              "score": 1,
              "created_utc": "2026-02-22 18:11:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6i3bos",
          "author": "InvestigatorExtra556",
          "text": "This is a really clean n8n setup for a real use case, the GBP API and OAuth stuff is always a pain and the AI captions breaking JSON is such a classic bug, nice work getting this to run hands-free at scale.",
          "score": 1,
          "created_utc": "2026-02-20 22:11:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k1ltf",
              "author": "Krishnan-sekar",
              "text": "Appreciate that! Yeah, the JSON.stringify fix for the AI caption was one of those 2-hour debugging sessions that turned out to be one line of code. The GBP API is surprisingly strict about the payload format. Glad the documentation helped. That was the whole point of sharing it.",
              "score": 2,
              "created_utc": "2026-02-21 05:31:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ipwib",
          "author": "plexuses",
          "text": "Any examples of it being used?",
          "score": 1,
          "created_utc": "2026-02-21 00:16:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k1piw",
              "author": "Krishnan-sekar",
              "text": "Yes! Here are two recent auto-generated posts running live on the GBP: [https://ibb.co/Dc3w454](https://ibb.co/Dc3w454)\n\nImages are pre-loaded from Google Drive, captions are fully AI-generated (GPT-4o-mini), each one unique with mythology references, seasonal tie-ins, and product notes. Posts go out twice daily at 10 AM and 6 PM automatically.",
              "score": 1,
              "created_utc": "2026-02-21 05:31:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jmqvw",
          "author": "Mysterious_Draw_7882",
          "text": "Can I see the actual GBP applied?",
          "score": 1,
          "created_utc": "2026-02-21 03:41:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k1tor",
              "author": "Krishnan-sekar",
              "text": "Here you go, two live posts from the automation: [https://ibb.co/Dc3w454](https://ibb.co/Dc3w454)\n\nEach caption is AI-generated with a unique angle. The workflow JSON and full setup guide are on GitHub: [https://github.com/krishnansekar17/N8N-Automations/tree/main/argos-gbp-daily-auto-post](https://github.com/krishnansekar17/N8N-Automations/tree/main/argos-gbp-daily-auto-post)",
              "score": 1,
              "created_utc": "2026-02-21 05:32:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rayg8o",
      "title": "Complete beginner at n8n — where do I even start?",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1rayg8o/complete_beginner_at_n8n_where_do_i_even_start/",
      "author": "Latenight_vibecoder",
      "created_utc": "2026-02-21 18:23:53",
      "score": 52,
      "num_comments": 23,
      "upvote_ratio": 0.9,
      "text": "Hey everyone,\n\nI've been playing around with n8n for a few weeks now and \nhonestly kind of overwhelmed by how many nodes there are.\n\nI keep seeing people build crazy automations and I have no \nidea where they even started learning.\n\nFor those of you who are actually using n8n in real projects \n— what did you focus on first? Like which nodes actually show \nup in real workflows vs ones that look cool but you never \nactually use?\n\nAlso curious what kind of workflows you build day to day. \nIs it mostly AI stuff, email automation, connecting APIs? \n\nJust trying to figure out what's actually worth learning \nvs what's just tutorial bait 😅\n\nAny advice from people who've been through this would \nbe really helpful!",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/n8n/comments/1rayg8o/complete_beginner_at_n8n_where_do_i_even_start/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o6n24ol",
          "author": "AutoModerator",
          "text": "**Need help with your workflow?**\n\nTo receive the best assistance, please share your workflow code so others can review it:\n\n**Acceptable ways to share:**\n\n* Github Gist (recommended)\n* Github Repository\n* Directly here on Reddit in a code block\n\nIncluding your workflow JSON helps the community diagnose issues faster and provide more accurate solutions.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-21 18:23:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nptaq",
          "author": "shajid-dev",
          "text": "Forget about the nodes, If you have a problem that only requires 3 nodes to connect, and that's what we all called automations. NOT 50-100 nodes connected like bloody spaghetti noodle unless if there were any reasonable validation. However, learning n8n is good, and it will sustain another decade, but I suggest you learn the ecosystem, and how to think like a logical planner to build your automations. Start from what you'd do to save your time? find your repetitive tasks, and try to automate that and get that dopamine hits, next things would come in linear though. \n\nsince you're saying you're a beginner, and these resources would help you to get headstart with n8n. \n\nTheories Based for a beginner\n\n\\- How to install n8n locally (2026) - [https://theowllogic.com/installing-n8n-setup-locally](https://theowllogic.com/installing-n8n-setup-locally)  \n\\- Your first Hello World Workflow - [https://theowllogic.com/first-hello-world-n8n-workflow](https://theowllogic.com/first-hello-world-n8n-workflow)  \n\\- n8n Workflows, Nodes and Data-flow - [https://theowllogic.com/n8n-workflow-nodes-data-flow](https://theowllogic.com/n8n-workflow-nodes-data-flow)  \n\\- Webhooks in n8n for Beginners - [https://theowllogic.com/webhook-in-n8n-explained](https://theowllogic.com/webhook-in-n8n-explained)  \n\\- How to Handle API Rate Limits in n8n - [https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n](https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n)  \n\\- How to Handle Errors Like a Pro in n8n - [https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n](https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n)  \n\\- n8n Expressions Complete Guide - [https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n](https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n)  \n\\- How to Build Condition Logics in n8n (IF/Switch) - [https://theowllogic.com/conditional-logic-in-n8n](https://theowllogic.com/conditional-logic-in-n8n)  \n\\- How to Use n8n Loop Over Items - [https://theowllogic.com/how-to-use-loop-in-n8n](https://theowllogic.com/how-to-use-loop-in-n8n)  \n\\- How to Use Sub-Workflows in n8n - [https://theowllogic.com/n8n-sub-workflows](https://theowllogic.com/n8n-sub-workflows)\n\nWorkflows Based  \n\\- How to Plan a n8n Workflow - [https://theowllogic.com/plan-n8n-workflow](https://theowllogic.com/plan-n8n-workflow)  \n\\- 50 Boring Tasks You Can Automate With n8n - [https://theowllogic.com/automate-boring-tasks-n8n](https://theowllogic.com/automate-boring-tasks-n8n)  \n\\- How to Build a Follow-up Email Sequence - [https://theowllogic.com/n8n-followup-email](https://theowllogic.com/n8n-followup-email)  \n\\- How to Build an n8n AI Agent (Step by Step) - [https://theowllogic.com/n8n-ai-agent-workflow](https://theowllogic.com/n8n-ai-agent-workflow)",
          "score": 39,
          "created_utc": "2026-02-21 20:23:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6q3j88",
              "author": "boydjanmaat",
              "text": "Great answer, makes sense. Thanks! I’m a beginner in this as well. Would it be possible for you to describe limits and possibilities with n8n automation?",
              "score": 1,
              "created_utc": "2026-02-22 05:13:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6qf49c",
                  "author": "shajid-dev",
                  "text": "There are no limits AFAIK, because my contexts are small and effective, you have to find possibilities in your niche.",
                  "score": 2,
                  "created_utc": "2026-02-22 06:52:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6vetky",
              "author": "Mysterious-Ad-8656",
              "text": "Legend",
              "score": 1,
              "created_utc": "2026-02-23 00:50:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6n3glr",
          "author": "FaultofDan",
          "text": "Step 1 - find a problem that you're trying to solve. Asking where to start with n8n is like asking where to start with a table saw or a video camera. It's a tool. You need a project to work on.",
          "score": 19,
          "created_utc": "2026-02-21 18:30:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6pbaby",
              "author": "aidiscounts",
              "text": "Ameen ",
              "score": 1,
              "created_utc": "2026-02-22 01:57:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6n4rx1",
          "author": "onivell",
          "text": "To be honest i learned while trying to create automations!",
          "score": 6,
          "created_utc": "2026-02-21 18:36:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nxhjh",
          "author": "buttplumber",
          "text": "I found the problem I wanted to solve/automate and started talking with ChatGPT potting it in the role of Linux and n8n expert. The same evening I already had my n8n docker installed on my Ubuntu local server and already the first workflow running.\n\nThat's how I learned to ask the right questions and troubleshoot any obstacles on the way.",
          "score": 2,
          "created_utc": "2026-02-21 21:04:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6n6iqv",
          "author": "Useful_Calendar_6274",
          "text": "honestly maybe learn to code first. if you already know, disregard",
          "score": 2,
          "created_utc": "2026-02-21 18:45:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6n9l1e",
          "author": "Royal-Wear-6437",
          "text": "I had a particular integration task that needed fixing. I could write most of the code in (UNIX/Linux) shell script so I had some PoC code that let me learn how to talk to the various APIs. Then I started with N8N. And Gemini, which is surprisingly helpful seeing as although I can read procedural languages like Javascript, I'm not at all good at writing it.",
          "score": 1,
          "created_utc": "2026-02-21 19:00:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6o8ani",
          "author": "Possible-Road-4290",
          "text": "Honestly when you see a +15 node-automation on LinkedIn with a title like « I give away my n8n workflow to build an AI agent that will do X » \n=> tutorial bait \n\nn8n workflow make sense when you have a boring process you want to automate \n\nOut of thin air, I doubt you will find anything to work on. That kind of process is to be found at companies with employees performing the same boring task multiple times a day \n\nWhen you find something, n8n being a low code tool you’ll have to try hard and figure out what to do. I personally learnt it while working on projects",
          "score": 1,
          "created_utc": "2026-02-21 22:02:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6p0gkj",
          "author": "molehill_io",
          "text": "You might like this tutorial that covers how to build a reddit scraper from scratch, with all of the technical details: https://molehill.io/blog/building_a_reddit_question_scraper_using_n8n",
          "score": 1,
          "created_utc": "2026-02-22 00:48:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6p8jvd",
          "author": "richard-b-inya",
          "text": "Honestly with MCPs you don't really even need it anymore.  Maybe it still has a place in some workflows.",
          "score": 1,
          "created_utc": "2026-02-22 01:39:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6pm00f",
              "author": "Useful_Disaster_7606",
              "text": "I guess for more deterministic workflows, wouldn't n8n still remain relevant?",
              "score": 1,
              "created_utc": "2026-02-22 03:07:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6po6pl",
                  "author": "richard-b-inya",
                  "text": "I mean it can be used for everything but building the app directly and then using MCPs, for example, is just more efficient.  More control and cheaper that way.  Plus not locked into the N8N ecosystem for everything.  \n\nFrom a building a company standpoint I would focus on sales and marketing and let someone else develop the solution if you are going to use N8N.",
                  "score": 1,
                  "created_utc": "2026-02-22 03:22:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6qcvme",
          "author": "No_Addendum5565",
          "text": "Start from YouTube",
          "score": 1,
          "created_utc": "2026-02-22 06:32:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6u7h9n",
          "author": "Big-Business-AJL",
          "text": "Going to be honest I started learning as I did it. Youtube, google, and chatgpt haha. Then through a lottttt of trial and error, I learned a lot",
          "score": 1,
          "created_utc": "2026-02-22 20:56:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6usshx",
          "author": "Bklynbiz",
          "text": "You don’t! Skip n8n and go straight to Claude code for building automations. You can only get so far with n8n.",
          "score": 1,
          "created_utc": "2026-02-22 22:46:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v6uka",
          "author": "Elgon2003",
          "text": "Asking how to use a saw without having a piece of wood to cut wont allow you to go far. Find the problem and then attempt to fix it.",
          "score": 1,
          "created_utc": "2026-02-23 00:05:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w0ps7",
          "author": "BrilliantRip3517",
          "text": "I honestly think you learn best by just building. Find something simple you can automate for yourself or a friend and work through it. Or look at common workflows people build on YouTube and try recreating them on your own first, only check the tutorial if you get stuck. That way, you actually learn instead of just copying.",
          "score": 1,
          "created_utc": "2026-02-23 03:03:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra5oiw",
      "title": "The skill that made us valuable (building workflows) is about to become a one-line prompt. Now what?",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1ra5oiw/the_skill_that_made_us_valuable_building/",
      "author": "Imaginary-Level1923",
      "created_utc": "2026-02-20 19:56:00",
      "score": 39,
      "num_comments": 22,
      "upvote_ratio": 0.95,
      "text": "n8n recently shipped \"AI Workflow Builder\" ([https://docs.n8n.io/advanced-ai/ai-workflow-builder/](https://docs.n8n.io/advanced-ai/ai-workflow-builder/)) where you describe what you want in plain English and it generates the workflow for you.\n\nZapier launched Agents in beta doing essentially the same thing. OpenAI dropped AgentKit with a visual agent builder at DevDay. And n8n 2.0 now lets you turn any workflow into a \"tool\" that an AI agent can call on its own when it decides it needs to.\n\nThe direction is pretty clear. \\~Two years from now, most people won't be dragging nodes around a canvas. They'll describe what they want and an agent will build it, test it, and probably fix it when it breaks.\n\nSo what actually happens to the skill of building automations? Right now knowing how to wire up a webhook to a database to an API is valuable because it's hard enough that most people can't do it. But if a prompt gets you 80% of the way there, does the remaining 20% become the only thing that matters? Things like knowing which edge cases will break in production, understanding rate limits, designing error handling that doesn't silently fail.\n\nI keep going back and forth on this. Part of me thinks the \"automation builder\" role just shifts from construction to architecture. You stop being the person who builds the workflow and start being the person who knows what the right workflow even is. The other part of me looks at how fast these tools are improving and wonders if even that gets automated away.\n\nCurious where you all land on this. Are you already using the AI builder features in your daily work? Has it actually replaced manual building for you or is it more of a starting point you still heavily edit?",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1ra5oiw/the_skill_that_made_us_valuable_building/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o6hi4zy",
          "author": "Cheap-Refrigerator92",
          "text": "I personally think as someone who just started getting into automating things people still won't do it. On their own it's going to be people like you still.\n\nI find it fun to vibe code/automate/ build things but there is still some complexity behind it that most people aren't going to take the time to figure out\n\n e.g supabase has 4 separate API keys took me like a hour my first time to figure out which one just view which ones edit rows etc.\n\nLet alone just building a process in general in my recent project I was uploading like 50+ ranging from 2-50mb each compressed folders and n8n would crash with to much data so had to figure out the loop node then the code node would crash with to much data figure out the set node getting it to filter correctly and update correctly I'm not smart but I'm not dumb either still took me like 3 days with all the crashes and errors and changing the flow to get it functional. \n\nI guess what I'm saying is long story short is I don't think much well change because \n1) people are lazy would rather pay someone to do \n2) people trust others who are experts or know more \n3) if they do start I bet alot give up after the first 3 failures and having to restart \n4) some people already don't trust AI let alone trust it enough to fully build something for their/a company that involves sensitive data or any data in general really\n5) alot of AI don't like you posting API keys in them at least that I have seen/done Gemini and open ai both would say delete the key you pasted it here it's exposed (I have to assume that they would fix that but well that be public then? Well that be used to train new models still?) \n\nJust my opinion I'm a landscaper personally I just like to build things for fun just started a few months ago just something to do after work.\nI personally plan to experiment around with n8ns Agent soon just to see what it's all about",
          "score": 13,
          "created_utc": "2026-02-20 20:25:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6hwm4j",
              "author": "Imaginary-Level1923",
              "text": "The Supabase API keys thing is such a good example. That's the kind of stuff no AI prompt is going to solve for you because you don't even know what to ask until you're already stuck. And yeah, 3 days of crashes and flow changes to handle large file uploads is exactly the gap between \"AI built me a workflow\" and \"I have a workflow that actually works\".   \n  \nI guess the real solution long term is agent-to-agent communication. Like Supabase has its own agent, n8n has its own agent, and they just talk to each other. The n8n agent asks the Supabase agent which key it needs, gets the right permissions, configures the connection. No more digging through docs for an hour. We're not fully there yet but that's clearly where it's heading.   \n  \nAlso respect for doing this after landscaping shifts, that's a solid hobby upgrade.",
              "score": 3,
              "created_utc": "2026-02-20 21:37:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6in2ye",
                  "author": "Cheap-Refrigerator92",
                  "text": "That would be interesting to see I agree 100% only way it could work would need a lot of copya on board tho I think if they are going to make it work it has to be that \n\nYes even just the little stuff I personal think AI just doesn't have good critical think ability Gemini gave me a lot of not productive ways to try and fix a file being to big  and crashing n8n after like 5 reworking the flow I finally realized I could just copy the file structure and past it into another  folder (granted that's not automated but needed to do it only 1 to catch up on a years worth of data) but just another example \n\nI would like to see it on a canvas to see where things break that would be terrible if there was no canvas to see where things are breaking and just blinding feeding AI prompts \n\nThanks yeah a lot better then video games lol",
                  "score": 2,
                  "created_utc": "2026-02-21 00:00:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6id7mz",
              "author": "misterjoshmutiny",
              "text": "This is my thinking behind it, as well. Building automations with a canvas was already not wildly complicated, in the first place, and companies STILL paid people to do it for them and keep it updated and running. They will continue to do that, even if it is someone just writing a prompt that generates the workflow, because it will still be cheaper than paying someone’s yearly salary and benefits in the long run.",
              "score": 2,
              "created_utc": "2026-02-20 23:03:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6io0i2",
                  "author": "Cheap-Refrigerator92",
                  "text": "I agree but when just learning there are many frustrating things in n8n that if you aren't fully committed or doing it for like fun your just going to give up quickly \n\nYeah for sure a lot cheaper! And less time consuming on their end",
                  "score": 1,
                  "created_utc": "2026-02-21 00:05:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6hft2l",
          "author": "buttplumber",
          "text": "Well, I’m already half way there, as It’s AI that tells me what nodes to put and how to set them up. And if something does not work, we troubleshoot together. I admire people that build all of that themselves from scratch, but I don’t have time and skill to learn all that. So I say what I need and the code is ready.",
          "score": 3,
          "created_utc": "2026-02-20 20:14:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6hvozt",
              "author": "Imaginary-Level1923",
              "text": "This is kind of exactly what I mean though. The \"skill\" is already shifting from knowing how to configure nodes to knowing what to ask for. Curious, when the AI sets things up for you and something breaks, do you find the troubleshooting part is where you actually learn the most about how n8n works? Because that's the part I don't think AI fully replaces yet.",
              "score": 2,
              "created_utc": "2026-02-20 21:32:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6lhvjy",
                  "author": "buttplumber",
                  "text": "Yes, that’s exactly it. What I’m actually learning the most isn’t how to configure nodes, it’s what questions to ask and what context to provide.\nThe real skill shift for me is being precise about inputs, outputs, error messages, and environment details. Once the AI has the right context, the fix is usually straightforward.\n\nI’ve started experimenting with Projects in ChatGPT, keeping structured markdown files that describe my workflows, and even using Git for versioning with AI helping me there too. So when I open a new troubleshooting chat, I can provide the full context and it already understands what I’m working with.\n\nThat’s where the biggest improvement in troubleshooting accuracy comes from.",
                  "score": 1,
                  "created_utc": "2026-02-21 13:24:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6hkupv",
          "author": "Thick-Protection-458",
          "text": "\\> So what actually happens to the skill of building automations?\n\nSame as all kinds of programming, essentially. Because that was a programming, even if specific kind.\n\n\\> Part of me thinks the \"automation builder\" role just shifts from construction to architecture\n\nBingo. ",
          "score": 3,
          "created_utc": "2026-02-20 20:38:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ib55p",
          "author": "DruVatier",
          "text": "Massive difference in knowing HOW to build workflows and knowing WHICH workflows to build.",
          "score": 2,
          "created_utc": "2026-02-20 22:52:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6oarlh",
              "author": "jzap456",
              "text": "how do u know which ones to build?? ask ppl to tell you?",
              "score": 1,
              "created_utc": "2026-02-21 22:15:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6id613",
          "author": "MrDork",
          "text": "Have you tried to set up anything with AI at scale?  It gets to a certain point, and it starts falling apart dramatically.  Now, a lot of that can be improved on by optimizing and tweaking the prompts.  But it still needs someone to keep the guardrails on.  We're not at the point where a layman can say \"Build a custom accounting platform for my 200 employee company.\" walk away, and come back to a finished, polished product.  Until that day comes, and it may never come (at least is this form), they will still need experienced humans involved.  Look at it on the positive side, less work and more volume for current developers.  Of course, the humans end up being the bottleneck in this scenario, but until AI \"just works\", that's what is going to keep you relevant. ",
          "score": 2,
          "created_utc": "2026-02-20 23:03:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i599h",
          "author": "seqcmd",
          "text": "Even if you Use AI you need to know what you want to achieve",
          "score": 1,
          "created_utc": "2026-02-20 22:21:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6iyly2",
          "author": "rekt_by_inflation",
          "text": "The value that we bring isn't so much the building of workflows, it's understanding what the client actually needs and being able to translate that into something.\n\nWe have to decipher what they need vs what they want",
          "score": 1,
          "created_utc": "2026-02-21 01:07:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jhrg3",
          "author": "hardcherry-",
          "text": "I let my AI leverage n8n workflows when necessary while building larger systems.",
          "score": 1,
          "created_utc": "2026-02-21 03:08:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jjjqe",
          "author": "UniForceMusic",
          "text": "Then its the skills to go beyond N8N.\n\nWhat if the system you're interfacing with has a ridiculous api interface? Would you know how to set up a little VPS to run a script that does the interfacing for you on webhooks?\n\nIf your workflow required an expensive API. Would you know how to recreate that functionality?\n\nIt's \"going beyond the prompt\" that will set you apart",
          "score": 1,
          "created_utc": "2026-02-21 03:20:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6l3hfp",
          "author": "Practical-Fox-4741",
          "text": "I view it as a shift from \"Construction\" to \"Architecture\n\nThe AI is great at building the \"happy path\" (when everything works perfectly). But as you mentioned, the real value is in handling the edge cases, API rate limits, and complex error handling logic.\n\nI treat the AI builder like a junior developer: I let it build the initial draft to save time, but I still have to review, optimize, and fix the logic. The \"what to build\" is becoming valuable than the \"how to build",
          "score": 1,
          "created_utc": "2026-02-21 11:29:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lliz4",
          "author": "logicru",
          "text": "That won't happen because it is not their goal. See n8n's implementation of this builder tool for example.\n\nYou start with 50 credits on a $20 plan. Each interaction will cost you 1 credit. \n\nIt is literally impossible to make a flow in 2-3 prompts. Yes, it is possible to do so if you really know n8n flows well. If you know it that well, then why would you get the $20 plan?",
          "score": 1,
          "created_utc": "2026-02-21 13:47:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ln7j5",
          "author": "Evanescent_contrail",
          "text": "Is this available on self hosted versions as well?",
          "score": 1,
          "created_utc": "2026-02-21 13:57:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ob3wf",
          "author": "jzap456",
          "text": "my guess is prompt to code is the next frontier IF the user experience is smooth and there’s no complexity (eg the app asks you to enter your supabase key without calling an AI model)\n\nanother interesting angle to this is running everything locally, with local AI models",
          "score": 1,
          "created_utc": "2026-02-21 22:17:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6j6s5a",
          "author": "Useful_Disaster_7606",
          "text": "It feels like a loss of identity because we used to define ourselves by the 'build.'\n\nBut think of it this way, if a doctor uses AI to do 80% of the heavy lifting, their expertise is what prevents the 20% of errors that cost lives.\n\nThe same applies here. Our value is shifting from **building the machine** to **guaranteeing the outcome.** We’re moving from being the ones in the trenches to being the ones who decide where the trenches should be. Clients don't pay for the speed; they pay for the guarantee and reliability.\n\nAI may be amazing at creating sophisticated workflows but it does not replace the learned experience and intuition of an expert that ***knows*** where it could go wrong.\n\nAlso this may seem ironic since I needed AI's assistance in writing this comment but I simply used it to refine my analogy and then that's where I added my personal touch.",
          "score": 0,
          "created_utc": "2026-02-21 01:59:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jpcsm",
          "author": "DGC_David",
          "text": "Nothing new.... N8N is a solution to a problem, it is not a skill, it's literally Zapier and I've seen 65 yr old Accountants use Zapier. N8N as a skill is like saying I'm talented at sharpening my pencil. I'm sure it has its niche moments of usage but it's not a selling point about yourself.",
          "score": 0,
          "created_utc": "2026-02-21 03:59:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rb4rbs",
      "title": "How 8 n8n workflows replaced our entire staff scheduling system",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1rb4rbs/how_8_n8n_workflows_replaced_our_entire_staff/",
      "author": "No_Savings4221",
      "created_utc": "2026-02-21 22:39:07",
      "score": 35,
      "num_comments": 8,
      "upvote_ratio": 0.9,
      "text": "For two years, our operations team ran on duct tape.\n\n\n\nEvery morning, someone had to:\n\n\n\n• Run a Google Apps Script to pull shift data\n\n• Export a CSV from one system\n\n• Import it into another\n\n• Manually check for conflicts\n\n• Send out the daily assignments\n\nMiss a step? Everything downstream breaks. Person on holiday? Hope they left good notes.\n\n\n\nIt wasn't anyone's fault. The system grew organically. One script here, one CSV export there. Before you know it, you've got 45 minutes of manual clicking that nobody fully understands anymore.\n\n\n\nWhat broke it\n\n\n\nThe person who wrote most of the Apps Scripts left. Documentation was... sparse. Suddenly we're reverse-engineering JavaScript from 2019 trying to figure out why the shift assignments aren't matching the availability sheet.\n\n\n\nThat's when I thought: what if this just ran itself?\n\n\n\nThe 8 workflows\n\n\n\n1. Availability sync — Pulls staff availability from our HR system every night. No more CSV exports.\n\n2. Shift requirement calculator — Looks at bookings for each location, calculates how many people we need and when.\n\n3. Auto-assignment — Matches available staff to required shifts based on location, role, and hours. Draft schedule ready by 5am.\n\n4. Conflict checker — Flags double-bookings, overtime issues, or people scheduled during requested time off. Runs before anything gets published.\n\n5. Schedule publisher — Pushes the approved schedule to our team app. Everyone sees their week without someone manually updating a shared calendar.\n\n6. Swap request handler.  Staff can request shift swaps. Workflow checks if it's valid, notifies the other person, updates the schedule if both agree.\n\n7. No-show alert - If someone hasn't checked in 15 minutes after shift start, manager gets a ping. Simple but saved us twice already.\n\n8. Weekly hours reconciliation that compares scheduled hours vs actual, flags discrepancies before payroll.\n\nWhat's different now\n\n\n\nNobody runs scripts manually anymore. Nobody imports CSVs. Nobody spends their first hour playing Tetris with a spreadsheet.\n\n\n\nThe ops coordinator who used to own the morning routine now focuses on actual problems — short-staffed days, training gaps, site issues. The mechanical stuff just happens.\n\n\n\nThe biggest lesson learned\n\n\n\nEarly on, I used n8n's built-in Google Sheets nodes. Seemed obvious right? we're reading and writing sheets, use the Sheets node.\n\n\n\n**BIG Mistake.**\n\n\n\nThe integrated nodes were flaky. Random timeout issues, weird edge cases with formatting, inconsistent behaviour with larger datasets. I spent more time debugging node quirks than actual logic problems.\n\n\n\nEventually I ripped them out and switched to raw HTTP requests against the Google Sheets API.  This is my **PRO-TIP -** steer clear of integrated nodes if they're not doing what you need.  A properly defined http request is much better for exploring an API. \n\n\n\nNight and day difference. More reliable, more control, better error handling. I could see exactly what was being sent and returned.\n\n\n\nPro tip: If you're building anything serious in n8n, don't assume the integrated nodes are your best option. HTTP Request nodes talking directly to APIs are often more comprehensive and way more predictable. The integrated nodes are convenient for quick stuff, but when reliability matters, go direct.\n\n\n\nWould I do it again?\n\n\n\nImmediately. The old system was a single point of failure disguised as \"how we've always done it.\" Now there's version control, error logs, and I can actually see what's happening.\n\n\n\nPlus I don't get panicked calls when someone's on holiday and forgot to run the script.\n\n\n\n\n\nBuilt with n8n. If you're replacing janky Apps Scripts with proper workflows, happy to compare notes.\n\n",
      "is_original_content": false,
      "link_flair_text": "Servers, Hosting, & Tech Stuff",
      "permalink": "https://reddit.com/r/n8n/comments/1rb4rbs/how_8_n8n_workflows_replaced_our_entire_staff/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o6ojcbe",
          "author": "DumplingDarling_1",
          "text": "This is such a relatable breakdown so many teams don’t realize how fragile things are until the one person who built it leaves. Moving from manual CSV juggling to automated workflows (especially the conflict checker and reconciliation) is a huge risk reducer.",
          "score": 3,
          "created_utc": "2026-02-21 23:03:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ok1ss",
              "author": "No_Savings4221",
              "text": "The guy on the team that I built it for actually likes to sit there at the scheduled time and watch his google sheets get cleaned out and populated with the new data.  He's real diligent so when he leaves or goes on vacation there's now something that is working for him. ",
              "score": 1,
              "created_utc": "2026-02-21 23:08:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6pc13q",
          "author": "RotatingMadness",
          "text": "How are you deploying this for production? Did you trial it locally and deploying by with a VPS provider like hostinger etc?",
          "score": 3,
          "created_utc": "2026-02-22 02:02:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6u0avg",
              "author": "No_Savings4221",
              "text": "I prefer Hetzner for cloud based but we have a production server now set up for use in the office so it's easier. But I think Hostinger offers a good solution for ease of use.",
              "score": 1,
              "created_utc": "2026-02-22 20:20:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ofvqa",
          "author": "Training_Bet_2747",
          "text": "Automation saves lot of time and agree HTTP nodes are some times better than native nodes because N8N native nodes tend to have fixed schema (boxes) sometimes which might change often",
          "score": 1,
          "created_utc": "2026-02-21 22:44:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ohekd",
              "author": "No_Savings4221",
              "text": "Agree - fixed schema might be better (easier) for beginners but if  you want to be sure you're getting full data from an API you need to use a correctly built call from a HTTP",
              "score": 2,
              "created_utc": "2026-02-21 22:52:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6qof0x",
          "author": "pvdyck",
          "text": "N8n nodes quality and maintenance are the issue here ... Proper partnership should have solved that ages ago. n8n, now that you are properly funded, don't hesitate to step in!",
          "score": 1,
          "created_utc": "2026-02-22 08:19:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rb1kc",
          "author": "seevobuffet",
          "text": "https://youtu.be/jCTADO1A6B0 \nThis helped me land my first client using n8n!",
          "score": 1,
          "created_utc": "2026-02-22 11:54:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6q5pb",
      "title": "I tried “vibe coding” a full SaaS with Claude + n8n — this surprised me",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1r6q5pb/i_tried_vibe_coding_a_full_saas_with_claude_n8n/",
      "author": "Ok_Interaction_102",
      "created_utc": "2026-02-16 23:49:59",
      "score": 33,
      "num_comments": 17,
      "upvote_ratio": 0.9,
      "text": "I built a small SaaS for a member using Claude Code + n8n and honestly didn’t expect it to work as smoothly as it did.\n\nClaude handled most of the logic, n8n glued everything together, and the result was a working product way faster than I thought was possible. It wasn’t perfect, but it was *good enough* to ship.\n\nCurious how others here are using AI for real builds (not just toy demos).  \nAre you letting AI write logic, or just using it as an assistant?\n\nI recorded the full build process if anyone wants to see how the workflow actually looked:  \n[https://youtu.be/ZPiDvUL4B7o](https://youtu.be/ZPiDvUL4B7o)\n\nJSON CODE HERE: [https://pastebin.com/Drv4JyXY](https://pastebin.com/Drv4JyXY)",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1r6q5pb/i_tried_vibe_coding_a_full_saas_with_claude_n8n/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o5rynpr",
          "author": "AutoModerator",
          "text": "**Video posts must include the workflow code.** The link to the code MUST be in the reddit post, if it is not in the reddit post itself, your post will be removed.\n\n**Acceptable ways to share the code:**\n\n* Github Repository\n* Github Gist\n* Directly here on Reddit in a code block\n* n8n.io/workflows/\n\nSharing the code any other way is not allowed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-16 23:50:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u5fqo",
          "author": "Hackerjurassicpark",
          "text": "Why are you not wearing a shirt",
          "score": 11,
          "created_utc": "2026-02-17 09:10:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vy8bn",
              "author": "bigchiano",
              "text": "because he is trying to seduce his viewers",
              "score": 2,
              "created_utc": "2026-02-17 16:15:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5rynol",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 3,
          "created_utc": "2026-02-16 23:49:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s4p6y",
          "author": "nolanlawfirm",
          "text": "Its insane. I wanted a better way to mix up my AI usage so I told claude what I wanted and we built a browser extension. \n\nI'm a lawyer, not a developer, so treat the code accordingly — it works, but there are patterns in here that will make real engineers wince.\n\n**Architecture:**\n\n* MV3 with port-based messaging between content scripts and background service worker\n* Platform-specific content scripts (`content-claude.js`, `content-chatgpt.js`, `content-gemini.js`) each with their own MutationObserver watching for assistant responses\n* Alarms API keepalive at 0.3 min intervals to prevent service worker termination\n* Remote config hosted on GitHub Pages with bundled fallback — lets me update DOM selectors without republishing\n* 2200ms debounce before routing to avoid capturing partial streaming responses\n* Injection guards (`window.__AI_ENSEMBLE_[PLATFORM]_V17__`) to prevent duplicate content script loading\n* Append mode — never overwrites existing text in the input field\n\n**What I learned the hard way:**\n\nThe biggest pain point is DOM selector fragility. Claude, ChatGPT, and Gemini all structure their response containers differently, and they change without warning. Building the remote config system was the most forward-thinking decision I made — but it's still a maintenance treadmill.\n\nPort-based messaging turned out way more reliable than `chrome.runtime.sendMessage` for persistent connections. The service worker termination problem in MV3 is real and the Alarms API workaround feels like a hack, but it works.\n\n**Links:**\n\n* [GitHub](https://github.com/pattalkslaw-del/ai-ensemble-extension) — MIT license\n* [Chrome Web Store](https://chromewebstore.google.com/detail/ai-ensemble/lomphkghalmannpiophgdfjfdchfidim)\n\nBut now whenever I need something, I hit claude code or AI studio and make the software that does that one thing. ",
          "score": 1,
          "created_utc": "2026-02-17 00:24:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5snk3w",
              "author": "Ok_Interaction_102",
              "text": "Claude is game changing right now outcompeting openai and google",
              "score": 1,
              "created_utc": "2026-02-17 02:16:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ucy83",
                  "author": "BiscottiBusiness9308",
                  "text": "Did you try codex? Seems better than cc for 10% of the cost",
                  "score": 1,
                  "created_utc": "2026-02-17 10:21:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5sekmy",
          "author": "jake_that_dude",
          "text": "same experience on our end. claude writes basically all the logic, n8n handles the orchestration layer, you sit in the middle reviewing outputs and catching edge cases\n\nthe \"ai writes logic vs assistant\" framing kinda breaks down in practice though. for anything non-trivial, what actually works is breaking the scope down really aggressively before you start. give claude the full system context and you get a mess. give it one node's worth of work at a time and it's sharp\n\nthe n8n structure naturally enforces this which is probably why this combo works so well. each node is a bounded unit. claude can reason about it without losing the thread\n\nwhere it falls apart is error handling. claude will happily ship code that works for the happy path and forget about the malformed webhook, the api that returns 429, the json that's missing a field. still on you to spec that out",
          "score": 1,
          "created_utc": "2026-02-17 01:22:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5sniby",
              "author": "Ok_Interaction_102",
              "text": "literally claude is doing wonders right now",
              "score": 0,
              "created_utc": "2026-02-17 02:15:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5t3b09",
          "author": "etern1ty0",
          "text": "I built a simple n8n workflow entirely with Claude’s help that finds and replaces a certain string of text throughout an entire documentation platform that we use for my MSP (Hudu) which saves literal hours of time in updating records. Granted, if we had straight up SQL access, that could be done there just as easily but the very fact that claude can connect to n8n via MCP means it can do literally any type of workflow you can dream of.",
          "score": 1,
          "created_utc": "2026-02-17 03:54:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u5yf4",
          "author": "GarbageOk5505",
          "text": "Cool build. One thing I'd flag from doing something similar  when Claude writes the logic and n8n glues it together, it's easy to ship without noticing what the AI *didn't* build. Data isolation between users, input validation on webhooks, secret handling. The AI gets the feature working but tends to skip the invisible safety stuff because it's optimizing for \"does it work\" not \"is it safe.\"\n\nNot saying your build has these issues, just that I got burned by exactly this pattern. Shipped fast, got a support ticket about one user seeing another user's data. Classic multi-tenant isolation miss that Claude didn't think to add and I didn't think to check.\n\nWorth a quick audit pass specifically looking for what's *missing* rather than what's broken.",
          "score": 1,
          "created_utc": "2026-02-17 09:15:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5v50kt",
          "author": "Traditional_Donut_38",
          "text": "How much did it cost you roughly to complete this process?",
          "score": 1,
          "created_utc": "2026-02-17 13:45:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5y3q0u",
              "author": "Ok_Interaction_102",
              "text": "2$ probably maybe even less n8n is a monthly subscription of 25$ for the cloud instance or you can claude pro for 20$ a month",
              "score": 1,
              "created_utc": "2026-02-17 22:24:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o64h6ei",
                  "author": "Traditional_Donut_38",
                  "text": "Watched your video. Really cool and thanks for the upload but kinda bummed you skipped over the process of setting up claude code in VS - it was actually pretty lengthy to set up cause the callback order from authentication code inside VS fails",
                  "score": 1,
                  "created_utc": "2026-02-18 20:59:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r82lx7",
      "title": "How I'm using n8n + Claude to build AI tools for small businesses - full workflow breakdown",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1r82lx7/how_im_using_n8n_claude_to_build_ai_tools_for/",
      "author": "Main_Video5151",
      "created_utc": "2026-02-18 13:11:36",
      "score": 32,
      "num_comments": 7,
      "upvote_ratio": 0.88,
      "text": "I've been selling AI automations to local businesses and recently switched to using Claude Code for most of the logic and n8n for the backend workflows.\n\nThe combo is honestly broken. I built a full booking system with AI voice handling in like 2 days. Client is paying me monthly for it and has no idea how fast it was to set up.\n\nRecorded the whole build process if anyone wants to see how it works:  \n[https://youtu.be/ZPiDvUL4B7o](https://youtu.be/ZPiDvUL4B7o)\n\nFor anyone doing the same thing - are you building from scratch every time or do you have templates you reuse? Trying to figure out the best way to scale this.\n\nJSON CODE HERE: [https://pastebin.com/Drv4JyXY](https://pastebin.com/Drv4JyXY)",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1r82lx7/how_im_using_n8n_claude_to_build_ai_tools_for/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o61plx6",
          "author": "AutoModerator",
          "text": "**Video posts must include the workflow code.** The link to the code MUST be in the reddit post, if it is not in the reddit post itself, your post will be removed.\n\n**Acceptable ways to share the code:**\n\n* Github Repository\n* Github Gist\n* Directly here on Reddit in a code block\n* n8n.io/workflows/\n\nSharing the code any other way is not allowed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-18 13:11:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62sod3",
          "author": "r0cketio",
          "text": "Good work, but being shirtless in a video about building software solutions for small business is not a good look. At least for me, it makes it harder to take you seriously.",
          "score": 14,
          "created_utc": "2026-02-18 16:25:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o65xxox",
              "author": "voidreamer",
              "text": "Who cares, it’s not like he’s applying for a job here ",
              "score": 0,
              "created_utc": "2026-02-19 01:30:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o66h214",
                  "author": "r0cketio",
                  "text": "*You* will, hopefully. If/when you mature a bit more.",
                  "score": 3,
                  "created_utc": "2026-02-19 03:22:58",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o66c4sq",
                  "author": "Main_Video5151",
                  "text": "thank you",
                  "score": 1,
                  "created_utc": "2026-02-19 02:53:17",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o61plw6",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-18 13:11:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65ts98",
          "author": "jake_that_dude",
          "text": "yeah the claude code combo is absolutely broken in the best way. i've been doing the same thing, building full booking systems in 2 days then charging monthly. the gap between what the client thinks went into it and the actual dev time is hilarious. honestly stopped using templates after the first 5 because once you lock in the workflow pattern, the custom versions are just variable swaps. docs/error handling takes longer than the core logic now.",
          "score": 1,
          "created_utc": "2026-02-19 01:06:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6fwfm",
      "title": "New to n8n",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1r6fwfm/new_to_n8n/",
      "author": "OkCalligrapher4089",
      "created_utc": "2026-02-16 17:28:02",
      "score": 26,
      "num_comments": 17,
      "upvote_ratio": 0.96,
      "text": "Hi everyone i just started today and I’m trying to learn the basics of n8n I’d love to hear your best advice for beginners. Are there any videos, guides, or tips you would recommend to help me get started?\nThanks in advance for your help!",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/n8n/comments/1r6fwfm/new_to_n8n/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o5pt4wy",
          "author": "AutoModerator",
          "text": "**Need help with your workflow?**\n\nTo receive the best assistance, please share your workflow code so others can review it:\n\n**Acceptable ways to share:**\n\n* Github Gist (recommended)\n* Github Repository\n* Directly here on Reddit in a code block\n\nIncluding your workflow JSON helps the community diagnose issues faster and provide more accurate solutions.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-16 17:28:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pvvmd",
          "author": "DevKoussay",
          "text": "\n\n\\- Installing n8n locally using NPM and Docker: [https://theowllogic.com/installing-n8n-setup-locally](https://theowllogic.com/installing-n8n-setup-locally)  \n\\- n8n workflow, data, and data-flow fundamental: [https://theowllogic.com/n8n-workflow-nodes-data-flow](https://theowllogic.com/n8n-workflow-nodes-data-flow)  \n\\- How to create a your first Hello World workflow: [https://theowllogic.com/first-hello-world-n8n-workflow](https://theowllogic.com/first-hello-world-n8n-workflow)  \n\\- Webhooks in n8n for beginners: [https://theowllogic.com/webhook-in-n8n-explained](https://theowllogic.com/webhook-in-n8n-explained)  \n\\- How to build conditional logics in n8n (real-usecase): [https://theowllogic.com/conditional-logic-in-n8n](https://theowllogic.com/conditional-logic-in-n8n)  \n\\- How to handle errors in n8n like a pro: [https://theowllogic.com/handle-errors-in-n8n](https://theowllogic.com/handle-errors-in-n8n)  \n\\- How to handle API rate limits: [https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n](https://theowllogic.com/how-to-handle-api-rate-limits-in-n8n)  \n\\- n8n expressions comprehensive guide: [https://theowllogic.com/n8n-expressions-complete-guide](https://theowllogic.com/n8n-expressions-complete-guide)\n\nMental modal posts\n\n\\- 50 boring tasks you can automate with n8n: [https://theowllogic.com/automate-boring-tasks-n8n](https://theowllogic.com/automate-boring-tasks-n8n)  \n\\- How to plan your n8n workflow: [https://theowllogic.com/plan-n8n-workflow](https://theowllogic.com/plan-n8n-workflow)\n\nStart with small workflows, and familiar with n8n UI. after that, you can scale to medium - enterprise based workflows. :)",
          "score": 14,
          "created_utc": "2026-02-16 17:41:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5py5si",
              "author": "Ok_Importance_7479",
              "text": "Lots of useful resources here. Thanks! Not sure how suitable they are for a total beginner though so I'll point the OP to YouTube and the likes of Nate Herk. Other than that, I'd say think of a use case (e.g., invoice processing or blog writing) and have a go. Jumping in head first can be a great way to learn basics and you'll find it's quite intuitive up to a point.",
              "score": 3,
              "created_utc": "2026-02-16 17:51:45",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5qdz96",
              "author": "OkCalligrapher4089",
              "text": "Tysm",
              "score": 1,
              "created_utc": "2026-02-16 19:04:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5r2zr6",
          "author": "bishopsworth",
          "text": "Try not to get carried away with dozens and nodes and services. Keep things as simple as you can. Focus on creating resilient and predictable systems. When it gets to the stage that you can’t remember how many nodes your workflow has. You’ve  probably got too many.",
          "score": 3,
          "created_utc": "2026-02-16 21:05:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ru474",
              "author": "notalentwasted",
              "text": " Could not agree more. I see a lot of nodes that lack actual function in reality. Especially when a python script can be coded to do a lot of the leg work. \nN8n is sold as no code but it's absolutely a low code engine.",
              "score": 1,
              "created_utc": "2026-02-16 23:24:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5q0bpa",
          "author": "Honest_External_7430",
          "text": "Hey - too quick to reject! All AI learning costs money continuously. I was you a few months ago but trust me a lot of the advice from devkoussay are GOLD because you will definitely need them later so save that content close by on your journey. Even Nate’s first few videos are about these!",
          "score": 2,
          "created_utc": "2026-02-16 18:01:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qdvwh",
              "author": "OkCalligrapher4089",
              "text": "Tysm",
              "score": 1,
              "created_utc": "2026-02-16 19:03:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qtqd5",
          "author": "awnliy",
          "text": "RemindMe! after 3 days",
          "score": 1,
          "created_utc": "2026-02-16 20:20:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qtwmk",
              "author": "RemindMeBot",
              "text": "I will be messaging you in 3 days on [**2026-02-19 20:20:12 UTC**](http://www.wolframalpha.com/input/?i=2026-02-19%2020:20:12%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/n8n/comments/1r6fwfm/new_to_n8n/o5qtqd5/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fn8n%2Fcomments%2F1r6fwfm%2Fnew_to_n8n%2Fo5qtqd5%2F%5D%0A%0ARemindMe%21%202026-02-19%2020%3A20%3A12%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201r6fwfm)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "score": 1,
              "created_utc": "2026-02-16 20:21:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5qz12e",
          "author": "_Anime_Anuradha",
          "text": "Hey, Its my platform... I hope it helps \" [freeaiapikey.com](http://freeaiapikey.com) \"",
          "score": 1,
          "created_utc": "2026-02-16 20:46:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qz6tq",
          "author": "Hassan_Afridi08",
          "text": "RemindMe! after 5 days",
          "score": 1,
          "created_utc": "2026-02-16 20:47:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rlrn4",
          "author": "Elder__Berry",
          "text": "Remind me! After 5 days",
          "score": 1,
          "created_utc": "2026-02-16 22:38:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sdcvf",
          "author": "OgRealtor2701CO",
          "text": "It's pretty hard to get started, as there are dozens of tutorials and lots of information. Start by understanding the fundamentals of APIs and a little JavaScript: Objects, JSON and functions. Remember that N8N is a visual composer for code — you're still working with logic, just in a visual way rather than code-based. You don't have to learn how to code, but understanding these fundamentals will help you grasp everything much faster.",
          "score": 1,
          "created_utc": "2026-02-17 01:14:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u022f",
          "author": "DjXer007_",
          "text": "Is it true that there are 2 types of API - Free ones that can be used unlimited times for N8N executions and paid API that use tokens and will start sending your invoice for use ? \n\nAlso, if I have a use the free CHATGPT version, then collecting this to my N8N CHATGPT API, the same or is thid also a limited features",
          "score": 1,
          "created_utc": "2026-02-17 08:19:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qis75",
          "author": "Think-Warning-441",
          "text": "Bro just Connect Claude Code to your n8n instance and let it build whatever you want.",
          "score": -1,
          "created_utc": "2026-02-16 19:26:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r76lom",
      "title": "We Built Mobile app to monitor and run your n8n workflows from your phone",
      "subreddit": "n8n",
      "url": "https://apps.apple.com/us/app/n8n-automations-nathan/id6754570005",
      "author": "Silent_Employment966",
      "created_utc": "2026-02-17 13:54:01",
      "score": 24,
      "num_comments": 11,
      "upvote_ratio": 0.92,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion - No Workflows",
      "permalink": "https://reddit.com/r/n8n/comments/1r76lom/we_built_mobile_app_to_monitor_and_run_your_n8n/",
      "domain": "apps.apple.com",
      "is_self": false,
      "comments": [
        {
          "id": "o5vimmr",
          "author": "Southern_Tennis5804",
          "text": "Cool Man",
          "score": 2,
          "created_utc": "2026-02-17 14:58:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vqkyh",
          "author": "magnusthewize",
          "text": "Looking forward to checking this out later!",
          "score": 2,
          "created_utc": "2026-02-17 15:37:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vuea9",
          "author": "jihadjo",
          "text": "Yeah, it's stylish.\n\nBut honestly, I can't be bothered with the subscriptions.",
          "score": 2,
          "created_utc": "2026-02-17 15:56:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wzpsr",
          "author": "NoodleBug7667",
          "text": "Does n8n not provide an API key? Why ask for username and password?",
          "score": 2,
          "created_utc": "2026-02-17 19:14:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63fo31",
          "author": "Ok_Barber_9280",
          "text": "Nice! Do you know if this is in n8n's roadmap at all?",
          "score": 2,
          "created_utc": "2026-02-18 18:08:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5v7690",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-17 13:57:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5v79bn",
              "author": "Silent_Employment966",
              "text": "its direct n8n instance. do give it a try",
              "score": 1,
              "created_utc": "2026-02-17 13:58:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5v9zcb",
          "author": "Deep_Structure2023",
          "text": "Can this app send data of push notifications to Google sheets, so that I can keep log of information",
          "score": 1,
          "created_utc": "2026-02-17 14:13:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5va7pi",
              "author": "Silent_Employment966",
              "text": "its the same n8n instances but just on your phone. you can run all your workflow as you wish",
              "score": 1,
              "created_utc": "2026-02-17 14:14:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5vag99",
                  "author": "Deep_Structure2023",
                  "text": "Cool, will check it out",
                  "score": 1,
                  "created_utc": "2026-02-17 14:15:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6063pe",
          "author": "TechnicalSoup8578",
          "text": "Connecting directly to user instances and surfacing execution logs means you are essentially building a mobile observability layer on top of n8n’s API. Are you caching execution data locally or pulling everything in real time? You sould share it in VibeCodersNest too",
          "score": 1,
          "created_utc": "2026-02-18 05:31:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbheny",
      "title": "Roadmap to Learn n8n – How Long Does It Take to Get Good?",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1rbheny/roadmap_to_learn_n8n_how_long_does_it_take_to_get/",
      "author": "archimindai",
      "created_utc": "2026-02-22 09:20:41",
      "score": 24,
      "num_comments": 12,
      "upvote_ratio": 0.91,
      "text": "Can anyone please give me a proper roadmap to learn n8n? I want to understand what I should learn step by step and what type of things I should focus on.\nAlso, how much time does it usually take to gain good working knowledge of n8n?",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/n8n/comments/1rbheny/roadmap_to_learn_n8n_how_long_does_it_take_to_get/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o6qur2b",
          "author": "AutoModerator",
          "text": "**Need help with your workflow?**\n\nTo receive the best assistance, please share your workflow code so others can review it:\n\n**Acceptable ways to share:**\n\n* Github Gist (recommended)\n* Github Repository\n* Directly here on Reddit in a code block\n\nIncluding your workflow JSON helps the community diagnose issues faster and provide more accurate solutions.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-22 09:20:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rlos4",
          "author": "automator71",
          "text": "Learning n8n is less about coding and more about understanding data flow and workflow.\nIt depends on your current skill level, if you are coming from tech background, it'll take around 20-25 hrs, if not, 3x or 4x time.\nAlso, once you've learnt it, build your own workflows, then you'll learn the most.",
          "score": 5,
          "created_utc": "2026-02-22 13:16:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rz4wf",
          "author": "mallrat32",
          "text": "There are a lot of videos that jump into AI way too soon. That made it incredibly daunting for me and I almost gave up\n\nWhat helped me was to try and figure out what I wanted to automate based on things I find tedious \n\nRight now the most complex tools I’m using are HTTP requests and code nodes which I do use an LLM to help write\n\nOnce you understand the syntax of the data and what nodes are available, it makes a lot more sense and the best way to do that is to fumble through your own projects which will take time",
          "score": 5,
          "created_utc": "2026-02-22 14:35:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6sbz89",
          "author": "Available_Cupcake298",
          "text": "skip the roadmap. pick one annoying task you actually do every day and try to automate it. you'll learn way faster fumbling through a real problem than watching tutorials. most people spend weeks learning the tool and then can't think of what to build.",
          "score": 6,
          "created_utc": "2026-02-22 15:40:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tpeso",
          "author": "emmettvance",
          "text": "skip the roadmap and just pick one manual task you do every day.. learning by trying to force an actual problem to work will teach you faster than watching ten hours of tutorials.. you will be functional in a week if you stick to basic triggers and the http request node..",
          "score": 2,
          "created_utc": "2026-02-22 19:25:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tqpnk",
          "author": "Available-Claim2445",
          "text": "Begin by trying to automate a specific task, try different nodes and connecting them with each other. I recommend watching Nate Herk as he has a ton of legitimately good tutorials. I had a really light tech background and picked it up within days. There isn’t a proper step by step process on learning; How fast or slow you learn is entirely up to you.",
          "score": 2,
          "created_utc": "2026-02-22 19:32:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ud8oe",
          "author": "psychonaut_eyes",
          "text": "I dont think you need a roadmap, just start doing some workflows to help with your life, like summarizing mails, an personal agent, so on.  with that you will eventually learn how stuff works and get more experience",
          "score": 2,
          "created_utc": "2026-02-22 21:25:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6r3cih",
          "author": "Acceptable_Host_7531",
          "text": "RemindmMe! 2 days",
          "score": 1,
          "created_utc": "2026-02-22 10:43:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rxcqn",
          "author": "adminsattitude",
          "text": "watch some youtube videos about fundementals of n8n, then ask some ai to give you some tasks you can then practice accomplishing with n8n. you can using opsily to host one n8n and start testing with it ",
          "score": 1,
          "created_utc": "2026-02-22 14:25:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6sgneh",
          "author": "theLewisLu",
          "text": "It’s a lot of work to learn n8n. So when OpenClaw came out, I used it to run n8n. Works well for me.",
          "score": 1,
          "created_utc": "2026-02-22 16:00:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rb3p4",
          "author": "seevobuffet",
          "text": "https://youtu.be/jCTADO1A6B0\nWatch this vid to understand how to land your first client with n8n",
          "score": -1,
          "created_utc": "2026-02-22 11:55:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r83qu1",
      "title": "As promised, sharing my Restaurant AI Voice Agent + Table Booking Automation",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1r83qu1/as_promised_sharing_my_restaurant_ai_voice_agent/",
      "author": "n8n_with_kunal",
      "created_utc": "2026-02-18 14:00:07",
      "score": 23,
      "num_comments": 11,
      "upvote_ratio": 0.96,
      "text": "Hey guys!! I’m a day late 😅 but as promised, and especially for u/Wild-Lama-474 who asked for the restaurant version, here’s the AI voice agent workflow I mentioned earlier.\n\nI originally built this around the same time as my dental receptionist agent while experimenting with AI voice automation. It was mainly a learning project, but instead of letting it sit unused in my n8n workspace, I figured it might actually help people building similar systems or learning automation.\n\nThis one is designed for **restaurant table bookings** and includes a full backend automation system for managing reservations automatically.\n\n[Workflow](https://preview.redd.it/kjbf1grce9kg1.png?width=1431&format=png&auto=webp&s=cbf406c8a8f6e27ef67ef8161286f14bb9f0a90b)\n\n[Dedicated frontend to view bookings](https://preview.redd.it/mnr1pupde9kg1.png?width=1919&format=png&auto=webp&s=f28c355041f12d73e043cdb2d474647803b5907a)\n\n# 🔧 Workflow Overview\n\nThis is a **complete table booking automation system** built around four main workflows:\n\n# 🟦 1. Booking System (Main Flow)\n\n**Trigger:** Webhook (POST request for booking)\n\n**What it does:**\n\n* Receives booking requests from the voice agent/web app\n* Automatically creates **date-specific Google Sheets** if they don’t exist\n* Assigns tables intelligently\n\n**Table Assignment Logic:**\n\n* Checks for available tables (`Not booked` status)\n* Same-day bookings → assigns first available table\n* Future bookings → uses **time-gap logic** so multiple bookings can exist per table safely:\n   * 90-minute booking slots\n   * Minimum 30-minute buffer between bookings\n\n**Data stored per booking:**\n\n* name\n* contact\\_number\n* guests\n* booking\\_time\n* booking\\_date\n* table\\_id\n* status\n\n# 🟩 2. Cancellation System\n\n**Trigger:** Webhook\n\n**Process:**\n\n* Finds the matching booking\n* Updates status → `Not booked (Cancelled)`\n* Clears customer info while keeping table availability intact\n\n# 🟧 3. Rescheduling System\n\n**Trigger:** Webhook\n\n**Two-step logic:**\n\n1. Creates or updates booking on the new date\n2. Removes the old booking automatically\n\nSupports both same-day and future rescheduling.\n\nStatus is marked as **“Rescheduled.”**\n\n# 🟥 4. Cleanup System\n\n**Trigger:** Scheduled (runs every 5 minutes)\n\nAutomatically:\n\n* Detects expired bookings (end time + 90 mins passed)\n* Frees tables\n* Resets status back to `Not booked`\n\n# ⭐ Key Features\n\n**Smart Table Management**\n\n* 90-minute booking duration\n* Circular time calculation (handles midnight edge cases)\n* 30-minute buffer between bookings\n\nI built this mainly to learn:\n\n* n8n automation design\n* webhook-based systems\n* scheduling logic\n* real-world state management without a traditional database\n\nIt might be a bit outdated but If you’re building AI receptionists, voice agents, or booking systems, you can reuse or modify large parts of this.\n\n[Workflow Link](https://github.com/kunal-n8n/kunal-n8n-portfolio/blob/main/workflows/restaurant_AI_VA.json)  \n[Google Template Link](https://github.com/kunal-n8n/kunal-n8n-portfolio/blob/main/google_sheets_templates/restaurant_AI_VA_template.xlsx)\n\nHappy to answer questions or explain design decisions if anyone’s curious 👍",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1r83qu1/as_promised_sharing_my_restaurant_ai_voice_agent/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o61yfna",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-18 14:00:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63qjzc",
          "author": "fuckredditapp4",
          "text": "This looks cool but I've never even booked a dinner reservation before. I just go there. Maybe I'm just a poor?",
          "score": 2,
          "created_utc": "2026-02-18 18:55:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o63spb7",
              "author": "n8n_with_kunal",
              "text": "Lmao neither have I. But there are some restaurants which actually need bookings to be made in advance and it might help them. \nAnd besides that, I actually learned a lot while building this so it was a good fun project for me.",
              "score": 3,
              "created_utc": "2026-02-18 19:05:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o641qdp",
                  "author": "xerept",
                  "text": "I think the proof of concept and practice is super valuable for what you’ve made!",
                  "score": 3,
                  "created_utc": "2026-02-18 19:47:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o65pwwk",
          "author": "dooinglittle",
          "text": "Overall the design looks good enough, but I’m betting there’s a LOT here you can simplify. These spaghetti monsters are tough to maintain",
          "score": 2,
          "created_utc": "2026-02-19 00:44:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6845g0",
              "author": "Only_Ad_341",
              "text": "Totally agree",
              "score": 1,
              "created_utc": "2026-02-19 11:33:13",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o69byvm",
              "author": "n8n_with_kunal",
              "text": "Lol it does look like spaghetti monsters now that you've mentioned it. But essentially, all those nodes are majorly Google sheets, if and some code nodes.\n\nI had built another workflow which is way more simple than this and I've posted that here too. Had to use API of cal tho, so that's a downside.",
              "score": 1,
              "created_utc": "2026-02-19 15:52:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o696qzs",
          "author": "epidco",
          "text": "did u run into any race condition issues with google sheets yet? since it doesnt have row locking i'd worry about two people snagging the same slot at the exact same second if the webhooks hit at once. i usually use postgres for this kind of logic but keeping it all in a spreadsheet is a rly clever way to keep the stack simple for a poc ngl",
          "score": 2,
          "created_utc": "2026-02-19 15:26:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69b0c1",
              "author": "n8n_with_kunal",
              "text": "I never did, but I had kept this edge case in mind. Below is how I thought this is solvable. \n\nThere are multiple tables at a restaurant and there's a whole row in the sheets which keeps tab of which tables are already booked for what time, so if two people called in at the same time for the same time slot they'll still be booked for two different tables. \n\nLet's say only one table is available but two people called in for the same time slot, even then, webhook executions hit at nearly the same time, both executions are processed independently by n8n. The first execution that writes the booking effectively “wins”, and the other person is asked to book again for some other day.\n\nSince this was a POC and intentionally kept DB-less, I accepted the small race-condition risk instead of adding locking via Postgres or a transactional store.",
              "score": 1,
              "created_utc": "2026-02-19 15:47:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o62lor0",
          "author": "Rizz_Pineapple",
          "text": "Impressive",
          "score": 1,
          "created_utc": "2026-02-18 15:53:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6ui2r",
      "title": "Anyone else here self-host your AI models for production workflows?",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1r6ui2r/anyone_else_here_selfhost_your_ai_models_for/",
      "author": "edbuildingstuff",
      "created_utc": "2026-02-17 03:00:19",
      "score": 19,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "I have been building customer support & dispute handling workflows for my SME clients (mostly electricians around melbourne) and it has reached a point where the monthly 'maintenance' cost I charge ($200/month) is not covering the api costs incur from their usage.\n\nTrying to stop this burn now so I am looking at a few open-source models like Qwen 3 and Llama 3. And just to add extra guardrails and improve performance of these models at particular steps, I am experimenting fine-tuning them with unsloth and deploy them on cloud gpus from AWS.\n\nWondering if anyone has done the same? Any tips and tricks for fine-tuning? Any suggestions of deployment as well? (AWS has been painful for me to set up 💀)",
      "is_original_content": false,
      "link_flair_text": "Servers, Hosting, & Tech Stuff",
      "permalink": "https://reddit.com/r/n8n/comments/1r6ui2r/anyone_else_here_selfhost_your_ai_models_for/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o5tabrs",
          "author": "shajid-dev",
          "text": "I think you have to go with the mainstream models like Gemini, and make sure to implicit or explicit cache responses and inputs, which means you will get a fewer bills. This way you won't be compromising your LLMs and it's response. ",
          "score": 2,
          "created_utc": "2026-02-17 04:42:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tss0j",
          "author": "Fit_Barracuda4651",
          "text": "Doing a lot of on-prem AI stuff for clients. Although you could go and deploy some stuff your self, I would say that the only reason to deploy your own stuff would be if there are data privacy concerns. The small models (I really like Ministral 3 14B) can very well be deployed on consumer grade hardware, but they are also super cheap to just query on open router. If you value your time, just try to make your application work with smaller models. To me this is in fact very liberating, because for application developers, this means much more independence from the frontier model vendors. \n\nWhat model are you currently mainly using that is responsible for the cost?",
          "score": 2,
          "created_utc": "2026-02-17 07:11:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xys8a",
              "author": "edbuildingstuff",
              "text": "Thanks for the rec I will check the ministral out! Any tips for fine-tuning it with example use cases?\n\nRight now for live production workflows I am using Gemini 2.5 flash because of the generous amount of free api requests google gives. But for projects where paid tier is needed because of high client usage the cost really jumps up.",
              "score": 1,
              "created_utc": "2026-02-17 22:00:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5w4gsk",
          "author": "pmv143",
          "text": "If your $200 per client isn’t covering API burn, you’re probably at the point where infra architecture matters more than model choice. For steady support workflows, a well tuned 7B to 14B open model with retrieval will usually get you most of the way there at a fraction of GPT tier costs. I’d validate whether you actually need fine tuning before going deep on it. In a lot of SME support cases, prompt tightening plus good RAG beats full fine tune.\n\nOn deployment, the big lever is utilization. If traffic is predictable, even a single dedicated GPU shared across multiple clients can undercut per token APIs fast. If it’s bursty, you’ll want aggressive batching or something that scales down cleanly between spikes. The real question is: what does your average daily request volume per client look like? That determines whether self hosting will actually fix the burn or just shift it.",
          "score": 2,
          "created_utc": "2026-02-17 16:47:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5y2lkr",
              "author": "edbuildingstuff",
              "text": "That's a solid point thanks for pointing out! I guess it really comes down to each client project on a case by case basis then. Different client & different use cases means different level of usages & frequency which I need to estimate to choose the right approach",
              "score": 1,
              "created_utc": "2026-02-17 22:18:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5y5iwz",
                  "author": "pmv143",
                  "text": "Exactly. One simple exercise that helps is to map each client to three numbers: average daily tokens, peak concurrency, and latency tolerance. Once you have those, the hosting decision usually becomes obvious. A lot of people jump to fine-tuning or self-hosting before running that math.",
                  "score": 2,
                  "created_utc": "2026-02-17 22:33:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5syhxa",
          "author": "coinclink",
          "text": "They are not going to perform anywhere near as well as the mainstream models. The quantized versions you can run locally without a $20-50k GPU are really only for toys or personal stuff, not professional-grade work. Even the non-quantized ones you might be able to use for cheaper in something like AWS are not going to work anywhere near as well as the latest Claude, Gemini, or GPT models.",
          "score": 1,
          "created_utc": "2026-02-17 03:22:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tf55j",
              "author": "riceinmybelly",
              "text": "Howso? These small models are doing the lord’s work for simple tasks and if you fine tune, even some overfitting isn’t bad for instructions in my experience. The chat interface runs on a larger one but 30B is plenty. You don’t meed an encyclopedia to do lookups with structured answers or tool calls",
              "score": 2,
              "created_utc": "2026-02-17 05:17:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5u4q0p",
          "author": "Fatso_Wombat",
          "text": "I found it easier to use API of the cheaper models for things rather than host them.\n\nYour milage may vary but you can buy a lot of tokens for the price of hardware.",
          "score": 1,
          "created_utc": "2026-02-17 09:03:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xzx84",
              "author": "edbuildingstuff",
              "text": "Sometimes clients already have the hardware on-prem so by deploying for them on-prem I am effectively letting them have the control but also the responsibility of inference. Imo it makes them happier if their ai app doesn't involve extra per token bills haha",
              "score": 1,
              "created_utc": "2026-02-17 22:05:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5weftx",
          "author": "Available_Cupcake298",
          "text": "the real point from pmv143 is utilization. per-token API costs hurt when bursty, self-hosting hurts when idle. what does your actual traffic look like day to day?",
          "score": 1,
          "created_utc": "2026-02-17 17:36:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r88gzd",
      "title": "NEW DAY NEW ERROR😅",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/gallery/1r88gzd",
      "author": "Thin-Carrot1836",
      "created_utc": "2026-02-18 16:57:35",
      "score": 18,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Help",
      "permalink": "https://reddit.com/r/n8n/comments/1r88gzd/new_day_new_error/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": [
        {
          "id": "o62zumu",
          "author": "AutoModerator",
          "text": "**Need help with your workflow?**\n\nTo receive the best assistance, please share your workflow code so others can review it:\n\n**Acceptable ways to share:**\n\n* Github Gist (recommended)\n* Github Repository\n* Directly here on Reddit in a code block\n\nIncluding your workflow JSON helps the community diagnose issues faster and provide more accurate solutions.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-18 16:57:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64bgxy",
          "author": "Training_Bet_2747",
          "text": "2 loops in same workflow? You’re iterating too much. \n\nDivide it into main flow and subflows. Whatever needs to be iterated into loops go into subflow.",
          "score": 4,
          "created_utc": "2026-02-18 20:32:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68v44u",
              "author": "GimliDaAutomator",
              "text": "100% correct. N8N loops are not perfect thus subflows are a better solution.",
              "score": 3,
              "created_utc": "2026-02-19 14:26:12",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o66ur6e",
              "author": "Thin-Carrot1836",
              "text": "Okay",
              "score": 1,
              "created_utc": "2026-02-19 04:52:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o637cx5",
          "author": "YummiesLOL",
          "text": "Do you have a reset on your nested loop?",
          "score": 2,
          "created_utc": "2026-02-18 17:31:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66uqms",
              "author": "Thin-Carrot1836",
              "text": "No",
              "score": 1,
              "created_utc": "2026-02-19 04:52:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o67biw0",
                  "author": "YummiesLOL",
                  "text": "In your nested loop, tick the \"reset\" option, and add $prevNode.name === 'French Website2'\n\nThis will allow the Loops to behave exactly how you would expect them.",
                  "score": 2,
                  "created_utc": "2026-02-19 07:05:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6767d5",
          "author": "arisurana",
          "text": "Shameless plug: try neudash.com and never need to deal with complex logic for your automation.\nIt does pretty much everything n8n does but insted of you needing to del with logic in n8n boxes it writes the logic by writing your automation for you.",
          "score": 1,
          "created_utc": "2026-02-19 06:20:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o676ayh",
              "author": "arisurana",
              "text": "Shameless plug because I am building this tool, having burnt by exactly this kind of problem",
              "score": 1,
              "created_utc": "2026-02-19 06:21:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6g5t0b",
          "author": "makealottacents",
          "text": "I like clankers now",
          "score": 1,
          "created_utc": "2026-02-20 16:40:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9iazv",
      "title": "I tried “vibe coding” a full SaaS with Claude + n8n — this surprised me",
      "subreddit": "n8n",
      "url": "https://www.reddit.com/r/n8n/comments/1r9iazv/i_tried_vibe_coding_a_full_saas_with_claude_n8n/",
      "author": "Ok_Interaction_102",
      "created_utc": "2026-02-20 01:49:21",
      "score": 17,
      "num_comments": 4,
      "upvote_ratio": 0.95,
      "text": "I built a small SaaS for a member using Claude Code + n8n and honestly didn’t expect it to work as smoothly as it did.\n\nClaude handled most of the logic, n8n glued everything together, and the result was a working product way faster than I thought was possible. It wasn’t perfect, but it was *good enough* to ship.\n\nCurious how others here are using AI for real builds (not just toy demos).  \nAre you letting AI write logic, or just using it as an assistant?\n\nI recorded the full build process if anyone wants to see how the workflow actually looked:  \n[https://youtu.be/ZPiDvUL4B7o](https://youtu.be/ZPiDvUL4B7o)\n\nJSON CODE HERE: [https://pastebin.com/Drv4JyXY](https://pastebin.com/Drv4JyXY)",
      "is_original_content": false,
      "link_flair_text": "Workflow - Code Included",
      "permalink": "https://reddit.com/r/n8n/comments/1r9iazv/i_tried_vibe_coding_a_full_saas_with_claude_n8n/",
      "domain": "self.n8n",
      "is_self": true,
      "comments": [
        {
          "id": "o6ckc5v",
          "author": "AutoModerator",
          "text": "**Video posts must include the workflow code.** The link to the code MUST be in the reddit post, if it is not in the reddit post itself, your post will be removed.\n\n**Acceptable ways to share the code:**\n\n* Github Repository\n* Github Gist\n* Directly here on Reddit in a code block\n* n8n.io/workflows/\n\nSharing the code any other way is not allowed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 01:49:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ckc4f",
          "author": "AutoModerator",
          "text": "**Attention Posters:**  \n- Please follow our subreddit's rules: \n- You have selected a post flair of Workflow - Code Included\n- The json or any other relevant code MUST BE SHARED or your post will be removed.\n- Acceptable ways to share the code are:\n   - Github Repository\n   - Github Gist\n   - n8n.io/workflows/\n   - Directly here on Reddit in a code block\n- Sharing the code any other way is not allowed.  \n\n- Your post will be removed if not following these guidelines.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/n8n) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-20 01:49:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d9uuo",
          "author": "DumplingDarling_1",
          "text": "It’s wild how smoothly AI + n8n can glue a whole SaaS together, makes building way less painful than I expected.",
          "score": 1,
          "created_utc": "2026-02-20 04:33:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6da7ug",
          "author": "Elhadidi",
          "text": " I used AI + n8n to spin up a WhatsApp AI agent in about 10 mins—AI wrote most of the logic and n8n glued it together. Might be a neat real-world example: [https://youtu.be/J08qIsBXs9k](https://youtu.be/J08qIsBXs9k)",
          "score": 1,
          "created_utc": "2026-02-20 04:36:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}