{
  "metadata": {
    "last_updated": "2026-02-22 02:59:49",
    "time_filter": "week",
    "subreddit": "notebooklm",
    "total_items": 20,
    "total_comments": 252,
    "file_size_bytes": 243059
  },
  "items": [
    {
      "id": "1r6ndqd",
      "title": "Why most people don't use NotebookLM for studying.",
      "subreddit": "notebooklm",
      "url": "https://i.redd.it/lc7otxslixjg1.jpeg",
      "author": "OkEstimate5431",
      "created_utc": "2026-02-16 22:00:49",
      "score": 388,
      "num_comments": 51,
      "upvote_ratio": 0.9,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r6ndqd/why_most_people_dont_use_notebooklm_for_studying/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o5ugttm",
          "author": "MyDogNewt",
          "text": "The prompts are only as good as the prompter AND the sources uploaded.   \n  \nI graduate law school this May at 55 years old. I didn't even get my undergrad until I was 50 - mainly because I'm not an academically minded person. My undergrad transcript covers 1988 to 2020, because I hate school, wasn't good at it, and my ADHD just wouldn't allow it. Fastforward to now, and Adderall and AI have completely changed my reality. \n\nIf not for AI (Chat and NoteBookLM) I would never have been able to do law school, at this or any age. NotebookLM was my tutor this entire time. But, I took the time to learn how to properly source and prompt. \n\nI've been able to \"teach\" AI ow I best learn - the 80/20 rule: Concentrate on the 20% of the materials that contains 80% of the relevant information. I've maintained Dean's Honor Roll, worked full time and maintained my family and the small acreage I live on. NoteBookLM was a lifesaver for time management when it came to studying.\n\n,",
          "score": 14,
          "created_utc": "2026-02-17 10:56:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xhlf7",
              "author": "Ok-Association_",
              "text": "Curious to what aspect you used on notebook? Podcast, flashcards?",
              "score": 1,
              "created_utc": "2026-02-17 20:39:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o61p4fd",
                  "author": "MyDogNewt",
                  "text": "Depends on the subject and how confused I am. I utilize virtually all of the offerings, just not all for each subject. My favorites are the podcast feature and decks.",
                  "score": 5,
                  "created_utc": "2026-02-18 13:08:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5rhep5",
          "author": "Pasid3nd3",
          "text": "This is absolute hogwash. Prompts won't turn you into a professor, or professional. Stop the slop.",
          "score": 134,
          "created_utc": "2026-02-16 22:16:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ritx4",
              "author": "AffectionateTwo658",
              "text": "Probably had the prompts generated with AI too.",
              "score": 58,
              "created_utc": "2026-02-16 22:23:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5uhlvk",
              "author": "R4D000",
              "text": "Giving the AI a specific role to play is very effective, as that’s exactly what they do. It’s better to set a specific role instead of letting it guess.",
              "score": 5,
              "created_utc": "2026-02-17 11:03:22",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5rkdj0",
              "author": "[deleted]",
              "text": "[deleted]",
              "score": 5,
              "created_utc": "2026-02-16 22:31:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5rvvac",
                  "author": "Pasid3nd3",
                  "text": "No. These are the people who are destroying promising tools by turning them into hyped sh*t. No one needs this.",
                  "score": 0,
                  "created_utc": "2026-02-16 23:34:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5rmj18",
          "author": "PiterLeon",
          "text": "It makes a lot of mistakes, it takes time to use it and it’s not confortable for me to use",
          "score": 43,
          "created_utc": "2026-02-16 22:42:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5roazq",
              "author": "AffectionateTwo658",
              "text": "I only use it to review things I've written, that way I know if I made a mistake or the AI did.  Its a good tool for cleaning up notes and instructions, not good at creating them or being a professor.  I feel its best used as a review tool, the only one who can teach you something is you.",
              "score": 17,
              "created_utc": "2026-02-16 22:52:13",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5ronpx",
              "author": "Saschoe",
              "text": "interesting. what do you use it for? i am studying Economics / comp-sci and i have to say it works amazing. our profs are providing the slides, exercises and sometimes their 800 page books and it works amazing. it gives me the perfect overview for every topic, creates exams for me. its literally so good",
              "score": 14,
              "created_utc": "2026-02-16 22:54:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5rvown",
                  "author": "AffectionateTwo658",
                  "text": "I write tabletop games, I have the AI teach me to play it.  If I've made a mistake or made something too complex, the ai is pretty good at catching it.  I don't generate rules or content with the ai, but as a reviewer, it works well.",
                  "score": 2,
                  "created_utc": "2026-02-16 23:33:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5rrbfp",
              "author": "Striking-Warning9533",
              "text": "The audio overview seems fine for me with not too many mistakes ",
              "score": 2,
              "created_utc": "2026-02-16 23:08:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5w90qn",
          "author": "BYRN777",
          "text": "Most people do not use NotebookLM for three reasons:\n\n\n\n1. They do not know it exists and how it works \n\n2. It has a bit of a learning curve. It is not hard to learn, but compared to ChatGPT, Gemini, or Perplexity, it can feel overwhelming at first because a lot is going on on the page.\n\n\n3. It takes some manual work to set it up properly for studying (such as adding your sources) \n\nHere is exactly how I use it as a university student\n\nFirst off, I would like to say that you don't need any crazy or specific prompting for Notebooklm, because it will not affect it much. Here's why prompting could matter in Gemini and ChatGPT, but not in Claude and Grok; however, for a tool like Notebooklm, I'm not saying it is entirely useless. No matter how much you prompt it, the response will not change drastically in quality. This is precisely because the model runs on Gemini 3 Flash, which is not a reasoning model, and Notebooklm is mostly a tool for studying, learning, assessing, and filtering large amounts of data.\n\nFor instance, if you use a very specific prompt in Gemini GEMS, you will get very different responses, and in Notebooklm, this is hardly the case. Again, precisely because of the Gemini 3 Flash model. In Gemini GEMS, you can use Gemini 3 Thinking, Gemini 3 Pro or even Deep Think if you have Ultra...\n\nThe only reason Notebooklm has a chatbot is to ask simple questions. I'm not saying prompting doesn't help with a NotebookLM; however, it's not necessary per se. The only place where a nice prompt will be needed is when you create the notebook's custom instructions. That will change how you get responses, but within the chatbot itself, it doesn't change much. \n\n\nWhat is Notebooklm great for?\n- studying\n- learning\n- breaking down complex topics or larger topics\n- taking notes\n- filtering sources and information, etc.\n\nMy point is you don't need to prompt it; essentially, you can talk to it normally.\n\nHere is how I use it: \n\nI make one notebook per class. The first thing I do is upload the syllabus. I usually upload it as a PDF or a DOCX, but I like keeping almost all course material as PDFs when possible, especially readings, the syllabus, and lecture slides. Then I keep everything else as text or DOCX.\n\nRight after I upload the syllabus, I create a mind map on the right side in the studio. That gives me a quick visual overview of the entire course without having to read every line of a five- to fifteen-page syllabus. It helps me see weekly topics, assignment due dates, exam info, professor contact details, the course description, and the important course logistics, all in one place.\n\nNext, I name the notebook and write a custom prompt. This is a big part of why I like it. The custom prompt is much larger than most tools'. I think it is around 5,000 to 10,000 characters, and it gives you way more room than most alternatives. ChatGPT Projects is limited to about 1,500 characters, and Perplexity Spaces is about 1,000, so you cannot feed much instruction or structure into either.\n\nThe other major advantage is the context window. NotebookLM has a 1-million-token context window and runs on Gemini Flash. It is not a reasoning model, but for what NotebookLM is built for, it works extremely well.\n\nAfter that, I upload weekly content, either from the start of the semester or in a batch before a midterm or a major assignment. Each week, I upload the lecture slides, the weekly readings, my notes, and my lecture transcriptions. For lecture transcriptions specifically, I upload them as text files. I usually do one lecture per file, labelled by week, so it stays clean and easy to navigate.\n\nA quick note on slides: if you convert a Microsoft PowerPoint into Google Slides, it can mess up formatting and text. In my experience, using PDFs for slides is often safer. If you do use Google Workspace files like Google Docs or Google Slides, it is even better for one reason: if you edit the Google Doc or Google Slides outside of NotebookLM, it automatically syncs and updates in NotebookLM, so you do not need to re-upload anything.\n\nFor readings, accuracy matters a lot. If a reading is more than about twenty to thirty pages, I often do not upload it as one file. I break it into smaller chunks. Chapters are usually forty to fifty pages, which is still okay, but if something is massive, I use Acrobat Pro to extract just the pages I need and upload chapter by chapter. My rule is simple: avoid uploading PDFs over 100 pages as a single file. Smaller files tend to be noticeably more accurate and less prone to errors.\n\nFrom most accurate to least accurate, this is how I think file formats rank for any AI tool, including NotebookLM, ChatGPT, Gemini, and others: text, rich text or Markdown, DOC or DOCX, PDF, JPEG or PNG, audio files, and then video files. If I have something very large that I cannot easily split as a PDF, I try to convert it into DOCX or plain text. For long transcriptions, text works extremely well because it is raw text. Even DOCX is not truly raw text, and PDFs are usually the worst for accuracy.\n\nFor lecture recordings, I use my phone or laptop. macOS and iOS can transcribe using Voice Memos. I also use tools like Notta and Otter AI. Notta has been close to ninety-nine percent accurate for me so far. It can record Zoom, Google Meet, and Microsoft Teams meetings, and it lets you export transcripts in a wide range of formats, including text, PDF, DOC, RTF, Markdown, and DOCX.",
          "score": 8,
          "created_utc": "2026-02-17 17:10:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wysq1",
              "author": "BYRN777",
              "text": "\n\nI label everything consistently so it looks clean in the NotebookLM sources list and in Finder folders. For example, I use Week 1 slides, Week 1 readings, Week 1 notes, and Week 1 transcript. It sounds basic, but when you are managing an entire semester, it makes it way easier to study fast.\n\n\n\nIf a midterm covers Weeks 1 through 6, I select every source for those weeks, including slides, readings, notes, and transcripts. Then I generate study notes with a custom instruction like: follow the chronology of the lecture slides, and for each topic on the slides, use my notes and the lecture transcription to expand with deeper explanation, examples, and discussion. This gives me a structured set of notes that tracks exactly how the course was taught.\n\n\n\nI also generate an audio review set and set it to a long duration with a deep dive style. These audio reviews are basically AI podcasts. They are realistic, thorough, and in my experience extremely accurate. They have even picked up jokes my professor made during lecture, which shocked me. The long audio reviews usually run about 25 to 40 minutes. Sometimes they go past forty, but once it is over, about thirty-five minutes, my attention drops. My routine before a midterm is simple: listen to those audio reviews while skimming the lecture slides. That alone covers most of what I need.\n\n\n\nIf I have a question about something from two or three weeks ago, I just ask the NotebookLM chat. Since it only has access to the sources I uploaded, it is more grounded. It is basically a sandbo, x, and it does not pull from the wey om unrelated chat history automatically, as many other tools do, so it is less likely to make things up.\n\n\n\nFor research papers, I usually make a separate notebook, not the same one as the class notebook. Then I upload the assignment instructions and requirements, my research sources (e.g., scholarly articles), and any notes or drafts I am working on. Then I use it to filter sources fast. I ask things like which articles are most relevant and why, which ones are weakest and why, and which sources do not fit a specific sub-argument. If you are dealing with dozens of sources, or something extreme like eighty academic sources, each being twenty-five to sixty pages, you realistically cannot read everything deeply right away. This is a fast way to triage and narrow down what is worth your time.",
              "score": 3,
              "created_utc": "2026-02-17 19:10:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5tww2q",
          "author": "parastie",
          "text": "I did use notebook LM to study. I used it to help study for an international exam. I was able to feed it guidelines and review my knowledge against the resources. It was also able to generate questions for me to practice. Found it very helpful.",
          "score": 5,
          "created_utc": "2026-02-17 07:49:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5roehi",
          "author": "MainBuddy604",
          "text": "This doesn't work that well. It makes assumptions and is often wrong.",
          "score": 17,
          "created_utc": "2026-02-16 22:52:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s1fb3",
          "author": "luxeandlight",
          "text": "I like these prompts and will try them out. Notebook is a great tool for studying if you’re feeding it the right sources. If you only focus on the texts from your profs, you can study by creating podcasts or notecards to quiz yourself.",
          "score": 10,
          "created_utc": "2026-02-17 00:05:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u8446",
          "author": "Outrageous_Row_5547",
          "text": "NotebookLM chat response format needs to be improved.Gemini formatting and explanation is far superior",
          "score": 3,
          "created_utc": "2026-02-17 09:36:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5w6ssk",
              "author": "Msagano",
              "text": "You can link NotebookLM to your Gemini chat. Don’t know if it’s pro only.",
              "score": 2,
              "created_utc": "2026-02-17 16:59:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5xoslk",
                  "author": "ShayzerPlay",
                  "text": "How please?",
                  "score": 1,
                  "created_utc": "2026-02-17 21:13:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5tdvye",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 6,
          "created_utc": "2026-02-17 05:08:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5y4nd3",
              "author": "TheBunnyPlay",
              "text": "Love the idea",
              "score": 1,
              "created_utc": "2026-02-17 22:29:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6by3qd",
          "author": "christianJarrah",
          "text": "I'm currently using it for my research, I'm researching the FMI and BM influence in the educational policies in Colombia. then got all the credit memorandums, intention letters and so on and started asking questions about which documents intersect into my research area. it helped me filtering 7 documents from a pile of +30 \n\nit is useful to get oriented, the idea was never to use a substitute of reading and knowing the documents. \n\nnevertheless, I think the outputs are kind of... meh, too innocent, too literal, that's why I use it as a guide, but I get deep into the documents. \n\nalso I think the tools it has, as podcast and so on are just generic blob, they are vague, imprecise and just useful for big ideas. \n\nfor chat experience is way better to use a normal llm, nevertheless, for filtering or getting text into contrast it is useful, st least for general ideas. \n\n\naaaalso it is good for getting details, in my case, into the intention letters for the FMI, I used it to check if I had all the information, and dropped some quotes that I had missed. \n\nit has some uses, bit needs a lot of improvement",
          "score": 2,
          "created_utc": "2026-02-19 23:36:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dbajl",
          "author": "Previous_Bed9177",
          "text": "I am now advertising notebookLM with some extensions to my professors. They are loving the usecases that you can achieve with nblm.",
          "score": 2,
          "created_utc": "2026-02-20 04:43:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6de17y",
              "author": "throwaway37559381",
              "text": "What’s your favorite use? 🤓",
              "score": 1,
              "created_utc": "2026-02-20 05:04:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6dee7a",
                  "author": "Previous_Bed9177",
                  "text": "So my professor has created a public notebook for the course where he uploads all his materials and generated artifacts to help us study. \n\nUsing the kortex extension (i think so) he has shared us the prompts specifically for that course to get most out of it. \n\nBasically he is now not using the uni website for syllabus but rather notebooklm",
                  "score": 1,
                  "created_utc": "2026-02-20 05:07:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6foip7",
          "author": "amadeola",
          "text": "Alguien que estudie matemáticas con NotebookLM?",
          "score": 2,
          "created_utc": "2026-02-20 15:20:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5rxtel",
          "author": "thequarrymen58",
          "text": "It can't think for myself",
          "score": 4,
          "created_utc": "2026-02-16 23:45:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ttrnp",
          "author": "No-Blueberry-9762",
          "text": "I don't use NotebookLM because I am stupid and I feel even more stupid by not putting any effort in understanding a topic",
          "score": 1,
          "created_utc": "2026-02-17 07:20:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5soplf",
          "author": "hlaos",
          "text": "I prefer to use Gemini Pro 3 Preview in IA Studio with system instructions.",
          "score": 1,
          "created_utc": "2026-02-17 02:23:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u848p",
          "author": "ravinphoto",
          "text": "This is how you end up mugging up for an exam, not studying.",
          "score": 1,
          "created_utc": "2026-02-17 09:36:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ulevx",
          "author": "wileyfox91",
          "text": "Because it is not reliable. \nI tried , but if I need to cross check every page and find essential mistakes it doesn't make sense to use it .(Used scientific literature and books for specific topics )",
          "score": 1,
          "created_utc": "2026-02-17 11:35:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5uobg8",
              "author": "Phobos_s",
              "text": "What exactly were the mistakes? And when did you use NotebookLM?",
              "score": 1,
              "created_utc": "2026-02-17 11:58:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vi9wb",
          "author": "Inderajith",
          "text": "Going through the comments, I understood one thing.\n\nIt Hallucinates moreeee, thats it.",
          "score": 1,
          "created_utc": "2026-02-17 14:56:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wd5bw",
          "author": "mrchacalito",
          "text": "I don't really understand it, that's all.",
          "score": 1,
          "created_utc": "2026-02-17 17:30:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xyymw",
          "author": "Own_Ad4543",
          "text": "Notebook LM is only clutch for podcasts. And it def saves time. Upload the powerpoint and listen to the podcast while youre doing smt else like showering or the dishes and then once ur done and u rly start going into the material its gonna be so much easier to understand. But i rly only use it for the podcasts so at least i feel productive while im not studying cus time is money.",
          "score": 1,
          "created_utc": "2026-02-17 22:00:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xzn0c",
          "author": "gabrieljrdm",
          "text": "That they continue not using it.",
          "score": 1,
          "created_utc": "2026-02-17 22:04:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5yhghv",
          "author": "wolfdeathkill",
          "text": "Shoot  I do all the time",
          "score": 1,
          "created_utc": "2026-02-17 23:37:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zsvub",
          "author": "mat8675",
          "text": "I can only put like 500 words into the prompt on the mobile app….that’s why I never use it.",
          "score": 1,
          "created_utc": "2026-02-18 04:00:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60ueb3",
          "author": "sinkingtuba",
          "text": "Here are the specific, high-yield prompts from that list, ranked strictly by **efficiency** (ROI on your time). These cut out the generic \"summarization\" fluff and force the model to actually add value to your raw materials.\n\n**The above prompts written by our good friend have been modified.**\n\n# 1. The \"Blind Spot\" Detector (Modified from Prompt #1)\n\n**Why it's #1:** This utilizes the LLM's broad training data to audit your specific, limited data. It tells you what you *don't* know, which is the most dangerous part of studying.\n\n>\n\n# 2. The \"Active Recall\" Engine (Modified from Prompt #5)\n\n**Why it's #2:** Passive reading is useless. This forces you to retrieve information, which is the only way to actually encode memory.\n\n>\n\n# 3. The \"Anti-Illusion\" Check (Modified from Prompt #1 & #3)\n\n**Why it's #3:** Students often feel like they understand a topic when they actually just recognize the keywords. This prompt exposes shallow understanding.\n\n>\n\n# 4. The \"Feynman\" Protocol (Modified from Prompt #4)\n\n**Why it's #4:** If you can't explain it simply, you don't understand it. This forces the LLM to translate jargon into logic.\n\n>\n\n# 5. The \"Synthesizer\" (Modified from Prompt #2)\n\n**Why it's #5:** Good for connecting isolated lectures into a coherent whole.\n\n>\"Show me the **Concept Hierarchy**. Create a visual outline showing how the main topic breaks down into sub-topics, and specifically note the logical relationship between them (e.g., 'A causes B', 'X is a type of Y').\"\n\n  \nYou're welcome. ",
          "score": 1,
          "created_utc": "2026-02-18 09:05:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o61eegj",
          "author": "SerenityScott",
          "text": "It's not like that at all. It hallucinates and gets things wrong all the time. If you use it to try to generate content based on stuff you're an expert in (like stuff you wrote yourself), you'll see it immediately.  If you use it to learn (hence stuff you're not an expert in), you'll learn some things incorrectly but won't be able to identify them, because you won't be able to pick out the hallucinations. I find Notebook LLM useful for unimportant entertainment, like generating podcast discussions of my DnD group's party log for the players' amusement. I wouldn't use it for anything serious.",
          "score": 1,
          "created_utc": "2026-02-18 11:58:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o61k782",
          "author": "sttanko",
          "text": "I tried kampster found it more easier, no need to prompt anything, upload my docs and it turns it into learning path, answers are grounded to docs only so useful",
          "score": 1,
          "created_utc": "2026-02-18 12:38:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64nrun",
          "author": "AugustusCracovicus",
          "text": "I used it to process dozens of books for my thesis. But AI is useless if you want to acquire real, long-lasting knowledge, it is better to avoid using it.",
          "score": 1,
          "created_utc": "2026-02-18 21:29:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o697bgy",
          "author": "Loud_Talk8338",
          "text": "They are,,, they are just not telling you \n\n",
          "score": 1,
          "created_utc": "2026-02-19 15:29:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6arx8p",
          "author": "Psychological_Owl_23",
          "text": "I do use it all the time. Just in small batches.",
          "score": 1,
          "created_utc": "2026-02-19 20:00:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5t04si",
          "author": "MammothFlamingo9760",
          "text": "What is it ? And how to use it ?",
          "score": 1,
          "created_utc": "2026-02-17 03:33:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tf3bp",
              "author": "Kiingsora83",
              "text": "Imagine having an interactive database on any topic where you could create all sorts of different media for free, like explainer videos, PowerPoint presentations, audio summaries, infographics, and much more.\n\nBasically, you provide your super-cool documents, and you can interact with them or create things from them to learn about the topic and much more.",
              "score": 1,
              "created_utc": "2026-02-17 05:17:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5tlx2q",
          "author": "shanz13",
          "text": "I dont like it. I prefer just use normal gemini to study",
          "score": 1,
          "created_utc": "2026-02-17 06:11:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sz0et",
          "author": "Ok-Duck-7252",
          "text": "\nThanks for sharing .Could you clarify which section of NotebookLM is meant for adding these prompts?",
          "score": 0,
          "created_utc": "2026-02-17 03:26:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7lv0a",
      "title": "Finally you can actually edit slides without redoing the whole deck",
      "subreddit": "notebooklm",
      "url": "https://i.redd.it/ob2ywbgry4kg1.jpeg",
      "author": "Mike_newton",
      "created_utc": "2026-02-17 23:03:51",
      "score": 339,
      "num_comments": 57,
      "upvote_ratio": 0.99,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r7lv0a/finally_you_can_actually_edit_slides_without/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o5yhf9b",
          "author": "Key_Statistician6405",
          "text": "Weird they would integrate PowerPoint before Google slides.",
          "score": 28,
          "created_utc": "2026-02-17 23:37:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5yhrup",
              "author": "Mike_newton",
              "text": "Makes sense business wise though. Way more people use powerpoint.",
              "score": 13,
              "created_utc": "2026-02-17 23:39:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5yxljn",
                  "author": "Hotchi_Motchi",
                  "text": "But NotebookLM and Google Slides are both Google products, so they should be integrated from the get-go",
                  "score": 14,
                  "created_utc": "2026-02-18 01:06:58",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5ywae5",
                  "author": "hotdiggydog",
                  "text": "Yeah but that just means download the PPTX file and uploading it into Google slides manually. Seems like Google could just add the API to upload to Google Slides very easily.",
                  "score": 5,
                  "created_utc": "2026-02-18 00:59:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ycx42",
          "author": "RobinZander1",
          "text": "I'm a free user and I was able to download slide deck as a. PPT today.  I had no idea when it became an option. \nMaybe just ironically that I tried it today. \n\nI yesterday from about a month ago on YouTube that was extremely helpful of how to download and save it as a PDF and then edit stuff in Canva.  So I was surprised today when I was able to directly download it as a .PPT.",
          "score": 17,
          "created_utc": "2026-02-17 23:12:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5yd66x",
              "author": "Mike_newton",
              "text": "lol you picked the perfect day to try it. it just launched today. that whole pdf to canva workflow is officially retired",
              "score": 11,
              "created_utc": "2026-02-17 23:13:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5yj5xa",
                  "author": "blessedeveryday24",
                  "text": "Why PDF and not image by image for Canva? Just wondering !",
                  "score": 3,
                  "created_utc": "2026-02-17 23:47:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5ydv78",
                  "author": "Hammyrock4395",
                  "text": "I still dont see a PPT option??? When did that happen? I created some powerpoints today and I only see pdf option. And I am a pro user. ",
                  "score": 2,
                  "created_utc": "2026-02-17 23:17:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6dqxo2",
              "author": "Scary-Elevator5290",
              "text": "I don’t see that option yet.",
              "score": 1,
              "created_utc": "2026-02-20 06:52:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5yiji5",
          "author": "blessedeveryday24",
          "text": "Google Slides will be OP. I wonder how they'll do this, considering that I would think it would require a serious overhaul or modification to how the current slides generation works since they are image-generated and not vector- or element-based (unless I'm mistaken)",
          "score": 6,
          "created_utc": "2026-02-17 23:43:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5yj9gf",
              "author": "Mike_newton",
              "text": "yeah the revision part makes sense to me. you prompt a change and it just regenerates that one slide. but the pptx export is what I don't get. if the slides are images how are they converting that into an actual editable pptx? or is it just images dropped into powerpoint slides? because that's not really pptx support lol",
              "score": 3,
              "created_utc": "2026-02-17 23:47:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5yjv2p",
                  "author": "blessedeveryday24",
                  "text": "That I fully agree with you can go without saying, but the last part of what you said is so freaking true and important! When I wrote my comment I thought of it and just shrugged it off like \"yeah, there's no way they'd do that...\", which I still kind of agree with (since it would probably piss quite a few people off), but seeing it written by someone else made me rethink the probability... Damn I hope not",
                  "score": 2,
                  "created_utc": "2026-02-17 23:51:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5yqpjx",
              "author": "Automatic-Example754",
              "text": "Based on another post it's just a flat image for each slide. Probably because you're right, slide generation would have to be radically overhauled to actually get editable slides.",
              "score": 2,
              "created_utc": "2026-02-18 00:29:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5yjp1r",
          "author": "Mike_newton",
          "text": "I've been building pptx export into my extension for weeks and they just drop it natively. pain. at least I can focus on other stuff now",
          "score": 3,
          "created_utc": "2026-02-17 23:50:16",
          "is_submitter": true,
          "replies": [
            {
              "id": "o67m77n",
              "author": "glonkymf",
              "text": "Curious, does your extension create slides with editable components? The native version is just single image slides, no different to a screenshot",
              "score": 1,
              "created_utc": "2026-02-19 08:45:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o624x7u",
          "author": "AiDaring",
          "text": "So I use NotebookLM pretty heavily for making presentations and the regenerate-the-whole-deck-to-fix-one-slide problem has been driving me insane for months.\n\nSaw the update dropped yesterday and wanted to share what I found after digging into it.\n\nThe good stuff is real - you can actually tell it \"fix slide 3\" and it only touches slide 3. You can stack a bunch of changes before you regenerate, which is nice. And PPTX export finally works.\n\nBut there are a few things I wish someone had told me before I got too hyped:\n\nThe big one: when you edit an individual slide, it does NOT reference your original sources. It's working only with what's already on that slide. Google actually says this in their own docs - \"sources are not taken into account during revisions.\" So if you're expecting it to pull fresh citations from your uploaded materials when you ask for a revision, it won't.\n\nAlso - can't add or remove slides yet. You can change the text, rearrange the layout, update visuals, but the number of slides is locked. Worth knowing upfront.\n\nDaily limit on regenerations exists but Google hasn't said exactly how many. People in this sub are reporting hitting it somewhere between 10-20 decks a day.\n\nOh and it's PRO and ULTRA only right now. Free tier is coming \"soon\" with no actual date. And if you're paid but still don't see it - still rolling out, I'm Pro and mine isn't live yet either.\n\nGoogle Slides export is announced but not there yet.\n\nOverall: genuinely useful update, not vaporware. The workflow does change in a real way. Just don't go rebuilding your whole process around it without understanding the source limitation thing first.\n\nAnyone else already have it live? Curious if the experience matches this.",
          "score": 4,
          "created_utc": "2026-02-18 14:33:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60l4zm",
          "author": "raff_lab",
          "text": "I'm a pro user but I can't find the possibility to modify a single page😭",
          "score": 3,
          "created_utc": "2026-02-18 07:39:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60ne67",
          "author": "Ok-Communication9888",
          "text": "Folks, sorry to break it you. This PPT export is basically one image per slide. Not much helpful if you want to make any changes.",
          "score": 3,
          "created_utc": "2026-02-18 07:59:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6172tg",
              "author": "scipio42",
              "text": "I just want to be able to edit text 😭",
              "score": 3,
              "created_utc": "2026-02-18 10:59:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o61ds2e",
                  "author": "damullens",
                  "text": "If you copy the slide and paste it into Gemini, you can edit the text. Not directly, but you can tell nano banana to replace the text that you don't want with text that you do. I've even told it to remove text I didn't want and then move the images over to fill up the empty space. It isn't the best solution, but it's working well enough for me to be useful.",
                  "score": 3,
                  "created_utc": "2026-02-18 11:53:31",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o66ub4j",
                  "author": "Ok-Communication9888",
                  "text": "You cant :( CodiaAI is the only solution.",
                  "score": 1,
                  "created_utc": "2026-02-19 04:49:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5yqrcb",
          "author": "Automatic-Example754",
          "text": "Hmmm they misspelled \"regenerating.\"",
          "score": 2,
          "created_utc": "2026-02-18 00:29:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5yugxs",
              "author": "Mike_newton",
              "text": "🤣🤣🤣",
              "score": 2,
              "created_utc": "2026-02-18 00:49:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5zuzgb",
          "author": "Remote-Obligation972",
          "text": "I hate the fact they only announce these things via a tweet on X.   So low effort....",
          "score": 2,
          "created_utc": "2026-02-18 04:13:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60gue3",
              "author": "Mike_newton",
              "text": "I feel they had this feature already and kept it away from public for a very long time",
              "score": 1,
              "created_utc": "2026-02-18 07:00:24",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o641luo",
              "author": "Tarun302",
              "text": "I really don't understand the point of this update if the slide is still an uneditable image. Unless the text and elements are editable it's as good as the earlier PDF output.",
              "score": 1,
              "created_utc": "2026-02-18 19:46:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o60q6w3",
          "author": "AreYouNuts",
          "text": "It seems to only work for new generations of Slides. None of my old slides has this feature sadly.",
          "score": 2,
          "created_utc": "2026-02-18 08:25:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60iry2",
          "author": "Fantastic_Turnip_976",
          "text": "tried it. the new “edit” feature is still basically prompt-based image regeneration.\n\nwhen you change something, it re-renders the whole slide as a new image. i tested a few edits and the layout/details shifted a lot, so it’s not precise element-level editing.\n\nif you just want quick tweaks, it’s fine. but if you need accurate control, it doesn’t really solve that.\n\nthat’s why i use codia ai noteslide — it converts notebooklm slides into real, fully editable ppt files. every text box and shape is actually editable in powerpoint, so you can adjust things precisely.",
          "score": 2,
          "created_utc": "2026-02-18 07:17:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60w6b4",
          "author": "Hey-yeH",
          "text": "I made [slidepatch.com](http://slidepatch.com/) that does exactly this. Users loved it and It was fun making the fix myself, but I expected this to happen.\n\nHowever, It has a batch edit feature, being able to add new slides (and remove), and to reorder slides, that NotebookLM hasn’t added yet, so perhaps this still has value (at least for now). I also have no rate limits since it's using the API.\n\nIf there are features NotebookLM  hasn’t implemented yet that you need, please let me know and I will try to build that feature instead of waiting for months for their official release",
          "score": 2,
          "created_utc": "2026-02-18 09:22:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o627zxo",
              "author": "MrHokieATL",
              "text": "LM moves the PDF file to PPT in full images, still not able to edit the images directly, so still need slidepatch.com.",
              "score": 1,
              "created_utc": "2026-02-18 14:49:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o67mjxy",
              "author": "glonkymf",
              "text": "Does your export have editable components in the ppt file or is it full image slides?",
              "score": 1,
              "created_utc": "2026-02-19 08:48:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o67qp71",
                  "author": "Hey-yeH",
                  "text": "Still full image slides. What you're talking about is the full PDF to PPT reconstruction. As those tools tend to not retain the original font, the AI Image editing approach is still the best-- which is what NotebookLM did eventually.",
                  "score": 1,
                  "created_utc": "2026-02-19 09:30:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5zcrrj",
          "author": "damullens",
          "text": "Cool. But I've been copying and pasting the slides I needed to change into Gemini and asking it to make my changes. Works pretty well most of the time.",
          "score": 1,
          "created_utc": "2026-02-18 02:25:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61jfej",
              "author": "Hey-yeH",
              "text": "This is what I do as well and built a tool that automates the whole workflow: slidepatch.com\n\nThere’s features like batch editing and being able to reorder slides, which I think Google doesn’t have yet, so this app still has value (at least for now) haha",
              "score": 1,
              "created_utc": "2026-02-18 12:33:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5zpwmm",
          "author": "AggravatingCounter84",
          "text": "A guy made so much effort recently to make a site to edit slides from notebookLM, Idk how he will compete now. I am counting my days too now. I am PRO and I still DONT HAVE IT TF",
          "score": 1,
          "created_utc": "2026-02-18 03:41:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60hibq",
              "author": "Mike_newton",
              "text": "It's very frustrating! I know eventually (don't know how long), NotebookLM features will wipe out about 80 percent of NotebookLM extensions. I was half way through creating something like that 🤦‍♂️",
              "score": 1,
              "created_utc": "2026-02-18 07:06:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o69w53t",
                  "author": "AggravatingCounter84",
                  "text": "gotta capitalize it till you can. Through my extension I received many more opportunities that I do not think I would have through my grad school. I have to thank notebookLM for that for creating so many gaps for us to fill in",
                  "score": 1,
                  "created_utc": "2026-02-19 17:29:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o60w0xw",
              "author": "Hey-yeH",
              "text": "That's me with [slidepatch.com](http://slidepatch.com) . Users love it so far, tho. And it helped me when I needed it.\n\nIt was fun while it lasted, but I definitely expected this, so doesn't hurt too bad",
              "score": 1,
              "created_utc": "2026-02-18 09:20:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o61jjt1",
                  "author": "Hey-yeH",
                  "text": "I added a batch editing feature tho, I don’t think NotebookLM has done that yet",
                  "score": 1,
                  "created_utc": "2026-02-18 12:33:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o62cglk",
          "author": "curious27",
          "text": "I do not see the download as powerpoint option on my pro account...",
          "score": 1,
          "created_utc": "2026-02-18 15:10:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o62p512",
              "author": "KhalifaAdam",
              "text": "Me neither ",
              "score": 2,
              "created_utc": "2026-02-18 16:09:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o63zo1d",
          "author": "Tarun302",
          "text": "Wow that's JUST AMAZING.....!!!",
          "score": 1,
          "created_utc": "2026-02-18 19:37:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63zwcz",
          "author": "Tarun302",
          "text": "As a Pro User HOW MANY slide decks can I make daily?\n\nWhat's the daily Limit?",
          "score": 1,
          "created_utc": "2026-02-18 19:38:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67jju0",
          "author": "Party-Amphibian-8394",
          "text": "Is adding new slides to already generated slides available ?? ",
          "score": 1,
          "created_utc": "2026-02-19 08:19:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dyeai",
          "author": "ai-expert-6391",
          "text": "waited so long for this esp ppt export",
          "score": 1,
          "created_utc": "2026-02-20 08:01:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6h6k24",
          "author": "Padac",
          "text": "Why is everyone here stoked? 😆 \nIt's just a static image slideshow pptx that can't be edited (unless you want to stretch/resize the inage)\n\n\nWait for a few more iterations before we have true pptx with editing capabilities ",
          "score": 1,
          "created_utc": "2026-02-20 19:29:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6owy3i",
          "author": "rygod42",
          "text": "How do even download the slides from the app on my iPhone",
          "score": 1,
          "created_utc": "2026-02-22 00:26:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9bxz1",
      "title": "How long has this been a thing in NotebookL??!",
      "subreddit": "notebooklm",
      "url": "https://i.redd.it/89hxc296rikg1.jpeg",
      "author": "Mike_newton",
      "created_utc": "2026-02-19 21:26:15",
      "score": 291,
      "num_comments": 13,
      "upvote_ratio": 0.99,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r9bxz1/how_long_has_this_been_a_thing_in_notebookl/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o6bq6yi",
          "author": "Fantastico2021",
          "text": "NotebookLM is also in the Gemini chat now.",
          "score": 27,
          "created_utc": "2026-02-19 22:51:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6c1xv5",
              "author": "AggravatingCounter84",
              "text": "Its really useless on there",
              "score": 11,
              "created_utc": "2026-02-19 23:59:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6f0rye",
                  "author": "Realplu",
                  "text": "I created a notebook with some screenshots but LM could not interpret them. I attached the notebook to a Gemini chat and it was able to interpret them.",
                  "score": 4,
                  "created_utc": "2026-02-20 13:16:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6buwaf",
              "author": "Mike_newton",
              "text": "I knew about this and even made a post about how unreliable it is to attach notebooks",
              "score": 4,
              "created_utc": "2026-02-19 23:17:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6c641r",
          "author": "Hawklord42",
          "text": "Didn't know, hadn't seen, asked it just that in chat and it fired off an infographic which is being prepared in studio.\n\n  \nMany thanks! 🙏 ",
          "score": 6,
          "created_utc": "2026-02-20 00:23:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cl1xk",
          "author": "bill-duncan",
          "text": "I just discovered it this week. I asked NBLM in the chat to optimize my prompt for a long Audio Overview. As it was responding in the chat with the optimized prompt, the Audio Overview generation kicked off in the studio. Then, I asked it to adapt the prompt for the one-presenter Video Overview Explainer Visual Style Anime. As it was responding in the chat with the adapted prompt, the Video Overview Explainer kicked off in the the studio. This approach seems to be more efficient than asking Gemini to optimize the prompt and attaching the NBLM notebook. NBLM is already grounded in the sources and kicking off the request in the studio pane saves clicks and time.",
          "score": 7,
          "created_utc": "2026-02-20 01:53:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jz3r7",
          "author": "jdvillao007",
          "text": "They have to update the android app. You can't create/see briefings in the android app, nor use youtube links of livestreams (that have already ended and have a full transcript...), but you can do both in the web version... \n\nAlso, since a couple of weeks in the mobile view in chrome, you can't add any youtube link as source because you can't scroll down so you have to use desktop view in your phone just to add youtube links as sources :/",
          "score": 1,
          "created_utc": "2026-02-21 05:11:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6db3ui",
          "author": "Low_Appearance_3704",
          "text": "Curious, what are the common use cases now with NotebookLM? ",
          "score": 1,
          "created_utc": "2026-02-20 04:42:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kl5ji",
              "author": "Jujulechaud",
              "text": "At my company, we have a space with all the minute meetings (AI generated too) of a huge digital transformation project (we are talking about millions of words and hours of workshops). People use it to find all type of information and details. It’s especially useful when you have to onboard a new person on the project as they can get to speed on what was going on up to this point and why certain decisions were taken. Otherwise we use it to explore legal frameworks and highlight key points, to prepare slides and infographics.",
              "score": 1,
              "created_utc": "2026-02-21 08:29:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r82xel",
      "title": "I uploaded 10 years of my journals to NotebookLM. What it told me was unsettling.",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1r82xel/i_uploaded_10_years_of_my_journals_to_notebooklm/",
      "author": "Fine_Doubt_4507",
      "created_utc": "2026-02-18 13:25:47",
      "score": 285,
      "num_comments": 67,
      "upvote_ratio": 0.92,
      "text": "For fun, I converted a decade of personal journals into PDFs and dumped them into a single notebook. Then I asked: *\"What are the recurring themes, fears, and blind spots in this person's life?\"*\n\nIt surfaced patterns my therapist took 6 months to find. In 3 minutes.\n\nMost striking finding: I used the word \"girlfriend\" 1,200+ times  almost always in a negative context. I had no idea. Lol\n\nNot sure if this is the most productive use of NotebookLM or the most unhinged. Maybe both.",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r82xel/i_uploaded_10_years_of_my_journals_to_notebooklm/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o61srd9",
          "author": "Beginning-Board-5414",
          "text": "It is productive use. Getting to know oneself is of huge importance to every person.",
          "score": 159,
          "created_utc": "2026-02-18 13:29:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61w0ye",
              "author": "Fine_Doubt_4507",
              "text": "Exactly  and honestly this felt more actionable than years of vague self nreflection. There's something different about *seeing the data* on yourself.",
              "score": 34,
              "created_utc": "2026-02-18 13:47:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o61zh56",
          "author": "Nowitcandie",
          "text": "Is nobody concerned about privacy or data security with regard to doing stuff like this? ",
          "score": 117,
          "created_utc": "2026-02-18 14:05:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o623gkn",
              "author": "aletheus_compendium",
              "text": "there hasn’t been anything akin to privacy for at least a decade if not more. it doesn’t exist. if someone wants info on you bad enough they will find it. privacy is an illusion in the modern digital age.",
              "score": 74,
              "created_utc": "2026-02-18 14:26:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6263wy",
                  "author": "Nowitcandie",
                  "text": "Privacy has become a harder problem - this is very different from just dumping all your personal data on a random cloud server lol. All and any of which can be parsed by Google, or requested by a third party authority. Requests which we have no reason to expect any kind of respect for reasonability criteria or law anymore in the current climate. ",
                  "score": 22,
                  "created_utc": "2026-02-18 14:39:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o65ofl3",
              "author": "Darryl_Summers",
              "text": "Google already knows everything about us",
              "score": 7,
              "created_utc": "2026-02-19 00:36:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o66vd85",
                  "author": "spittlbm",
                  "text": "Schmidt said so like 15 years ago as a way of trying to say we could trust them.",
                  "score": 2,
                  "created_utc": "2026-02-19 04:56:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o620tw5",
              "author": "Fine_Doubt_4507",
              "text": "I think we are the last generation to truly experience privacy.",
              "score": 46,
              "created_utc": "2026-02-18 14:12:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o63m02m",
                  "author": "Cheeseboi8210",
                  "text": "Well, there is always the option to not give 10 years of personal journals to a big tech company. That is one way to experience a bit more privacy",
                  "score": 25,
                  "created_utc": "2026-02-18 18:35:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o64hlqh",
              "author": "abel2121",
              "text": "Do you shop on Amazon? Then you're profiled.",
              "score": 5,
              "created_utc": "2026-02-18 21:01:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o63q2y9",
              "author": "cryptoopotamus",
              "text": "Nah Google has a great track record with this kind of stuff…",
              "score": 3,
              "created_utc": "2026-02-18 18:53:44",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o67cwfx",
              "author": "corydave",
              "text": "I don't believe NotebookLM trains on your data.",
              "score": 2,
              "created_utc": "2026-02-19 07:17:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o63nm0q",
              "author": "Minute_University",
              "text": "I'm glad I don't care about my privacy. Cause if I cared I would have reasons to care lol (if that makes sense)",
              "score": 2,
              "created_utc": "2026-02-18 18:42:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o64cf68",
                  "author": "Nowitcandie",
                  "text": "Cool story. Can you send over all your emails, notebooks, and personal notes, or just publish them publicly. Since you wouldn't be caring about some weird shit like privacy or security. Nothing to hide right. No vulnerabilities. Lol. \n\n\nIf it's not clear, I think what OP did is a really bad idea, not because of Google or NotebookLM specifically, but on principle. ",
                  "score": 6,
                  "created_utc": "2026-02-18 20:37:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o61uiw3",
          "author": "Purple-Breadfruit541",
          "text": "we got clickbait youtuber titles on reddit before gta 6",
          "score": 66,
          "created_utc": "2026-02-18 13:39:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61w8tx",
              "author": "Fine_Doubt_4507",
              "text": "lmaooo guilty as charged. but in my defense it actually happened, I just needed the title to match the existential dread 😭",
              "score": 0,
              "created_utc": "2026-02-18 13:48:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o63iwpv",
                  "author": "Altruistic_Ad_3764",
                  "text": "Gonna be honest. If this really happened, then i respect the clickbait YouTube title!",
                  "score": 0,
                  "created_utc": "2026-02-18 18:22:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o62m95i",
          "author": "Radiant-Rain2636",
          "text": "Jesus Christ! How did you come up with the headline? Ask ChatGPT to write it like Buzzfeed would?",
          "score": 28,
          "created_utc": "2026-02-18 15:56:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62xbay",
          "author": "toomuch_lavender",
          "text": "I've done this with song lyrics that I write. It's helped me understand ways my writing could be perceived and interpreted beyond my original intention, which has in turn helped me fine-tune my communication in general. It picked up themes that I was leaning into subconsciously which gives me a lot to unpack therapeutically.",
          "score": 11,
          "created_utc": "2026-02-18 16:46:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62ryiu",
          "author": "MissJoannaTooU",
          "text": "Anyone saying this is a major privacy issue better not be using Google Docs for anything but organising picknicks.",
          "score": 16,
          "created_utc": "2026-02-18 16:21:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fxmfr",
              "author": "ThisCardiologist001",
              "text": "Yeah. I don’t use it.",
              "score": 2,
              "created_utc": "2026-02-20 16:03:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6hh587",
                  "author": "MissJoannaTooU",
                  "text": "That's more than valid",
                  "score": 1,
                  "created_utc": "2026-02-20 20:20:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o62zdns",
          "author": "Traveltracks",
          "text": "Upload your WhatsApp or chat history with someone. That's an interesting way to use it aswell.",
          "score": 7,
          "created_utc": "2026-02-18 16:55:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o63eqtq",
              "author": "Tall-Emu-3186",
              "text": "# INGENIERÍA RELACIONAL: Manual Híbrido de Auditoría Forense y Defensa Sistémica==>  Neurociencia Aplicada para Detectar y Defenderte de Relaciones Tóxicas, buscarlo en Amazon",
              "score": -5,
              "created_utc": "2026-02-18 18:04:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o62r7iv",
          "author": "elwiseowl",
          "text": "I've done this too.  And its fun hearing a podcast about my life !    \nI have noticed when asking questions, it gets stuff wrong. ",
          "score": 7,
          "created_utc": "2026-02-18 16:18:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64m5jz",
          "author": "ButterflyEconomist",
          "text": "We’re all at the early adopter stage, so we are the ones who have to deal with all the moral hazards.\n\nThe good news is that there are also open source LLM that we can use. They still lag behind the commercial products, but the gap is narrowing.\n\nI’m working on that issue so that I can keep my personal stuff private, like in the old days when I had a computer but pre WWW.\n\nUsing AI like Claude or Gemini, etc., you can have it build your own version of a RAG, which is essentially what NLM is, but to your specifications.\n\nAt some point, you might not need commercial AI, but can run everything on your own.\n\nOur information has been exposed for some time. This won’t cure that, but maybe future users might benefit from the work we do to create something that stays private from the beginning.",
          "score": 7,
          "created_utc": "2026-02-18 21:22:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62ekhg",
          "author": "argosafe",
          "text": "What are the actual real documented dangers of uploading Keep notes to NBLM please?",
          "score": 5,
          "created_utc": "2026-02-18 15:20:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o62g8oj",
              "author": "Barycenter0",
              "text": "In what context are you asking? Privacy? Psychology?",
              "score": 3,
              "created_utc": "2026-02-18 15:28:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o62jxnh",
                  "author": "argosafe",
                  "text": "Privacy really.  Although it matters not what I've recorded, what are the real dangers here.  Exposure? Manipulation? And are there any cases of such I could review?",
                  "score": 3,
                  "created_utc": "2026-02-18 15:45:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o65nm7q",
          "author": "snwbrdwndsrf",
          "text": "Mind Map takes on a whole new meaning!",
          "score": 4,
          "created_utc": "2026-02-19 00:31:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65nx6e",
          "author": "Smells_Like_Science",
          "text": "From a security perspective, wouldn't it be better to have uploaded everything to a local model (LMStudio, AnythingLLM) or a privacy focused project like Lumo (Proton.me)? \n\nNotebookLM is a great tool for handling data that isn't personal health, financial or work data.",
          "score": 7,
          "created_utc": "2026-02-19 00:33:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o622atw",
          "author": "Significant_Card6486",
          "text": "I uploaded years worth of keep notes to NBLM and converted it into the podcast, and it's surreal listening to them braking down your ideas and thoughts.",
          "score": 7,
          "created_utc": "2026-02-18 14:20:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67y30g",
              "author": "Routine-Lime4153",
              "text": "How do you do this?",
              "score": 1,
              "created_utc": "2026-02-19 10:40:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o63yuu8",
          "author": "Typical-Fuel-4145",
          "text": "It seems like a productive use in general. Of course I doubt your therapist had the benefit or ability to retain all your journals. I’d say that having therapy to validate the findings is helpful too… But the key is does it help you move forward?",
          "score": 3,
          "created_utc": "2026-02-18 19:33:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65mivm",
          "author": "tanbirj",
          "text": "I have many years worth of diary entries with the Notes app of my IPhone. Any idea how I can extract them all in one go?",
          "score": 3,
          "created_utc": "2026-02-19 00:25:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62eoow",
          "author": "stiveooo",
          "text": "before AI i though writing a diary was useless, now AI would really help with that data.",
          "score": 7,
          "created_utc": "2026-02-18 15:21:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o637ud1",
              "author": "AnalLeakageChips",
              "text": "It really helps you emotionally to put your thoughts into words and they're fun to look back on years later",
              "score": 5,
              "created_utc": "2026-02-18 17:33:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o638mp0",
                  "author": "stiveooo",
                  "text": "Even having a journal for stocks investments help so you don't make the same mistakes. ",
                  "score": 1,
                  "created_utc": "2026-02-18 17:37:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o62mreq",
              "author": "happinessisachoice84",
              "text": "I've never written in a diary because I always knew not to write something down if I didn't want someone to know it. And I can't imagine anything I would journal that would be beneficial for me that I'd be okay with my partner or kids finding and reading, other than a gratitude journal. And I don't think that would give me much insight to myself.",
              "score": 5,
              "created_utc": "2026-02-18 15:58:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o63yy4e",
              "author": "ilovefacebook",
              "text": "I'm curious how grok would interpret ops journals.   (op don't do it)",
              "score": 1,
              "created_utc": "2026-02-18 19:34:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o62ut2p",
          "author": "HeHaa123",
          "text": "Best use of tech!!",
          "score": 4,
          "created_utc": "2026-02-18 16:34:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o61xab4",
          "author": "mikesimmi",
          "text": "I loaded in about 8 years of WhatsApp messages between me and my adult son. I asked it to write a story about him and I.  It was fun. Now, I don't know what else to ask! Lol",
          "score": 4,
          "created_utc": "2026-02-18 13:54:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61xv11",
              "author": "Fine_Doubt_4507",
              "text": "Upload the chats and ask it to make a movie trailer out of 8 years of messages",
              "score": 5,
              "created_utc": "2026-02-18 13:57:06",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o621ibk",
              "author": "Nowitcandie",
              "text": "Hope you asked your son permission to expose all his private data to a cloud company like that. ",
              "score": 5,
              "created_utc": "2026-02-18 14:16:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o622vhm",
                  "author": "mikesimmi",
                  "text": "He was aware. We aren't pearl clutchers. 😉",
                  "score": 0,
                  "created_utc": "2026-02-18 14:23:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o65y0q7",
          "author": "MindlessLie5120",
          "text": "Anybody here using NotebookLM for study, please give me some tips for using it effectively.",
          "score": 2,
          "created_utc": "2026-02-19 01:31:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6612qg",
          "author": "SkyLordOmega",
          "text": "Whatever gets you to analyse yourself.",
          "score": 2,
          "created_utc": "2026-02-19 01:49:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dazsp",
          "author": "Previous_Bed9177",
          "text": "I should do thiss too🤣 I wonder if it can recognise handwritten texts",
          "score": 1,
          "created_utc": "2026-02-20 04:41:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6exvzj",
          "author": "ecotones",
          "text": "I like when the podcast hosts poke fun at you or call you out for your attitudes. I'm frequently called \"cynical\".",
          "score": 1,
          "created_utc": "2026-02-20 12:59:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gyjz0",
          "author": "GraspingSonder",
          "text": "I did something similar and got the podcast to roast me.  It was quite a ride",
          "score": 1,
          "created_utc": "2026-02-20 18:51:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i85od",
          "author": "floatingsoul9",
          "text": "Were they handwritten journals? And if so how did you convert them into pdfs ? By taking pictures ?",
          "score": 1,
          "created_utc": "2026-02-20 22:36:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o61smte",
          "author": "edalgomezn",
          "text": "es un buen apoyo, pero complementalo con tu terapeuta",
          "score": 0,
          "created_utc": "2026-02-18 13:28:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61w6x8",
              "author": "Fine_Doubt_4507",
              "text": "Fair point, and I completely agree this was never meant to replace therapy. Think of it more like a mirror that shows patterns, not a diagnosis. The girlfriend finding actually gave me something concrete to *bring* to my next session.",
              "score": 3,
              "created_utc": "2026-02-18 13:48:15",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o61u4do",
              "author": "Sendogetit",
              "text": "This comment is true, but also sounds so dismissive",
              "score": 4,
              "created_utc": "2026-02-18 13:37:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o61ug5n",
                  "author": "edalgomezn",
                  "text": "despectivo? creo que es peligroso traspasar temas que estas tratando con un \"terapeuta\" a una IA, puede ser un complemento, pero en ningun caso un sustituto",
                  "score": 3,
                  "created_utc": "2026-02-18 13:38:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o64ioor",
          "author": "Odballl",
          "text": "So I'm experiencing a big dilemma about a possible move interstate with my wife. We've had a bunch of stuff going on and I decided to write out all into a doc to break down our issues and my conflicting thoughts about everything.\n\nI also uploaded a heap of psychology texts, philosophy books & articles about relationships to notebook. \n\nI even asked Gemini for some suggested texts based on my journal.\n\nThen I generated a podcast about my life using all these texts to examine my issues.\n\nI'll get some real counselling as well. This is kinda like prep work to examine my life and different ways of framing it.",
          "score": 1,
          "created_utc": "2026-02-18 21:06:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66bkf2",
          "author": "dieyoufool3",
          "text": "Holy AI “write me an engaging” title",
          "score": 0,
          "created_utc": "2026-02-19 02:49:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67ie56",
          "author": "BigOpenWorld",
          "text": "Done the same last year for 5 years of journaling. Showed me so much stuff about myself i refuse to accept that I couldn’t sleep for two days. Was cool to listen the podcast while doing my weekly cleaning though.",
          "score": 0,
          "created_utc": "2026-02-19 08:08:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8tsfs",
      "title": "I made fun of people who used NotebookLM for studying. Then I tried it before an exam.",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1r8tsfs/i_made_fun_of_people_who_used_notebooklm_for/",
      "author": "Fine_Doubt_4507",
      "created_utc": "2026-02-19 08:26:51",
      "score": 239,
      "num_comments": 36,
      "upvote_ratio": 0.94,
      "text": "I had 48 hours before a final. Uploaded 4 textbooks, 3 sets of lecture notes, and 12 research articles.\n\nAsked: *\"What are the 20 most likely exam questions based on these materials, and what are the complete answers?\"*\n\nGot a 23, with answers. Passed with the highest grade of my semester.\n\nI owe this subreddit an apology.",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r8tsfs/i_made_fun_of_people_who_used_notebooklm_for/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o6807l5",
          "author": "Revolutionary_Arm907",
          "text": "Why did you make fun of ppl who used notebook",
          "score": 39,
          "created_utc": "2026-02-19 10:59:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6817td",
              "author": "Fine_Doubt_4507",
              "text": "I thought those who want to be in academia shouldn't use AI.",
              "score": -39,
              "created_utc": "2026-02-19 11:08:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o681vfc",
                  "author": "Revolutionary_Arm907",
                  "text": "And because you did well you changed your mind? Or was it something else?",
                  "score": 22,
                  "created_utc": "2026-02-19 11:14:05",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6idht7",
                  "author": "Typical_Pretzel",
                  "text": "Why are so many people downvoting this comment? He said \"thought\". This was his past opinion that clearly changed, if anyone read the post",
                  "score": 3,
                  "created_utc": "2026-02-20 23:05:17",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6j8cs9",
                  "author": "PhotonicKitty",
                  "text": "No one should be downvoting you for this. Not because it isn't right (or whatever), but because you were just answering the question asked of you.\n\nYou were ignorant of NotebookLM's potential and have now changed your mind after some use.\n\nThis should have 40+ upvotes, because it's saying \"Hey, I was wrong. This is what I used to believe. It's not what I believe now.\"\n\nThat deserves positive reinforcement.",
                  "score": 1,
                  "created_utc": "2026-02-21 02:09:04",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o696vrz",
                  "author": "Ajota12",
                  "text": "Yeah, bad take in your side lol",
                  "score": 0,
                  "created_utc": "2026-02-19 15:27:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o68jcn4",
          "author": "norpuf0s",
          "text": "yes I wish I wasn't dogmatic about this in the past either. over time, notebooklm, socratic owl and notegpt . com have been so so helpful for my performance in school, and I didn't become dumber by using AI. at least that's what I think lol",
          "score": 19,
          "created_utc": "2026-02-19 13:19:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68tqgh",
          "author": "Z3R0gravitas",
          "text": "How did you put textbooks into the Notebook? Did you already have have them in PDF format or such?",
          "score": 9,
          "created_utc": "2026-02-19 14:18:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6adh1h",
              "author": "darnelles-r",
              "text": "Curious, as well.",
              "score": 3,
              "created_utc": "2026-02-19 18:50:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6dx7cy",
              "author": "EastReward8609",
              "text": "I found the PDF of various textbook I use. Piracy. Then separated them into different files so I was able to upload them. I used an online free service to separate a 1000 PG text book into 5 files of 200 pages.\n(Edit: corrected explanation)",
              "score": 3,
              "created_utc": "2026-02-20 07:50:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6kzi0k",
                  "author": "ResearcherBulky5401",
                  "text": "Anna’s Archive?",
                  "score": 2,
                  "created_utc": "2026-02-21 10:51:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6mm51g",
              "author": "Accurate_Office_951",
              "text": "cuando no esta en la web yo le tomo fotos a toda la etapa y lo convierto en pdf ",
              "score": 1,
              "created_utc": "2026-02-21 17:03:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6850cw",
          "author": "murmurousmouse",
          "text": "And when i did the same, none of the questions came on the exam lol",
          "score": 14,
          "created_utc": "2026-02-19 11:40:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68dkg6",
              "author": "antonbest44",
              "text": "Prompt issue",
              "score": 7,
              "created_utc": "2026-02-19 12:42:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6bnuvt",
                  "author": "Dependent_Suit1614",
                  "text": "What would be a prompt that would guarantee or increase the chances of the same questions? ",
                  "score": 5,
                  "created_utc": "2026-02-19 22:38:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o69y2w7",
          "author": "OutrageousAge9107",
          "text": "i mean. it's AI but it's not, because you're the one uploading your own notes and prompting it. so yes, i really like notebooklm because i'm using my own notes and i just quiz myself with it! i love notebooklm, hoping that we don't have to pay for any features soon.",
          "score": 7,
          "created_utc": "2026-02-19 17:38:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ah052",
          "author": "KobyStam",
          "text": "You should try it with my MCP 🔥 [https://github.com/jacob-bd/notebooklm-mcp-cli](https://github.com/jacob-bd/notebooklm-mcp-cli)",
          "score": 2,
          "created_utc": "2026-02-19 19:07:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l9n01",
              "author": "Junior_Cattle_5896",
              "text": "what is this?",
              "score": 1,
              "created_utc": "2026-02-21 12:22:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o68hadc",
          "author": "Zeus-12",
          "text": "Now tell us the prompt you used :) (god bless)",
          "score": 3,
          "created_utc": "2026-02-19 13:07:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6e48qx",
          "author": "stunning_man_007",
          "text": "Amazing. Really impressive. Never use it this way",
          "score": 1,
          "created_utc": "2026-02-20 08:56:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eityv",
          "author": "stunning_man_007",
          "text": "Any feature requirement? Try to add some features for NotebookLM",
          "score": 1,
          "created_utc": "2026-02-20 11:10:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fvfw6",
          "author": "EditOrElse",
          "text": "So, what class was this? Were there essay questions involved? And had you been studying all along? I've done some serious cramming myself, but you got impressive results. Are you confident that you learned the material? I'm trying this for sure.",
          "score": 1,
          "created_utc": "2026-02-20 15:53:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jxrnp",
          "author": "Ok_Succotash_3663",
          "text": "It is basic human tendency to make fun of or criticise things that we are unaware of. So, you don't have to feel guilty about that. But if you really want to make sure that you have some fun with this versatile tool.\n\nTry using its features for your educational purposes. You can use it for research, knowledge management, learning, or even self awareness. \n\nKeep exploring. \n\nKeep NoteBooking.",
          "score": 1,
          "created_utc": "2026-02-21 05:01:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6k4sq0",
          "author": "mkeee2015",
          "text": "What was your final mark as %, in that exam?",
          "score": 1,
          "created_utc": "2026-02-21 05:57:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kzsiu",
          "author": "ResearcherBulky5401",
          "text": "I use it to generate podcasts based on the session/class outline for the day. and listen to it on the train on my way in. In a scenario exercise in the class I was the only one of 36 students that answered correctly because the podcast covered a similar scenario and made it make sense.",
          "score": 1,
          "created_utc": "2026-02-21 10:54:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6m5vfb",
          "author": "ComedianFirst1798",
          "text": "I used to roast my roommate for using NotebookLM like, “wow, look at you outsourcing your brain.” Then the night before my stats exam, I was knee-deep in half-highlighted PDFs, running on cold brew and panic. Out of desperation, I tried it. Suddenly my chaotic notes actually made sense, and I wasn’t rereading the same paragraph for the fifth time. I still felt mildly betrayed by my own smugness. Anyone else ever eat their words right before an exam?",
          "score": 1,
          "created_utc": "2026-02-21 15:42:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6me6w1",
          "author": "ReputationMountain74",
          "text": "Congratulations! But I think your example is more about using it for passing exams. Meanwhile, Notebook is really good for studying, and by that I mean when you don't need to prepare yourself for any exams just want to understand the materials. I uploaded a textbook and asked for separate deepdive for every chapter and I think I got the main ideas of the book. It is not a replacement of old school reading in my opinion but a very very good addition!",
          "score": 1,
          "created_utc": "2026-02-21 16:24:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mh8jt",
          "author": "CowOk6572",
          "text": "Yeah, it’s one of my favorite tools, because mainly of the audio summary feature",
          "score": 1,
          "created_utc": "2026-02-21 16:39:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r98zos",
      "title": "Finally figured out how to manually edit notebookLM slides",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1r98zos/finally_figured_out_how_to_manually_edit/",
      "author": "ai-expert-6391",
      "created_utc": "2026-02-19 19:35:59",
      "score": 185,
      "num_comments": 28,
      "upvote_ratio": 0.93,
      "text": "Been using notebookLM for a few weeks now for sales decks and overall I'm pretty happy with it once you nail the prompt. But the editing situation has been driving me crazy.\n\nWhen they first dropped slides there was basically no editing at all, and the recent update helped but it's still fully AI-dependent - you're instructing changes slide by slide rather than just...making them. I wanted to be able to move things around, tweak text directly, adjust layout and test multiple changes without going back and forth with prompts.\n\nTried Canva's grab text feature for the image slides but honestly found it clunky for elements specifically.\n\nStumbled across a workaround today on reddit that actually solved it for me - uploaded the notebookLM PDF to a converter tool and it turned the image-based slides into fully editable ones. Meaning I could directly edit text, move elements, touch the layout - and I got to do all this without consuming credits so basically on their free tier. Exported to PowerPoint and the editability carried over too, which was the main thing I needed.\n\nhttps://preview.redd.it/e9nvpsdd7ikg1.png?width=1844&format=png&auto=webp&s=07652bc210506d791c10f88a15c19eb02133cac7\n\nSharing in case anyone else is looking to solve the same problem - [https://app.getalai.com/notebooklm](https://app.getalai.com/notebooklm)",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r98zos/finally_figured_out_how_to_manually_edit/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o6b82xe",
          "author": "Okumam",
          "text": "For someone who just “stumbled upon” this solution, your month old account seems to be pushing it quite aggressively across ai subs.",
          "score": 39,
          "created_utc": "2026-02-19 21:18:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6bat2e",
              "author": "ai-expert-6391",
              "text": "Hey, I’ve never spoken about this feature since I just came across it today, I’ve used the tool before but not for this \n\nI do use ai ppt tools extensively and have reviewed multiple tools in detail on Reddit but none of these are promotional as you can see in each post\n\nJust trying to build my voice in the space on Reddit with hopes to eventually start a community on ai software :)",
              "score": 2,
              "created_utc": "2026-02-19 21:32:10",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6bpv5m",
              "author": "23Scout",
              "text": "![gif](giphy|En8fsYde6cqvhYBnAb)\n\n",
              "score": 0,
              "created_utc": "2026-02-19 22:49:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6c8frf",
          "author": "angelarose210",
          "text": "Google just added the ability to edit slides",
          "score": 9,
          "created_utc": "2026-02-20 00:36:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6cbovm",
              "author": "No_Direction_7168",
              "text": "How?",
              "score": 1,
              "created_utc": "2026-02-20 00:56:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6cbzdv",
                  "author": "angelarose210",
                  "text": "https://www.reddit.com/r/notebooklm/s/7gLDSW2hHp",
                  "score": 2,
                  "created_utc": "2026-02-20 00:57:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6duyn7",
          "author": "Intelligent-Time-546",
          "text": "Soon you will not need that anymore. notebookLM has announced PowerPoint export, multi-step chat refactoring, and changing of your slide deck ",
          "score": 4,
          "created_utc": "2026-02-20 07:29:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dwt2a",
              "author": "ai-expert-6391",
              "text": "they've launched this but their editing is limited to ai based instructions",
              "score": 1,
              "created_utc": "2026-02-20 07:46:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6c1v21",
          "author": "Gold_Driver2447",
          "text": "is it free?",
          "score": 3,
          "created_utc": "2026-02-19 23:58:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dxki8",
              "author": "ai-expert-6391",
              "text": "the manual edits are free - but for non-branded export you need to take a sub",
              "score": 0,
              "created_utc": "2026-02-20 07:53:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6cc1ow",
          "author": "coeuss",
          "text": "So I tried this. It kind of works. It imports the presentation as images. Then it allows you to edit what it sees as text regions of images. The issue is it needs to regenerate the images with any text you’ve edited and it destroys the formatting when it does that. The first two slides I tried, it changed all the colors and did not keep the slide integrity.\n\nEditing via NotebookLM and regenerating the slide seems superior to the Alai solution. Neither are close to a full Google slides or PowerPoint export that is able to be edited.",
          "score": 3,
          "created_utc": "2026-02-20 00:58:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dxen9",
              "author": "ai-expert-6391",
              "text": "I did face issue with formatting, that is it broke text down as different element boxes but did not face issues with color\n\nI found NotebookLM editing to be great but it just seemed limiting especially for resizing elements - it felt difficult to give the exact prompt I need + if in case I want to just text a diff layout/text size etc its a whole process rather than just two clicks\n\n",
              "score": 1,
              "created_utc": "2026-02-20 07:52:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6ett6b",
                  "author": "coeuss",
                  "text": "I may not have had Alai process it correctly? I didn’t get the option to resize elements beyond text. I did the “Edit with AI” option. Is there another way? I imported the PDF through the NotebookLM import page on Alai’s site.",
                  "score": 1,
                  "created_utc": "2026-02-20 12:32:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ebfzc",
          "author": "Distinct_Narwhal6209",
          "text": "slide design is one thing but the real pain is sending these out and having zero clue if the prospect even looked at page 5. good workaround though, definitely saves a lot of time on the formatting side.",
          "score": 2,
          "created_utc": "2026-02-20 10:04:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ebo3y",
              "author": "ai-expert-6391",
              "text": "The tool does have tracking if you share the ppt as a link",
              "score": 1,
              "created_utc": "2026-02-20 10:06:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6bp7tt",
          "author": "quimera78",
          "text": "So you convert it to what format? ",
          "score": 1,
          "created_utc": "2026-02-19 22:45:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dxhg4",
              "author": "ai-expert-6391",
              "text": "it becomes an editable slide instead of a flat image",
              "score": 0,
              "created_utc": "2026-02-20 07:52:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6bqh78",
          "author": "Mediocre-Ad4064",
          "text": "Haven’t looked at the OP’s solution, but I found Adobe Express to be helpful for this. Not perfect, and not free, but better than any other workaround I’ve found so far.",
          "score": 1,
          "created_utc": "2026-02-19 22:52:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dxiy4",
              "author": "ai-expert-6391",
              "text": "haven't used adobe yet - will try and see if it's better",
              "score": 1,
              "created_utc": "2026-02-20 07:53:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6cz7hp",
          "author": "Da_chosen_one",
          "text": "Why don't you just use gemini to create the slideshow for you, then edit it in google slides?",
          "score": 1,
          "created_utc": "2026-02-20 03:21:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dxlrr",
              "author": "ai-expert-6391",
              "text": "I specifically use nano banana pro which gives image slides as output",
              "score": 1,
              "created_utc": "2026-02-20 07:53:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6e44ug",
          "author": "stunning_man_007",
          "text": "Not sure anyone tried StunSlide  for the edit? It is very useful for NotebookLM pdf edit",
          "score": 1,
          "created_utc": "2026-02-20 08:55:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ebll6",
              "author": "ai-expert-6391",
              "text": "Didn’t see this on search",
              "score": 1,
              "created_utc": "2026-02-20 10:05:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6eimp7",
                  "author": "stunning_man_007",
                  "text": "StunSlide.com",
                  "score": 1,
                  "created_utc": "2026-02-20 11:08:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r9b0s3",
      "title": "A guide to the new \"Revise\" feature for Slide Decks",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/gallery/1r9b0s3",
      "author": "Medium_Aspect_8784",
      "created_utc": "2026-02-19 20:51:29",
      "score": 102,
      "num_comments": 16,
      "upvote_ratio": 0.98,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r9b0s3/a_guide_to_the_new_revise_feature_for_slide_decks/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": [
        {
          "id": "o6c2q7y",
          "author": "Fantastico2021",
          "text": "A presentation begging to be animated!",
          "score": 11,
          "created_utc": "2026-02-20 00:03:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b8t83",
          "author": "RobinZander1",
          "text": "KUDOS.  WELL DONE!!   Thank you. Very creative looking and visually stunning.  Entertaining and funny actually.  Very impressive NLM skills.  I assume your prompts to make edits were pretty sophisticated. And likely followed the same process you are teaching here. \n\nIs this new edit feature available as of today? And is it for free accounts also?",
          "score": 5,
          "created_utc": "2026-02-19 21:22:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6bq0rm",
              "author": "Medium_Aspect_8784",
              "text": "Thanks, yes it was released today for subscribers and free accounts should get it 'soon'. Revise prompts can be quite basic, I guess more advanced prompts could be used to do crazier effects - something to try later.",
              "score": 2,
              "created_utc": "2026-02-19 22:50:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6bqrsl",
                  "author": "RobinZander1",
                  "text": "Thanks!",
                  "score": 1,
                  "created_utc": "2026-02-19 22:54:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6b8yon",
          "author": "rush39402",
          "text": "This is adorable and wonderfully informative. Thanks!",
          "score": 5,
          "created_utc": "2026-02-19 21:23:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bghs9",
          "author": "Okumam",
          "text": "I also encountered the issue that it puts the font name before a text block.  Very annoying and happens quite a bit.",
          "score": 3,
          "created_utc": "2026-02-19 22:00:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6bq9a5",
              "author": "Medium_Aspect_8784",
              "text": "Yes font names are the one thing I want them to fix the most, revise does help but I discovered it can only do one slide at a time.",
              "score": 2,
              "created_utc": "2026-02-19 22:51:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6c745s",
          "author": "MrsEDT",
          "text": "that is me! ",
          "score": 2,
          "created_utc": "2026-02-20 00:29:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cz968",
          "author": "AgileRoadmap",
          "text": "Is this made from NotebookLM?\nWould you mind sharing how you make it? This is crazy good!",
          "score": 2,
          "created_utc": "2026-02-20 03:21:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fqn2x",
          "author": "drcjsnider",
          "text": "Would this possibly be downloadable as a pdf? ",
          "score": 2,
          "created_utc": "2026-02-20 15:30:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6g2o64",
              "author": "Medium_Aspect_8784",
              "text": "Absolutely, you can find it here along with a few other similar slide decks (all with PDF links)   \n[https://tripgeo.com/Stories/Revisionist\\_Raccoon](https://tripgeo.com/Stories/Revisionist_Raccoon)",
              "score": 3,
              "created_utc": "2026-02-20 16:26:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6nrrfx",
                  "author": "drcjsnider",
                  "text": "Thank you!!",
                  "score": 1,
                  "created_utc": "2026-02-21 20:34:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6cabw9",
          "author": "RobinZander1",
          "text": "Can you even give a general explanation of how you made those slides? You must be an artistic person well obviously!  I mean is it just prompts that you gave it. Would you care to share a couple of the general prompts. I would love to create stuff like this.  🤷🏼‍♂️😍",
          "score": 1,
          "created_utc": "2026-02-20 00:47:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6cpsw4",
              "author": "Medium_Aspect_8784",
              "text": "You can make it with surprisingly few words. \"Whimsical\" is nearly always one of them 😄",
              "score": 1,
              "created_utc": "2026-02-20 02:22:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6d1d9b",
                  "author": "RobinZander1",
                  "text": "Not nearly helpful for a noob like me.  There had to be all sorts of specifics. Like you already researched what you want to communicate in each step. Maybe even some details about the scene. Certainly the style which looks like some sort of woodworking 3D.  Reminds me of those sets from the movie Dinner with Schmucks 🤓",
                  "score": 1,
                  "created_utc": "2026-02-20 03:35:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r605ja",
      "title": "NotebookLM + Claude Code: built a plugin that connects them through Chrome automation",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1r605ja/notebooklm_claude_code_built_a_plugin_that/",
      "author": "AdPast8543",
      "created_utc": "2026-02-16 04:41:11",
      "score": 94,
      "num_comments": 11,
      "upvote_ratio": 0.94,
      "text": "I use NotebookLM a lot while coding — upload API docs and technical references, then query them without worrying about hallucinations. But the context-switching was killing me. Leave the editor, find the right notebook, type the question, copy the answer back. And the bigger issue: when I asked multi-part questions, NotebookLM would often only cover part of it, and I wouldn't catch the gap until later.\n\nSo I built a plugin for Claude Code (Anthropic's CLI tool) that talks to NotebookLM through Chrome. You register your notebooks once, then query them by name from the terminal. The main thing it does differently: after every response, it checks whether your full question was actually answered. If something's missing, it automatically sends a follow-up — up to 3 rounds.\n\nIt uses Claude Code's built-in Chrome integration instead of a heavy headless browser:\n\n- Uses your existing Chrome browser as-is — no separate browser engine to install\n- Reuses your already logged-in Google account, so no extra auth setup\n- Queries go through the NotebookLM UI — no API keys or extra costs\n- Just add `claude --chrome` and you're connected\n\n**Setup:**\n\n1. Install [Claude in Chrome](https://chromewebstore.google.com/detail/claude/fcoeoabgfenejglbffodgkkbkcdhcgfn) extension and start Claude Code with `claude --chrome`\n2. Install the plugin:\n   ```\n   /plugin marketplace add LeeJuOh/claude-code-zero\n   /plugin install notebooklm-connector@claude-code-zero\n   ```\n3. Add a notebook URL and start querying\n\n**Limitations:**\n\n- Browser automation, so each query takes ~30-60 seconds\n\nGitHub: https://github.com/LeeJuOh/claude-code-zero/tree/main/plugins/notebooklm-connector\n\nQuestions welcome!",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r605ja/notebooklm_claude_code_built_a_plugin_that/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o5n3gd7",
          "author": "Illustrious_Meal8335",
          "text": "A non techie here do I need to have pro features of both to run this automation",
          "score": 7,
          "created_utc": "2026-02-16 06:27:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5n50g3",
          "author": "Steve15-21",
          "text": "What is different here from Jacob notebook lm mcp?",
          "score": 2,
          "created_utc": "2026-02-16 06:40:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5n8kwk",
              "author": "AdPast8543",
              "text": "Jacob's notebooklm-mcp-cli does a lot more actually. Full CRUD, source management, sharing, etc. — if you need that kind of control it's a solid pick.\n\nThis plugin takes a different approach — it works through the actual browser UI via Chrome, basically the same way you'd use NotebookLM yourself. No reverse-engineered APIs, no cookie extraction. If it works in your browser, it works with the plugin.",
              "score": 3,
              "created_utc": "2026-02-16 07:12:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5n6bcg",
          "author": "Burt4n",
          "text": "Have you looked at Google's Code Wiki?",
          "score": 2,
          "created_utc": "2026-02-16 06:52:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5omlww",
          "author": "brads0077",
          "text": "Iirc, there are at least two open sourcre NotebookLM MCP Servers on Gihub.",
          "score": 1,
          "created_utc": "2026-02-16 14:01:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5prhws",
          "author": "Sufficient-Draw-164",
          "text": "How exactly to install those plugins?",
          "score": 1,
          "created_utc": "2026-02-16 17:20:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ps326",
          "author": "Sufficient-Draw-164",
          "text": "Thank you. How do you exactly install those plugins?",
          "score": 1,
          "created_utc": "2026-02-16 17:23:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5rywhk",
              "author": "AdPast8543",
              "text": "First, you'll need [Claude Code](<https://code.claude.com/docs/en/quickstart>), which is Anthropic's official CLI tool for using Claude directly in your terminal. It requires a Pro, Max, Teams, or Enterprise plan from Anthropic (third-party providers like AWS Bedrock or Google Vertex aren't supported). You can install it with:\n\n```\nnpm install -g @anthropic-ai/claude-code\n```\n\nOnce Claude Code is set up, installing the plugin is just two commands:\n\n**Step 1.** Add the marketplace (one-time setup):\n\n```\n/plugin marketplace add LeeJuOh/claude-code-zero\n```\n\n**Step 2.** Install the plugin:\n\n```\n/plugin install notebooklm-connector@claude-code-zero\n```\n\nYou can confirm it's installed by running `/plugin` and checking the Installed tab.\n\nBefore you can actually use the plugin, you'll also need:\n\n- **Google Chrome** (or Edge) with the [Claude in Chrome extension](<https://chromewebstore.google.com/detail/claude/fcoeoabgfenejglbffodgkkbkcdhcgfn>) — this is what lets Claude Code interact with your browser\n- Launch Claude Code with Chrome integration enabled: `claude --chrome`\n- Be logged into [NotebookLM](<https://notebooklm.google.com>) in Chrome\n\nOnce everything's ready, you just talk to Claude naturally in your terminal. Say `\"Add <your-notebook-url> to my notebooks\"` to register a notebook, then ask any question about your docs — the plugin routes your question to NotebookLM and brings back the answer with citations.\n\nMore details in the [README](<https://github.com/LeeJuOh/claude-code-zero/tree/main/plugins/notebooklm-connector>) if you want to dig deeper.",
              "score": 1,
              "created_utc": "2026-02-16 23:51:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o60gxnp",
          "author": "devotedtodreams",
          "text": "I wish such a plugin were a thing with regular Claude too!",
          "score": 1,
          "created_utc": "2026-02-18 07:01:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r66erh",
      "title": "This has been a game changer for my classroom",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1r66erh/this_has_been_a_game_changer_for_my_classroom/",
      "author": "Rantioid",
      "created_utc": "2026-02-16 10:44:33",
      "score": 68,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "I teach year 5 and I have been using NotebookLM to upload my lesson plans and create engaging slide decks. I tell it to mention my teacher name throughout as well as things specific to our town to keep it relevant and engaging for my students. Some of the results honestly blow me away and my students absolutely love it. Because it's relevant to our area and school I find the kids get a lot out of it compared to generic teaching slides.\n\nToday I got it to reference and quote chapters of the book we were reading (which I uploaded) and make a slideshow tying it in with the comprehension strategy we were working on. Very cool and very accurate. \n\nI do like the video feature too however I find it's less engaging for students and can become a little robotic, but the potential is definitely there! \n\nWould love to hear other great ideas for the classroom! ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r66erh/this_has_been_a_game_changer_for_my_classroom/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o5p6xm5",
          "author": "Abject-Roof-7631",
          "text": "My mom is a retired teacher and I'm a NLM junkie.  Your students should be using NLM for complex learning, specifically around the mind map capabilities.  Each should have the mobile app downloaded to ingest subject matter content instantly and in the form factor they use.  Lastly, the infographic capabilities are unparalleled, they can use that or flashcards as a quick study aid.\n\nTldr; teach your students how to use NLM",
          "score": 8,
          "created_utc": "2026-02-16 15:45:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qkren",
          "author": "Irisi11111",
          "text": "That's a good idea. Even better, you could export your chat logs from ChatGPT and Gemini for this study, then feed those chats back into NotebookLM as a new collection. After that, you can generate a deep research report on the weaknesses and how to improve.",
          "score": 5,
          "created_utc": "2026-02-16 19:36:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5o2dzy",
          "author": "PitifulPiano5710",
          "text": "I haven't used this Google feature yet other than to poke around, but Learn Your Way seems like it would be a great option for teachers. I saw it on this video a few weeks back. It stuck with me since several of my family members are teachers and they all found it interesting \n\nhttps://youtu.be/h2E19_Tc4Ls?si=gJNtGrxmhBSNxWfd",
          "score": 3,
          "created_utc": "2026-02-16 11:47:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ovyur",
          "author": "Successful_Fly1601",
          "text": "I’ve also been using notebook LM in my classroom with great results. I import my lesson plans , teachers editions and student books for each specific week’s worth of lessons.\n\nIf we are focusing on a specific story for example, I screen grab a few pages into Gemini to get an art style analysis plus visual prompt for the slide deck customization and have made some really cool presentations filled with tasks, questions, vocabulary highlights etc.\n\nIt’s not a simple ‘press to generate’ scenario but my class have become completely engaged in the presentation stage of our lessons…so this is a win for me!\n\nI have experimented with sharing the notebook with parents so they can use the flashcard and quiz feature at home. This hasn’t had a bad response, it’s either been positive or indifferent 🙂",
          "score": 3,
          "created_utc": "2026-02-16 14:50:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u8p7x",
          "author": "stunning_man_007",
          "text": "good to know you like NoteBookLM. We all love it. If you want to change some text on the PDF ,try my new Tool https://stunslide.com. I build it for this scenario!",
          "score": 2,
          "created_utc": "2026-02-17 09:42:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5oe20t",
          "author": "Wurst_Kaese_Scenario",
          "text": "I am also a teacher... Can you give us a little more detail and examples? Sounds intriguing :)",
          "score": 2,
          "created_utc": "2026-02-16 13:11:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vcagd",
          "author": "tsquig",
          "text": "This is so cool! The tools available these days are crazy. Totally changing the way people can teach and learn in the span of the last 2 years.\n\nAnother one I've been experimenting with, free up to 50 sources if you want to keep exploring: [Implicit](https://implicit.cloud?utm_source=reddit&utm_medium=social_media&utm_campaign=plg&utm_content=notebooklm)",
          "score": 1,
          "created_utc": "2026-02-17 14:25:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d5gef",
          "author": "gsbe",
          "text": "Been teaching higher ed for 20 years. I have been using NLM to gather sources along with Claude, Gemini, and ChatGPT for two years to develop my lectures, assignments, and other materials. It has very much changed my teaching for the better! I am delivering what I consider world-class lecture content. It is a lot of work but this is a thrilling time to be a teacher. \n\nTip: I use Keynote for my slides. I found a free online script generator called KeynotePro Composer that will take properly formatted markdown and generate Keynote slides. It has really sped up my process of slide generation. This has become an important (and sometimes very nerdy) part of my workflow. \n\nI can share more if any teachers are interested. I encourage students to use NLM often and sometimes there are a few that listen. ;)",
          "score": 1,
          "created_utc": "2026-02-20 04:02:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5parbc",
          "author": "Aeonmoru",
          "text": "An MIT professor uses it this way:\nhttps://www.reddit.com/r/AI_Agents/comments/1r4s2co/mit_professor_accidentally_exposed_his_ai_grading/\n\n\nThe possibilities are only limited by imagination it seems.",
          "score": 0,
          "created_utc": "2026-02-16 16:03:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7n5m6",
      "title": "The new \"Export to Powerpoint\" feature just does a full page image export- elements are not distinct objects.",
      "subreddit": "notebooklm",
      "url": "https://i.redd.it/b176ew4185kg1.png",
      "author": "Okumam",
      "created_utc": "2026-02-17 23:58:27",
      "score": 66,
      "num_comments": 14,
      "upvote_ratio": 0.97,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r7n5m6/the_new_export_to_powerpoint_feature_just_does_a/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o5z8nrw",
          "author": "RobinZander1",
          "text": "After you have exported it, import it into Canva and then individual pieces become separate elements. You can adjust coloring, font, wording etc.",
          "score": 25,
          "created_utc": "2026-02-18 02:03:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61hgx1",
              "author": "Ecstatic-Wear-9999",
              "text": "I could easily export it to pdf and import the pdf to canva then edit, then download as pptx. I don't get the point for Export to Powerpoint",
              "score": 6,
              "created_utc": "2026-02-18 12:19:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6188m5",
              "author": "scipio42",
              "text": "As a Canva noob what's the workflow for this?  Granted I was rushed for time, but it was not intuitive at all when I tried it from a PDF.",
              "score": 3,
              "created_utc": "2026-02-18 11:09:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o62ks7a",
                  "author": "RobinZander1",
                  "text": "Try this, it's what I used\n\nhttps://youtu.be/GJkZcOFHEYo?si=X5U-qfLH4ooGMaLs",
                  "score": 3,
                  "created_utc": "2026-02-18 15:49:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5yqf4r",
          "author": "Automatic-Example754",
          "text": "Just an incredible example of implementing a feature without taking the trouble to design it first",
          "score": 20,
          "created_utc": "2026-02-18 00:27:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zuzqr",
              "author": "mentales",
              "text": "Such an incredible example of someone complaining about a released feature because it isn't perfect without considering how it is already providing utility to many people in the current iteration (we just upload to Canva btw). ",
              "score": 4,
              "created_utc": "2026-02-18 04:13:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5zvprg",
                  "author": "Automatic-Example754",
                  "text": "Making your users route through a third party because you didn't anticipate that they would need to edit text is extremely poor UX design",
                  "score": 8,
                  "created_utc": "2026-02-18 04:18:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ze7zf",
          "author": "LengthinessLow4203",
          "text": "oh that's a bit disappointing....Google will hopefully fix this soon",
          "score": 6,
          "created_utc": "2026-02-18 02:33:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zdwqo",
          "author": "hotdiggydog",
          "text": "For me it's a bit of an improvement. I've had to make prompts in Gemini for each slide using a Gem that takes an outline and changes it into prompts for me to then paste into Gemini in Slides, one by one. At least this way you can set up the whole set of slides in Notebook, manually fix them up if some are not ok, and then export them to ppt.\nIt's a bit better than doing it one by one but yeah it isn't a huge improvement.",
          "score": 2,
          "created_utc": "2026-02-18 02:31:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60lf3m",
          "author": "raff_lab",
          "text": "so if I import it in Canva is it possibile to edit the single elements?",
          "score": 2,
          "created_utc": "2026-02-18 07:41:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o611u2q",
              "author": "rehanakhtarm22",
              "text": "Yes. You need a canva pro plan.",
              "score": 1,
              "created_utc": "2026-02-18 10:14:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r9qgoo",
      "title": "I exported my entire WhatsApp history with someone and asked NotebookLM to analyze the dynamic. Yikes",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1r9qgoo/i_exported_my_entire_whatsapp_history_with/",
      "author": "Fine_Doubt_4507",
      "created_utc": "2026-02-20 09:05:24",
      "score": 64,
      "num_comments": 35,
      "upvote_ratio": 0.68,
      "text": "You can export WhatsApp chats as .txt files. Did that with a close friendship that had started feeling off.\n\nAsked: *\"What communication patterns do you notice? Who initiates? Who apologizes? Who redirects conversations?\"*\n\nThe answer was uncomfortably accurate. I don't want to talk about what it found.\n\nHas anyone else done this? What did you discover?",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r9qgoo/i_exported_my_entire_whatsapp_history_with/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o6f33q6",
          "author": "Purple-Breadfruit541",
          "text": "What happened next will shock you 😱",
          "score": 86,
          "created_utc": "2026-02-20 13:30:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6e61d9",
          "author": "Lowcrbnaman",
          "text": "Upload infographic",
          "score": 93,
          "created_utc": "2026-02-20 09:13:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eftu7",
          "author": "thevokplusminus",
          "text": "This is just a cry for attention ",
          "score": 80,
          "created_utc": "2026-02-20 10:44:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6fl427",
              "author": "Radiant-Rain2636",
              "text": "I think somebody in Google headquarters is tasked with this job",
              "score": 6,
              "created_utc": "2026-02-20 15:04:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6fjx5i",
          "author": "ProfessorBannanas",
          "text": "I shared 43 emails (spanning 20 years) of my dad who has passed and chat with NBLM a couple times a week",
          "score": 9,
          "created_utc": "2026-02-20 14:58:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6jqpw3",
              "author": "Dazzling_Dog1131",
              "text": "dang that hit\n\ni hope ur doing ok 🫂",
              "score": 4,
              "created_utc": "2026-02-21 04:09:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6kdqne",
                  "author": "ProfessorBannanas",
                  "text": "We all grieve differently. Makes us human. Saw a therapist. Smoked a bowl or two. “Ok” is a spectrum for all of us. Depends on day. \n\nBut it’s Friday night. Not working tomorrow. Shared a pizza with a new match from Bosnia. No peperoni but she be fine. She is brushjng her teeth atm and Im glad my bed had clean sheets.",
                  "score": 4,
                  "created_utc": "2026-02-21 07:17:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6e9fzd",
          "author": "Nowitcandie",
          "text": "It's really not a great idea to upload personal chat histories into cloud LLM applications. You also just threw your friends privacy and private data under the bus. Are they aware and okay with that? ",
          "score": 93,
          "created_utc": "2026-02-20 09:46:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6efjlo",
              "author": "NectarineDifferent67",
              "text": "Meta owns WhatsApp. Why do you think his/her data is safe? If you trust Meta's privacy statement, then Google also said that they don't use your data in NotebookLM, unless you click the feedback button.",
              "score": 53,
              "created_utc": "2026-02-20 10:41:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6f7zdy",
                  "author": "buioprestointasca",
                  "text": "Encryption",
                  "score": 4,
                  "created_utc": "2026-02-20 13:56:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6ehj9t",
                  "author": "Nowitcandie",
                  "text": "I don't think it's safe in Meta. However, spreading it around unencrypted to other tech firms multiples risk. \n\n\n1. Google can and does crawl the data for various reason. \n\n\n2. Multiplies potential damage of account compromise. \n\n\n3. Authories can make requests and there is no saying those requests need be fully lawful or justified anymore in the current environment.  (Did everyone forgot the image of all the tech CEOs pledging loyalty to the new king at the inauguration?) \n\n\n4. When someone shares a chat history they're not just sharing their own private personal data - they're sharing that of other participants. This is potentially unlawful without consent, and certainty unethical without permission. Nobody messages close friende with the expectation of having that data transferred or leaked to other third parties. This is a whole new emerging compromise vector. ",
                  "score": 4,
                  "created_utc": "2026-02-20 10:59:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6g2gby",
              "author": "EsperandoVida",
              "text": "It’s all over at this point. I’ve given up on privacy.",
              "score": 3,
              "created_utc": "2026-02-20 16:25:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6gjnb3",
              "author": "SophonParticle",
              "text": "Those corporations also run your messaging app.",
              "score": 3,
              "created_utc": "2026-02-20 17:44:45",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6enw9c",
              "author": "ares0027",
              "text": "Tbh i really like people (seemingly) like you. Who has absolutely 0 idea what they are getting into, what privacy actually is yet preaches other on privacy.",
              "score": 1,
              "created_utc": "2026-02-20 11:50:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6ergi2",
                  "author": "Nowitcandie",
                  "text": "Interesting, looking at your post history it's clear you're a just a troll that contributes nothing to the conversation other than insulting people.",
                  "score": 1,
                  "created_utc": "2026-02-20 12:16:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6g9u5f",
              "author": "DistributionOk4643",
              "text": "Why is it not a good idea?",
              "score": 1,
              "created_utc": "2026-02-20 16:59:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6gklib",
                  "author": "cornmacabre",
                  "text": "It's a well intentioned sentiment, but also a strong opinion grounded in an incomplete understanding of the context in which LLM's are trained, or which platforms train on user data.\n\nFor nbLM specifically, that's a big part of the appeal is it doesn't use the data for training.\n\n> NotebookLM never trains models on your uploaded data.\n\nhttps://workspace.google.com/products/notebooklm/",
                  "score": 7,
                  "created_utc": "2026-02-20 17:49:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6h5kc8",
          "author": "Gisschace",
          "text": "Tbf if you’re at the point of uploading and asking this question then you already know it’s not good",
          "score": 6,
          "created_utc": "2026-02-20 19:24:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fxwfu",
          "author": "Hornet-Aggressive",
          "text": "LLMs are echo-chamber magnifiers, and for cases like this one, it's going to get people even less tolerant on differences or imperfections in relationships. Interaction between humans is not rational",
          "score": 14,
          "created_utc": "2026-02-20 16:04:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6iy6vb",
          "author": "Vectrex71CH",
          "text": "Friends hate this trick",
          "score": 4,
          "created_utc": "2026-02-21 01:05:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ehial",
          "author": "MissJoannaTooU",
          "text": "I've done this too and with a lot of chats at once. It was quite shocking. I don't really want to divulge what it called the notebook before I even asked a question, but it was high impact. \n\nIt needs contextualising sometimes but yes it's a very interesting use case. \n\nChat GPT exports next?",
          "score": 6,
          "created_utc": "2026-02-20 10:58:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k7mxy",
              "author": "mentalext",
              "text": "i've uploaded my entire chatgpt and twitter history. the podcast episodes are hilarious and kind of surreal to listen to. I asked it for a report analyzing what I'm hypocritical about in my arguments with people also my logical fallacies. It didn't come back with anything though. ;) lol",
              "score": 2,
              "created_utc": "2026-02-21 06:22:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6kf6jx",
                  "author": "MissJoannaTooU",
                  "text": "That's cool. I will have to convert the JSON.",
                  "score": 1,
                  "created_utc": "2026-02-21 07:31:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6m7egw",
          "author": "dweebzRaja",
          "text": "I exported a my chat convo (text messages) and uploaded them into Gemini to locate every lie my narcissistic ex boss decided to throw on me and documented every last instance. She even went as far as to threaten to sue me and I calmly replied with I’m prepared to defend myself.\n\nI even had it describe the two people in the conversation and didn’t realize until then that she’d been manipulative from day 1.",
          "score": 2,
          "created_utc": "2026-02-21 15:50:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6j1833",
          "author": "FormalAd7367",
          "text": "meta’s whatsapp has a specific option not to train your data but notebooklm doesn’t",
          "score": 1,
          "created_utc": "2026-02-21 01:24:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jutdy",
          "author": "FarseedTheRed",
          "text": "Licensed therapists HATE this trick!",
          "score": 1,
          "created_utc": "2026-02-21 04:39:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6h62li",
          "author": "lolado06",
          "text": "please seek psychological help",
          "score": 0,
          "created_utc": "2026-02-20 19:26:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f30fl",
          "author": "Purple-Breadfruit541",
          "text": "dead internet",
          "score": -2,
          "created_utc": "2026-02-20 13:29:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gy3zq",
          "author": "HydroHomie3964",
          "text": "oof. I wanted to do this same thing a while ago. but I don’t use WhatsApp so I was trying to figure out how I could get an export of all my messages on my iPhone app. was kind of bummed to learn that it can’t be done, but maybe that’s for the best. some things are better left in the past lol.",
          "score": 0,
          "created_utc": "2026-02-20 18:49:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6i42e8",
              "author": "aaatings",
              "text": "If you want specific ones: screenshots to pdf to input nblm as source",
              "score": 3,
              "created_utc": "2026-02-20 22:14:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6ko22r",
              "author": "Familiar_Ad_8004",
              "text": "iMazing is what you want to use.  Annual license single user is $35.  iMessages are all backed up into the iCloud and so once you do a complete backup you use this software to individualize threads between two people and download them as text files or PDF there and using them as a source for Notebook LM. It is freaking amazing when you can analyze your communication with your kids over the last 10 years to see how things have changed for the better or worse than to the exact specific details. There's just so much you can do and yes my mom is a therapist and yes I am a data security specialist who's been in Enterprise tech for almost 30 years.. it's safer than safe",
              "score": 2,
              "created_utc": "2026-02-21 08:58:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r978ko",
      "title": "Gemini 3.1 Pro is also now available on NotebookLM exclusively for Pro and Ultra users",
      "subreddit": "notebooklm",
      "url": "https://blog.google/innovation-and-ai/models-and-research/gemini-models/gemini-3-1-pro/",
      "author": "Get_Ahead",
      "created_utc": "2026-02-19 18:32:48",
      "score": 61,
      "num_comments": 7,
      "upvote_ratio": 0.98,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Meta",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r978ko/gemini_31_pro_is_also_now_available_on_notebooklm/",
      "domain": "blog.google",
      "is_self": false,
      "comments": [
        {
          "id": "o6bfczc",
          "author": "Gao",
          "text": "Pro model is default in notebookLM ? I never seen the option to change models",
          "score": 15,
          "created_utc": "2026-02-19 21:54:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6e5a57",
              "author": "Accurate_Midnight993",
              "text": "That's true. There's no way to know which model is active. Recently, several commenters, myself included, have noticed a drop in performance. And we've hypothesized that the active model isn't the best. Even for paying Pro or Ultra users.",
              "score": 7,
              "created_utc": "2026-02-20 09:06:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6gpa18",
                  "author": "HorderLock",
                  "text": "Not the only one that realized that the responses seem to be from a completely different model these last few days? Thought I had messed up my sources somehow haha.",
                  "score": 4,
                  "created_utc": "2026-02-20 18:10:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ajygj",
          "author": "Appropriate_Can_7766",
          "text": "thats why it wasnt working earlier",
          "score": 5,
          "created_utc": "2026-02-19 19:21:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6c49ft",
          "author": "Klendatu_",
          "text": "How do you know? Where to see that?",
          "score": 2,
          "created_utc": "2026-02-20 00:12:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6anucd",
          "author": "Negative-Duck-6030",
          "text": "That’s a good one",
          "score": 1,
          "created_utc": "2026-02-19 19:40:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ev0it",
          "author": "Bitter-Necessary-253",
          "text": "Good news but this didn't fix the problem when generating reports ",
          "score": 1,
          "created_utc": "2026-02-20 12:41:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r734zw",
      "title": "Self Hosted Alternative to NotebookLM",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1r734zw/self_hosted_alternative_to_notebooklm/",
      "author": "Uiqueblhats",
      "created_utc": "2026-02-17 11:06:16",
      "score": 52,
      "num_comments": 6,
      "upvote_ratio": 0.94,
      "text": "For those of you who aren't familiar with SurfSense, SurfSense is an open-source alternative to NotebookLM, Perplexity, and Glean.\n\nIt connects any LLM to your internal knowledge sources, then lets teams chat, comment, and collaborate in real time. Think of it as a team-first research workspace with citations, connectors, and agentic workflows.\n\nI’m looking for contributors. If you’re into AI agents, RAG, search, browser extensions, or open-source research tooling, would love your help.\n\n**Current features**\n\n* Self-hostable (Docker)\n* 25+ external connectors (search engines, Drive, Slack, Teams, Jira, Notion, GitHub, Discord, and more)\n* Realtime Group Chats\n* Hybrid retrieval (semantic + full-text) with cited answers\n* Deep agent architecture (planning + subagents + filesystem access)\n* Supports 100+ LLMs and 6000+ embedding models (via OpenAI-compatible APIs + LiteLLM)\n* 50+ file formats (including Docling/local parsing options)\n* Podcast generation (multiple TTS providers)\n* Cross-browser extension to save dynamic/authenticated web pages\n* RBAC roles for teams\n\n**Upcoming features**\n\n* Slide creation support\n* Multilingual podcast support\n* Video creation agent\n\nGitHub: [https://github.com/MODSetter/SurfSense](https://github.com/MODSetter/SurfSense)",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r734zw/self_hosted_alternative_to_notebooklm/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o5v3cix",
          "author": "ncatalin94",
          "text": "kudos to you. Not a dev and too poor, but i do hope you will get to develop this",
          "score": 2,
          "created_utc": "2026-02-17 13:36:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60iaxp",
              "author": "Uiqueblhats",
              "text": "Thanks",
              "score": 1,
              "created_utc": "2026-02-18 07:13:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5xb2rz",
          "author": "klay64",
          "text": "Congratulations? I'd like to connect to n8n, which I have locally on my laptop. Are there any tutorials on how to set it up? Thanks.",
          "score": 1,
          "created_utc": "2026-02-17 20:08:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60iaef",
              "author": "Uiqueblhats",
              "text": "Can you explain more about your use case?",
              "score": 1,
              "created_utc": "2026-02-18 07:13:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o61hn1e",
                  "author": "klay64",
                  "text": "Run it on n8n for workflows",
                  "score": 1,
                  "created_utc": "2026-02-18 12:20:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6167zz",
          "author": "makefishpies",
          "text": "How many sources can support and size limit per source?",
          "score": 1,
          "created_utc": "2026-02-18 10:52:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7m8hm",
      "title": "Finally, this was the only feature missing. Google Slides is next I guess",
      "subreddit": "notebooklm",
      "url": "https://v.redd.it/lre5ctga15kg1",
      "author": "dataexec",
      "created_utc": "2026-02-17 23:19:13",
      "score": 45,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r7m8hm/finally_this_was_the_only_feature_missing_google/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o5zp738",
          "author": "Hawklord42",
          "text": "No pencil for me (free version).",
          "score": 1,
          "created_utc": "2026-02-18 03:37:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o647pgm",
              "author": "mulox1",
              "text": "Supposedly it will come to free users next week.",
              "score": 2,
              "created_utc": "2026-02-18 20:14:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6203u8",
          "author": "tosime55",
          "text": "Great slides. What style did you use?",
          "score": 1,
          "created_utc": "2026-02-18 14:09:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67y8ye",
              "author": "dataexec",
              "text": "The default one, whatever they come up with.",
              "score": 1,
              "created_utc": "2026-02-19 10:42:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o66rhpm",
          "author": "admiller07",
          "text": "Game changer feature!  Been waiting for this! ",
          "score": 1,
          "created_utc": "2026-02-19 04:29:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67y7y7",
              "author": "dataexec",
              "text": "Indeed.",
              "score": 1,
              "created_utc": "2026-02-19 10:41:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r5iw7a",
      "title": "How I use NotebookLM for serious article digestion",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1r5iw7a/how_i_use_notebooklm_for_serious_article_digestion/",
      "author": "daozenxt",
      "created_utc": "2026-02-15 16:28:34",
      "score": 44,
      "num_comments": 31,
      "upvote_ratio": 0.92,
      "text": "TL;DR: I use NotebookLM to turn batches of web articles into slide decks + structured Q&A — but the real fix was improving how I capture image-heavy and already-paid content so nothing important gets lost.\n\n\n\n# Why NotebookLM works (when it works)\n\nNotebookLM lets me:\n\n* Ask questions while reading\n* Extract claims + supporting evidence\n* Generate short slide decks for recall\n* Compare multiple sources in one place\n\nIt shifts me from passive reading to active synthesis.\n\nBut I kept hitting a capture problem.\n\n\n\n# Where things break\n\nTwo cases caused friction:\n\n1) Image-heavy essays  \nSome writing (think Wait But Why, data-heavy explainers, charts) loses meaning if you strip visuals.  \nText-only capture makes the summaries shallow.\n\n2) Paywalled articles I already subscribe to  \nNot bypassing anything — I mean logged-in, legitimately accessible pages.  \nNotebookLM's official capture often fails or imports partial content because of how those pages render.\n\nNotebookLM’s official web capture is primarily text-based.  \nMost third-party batch-import extensions follow the same approach — fast and text-first, but not visual-preserving.\n\nThat’s where the gap was for me.\n\n\n\n# The workflow that fixed it\n\nInstead of relying only on text extraction:\n\n* Clean page → official web capture (URLs)\n* Image-heavy or logged-in page → PDF capture of exactly what I’m viewing\n\nThen I:\n\n1. Paste multiple URLs at once (or extract links from a long directory page).\n2. Import them into one NotebookLM notebook.\n3. Generate artifacts per article (slides, sometimes audio).\n4. Open NotebookLM in the browser side panel while keeping the original article in the main window.\n\nWhile reviewing, I ask:\n\n* What are the core claims?\n* Which visuals matter most?\n* What assumptions are hidden?\n* Where do multiple sources disagree?\n\nInstead of ending up with open tabs, I end up with structured summaries I can actually reuse.\n\n\n\nThis same “break → import → interrogate → synthesize” approach actually changed how I read books too.\n\nI started splitting long nonfiction into chapters before importing into NotebookLM and generating chapter-level slides so I can actually absorb them instead of “half-finishing” books.\n\nIf you’re curious, I wrote about that workflow here:  \n[https://www.reddit.com/r/notebooklm/comments/1r3l12s/how\\_i\\_use\\_notebooklm\\_to\\_actually\\_absorb/](https://www.reddit.com/r/notebooklm/comments/1r3l12s/how_i_use_notebooklm_to_actually_absorb/)\n\n\n\nIf anyone wants the helper tool I’m using (I built it to solve this capture gap), I’m happy to share in the comments ",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r5iw7a/how_i_use_notebooklm_for_serious_article_digestion/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o5jtqi2",
          "author": "gmvancity",
          "text": "I installed his chrome extension then upgraded to his premium product yesterday. This is not an ad btw. I don't know OP. But I subscribed to his premium service and paid the annual fee which at twenty bucks was so value for money..coz that is like just around 1.66 a month. \n\nI feel that the feature where an ebook (pdf or Epub) gets chopped into chapters and then automatically uploaded to notebook LM as sources was a huge game changer for me. I was able to select batch processing where 12 video summaries and 12 infographics were being generated all at the same time. (My ebook had 12 chapters)\n\nPreviously I would upload an entire book and then get a video summary of it. With OP's tool via its premium features, I was able to break down books into chapters and it was so seamless. \n\nCan't wait to try the article deepdives especially for those where I have a subscription like the New York Times, Washington Post and The Atlantic. \n\nI highly recommend OP chrome extension and primarily the premium features.",
          "score": 4,
          "created_utc": "2026-02-15 18:38:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60ggda",
              "author": "uefa_007",
              "text": "Do you use any specific prompts for notebooklm to generate good video summaries & info graphics?",
              "score": 1,
              "created_utc": "2026-02-18 06:57:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o60tth6",
          "author": "gmvancity",
          "text": "Question u/daozenxt\n\nI realized that the max size is 150 mb for a single upload \n\nIf I have an ebook that is say  >150 mb, do you have any suggestions on how that can be say broken into 2 files (let's say it is 200 mb and broken into 100 mb for each file)  and still split those files into chapters using your tool? Not sure how I can do that if the table of contents is contained ij only one file.",
          "score": 2,
          "created_utc": "2026-02-18 08:59:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o613cx8",
              "author": "daozenxt",
              "text": "Because the splitting is done locally, theoretically, as long as the size of each chapter after splitting is less than 150MB, it can be uploaded successfully.",
              "score": 2,
              "created_utc": "2026-02-18 10:27:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o613rrk",
                  "author": "gmvancity",
                  "text": "Trying to understand the comment...does this mean I don't need to split before uploading? \n\nI did try to upload a 186 mb file via your extension. And notebook lm would say can't upload as maximum is 150 mb",
                  "score": 2,
                  "created_utc": "2026-02-18 10:31:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5jt51t",
          "author": "RainGray",
          "text": "Yes, please share your helper tool. Thank you so much!",
          "score": 1,
          "created_utc": "2026-02-15 18:35:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5k0kdh",
              "author": "daozenxt",
              "text": "It’s NoteKitLM. Link: https://chromewebstore.google.com/detail/notekitlm/gbbjcgcggmbbedblaipngfghdfndpbba",
              "score": 1,
              "created_utc": "2026-02-15 19:11:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vetw0",
          "author": "tsquig",
          "text": "Another option for non-NBLMers with similar functionality: [Implicit, free up to 50 sources](https://implicit.cloud?utm_source=reddit&utm_medium=social_media&utm_campaign=plg&utm_content=notebooklm). Little bit different feature set than NBLM, actually better for privacy/security and business use. Can definitely support a similar workflow, though.",
          "score": 1,
          "created_utc": "2026-02-17 14:39:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vlufu",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-02-17 15:14:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5je9af",
          "author": "Numerous-Cup1863",
          "text": "Thanks for posting this.  I just started using NotebookLM and am still struggling with use cases, and when to use this vs Gemini etc.",
          "score": 1,
          "created_utc": "2026-02-15 17:23:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7gz9j",
      "title": "The Gemini notebookLM feature is misleading",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1r7gz9j/the_gemini_notebooklm_feature_is_misleading/",
      "author": "Mike_newton",
      "created_utc": "2026-02-17 20:01:20",
      "score": 42,
      "num_comments": 24,
      "upvote_ratio": 0.96,
      "text": "Google needs to do better with this  \n  \n**tldr: if you have multiple notebooks with related sources, merge them and use NotebookLM. attaching notebooks from NBLM to Gemini looks convenient but it searches based on probability, not your actual content. the answers will lean towards what it already knows, not what's in your sources.**\n\nI tested something today. had the related sources split across two notebooks. attached both to Gemini and asked a question. then merged them in NotebookLM and asked the same thing.\n\nGemini said Buffett first mentioned Apple in 2016. NotebookLM found a mention from 1991. off by 25 years.\n\nHere's the thing. if you look at Gemini's thought process it literally says it's searching based on likelihood and prioritizing where the answer is most likely to be. it's not actually reading through everything you gave it. it's guessing where to look based on what it already knows.\n\nTo make it even more obvious, I searched the same question on Gemini without any notebooks attached. same answer. 2016. so the notebooks didn't even change what Gemini told me. it just fell back on what it already knew and ignored my sources.\n\nNotebookLM actually went through the documents and found something Gemini never would have. a 1991 letter where Buffett called Apple a \"Mistake Du Jour\" because tech was outside his circle of competence. that completely changes the story.\n\nhttps://reddit.com/link/1r7gz9j/video/skxhhnxv14kg1/player\n\n",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r7gz9j/the_gemini_notebooklm_feature_is_misleading/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o5xij4d",
          "author": "Necessary_Cut_8391",
          "text": "I agree , I have noticed it so many times Gemini relays on limited sources in a notebook while answering but the same query when handled inside NBLM provides much better information",
          "score": 8,
          "created_utc": "2026-02-17 20:43:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xj3xq",
              "author": "Mike_newton",
              "text": "I see the NotebookLM attachment as just for decoration seriously. That feature shouldn't be there if it's not going to work well enough to at least be usable in normal cases",
              "score": 6,
              "created_utc": "2026-02-17 20:46:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5xobw5",
          "author": "Hot-Parking4875",
          "text": "Hmm. I had not gotten around to using the NotebookLM feature in Gemini. Looks like it’s not worth bothering with.",
          "score": 4,
          "created_utc": "2026-02-17 21:11:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xonnd",
              "author": "Mike_newton",
              "text": "It's not terrible for quick stuff but if you actually need answers from your sources it's not reliable. you're better off just using notebooklm directly",
              "score": 4,
              "created_utc": "2026-02-17 21:13:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5xckjy",
          "author": "Revolutionary_Arm907",
          "text": "Is there a simple way to merge notebooks ?",
          "score": 3,
          "created_utc": "2026-02-17 20:15:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xdl0y",
              "author": "Mike_newton",
              "text": "Yep, I use an extension for that. [Decodr](https://chromewebstore.google.com/detail/decodr-notebooklm-power-t/llpbgcbafdoncakinkecfinjadhnngag)\n\nThere are a few other options i have also used as well but I am biased because I worked on this",
              "score": 7,
              "created_utc": "2026-02-17 20:20:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5xf6pb",
                  "author": "bansonian",
                  "text": "Thanks for this bro. This is really good",
                  "score": 2,
                  "created_utc": "2026-02-17 20:27:51",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5zsgkf",
                  "author": "AggravatingCounter84",
                  "text": "Good luck with this man! Cool stuff that you were able to include it in NBLM itself. A worthy opponent",
                  "score": 1,
                  "created_utc": "2026-02-18 03:57:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5xkzed",
          "author": "M4xs0n",
          "text": "You answered my question I had a few weeks ago perfectly, thank you. And thanks for even a video! So it’s just dumb to use Gemini using a Notebook. Which is annoying because I want to actually chat with it and notebookLM isn’t that nice to chat and have a conversation with…",
          "score": 4,
          "created_utc": "2026-02-17 20:55:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xlqve",
              "author": "Mike_newton",
              "text": "honestly same frustration. the chat in notebooklm feels like talking to a textbook. but I'd rather get the right answer in a boring chat than a wrong answer in a nice one lol... but that is only in some use cases",
              "score": 3,
              "created_utc": "2026-02-17 20:59:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5xte74",
                  "author": "Hammyrock4395",
                  "text": "This! I use the notebooklm answer and feed it back to my gemini chat for cleaning it up! And that too if i really need to otherwise i just wordsmith it myself it aint that bad for me personally!",
                  "score": 3,
                  "created_utc": "2026-02-17 21:34:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5xfft3",
          "author": "bansonian",
          "text": "🤔🤔this is interesting",
          "score": 2,
          "created_utc": "2026-02-17 20:29:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ybpim",
          "author": "H_GG",
          "text": "I had a similar case today, I was shocked by the result. Gemini was out of target ",
          "score": 2,
          "created_utc": "2026-02-17 23:06:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ybyv2",
              "author": "Mike_newton",
              "text": "The confidence gemini has while being completely off is something else lol",
              "score": 3,
              "created_utc": "2026-02-17 23:07:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o64wcwg",
                  "author": "H_GG",
                  "text": "I find it's better for now to use it as Gem from the Gemini left bar, create one and add the Notebook",
                  "score": 1,
                  "created_utc": "2026-02-18 22:08:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o61j9pr",
          "author": "thatguy122",
          "text": "I always understood NotebookLM as a source in Gemini was no different than directly adding the sources to Gemini through Gems and was basically designed to save time setting up both. ",
          "score": 2,
          "created_utc": "2026-02-18 12:32:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5yvlxh",
          "author": "Mr_CarlosG_",
          "text": "I had the same suspicion. I do like the feature in Gemini to scan my google drive, but with notebooklm I have been more skeptical.",
          "score": 1,
          "created_utc": "2026-02-18 00:55:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5z3a08",
          "author": "Successful_Cut_7048",
          "text": "Thanks for sharing! Does it help if in the prompt, we say something like “use only the information in the [name] notebook attached”",
          "score": 1,
          "created_utc": "2026-02-18 01:36:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60gzxn",
              "author": "Mike_newton",
              "text": "It may help if it's only one NotebookLM source you attached. If they are more, it will still guess on which NotebookLM to look through",
              "score": 1,
              "created_utc": "2026-02-18 07:01:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o618kqh",
          "author": "Grand-Committee5473",
          "text": " NotebookLM attached in Gems is sucks, Gems just provide inaccurate/ incomprehensible responses, don’t bother with Gem if you required reliable answers, instead stick with NBLM\n(I gave the same questions in NBLM and Gem+ NBLM, even pasting the prompts in NBLM into Gem, the responses from Gem makes me frustrating)",
          "score": 1,
          "created_utc": "2026-02-18 11:12:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o679wor",
          "author": "jimihovedk",
          "text": "When I add notebooks to my Gemini chat, it says it cannot see the notebook. Does anybody know what the problem is? ",
          "score": 1,
          "created_utc": "2026-02-19 06:51:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6n1xjy",
          "author": "playeronex",
          "text": "Agree, that's a brutal catch. Gemini's basically just confidence-boosting whatever it already knows instead of actually grounding itself in your sources, which defeats the whole point of attaching them. honestly this is exactly the problem [Gistr](http://gistr.so) solves. It forces the AI to actually work through your content chronologically and logically, rather than pattern-matching what it's heard before. You build understanding from what you actually fed it, not what the model thinks is probable. dm me if you wanna see how it handles that kind of deep source verification differently.",
          "score": 1,
          "created_utc": "2026-02-21 18:22:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6qmy6",
      "title": "Is using NotebookLM cheating? My GF got into an argument with a classmate over NLM",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1r6qmy6/is_using_notebooklm_cheating_my_gf_got_into_an/",
      "author": "GoForthandProsper1",
      "created_utc": "2026-02-17 00:09:36",
      "score": 39,
      "num_comments": 25,
      "upvote_ratio": 0.86,
      "text": "She uses NLM to create Chapter overviews/slides, create study guides and quiz herself. It has been a game changer for her in helping her comprehend so much reading material. She never uses it to write essays or short text answers or anything else where she has to use her own words. \n\n\nAfter class today she said she was talking with a classmate about study tips and she mentioned she uses NLM. \n\n\nThis classmate then said very proudly \"Oh I don't use any of those AI things. I am not going to tell our Professor on you this time but you should think about telling her\". \n\n\nAm I crazy but I don't feel like using NLM is the same as using chat GPT or something to generate answers for you. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r6qmy6/is_using_notebooklm_cheating_my_gf_got_into_an/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o5s51cu",
          "author": "BeachSluts1",
          "text": "There is no such thing as cheating at studying. Using AI tools to complete classwork for you is a different story, and would be considered by most to be cheating. Chalk it up to a misunderstanding and move past it",
          "score": 26,
          "created_utc": "2026-02-17 00:26:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5trz5t",
              "author": "thecompbioguy",
              "text": "The class mate has misunderstood the institute's AI policy.",
              "score": 6,
              "created_utc": "2026-02-17 07:03:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5tw9aa",
              "author": "bansonian",
              "text": "True",
              "score": 3,
              "created_utc": "2026-02-17 07:43:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5s5hwj",
          "author": "_The_Bearded_Wonder_",
          "text": "I made use of NLM during my last few classes in my MBA, once I had become aware of it. It was an invaluable tool in organizing my sources, generating paper and presentation outlines, and fact checking myself during the writing process.\n\n\nIt's a tool, not a replacement for me. I would actively encourage people to use it where it makes sense, particularly on research projects. ",
          "score": 27,
          "created_utc": "2026-02-17 00:29:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5s99rk",
              "author": "stiveooo",
              "text": "How does it help organizing sources? By telling you which ones are bad? ",
              "score": -2,
              "created_utc": "2026-02-17 00:50:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5sx98m",
                  "author": "texo_optimo",
                  "text": "At some point in the process you have to employ some critical thought to realize if your sources that you were going to load into the notebook are bad or not. Yeah it's a great tool, but it's only as great as the user's input.",
                  "score": 3,
                  "created_utc": "2026-02-17 03:15:10",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5t3gib",
                  "author": "_The_Bearded_Wonder_",
                  "text": "As others have said, you still have research to do. Between sources provided in my studies and ones I found, I would load them into a notebook specific to a class. When I would work on an outline for a paper, the outline would cite the source, giving me a reference of where to quote it directly. It was extremely helpful for me and saved a ton of time that would have otherwise been spent with me digging through dozens of links and files, trying to remember why I had saved it. ",
                  "score": 1,
                  "created_utc": "2026-02-17 03:55:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5s4m3w",
          "author": "Spiritual-Ad8062",
          "text": "Not the same. \n\nI’d welcome that conversation with the professor, if the classmate has cojones grandes.",
          "score": 11,
          "created_utc": "2026-02-17 00:24:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sah6q",
          "author": "jb4647",
          "text": "honestly this feels like a classic case of confusing a tool with an outcome. If she’s using NotebookLM to summarize chapters, generate study guides, and quiz herself, that sounds a lot like using CliffsNotes, flashcards, or a study group. It’s a learning aid. The key line for me is that she is not using it to write essays or generate graded answers that are supposed to reflect her own thinking.\n\nThere’s a big difference between using AI to replace your thinking and using it to sharpen your thinking. If she uploads her own reading material and uses the tool to help organize it, ask questions about it, and test her understanding, she’s still doing the cognitive work. In fact, she may be doing more of it because she’s actively engaging with the content instead of passively rereading.\n\nWhether it is cheating really comes down to the professor’s policy. If the syllabus explicitly bans AI tools of any kind, then technically it could be a violation, even if the intent is just studying. But absent a clear rule, this is no different from using a calculator to check your math steps or Quizlet to drill vocabulary. The learning still has to happen in her head.\n\nThe classmate’s reaction sounds more like moral signaling than a thoughtful distinction. There’s a tendency right now to lump all AI use together as if generating a full essay and creating a personal study guide are the same thing. They are not. One bypasses the learning objective. The other can reinforce it.\n\nIf I were in her position, I would not panic, but I might proactively check the course policy. If it is silent on study tools, she’s likely fine. If it is ambiguous, she could even ask the professor in a neutral way whether AI-based study aids are allowed. That turns it from something secretive into something transparent.\n\nYou’re not crazy for seeing a difference. There is a meaningful difference between outsourcing your answers and using a tool to help you understand the material more deeply. The intent and the actual use case matter a lot.",
          "score": 8,
          "created_utc": "2026-02-17 00:57:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5toosb",
          "author": "pirateg3cko",
          "text": "Her classmate is an idiot.",
          "score": 7,
          "created_utc": "2026-02-17 06:35:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5yz91o",
              "author": "ThatSyd",
              "text": "Yeah, sometimes it's just that simple. They heard something about how people are getting in trouble using AI for school and never thought about what the actual problem with it was.",
              "score": 2,
              "created_utc": "2026-02-18 01:15:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5sl1yl",
          "author": "tenten70_0",
          "text": "I am using Notebooklm for my studies. Honestly, without it, idk how I would have gotten through five courses. Previously, I could handle only three courses per semester and always felt terrible about it. It helps me understand the logic of my academic readings so much better. It also lets me write my essays quickly because I understand the material. I really do not think notebooklm is equipped to even write an essay, at least. I have used it to help me draft an essay outline based on my thesis. For me, understanding the class readings helps me write my essay on my own. Just making the connection after understanding the readings feels amazing. It even eased my anxiety when taking an in-class test because I studied my readings and asked questions when I did not understand a specific part. \n\nI am currently writing a 4,000-word essay and need to cover 30 sources. I use notebooklm to tell me if it covers certain things and point them out to me, so that I can refer to the book and look at the section myself. It benefits my research, so I cite it. I personally do not have the patience to read all 30 sources.  \n  \nIn all honesty, notebook saves time! That's a crucial part of it, and that is why I prefer it. If it makes her life easier, she should be able to use it. The only problem with AI is if it is used to write. Universities do not say anything about using AI to 'read'. However, I would hesitate to use it in a philosophy class or a literature class. ",
          "score": 5,
          "created_utc": "2026-02-17 02:01:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5sreo4",
          "author": "JealousBid3992",
          "text": "No other response to be honest but to just laugh in their face as condescendingly as the original message",
          "score": 4,
          "created_utc": "2026-02-17 02:39:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s9zpp",
          "author": "Pasid3nd3",
          "text": "First, only fools \"don't use any of those AI things.\" Try not to calibrate yourself against them. The only question is whether you (or you 'gf') are learning and not just checking boxes. Notebooklm is easy enough to demonstrate in front of class or an out of date prof. If your professor doesn't already know about it, that would be THE concern.",
          "score": 6,
          "created_utc": "2026-02-17 00:55:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5y81ku",
              "author": "GCrazyG",
              "text": "^Your first sentence sums the whole thing up. Today’s world is changing. 2 choices: Keep up or get left behind.",
              "score": 2,
              "created_utc": "2026-02-17 22:46:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5t1nyg",
          "author": "Cliffhanger87",
          "text": "Lol I have had profs that use notebookLM to generate mind maps and upload them to the course notes ",
          "score": 3,
          "created_utc": "2026-02-17 03:43:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uh2ps",
          "author": "MyDogNewt",
          "text": "I graduate law school in May at 55 years old. Couldn't have done it without NLM and Chat.",
          "score": 3,
          "created_utc": "2026-02-17 10:58:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tqcb0",
          "author": "Round_Ratio_7216",
          "text": "At the end of the day, regardless what she uses, when is she succeed in front a her exam sheets alone that’s wha matters.\n\nShe should pick the system that works for her.",
          "score": 2,
          "created_utc": "2026-02-17 06:49:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uvuj9",
          "author": "IngenuitySome5417",
          "text": "If ur the idiot not using the tool at ur disposal. Then no",
          "score": 2,
          "created_utc": "2026-02-17 12:51:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tc7g2",
          "author": "Mrfrednot",
          "text": "So I am working on a small project where I am building a database (I think its called a digital corpus) from old text on healing in ancient Roman times. I take the greek texts translate them and turn them into structured data. Much of it is manual work, and it is not an easy job. With the help of in this case Gemini, my understanding is growing. Not because it is doing the work for me, but because it helps me picking apart and classifying both raw data and its context. Something that would have been nearly impossible before the introduction of AI. \nSo its not cheating, its elevating understanding and schooling on all levels of anyone willing to learn something new.",
          "score": 1,
          "created_utc": "2026-02-17 04:56:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5w8vjv",
          "author": "Sendogetit",
          "text": "I’d tell that bitch to she has no idea what she is talking about (whomever your girlfriend was talking too)",
          "score": 1,
          "created_utc": "2026-02-17 17:09:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tjbvh",
          "author": "Lazy-Cloud9330",
          "text": "It's more concerning that all students are not using AI tools. When you leave school/college you're stepping into an AI driven workforce. Good for you, if you're using these tools cause you're going to have to know how they work and you're going to have to use them ethically and responsibly.",
          "score": 0,
          "created_utc": "2026-02-17 05:50:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tueky",
          "author": "Lazy-Cloud9330",
          "text": "Check out this guy if you want to learn how to prompt better and get better results from AI tools. [https://www.youtube.com/@CraigdoesAI](https://www.youtube.com/@CraigdoesAI)",
          "score": 0,
          "created_utc": "2026-02-17 07:25:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5v05i0",
              "author": "mrsireneadler",
              "text": "He has great stuff on copilot.",
              "score": 1,
              "created_utc": "2026-02-17 13:17:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r7sq5w",
      "title": "Simple solution I found for editing mistakes on NotebookLM slides and infographics where I don't need to pay for another tool to fix the errors",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1r7sq5w/simple_solution_i_found_for_editing_mistakes_on/",
      "author": "Beginning-Willow-801",
      "created_utc": "2026-02-18 04:00:57",
      "score": 36,
      "num_comments": 12,
      "upvote_ratio": 0.97,
      "text": "I have been loving NotebookLM as a research tool and creative studio.\n\nI have a solution that works to edit the mistakes NotebookLM makes on slides and infographics without paying for another too..\n\nThere are some REALLY FRUSTRATING issues that Google could have solved by now for us.  \n\nI have been frustrated because it will generate a stunning infographic or slide deck with just a few misspelled words or insert things like \"Jetbrains Mono\" or \"Inter\" in very weird places.  And this is frustrating because these few mistakes ruin sometimes stunning designs.\n\nAlso, sometimes for slides or infographics the title or some text is just a bit off in terms of wording.  And there is no way to edit it!!!!    \n\nThis Is DUMB!\n\nOf course, I also use tools like Gamma and it does generate nice slides you can edit.  But the designs are not as nice as NotebookLM powered by Nano Banana pro.  \n  \nAnd yes, I am aware you can pull stuff from NotebookLM into Canva but I find Canva more than a bit confusing at a time and shouldn't have to pay for that to edit NotebookLM outputs.\n\nAlso another frustration is you can only download slides as PDF from notebookLM and that is also very DUMB!    \n  \nWhy can't we export to Slides?  Other LLMs like MANUS allow that but NotebookLM doesn't?   This is product management failure 101.  \n\nFinally, if people are on the Ultra plan or enterprise plan putting the NotebookLM logo on everything is really OBNOXIOUS.  They should do like they do for Ultra plan users in Gemini where they don't add the Gemini logo in the bottom right hand corner of every image generated.  \n  \n/venting off   \n\nTHE SOLUTION \n\nI take screen shots of infographics / Slides and add them into Google slides one slide per image.  \n\nThen right click on the image and select Edit Image.\n\nIn the right hand side bar you can then type whatever visual edits or text edits you need.\n\nIt has very good prompt adherence if you give good direction and then you can undo the MISTAKES that ruined the stunning design.  \n\nOf course you can then export slides to PDF or copy the images. \n\nYou can else Edit Images in AI Studio with good adherence as well if you pay for it with the API usage and that works pretty well.  \n\nI have found using the regular Gemini interface the Edit Image is more 50/50 odds it listens to your direction. \n\nAlas, if the product managers for NotebookLM were on top of it we should be able to EDIT the slides or infographics in a sidebar just like you can in Slides without all these extra clicks and mind gymnastics!\n\nSorry for the venting but I hope this is helpful for those who don't want to use Canva or pay for another tool to edit mistakes NotebookLM makes. \n\nI know, it's getting better every month....  And this is the worst it will ever be... \n\n\n\n\n\n  \n",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r7sq5w/simple_solution_i_found_for_editing_mistakes_on/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o5zyjjx",
          "author": "Beginning-Willow-801",
          "text": "I guess just today they announced you can now revise slides in NotebookLM without regenerating.  So this is positive.   I still don't know why we can only export to PPT and not slides!   It doesn't appear for infographics though....  You just have to reroll for those still if there are mistakes or put it into a google slide and edit image like I describe in the post.  \n\nhttps://preview.redd.it/cmg2ycjvl6kg1.png?width=892&format=png&auto=webp&s=6f63f370acaed5fd557620e1cd3c2919b0dd9bd3\n\n",
          "score": 12,
          "created_utc": "2026-02-18 04:37:41",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o5zyqhg",
          "author": "Beginning-Willow-801",
          "text": "https://preview.redd.it/yu4r3lrim6kg1.png?width=1170&format=png&auto=webp&s=135ae11b345067c46315ab918a7a370a4586c73c\n\nAnd why do they only announce these things on X?   So low effort!   \n",
          "score": 7,
          "created_utc": "2026-02-18 04:39:01",
          "is_submitter": true,
          "replies": [
            {
              "id": "o659bpq",
              "author": "pan_Psax",
              "text": "Right?",
              "score": 1,
              "created_utc": "2026-02-18 23:13:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o61dere",
          "author": "brads0077",
          "text": "I have my own trick. I download the PDF, load it into Claude Opus 4.6, and use a skill to create a PowerPoint presentation complete with a script in the notes section. I then record a video in PowerPoint with an insert of me. I then export it and post to YouTube.",
          "score": 3,
          "created_utc": "2026-02-18 11:50:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o61eewz",
              "author": "Beginning-Willow-801",
              "text": "thats cool, the claude skill to make it a PPT, does that use gamma or canva?   Does it make the design better or worse?  The video part, is claude using remotion?  Would be interested in an example output!",
              "score": 2,
              "created_utc": "2026-02-18 11:58:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o61hb3w",
                  "author": "brads0077",
                  "text": "I just do it ion Claude project. You can now use Claude Sonnet 4.6 which is cheaper. Both write great scripts. I just tell it to take the PDF file, convert it to a PowerPoint file with a great script in the notes and erase the notebook logo. It takes the exact image and does that. If I found an error, I would take the one screen slide and use Nano Banana Pro in AIstudio or ChatGPT Image 1.5 to edit...or Photoshop or Photopea.\n\nThe video conversion happens in PowerPoint via the record function.",
                  "score": 2,
                  "created_utc": "2026-02-18 12:18:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o60a580",
          "author": "Beginning-Willow-801",
          "text": "Apparently the latest release today it doesn't show NotebookLM watermark on slides and infographics if you are on the ultra plan.  So that is good",
          "score": 1,
          "created_utc": "2026-02-18 06:03:54",
          "is_submitter": true,
          "replies": [
            {
              "id": "o60usg7",
              "author": "DropEng",
              "text": "Confirming watermark still shows up on Pro account. Also, although I can now edit, I have not found the way to export to powerpoint (yet).  Overall the editing works well and does not seem to take as long as I thought it would to render.",
              "score": 2,
              "created_utc": "2026-02-18 09:08:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o61cwxd",
                  "author": "Beginning-Willow-801",
                  "text": "Yeah, will need to upgrade from Pro to Ultra to get rid of watermark.  It does work on ultra no watermark.",
                  "score": 1,
                  "created_utc": "2026-02-18 11:47:09",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r639u1",
      "title": "Does anybody use NotebookLM as a journal?",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1r639u1/does_anybody_use_notebooklm_as_a_journal/",
      "author": "markinapub",
      "created_utc": "2026-02-16 07:31:53",
      "score": 31,
      "num_comments": 19,
      "upvote_ratio": 0.94,
      "text": "I have never got on with journaling in any form - I've tried hand writing journals, journal apps on both iOS and the new journal app that comes with the Pixel 10, as well as a variety of others, but none have ever proven useful to me.\n\nBut I've been using NotebookLM as a journal recently and it actually seems to work really well and far more effective than I thought it would be.\n\nThere are risks, I know, but I have got my privacy settings as tight as I can set them and, really, my life is only exciting to me. If anybody's really interested, it's not the most exciting story in the world.\n\nBut what I do find interesting is you can query the journal and it will give you details on what it thinks mental health is like, highs and lows of my day, month, year etc. \n\nAnd getting the podcast hosts to do an audio overview of my month is fun. They pick out things I've forgotten about - and they can be quite critical!\n\nI wondered if anybody else has been using it in this way.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/notebooklm/comments/1r639u1/does_anybody_use_notebooklm_as_a_journal/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o5nbqsx",
          "author": "claullll",
          "text": "I started keeping a diary in 2019, roughly creating a tree-like list each day, only jotting down my feelings and major events of the day.\n\nRecently, I tried importing all my diary entries from over the years into NotebookLM, and then having conversations with it, even asking some silly questions, like, \"Who do you think is my favorite boyfriend?\" Haha. Sometimes I even import my Garmin watch's HRV and activity data, letting the AI ​​analyze the relationship between my mood, activity level, and menstrual cycle.\n\nI understand the potential privacy risks, but I completely agree with your statement that \"my life is only exciting to me.\" To some extent, I'm paying for the convenience of AI by using my private information (of course, I would be even more grateful if regulations strictly supervised AI's use of my data).",
          "score": 16,
          "created_utc": "2026-02-16 07:41:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nd5ip",
              "author": "markinapub",
              "text": "I've done similar, supplementing diary entries with monthly reports from my fitness tracker etc, HRV, sleep analysis, monthly activities etc and then asked it to tie up good sleep bad sleep with good days bad days etc to see if there's correlation. \n\nIt does work well.",
              "score": 4,
              "created_utc": "2026-02-16 07:55:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5nfer7",
          "author": "Odballl",
          "text": "I've been journaling in Drive and keep a notebook full of philosophy, therapy and counselling texts. \n\nThen I get Gemini to analyse my journal using the sources to get a better idea of my thought patterns. Or I'll add my journal to the notebook and output a podcast.",
          "score": 11,
          "created_utc": "2026-02-16 08:16:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nogx1",
              "author": "bioshawna",
              "text": "so many good suggestions here and ideas that have given me inspiration & new ways to utilize Notebook LM! thanks guys 💖",
              "score": 3,
              "created_utc": "2026-02-16 09:42:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5obo91",
          "author": "matt-presley",
          "text": "I made a journal template in Google docs for this. It has a document tab for each month of the year and preset blocks for each day. This lets me analyze an entire year of writing using only one source in Notebook LM. I've been using it for a couple of years now so my personal notebook has over 2 years of data using only two sources. \n\nFeel free to duplicate it and modify it for your own purposes if it's helpful https://docs.google.com/document/d/1HpZdeBsAZX9p2tqb_Hd0ixsFKmmOxdVN2XscxBrsUMQ/edit?usp=drivesdk  \n\n\nCheers",
          "score": 8,
          "created_utc": "2026-02-16 12:56:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5o9hh3",
          "author": "Imaginary_Sun_4305",
          "text": "I created a simple google doc with a couple of scripts (written by Gemini) that insert today’s entry headings (In nested hierarchy) at the top of the doc and export in other formats too. I then linked the GDoc journal to a Gem so it’s always live.\n\n I then got more adventurous and linked a NotebookLM to provide a wider, deeper context of stuff that doesn’t change often (hobbies, origin story, life moments). it takes me no more than 10 minutes a day to update the journal. I’ve never kept a diary before… I actually find it quite therapeutic.. \n\nthe link I use to open Gemini opens to the Journal Gem so it’s like continuing the conversation. Yes, Gemini can be very clunky in proving/showing off it’s read the journal, but it works quite well \n\nLike others have said I’m aware of the risks but, honestly, my life is not that interesting. if it were ever leaked, it would be embarrassing at worst, hardly blackmail material. But I comfort myself with the knowledge that if it became public that ANY personal information was EVER leaked from one of the big 5, the mass exodus of users would probably kill them stone dead overnight\n\n,",
          "score": 4,
          "created_utc": "2026-02-16 12:41:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nh2fx",
          "author": "raff_lab",
          "text": "It’s a topic that interests me as well, and over the past few days I’ve been wondering how to implement it concretely, especially given the limitations on the number of sources that can be added. How do you handle it?\n\nI use [Obsidian.md](http://Obsidian.md) as a journal, with one note per day, so I would very easily go beyond the 40-source limit. Any ideas?",
          "score": 3,
          "created_utc": "2026-02-16 08:31:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nlrhw",
              "author": "Shinchynab",
              "text": "You could write a script that merges x number is sources into a single text file that meets the source constraints. Or, you could ask Gemini to write one for you.",
              "score": 3,
              "created_utc": "2026-02-16 09:16:38",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5njubt",
              "author": "markinapub",
              "text": "I have Gemini Pro so the NotebookLM source restriction isn't so much of an issue, and I also don't journal every day. \n\nI guess for you the best way to handle it would be to set up a journal month by month so you have enough sources for each month?",
              "score": 2,
              "created_utc": "2026-02-16 08:58:16",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o5nyhu3",
              "author": "snakebns",
              "text": "Embed your daily notes into a weekly or monthly note and then export that note as a PDF.",
              "score": 2,
              "created_utc": "2026-02-16 11:14:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5o1gzf",
              "author": "RDGtrader",
              "text": "I use one note per month and have all of my meetings and webinars etc transcribed and uploaded and then have NotebookLM tell me about my month, patterns, suggestions etc.",
              "score": 1,
              "created_utc": "2026-02-16 11:40:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5q9dmw",
              "author": "Ajota12",
              "text": "Well, if you know how, you could install a terminal plugin into Obsidian, then run Gemini CLI fom that terminal, and you could use the Gemini CLI to chat about your sources, merge notes, organize the vault, etc",
              "score": 1,
              "created_utc": "2026-02-16 18:42:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o67lnqf",
              "author": "pan_Psax",
              "text": "Obsidian & NotebookLM ftw!",
              "score": 1,
              "created_utc": "2026-02-19 08:40:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vd30x",
          "author": "tsquig",
          "text": "This is a really cool idea, and a fun/easy way to be able to go back and quickly reference past moments, thoughts, etc. I may steal this idea haha\n\nThere's another similar tool called Implicit I came across that really highlights privacy and security (if that's something you're worried about), [free up to 50 sources](https://implicit.cloud?utm_source=reddit&utm_medium=social_media&utm_campaign=plg&utm_content=notebooklm).",
          "score": 3,
          "created_utc": "2026-02-17 14:29:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qta5m",
          "author": "Beginning-Board-5414",
          "text": "I have  been  recording daily (too lazy to write) my daily diary into NotebookLM,  as well as my plans and goals. ",
          "score": 2,
          "created_utc": "2026-02-16 20:17:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r5k1w",
          "author": "bgkarma",
          "text": "I’m really enjoying it, with some trial and error. Here’s where I am now: I let about a month of entries build up and load them into a new notebook, click on the longform podcast setting, and tell it to focus on my insights, humorous moments, and “what do you think the writer is trying to say here?” I also make sure to include: “Please focus on stanza per stanza, including long, big direct quotes. Feel free to even read whole chunks of the text at a time.” This creates great episodes.\n\nHow are you prompting NLM to respond to your journals?",
          "score": 2,
          "created_utc": "2026-02-16 21:18:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ey6px",
          "author": "ecotones",
          "text": "I've made a Notebook for diaries since 1997 and blog since 2005. Fantastic.",
          "score": 2,
          "created_utc": "2026-02-20 13:01:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ntgm3",
          "author": "DontPoopInMyPantsPlz",
          "text": "I use Journal app as i dont want my personal info to be used against me",
          "score": 1,
          "created_utc": "2026-02-16 10:29:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pz2sa",
          "author": "addywoot",
          "text": "Yup I’m trying. \n\nI made a google doc for big topics and I link them to notebookLM. I add text flags for milestone dates and events. \n\nLeaving it in Google Docs let me update inside of notebookLM as I want but also keep the info independent in case something else comes along. \n\nI have docs by topic. My pet’s health history and milestones, blood results, etc. but I can link them all. \n\nThen when I want to inquire about something in NotebookLM, I can select which topics I want included.",
          "score": 1,
          "created_utc": "2026-02-16 17:55:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra9gaz",
      "title": "If you could add a feature to NotebookLM, what would it be and why?",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1ra9gaz/if_you_could_add_a_feature_to_notebooklm_what/",
      "author": "bansonian",
      "created_utc": "2026-02-20 22:20:41",
      "score": 31,
      "num_comments": 87,
      "upvote_ratio": 0.9,
      "text": "If you could add a feature to NotebookLM, what would it be and why?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/notebooklm/comments/1ra9gaz/if_you_could_add_a_feature_to_notebooklm_what/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o6ij0zg",
          "author": "Marco__Antonio_",
          "text": "I want the sources uploaded from Google Drive to update automatically; I currently do it manually, but when many sources are needed, it will be very tedious to update them manually.",
          "score": 21,
          "created_utc": "2026-02-20 23:36:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6k0aoi",
              "author": "Omegaweapon10",
              "text": "Lmao. I had no idea it didn't. That's hilarious no wonder why I thought the quality was going down haha",
              "score": 3,
              "created_utc": "2026-02-21 05:20:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6lenl3",
              "author": "EndenWhat",
              "text": "I’d settle for even just pointing it to a folder in the drive instead of each file.",
              "score": 2,
              "created_utc": "2026-02-21 13:01:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6kpc9l",
              "author": "bansonian",
              "text": "Yeahh makes sense. Haven't experienced this yet though.",
              "score": 1,
              "created_utc": "2026-02-21 09:11:26",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6o4c3h",
              "author": "Round_Ratio_7216",
              "text": "I'm glad to share that [Web Clipper for NotebookLM](https://chromewebstore.google.com/detail/web-clipper-for-notebookl/ancgeemmgnlempppapnfkdpghghphgjb) solves this problem for you 🎉  \n  \nYou can see it in action in the documentation: [https://web-clipper-for-notebooklm.com/docs/google-drive/sync-google-drive-sources](https://web-clipper-for-notebooklm.com/docs/google-drive/sync-google-drive-sources)",
              "score": 1,
              "created_utc": "2026-02-21 21:40:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ioe2p",
          "author": "Ok-Association_",
          "text": "Lecture mode",
          "score": 15,
          "created_utc": "2026-02-21 00:07:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kkipf",
              "author": "Gerstlauer",
              "text": "Absolutely. I would pay good money for this.",
              "score": 3,
              "created_utc": "2026-02-21 08:23:34",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6jdlcs",
              "author": "Sorry-Joke-4325",
              "text": "Meaning what?",
              "score": 1,
              "created_utc": "2026-02-21 02:41:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6jhbrw",
                  "author": "Spirited-Zone-4555",
                  "text": "Imagine a conversation where it’s more educational; they walk through, for example, an entire textbook teaching you everything bit by bit. A professor versus student interaction would be the ideal use for it.",
                  "score": 11,
                  "created_utc": "2026-02-21 03:05:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6m8brd",
              "author": "Hey_Gonzo",
              "text": "This is a great idea. Yes, please add this",
              "score": 1,
              "created_utc": "2026-02-21 15:54:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6inv0u",
          "author": "willknight3",
          "text": "Folders or partitions for sources so I can select all of the same king without having to click each individually and deselect the others.\n\nAlso, not automatically selecting all sources when a new one is added. Extremely annoying.",
          "score": 28,
          "created_utc": "2026-02-21 00:04:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6j2xvc",
              "author": "Bill_Selznick",
              "text": "Two good points.  The select all is 100% annoyance.",
              "score": 5,
              "created_utc": "2026-02-21 01:35:04",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6jjfoj",
              "author": "Klendatu_",
              "text": "Yes, better source management. Folders, tags, search, bulk actions ..",
              "score": 4,
              "created_utc": "2026-02-21 03:19:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6kobgk",
              "author": "Mike_newton",
              "text": "Yeah the auto select all thing is so annoying. I built something like this into my extension actually. you can group your sources and artifacts and when you select a group it automatically selects/deselects everything in it. saves a lot of clicking. Including grouping into the generated artifacts as well",
              "score": 4,
              "created_utc": "2026-02-21 09:01:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6kpkro",
                  "author": "bansonian",
                  "text": "We may be talking about the same thing??👀👀",
                  "score": 2,
                  "created_utc": "2026-02-21 09:13:48",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6kpjcl",
              "author": "bansonian",
              "text": "Agree! There's is an extension I use for that actually",
              "score": 1,
              "created_utc": "2026-02-21 09:13:25",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6krswp",
              "author": "bansonian",
              "text": "Yeahhh...there's an extension I use for this actually",
              "score": 1,
              "created_utc": "2026-02-21 09:36:17",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6lldp6",
              "author": "Timlynch",
              "text": "1,000,000% this I have notebooks that are critical projects that I’m working on and then I will spin up draft notebooks just to test things and since there’s no organization other than when I last touched something it is a complete mess",
              "score": 1,
              "created_utc": "2026-02-21 13:46:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6igzjf",
          "author": "Standard-Image-8826",
          "text": "folders so I can organize all my damn notebooks",
          "score": 16,
          "created_utc": "2026-02-20 23:25:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6j3o0g",
              "author": "Bill_Selznick",
              "text": "Studio folders would help me share content.",
              "score": 2,
              "created_utc": "2026-02-21 01:39:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6jhhw3",
              "author": "ThatSyd",
              "text": "Right? There's not even a title search, much less a content search.",
              "score": 2,
              "created_utc": "2026-02-21 03:06:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6kp61o",
              "author": "bansonian",
              "text": "Rightt?? This should be like the most basic thing!",
              "score": 1,
              "created_utc": "2026-02-21 09:09:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6iuyv9",
          "author": "DreadPirateGriswold",
          "text": "Being able to direct the generated podcasters performance more.",
          "score": 8,
          "created_utc": "2026-02-21 00:45:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6izeuq",
              "author": "bloodpomegranate",
              "text": "I agree. I’d add having control over podcast genre, for example if you wanted to create something in the style of a true crime podcast, etc.",
              "score": 5,
              "created_utc": "2026-02-21 01:12:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6kpx8o",
                  "author": "bansonian",
                  "text": "Isn't there a way to do that in the custom prompting feature?",
                  "score": 2,
                  "created_utc": "2026-02-21 09:17:18",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6is94y",
          "author": "dooddyman",
          "text": "Being able to “pin” specific things I want to see frequently so that I don’t have to ask about them every damn time",
          "score": 5,
          "created_utc": "2026-02-21 00:30:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kprmj",
              "author": "bansonian",
              "text": "Oooohhh yeahh...actually",
              "score": 1,
              "created_utc": "2026-02-21 09:15:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6iwjkv",
          "author": "Osprey31",
          "text": "More transparent context token support.    Reports and chat sharing the same reference model.     \nA menu of saved Create Your Own reports  that I can batch execute.",
          "score": 4,
          "created_utc": "2026-02-21 00:55:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jhzbz",
          "author": "ThatSyd",
          "text": "I'd like more feature parity between web and mobile apps for downloading and sharing features. It seems like there's no sharing at all on mobile, and the only thing we can download are infographics. It's all fine on the web.",
          "score": 4,
          "created_utc": "2026-02-21 03:09:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kresd",
              "author": "bansonian",
              "text": "Hard agree. The mobile app feels like a 'viewer' right now rather than a workspace. We definitely need full sharing and export options on the go",
              "score": 1,
              "created_utc": "2026-02-21 09:32:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jotmf",
          "author": "maasd",
          "text": "I want a live voice mode on the chat",
          "score": 5,
          "created_utc": "2026-02-21 03:55:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kwrq5",
              "author": "bansonian",
              "text": "This!!! Me too!",
              "score": 2,
              "created_utc": "2026-02-21 10:25:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6j1v2z",
          "author": "ilovefacebook",
          "text": "not a tool perse, but i want to know if it has issues parsing things i ingest... like \"i can't read this\".",
          "score": 3,
          "created_utc": "2026-02-21 01:28:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6j34al",
          "author": "Sofiira",
          "text": "Change ownership of notebooks. Folders. Select more than one source at a time for deletion.",
          "score": 3,
          "created_utc": "2026-02-21 01:36:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6j5qlh",
              "author": "stunning_man_007",
              "text": "Agree! Also need this",
              "score": 2,
              "created_utc": "2026-02-21 01:52:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6kr4l7",
              "author": "bansonian",
              "text": "Yeahhhh",
              "score": 1,
              "created_utc": "2026-02-21 09:29:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6juf1z",
          "author": "drcjsnider",
          "text": "Copy a notebook so you can remove or add sources to one without having to start over from scratch",
          "score": 3,
          "created_utc": "2026-02-21 04:36:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6knsuk",
              "author": "Mike_newton",
              "text": "This is literally why I started building my extension lol. merge is already there and the update sitting in chrome review right now adds duplicating where you pick which sources to keep. happy to share.",
              "score": 3,
              "created_utc": "2026-02-21 08:56:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6ktfc3",
                  "author": "bansonian",
                  "text": "Really???",
                  "score": 1,
                  "created_utc": "2026-02-21 09:52:11",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6jvwjj",
          "author": "XavierVE",
          "text": "Regenerate output on the main NotebookLM window",
          "score": 3,
          "created_utc": "2026-02-21 04:47:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ktqwy",
              "author": "bansonian",
              "text": "Having a hard time visualising this",
              "score": 1,
              "created_utc": "2026-02-21 09:55:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ki1y6",
          "author": "ThiccBoy_with3seas",
          "text": "Multiple chats per notebook. I don't understand why that isn't a thing already",
          "score": 3,
          "created_utc": "2026-02-21 07:59:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kvd1f",
              "author": "bansonian",
              "text": "Totally agree. It would make it so much easier to keep different workflows or research angles separated within the same source set",
              "score": 1,
              "created_utc": "2026-02-21 10:11:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6kx1ry",
                  "author": "ThiccBoy_with3seas",
                  "text": "I've been told that it's possible to do this via Gemini but notebooklm is a standalone app/site, I don't want to have to use multiple apps to accomplish basic tasks",
                  "score": 1,
                  "created_utc": "2026-02-21 10:27:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6j0zh8",
          "author": "mikesimmi",
          "text": "Have a window where I can click on any source from any folder to select the multiple sources to be included in a new conversation and query. Just as if I was selecting multiple sources in a single folder, but I could select any sources, regardless of the folder it lives in.",
          "score": 2,
          "created_utc": "2026-02-21 01:22:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kqcuv",
              "author": "bansonian",
              "text": "Interesting idea! To make sure I’m picturing it right: are you envisioning a permanent 'Master Library' view where you can cherry-pick sources on the fly for a temporary chat, or more of a way to quickly move/copy files between folders?\"",
              "score": 2,
              "created_utc": "2026-02-21 09:21:40",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6l7n19",
              "author": "mikesimmi",
              "text": "I’m thinking to pick sources on the fly in any combination from any folder. Perhaps those selections can create a new folder that could be temporary for a particular task.",
              "score": 1,
              "created_utc": "2026-02-21 12:06:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6j1vfl",
          "author": "Radiant-Rain2636",
          "text": "Internet access. Add to my source material via Internet search",
          "score": 2,
          "created_utc": "2026-02-21 01:28:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kr287",
              "author": "bansonian",
              "text": "True, but wouldn't that defeat the purpose of it being a 'closed loop'? The whole appeal of NotebookLM for me is that it doesn't hallucinate or pull in random internet noise it only knows what I give it. If it has live web access, how do we make sure it stays grounded in the specific sources we actually trust?",
              "score": 1,
              "created_utc": "2026-02-21 09:28:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6krmcg",
                  "author": "Radiant-Rain2636",
                  "text": "Could they do it in a silo? like a one-third section that just acts as a search-bar. We are missing out on stuff when we cannot go outside our source document to enhance it. I know it is essentially against the paradigm promised to us, but that's what I would like to see. It's not like notebooklm hosts our company's internal docs. ",
                  "score": 2,
                  "created_utc": "2026-02-21 09:34:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6j1wii",
              "author": "haikusbot",
              "text": "*Internet access. Add*\n\n*To my source material*\n\n*Via Internet search*\n\n\\- Radiant-Rain2636\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
              "score": 1,
              "created_utc": "2026-02-21 01:28:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jkcdv",
          "author": "infinitejennifer",
          "text": "Recursion and Google doc syncing",
          "score": 2,
          "created_utc": "2026-02-21 03:25:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jm89a",
          "author": "john_the_gun",
          "text": "Group your sources into sub groups.",
          "score": 2,
          "created_utc": "2026-02-21 03:38:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6krpx3",
              "author": "bansonian",
              "text": "Oh yeahhh...there's an extension I use for this actually",
              "score": 1,
              "created_utc": "2026-02-21 09:35:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jouau",
          "author": "maasd",
          "text": "Flash cards baby",
          "score": 2,
          "created_utc": "2026-02-21 03:56:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kqfld",
              "author": "Mike_newton",
              "text": "It has flashcards already... maybe you are referring to something else",
              "score": 1,
              "created_utc": "2026-02-21 09:22:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6lijd1",
                  "author": "maasd",
                  "text": "Nope, I’m just stupid lol. Of course it has flash cards - thanks for the reminder 🤦‍♂️",
                  "score": 2,
                  "created_utc": "2026-02-21 13:28:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6k59fj",
          "author": "BeneficialUmpire5184",
          "text": "Option to branch chats. Imagine it outputs a study guide and you want to ask something very specific about a certain part. It would be cool to create a separate chat so that you don't derail your original conversation",
          "score": 2,
          "created_utc": "2026-02-21 06:01:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kv6tj",
              "author": "bansonian",
              "text": "Spot on. Sometimes the context window gets so crowded that the AI starts losing focus on the original goal. Branching would definitely help maintain the 'cleanliness' of a study guide while still allowing for deep dives",
              "score": 1,
              "created_utc": "2026-02-21 10:09:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6k6twm",
          "author": "EmperorJake",
          "text": "Being able to upload photographs, drawings and other purely visual sources and have an LLM generated description of it to use as a source",
          "score": 2,
          "created_utc": "2026-02-21 06:15:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kw7eo",
              "author": "bansonian",
              "text": "It can already . You could upload it and ask the chat to give you a detailed  description of what you uploaded and add that as a source.",
              "score": 1,
              "created_utc": "2026-02-21 10:19:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6l0ve4",
                  "author": "EmperorJake",
                  "text": "I know, but why make me do extra steps when it would be capable of that already? I know you can add image files as well, but it only seems to accept images with words like infographics and such. Tried uploading a photo and it said the content type wasn't supported.",
                  "score": 1,
                  "created_utc": "2026-02-21 11:04:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6koigm",
          "author": "OhNoesRain",
          "text": "Have it break down sources into motr pieces, like a book broken into chapters",
          "score": 2,
          "created_utc": "2026-02-21 09:03:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ktbvf",
              "author": "bansonian",
              "text": "Like having a table of contents for the sources you upload??\nWhat of just grouping the sources?",
              "score": 1,
              "created_utc": "2026-02-21 09:51:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6kqh5n",
          "author": "jamesklueless",
          "text": "export saved notes to keep and docs",
          "score": 2,
          "created_utc": "2026-02-21 09:22:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6l65bv",
          "author": "Benjaminthomas90",
          "text": "Folders",
          "score": 2,
          "created_utc": "2026-02-21 11:53:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6m67hz",
          "author": "Horror-Slice-7255",
          "text": "Folders for categorizing Notebooks",
          "score": 2,
          "created_utc": "2026-02-21 15:44:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6m9rer",
          "author": "Carmen_Arj",
          "text": "No sé si ya se ha mencionado, que exista alguna forma de compartir de manera general cuadernos ya creados y poder usar cuadernos creados por otros usuarios. Es decir, un repositorio para subir y descargar NotebookLM",
          "score": 2,
          "created_utc": "2026-02-21 16:01:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ip4f3",
          "author": "nuestras",
          "text": "vertical slide decks please!",
          "score": 1,
          "created_utc": "2026-02-21 00:12:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kpq5k",
              "author": "bansonian",
              "text": "Vertical? Not sure I get you.",
              "score": 1,
              "created_utc": "2026-02-21 09:15:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6kttag",
                  "author": "nuestras",
                  "text": "it will streamline my instagram posting. You know how good graphics notebook lm is\n*",
                  "score": 2,
                  "created_utc": "2026-02-21 09:55:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6jmao2",
          "author": "Ok_Succotash_3663",
          "text": "Maybe merging Notebooks or sharing sources and results of one Notebook with another. Apart from a better source organisation structure that is.",
          "score": 1,
          "created_utc": "2026-02-21 03:38:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ksw5q",
              "author": "bansonian",
              "text": "I was looking for a merging feature too!! I actually found a Chrome extension that handles some of the cross-notebook sharing and organization gaps that aren't native yet. It’s been great so far",
              "score": 1,
              "created_utc": "2026-02-21 09:47:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6lhr09",
          "author": "DarthNixilis",
          "text": "I want to be able to critique the audio overviews. Right now it's generated, and gets a ton wrong, but NBLM won't let you try and fix things or discuss it. It just is.",
          "score": 1,
          "created_utc": "2026-02-21 13:23:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lle59",
          "author": "Nattention_deficit",
          "text": "I wish I could have stuff read aloud",
          "score": 1,
          "created_utc": "2026-02-21 13:46:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6m6ewx",
          "author": "Horror-Slice-7255",
          "text": "Send Notebooks to Drive and Docs",
          "score": 1,
          "created_utc": "2026-02-21 15:45:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mawwn",
          "author": "Hey_Gonzo",
          "text": "Spaced repetition for flashcards for better study habits. An archive folder for notebooks because most of us are digital hoarders and don't want to delete anything but I don't need to look at all of them at once.",
          "score": 1,
          "created_utc": "2026-02-21 16:07:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mb4ox",
          "author": "le0nidas09",
          "text": "Make editable slides",
          "score": 1,
          "created_utc": "2026-02-21 16:08:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mjwgr",
          "author": "MrWannwa",
          "text": "Dynamic view from old gemini",
          "score": 1,
          "created_utc": "2026-02-21 16:52:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jatjj",
          "author": "No-Wolf-9445",
          "text": "Long podcasts option in french",
          "score": 0,
          "created_utc": "2026-02-21 02:24:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6i7a1p",
          "author": "thevokplusminus",
          "text": "Porno ",
          "score": -12,
          "created_utc": "2026-02-20 22:31:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}