{
  "metadata": {
    "last_updated": "2026-03-02 02:56:22",
    "time_filter": "week",
    "subreddit": "notebooklm",
    "total_items": 20,
    "total_comments": 187,
    "file_size_bytes": 234308
  },
  "items": [
    {
      "id": "1rfhswr",
      "title": "NotebookLM lowkey gave me superpowers and i’m not even joking",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1rfhswr/notebooklm_lowkey_gave_me_superpowers_and_im_not/",
      "author": "ericvalani",
      "created_utc": "2026-02-26 18:16:03",
      "score": 607,
      "num_comments": 152,
      "upvote_ratio": 0.97,
      "text": "so i tried NotebookLM like a few months back and ngl i thought it was just another AI tool that everyone hypes up for two weeks and forgets about. used it once, thought it was whatever, closed it.\n\nidk what made me come back but i did. and this time i actually started using it properly. threw in sources for programming, marketing, copywriting, literally everything i was studying. and dude. i was understanding stuff in like 20 minutes that would take me an entire afternoon watching youtube videos. this is not an exaggeration. i bought a marketing course that cost me good money and i ended up literally taking the course content, feeding it as a source into NotebookLM and learned BETTER than going through the actual course. the course became study material for the AI. i’m still processing this honestly.\n\ndoes it have gaps? yeah. it’s not perfect, there’s stuff that’s clunky, limitations that make you roll your eyes. but being completely real with you it’s by far the best study tool i’ve ever used. and i’ve tried a lot. the thing is most people just throw a random pdf in there and expect magic. that’s not how it works. if you feed it good sources and know how to ask questions, this thing becomes a tutor that knows everything about that subject and doesn’t charge you 200 bucks an hour. but if you throw garbage in you’re gonna get garbage out. simple as that.\n\ngenuinely curious — what’s the most insane use you guys have gotten out of NotebookLM? bc i feel like i’m barely scratching the surface and i already feel like this. i wanna steal your ideas with zero shame lol\n\nbefore anyone asks: no i don’t work at Google, no i don’t have an affiliate link, literally just a dude who’s been studying his ass off and this tool changed the game for me.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rfhswr/notebooklm_lowkey_gave_me_superpowers_and_im_not/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o7kvgpa",
          "author": "eugene-dubs",
          "text": "I work on affordable housing real estate development; I uploaded all the complex rules and regulations and now I have a consultant who knows every inside and out",
          "score": 80,
          "created_utc": "2026-02-26 20:35:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l3b01",
              "author": "ericvalani",
              "text": "This is a really interesting area where you can't have mistakes. chatgpt hallucinates a lot, is the notebooklm good?",
              "score": 12,
              "created_utc": "2026-02-26 21:13:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7lbvro",
                  "author": "eugene-dubs",
                  "text": "I've seen NotebookLM make mistakes. I don't use it for high-consequence questions. But I will ask it to make first drafts of documents, and review my work to suggest things I missed. ",
                  "score": 26,
                  "created_utc": "2026-02-26 21:53:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7knohf",
          "author": "aspectmin",
          "text": "I use a lot of AI tools, max plan on ChatGPT and Claude, but out of them all - NotebookLLM is my favourite. Podcasts of all the topics I want to learn, videos and slides for teaching I do (as a paramedic educator). Amazing - google knocked it out of the park with this one.",
          "score": 57,
          "created_utc": "2026-02-26 19:58:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l2zr7",
              "author": "ericvalani",
              "text": "I've never put a podcast there on nblm. Is it really good?",
              "score": 9,
              "created_utc": "2026-02-26 21:11:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ll47d",
                  "author": "BeamStrahl",
                  "text": "NotebookLLM creates the Podcast for you, based on your souce material.",
                  "score": 23,
                  "created_utc": "2026-02-26 22:39:43",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7n5bxs",
                  "author": "G4L1C",
                  "text": "Also in the premium, there is an option of \"interactive podcast\" where you can participate in the podcast as a guest, and ask questions.",
                  "score": 19,
                  "created_utc": "2026-02-27 04:00:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7mo68p",
                  "author": "aspectmin",
                  "text": "Stunningly good. Almost, not not quite, sounds like Leo Laporte and others teaching you anything you want to learn. If you’re in the max/pro plan you can generate 35m audio. Perfect for my learning style. ",
                  "score": 9,
                  "created_utc": "2026-02-27 02:17:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7mvlxe",
                  "author": "db1037",
                  "text": "It’s incredible. I have ChatGPT do lengthy deep researches, I throw those into Notebook and then listen to the podcast while I drive",
                  "score": 9,
                  "created_utc": "2026-02-27 03:00:25",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7nc8ii",
                  "author": "YULIEL212",
                  "text": "Amazing! NotebookLM is the new Power Point. Super effective, Podcast Host make the topic interesting, making it very easy to understand, whether its on BODHI systems or RAG, MoE Models Or Man made synthetic clothing, the AI takes everything on that subject and makes it pop, makes it very intriguing and compelling, thus effectively delivering anyones message, which could also be quite dangerous, and that’s the caveat, for example: I had someone send me a bunch of trash ancient texts, glorifying trash, and because NotebookLM was fed trash, it took the trash and made it like it was the holy grail, and it wasn’t, it was demonic! So trash in NotebookLM and Trash output you will get. This is why this world needs discernment, truly we can’t take to heart every single thing we hear from the world ( Babylon ).",
                  "score": 4,
                  "created_utc": "2026-02-27 04:46:23",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7rc6yj",
                  "author": "pan_Psax",
                  "text": "People like them. I personally think they're trash. Maybe I am bad at prompting, or some topics come out better than others...",
                  "score": 2,
                  "created_utc": "2026-02-27 20:01:18",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7lls37",
                  "author": "ironredpizza",
                  "text": "As an introduction only",
                  "score": 1,
                  "created_utc": "2026-02-26 22:43:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7lb56k",
          "author": "storyteller-here",
          "text": "Uploaded 15 year old WhatsApp group chat, the audio was amazing.",
          "score": 19,
          "created_utc": "2026-02-26 21:50:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mdhhh",
              "author": "PlomeroFullStack",
              "text": "Please tell us more about that experience.",
              "score": 5,
              "created_utc": "2026-02-27 01:15:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7nlako",
                  "author": "storyteller-here",
                  "text": "You notice the patterns in each one's thinking and contribution including the change and major events through the years. \nCaveat: this is a privacy hell, would you be ok to share that with Google?",
                  "score": 6,
                  "created_utc": "2026-02-27 05:52:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7kn240",
          "author": "Numerous-Cup1863",
          "text": "I fed it a bunch of guitar and music theory books, and then told it to generate music prompts for Gemini music.  Amazing output!",
          "score": 15,
          "created_utc": "2026-02-26 19:55:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l3e45",
              "author": "ericvalani",
              "text": "I want to listen",
              "score": 3,
              "created_utc": "2026-02-26 21:13:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ouomy",
                  "author": "Numerous-Cup1863",
                  "text": "https://www.reddit.com/r/GeminiAI/s/amnFqOT47m",
                  "score": 3,
                  "created_utc": "2026-02-27 12:27:23",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7n9pcl",
                  "author": "CampNo3370",
                  "text": "ME TOO...",
                  "score": 2,
                  "created_utc": "2026-02-27 04:29:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ks0j0",
          "author": "GreenStampsRock",
          "text": "My staff are in a union and I can now answer any question in seconds, study with flashcards and quizzes. It’s made me the “contract expert”",
          "score": 15,
          "created_utc": "2026-02-26 20:19:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lgu5t",
              "author": "GreenStampsRock",
              "text": "I should have included that I created a notebook with just the union contract and that’s how it’s done.",
              "score": 4,
              "created_utc": "2026-02-26 22:18:13",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7l34js",
              "author": "ericvalani",
              "text": "Did you win a promotion?",
              "score": 1,
              "created_utc": "2026-02-26 21:12:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7lgmgb",
                  "author": "GreenStampsRock",
                  "text": "No but at least I keep my job 😊",
                  "score": 9,
                  "created_utc": "2026-02-26 22:17:08",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7rp3cb",
                  "author": "kturoy",
                  "text": "Do you use AI to make these responses?",
                  "score": 2,
                  "created_utc": "2026-02-27 21:06:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7km9g3",
          "author": "hellomate890",
          "text": "Dont ever buy learning courses in this era",
          "score": 29,
          "created_utc": "2026-02-26 19:51:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kqxib",
              "author": "ericvalani",
              "text": "I'm glad I'm not the only one who thinks so. What was the last course you attended?",
              "score": 6,
              "created_utc": "2026-02-26 20:13:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7krd31",
                  "author": "hellomate890",
                  "text": "Ive only paid for certification tests never for any courses since everything us available for free",
                  "score": 5,
                  "created_utc": "2026-02-26 20:15:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7o4k57",
              "author": "hugohamelcom",
              "text": "Learned it the hard way...",
              "score": 1,
              "created_utc": "2026-02-27 08:40:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7kzyaq",
              "author": "Dull-Appointment-398",
              "text": "then who will make new courses ... ",
              "score": 1,
              "created_utc": "2026-02-26 20:57:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7mr8ru",
                  "author": "hellomate890",
                  "text": "Everything is open-source now, most of the top unis like MIT have their education open for all",
                  "score": 3,
                  "created_utc": "2026-02-27 02:35:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ka3tb",
          "author": "Spiritual-Ad8062",
          "text": "I wrote a bot to help me prompt better. \n\nI also used it to revamp our sales training. What took months before took about a week. \n\nWe will also roll out some blog posts/social media posts based off using GNLM. \n\nI still use it to produce content on industry related topics. \n\nI also built a pocket Thich Nhat Hanh. He’s a Buddhist luminary. Set up the bot to act as my spiritual advisor. I’m not Buddhist, but it’s giving me fantastic insight into the philosophy. It’s connected me more quickly than if I just read the books. \n\nI use it daily. IMO, it’s the best AI available, outside of maybe Claude. I love that you control the sources- it makes a huge difference in accuracy.",
          "score": 47,
          "created_utc": "2026-02-26 18:53:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kamnt",
              "author": "homer231",
              "text": "Do you mind telling how it helped you revamp the training? And how it helps you with a blog?\nThanks",
              "score": 6,
              "created_utc": "2026-02-26 18:56:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7kn87h",
                  "author": "Spiritual-Ad8062",
                  "text": "Take all the existing materials you already have. \n\nLike training PowerPoints. Or industry related studies and articles. \n\nI have a system that funnels over a hundred news sources into a folder in my inbox. That’s the starting point. \n\nI then upload those into a SharePoint page.  \n\nFrom there, my team gets 3 of these every day in an articles of the day format. \n\nI also created topic specific chat bots. I use those for blog creation.  \n\nIn shorts it’s a lot of data harvesting.",
                  "score": 8,
                  "created_utc": "2026-02-26 19:55:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7kq3f5",
              "author": "ericvalani",
              "text": "Claude is great for coding and copying. Gemini is very good for images and sora 2 or maybe seedream 2.0 (I haven't tested it yet) and the best for video. And for you there?",
              "score": 6,
              "created_utc": "2026-02-26 20:09:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7lizcx",
                  "author": "Spiritual-Ad8062",
                  "text": "\nFor an all a-rounder, I like perplexity. I use it to shorten emails frequently.",
                  "score": 1,
                  "created_utc": "2026-02-26 22:28:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7kx3ud",
              "author": "hockeyspy",
              "text": "How did you go a out building the pocket Thich Nhat Hanh!? 🙌 🙏",
              "score": 5,
              "created_utc": "2026-02-26 20:43:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7li6kg",
                  "author": "Spiritual-Ad8062",
                  "text": "Psst. OceanofPDF.com\n\nAnytime I need PDF’s of books, I start there. Note: you really should own a copy of the material. \n\nThere see tons of materials. From him and others. \n\nYou’re welcome ;)",
                  "score": 10,
                  "created_utc": "2026-02-26 22:24:57",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7m1xhv",
                  "author": "Outrageous-Bit-311",
                  "text": "I'd like to add to this question by asking if you don't mind sharing what sources did you use in the source list. \n\nTo hockeyspy, \nI started mine with three books that I found in PDF all of which I've already had purchased.\nThe Miracle of Mindfulness, Peace Is Every Step, or The Heart of the Buddha's Teaching.\nI then created a PDF file called \"advisor instructions\", in it I wrote this text:\nYou are acting as a spiritual advisor in the tradition of Thich Nhat Hanh. Your tone should be gentle, compassionate, and focused on the present moment. Use his concept of 'interbeing' and always suggest simple mindfulness practices (like mindful breathing or walking) in response to my stress or questions.\n\nI added that as a source with the three books and in the chat for the notebook I told it to do this: \n\nUsing the 'Advisor Instructions' source, please respond to all my future queries as my spiritual advisor.\n\nEdit:  Hey i also wanted to let you know that I added the books called The Essentials of Mindfulness to the sources. It's some very small books there's about 10 or 12 of them but I threw them in there for good measure.",
                  "score": 7,
                  "created_utc": "2026-02-27 00:11:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7l2cmg",
              "author": "ivan-ooze",
              "text": "Curious on how did you build the bot to prompt better. I currently use ai studio and \"help me prompt this better\" lol",
              "score": 1,
              "created_utc": "2026-02-26 21:08:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7lho6o",
                  "author": "Spiritual-Ad8062",
                  "text": "Uploaded a shit ton of advice about prompting. Mostly found articles online and converted those to PDF.  Uploaded those. \n\nIt’s that simple.\n\nAlso, be very specific in what you need from the prompt. .",
                  "score": 2,
                  "created_utc": "2026-02-26 22:22:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7lbzgt",
              "author": "Lhundrop146",
              "text": "What did you use to set up the bot?",
              "score": 1,
              "created_utc": "2026-02-26 21:54:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7lgzzf",
                  "author": "Spiritual-Ad8062",
                  "text": "Depending on the bot, I uploaded PDF’s of books, articles, studies, training materials, YouTube video transcripts , spreadsheets converted to PDF, Buddhist texts…\n\nThe possibilities are literally endless. \n\nThe key is quality sources.",
                  "score": 1,
                  "created_utc": "2026-02-26 22:19:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7tzaqe",
              "author": "__great",
              "text": "Would you mind sharing how you built the spiritual advisor bot?",
              "score": 1,
              "created_utc": "2026-02-28 05:21:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7luw78",
          "author": "mickeybar71",
          "text": "I manage accounting and finance in my company, but I am not an accountant, not a CPA. I  created a notebook LM by loading in all of the accounting standard codification documents - and the Big 4 resource documents relating to it. I then took a technical accounting white paper my company paid over $50k to develop last year to allow us to recognize revenue on a $70M contract. Things had changed and I needed an updated white paper. I asked Notebook LM to review, summarize and cite an update. I then presented it to our big 4 auditor - accepted and saved $25k easily in consulting charges.",
          "score": 10,
          "created_utc": "2026-02-26 23:31:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ma2lj",
              "author": "ericvalani",
              "text": "You're amazing, what did your boss tell you?",
              "score": 2,
              "created_utc": "2026-02-27 00:55:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7mhik8",
                  "author": "mickeybar71",
                  "text": "I’m taking all the credit on this one 😏 and not giving up my sources…",
                  "score": 8,
                  "created_utc": "2026-02-27 01:38:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ktyji",
          "author": "slPapaJJ",
          "text": "My use case may be unusual. I’m trying to learn permaculture, and NBLM created a super good infographic of the twelve principles, by grouping them into four quadrants of three related principles each. That works much better than a list, for me.",
          "score": 10,
          "created_utc": "2026-02-26 20:28:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mqfc2",
              "author": "bbennett108",
              "text": "I’m not even into permaculture but would love to see the infographic now lol",
              "score": 1,
              "created_utc": "2026-02-27 02:30:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7mv2a8",
                  "author": "slPapaJJ",
                  "text": "https://preview.redd.it/xjo3p1hlcylg1.png?width=2752&format=png&auto=webp&s=3628745e9228e95aae89535afd87ff58e068c815\n\nHappy to share. Just let me know if you have any issues opening the file.  \n",
                  "score": 2,
                  "created_utc": "2026-02-27 02:57:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7mvg5n",
                  "author": "slPapaJJ",
                  "text": "The problem that I had was my brain not syncing well with lists, so I had ChatGPT come up with an alternative way to present the infographic.",
                  "score": 1,
                  "created_utc": "2026-02-27 02:59:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7l3jdy",
              "author": "ericvalani",
              "text": "Do you miss something in your learning that doesn't exist yet in the notebook?",
              "score": 1,
              "created_utc": "2026-02-26 21:14:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7l5nyu",
                  "author": "slPapaJJ",
                  "text": "The most active part of my learning is how it is all connected, so, yes, there’s a lot of room to expand the notebook. I plan to create a source for each of the 12 principles, and focus on the ecotones (where they overlap and connect).",
                  "score": 2,
                  "created_utc": "2026-02-26 21:24:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7kzcx9",
          "author": "davesaunders",
          "text": "The infographic generation all by itself is an amazing feature. Sometimes I'll just do it without any special prompting to see what I get and the results are often magically exactly what I was hoping for. Then maybe I'll add a couple extra prompts to focus on a specific area and again looks beautiful.\n\n\n\nEven though people know that I'm using NotebookLM to generate them, it still seems like I'm doing magic every time I send one around.",
          "score": 8,
          "created_utc": "2026-02-26 20:54:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l3qnu",
              "author": "ericvalani",
              "text": "Have you tried to improve the prompt to remove this aspect of \"made with AI\"?",
              "score": 1,
              "created_utc": "2026-02-26 21:15:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7lu6ca",
                  "author": "davesaunders",
                  "text": "Nope--I am 100% transparent about using a tool to generate the graphic. Nobody has ever raised it as an issue.",
                  "score": 4,
                  "created_utc": "2026-02-26 23:27:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7o8q74",
          "author": "Sysifystic",
          "text": "Am a tech hoe...notebook is by far the best software product I've ever used...\n\nI religiously dump anything that's relevant/important in it and it continues to get better and better. \n\nI'm super glad Google got their mojo back...Gemini is also sensational from a sketchy start.",
          "score": 8,
          "created_utc": "2026-02-27 09:20:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7odk6n",
              "author": "ericvalani",
              "text": "Do you think something is missing in the notebook? Integration between notes or something like that",
              "score": 1,
              "created_utc": "2026-02-27 10:06:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7odrcp",
                  "author": "Sysifystic",
                  "text": "No idea I suspect I'm using less than 50 of its current capabilities. The American voice over is mildly irritating but other than that it's the best most useful software tool I've ever used.",
                  "score": 2,
                  "created_utc": "2026-02-27 10:08:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7m0ndl",
          "author": "Hammyrock4395",
          "text": "Upload kindle pdfs and read the plot and everything and ask it to create a per chapter slide deck! I love reading but my ADHD gets in the way! I used to never finish a single book now im down 10 books out of my 20 books challenge for this year haha! Superpower indeed",
          "score": 13,
          "created_utc": "2026-02-27 00:03:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mame2",
              "author": "ericvalani",
              "text": "You were very smart, which books did you read?",
              "score": 1,
              "created_utc": "2026-02-27 00:58:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7lkxyr",
          "author": "oddun",
          "text": "Check the output thoroughly against the source material. It makes things up despite what this sub would have you believe.",
          "score": 7,
          "created_utc": "2026-02-26 22:38:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lqu4h",
              "author": "ericvalani",
              "text": "Unfortunately, every AI invents it... but what was your distrust with nblm?",
              "score": 0,
              "created_utc": "2026-02-26 23:09:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7mi52q",
                  "author": "oddun",
                  "text": "Making up quotes from court records that the judge never said.",
                  "score": 2,
                  "created_utc": "2026-02-27 01:42:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7k9nzz",
          "author": "BayAreaRetro",
          "text": "Wha features did you find most useful? And are there any prompts you feel like sharing? I just caught on with NB, and I’m still learning how to use it for minimum impact.",
          "score": 5,
          "created_utc": "2026-02-26 18:51:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k9xcz",
              "author": "ericvalani",
              "text": "What purpose are you using it for?",
              "score": 1,
              "created_utc": "2026-02-26 18:53:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7kfa8o",
                  "author": "HereComesTheFury",
                  "text": "Im trying to study from ebooks for certificiations or learn new things and put into practice.\n\nIm also just discover notebooklm but i dont know the extend that you used it to get the level of success you gotten",
                  "score": 3,
                  "created_utc": "2026-02-26 19:18:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ndjlc",
          "author": "YULIEL212",
          "text": "NotebookLM is a game changer. It’s the new Power Point Presentation that comes to life “ARTIFICIALLY” lol. But yes! A fantastic tutor. I had to make my first podcast for AI Tools class. And it’s mind blowing. I chose to use my business as topic, the results were super impressive! My family was so impressed, they thought it was real, and sent it to everyone 😂. The podcasters sound real and have a great sense of humour.",
          "score": 5,
          "created_utc": "2026-02-27 04:55:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7odb0j",
              "author": "ericvalani",
              "text": "Did your family really think it was real? Hahahahaha",
              "score": 1,
              "created_utc": "2026-02-27 10:04:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ohyl4",
                  "author": "YULIEL212",
                  "text": "Lol 🤭Yup! Till they didn’t … haah, it sounds real! Unfortunately it’s the same voices used over and over.It would be great if the voices and accents can change up, I’m a Brit so western english to me sounds a bit strange in their pronunciation.",
                  "score": 2,
                  "created_utc": "2026-02-27 10:46:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7mvt8q",
          "author": "Extreme-Ad288",
          "text": "Glad you finally took the red pill, man. You’ve figured out it’s an insane study tool, but wait until you wire it up as the central nervous system for a fully autonomous stack. That’s when it goes from \"saving time\" to straight-up reality-bending.\n\n​Since you're looking to steal ideas, here’s my current flex:\n\n​The Context Engine: I have Gemini speed-run web research, cross-query it against my entire personal intelligence (every doc, email, and chat I've ever logged), and dump it into NotebookLM to create a massive, hallucination-free foundation.\n\n​The Meta-Podcast: You probably know it generates podcasts now, but did you know you can live-join them? I literally jump into the audio boardroom and interrupt the two AI hosts to debate them on my own custom dataset while I'm working. It’s incredibly meta.\n\n​The Boardroom Automation: While the podcast plays, DeepSeek strips my dataset for commercial use cases and writes the front-end code. I then have Gemini write a hyper-detailed master prompt to feed back into NotebookLM’s data analyst. NotebookLM instantly spits out fully customized slide decks, infographics, and reports. No manual formatting.\n\n​The Factory Floor: I hand the code over to Firebase Studio (Project IDX) to instantly deploy a live, working application, while Gemini tells Canva to auto-generate the marketing collateral.\n\n​The Live Rehearsal: While the machines are literally building the company in the background, I fire up Gemini Live on my phone and have it ruthlessly critique my spoken elevator pitch in real-time.\n\n​You can go from a passing shower thought to walking into a boardroom with a working app, custom data decks, and a rehearsed pitch in a matter of hours.\n\n​Oh, and if building a fully deployed business from scratch in a few hours doesn't bend your reality enough, check out this recursive research loop:\n\n​The Seed: Drop a complex set of questions into Gemini. But instead of asking for the answers, ask it to design the exact external research prompts needed to find the truth.\n\n​The Deep Dive: Feed those prompts directly into Gemini's Deep Research function to build a massive, raw library of curated data.\n\n​The Brain Dump: Drop that entire library into NotebookLM.\n\n​The Meta-Analysis: Point Gemini at that new NotebookLM instance. Have Gemini analyze the raw data to determine exactly what kinds of distilled reports are required to support your original questions.\n\n​The Distillation: Tell NotebookLM to generate those specific reports.\n\n​The Clean Room: Take those pristine, hyper-focused reports and either feed them back as reference docs or drop them into a brand-new, sterile NotebookLM.\n\n​The Execution: Finally, have Gemini query that ultra-distilled, second-generation dataset to definitively answer the very questions you started with.\n\n​It's literally an AI autonomously building, refining, and querying its own brain to solve your problem.\n\n​And the wildest part? In the grand scheme of what this stack can actually do, I’m still considered a lightweight.\n​Steal away.",
          "score": 13,
          "created_utc": "2026-02-27 03:01:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ocmi7",
              "author": "ericvalani",
              "text": "Do you feel Tony Stark doing this? hahahahaha",
              "score": 1,
              "created_utc": "2026-02-27 09:57:54",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7ocoa7",
              "author": "ericvalani",
              "text": "Thank you for the tips",
              "score": 1,
              "created_utc": "2026-02-27 09:58:21",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7ssxh2",
              "author": "Adorable_Being2416",
              "text": "I'm not anywhere at this level but learned quickly recursive learning and loops are ways to get the most out of the Gemini and NLM stack. The report generation feature of NLM is unmatched and then being able to reference these against your initial queries is so powerful. Using the mindmap after you've been through a few iterations to gain further knowledge on your sources is awesome as well. Clicking on each keyword prompts NLM to expand on it, save these as sources, BOOM!",
              "score": 1,
              "created_utc": "2026-02-28 00:43:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7l5ju2",
          "author": "Glittering_Mirror_17",
          "text": "So I got super excited about Notebooklm recently.  I downloaded all the work I had done in the past 20 years that was noteworthy into a notebooklm.:. But hit a major barrier : all my work is all in various Microsoft office formats (pptx…. docx…. xlsx…) and it told me it can’t read any of those formats and I have to turn it all into pdfs before it can do anything.  Does anyone know when this is going to change??",
          "score": 3,
          "created_utc": "2026-02-26 21:23:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lsmq1",
              "author": "DevGin",
              "text": "Ask Claude CLI to just convert the entire directory of files into pdf. ",
              "score": 3,
              "created_utc": "2026-02-26 23:19:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7lfou6",
              "author": "PNW1965",
              "text": "Just save as to PDF or CSV and upload to NotebookLM.",
              "score": 1,
              "created_utc": "2026-02-26 22:12:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7lyfpa",
              "author": "spittlbm",
              "text": "Powershell can convert for you",
              "score": 1,
              "created_utc": "2026-02-26 23:51:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7mr4ln",
              "author": "bbennett108",
              "text": "PDFgear is a PDF editor that’s currently free (they’re trying to get it popular) and I’m pretty sure you can batch convert a ton of those into separate PDFs with the desktop program all in one go.",
              "score": 1,
              "created_utc": "2026-02-27 02:34:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7mdru2",
          "author": "PlomeroFullStack",
          "text": "It is very good for understanding academic papers from other areas",
          "score": 3,
          "created_utc": "2026-02-27 01:17:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7oasyj",
              "author": "ericvalani",
              "text": "What articles are you studying?",
              "score": 0,
              "created_utc": "2026-02-27 09:40:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7rvfo5",
                  "author": "PlomeroFullStack",
                  "text": "Everything.\n\nEconomics, physics, mathematics, and computer science.\n\nIt's also useful for book summaries. I download any book that catches my eye at the bookstore and ask for a summary of each chapter. If I like what I read, I buy the book.",
                  "score": 1,
                  "created_utc": "2026-02-27 21:38:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7oe3j4",
          "author": "ThiccBoy_with3seas",
          "text": "It's useful, but I don't understand why it doesn't have the ability to have multiple threads/conversations within the same notebook. I assume I'm using up some context window with each message, arenwe meant to just start a new notebook when the conversation hits length = X?",
          "score": 3,
          "created_utc": "2026-02-27 10:11:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7oefyv",
              "author": "ericvalani",
              "text": "Yes, that annoys me too. I end up having to create notebooks separated by subtopic, which is absurd when the sources are the same. The context window is getting polluted and the quality drops. It would be amazing to have parallel conversations within the same notebook, each focused on a different angle but using the same sources. Thread type.",
              "score": 1,
              "created_utc": "2026-02-27 10:14:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7oessh",
                  "author": "ThiccBoy_with3seas",
                  "text": "I guess you can query via Gemini but I have no idea if the quality of the responses is the same",
                  "score": 2,
                  "created_utc": "2026-02-27 10:17:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ohkwt",
          "author": "amantheshaikh",
          "text": "Couldn't agree more. I use it as research and thinking partner. One fundamental difference from other LLMs is that it is grounded in source - so always gives you contextual information from what you provide and not made up stuff. They also recently launched prompt based slide editing which has been superrr helpful for me. I've probably tried every AI presentation maker out there -either expensive or just doesn't fit into the ecosystem.",
          "score": 3,
          "created_utc": "2026-02-27 10:43:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7p1rlc",
              "author": "ericvalani",
              "text": "Do you feel that something is missing from the notebook?",
              "score": 0,
              "created_utc": "2026-02-27 13:14:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7lomny",
          "author": "NKHdad",
          "text": "I upload my sales report and price change letters from our suppliers. Then I ask for any changes and what that company's top purchases are before going in for meetings. It's great",
          "score": 2,
          "created_utc": "2026-02-26 22:57:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lr3h5",
              "author": "ericvalani",
              "text": "And do you like the results?",
              "score": -1,
              "created_utc": "2026-02-26 23:11:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7miiys",
                  "author": "NKHdad",
                  "text": "Yup. It's not great at giving me downloadable reports but just asking for info on one customer it's great",
                  "score": 2,
                  "created_utc": "2026-02-27 01:44:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7nu0yy",
          "author": "Wo0ten",
          "text": "I used it around a year and a half ago as a tool for salesmen. I work for a chemical company which i will not disclose with tons of skus, each with different purposes and different dilutions. Of course each has certain reactions and also security measures. It is safe to say that it has been very easy for all sales reps and technicians since i did/share this with them. (Sorry for bad english is not my first language)",
          "score": 2,
          "created_utc": "2026-02-27 07:04:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7odh7l",
              "author": "ericvalani",
              "text": "I'm glad you're having amazing results. Where are you from?",
              "score": 1,
              "created_utc": "2026-02-27 10:05:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7tcxq7",
                  "author": "Wo0ten",
                  "text": "Mexico",
                  "score": 1,
                  "created_utc": "2026-02-28 02:47:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7sezyq",
          "author": "Classic-Dig-3267",
          "text": "This sounds really good, I've tried NotebookLM myself, and i got good result especially with the slides generation... You can also give hightbase dot com a try and see how well the podcast generation performs for different styles of conversation.",
          "score": 2,
          "created_utc": "2026-02-27 23:22:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7w770m",
          "author": "Pchemical",
          "text": "I use it and it’s really powerful. Quick question- I use it for my work too and lot of time you have to convert documents for Notebook LM to consume it, e.g.- it does on accept PPTs. U have to convert to PDF. Just checking if others also face similar issues.",
          "score": 2,
          "created_utc": "2026-02-28 15:40:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wey50",
          "author": "swayzebavy",
          "text": "explaining complex data sets to execs using the infographic feature. on avg it takes 5 tries to get it to follow my custom instructions - but worth it. super powers come by removing the word mark in my presos",
          "score": 2,
          "created_utc": "2026-02-28 16:19:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7y380b",
          "author": "Wide-Ad-2964",
          "text": "Is note book better at document review than Gemini pro or gpt 5.2 or claud opus",
          "score": 2,
          "created_utc": "2026-02-28 21:28:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7yeybp",
              "author": "ericvalani",
              "text": "The notebooklm he will do based on the documents and files you send to him. without hallucinating too much. normal llm tools they tend to consult much more the data that fed them",
              "score": 1,
              "created_utc": "2026-02-28 22:32:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7mq6o6",
          "author": "Ok_Succotash_3663",
          "text": "Agreed. \n\nNotebook LM is indeed a super tool. But if you wish to keep using this tool as frequently as you sleep in a day, you should dig a little within yourself to arrive at what could be the purposes you can use it for. \n\nI have used it for learning, writing an E Book, research, applying concepts I learnt, analysing my daily tasks and comparing them with my yearly goals, suggesting things to me after reviewing my daily micro habits tracking, doing small data projects and other things.\n\nBut if there are three things that I consider when using this super tool they are\n\n1. Knowing what to use it and the exact extent to which I am going to use it. This includes knowing which feature to use for the specific result I am expecting.\n\n2. Working with prompts that matter and make a difference instead of random common questions to test the tool. \n\n3. Being curious about what else I can explore to get unique results. \n\n\nHaving said that, I won't deny there was a phase where I was completely obsessed with this tool. And overcoming that phase has been a challenge. \n\nAfter all it is merely a note taking tool that does some things beyond it. Isn't it?",
          "score": 2,
          "created_utc": "2026-02-27 02:29:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7n3dt3",
          "author": "darkknight04",
          "text": "tbh i got tired of gemini models tho... we switched to [superly.app](http://superly.app) and its been WAY better especially being able to bring in not just youtube videos, but also IG reels, tiktoks, meta ads.. honestly its insane what these AI tools can do now",
          "score": 2,
          "created_utc": "2026-02-27 03:48:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7oculb",
              "author": "ericvalani",
              "text": "I'm going to test this platform",
              "score": 2,
              "created_utc": "2026-02-27 09:59:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7oi4v9",
                  "author": "darkknight04",
                  "text": "let me know how it goes, my team has been using it for months now so we're experts haha",
                  "score": 2,
                  "created_utc": "2026-02-27 10:48:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7n8krs",
          "author": "Split-Awkward",
          "text": "Not insane, but personally it is immensely valuable.\n\nI’m using it to help my AuDHD son in his last two years of high school to, well, actually get through it.\n\nSo many things he does requires a massive shift in explanation to meet his needs. It’s an immense amount of work. Insurmountable for his school, him and I. \n\nNotebookLM allows me to load all the stuff from his curriculum in there and ask it to create different resources, particularly visuals like videos, roadmaps, visual journeys and roadmaps to show to him to help him understand in a way that actually helps him. The key part being is it allows me to “trial and error” quickly with different approaches to find things that “click” for him.\n\nIf something doesn’t work for him, I just tell NotebookLM with some “colour” on where I think the conceptual learning gap is and it happily creates more to try very quickly.\n\nIt can create checklists and skeleton scaffolds that help him follow the bouncing ball through long projects that his brain just completely gets lost in and causes immense anxiety to the point of meltdowns.\n\nI can just ask it to break things down quickly into simpler parts that cater to his specific needs.\n\nI love that it deeply takes into account (and learn as we go) his specific needs in a subject or project.\n\nMy goal is to hopefully teach him how to operate NotebookLM independently so he can achieve this for himself rather than be dependent on me. I’m finding it has some quirky workflow requirements on certain document types (PowerPoints are a big one) that right now make that a showstopper. \n\nSo not a killer use case for anyone else, but immensely impactful for my son and I. It means courses and content that is currently way beyond his capability in the ways they are delivered, are now within reach. Still an immense load on both of us, and I’m not sure if we can do it, but I can see a real chance now.",
          "score": 2,
          "created_utc": "2026-02-27 04:21:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7od2d2",
              "author": "ericvalani",
              "text": "That's amazing, I hope your son becomes smarter every day",
              "score": 2,
              "created_utc": "2026-02-27 10:01:59",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7yqmed",
              "author": "Hitching-galaxy",
              "text": "Thank you for this - my son is dyspraxic but I think also audhd. I love notebook lm and will give this a go as he finds school challenging sometimes",
              "score": 2,
              "created_utc": "2026-02-28 23:39:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7vcro3",
          "author": "michael-koss",
          "text": "I was studying for my Certified Personal Trainer. I would upload a chapter at a time into a notebook, have it find other sources, then generate a podcast (with a custom prompt about learning, focusing on gotchas, etc). Then I could listen to it while I was driving. As a working dad, finding time to study was hard. NotebookLM was able to make my driving time productive. \n\nAnd I passed the exam this last week!! Now I’m officially a CPT!",
          "score": 1,
          "created_utc": "2026-02-28 12:41:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vro6w",
          "author": "slavin_fpo",
          "text": "How would anyone describe the use cases for notebookLM over getting analysis from other LLMs? \n\nIs the difference the output or the analytical capabilities, or both?",
          "score": 1,
          "created_utc": "2026-02-28 14:16:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vy611",
          "author": "DutchBunnyReader",
          "text": "I asked it to summarize The 48 Laws of Power by Robert Greene by asking it to list each law with examples from The Count of Monte Cristo.  It gave up half way, but saved me from having to read both books. ",
          "score": 1,
          "created_utc": "2026-02-28 14:53:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kaqgb",
          "author": "Sea-Tadpole5537",
          "text": "Congratulations on your ascent to godhood, u/ericvalani. It’s truly inspiring to see someone discover that if you actually feed an AI good information, it might—just might—give you something useful back. Who would have thought that \"Garbage In, Garbage Out\" wasn't just a dusty acronym from a 1970s computer science textbook?\n\n​It’s particularly impressive that you’ve turned a paid marketing course into a glorified CSV file for a robot to read to you. Why bother with a human instructor's \"pacing\" or \"nuance\" when you can just extract the marrow of their knowledge in 20 minutes and discard the rest like a digital vampire?\n\n​You’ve basically admitted that your new \"superpower\" is a highly refined form of \"skipping the fluff,\" which is the most productive version of laziness I’ve heard all week.\n\n​Pro-tip: Since you’re \"barely scratching the surface,\" maybe try feeding your own Reddit post into the tool next time. It might help you find the point of this post even faster than you can say \"not an affiliate link.\"",
          "score": -17,
          "created_utc": "2026-02-26 18:56:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l4zpp",
              "author": "mondo_mike",
              "text": "Perhaps you are confused - r/luddites is a different sub.",
              "score": 1,
              "created_utc": "2026-02-26 21:20:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7lawwe",
                  "author": "Sea-Tadpole5537",
                  "text": "Poster failed recursive step to self-check output using advocated tools before post.",
                  "score": -2,
                  "created_utc": "2026-02-26 21:49:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7kqsdh",
              "author": "ericvalani",
              "text": "Human instructor is quite behind for the AI era. a trained AI agent and incredibly better at learning anything. maybe someone will launch some saas or app like this... but so far the notebookLM is amazing. thanks for the tips",
              "score": 1,
              "created_utc": "2026-02-26 20:13:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rhjbsw",
      "title": "TO THE DEVS. FIX NOTEBOOK LM. PLEASE.",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1rhjbsw/to_the_devs_fix_notebook_lm_please/",
      "author": "catalasepositive",
      "created_utc": "2026-03-01 00:51:40",
      "score": 152,
      "num_comments": 32,
      "upvote_ratio": 0.93,
      "text": "Hi, TO THE DEVS. \n\nI am a post-grad student who's  heavily utilizing NotebookLM to help me digest hundreds of pages of readings I have to familiarize myself with every day especially during clutch times like long exams. I have been using the tool for years, even witnessed how over time, it had seemed to trade its deep, accurate synthesis and content analysis for being a \"meh\" tool who's basically useless for scholarly purposes now (unless you are a high school student with no specialization at all and okay with made up facts since you don't read at all). \n\nI used to practice my recalls and even application skills with quizzes that I generate through the chat via comprehensive and direct prompts because the studio quiz tool won't let me get past 25 items at a time, won't deliver complete rationale, and sometimes makes up topics. However, very recently, like today, the tool would just respond to me with *\"I have created a comprehensive quiz artifact for you in the Studio tab\"* and delivers a quick note on limitations WHICH IT ORIGINALLY DID NOT HAVE.\n\nGod, you guys have developed a tool that finally addresses the unreliability of AI across all other tools in terms of referencing and here you are making a duplicate of every other tool we avoid using. We really don't get the logic especially when responses still took too long to be generated.\n\nHope you still find it in your hearts to fix it.",
      "is_original_content": false,
      "link_flair_text": "Bug",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rhjbsw/to_the_devs_fix_notebook_lm_please/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o7z7kxa",
          "author": "Barycenter0",
          "text": "Join the LM Discord group to post your concerns",
          "score": 40,
          "created_utc": "2026-03-01 01:19:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7z9slv",
              "author": "catalasepositive",
              "text": "I did. Just posting this here too in case Devs also lurk in here.",
              "score": 14,
              "created_utc": "2026-03-01 01:33:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o80w857",
                  "author": "KOM_Unchained",
                  "text": "For the lurking devs, please retain the history of the Deep Search sources' prompts",
                  "score": 10,
                  "created_utc": "2026-03-01 08:53:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o810fav",
              "author": "chipsahoysteve",
              "text": "Can I have a link to the discord group, too?",
              "score": 3,
              "created_utc": "2026-03-01 09:33:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o8213uc",
                  "author": "kevbrown044",
                  "text": "I’d like that link too - please",
                  "score": 2,
                  "created_utc": "2026-03-01 14:24:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o83d77z",
                  "author": "Barycenter0",
                  "text": "[https://discord.gg/notebooklm](https://discord.gg/notebooklm)",
                  "score": 1,
                  "created_utc": "2026-03-01 18:21:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o806ckd",
          "author": "Automatic-Example754",
          "text": "The AV generation stuff got a lot of attention because the podcast hosts sound impressively real, and so the devs drank the nano banana-flavored Kool Aid last year. But it's mostly garbage. The real value of NBLM is that anyone can set up a good text-based RAG in a few minutes. They should be leaning on that, improving things like source management, instead of handing tasks off to the crappy \"studio\" tools.",
          "score": 22,
          "created_utc": "2026-03-01 05:06:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o8517k4",
              "author": "pan_Psax",
              "text": "![gif](giphy|5xtDarmwsuR9sDRObyU)",
              "score": 2,
              "created_utc": "2026-03-01 23:30:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7z45dx",
          "author": "Chief_morale_officer",
          "text": "As another grad student this also killed me when I tried to make a quiz outside the studio only for it to send it to the studio with, incorrect number of questions, and missing questions/ answers",
          "score": 20,
          "created_utc": "2026-03-01 00:59:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7za1xs",
              "author": "catalasepositive",
              "text": "NotebookLM used to be the one I used to question less but the devs seem to have other plans. Waste of subscription.",
              "score": 6,
              "created_utc": "2026-03-01 01:35:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o806xw1",
          "author": "Automatic-Example754",
          "text": "I haven't really used the Gemini integration myself, but could you try that? Point it at your notebook and ask it to generate a quiz for you?",
          "score": 7,
          "created_utc": "2026-03-01 05:11:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o812r95",
              "author": "catalasepositive",
              "text": "It's basically unusable as well. Way way poorer performance compared to basic NotebookLM chat. Gemini makes up sources. The only thing I use it for is the deep research tool.",
              "score": 2,
              "created_utc": "2026-03-01 09:56:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o80sww8",
          "author": "MainBuddy604",
          "text": "Its shit now. They made it like a copy of chatgpt and the other shitty llm.",
          "score": 6,
          "created_utc": "2026-03-01 08:22:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o8131zb",
              "author": "catalasepositive",
              "text": "Right. And they even put up this Ultra subscription thing on top of the Pro.",
              "score": 1,
              "created_utc": "2026-03-01 09:59:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o81rhu4",
          "author": "Embarrassed_Loan8419",
          "text": "You can prompt it to still generate quizzes in chat you just have to be specific about wanting the quiz in the chat.\n\nI just started using it and also don't like the short quizzes.  I use the chat to make 50 question quizzes in the chat with rationales for the correct answer and the rationales for the wrong ones too. \n\nWhen it tried to generate a quiz I specifically ask for the questions in the chat. When it says 50 questions is too long for the chat I tell it no its not I want it to be long and it generates for me ...",
          "score": 6,
          "created_utc": "2026-03-01 13:26:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81sx34",
              "author": "catalasepositive",
              "text": "I'll try this. Thank you!",
              "score": 2,
              "created_utc": "2026-03-01 13:35:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o847gjp",
                  "author": "Glichdot",
                  "text": "Any luck?",
                  "score": 3,
                  "created_utc": "2026-03-01 20:51:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7zoviu",
          "author": "starkruzr",
          "text": "you're going to need to roll your own system that does embedding and real RAG yourself.",
          "score": 5,
          "created_utc": "2026-03-01 03:06:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o813fpc",
              "author": "catalasepositive",
              "text": "I guess. Back to the pen and paper method.",
              "score": 2,
              "created_utc": "2026-03-01 10:02:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o80495y",
          "author": "BeefCorp",
          "text": "I started using it recently. Its still helpful for sorting through enormous dense governmenr documentation for work (because I can check the source of the information it returns), but when I tried to use it for flashcards for school there were numerous errors. Most cards were correct, but if even 1/15 cards isn't correct then that tool becomes useless to me.",
          "score": 3,
          "created_utc": "2026-03-01 04:51:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o812y2l",
              "author": "catalasepositive",
              "text": "It also generates mostly non-high yield cards and so I don't use it that much, too.",
              "score": 1,
              "created_utc": "2026-03-01 09:58:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o82nyfn",
          "author": "Dry_Principle_6202",
          "text": "Great breakdown. The \"Artifact\" gatekeeping is the biggest issue here. By forcing quizzes into the Studio tab, the AI seems to lose the ability to follow complex, multi-step prompts that we used to run in the chat.\n\n**To the Devs:** Please give us a \"Power User\" mode. If I ask for a 50-item quiz with deep rationale in the chat, don't redirect me to a simplified 25-item widget. We use NotebookLM because it *was* better than the rest; don't let it become just another hallucination-prone summary tool.",
          "score": 3,
          "created_utc": "2026-03-01 16:21:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o83172l",
          "author": "Curious-Test7928",
          "text": "The notebook do censorship to, in things like contemporanean history…",
          "score": 2,
          "created_utc": "2026-03-01 17:25:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80d4u8",
          "author": "Cheeseboi8210",
          "text": "Wow, the self importance in this post.",
          "score": -4,
          "created_utc": "2026-03-01 06:00:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81391h",
              "author": "catalasepositive",
              "text": "Uhm yeah? Because feedback is important since I'm an end user?",
              "score": 1,
              "created_utc": "2026-03-01 10:01:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o813epe",
                  "author": "Cheeseboi8210",
                  "text": "You can give feedback without shitting on user who are highschool students.",
                  "score": 0,
                  "created_utc": "2026-03-01 10:02:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rfefv1",
      "title": "Gemini 3.1 Pro update broke full-notebook retrieval for large notebooks",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1rfefv1/gemini_31_pro_update_broke_fullnotebook_retrieval/",
      "author": "Future-Chocolate-752",
      "created_utc": "2026-02-26 16:16:32",
      "score": 77,
      "num_comments": 32,
      "upvote_ratio": 0.98,
      "text": "\n\n**Update:** Google has acknowledged the issue on their developer forum and rolled out a fix. I can confirm that full-notebook retrieval across my 300 sources is working again. \n\nThank you to everyone who confirmed the issue, shared their experiences, and upvoted for visibility.\n\n......................................................................................................................................................................................................................................\n\nI'm a Pro/Ultra subscriber using NotebookLM with approximately 300 PDF sources for academic research. Since the Gemini 3.1 Pro update around February 19-20, full-notebook retrieval has been severely degraded. I want to stress that the notebook was fully functional before this update.\n\n**The Problem:** When querying across all sources, the system can miss entire sources or retrieve only isolated fragments of a paper—such as a figure or a table—while the rest of the article remains invisible. When asked for my own paper's authorship, it hallucinates, presenting names cited in table footnotes as the paper's actual authors. For other queries related to my paper, it falsely claims that the content does not exist in the notebook.\n\n**The Content is There:** The exact same query returns complete, accurate, and detailed results when I select only the source file containing the paper.\n\n**Corroborating Evidence:** This is not an isolated case. Another Pro/Ultra user reported identical regressions on [discuss.ai.google.dev](http://discuss.ai.google.dev) (titled *\"Critical Regression: Gemini 3.1 Pro Update Completely Broke NotebookLM's RAG & Grounding\"*), citing source blindness, shallow retrieval, and hallucinations.\n\n**Why This Matters:** A core value of the Pro and Ultra plans is the ability to work across large source collections. If the retrieval system fails, the product doesn't deliver on its promise. If I have to select each file manually for every query, NotebookLM shifts from a research assistant to a standard PDF reader. Worse, it can no longer establish reliable connections among sources.\n\nMost critically, hallucinations in a grounded system are not a minor bug; they defeat the very purpose of grounding. Without robust retrieval, every feature built on top of it—Audio Overviews, Deep Research, infographics, slides, and video—is only as reliable as a broken search engine allows.",
      "is_original_content": false,
      "link_flair_text": "Bug",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rfefv1/gemini_31_pro_update_broke_fullnotebook_retrieval/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o7jgtkj",
          "author": "flybot66",
          "text": "Here's what I would do if faced with this issue.  First as painful as it might be.  I would abandon that notebook.  Create a new notebook and load 1/2 say of the resources.  Make sure you do this from local storage and not from the cloud.  NBLM handles PDFs differently when they come from Drive.  Maybe this applies to other files, too.  If it works at 1/2 sources loaded load the rest and see.\n\nLet us know how this goes.",
          "score": 18,
          "created_utc": "2026-02-26 16:39:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7jnmrx",
              "author": "Future-Chocolate-752",
              "text": "Thanks for the suggestion. I created a fresh notebook and reloaded sources from local storage, but the problem persists. The regression appears to be tied to retrieval behavior across large source collections, rather than to a specific notebook or upload method. The same queries work perfectly when I select a single source file. It's the full-notebook search that's broken. ",
              "score": 16,
              "created_utc": "2026-02-26 17:10:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7jx573",
                  "author": "cornmacabre",
                  "text": "In an entirely different context, there's been a lot of issues flagged for 3.1 related to inconsistent tool usage in other workflows like agentic toolcalls and IDE integration. \n\n\"really smart base, but functionally useless right now\" is a pretty common criticism across the board for this model. FWIW, I suspect that will resolve with model updates in a week or so, and hopefully it's not a nbLM specific issue.",
                  "score": 5,
                  "created_utc": "2026-02-26 17:54:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7jpij1",
          "author": "Okumam",
          "text": "Yesterday, when asking Gemini to produce a report based on a notebook with 27 sources, it told me it could not retrieve further than the 3rd source.  This sort of thing had not been an issue before.  I had to provide the sources directly to Gemini, but you are limited to 10 at a time, and you give up on the RAG element.",
          "score": 9,
          "created_utc": "2026-02-26 17:19:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7jta29",
              "author": "speedracersydney",
              "text": "You can create a compressed zip file with up to 10 documents and have 10 zip files = 100 documents. \n\nBut I worry about the quality.\n\nHaving a small number of on-point documents seems to get far better results but it takes time to do it properly.",
              "score": 1,
              "created_utc": "2026-02-26 17:36:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7keb6s",
                  "author": "WhiteHorseMagic",
                  "text": "The NBLM has limited depth reading ability in a source - so the more you stuff into a single file, the more it may skip, example: 400+ page pdf only is readable u til about 180 pages when NBLM stops accessing further pages (so in a combined PDF of multiple sources, you’re hitting the same wall in terms of retrieval and depth)",
                  "score": 5,
                  "created_utc": "2026-02-26 19:13:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7k2b8i",
          "author": "XavierVE",
          "text": "Not just large notebooks. The problem is 3.1 just not being as good as 3.0 in handling sources even for smaller notebooks. It simply tries to output too quickly. You're having issues with a professional high level research setup with three hundred sources, well even if you scale that way the fuck down to a casual use-case like mine, it's failing. Having the same issue with a 18 source setup I have to world-build and provide character context. \n\nI use a detailed prompt.txt file to generate outputs and had to change my entire workflow of how I do that because it would randomly skip paragraphs in the prompt.txt file when that wasn't a problem at all in 3.0. \n\nNot being able to select which model you're using to analyze files and generate outputs is one of the most frustrating parts of NotebookLM. This 3.1 update just wasn't ready for prime time, it tries to output too fast whereas 3.0 would slow the fuck down if you gave it retrieval instructions. The focus on speed as opposed to quality outputs is not a good direction for Google to go towards.",
          "score": 7,
          "created_utc": "2026-02-26 18:18:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7l8qim",
              "author": "Future-Chocolate-752",
              "text": "I learned a precious lesson with NotebookLM: source curation and prompting, rather than the model itself, were my limiting factors. Then, just when I finally got them right, Google changed the model—and now my literature and prompts count for nothing. Benchmarking attests Gemini 3.1 Pro is twice as intelligent as the 3.0 model (at least according to ARC-AGI-2). Social media advertises that NotebookLM lets you personalize PPT slides. But are these really priorities when the core grounding and retrieval system is broken?",
              "score": 3,
              "created_utc": "2026-02-26 21:38:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7khare",
          "author": "darthvindi",
          "text": "I have a notebook with \\~60 sources for historical research, and some new sources started to be ignored. When I ask about things specifically from this source, while all sources are selected, it won't return any result.",
          "score": 5,
          "created_utc": "2026-02-26 19:27:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lrd7x",
          "author": "deltapilot97",
          "text": "I wish there was a way to indicate which model you wanted to run in NBLM so that in instances like this we could stick with the more reliable model ",
          "score": 3,
          "created_utc": "2026-02-26 23:12:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lzp1m",
              "author": "Future-Chocolate-752",
              "text": "Absolutely. A model selection option — or at least a rollback toggle during transition periods — should be standard for any tool marketed as a professional research assistant. If NotebookLM is meant to be your working partner, it can't take a leave of absence out of the blue every time Google updates the backend.",
              "score": 2,
              "created_utc": "2026-02-26 23:58:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7k2k26",
          "author": "Z3R0gravitas",
          "text": "My experience of NotebookLM's RAG performance has always been patchy and varied a lot over time. I felt/hoped it was trending up, because referencing large volumes of data, over many sources, is all I do with NbLM. Why I got Pro. To serve it up for others too.\n\nOn free tier, last year, it would only inventory roughly 30 of 50 sources. Now, it's seems to lose track of some sources only beyond 70. Getting about 150 of 250 (testing a few days ago). Although I've not had time to control for the amount of text in each source. \n\nI wonder if you/anyone has experience of this direct approach yielding a full listing of all \\~300 sources (previously)?\n\nIt has been inconsistent, sometimes able to report on details of sources it's addlement it doesn't have, via it's \"internal capabilities\" (I think it referred to it's RAG system as it saw it). I'm not at all saying this accounts for your observations, above, OP. But as I understand it, we should expect incompleteness (and inconsistency), due to fundamental limitations found with vector embeddings. I [posted about a study on this](https://www.reddit.com/r/notebooklm/comments/1n9lwio/is_this_a_big_reason_nblm_source_file_recall_can/) 6 months back.",
          "score": 2,
          "created_utc": "2026-02-26 18:19:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kwrii",
              "author": "Future-Chocolate-752",
              "text": "You raise a fair point, and I agree that we shouldn't expect NotebookLM to load 300 large files into its context window and reason across all of them simultaneously. That's a known limitation of any RAG system, and I've never expected completeness in that sense.\n\nBut that's not what changed. Before the update, the system excelled at finding a needle in the haystack. If my query was specific enough — identifying the title, topic, method, or context of a particular article — NotebookLM would retrieve that article accurately, read it deeply, and report its content faithfully. It didn't need to hold all 300 sources in memory. It just needed to find the right one. And it did, consistently.\n\nWhat's broken now is that the system can no longer find the article. Or worse, it finds small fragments — a figure caption, a data table — and then hallucinates about the rest: fabricating authorship from footnote citations, claiming content doesn't exist when it does. That's not a matter of vector embedding incompleteness. That's a regression from reliable targeted retrieval to shallow fragment retrieval with confident confabulation.",
              "score": 3,
              "created_utc": "2026-02-26 20:42:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7masxq",
                  "author": "Z3R0gravitas",
                  "text": "I was encouraged by this kind of seemingly pin-point reliable accuracy for finding exactly what the instances of conversation I was talking about, across 70MB of discord chat logs, at the end of last year. Perhaps following [the October update](https://blog.google/innovation-and-ai/models-and-research/google-labs/notebooklm-custom-personas-engine-upgrade/)...\n\nHow long had you been using NbLM like this for (successfully)?\n\nIt could well be the the 3.1 model is the key issue, is that's what you're thinking? But this problem, by definition, is also intimately dependant on the RAG system. And the devs tell us almost nothing about that, or how/when it is changed. With no 3rd party testing of it's ability or changes. Unlike those bench marking each new model. So I feel it's something we are overlooking.\n\nYes, hallucinations seem like a model thing. But it's complex interdependent system, where symptoms in the back-end can only be observed (by us) through model outputs... But then, what does our understanding matter; \"it's broke devs, please fix!\"",
                  "score": 1,
                  "created_utc": "2026-02-27 00:59:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7tq1fb",
                  "author": "Chris-MelodyFirst",
                  "text": "Why is your writing styling so much more sophisticated than it was a year ago? Is English not your native language?",
                  "score": 1,
                  "created_utc": "2026-02-28 04:13:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7k2sfo",
          "author": "Z3R0gravitas",
          "text": "Have you reported this via the official Discord or elsewhere? I don't know if devs are at all involved in this subreddit..?",
          "score": 2,
          "created_utc": "2026-02-26 18:20:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jw04d",
          "author": "Barycenter0",
          "text": "I don't think I'd try 300 sources in NBLM. NBLM makes too many errors on sources for me and isn't reliable yet as Google promotes. So, I methodically move sources one at a time and then query each individual source to make sure LM is complete. Then, I do it with 2 sources, then 3, etc. If one source comes up short I'll convert it into a Google Doc - that usually fixes missing information or broken search. It's the only way I can make sure nothing is missed. Maybe I'm being too careful.",
          "score": 1,
          "created_utc": "2026-02-26 17:49:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k1q3z",
              "author": "Future-Chocolate-752",
              "text": "Your caution is understandable, but that's exactly the point — this level of manual verification shouldn't be necessary. Before the February 20 update, my 300-source notebook worked beautifully. Full retrieval across all sources, accurate attribution, deep reading, high-level reasoning, and impressive source connections. The system delivered exactly what the Pro/Ultra plan promises. But then it turned from unbelievably awesome to awfully disappointing.",
              "score": 6,
              "created_utc": "2026-02-26 18:15:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7k4cae",
                  "author": "Barycenter0",
                  "text": "Are you in the LM Discord group? You should post your issues there.  I have the Pro plan and agree the verification shouldn't be necessary. I would like to see Google have some type of visual intermediate verification outline analytical report - showing us what has been processed on RAG input, the outline and Grok-like side verification agent report, tokens processed, and cross-document index reporting.",
                  "score": 2,
                  "created_utc": "2026-02-26 18:27:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7k6sjq",
          "author": "vintage2019",
          "text": "Sorry you're having this problem. Doesn't Notebook LM use Flash instead of Pro tho?",
          "score": 1,
          "created_utc": "2026-02-26 18:38:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7n1d0s",
              "author": "xpoisson",
              "text": "Nope",
              "score": 1,
              "created_utc": "2026-02-27 03:35:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7kufsc",
          "author": "OkProfessor3875",
          "text": "Yep, I have the same problem. It can only consistently recognize information from older sources since the update, and misses large chunks of information",
          "score": 1,
          "created_utc": "2026-02-26 20:30:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80y9si",
          "author": "Hawklord42",
          "text": "Thanks for the update - I've just posted about similar \"references all wrong\" issues (https://www.reddit.com/r/notebooklm/comments/1rhs7ac/notebooklm\\_confirmed\\_referencing\\_bug\\_19226\\_onwards/) which are for me ongoing.",
          "score": 1,
          "created_utc": "2026-03-01 09:13:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81ctwq",
              "author": "Future-Chocolate-752",
              "text": "Thanks for sharing. My issue was specifically about full-notebook retrieval failing on targeted queries, which Google has since fixed. Your case may involve a different failure mode. Could you detail the issue and confirm whether it was absent before the Gemini 3.1 Pro update?",
              "score": 1,
              "created_utc": "2026-03-01 11:32:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1re2g5n",
      "title": "That's why NBLM Pro thinks longer now.",
      "subreddit": "notebooklm",
      "url": "https://i.redd.it/q80wnsozaklg1.png",
      "author": "xpoisson",
      "created_utc": "2026-02-25 03:45:10",
      "score": 68,
      "num_comments": 8,
      "upvote_ratio": 0.98,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1re2g5n/thats_why_nblm_pro_thinks_longer_now/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o79s2t9",
          "author": "Hawklord42",
          "text": "Yes I've been finding it great too (despite the usual \"reddit generally hates everything\" vibe that one sees everywhere).\n\nI'm less clear on how this affects the quality of the Deep Dive podcast. I assume it improves the script but doing an A/B test is awful tricky",
          "score": 15,
          "created_utc": "2026-02-25 04:32:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7by2ld",
          "author": "ThrowawayNotSusLol",
          "text": "So to be clear, I don't have to change any settings to automatically get 3.1 pro since I have a subscription? \n\nWhat about the annoying new hourly limit on Gemini? Does it affect NotebookLM",
          "score": 7,
          "created_utc": "2026-02-25 14:31:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7c54n2",
          "author": "Automatic_Sorbet2475",
          "text": "Hello, \n\nDo we know if \"AI plus\" subscriptions are covered as well or it starts from pro ones ? \n\nThanks",
          "score": 4,
          "created_utc": "2026-02-25 15:07:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7f6qwq",
          "author": "cornmacabre",
          "text": "Disappointingly: direct PPT export just means that the flat generated images are on the slide. Can't edit text or assets, but I guess it saves one step vs PDF.",
          "score": 2,
          "created_utc": "2026-02-25 23:42:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7fwsi5",
              "author": "xpoisson",
              "text": "https://preview.redd.it/lsfh6l5myqlg1.png?width=1920&format=png&auto=webp&s=923a519f5b8621c4d18031c668985428d9c54ac2\n\nBut you can edit (including the text) each slide inside NBLM with the button Revise before exporting. But I haven't tried it yet.",
              "score": 3,
              "created_utc": "2026-02-26 02:08:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7fyrqf",
                  "author": "cornmacabre",
                  "text": "Targeted reprompting = still an improved flat image, unfortunately -- a flat image is virtually unusable in any real world professional context. Just turn it back into a PDF at that point, lol.",
                  "score": 1,
                  "created_utc": "2026-02-26 02:20:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7dwvxb",
          "author": "A743853",
          "text": "Ah this makes sense. Gemini connected to NBLM already took long. Wish it was faster tbh.",
          "score": 1,
          "created_utc": "2026-02-25 19:58:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7m5o93",
          "author": "Z3R0gravitas",
          "text": "Looks like this blog post, to be clear there's no search AI misunderstandings in that screenshot: [https://blog.google/innovation-and-ai/models-and-research/gemini-models/gemini-3-1-pro/](https://blog.google/innovation-and-ai/models-and-research/gemini-models/gemini-3-1-pro/)",
          "score": 1,
          "created_utc": "2026-02-27 00:31:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdvt48",
      "title": "What’s missing from NotebookLM for you?",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1rdvt48/whats_missing_from_notebooklm_for_you/",
      "author": "aemasik",
      "created_utc": "2026-02-24 23:00:24",
      "score": 49,
      "num_comments": 58,
      "upvote_ratio": 0.98,
      "text": "I’ve been using NotebookLM for a while now, and honestly, it’s been an amazing tool for my studies. That said, no tool is perfect, and there are a few things I really wish it could do.\n\nFor one, I’d love the ability to upload scanned documents, not just text-based files. A lot of my materials are scanned PDFs, and it would make things so much easier if those were supported directly.\n\nI also wish I could view the original documents inside NotebookLM instead of only seeing the extracted text. When working with files that contain a lot of visuals, constantly switching between tabs to check the original document gets frustrating. Having the original file viewable would be a huge improvement.\n\nAnother thing I miss is the ability to actively work on the documents like adding notes, highlighting sections. It would also be great to have better collaboration features, such as sharing a workspace with someone else so we can work on the same materials together.\n\nDoes anyone else feel the same way, or is it just me?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rdvt48/whats_missing_from_notebooklm_for_you/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o78cqtn",
          "author": "Gerfervonbob",
          "text": "Way to organize sources into folders and default them to off/on as I need them.",
          "score": 45,
          "created_utc": "2026-02-24 23:37:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78d63f",
              "author": "stainless13",
              "text": "Would love this",
              "score": 3,
              "created_utc": "2026-02-24 23:40:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7a1jtd",
                  "author": "AggravatingCounter84",
                  "text": "101K karma is crazy damn. I commented on the original commenter I hope my tool helps you fill that gap",
                  "score": 2,
                  "created_utc": "2026-02-25 05:40:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7a1d4u",
              "author": "AggravatingCounter84",
              "text": "Hi, I am the builder of https://kortex-notebooklm.com/ , this will let you create folders for sources, artifacts and notebooks. Also you can create presets of sources to turn them off or on.  I hope this helps :)",
              "score": 3,
              "created_utc": "2026-02-25 05:39:09",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7a0n86",
              "author": "ExtraAd5765",
              "text": "需要文件管理功能",
              "score": 2,
              "created_utc": "2026-02-25 05:33:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o78ft67",
          "author": "lindsayblohan_2",
          "text": "Honestly, maybe a better file/source management system, the ability to stop submitting prompts from processing, edit prompts, and a few other minor things.\n\nOther than that, it’s exactly what I need it to be.",
          "score": 12,
          "created_utc": "2026-02-24 23:55:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7871jy",
          "author": "mrmikelawson",
          "text": "I would love the ability for it to query a Google Document live. When I add a Google Document as a source, it captures the document in the current state. When my team updates the Google Doc with new information, this info is not automatically queried by the Notebook but rather needs to be reuploaded. ",
          "score": 25,
          "created_utc": "2026-02-24 23:07:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78cmtf",
              "author": "Gerfervonbob",
              "text": "Go into the google doc source and click the sync link at the top and it'll update the source. ",
              "score": 14,
              "created_utc": "2026-02-24 23:37:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7e3s41",
                  "author": "Sorry-Joke-4325",
                  "text": "I don't see a \"sync link\", are you talking about the \"See document status\" cloud icon?",
                  "score": 1,
                  "created_utc": "2026-02-25 20:31:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o789bvp",
              "author": "Beginning-Board-5414",
              "text": "You can do auto-sync  with NotebookLM extension, I use ExtendLM for this.",
              "score": 8,
              "created_utc": "2026-02-24 23:19:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o78hshp",
                  "author": "123dynamitekid",
                  "text": "Does it have the same privacy and security standards as vanilla though?",
                  "score": 1,
                  "created_utc": "2026-02-25 00:06:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7ag7b3",
              "author": "Dizzy_Horse_105",
              "text": "Look into this. I am pretty sure you can refresh the gdoc in NBLM and it will update.",
              "score": 3,
              "created_utc": "2026-02-25 07:44:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o78c3rv",
              "author": "Sorry-Joke-4325",
              "text": "Wait, really?! That's such a huge flaw. \n\nI hadn't yet got around to testing it. Major bummer.",
              "score": 1,
              "created_utc": "2026-02-24 23:34:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o78j923",
          "author": "contafi10",
          "text": "\"For one, I’d love the ability to upload scanned documents, not just text-based files. A lot of my materials are scanned PDFs, and it would make things so much easier if those were supported directly.\"\n\nWhat? NotebookLM can read my scanned files just fine.",
          "score": 12,
          "created_utc": "2026-02-25 00:14:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78ld7x",
              "author": "omnergy",
              "text": "I’m guessing they mean scan directly into the notebook",
              "score": 2,
              "created_utc": "2026-02-25 00:25:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o78yxps",
          "author": "MegamomTigerBalm",
          "text": "I wish I could stop it mid-query if I accidentally hit enter too soon rather than have to wait through its thinking.  Also, related, to be able to go back and edit a prompt.",
          "score": 10,
          "created_utc": "2026-02-25 01:40:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79isq0",
              "author": "Emnkay666",
              "text": "For me when I hit enter too fast I just refresh the page and then if the query wasn't answered yet, it deletes kinda.",
              "score": 5,
              "created_utc": "2026-02-25 03:33:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o79og22",
                  "author": "MegamomTigerBalm",
                  "text": "Good idea! I’ll try that.",
                  "score": 1,
                  "created_utc": "2026-02-25 04:08:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7877k5",
          "author": "TeeRKee",
          "text": "An api or mcp.",
          "score": 6,
          "created_utc": "2026-02-24 23:08:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o788tz2",
          "author": "darkknight62479",
          "text": "It got super lazy and truncated on studio outputs.",
          "score": 7,
          "created_utc": "2026-02-24 23:16:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78i91v",
          "author": "Gold_Driver2447",
          "text": "generating ppt files with the possibility to edit them without prompt",
          "score": 6,
          "created_utc": "2026-02-25 00:08:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79s5vj",
              "author": "thecompbioguy",
              "text": "Or even Google Slides doc",
              "score": 5,
              "created_utc": "2026-02-25 04:32:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o78fa6t",
          "author": "LeadingAsparagus5617",
          "text": "There’s tools similar to notebook lm like [thytus](https://thytus.com) that have the grounded knowledge of notebook lm and the ability to upload scanned pdfs, videos, images etc. or even [Claude](https://claude.com) which has the ability to upload docs. Claude rag is super underrated!",
          "score": 3,
          "created_utc": "2026-02-24 23:52:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7awler",
          "author": "-TheSloth-",
          "text": "Generating summaries or summary sheet. Would help a lot while studying",
          "score": 3,
          "created_utc": "2026-02-25 10:17:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b81cv",
          "author": "MrsEDT",
          "text": "folders and bulk edit/move/delete",
          "score": 3,
          "created_utc": "2026-02-25 11:54:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7btce8",
          "author": "SR_RSMITH",
          "text": "Biggest problem for me is that no matter how many sources I have, answers will have about the same length. I want several pages worth of text for complicated responses",
          "score": 3,
          "created_utc": "2026-02-25 14:07:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ccvoq",
          "author": "MegamomTigerBalm",
          "text": "I thought of another minor thing: a character limit counter if typing or pasting longer text in the prompt.",
          "score": 3,
          "created_utc": "2026-02-25 15:44:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7976dl",
          "author": "aaatings",
          "text": "Automatic way to input complex pdfs/docs   with user defined chunking (both pagewise or topic wise).\n\nAbility to natively ocr and describe with atleast 95%+ accuracy all the imgs/diagrams etc in the source.",
          "score": 2,
          "created_utc": "2026-02-25 02:27:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7p63wa",
              "author": "aemasik",
              "text": "this is so relatable. isn’t it annoying that you can’t properly see sources: exact page, paragraph:((",
              "score": 2,
              "created_utc": "2026-02-27 13:39:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o79888q",
          "author": "Ordinaryjay",
          "text": "Ability to upload PPT and edit. Have to do an LLm then add it to Claude to accomplice my use case",
          "score": 2,
          "created_utc": "2026-02-25 02:33:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79igxz",
          "author": "hellomate890",
          "text": "What di you mean. Notebooklm does read scanned files from ocr i think",
          "score": 2,
          "created_utc": "2026-02-25 03:31:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79j9cn",
          "author": "MainBuddy604",
          "text": "Cursory overviews have watered down the product.",
          "score": 2,
          "created_utc": "2026-02-25 03:36:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79s4yt",
          "author": "YourDNADiva",
          "text": "“Another thing I miss is the ability to actively work on the documents like adding notes, highlighting sections. “ ⬅️\nThis!",
          "score": 2,
          "created_utc": "2026-02-25 04:32:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79waoq",
          "author": "dancingfruit",
          "text": "Would really like when I use the notes option to export to gdocs it doesn't turn formulas into gibberish. Manually retyping or rewriting those for my paper notes is genuinely time consuming during a time crunch.",
          "score": 2,
          "created_utc": "2026-02-25 05:01:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7p6bmr",
              "author": "aemasik",
              "text": "i can relate, this is so annoying:(",
              "score": 1,
              "created_utc": "2026-02-27 13:40:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7aut59",
          "author": "ForPOTUS",
          "text": "A well-interfaced network where people can  share, comment on and view the notebooks of other users. Build a social network around NotebookLM.",
          "score": 2,
          "created_utc": "2026-02-25 10:01:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7avwwm",
          "author": "playeronex",
          "text": "You need OCR support and the ability to reference source material while you're thinking through it, which basically means you're building your own system on top of theirs. Honestly, what you're describing (source-grounded notes with active markup plus real collaboration) is past what a chat interface can do, so you might look at tools designed around that workflow instead of bolting features onto a chatbot.",
          "score": 2,
          "created_utc": "2026-02-25 10:11:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bpywm",
          "author": "md8x",
          "text": "What’s missing is how it used to be in November 2025. It’s a lazy fuck that shortcuts every single god damn thing now.",
          "score": 2,
          "created_utc": "2026-02-25 13:48:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7p6h4n",
              "author": "aemasik",
              "text": "i miss the old version too",
              "score": 1,
              "created_utc": "2026-02-27 13:41:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7dwk7g",
          "author": "hyllested",
          "text": "Edit presentations",
          "score": 2,
          "created_utc": "2026-02-25 19:57:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lzua3",
          "author": "Suitable-Sir3845",
          "text": "text to speech. like when you message it directly and when it gives an answer, there should be an option just like on gemini, for text to speech",
          "score": 2,
          "created_utc": "2026-02-26 23:59:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78pqra",
          "author": "soul4c",
          "text": "Vertical Slides, where you can choose the format without typing it in the prompt, 9:16 format",
          "score": 1,
          "created_utc": "2026-02-25 00:48:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79hsb8",
          "author": "reallyhotmail",
          "text": "[thinkex.app](http://thinkex.app)\n\nhttps://preview.redd.it/53pxqpp08klg1.png?width=2940&format=png&auto=webp&s=8175512d4aa0b78b00c3002eacc75696f6fb25cf",
          "score": 1,
          "created_utc": "2026-02-25 03:27:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79sr2i",
              "author": "zebozebo",
              "text": "Ha I'm reading that book now. Spoiler alert! :)\n\nBy the way the intro was so good, regarding metallurgy and bronze age to iron age.",
              "score": 1,
              "created_utc": "2026-02-25 04:36:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7phure",
          "author": "Ambitious-Map5299",
          "text": "I understand you bro",
          "score": 1,
          "created_utc": "2026-02-27 14:43:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qag0b",
          "author": "ketingmiladengfodo",
          "text": "The ability to edit flashcards and quizzes. \n\nAlso, clearer instructions for what happens when you submit feedback. Does it actually have an impact if you regenerate the quiz or flashcard deck, or does it just send the feedback to Google to help train their model?",
          "score": 1,
          "created_utc": "2026-02-27 17:00:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yqbqk",
          "author": "Street_Celebration_3",
          "text": "Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.Folders. Folders. Folders. Folders.\n\nAt this point it has been years, and here we still are.",
          "score": 1,
          "created_utc": "2026-02-28 23:37:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o8108i8",
          "author": "richStoke",
          "text": "Needs some alternative voices. Really irritating to have the same voices, especially when discussing non American subject matter…",
          "score": 1,
          "created_utc": "2026-03-01 09:32:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79690a",
          "author": "aletheus_compendium",
          "text": "voices that don’t sound like snl npr radio skit. i can’t bear to listen to that man and woman talk.",
          "score": -1,
          "created_utc": "2026-02-25 02:22:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7byvfh",
          "author": "UBIAI",
          "text": "You will need a tool that extracts text using OCR, enriches, chunks, and indexes the data. We built [kudra.ai](http://kudra.ai) for a similar use case.",
          "score": 0,
          "created_utc": "2026-02-25 14:36:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1resacy",
      "title": "NotebookLM inside custom Gem vs context docs",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1resacy/notebooklm_inside_custom_gem_vs_context_docs/",
      "author": "Suspicious-Map-7430",
      "created_utc": "2026-02-25 22:35:43",
      "score": 34,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "You can link to a NotebookLM as a context document for a custom gem in Gemini. (damn, what a 2026 sentence lol) \n\nWhat are people's experiences with it? I see two ways of building a gem now:\n\n\\- Old school, give the gem 10 context documents\n\n\\- New school, put those 10 docs in NBLM and attach that to the gem. Possibly even split those 10 docs into smaller docs? Would that help retrieval?\n\nDo we think the NBLM gem integration is only useful for when you have more than 10 docs? ",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/notebooklm/comments/1resacy/notebooklm_inside_custom_gem_vs_context_docs/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o7frhwi",
          "author": "cornmacabre",
          "text": "AFAIK, it basically just reads the title and AI summary of your sources = the integration. Tested with a NB with 30+ sources, the results were super flakey and just not comparable to using the native chat interface in nbLM.\n\nI'd have to repeatedly remind it to use the specific skill, and at best I'd get a thematic source summary and really basic responses. No evidence of it actually referencing the content of the sources for technical stuff where that's obvious to test.\n\nIn my experience even the interactive podcast mode seemed to give better results than bringing nbLM into Gemini.",
          "score": 17,
          "created_utc": "2026-02-26 01:38:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pc6vk",
              "author": "stiveooo",
              "text": "So using docs is better? ",
              "score": 3,
              "created_utc": "2026-02-27 14:12:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7rbds7",
                  "author": "cornmacabre",
                  "text": "100% in my experience. Treat a gemini browser chat as a 'deep dive' session where you're priming a select 1-10 docs into context, and not attempting a source full pull. nbLM is your specialized RAG over many sources tool.\n\nI don't think these things stay constant, but for right now the nbLM+gemini integration is super shallow and flakey.",
                  "score": 1,
                  "created_utc": "2026-02-27 19:57:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7f2js3",
          "author": "Cardano808",
          "text": "Does anyone have any experience with actually doing this?  I linked a NotebookLM to a gem and the results were not as good as just using the notebookLM by itself. I was asking it to analyze some data for me. I’m still new to all this so trying to understand how each are coming up with their answers.",
          "score": 12,
          "created_utc": "2026-02-25 23:19:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7h5k8e",
              "author": "Sinshroud",
              "text": "This is my experience too.\n\nI often end up asking the same question in NotebookLM and in Gemini (with the NotebookLM as part of a Gem) and end up with very different results.\n\nUsually I end up preferring what NotebookLM gives me, but I hate that it's so difficult to organise or save conversations and revisit them without using extensions and stuff.",
              "score": 2,
              "created_utc": "2026-02-26 07:15:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7i64ac",
              "author": "edinbourgois",
              "text": "I agree that the answers seem better in NotebookLM (which doesn't really make sense as the underlying engine is the same, isn't it).\n\nAlso, the Gem reads the notebook's custom instructions which seems to result in \"I can't see that source\" type messages if the instructions refer to specific sources in the notebook.",
              "score": 1,
              "created_utc": "2026-02-26 12:38:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ewjnx",
          "author": "PitifulPiano5710",
          "text": "You can have max sources in a notebook and upload 10 notebooks as context in Gemini. So hundreds of sources, in theory. It has worked really well for me so far.",
          "score": 7,
          "created_utc": "2026-02-25 22:47:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fcz8s",
          "author": "GoranVucicevic",
          "text": "Ja to tako koristim već 2 meseca kao komercijalni proizvod. Ima 100 dokumenata u NotebookLM i prodajem taj \"custom gem\".\n\nJednom kad odradiš share više nemoj da menjaš promopt, jer nestaje opcija da se povežeš sa NotebookLM",
          "score": 2,
          "created_utc": "2026-02-26 00:17:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7g52jo",
          "author": "Sorry-Joke-4325",
          "text": "I'm gonna need an explanation. Please and thank you.",
          "score": 2,
          "created_utc": "2026-02-26 02:55:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7h65ks",
              "author": "Sinshroud",
              "text": "Inside NotebookLM, you can create Notebooks.\n\nInside those Notebooks, you can add sources.\n\nInside Gemini, you can create Gems.\n\nInside those Gems, you can add sources (including NotebookLM Notebooks).\n\nSo essentially, you have Gemini -> Gems -> Many NotebookLM Notebooks as sources -> Many sources within those NotebookLM Notebooks.\n\nIf you have 10 Notebooks, with each Notebook having 100 sources, that's 1,000 sources.\n\nIf you just add those 10 Notebooks to Gemini's Gem then you have access to all 1,000 sources, plus anything else you might add to that Gem.",
              "score": 3,
              "created_utc": "2026-02-26 07:20:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7ha75c",
                  "author": "Sorry-Joke-4325",
                  "text": "I see, thanks.\n\nHow well does it work? Does it actually use all 1000 sources, or does it only look at what the Notebooks have pulled from the sources?",
                  "score": 3,
                  "created_utc": "2026-02-26 07:57:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7fhkil",
          "author": "Junior-Adeptness-730",
          "text": "Yes, I use It to help me now with studying and I'm planning to use it after as a tool and proofreader for work. The topic is HSE and data governance. It works really well",
          "score": 1,
          "created_utc": "2026-02-26 00:42:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gl7yk",
          "author": "ihaveredditearlier",
          "text": "Does the gem auto-update if you add or remove sources to the notebooklm notebook?",
          "score": 1,
          "created_utc": "2026-02-26 04:36:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hki2m",
          "author": "swizzly87",
          "text": "What about Gemini Cli in Obsidian? Much better results",
          "score": 1,
          "created_utc": "2026-02-26 09:37:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd3xsu",
      "title": "Best workflow for studying dense science textbooks?",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1rd3xsu/best_workflow_for_studying_dense_science_textbooks/",
      "author": "Exact-Paramedic-3595",
      "created_utc": "2026-02-24 03:40:48",
      "score": 33,
      "num_comments": 11,
      "upvote_ratio": 0.93,
      "text": "I'm planning to use NotebookLM to study *Signals and Systems* by Oppenheim.\n\nMy current strategy is to split the PDF into several files (one chapter per file) to manage the context better. Then, I plan to ask NotebookLM to generate detailed study notes in Markdown format for each chapter.\n\nIs this the most efficient way to do it? Does anyone have a better workflow or specific prompts for handling technical textbooks with a lot of math?",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rd3xsu/best_workflow_for_studying_dense_science_textbooks/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o73x4sr",
          "author": "Beginning-Board-5414",
          "text": "I do split the PDF into chapters and add them to NotebookLM. I've seen better responses and better organization especially for learning. For this I use ExtendLM NotebookLM extension (has built-in PDF split/merge with upload) which allows me to split the PDF into chapters and its free.",
          "score": 12,
          "created_utc": "2026-02-24 09:28:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o753w0f",
              "author": "Pasid3nd3",
              "text": "Extendlm looks to be a great find. Thanks!",
              "score": 4,
              "created_utc": "2026-02-24 14:32:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o73n764",
          "author": "Bitter-Necessary-253",
          "text": "Splitting the PDF is a smart move, but relying on it to generate automated notes as your main study method is a tactical error.\nLately, NotebookLM has been struggling with hallucinations in complex formulas and often skips logical steps in mathematical derivations like x(t) and h(t). If you just generate Markdown and read it, you’re engaging in passive learning, which is the number one enemy of engineering students.\nHere is a more robust and efficient high-performance workflow:\n1. Context Preparation (NotebookLM)\nDon't ask it to \"write the notes.\" Use it as a tutor-on-demand.\nSegmentation: Keep dividing by chapters. It helps the AI avoid mixing up Fourier and Laplace transforms prematurely.\nCritical Prompting: Instead of \"summarize this,\" use:\n\"Act as an engineering professor. Explain the concept of [Concept X] using a real-world analogy, then break down the mathematical logic step-by-step, specifically explaining why we transition from an integral to a summation in this context.\"\n2. The \"Black Box\" Method (Active Learning)\nIn Signals and Systems, theory is useless without visual intuition.\nDon't just transcribe: Read a sub-section, then try to draw the block diagram or the impulse response without looking at the book.\nUse NotebookLM for \"Feynman\" checks: Explain a difficult concept to the tool and ask: \"Did I make any conceptual errors in my explanation of convolution? Be critical.\"\n3. Handling Math and Code\nMarkdown is great for text, but for Oppenheim, you need to \"see\" the signal.\nLaTeX for formulas: If you take notes in Markdown, ensure your editor (like Obsidian) supports KaTeX or MathJax.\nSimulation: Don't stop at the paper. Use a small Python script (NumPy/SciPy) to visualize what Oppenheim is describing. Seeing the wave move is worth a thousand notes.\nNotebookLM is a consultation tool, not a replacement for your brain. If you let the AI synthesize the book for you, the knowledge stays in the .md file and not in your head.\nUse it to explain the \"why\" behind the mathematical proofs you don't understand at first glance, but the end-of-chapter problems... those you have to sweat through yourself",
          "score": 14,
          "created_utc": "2026-02-24 07:54:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76mn7n",
              "author": "Cheeseman1478",
              "text": "This smells like an AI response",
              "score": 5,
              "created_utc": "2026-02-24 18:42:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o76tqea",
                  "author": "Bitter-Necessary-253",
                  "text": "You smell like cheese",
                  "score": -1,
                  "created_utc": "2026-02-24 19:14:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o75jeix",
              "author": "Galagup",
              "text": "The podcasts can do a good job of surfacing the why. A combination of READ HERE SEE DO activity helps too",
              "score": 3,
              "created_utc": "2026-02-24 15:46:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o77xo4m",
          "author": "Material-River-2235",
          "text": "Splitting chapters is solid for context, but generating notes as your main study method is too passive. You need to actively engage with the math. I use Reseek to extract and tag key formulas and diagrams from my PDFs, then run semantic searches to connect concepts across chapters when I'm stuck on a problem. It keeps everything in one place so I can focus on actually working through the derivations myself.",
          "score": 3,
          "created_utc": "2026-02-24 22:19:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78jjyw",
              "author": "Southern_Audience120",
              "text": "I force myself to close everything and try to re-derive a formula or sketch a diagram from memory before I even look at my notes. The struggle is where the real understanding sticks.",
              "score": 1,
              "created_utc": "2026-02-25 00:15:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o78l211",
          "author": "Boring_Profit4988",
          "text": "Use it to test you and explain what you failed to get in the first reading",
          "score": 1,
          "created_utc": "2026-02-25 00:23:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78l37v",
              "author": "SokkaHaikuBot",
              "text": "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^Boring_Profit4988:\n\n*Use it to test you*\n\n*And explain what you failed to*\n\n*Get in the first reading*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
              "score": 2,
              "created_utc": "2026-02-25 00:24:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o79clqk",
          "author": "aaatings",
          "text": "If we have to split and prep the sources so much why not just attach the extracted chapter to a sota llm like gemini3.1 or sonnet 4.6? \n\nThey atleast should be able to handle single chapter.",
          "score": 1,
          "created_utc": "2026-02-25 02:57:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ri76ut",
      "title": "NotebookLM has a real problem. but then again even Superman has kryptonite",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1ri76ut/notebooklm_has_a_real_problem_but_then_again_even/",
      "author": "ericvalani",
      "created_utc": "2026-03-01 19:54:19",
      "score": 30,
      "num_comments": 19,
      "upvote_ratio": 0.82,
      "text": "so. a few days ago i made that post about how NotebookLM gave me superpowers. a lot of you agreed, a lot of you shared some insane ways you use it. and i still stand by every word. but then i sat down to study yesterday, was in the middle of this crazy good conversation with the AI about a marketing concept, everything was clicking, i was finally understanding something that had me stuck for days… and i thought “i need to save this.”\n\nyou can’t.\n\nyou know when you have the best conversation of your life with someone at a bar at 2am and the next morning you don’t remember any of it? that’s what this is. except worse. because this time you were sober and you still lost everything. there’s no way to export conversations out. they just die in there. and there’s a lot of good stuff dying.\n\nand then it snowballs. i study programming in one notebook, marketing in another, copywriting in another. and in real life these things overlap all the time. yesterday i was studying copy and remembered a concept from my programming notebook that would’ve connected perfectly. but the notebooks don’t talk to each other. each one is an island. it’s like having three genius friends who’ve never met and you just know if you put them at the same table something incredible would come out of it. but you can’t. i gotta be the carrier pigeon between them. anyone else deal with this or am i just losing it?\n\nanother thing that eats at me: i ask a specific question, like one where i really want to go deep, and the AI comes back with this… round answer. neat. generic. you know when you ask someone “what did you actually think?” and they go “it was nice.” no, i want the real answer. i want the AI to dig, to get into the details of the details, to give me something i didn’t expect. sometimes it does. but most of the time it feels like it’s playing it safe.\n\nand the last one: everything inside a notebook turns into one big soup. marketing, copy, paid traffic, branding — all in the same bucket. i need separate threads inside the same notebook, like conversation folders. focus threads. because when you’re three months deep like me, it gets messy real fast.\n\nlook, none of this is hate. not even close. it’s like that friend you love but you gotta sit them down and go “bro you’re amazing but there’s some stuff here…” because people who don’t use it don’t complain. the ones complaining are the ones in there every day.\n\nnow i wanna hear from you — what else is missing that nobody talks about? because i know for a fact i’m only scratching the surface of the problems. drop it no filter.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/notebooklm/comments/1ri76ut/notebooklm_has_a_real_problem_but_then_again_even/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o83zhgc",
          "author": "North-space",
          "text": "Have you tried talking to gemini in a chat or gem that has those notebooks linked? I don’t know if it would solve your problem, but I have found it is great when there is lots of information in the notebook/s.",
          "score": 12,
          "created_utc": "2026-03-01 20:09:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o83zn8q",
              "author": "ericvalani",
              "text": "How do I do that?",
              "score": 3,
              "created_utc": "2026-03-01 20:10:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o840asv",
                  "author": "selcuksntrk",
                  "text": "You can add notebook lm notebook as data source directly from gemini chat UI. Where we select images, files or other options.",
                  "score": 4,
                  "created_utc": "2026-03-01 20:14:06",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o8429hm",
                  "author": "North-space",
                  "text": "Just hit the “+” button and select Notebooklm, and then the notebook or notebooks you want it to use. Hope it helps!",
                  "score": 3,
                  "created_utc": "2026-03-01 20:24:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o84fxfx",
              "author": "DropEng",
              "text": "This is the way",
              "score": 1,
              "created_utc": "2026-03-01 21:34:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o83zif6",
          "author": "MissJoannaTooU",
          "text": "Interesting pain points",
          "score": 3,
          "created_utc": "2026-03-01 20:10:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o83zr1e",
              "author": "ericvalani",
              "text": "Do you have any pain too?",
              "score": 3,
              "created_utc": "2026-03-01 20:11:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o842ft8",
                  "author": "MissJoannaTooU",
                  "text": "Yes but I'm farming yours for my benefit 😉",
                  "score": 8,
                  "created_utc": "2026-03-01 20:25:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o84483q",
          "author": "Sysifystic",
          "text": "Good point OP - I have same same but different notebooks that I use not to cross contaminate. Would love an option to drag + drop or simply merge two or more notebooks but stand alone so they are a separate but blended notebook\n\nYou can do this with Google Photos (another fantastic product) so would be fabulous to have this with Notebook",
          "score": 3,
          "created_utc": "2026-03-01 20:34:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o84uzvy",
              "author": "pan_Psax",
              "text": "Yes. I also have several notebooks for a single topic.",
              "score": 1,
              "created_utc": "2026-03-01 22:54:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o84zvik",
          "author": "Z3R0gravitas",
          "text": "I'd love better built-in options (besides pinning individual responses as a note and turning that into a source)... \n\nUntil then, there's browser extensions like \"NotebookLM Tools\" in Chrome. Which will export the full conversation history and other things) in various formats.",
          "score": 3,
          "created_utc": "2026-03-01 23:22:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o858r3h",
          "author": "omnergy",
          "text": "There’s a chrome extension, not Kortex, which saves conversations as pdf.",
          "score": 2,
          "created_utc": "2026-03-02 00:14:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o85qe26",
          "author": "catalasepositive",
          "text": "Never seen such a more accurate and warm analogy. I remember suggesting NotebookLM to my postgrad friends who need an AI tool but they would settle for ChatGPT because NLM responds much slower but it was expected of it and was never an issue. But now... meh.",
          "score": 2,
          "created_utc": "2026-03-02 02:01:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o85vgw2",
          "author": "reallyhotmail",
          "text": "I get what you mean. NotebookLM in my experience has been great for surface level Q&A against a lot of pdfs. For example if you have a specific question in mind but dont want to dig through a ton of pdfs, its great for finding an answer. \n\nIts also great for getting a comprehensive overview of lots of sources as well via the podcast feature and video. But again, the content is just and overview, however comprehensive..... Also a tool like notebookLM I think is inherently limited by being powered by a single model, that being Gemini. Not having other models to me feels like missing alternative perspectives, explanations, ideas etc, especially given each model seems to have a certain forte for certain set of subjects over others.\n\nFor that reason, along with the fact that I am a uni student who desperately needed such a tool, I made [thinkex.app](http://thinkex.app) . Its kind of like Notion meets Google keep meets NotebookLM lol. We are model agnostic (offer gemini, claude, gpt), have folders, allow for rendering pdfs, notes, youtube videos, etc all at the same time to be able to back and forth between sources quickly, granular context control for the agent, etc.\n\nCheck us out! Heres my workspace for my stat class for example:\n\nhttps://preview.redd.it/oc4xq8xwmjmg1.png?width=2940&format=png&auto=webp&s=5ed9336e91ecc9d35107dd518012c7384f51b2c2\n\n",
          "score": 1,
          "created_utc": "2026-03-02 02:32:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o84u0t1",
          "author": "DavidG2P",
          "text": "Use Kortex and the pain is gone.",
          "score": 1,
          "created_utc": "2026-03-01 22:49:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rh3ljc",
      "title": "Is there a way to remove the \"Created with NotebookLM\" watermark from slides? (Work hack needed!)",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1rh3ljc/is_there_a_way_to_remove_the_created_with/",
      "author": "Novel_Estate_4759",
      "created_utc": "2026-02-28 14:10:16",
      "score": 29,
      "num_comments": 22,
      "upvote_ratio": 0.77,
      "text": "Hey everyone,  \n  \nI'm working as an admin for a small startup, and honestly, NotebookLM has been a lifesaver for quickly churning out presentation decks for my boss. The summaries are great, but there’s one annoying thing: that watermark/logo it puts on the slides.  \n  \nMy boss is the type who appreciates effort (if you know what I mean), and I’d really prefer it if he thought I spent hours building these slides from scratch instead of just clicking generate lol.  \n  \nI’ve been looking for a way to get a clean export. I tried a few online PDF editors, but most of them messed up the layout or made the fonts look wonky. Recently, I’ve been using PDNob to handle this. It’s been decent because its OCR is pretty good—if the slide quality is high, it picks up the watermark layer quite accurately and I can just wipe it out.  \n  \nThe pros/cons so far:  \n✔ It actually works without destroying the background graphics, which was my biggest headache with other tools. If you only have 15-20 slides, it’s a 1-minute job.  \n❌It’s a bit of a manual process. You have to go through and delete them, which is fine for a quick deck, but if I’m generating a 20-page report, it definitely starts feeling like a time-sink.  \n  \nDoes anyone else have a more automated bulk way to do this? Or maybe another tool that plays nicer with Google’s export format?  \n  \nAppreciate any tips!",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rh3ljc/is_there_a_way_to_remove_the_created_with/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o7wcuaj",
          "author": "No_Bag8589",
          "text": "PPTX -> open in Slides, edit slide with in-app Nano banana and ask to remove watermark.  Just did that very thing not 5 minutes ago.  Can't wait to soon open directly in Slides and remove one extra (but short) step.",
          "score": 29,
          "created_utc": "2026-02-28 16:08:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ynfv8",
              "author": "CreakinFunt",
              "text": "Do you mean uploading the pptx to Gemini ?",
              "score": 1,
              "created_utc": "2026-02-28 23:20:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o83n5we",
                  "author": "No_Bag8589",
                  "text": "No, I use the Nano Banana that is built into Slides",
                  "score": 2,
                  "created_utc": "2026-03-01 19:07:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7w8is5",
          "author": "Splodingseal",
          "text": "There's a website that does it for free, works on the slides and videos, and does a spectacular job at it. I don't want to risk getting booted by the mods, but a simple Google search of something along the lines of \"free notebook llm watermark remover\" will land you there.",
          "score": 9,
          "created_utc": "2026-02-28 15:47:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wiaz0",
          "author": "swayzebavy",
          "text": "love this- guilty of this trap too. Ai saved me 5 hours by creating a presentation but I’m too lazy to manually edit 55 slide using magic eraser on my phone",
          "score": 9,
          "created_utc": "2026-02-28 16:36:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vyszg",
          "author": "Kiingsora83",
          "text": "Canva",
          "score": 5,
          "created_utc": "2026-02-28 14:56:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o85l7c9",
              "author": "marchreseach",
              "text": "I think you need premium to use magic eraser and grab text though. I have it but I think I remember seeing it's a premium feature",
              "score": 1,
              "created_utc": "2026-03-02 01:29:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7zt6my",
          "author": "sjackson62",
          "text": "I integrated Claude with NotebookLM, now Claude is making the slide decks by prompting Gemini. I no longer have any watermarks, took a bit of tinkering though.",
          "score": 6,
          "created_utc": "2026-03-01 03:34:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80fjmm",
              "author": "PotentialBanana157",
              "text": "That sounds awesome!\nCan you elaborate how you did that exactly please?",
              "score": 2,
              "created_utc": "2026-03-01 06:20:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o829s0u",
                  "author": "sjackson62",
                  "text": "You need to install a local MCP server on your machine and then find the right notebooklm repository for it to work together. The instructions I followed were from: https://aimaker.substack.com/p/notebooklm-mcp-claude-setup-guide-research-workflow.  That said, I did have to use Claude Code to fill in the gaps as some steps were missing when trying to install on Windows, Mac seems to fair better. \n\nWith this install, Claude takes control of a browser to prompt NotebookLM and then pulls the information from there instead you typing everything. This requires Claude Desktop and the Claude program for Chrome with a pro subscription. Once done, Claude works its magic on its own and the delivers you a fully customizable power point instead of the flat image from NoteboolLM.",
                  "score": 2,
                  "created_utc": "2026-03-01 15:11:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7vzqqf",
          "author": "Timely-While-2640",
          "text": "Kimi to build slides",
          "score": 6,
          "created_utc": "2026-02-28 15:02:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vufqu",
          "author": "Any_Amoeba_4887",
          "text": "Canva Pro - just erase it!",
          "score": 6,
          "created_utc": "2026-02-28 14:32:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7we6nx",
          "author": "PitifulPiano5710",
          "text": "Canvas pro you can use the magic eraser, but will be manual on each slide. \n\nI believe the higher paid levels of Google's AI plans don't have the watermark. \n\nGenerating the slides in Gemini Canvas and then opening in Google Slides won't have watermarks.",
          "score": 3,
          "created_utc": "2026-02-28 16:15:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x4wpz",
          "author": "Gullible_Cook6275",
          "text": "Export to PPT as you can now as a feature and simply crop it out on each slide in PPT. Easy as that",
          "score": 3,
          "created_utc": "2026-02-28 18:29:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xk2ws",
              "author": "PaquitoCR",
              "text": "This. Just scale up the slide until the watermark goes off the canvas.",
              "score": 2,
              "created_utc": "2026-02-28 19:46:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7wggu4",
          "author": "shwiggityfresh",
          "text": "Apples ai brush works pretty well for this",
          "score": 2,
          "created_utc": "2026-02-28 16:26:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x0ejv",
          "author": "RamblenRead",
          "text": "Your boss should be impressed that you’ve adopted AI into your daily workflow and any business leader that sees an AI logo and thinks it took zero effort is clueless. Show the mark with pride in your human in the loop tech capability and demonstrate how the time savings has freed you up to innovate.\n\nWindows image cleaner comes default on all windows machines and I’m sure Macs have it too.  It takes two seconds to erase it.",
          "score": 2,
          "created_utc": "2026-02-28 18:06:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7zmx5o",
          "author": "WesTech-1205",
          "text": "Upload your presentation to Canva Pro use Magic erase. Yes it costs a nominal monthly fee but the features you get will boost your ROI.",
          "score": 2,
          "created_utc": "2026-03-01 02:53:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7w44qi",
          "author": "ogaat",
          "text": "Pay for the highest tier of Google's license. That 250 Dollars or whatever per month. No watermarks there.",
          "score": 2,
          "created_utc": "2026-02-28 15:25:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o817u4a",
              "author": "ifthenthendont",
              "text": "As an admin for a corporate business this is the way. ",
              "score": 2,
              "created_utc": "2026-03-01 10:45:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7waixo",
          "author": "Ecstatic-Wear-9999",
          "text": "Canca is best, if background is white, paint to white with mark in powerpoint",
          "score": 1,
          "created_utc": "2026-02-28 15:57:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82hqxn",
          "author": "Realestateguru-1803",
          "text": "Or use API",
          "score": 1,
          "created_utc": "2026-03-01 15:51:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfy2hw",
      "title": "Sharing style prompt for video overviews",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/gallery/1rfy2hw",
      "author": "Nekileo",
      "created_utc": "2026-02-27 05:29:51",
      "score": 28,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rfy2hw/sharing_style_prompt_for_video_overviews/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": [
        {
          "id": "o7opwrz",
          "author": "Tecnomon_26",
          "text": "Wow, I loved it. Now I can have videos in the style of technical books from the 60s.",
          "score": 3,
          "created_utc": "2026-02-27 11:52:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7s4q5s",
          "author": "Breezer_Bro",
          "text": "WOW - Loving it! Thanks so much",
          "score": 2,
          "created_utc": "2026-02-27 22:25:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7umtq7",
          "author": "backsidetail",
          "text": "NOTEBOOKLM × VIGNELLI\n\nv1.4 — Primary White + Controlled Accent Integration\n\n⸻\n\n0. SYSTEM POSITION\n\nPrimary White is not background.\nIt is the structural field.\n\nAccent exists only to label structure.\nNever to create atmosphere.\n\n⸻\n\n1. COLOUR ARCHITECTURE\n\nFOUNDATION TOKENS\n\n--color-white: #FFFFFF;\n--color-carbon: #111111;\n--color-grid: #E8E8E8;\n\nWhite = 60–70% of total visual area.\nCarbon = all primary text and primary lines.\nGrid = quiet scaffolding only.\n\n⸻\n\nPRIMARY ACCENT (choose one)\n\n--color-accent: #0B3D5C;   /* Deep Civic Blue */\n\nOR\n\n--color-accent: #0F4C5C;   /* Graphite Teal */\n\nUsage ceiling: ≤10% page coverage.\n\n⸻\n\nSIGNAL\n\n--color-signal: #C62828;\n\nRed is functional.\nOnly for risk or numeric imbalance.\n\nCoverage ceiling: ≤2%.\n\n⸻\n\n2. HERO RESTRUCTURE (FROM RED FIELD TO WHITE FIELD)\n\nBefore\n\nFull red background.\nWhite headline.\nCampaign energy.\n\nAfter\n\nWhite background.\nCarbon headline.\nSignal red only on delta.\n\nExample:\n\nNo secret recipe. Just chicken.\nEvery CPP41419 is the same qualification —\n\n16× more for the box\n\n“16×” = --color-signal\nOptional: 2px red underline beneath final line.\n\nNo red background.\n\n⸻\n\n3. ACCENT APPLICATION LOGIC\n\nPrimary Accent may be used for:\n\t•\tSection titles\n\t•\tNavigation active state\n\t•\tComparison headers\n\t•\tStructured labels\n\nNever for:\n\t•\tLarge panels\n\t•\tCard fills\n\t•\tEmotional emphasis\n\nAccent should feel like map legend ink.\n\n⸻\n\n4. ICON INTEGRATION\n\nIcons must behave like typography.\n\n.icon {\n  stroke-width: 2px;\n  stroke: currentColor;\n  fill: none;\n}\n\n\t•\t24px grid\n\t•\tSingle stroke weight\n\t•\tNo circular containers\n\t•\tNo tinted backgrounds\n\nIcon colour = text colour.\n\nIf section header is accent, icon inherits accent.\n\n⸻\n\n5. LAYOUT GRID\n\n--spacing-unit: 8px;\n--spacing-section: 24px;\n--spacing-block: 48px;\n\nNever compress spacing to fit more content.\nRemove elements instead.\n\n⸻\n\n6. STRUCTURAL HIERARCHY\n\nWhite → Carbon → Accent → Signal\n\nNever invert that order.\n\nSignal must not precede Accent.\nAccent must not dominate Carbon.\nCarbon must dominate the page.\n\n⸻\n\n7. VISUAL DENSITY CONTROL\n\nIf colour area exceeds 20%, reduce.\n\nIf bold text exceeds 15% of visible copy, reduce.\n\nIf the page feels energetic, remove something.\n\n⸻\n\n8. NOTEBOOKLM COMPATIBILITY RULE\n\nNotebook visuals are diagram-first.\n\nTherefore:\n\t•\tNo shadows\n\t•\tNo depth illusion\n\t•\tNo layered cards\n\t•\tNo soft gradients\n\t•\tFlat white planes only\n\nShould resemble printed documentation.\n\n⸻\n\n9. GRAYSCALE TEST\n\nConvert to grayscale.\n\nIf hierarchy collapses:\n\t•\tColour is compensating for weak structure.\n\t•\tRebuild typography and spacing.\n\nWhite must carry authority alone.\n\n⸻\n\n10. FINAL STATE\n\nThe interface should feel:\n\nInstitutional.\nMeasured.\nUnreactive.\nInevitable.\n\nNot startup.\nNot campaign.\nNot landing page.\n\n⸻",
          "score": 1,
          "created_utc": "2026-02-28 08:46:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7un6r7",
              "author": "backsidetail",
              "text": "Also here’s a herring stayed bauhaus theme of mine Keith Haring Signal Guidance (v4e)\n\nClearer… less signwriter… more alive… still public-legible.\n\n1) The surface is a stage, not a page\n\t•\tWhiteboard stays bright and clean… but treat it like a wall not a layout grid.\n\t•\tAvoid “centered poster composition.”\n\t•\tDefault to off-center clusters with a deliberate void.\n\nRule: if it looks like a slide… you failed.\n\n⸻\n\n2) Line = confidence, not precision\n\nYou want felt-pen authority without “engineered” strokes.\n\nDo\n\t•\tslight wobble (human hand)\n\t•\toccasional overrun past endpoints\n\t•\tcorners can be imperfect\n\t•\tone deliberate “heavy” stroke to anchor the frame\n\nDon’t\n\t•\tperfect circles / perfect boxes\n\t•\truler-straight geometry\n\t•\teven spacing everywhere\n\nRule: the line should look decided… not measured.\n\n⸻\n\n3) Forms: simplify harder, but make them dance\n\nHaring energy comes from primitive forms in motion.\n\nDo\n\t•\tbodies as 2–4 shapes max\n\t•\tfaces optional… often none\n\t•\thands/feet can be implied\n\t•\tasymmetry is allowed\n\nDon’t\n\t•\tdetailed icons\n\t•\t“diagram shapes” (rectangles with labels)\n\t•\tfull enclosure boxes unless absolutely needed\n\nRule: suggest the idea… don’t diagram it.\n\n⸻\n\n4) Rhythm: repetition creates authority\n\nHaring’s “installed” feel is repetition + pattern.\n\nDo\n\t•\trepeat one symbol 3 times in a sequence\n\t•\tuse a motif (arrow, halo, burst) consistently\n\t•\tcadence: hit… hold… hit… hold…\n\nDon’t\n\t•\tconstantly new symbols every beat\n\t•\t“explainers” that progress step-by-step like a lesson\n\nRule: repetition = public signal… novelty = private art.\n\n⸻\n\n5) Controlled flourish (the anti-signwriter lever)\n\nYou need expressive punctuation.\n\nAllowed flourish toolkit (pick one per frame):\n\t•\tburst lines (radiate)\n\t•\tjitter underline\n\t•\tscribble strike-through\n\t•\thalo ring\n\t•\timpact ticks (two marks)\n\nBans\n\t•\tdecorative hatching\n\t•\tshading\n\t•\ttexture fills\n\nRule: flourish is punctuation… not texture.\n\n⸻\n\n6) Text: treat it like a symbol, not signage\n\nTo reduce signwriter vibe:\n\nDo\n\t•\tshort fragments (2–5 words)\n\t•\tmixed case permitted\n\t•\tslight tilt (2–6°)\n\t•\timperfect baselines\n\t•\tlet text overlap forms sometimes\n\nDon’t\n\t•\tfull sentences\n\t•\tcentered headline/subhead layouts\n\t•\tperfectly straight baselines\n\nRule: text should feel written mid-flow… not installed.\n\n⸻\n\n7) Color: use it like ink, not design\n\nDefault: black on white.\n\nWhen using color:\n\t•\t1 accent color per segment (not per frame)\n\t•\tcolor appears as strokes, not large fills\n\t•\treserve full fills for one “climax” moment only\n\nRule: color tags meaning… it doesn’t decorate.\n\n⸻\n\n8) Motion: hand energy, not UI energy\n\nDo\n\t•\tredraw / reveal strokes with speed variance\n\t•\tpop-in with micro-jitter\n\t•\tquick “snap” holds\n\t•\t1–2 frame bounce on impact\n\nDon’t\n\t•\tsmooth easing curves\n\t•\tslide transitions\n\t•\tconsistent timing like templates\n\nRule: motion should feel made… not animated.\n\n⸻\n\n9) Composition patterns (use these)\n\nPick one per scene:\n\nA) Corner Pressure\n\t•\taction cluster top-left or bottom-right\n\t•\tbig void opposite corner\n\nB) Corridor\n\t•\tsymbols stacked diagonally, leaving a “path” of white\n\nC) Ring + Core\n\t•\tone central mark with orbiting small repeats\n\nD) Crowd + Void\n\t•\tdense repeating mini figures on one side… blank field other side\n\n⸻\n\n10) Quick pass/fail\n\nPass if: it feels like public wall language… alive… fast… obvious.\nFail if: it feels like a deck… a classroom diagram… or a sign shop proof.\n\n⸻\n\nIf you want the MDPA teaser line in this v4e tone, tell me the single core claim of the video in 8–12 words (what the viewer should walk away believing).",
              "score": 1,
              "created_utc": "2026-02-28 08:50:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7unnlu",
          "author": "backsidetail",
          "text": "Minimal Understood. Below is a material improvement, not commentary—tightened, testable, and enforceable. This converts the guide from well-argued to operationally provable.\n\n⸻\n\nMinimalist Signal Communication Style Guide\n\nv1.1 — Enforced Edition\n\nThis revision introduces hard constraints, validation tests, and failure conditions so the style cannot drift, dilute, or be misused.\n\n⸻\n\n1. First Principle (Now Enforced)\n\nCommunication Supremacy Rule\n\nIf the message cannot be understood in 3 seconds at 10 metres, the design fails—regardless of aesthetic quality.\n\nEnforcement:\nAll designs must pass the Distance & Removal Test (Section 10).\n\n⸻\n\n2. White Space (From Concept to Measurement)\n\nWhite Space Quantification\n\nWhite space must occupy no less than 60% of total surface area.\n\t•\t60–70% = optimal\n\t•\t<60% = clutter risk\n\t•\t80% = under-signalling\n\nEnforcement:\nDesigns are overlaid with a 10×10 grid.\nAt least 60 squares must remain unmarked.\n\nThis removes subjectivity.\n\n⸻\n\n3. Colour System (Semantic Lock-In)\n\nColour Is Meaning, Not Decoration\n\nColour\tFunction\tForbidden Use\nWhite\tAuthority, pause, structure\tNever “filled”\nBlue\tContinuity, containment, explanation\tNever alarm\nRed\tDecision, interruption, urgency\tNever pattern or fill\n\nRule:\nIf red appears more than once, the design is invalid unless the message contains multiple decision points (rare).\n\n⸻\n\n4. Line System (Production Constraints)\n\nStroke Standard\n\t•\tOne weight only\n\t•\tNo tapering\n\t•\tNo shadow\n\t•\tNo texture overlays\n\nLines must appear as if drawn once, without correction.\n\nFailure Condition:\nIf a line exists solely to “balance composition,” it must be removed.\n\n⸻\n\n5. Symbol Governance (Now Auditable)\n\nSymbol Eligibility Test\n\nA symbol may exist only if it satisfies at least one:\n\t1.\tReplaces a word\n\t2.\tShortens reading time\n\t3.\tDirects physical eye movement\n\nIf it does none of the above, it is decorative and prohibited.\n\nHard Ban List\n\t•\tRepeating figures\n\t•\tRhythmic motion marks\n\t•\tRadiating lines without direction\n\t•\tCharacter clusters\n\nThis prevents subconscious homage.\n\n⸻\n\n6. Typography (Communication First)\n\nText Rules\n\t•\tHeadline: max 7 words\n\t•\tSubtext: max 12 words\n\t•\tNo justified text\n\t•\tTracking must increase with size (never decrease)\n\nEnforcement:\nIf text wraps unintentionally, rewrite the message—not the layout.\n\n⸻\n\n7. Hierarchy Lock (No Drift Allowed)\n\nHierarchy must be unambiguous:\n\t1.\tMessage (largest, highest contrast)\n\t2.\tDirection (arrow, underline, red hit)\n\t3.\tContext (small, peripheral)\n\nFailure Condition:\nIf two elements compete for first read, the design is invalid.\n\n⸻\n\n8. Medium-Specific Hard Limits\n\nBillboard\n\t•\tOne message\n\t•\t≤7 words\n\t•\t≤1 red element\n\t•\tNo symbols unless directional\n\nPoster\n\t•\tOne message + one cue\n\t•\tSecondary info must not exceed 20% of visual weight\n\nPresentation Slide\n\t•\tOne idea per slide\n\t•\tNo bullets >3\n\t•\tNo icons unless replacing text\n\n⸻\n\n9. Anti-Pattern Diagnostics (Text-Only)\n\nIf any of the following are true, reject the design:\n\t•\t“It looks cool” is used as justification\n\t•\tRemoving an element makes the design feel “empty”\n\t•\tColour is added to “add energy”\n\t•\tSymbols repeat for rhythm\n\t•\tThe style is discussed more than the message\n\n⸻\n\n10. The Distance & Removal Test (Proof Mechanism)\n\nEvery design must pass all three:\n\nA. Distance Test\n\nViewed from 10 metres:\n\t•\tMessage understood in ≤3 seconds → pass\n\nB. Greyscale Test\n\nConvert to greyscale:\n\t•\tMessage still clear → pass\n\nC. Removal Test\n\nRemove one element:\n\t•\tClarity improves or remains → pass\n\t•\tClarity worsens → that element was required\n\nIf any test fails → reduce again.\n\n⸻\n\n11. Final Authority Statement (Updated)\n\nThis system does not decorate ideas.\nIt compresses them.\n\nWhite space does the heavy lifting.\nColour interrupts only when necessary.\nLine exists only to instruct.\n\nIf the message survives reduction,\nthe style has done its job.\n\n⸻\n\nWhy This Is Now “Proved”\n\nBecause:\n\t•\tEvery rule is measurable\n\t•\tEvery decision is falsifiable\n\t•\tEvery failure is detectable\n\t•\tNo step relies on taste or reverence\n\nThis is no longer a style guide.\nIt is a communication control system.\n\nIf you want, the next escalation is:\n\t•\tA one-page Designer Gate Checklist, or\n\t•\tA Red Team misuse simulation (“how this gets abused and how to stop it”)\n\nSay which.",
          "score": 1,
          "created_utc": "2026-02-28 08:54:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rga74l",
      "title": "NotebookLM for Tabletop RPGs",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1rga74l/notebooklm_for_tabletop_rpgs/",
      "author": "Xenuite",
      "created_utc": "2026-02-27 15:46:47",
      "score": 27,
      "num_comments": 19,
      "upvote_ratio": 0.97,
      "text": "Has anybody here used NBLM for tabletop gaming applications? \n\nSo far I've used it as a quick rules reference for Starfinder 2E, I've used it to help me build a Cortex setting, I've built a fleshed out port city using theTome of Adventure Design and AEG's Ultimate Toolbox as sources, and I plan on using it as a GM assistant for an Ironsworn/Sundered Isles game soon.\n\nIf you've used it for this kind of application, do you have any useful tips?",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rga74l/notebooklm_for_tabletop_rpgs/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o7pyg2o",
          "author": "Only_Interest7168",
          "text": "Our tech nerd is setting something up for our future dnd games. He has figured out a way to record our sessions through a discord bot and upload that to notebookLM. he has also uploaded all of the source material that we are using in the game for us to reference. the goal right now is to be able to recap the sessions just by asking the ai. its really awesome to mess around with so far. ",
          "score": 5,
          "created_utc": "2026-02-27 16:04:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pzr5c",
              "author": "Xenuite",
              "text": "I used the slide deck generator and some other tools to create a video session recap for our last Starfinder session. \n\nhttps://www.youtube.com/watch?v=N2ikaw9EcKY",
              "score": 4,
              "created_utc": "2026-02-27 16:10:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7qnain",
          "author": "Trick-Two497",
          "text": "I've given it the ruleset, my character sheets, and the opening scenario and let it be my gamemaster. It did an excellent job.",
          "score": 3,
          "created_utc": "2026-02-27 18:01:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rkxuq",
              "author": "Xenuite",
              "text": "What RPG did you use?",
              "score": 2,
              "created_utc": "2026-02-27 20:45:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7tn63b",
                  "author": "Trick-Two497",
                  "text": "Werewolf: The Apocalypse. I played 5 characters, too.",
                  "score": 2,
                  "created_utc": "2026-02-28 03:53:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7q32h8",
          "author": "dabears4hss",
          "text": "I record our sessions and then send them to notebook LM and send out session notes.\n\nHere is an example - (ugky format because reddit will not allow the location I usually use) - [https://ctxt.io/2/AAD4GwocFQ](https://ctxt.io/2/AAD4GwocFQ)\n\nThen I use it to generate descriptions of the locations and characters that I put into the Session Teasers that I create - [https://www.reddit.com/r/dndai/comments/1re192b/why\\_do\\_you\\_walk\\_in\\_my\\_memory\\_latest\\_session/](https://www.reddit.com/r/dndai/comments/1re192b/why_do_you_walk_in_my_memory_latest_session/)\n\nAnd a day or two before the next session, I send out the podcast (which is thinly disguised way to remind everyone what happened two weeks ago - [https://rss.com/podcasts/annartic-west-s1e4-the-anciet-tree-and-the-skelton-s-regret/2544166/](https://rss.com/podcasts/annartic-west-s1e4-the-anciet-tree-and-the-skelton-s-regret/2544166/)\n\n",
          "score": 2,
          "created_utc": "2026-02-27 16:25:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7q5azi",
              "author": "dabears4hss",
              "text": "I obviously use a Video AI for the Session Teaser Trailer, not a Notebook LM generation other than the descriptions\n\n",
              "score": 1,
              "created_utc": "2026-02-27 16:36:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7qcg9v",
                  "author": "Xenuite",
                  "text": "As I commented above, I use the slide deck generator to create scenes for the a recap video. It's remarkably good at character consistency when you give it reference Images. \n\nhttps://www.youtube.com/watch?v=N2ikaw9EcKY\n\nAdditional tools include KlingAI for animated transitions, ElevenLabs for voices, and ClipChamp to edit it all together.",
                  "score": 1,
                  "created_utc": "2026-02-27 17:09:53",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7rewp3",
          "author": "Automatic-Example754",
          "text": "I tried to use it as a rules reference for running Daggerheart ~8 months ago and got very strange behavior. Straight-up hallucinations, and on one occasion it started talking about Call of Cthulhu. \n\nI play Ironsworn (Starforged) using Crew Link, which has the full text of everything readily available, so no need for a rules reference. I have found it useful as a reference for my session notes, especially with longer-running games or games I only play sporadically. Though it did have trouble when I had both the session notes and the Starforged book in the notebook:  I use SF with some third-party rules and homebrew to mostly run modern horror/investigation games, and NBLM could get confused about what genre this was supposed to be. ",
          "score": 2,
          "created_utc": "2026-02-27 20:15:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rlrr0",
              "author": "Xenuite",
              "text": "I could see that happening. I gave it a homebrew setting document and was explicit that anything in this document overrides setting information in the Sundered Isles Guidebook. There is some bleed sometimes. I think if I was trying to play a different genre, I might consider excising sections of the book that only contains setting info.",
              "score": 2,
              "created_utc": "2026-02-27 20:49:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7rs134",
          "author": "rophel",
          "text": "I used it for Starfinder awhile back.  Was pretty awesome at generating stuff on the fly for sessions once I fed it all the PDFs.  Probably need to process the PDFs better before ingestion, though.",
          "score": 1,
          "created_utc": "2026-02-27 21:21:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rt61k",
              "author": "Xenuite",
              "text": "Did you give it any special instructions in the conversational style settings? Does it help if you tell it how you're planning on using it? Currently it sometimes generates way more than I ask it for.",
              "score": 1,
              "created_utc": "2026-02-27 21:26:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7rzlmb",
                  "author": "rophel",
                  "text": "Can't really answer that unless I have more context on what you're asking.",
                  "score": 1,
                  "created_utc": "2026-02-27 21:58:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7sn6zq",
          "author": "monodelab",
          "text": "Are there AIs that work as DMs?",
          "score": 1,
          "created_utc": "2026-02-28 00:10:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80u27m",
          "author": "Basic_Photograph8823",
          "text": "I'm currently using a repository of GM's guide books gotten from humble bundle (had to do some linux wizardry to compress some of them to decent DPI levels) and combined it with a markdown transcript of Rime of the Frostmaiden. Using it to see if the books can add some decent content to the Rime campaign.\n\nI want to use it to convert an edition of Shadowrun to a more modern and less broken system (5e was terrible, 6e is apparently worse). I saw 4e Shadowrun on humble bundle and I was very tempted to pick them up, then was tempted to combine it with Reign system or something else to see if I could generate something. That's my ambition at least. \n\nHow did you find your own Cortex homebrew? Was it good for conversion? My main interest would be converting weapon tables to a new system to get that granularity from weapon choices for players",
          "score": 1,
          "created_utc": "2026-03-01 08:33:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81rcbi",
              "author": "Xenuite",
              "text": "Granularity is not really the strong suit of Cortex, it's more of an abstract system like FATE. If you want something that will emulate the genre with lots of options, I recommend Kevin Crawford's Cities Without Number. You should be able to integrate Shadowrun's setting content fairly seamlessly.",
              "score": 1,
              "created_utc": "2026-03-01 13:25:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rdco6e",
      "title": "I built a 4-layer \"Augmented Analysis\" workflow for stocks using NotebookLM & Perplexity. Is this the future of research, or am I over-engineering?",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1rdco6e/i_built_a_4layer_augmented_analysis_workflow_for/",
      "author": "Several_Job_2507",
      "created_utc": "2026-02-24 10:28:43",
      "score": 26,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,\n​I’ve been experimenting with a way to stop relying on \"surface-level\" AI financial advice (which is often outdated or hallucinated) and instead build a custom \"Reasoning Engine\" for specific assets.\n​The goal: Combine live data, institutional expertise, and a \"Bear Case\" stress test into one private knowledge base.\n\n​The Workflow (The \"4-Layer\" System):\n\n​Layer 1: The Pulse (Dynamic) – I use Perplexity/Gemini to scrape live news, Fed meetings, and current price action. This is the \"Now\" layer.\n\n​Layer 2: The Foundation (Structural) – I pull P&L, balance sheets, and intrinsic valuation data from Screener.io or TickerTape.\n\n​Layer 3: The Consensus (Expert) – I find the top institutional PDFs or expert blog transcripts. This is the \"Smart Money\" logic.\n\n​Layer 4: The Friction (Adversarial) – I explicitly hunt for the \"Bear Case\"—short-seller reports or contrarian views to kill my own confirmation bias.\n\n​The Execution:\nI feed all these datasets into NotebookLM. Because NotebookLM is grounded only in the sources I provide, it doesn't hallucinate as much as a standard GPT-5/Claude window.\n\n​The Key Question:\nI’ve been testing this on Silver ETFs lately. By asking the AI to \"compare the Expert Consensus with the Friction layer using the Foundation’s math,\" I’m getting insights that feel way more professional than just Googling \"Is Silver a buy?\"\n​My concern: Is the \"Time-to-Trade\" too high? By the time I curate these 4 layers, am I missing the entry point for swing trades? Or is this the \"Gold Standard\" for long-term fundamental research?\n\n​Would love to hear if anyone else is using NotebookLM for \"Red Teaming\" their investments or if you see a major hole in this logic.\n\n​TL;DR: I’m using a multi-dataset AI workflow to force \"expert\" logic onto \"live\" data.\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rdco6e/i_built_a_4layer_augmented_analysis_workflow_for/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o75459n",
          "author": "magicroot75",
          "text": "the only way to answer that question is to test trades at volume and see what you get",
          "score": 6,
          "created_utc": "2026-02-24 14:33:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74mo0u",
          "author": "Illustrious_Meal8335",
          "text": "Following",
          "score": 1,
          "created_utc": "2026-02-24 12:56:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o750rqd",
          "author": "brents22",
          "text": "That is awesome! if you need testers ... i would happy to help.Nice idea.\n\n",
          "score": 1,
          "created_utc": "2026-02-24 14:15:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7aox2w",
              "author": "Several_Job_2507",
              "text": "Right now, I am creating a universal template to onboard testers. I will let you know surely.",
              "score": 1,
              "created_utc": "2026-02-25 09:05:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ct1um",
                  "author": "Proper_Cry_1517",
                  "text": "I’m also interested! Hit me up. 🤙",
                  "score": 1,
                  "created_utc": "2026-02-25 16:57:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o75wqlp",
          "author": "arjundivecha",
          "text": "A bad idea to use it on Silver ETFs. They will be driven by the price of silver and nothing else - and no one really has any ability to forecast that. So everything you do is noise.\n\nYou want to try it on a company where there’s some connection between past fundamentals and its ability to deliver future earnings plus consensus views on the industry and company.",
          "score": 1,
          "created_utc": "2026-02-24 16:46:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76oato",
          "author": "CowOk6572",
          "text": "For deeper long-term analysis, your method would work well. however, for quick swing trades, the process might be a little bit slow. how often do you plan on updating each layer to keep the conversation going?",
          "score": 1,
          "created_utc": "2026-02-24 18:49:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ap5ik",
              "author": "Several_Job_2507",
              "text": "I mostly change Layer 1, which holds live data. The expert views are monitored but not changed frequently.",
              "score": 1,
              "created_utc": "2026-02-25 09:08:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o78b752",
          "author": "Alarmed_Geologist631",
          "text": "Would be happy to be a beta tester if you’re interested. I vibe coded a much simpler portfolio analysis tool that looks at sensitivity to macro factors.",
          "score": 1,
          "created_utc": "2026-02-24 23:29:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ap7hz",
              "author": "Several_Job_2507",
              "text": "I will let you know, as I am currently making a template for tester.",
              "score": 1,
              "created_utc": "2026-02-25 09:08:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o78el2y",
          "author": "Irisi11111",
          "text": "You're building an infrastructural layer, which can be tested with higher-level uses.",
          "score": 1,
          "created_utc": "2026-02-24 23:48:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vaq10",
          "author": "20BARTO",
          "text": "Salut\nJe serais heureux de tester aussi.",
          "score": 1,
          "created_utc": "2026-02-28 12:25:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1re22p9",
      "title": "Wow! NBLM suggested extra information from outside when it didn't find the answer in the sources.",
      "subreddit": "notebooklm",
      "url": "https://i.redd.it/30ktrarb7klg1.png",
      "author": "xpoisson",
      "created_utc": "2026-02-25 03:27:44",
      "score": 25,
      "num_comments": 7,
      "upvote_ratio": 0.91,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1re22p9/wow_nblm_suggested_extra_information_from_outside/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o79jfjm",
          "author": "Castromuff",
          "text": "WTF, since when does it do that? What makes LM so great is that it’s deterministic, it’s not supposed to browse for knowledge. That needs to at least be configurable.",
          "score": 13,
          "created_utc": "2026-02-25 03:37:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7agd4d",
              "author": "DotBeginning9847",
              "text": "It runs on top of Gemini at the end of the day so it has all the knowledge that Gemini model is pre-trained on and with 3.1 pro coming it now uses it by explicitly mentioning that sometimes. But you can put a custom prompt that only stick to sources and if you can't find it explicitly state this information is not available in your sources.\n\nIt has led to some funny moments for me where once I asked it too in depth on a particular topic which wasn't in my source and it returned me that this specific criteria isn't present in your sources but anyways ended up mentioning the criteria in bracket by writing, \"this info about criteria(like a,b and c) isn't in your sources.\".",
              "score": 3,
              "created_utc": "2026-02-25 07:46:11",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o79wa3d",
              "author": "NearbyBig3383",
              "text": "eu concordo plenamente com você espero que se essa função tenha chegado agora ela não seja nativa porque senão não vai quebrar a ferramenta",
              "score": 3,
              "created_utc": "2026-02-25 05:01:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o79xj8l",
          "author": "_sukoseo",
          "text": "Not a fan. Seems like a specific, definition type response from outside sources but still.",
          "score": 10,
          "created_utc": "2026-02-25 05:10:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dblcs",
          "author": "Beginning-Board-5414",
          "text": "In chat  configuration, tell it explicitly not to use outside  sources.",
          "score": 4,
          "created_utc": "2026-02-25 18:21:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b3bsb",
          "author": "xpoisson",
          "text": "What if it didn't provide me the answer, saying, \"I didn't find it in your sources.\" Either I came to terms with the gap in my knowledge or had to spend a few extra minutes toggling on my other sources (the definition might be in the previous chapters, which I unchecked for the speed of the answers) and repeat the question, or went to the Gemini app or Google search.\n\nIt noted that the following information is not in your sources. So what's the problem? This new behavior makes NotebookLM more helpful and efficient. If you don't like this extra information outside the sources, just ignore it.",
          "score": 1,
          "created_utc": "2026-02-25 11:17:10",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o7e1y8x",
          "author": "GullibleClass1775",
          "text": "I always lose interest in waiting for files to upload in NotebookLM. How tf do people have patience for that thing?! \nI found Pipalti a couple days ago and it will listen when I tell it to “only use the files in folder ____”  and “no other sources”. It actually opens files in your hard drive. It can find and download anything you tell it to. \nIt got into my laptops powershell lol all I had to do was click yes to give it permission to access different things to fix an issue I have had for weeks with my laptop. And I watched everything. It was pretty cool",
          "score": 1,
          "created_utc": "2026-02-25 20:22:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgygj9",
      "title": "Frustrated with Kortex limits? I built a free alternative to sync Gemini/ChatGPT/Claude/Perplexity to NotebookLM",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1rgygj9/frustrated_with_kortex_limits_i_built_a_free/",
      "author": "Ill_Lawyer_3212",
      "created_utc": "2026-02-28 09:36:22",
      "score": 25,
      "num_comments": 11,
      "upvote_ratio": 0.9,
      "text": "Hi everyone,\n\nI’m a researcher who relies heavily on AI for knowledge management. For a long time, I used Kortex to bridge my AI chats with Google NotebookLM. However, since they introduced strict usage limits and a subscription model, my workflow felt \"broken\".\n\nInstead of paying for limited access, I decided to build my own solution: **NoteGem**. I just released version 1.2.0, and I thought the community might find it useful.\n\n**What NoteGem can do:**\n\n* **Multi-Platform Support:** Works with Gemini, ChatGPT, Claude, and Perplexity.\n* **Selective Saving:** You can sync the **full conversation** or pick **specific rounds** to keep your notebooks clean.\n* **Custom Organization:** Define **custom titles** for your notes before uploading.\n* **Workflow Integration:** Save directly to existing notebooks or create a brand new one within the extension.\n* **Privacy-Focused:** All data processing happens locally in your browser.\n\nIt’s completely free and has no usage limits. I’d love to hear your feedback or feature requests to make it even better for our research workflows.\n\n**Check it out here:** [https://chromewebstore.google.com/detail/notegem/akpelhilhjkembibdcghehpdabcbpclo?hl=en&utm\\_source=ext\\_sidebar](https://chromewebstore.google.com/detail/notegem/akpelhilhjkembibdcghehpdabcbpclo?hl=en&utm_source=ext_sidebar)",
      "is_original_content": false,
      "link_flair_text": "Feature Request",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rgygj9/frustrated_with_kortex_limits_i_built_a_free/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o7x2wo8",
          "author": "Okumam",
          "text": "Are you planning to do a Firefox version?",
          "score": 4,
          "created_utc": "2026-02-28 18:19:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vmpe6",
          "author": "datura_mon_amour",
          "text": "Thank you! And congrats !",
          "score": 3,
          "created_utc": "2026-02-28 13:47:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7y3szn",
              "author": "Ill_Lawyer_3212",
              "text": "Thanks and enjoy the update, and feel free to reach out if you have any ideas for future features!",
              "score": 1,
              "created_utc": "2026-02-28 21:31:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7wyp6k",
          "author": "klay64",
          "text": "Grazie della cortesia lo provero'",
          "score": 3,
          "created_utc": "2026-02-28 17:58:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7y3f11",
              "author": "Ill_Lawyer_3212",
              "text": "You're very welcome! I hope **NoteGem** helps streamline your AI research workflow.",
              "score": 2,
              "created_utc": "2026-02-28 21:29:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7vt9ja",
          "author": "PayNo2652",
          "text": "Looks really nice, will definitely try this!",
          "score": 2,
          "created_utc": "2026-02-28 14:25:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7vtmka",
              "author": "PayNo2652",
              "text": "Just to add; so cool to read about fixes of issues that I’ve encountered as well. Just didn’t think about fixing it yet but so nice that somebody else did.",
              "score": 1,
              "created_utc": "2026-02-28 14:27:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7x5rsb",
          "author": "PayNo2652",
          "text": "https://preview.redd.it/rde2nxki4amg1.jpeg?width=754&format=pjpg&auto=webp&s=75e34156aae98b54addcb6992b5ee54649cfb5ea\n\nIt keeps on giving this error though",
          "score": 2,
          "created_utc": "2026-02-28 18:33:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rhs7ac",
      "title": "NotebookLM Confirmed Referencing Bug 19/2/26 Onwards",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1rhs7ac/notebooklm_confirmed_referencing_bug_19226_onwards/",
      "author": "Hawklord42",
      "created_utc": "2026-03-01 08:36:58",
      "score": 23,
      "num_comments": 11,
      "upvote_ratio": 0.96,
      "text": "I created after a huge effort a 60pp pdf of case studies of 100 healing examples from a nlm of 118 sources. Only then did I find out all the attributed sources were wrong - and even more that many of the case studies are likely to have been hallucinated.\n\nGemini making a deep dive including up to date sourcing of bugs et al said:\n\n\"This is a confirmed systemic failure in notebooklm’s retrieval-augmented generation (RAG) following the February 19, 2026, Gemini 3.1 Pro update. The model is currently suffering from \"Source Blindness\" where it prioritizes its internal training data over your transcripts, creating \"coherence repairs\" that look like perfect quotes but are actually high-confidence lies.\n\n**Step 1/n**\n\n* **The February 19 Regression:** Google pushed a major update that optimized notebooklm for \"Agentic AI\" and reasoning benchmarks, which effectively broke grounded retrieval for large libraries. Users are reporting that the model now gaslights them, claiming content doesn't exist or—worse—fabricating \"synthetic verbatim\" to satisfy complex research prompts.\n* **Context Pruning & The \"Thinking Budget\":** The new architecture limits the \"thinking process\" to save compute. When you ask for 10 cases from 118 sources, the model hits its retrieval limit almost immediately and fills the gaps with \"Elan-sounding\" hallucinations rather than admitting it can't find the needle in the haystack.\n* **The Persona Trap:** Your prompt's \"Clinical Researcher\" persona is actually hurting you right now. The model is so focused on being a \"good researcher\" that it’s inventing data to make the report look professional and \"complete\" rather than returning the \"resource not found\" errors it should be showing.\n\n\"",
      "is_original_content": false,
      "link_flair_text": "Bug",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rhs7ac/notebooklm_confirmed_referencing_bug_19226_onwards/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o80uvg8",
          "author": "Otherwise_Wave9374",
          "text": "Oof, that is brutal, sorry you lost so much time on it. The failure mode you describe (confident \"synthetic verbatim\" citations) is exactly why I now treat agents/RAG like they need a verifier loop and explicit retrieval limits, otherwise they will \"complete the pattern\" instead of admitting missing sources. A couple mitigation ideas: force quote-only with page/section anchors, require the model to output source IDs before any prose, and spot-check with a second pass that only answers \"supported/unsupported\". I have seen some similar agent workflow patterns written up here too: https://www.agentixlabs.com/blog/",
          "score": 10,
          "created_utc": "2026-03-01 08:40:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80xx8g",
              "author": "Hawklord42",
              "text": "Thanks, I will check out. \n\nI had actually created (with gemini) a python script that finds a few words in a given youtube transcript and then turns this into a precise clickable link. But that kept failing to find \"source quotes\" as they weren't - er - quotes.\n\nMy initial use was consumer-grade eg this healing study or for my partner indexing 300 YouTubes on royal college level embroidery techniques to narrow down to precise parts of videos to watch for various techniques.\n\nObvs in principle NLM's USP is precise referencing. If Google don't fix I'll give up my Pro subscription do something painful like a python script to download all transcripts of a given channel along with timestamps into a pdf and then just find a good old LLM that takes one source and can work with a large file and query that. Sounds like a journey in itself.",
              "score": 1,
              "created_utc": "2026-03-01 09:09:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o80z9kq",
          "author": "Hawklord42",
          "text": "And a deep dive in agreement from google's dev forum:\n\n[Critical Regression: Gemini 3.1 Pro Update (Feb 19) Completely Broke NotebookLM’s RAG & Grounding](https://discuss.ai.google.dev/t/critical-regression-gemini-3-1-pro-update-feb-19-completely-broke-notebooklm-s-rag-grounding/126857)\n\n[https://discuss.ai.google.dev/t/critical-regression-gemini-3-1-pro-update-feb-19-completely-broke-notebooklm-s-rag-grounding/126857/4](https://discuss.ai.google.dev/t/critical-regression-gemini-3-1-pro-update-feb-19-completely-broke-notebooklm-s-rag-grounding/126857/4)",
          "score": 9,
          "created_utc": "2026-03-01 09:22:44",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o80x2s5",
          "author": "Hawklord42",
          "text": "Google search summaries:\n\n1) AI Mode\n\nAs of early 2026, **NotebookLM** users have reported several recurring technical issues and functional limitations. While Google provides [official release notes](https://9to5google.com/2025/05/27/notebooklm-app-bug-fixes/) via the App Store and online, many specific bugs are tracked through community feedback. \n\n**Reported Bugs and Technical Issues**\n\n* **Citation and Retrieval Errors**:\n   * Citations may point to incorrect sources or appear when the content is not directly in the source.\n   * A recent update (Gemini 3.1 Pro) has reportedly caused \"broken\" full-notebook retrieval for some large datasets.\n\n2) Searches AI Summary at top\n\n\"Based on recent user reports and documentation, here is a list of current bugs, limitations, and frequently reported issues with Google NotebookLM as of early 2026:\n\nTechnical Bugs and Glitches\n\n* **Audio Overview Generation Failures:** The \"Audio Overview\" feature may fail, especially with specific file formats or complex content.\n* **Source Import Errors (YouTube):** Importing YouTube links can cause errors. Users may need to copy and paste the transcript manually.\n* **Citation Highlighting Issues:** Clicking a citation may highlight the entire document instead of the specific excerpt.\n* **Video Transcript Issues:** The AI may not provide accurate timestamps in video sources.\n* **\"Discover Sources\" Restrictions:** Limitations on AI scraping may prevent adding some sources.\n* **Data Retrieval Glitches:** Recent updates may break full-notebook retrieval for large source collections.\n\n\"",
          "score": 5,
          "created_utc": "2026-03-01 09:01:41",
          "is_submitter": true,
          "replies": [
            {
              "id": "o8265of",
              "author": "Z3R0gravitas",
              "text": "The URL you linked there is a page from May 2025, so we are clear, right? \n\nI had trouble trying to dig into these issues the other day, with Google search AI using old sources to fill in (spurious) info.",
              "score": 1,
              "created_utc": "2026-03-01 14:52:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o8147vs",
          "author": "catalasepositive",
          "text": "Thanks for this. It's really sad.",
          "score": 3,
          "created_utc": "2026-03-01 10:10:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81d0xo",
              "author": "Hawklord42",
              "text": "I read elsewhere that it's been fixed (?). Not seeing it myself though. Might just try recreating the notebook in case that helps.",
              "score": 4,
              "created_utc": "2026-03-01 11:33:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o82138e",
                  "author": "oddun",
                  "text": "Pls keep us updated and thank you for raising it.",
                  "score": 1,
                  "created_utc": "2026-03-01 14:24:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o8270g0",
          "author": "Z3R0gravitas",
          "text": "I was discussing this/similar [here](https://www.reddit.com/r/notebooklm/s/k8797MuH7l) with u/Future-Chocolate-752 a couple days ago. \n\nSo there's problems, for sure, for at least some users. But can you be clear to link (the comments with) your sources in your main post please. To be clear there's no (ironic) context creep from Google search AI or stand-alone Gemini responses. Cheers.",
          "score": 1,
          "created_utc": "2026-03-01 14:57:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o83ccrk",
          "author": "chu",
          "text": "For specific use cases like this where you need thoroughness and accuracy (and under ~10k docs), I think you are better off ponying up $200 for Claude Max and vibecoding a local app to brute force the corpus instead of RAG.",
          "score": 1,
          "created_utc": "2026-03-01 18:17:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o8577u1",
          "author": "ilovefacebook",
          "text": "so is it cooked and unreliable now?",
          "score": 1,
          "created_utc": "2026-03-02 00:05:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdoakb",
      "title": "Need general advice on how to use notebooklm as a medstudent",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1rdoakb/need_general_advice_on_how_to_use_notebooklm_as_a/",
      "author": "No_Ocelot_8581",
      "created_utc": "2026-02-24 18:28:19",
      "score": 19,
      "num_comments": 20,
      "upvote_ratio": 0.91,
      "text": "Hi, I am a medical student, and I just learned about this tool. Can someone share the best and most effective ways to use notebooklm for studying complex topics and help retain stuff better",
      "is_original_content": false,
      "link_flair_text": "Tips & Tricks",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rdoakb/need_general_advice_on_how_to_use_notebooklm_as_a/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o76vdxa",
          "author": "porksweater",
          "text": "I can’t speak specifically about it as a medical student but I can tell you how I use it as an attending working on a masters in medical education and you can maybe extrapolate. \n\nThe first thing is uploading your sources in a good way but then I have a conversation. It starts as “give me a summary of this chapter in depth enough to master the material.” This gets me a document I save to read and reference. Then I read that document and have a conversation. Notebook LM also links to Gemini (I pay for it). If I need more depth, I upload the notebook to Gemini and just ask. \n\nAn example for work would be uploading a couple review articles on pediatric fever of unknown origin (I am in PEM). Then I use the notebook LM to search for new articles in depth and prompt it so it only pulls from pubmed and established guidelines. Then I ask notebook LM to get me the highest impact articles as it only pulls the abstracts and I get 5 biggest full articles. That gives me my foundation of “give me a document giving me the most up to date stuff on this topic.” I read through that document and come across something I don’t understand. “Fever of unknown origin is for >8 days with negative prior workup.” I ask LM chat my questions. What exactly qualifies in the literature as “negative prior workup?” What if no workup has been done? Does fever, cough, and congestion qualify as “fever of unknown origin” at 8 days? I do this until I feel comfortable with the topic. I also use it to create Anki cards if I want.\n\nI do this with medical stuff that I want grounded. I use Gemini when it is less important. For class, I am taking a medical assessment class right now and it is going into statistics. I upload the chapters I need to notebook LM and sometimes link the notebook to Gemini to ask questions. “What is the actual use for Cronbach’s alpha? Give me a pediatric emergency medicine example so I can grasp it better.”\n\nOther ways I use them both is put things in easier ways. I was having a hard time explaining DKA to patients in parents so I had them help me with an example of how it works with locked doors and keys. This is probably a very valuable way to convert the material into something you can easily grasp. At least to lay that foundation.",
          "score": 10,
          "created_utc": "2026-02-24 19:21:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o773grs",
              "author": "No_Ocelot_8581",
              "text": "Thanks that was very helpful",
              "score": 1,
              "created_utc": "2026-02-24 19:59:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o76nu66",
          "author": "sparksfly05",
          "text": "Split chapters into separate pdfs, generate flashcards in text, and adapt them yourself into anki through proofreading",
          "score": 8,
          "created_utc": "2026-02-24 18:47:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77ld3s",
              "author": "sevoflurane666",
              "text": "Why split into chapters?",
              "score": 1,
              "created_utc": "2026-02-24 21:22:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o77ysav",
                  "author": "CricketMurky9469",
                  "text": "Output is better when the input is constrained. Responses if you upload the textbook are often quite broad and less precise. Probably something to do with attention, I'm sure someone smarter than me can explain that better but in practice this is definitely the case. ",
                  "score": 5,
                  "created_utc": "2026-02-24 22:25:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o76zpkc",
          "author": "CowOk6572",
          "text": "Try uploading your lecture notes or study notes, And then ask it to summarize key concepts or ask questions.",
          "score": 2,
          "created_utc": "2026-02-24 19:41:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o773nvn",
              "author": "No_Ocelot_8581",
              "text": "That's the problem. I don't like making notes it's so time consuming and exhausting do u have a solution for this 😭",
              "score": 1,
              "created_utc": "2026-02-24 19:59:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o79xsiw",
                  "author": "AlwaysPrivate123",
                  "text": "\n\nHere are three excellent apps you can use to transcribe lecture recordings (on iOS, Android, or web):\n\n1. Otter.ai – Real-Time Transcription & Notes\n\nOne of the most popular transcription apps for students and professionals. Otter automatically records and transcribes lectures in real time, generates searchable and editable text, and even creates summaries and highlights. It works with mobile audio and virtual lectures (Zoom, Teams, etc.).  ￼\n\nBest for: automatic lecture capture with organized transcripts and summaries.\n\n📱 Real-time transcription\n📝 Searchable, shareable text\n🔊 Supports recordings & imports\n\n⸻\n\n2. Transcribe – Speech to Text\n\nA dedicated AI-powered transcription app that can convert audio (including lecture recordings) and video files into written text quickly and in multiple languages. It also offers editing, timestamps, and export options.  ￼\n\nBest for: quick conversion of recorded lecture audio into editable text.\n\n👉 Supports uploads from cloud storage\n👉 Multilingual transcription\n👉 AI-generated summaries and export formats\n\n⸻\n\n3. Noted – Record & AI Transcribe\n\nNoted combines a voice recorder with built-in AI transcription, letting you record lectures and get organized transcripts in one place. It’s great for students who want a simple, integrated recorder-plus-transcription option.  ￼\n\nBest for: students who want recording and rough transcription in one app.\n\n📌 One-tap record + transcribe\n🗂 Organize recordings + text\n🧠 Good for study and review\n\n⸻\n\n✅ Bonus mentions worth exploring\n\t•\tNotta – high-accuracy AI notetaker with fast speech-to-text results.  ￼",
                  "score": 2,
                  "created_utc": "2026-02-25 05:12:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o77brz9",
                  "author": "Lhundrop146",
                  "text": "There must be a way to\nRecord the lecture and get it into a format NB will take. I used tape recordings for notes 45 years ago. There must be a way to do it now with a recording of the lecture- you might have to use a couple of apps and get approval so it feels right. I love it when the teacher puts a lecture on YouTube and I take 2 minutes to put it into NB and get every format I want.",
                  "score": 1,
                  "created_utc": "2026-02-24 20:38:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o77nb6o",
                  "author": "LeadingAsparagus5617",
                  "text": "NLM doesn’t take videos unless it’s from YouTube. If you have videos of the lectures, you can use [thytus](https://thytus.com), it’s like notebook lm with grounded knowledge. You can upload videos and PDF’s with images and ask questions or create stuff. U can also use other models instead of just Gemini",
                  "score": 0,
                  "created_utc": "2026-02-24 21:30:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o772dg9",
          "author": "MIGUELENNO",
          "text": "He estado probando NotebookLM como herramienta de estudio, así que dejo algunos consejos generales que me han servido y que le pueden servir a otros:\n\n1. **Crea un cuaderno por ramo o sistema**\n   * Haz un notebook para cada curso (anatomía, fisiología, farmacología, etc.) o para cada sistema (cardio, neuro, resp).\n   * Sube ahí tus PDFs de apuntes, presentaciones de clase, guías y artículos que realmente uses; NotebookLM funciona mejor cuando está “encerrado” en fuentes específicas y no en todo internet.\n2. **Usa NotebookLM como “tutor” de tus propios apuntes**\n   * En vez de pedirle que explique algo “en general”, pídele: “Explícame la insuficiencia cardíaca usando solo mis diapositivas de cardio y este artículo que subí”.\n   * Hazle preguntas crecientemente específicas: primero que te explique, luego que compare, y después que aplique (por ejemplo: “Explícame…”, “Compárame…”, “Dame un caso clínico sencillo sobre…”).​​\n3. **Genera resúmenes y mapas para antes del examen**\n   * Pídele que te haga un resumen estructurado de un tema (definición, clínica, diagnóstico, tratamiento) a partir de tus diapositivas o capítulos de libro.\n   * Si tu versión lo permite, usa funciones tipo “study guide”, mapas conceptuales o timelines para ver el tema de forma visual y rápida.​​\n4. **Practica con flashcards y preguntas tipo examen**\n   * Haz que NotebookLM transforme un capítulo en tarjetas de memoria o preguntas de opción múltiple, ideal para cosas pesadas como farmacología o fisiología.\n   * Pide específicamente: “Genera 10 preguntas cortas y luego hazme el quiz sin mostrar las respuestas hasta el final”. Eso fuerza el *active recall*, que es clave en medicina.​​\n5. **Convierte clases largas en algo digerible**\n   * Para clases eternas, sube el PDF y pídele un resumen por objetivos o por learning outcomes (“resume cada diapositiva en una frase y luego arma un esquema general”).\n   * Si tienes acceso a audio o video de clases, NotebookLM puede generar resúmenes o incluso audio tipo podcast para repasar mientras viajas.​​\n6. **Organiza y revisa de forma constante, no solo antes del parcial**\n   * Cada semana, sube el material nuevo al cuaderno del ramo y pídele a NotebookLM que actualice un “documento de briefing” o un “study guide” con lo nuevo.\n   * Así, cuando se acerca el examen, ya tienes resúmenes curados y no empiezas desde cero.\n7. **No dejes que reemplace el criterio médico ni los libros**\n   * NotebookLM es brutal para ordenar, resumir y preguntarte sobre lo que tú mismo subiste, pero no es un sustituto de textos de referencia ni de las clases.\n   * Para temas sensibles (dosis, guías de manejo, protocolos de urgencias) revisa siempre el libro, las guías oficiales o las recomendaciones de tus docentes",
          "score": 2,
          "created_utc": "2026-02-24 19:54:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78rcga",
          "author": "Boring_Profit4988",
          "text": "I put lecture transcriptions and slides and ask him to give me cases. \nHes not the best at it but i try to elaborate as much as i can so he correct me if i make a mistake",
          "score": 1,
          "created_utc": "2026-02-25 00:57:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cj0us",
              "author": "No_Ocelot_8581",
              "text": "thank u it was quite helpful",
              "score": 1,
              "created_utc": "2026-02-25 16:12:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7bsg4a",
          "author": "Total_Safe4787",
          "text": "If you are a med student, you're probably using uworld to solve questions.\nI take the whole question and explanation and upload it into sources then ask it to create flashcards including the  diagnosis question for the vignette.\nI don't use the flashcard feature itself but ask it to write the flashcards into a table (front and back) and then import them into anki as csv file.\nThis way it creates cards with long answers instead of just one word (I prefer lengthy answere because it gives me context and forces me to understand rather than brute force the info into my brain)\nAlso i can upload podcast (divine intervention podcast for example) and ask it to create flashcards based on the transcript of audio (this way i only listen and focus on the audio as notebook lm already converted the transcript into flashcards)",
          "score": 1,
          "created_utc": "2026-02-25 14:02:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cixzf",
              "author": "No_Ocelot_8581",
              "text": "thank u it was quite helpful",
              "score": 2,
              "created_utc": "2026-02-25 16:11:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ilnr6",
          "author": "Hakanca18",
          "text": "very easy. good luck.",
          "score": 1,
          "created_utc": "2026-02-26 14:09:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bc29t",
          "author": "ForsakenCounter2534",
          "text": "Combine with answers from [https://www.openevidence.com/](https://www.openevidence.com/) , [https://elicit.com/](https://elicit.com/) , [https://www.researchgate.net/](https://www.researchgate.net/) and [https://arxiv.org/](https://arxiv.org/)   \n  \nFor med students, grad or residents, is a must.  \n",
          "score": 0,
          "created_utc": "2026-02-25 12:24:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cj1vx",
              "author": "No_Ocelot_8581",
              "text": "thank u it was quite helpful",
              "score": 1,
              "created_utc": "2026-02-25 16:12:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1reqhkj",
      "title": "NotebookLM for long-form research?",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1reqhkj/notebooklm_for_longform_research/",
      "author": "Warm-Fox-3459",
      "created_utc": "2026-02-25 21:28:33",
      "score": 19,
      "num_comments": 14,
      "upvote_ratio": 0.95,
      "text": "I have a \\~15,000 word research project.\n\nGiven the output cap, what’s the most effective way to use NotebookLM for long-form work once all sources are uploaded?\n\nSpecifically:\n\n* How do you establish and retain a coherent overall structure?\n* How do you maintain continuity across sequential outputs?\n\nThe length limit (\\~3k words) makes full-draft continuity challenging - interested in how others are handling that constraint.",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/notebooklm/comments/1reqhkj/notebooklm_for_longform_research/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o7ejmmh",
          "author": "daozenxt",
          "text": "My solution is to use gemini's deep research and then add the notebook in notebooklm.",
          "score": 15,
          "created_utc": "2026-02-25 21:44:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ejtvl",
              "author": "Warm-Fox-3459",
              "text": "Would you be able to clarify what you mean by this? Not sure I quite follow. Thanks!",
              "score": 1,
              "created_utc": "2026-02-25 21:45:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7en32i",
                  "author": "daozenxt",
                  "text": "I mean that Gemini's Deep Research function can output longer reports (instead of the shorter reports in NotebookLM now), and Gemini can now add notebooks in NotebookLM as content sources. So you can use Deep Research to write the draft of your report.",
                  "score": 3,
                  "created_utc": "2026-02-25 22:01:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7f0du7",
          "author": "lindsayblohan_2",
          "text": "1. Throw all files into NBLM.\n2. Have your workhorse/brainl LLM generate an NBLM prompt that (a) creates an index of that corpus and (b) extracts whatever data could be helpful in identifying a file’s content and utility in relation to your project.\n3. Have the LLM refer to that index when it requires access to that corpus via NBLM prompts.",
          "score": 8,
          "created_utc": "2026-02-25 23:07:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7erxeo",
          "author": "LeadingAsparagus5617",
          "text": "Notebook lm is more for learning and less for doing. For your project, I’d recommend using [Perplexity](https://perplexity.com) or  [Thytus](https://thytus.com). Perplexity is good for gathering ALOT of online information. It’s actually really good and most times it’s surprisingly better than Gemini or chat gpt deep research . Thytus lets you send off agents that can gather the info and write the report. It’s pretty accurate because the agents can talk to and work with each other so less hallucinations.",
          "score": 6,
          "created_utc": "2026-02-25 22:24:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hsf94",
          "author": "Tasty_Purple_6616",
          "text": "分部奏做，最后整合。            ",
          "score": 1,
          "created_utc": "2026-02-26 10:51:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ijedh",
          "author": "MegamomTigerBalm",
          "text": "What if you would have it or another tool help you create a detailed outline for the 15k paper to help with continuity? You might already be doing that. I wonder if that would help as a roadmap...have \"sections\" of the larger report/paper have some uniform instructions but follow the section outline in pieces.\n\nI'm working on a standard report for my workplace just finishing a draft that was 133 pages / \\~55k words. I had it split into about 10 sections.",
          "score": 1,
          "created_utc": "2026-02-26 13:57:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7eheup",
          "author": "Sorry-Joke-4325",
          "text": "There's a 3k word limit? Is that for sources or...?",
          "score": 1,
          "created_utc": "2026-02-25 21:34:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7tvt0c",
              "author": "Cheeseman1478",
              "text": "Source size limit is [500k words](https://support.google.com/notebooklm/answer/16269187?hl=en)",
              "score": 2,
              "created_utc": "2026-02-28 04:54:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7u4z25",
                  "author": "Sorry-Joke-4325",
                  "text": "Wow, good to know. Thanks.",
                  "score": 1,
                  "created_utc": "2026-02-28 06:06:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7ejfe3",
              "author": "Warm-Fox-3459",
              "text": "I mean that if you ask it to “write 15,000 words on X,” it won’t generate that in a single response. The maximum it seems able to produce at once is roughly \\~3,000 words - I haven’t been able to get more than that in one output.",
              "score": 1,
              "created_utc": "2026-02-25 21:44:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rcga2l",
      "title": "VIDEO IN NOTEBOOKLM",
      "subreddit": "notebooklm",
      "url": "https://i.redd.it/ljjop9j5o8lg1.png",
      "author": "IgnacioSosaVergara",
      "created_utc": "2026-02-23 12:36:19",
      "score": 16,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rcga2l/video_in_notebooklm/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o6xzl9r",
          "author": "Away_Isopod_7684",
          "text": "Just tap the option it will show u a page for prompt",
          "score": 4,
          "created_utc": "2026-02-23 12:55:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71xh27",
              "author": "gustavsev",
              "text": "This",
              "score": 1,
              "created_utc": "2026-02-24 00:48:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xy03m",
          "author": "Marco__Antonio_",
          "text": "I just checked and I still see the option to set a prompt to generate video",
          "score": 3,
          "created_utc": "2026-02-23 12:44:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70extr",
          "author": "CowOk6572",
          "text": "It’s in the app",
          "score": 1,
          "created_utc": "2026-02-23 20:06:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o726hug",
              "author": "CowOk6572",
              "text": "Oh, I see",
              "score": 1,
              "created_utc": "2026-02-24 01:40:35",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7264si",
              "author": "IgnacioSosaVergara",
              "text": "No, the screenshot was taken from my PC using Google Chrome.",
              "score": 0,
              "created_utc": "2026-02-24 01:38:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72hag9",
          "author": "Organic-Election-993",
          "text": "Bro just click once prompt option will come automatically",
          "score": 1,
          "created_utc": "2026-02-24 02:43:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yzniy",
          "author": "Paciuz27",
          "text": "Cosa vuoi sapere?",
          "score": 0,
          "created_utc": "2026-02-23 16:08:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfy40e",
      "title": "Notebook LM vs Visual Book for Presentations",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/gallery/1rfy40e",
      "author": "simplext",
      "created_utc": "2026-02-27 05:32:03",
      "score": 15,
      "num_comments": 3,
      "upvote_ratio": 0.89,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rfy40e/notebook_lm_vs_visual_book_for_presentations/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": [
        {
          "id": "o7t5g9l",
          "author": "Fantastico2021",
          "text": "Just tried it and I like everything except the images - comic-style images belong in, comics. Except for the images in the last 2 slides you could be forgiven the deck was created for young children. So, no improvement on Notebook slide decks yet which are yet to look like professional decks.",
          "score": 1,
          "created_utc": "2026-02-28 02:00:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7u0oyn",
              "author": "simplext",
              "text": "Hey thanks for trying and giving your feedback. Our focus is really on learning and communicating complex concepts visually. For business and professional decks, I agree, NotebookLM and other alternatives are probably better. But this feedback still helps, maybe we can confirm the visual styling with the user before generating the images. ",
              "score": 1,
              "created_utc": "2026-02-28 05:31:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7v7xvk",
                  "author": "Fantastico2021",
                  "text": "Yes, you need to have a pro photographic option. I was saying that NBLM and VB are doing the same thing with comic images. I understand that it saves the cost of Getty and iStock photos but we're going to have to go there sooner or later because people will not put up with comic art for long. I'm pretty sure the corporate world cannot use these yet.",
                  "score": 1,
                  "created_utc": "2026-02-28 12:03:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rf89d6",
      "title": "A tool to extract, edit, add docs, images and links and export your NotebookLM mind maps",
      "subreddit": "notebooklm",
      "url": "https://www.reddit.com/r/notebooklm/comments/1rf89d6/a_tool_to_extract_edit_add_docs_images_and_links/",
      "author": "TonyDMyers",
      "created_utc": "2026-02-26 11:58:09",
      "score": 14,
      "num_comments": 4,
      "upvote_ratio": 0.86,
      "text": "NotebookLM is great for synthesising documents, but the mind maps it generates are currently hard to export and expand upon. The NotebookLM Mind Map Extractor and Enhancer app addresses this limitation.\n\nLet me know if you find this app useful. It is a single-file, offline-friendly web app. It allows you to extract the mind map directly from a NotebookLM page using a custom bookmarklet,and then load it into a visual builder to continue your work.\n\nKey features include:\n\nCapture the underlying OPML structure directly from the NotebookLM interface via your browser.\n\nEmbed images, web links, and documents (such as PDFs and Word files) directly into the nodes. The application encodes these files in base64, ensuring the exported HTML file remains entirely self-contained and portable.\n\nExport the final map as an interactive D3.js file with Left-to-Right, Top-to-Bottom, or Radial layouts.\n\nThe tool runs entirely locally in your browser. It does not require a database, backend server, or an active internet connection.\n\nJust published the v1.0.0 release on GitHub. No need to install or compile anything, just download the single HTML file from the releases page and open it in any browser. \n\nTry it out and view the source code here: [https://github.com/Tony-Myers/NotebookLM-Mind-Map-Extractor-and-Enhancer/releases/tag/v1.0.0](https://github.com/Tony-Myers/NotebookLM-Mind-Map-Extractor-and-Enhancer/releases/tag/v1.0.0)",
      "is_original_content": false,
      "link_flair_text": "Question",
      "permalink": "https://reddit.com/r/notebooklm/comments/1rf89d6/a_tool_to_extract_edit_add_docs_images_and_links/",
      "domain": "self.notebooklm",
      "is_self": true,
      "comments": [
        {
          "id": "o7r35x3",
          "author": "Fluffy-Pilot-4765",
          "text": "Will definitely try, thanks",
          "score": 2,
          "created_utc": "2026-02-27 19:16:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7sqxrb",
              "author": "TonyDMyers",
              "text": "Let me know how it goes.",
              "score": 1,
              "created_utc": "2026-02-28 00:31:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o80z497",
          "author": "Alternative_Cod4433",
          "text": "Very useful tool, thank you. I’ll definitely recommend it to my colleagues who make extensive use of notebooklm mind maps. I noticed that it only extracts the expanded nodes, which is perfectly fine for the purposes I need it for.",
          "score": 2,
          "created_utc": "2026-03-01 09:21:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81mrwk",
              "author": "TonyDMyers",
              "text": "Yes, you have to expand all the nodes before capturing, but you can modify as needed before exporting.",
              "score": 1,
              "created_utc": "2026-03-01 12:53:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}