{
  "metadata": {
    "last_updated": "2026-03-01 16:49:57",
    "time_filter": "week",
    "subreddit": "opensource",
    "total_items": 20,
    "total_comments": 104,
    "file_size_bytes": 149295
  },
  "items": [
    {
      "id": "1rfrtj1",
      "title": "Update : Large US company came after me for releasing a free open source self-hostable alternative - Resolved in our favor",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rfrtj1/update_large_us_company_came_after_me_for/",
      "author": "funyflyer",
      "created_utc": "2026-02-27 00:37:41",
      "score": 1258,
      "num_comments": 31,
      "upvote_ratio": 0.99,
      "text": "This is a follow up to my [previous post](https://www.reddit.com/r/opensource/comments/1rbkzwe/large_us_company_came_after_me_for_releasing_a/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) regarding the C&D notice I received. I have some incredible news for the community: the matter is officially resolved in favor of the entire drone and OSS community.\n\n**TLDR:** **AirData UAV** has complied with community concerns, implemented a robust data takeout solution, and we have settled the matter gracefully.\n\n**The free OSS project in question :** [**www.opendronelog.com**](https://www.opendronelog.com/)\n\n\\---------------\n\nSince the legal threat is no longer active, I can finally name the company. It was **AirData UAV**, a US based drone log analysis and reporting service. Eran said it's my choice to name them or not name them here in this update post, I choose to name, because I don't have anything bad to say anymore.\n\nDespite the first approach was a C&D, the final outcome was actually better than I hoped for (surprised actually!). A massive thank you goes to [u/Archiver\\_test4](https://www.reddit.com/user/Archiver_test4/), who acted as my legal representative pro bono (for free!! and denied donations). He prepared a powerful response and helped me pass this with confidence. He has even started a new subreddit, [r/Opensource\\_legalAid](https://www.reddit.com/r/Opensource_legalAid/), to help other indie devs in similar situations.\n\n# The Meeting with the Airdata UAV CEO Eran Steiner\n\nIn response to the traction the [original post](https://www.reddit.com/r/opensource/comments/1rbkzwe/large_us_company_came_after_me_for_releasing_a/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) gained, AirData CEO **Eran Steiner** reached out for a face to face meeting via email within 6 hours of the post going live. He expressed regret over the legal route they initially took (he took the responsibility for that as well as CEO) and personally saw to it that the following changes were made before we even spoke:\n\n* **Official Data Takeout Solution:** This was the **main goal** (and my demand for data portability and fairness, because it's painful to export files one by one, clicking one after another and waiting). **AirData UAV** now provides a **central takeout solution**, making them fully GDPR compliant. You can now download your data in its original format without needing my 3rd party automation \"patch.\". If you are interested, [please check out here](https://github.com/arpanghosh8453/open-dronelog#airdata-exports).\n* **Trademark Resolution:** We agreed that fair representation and disclaimers are the way to go. I have already added these to my project, and I am free to use their name when representing truthful facts, as permitted by EU laws. I won't go into more technical/legal aspects than this of what trademark rights they actually hold or not.\n* **Account Restoration:** As a gesture of goodwill, they have **fully restored my account** and all my log files before I asked. ❤️\n* We agreed to drop all allegations and, in the future, talk through any issues personally rather than involving lawyers.\n\nI am just a solo dev working in my free time, and I have no intention of competing with an established company. I am just thrilled that the community now has true data portability as I hoped for, and they are free to choose as they please based on what features/interface they like. Thank you Eran for making this happen so quick without any drama/delay or missed promise. **AirData UAV** no longer \"holds your data\" to keep you on their platform. To be fair, they do have a functional and data rich toolset that many in the community still enjoy (including myself!) - They also have a very robust data sync solution which works very well. I am not paid or bribed or sponsored by them, I am just giving credit where it's due.\n\nThank you r/opensource for all for the support. It made all the difference! Open Source for the WIN!",
      "is_original_content": false,
      "link_flair_text": "Community",
      "permalink": "https://reddit.com/r/opensource/comments/1rfrtj1/update_large_us_company_came_after_me_for/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7mexbt",
          "author": "boredquince",
          "text": "this is great news. congrats! ",
          "score": 107,
          "created_utc": "2026-02-27 01:23:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mf65g",
              "author": "Treedweller7898",
              "text": "Double congrats",
              "score": 24,
              "created_utc": "2026-02-27 01:25:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7mgjlv",
                  "author": "r-pics-sux",
                  "text": "Triple congrats",
                  "score": 16,
                  "created_utc": "2026-02-27 01:33:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7mohrs",
          "author": "Purple_Mine_1676",
          "text": "Sounds like you lucked onto a company that, at the most cynical level, at least knows how to make good on their PR mistakes.\nMaybe they're good guys as well.",
          "score": 66,
          "created_utc": "2026-02-27 02:19:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7o2j4x",
              "author": "MrWFL",
              "text": "Most likely people with their livelihoods on the line, felt threatened, and chose a bully tactic.\n\nThat bully tactic got a lawyer involved, and backfired massively (yay gdpr). And now they’re doing damage control.",
              "score": 35,
              "created_utc": "2026-02-27 08:21:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7q0s93",
                  "author": "Tekuzo",
                  "text": "For an example of this going really bad see Proven Industries.",
                  "score": 3,
                  "created_utc": "2026-02-27 16:15:08",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7w3ges",
                  "author": "ASkepticBelievingMan",
                  "text": "I am currently looking to GDPR for my personal project, and holy moly. What I fist saw as an annoyance, now I see it as a good measure actually to protect users and developers alike.",
                  "score": 1,
                  "created_utc": "2026-02-28 15:21:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7o3hmi",
          "author": "DonkeeeyKong",
          "text": "Well done. It does sound like they got nervous because they were breaking EU law and many people pointed that out.",
          "score": 17,
          "created_utc": "2026-02-27 08:30:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7o5syi",
              "author": "funyflyer",
              "text": "Apparently yes, they legal team must have figured out the same and suggested compliance. But at this point they are, so that's a win!",
              "score": 11,
              "created_utc": "2026-02-27 08:52:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7mxpjp",
          "author": "ndnihil",
          "text": "Well done. This is the kind of outcome we need more of in the world.",
          "score": 14,
          "created_utc": "2026-02-27 03:12:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mvqf1",
          "author": "atobmic",
          "text": "Crushed it. Real change",
          "score": 9,
          "created_utc": "2026-02-27 03:01:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nv3q4",
          "author": "DBT85",
          "text": "Feels like something Louis Rossman would have an interest in.\n\nCongrats BTW!",
          "score": 9,
          "created_utc": "2026-02-27 07:14:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o9yno",
          "author": "Penetal",
          "text": "I wonder if companies in general will ever learn that they are not, and can not, compete with self hosted alternatives. People that want to self host, and all that comes with, are not the same people that want a service that does it for you. Software night service the same function, but the market is just not the same people, not truly competing products.\n\nIt's like as if take out restaurants were to start legal battles against people writing home cooking recipes and sharing them with others. No! One is cheaper with extra work, one is more expensive with extra convenience.",
          "score": 7,
          "created_utc": "2026-02-27 09:32:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xual6",
              "author": "eubulides",
              "text": "In fact I think recipes specifically are not subject to copyright, though trademark might be involved with regard to titling or possibly attribution. But I see your general point.",
              "score": 2,
              "created_utc": "2026-02-28 20:40:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ntmnz",
          "author": "NamedBird",
          "text": "I am happy for you that the legal threats are out of the way!  \n",
          "score": 4,
          "created_utc": "2026-02-27 07:01:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7oc162",
          "author": "aciokkan",
          "text": "Congrats! \nIt's really cool that the CEO was proactive and worked with you to sort out the kinks and have a resolution that helps the community and their platform equally!! 🌟",
          "score": 3,
          "created_utc": "2026-02-27 09:52:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ojfss",
              "author": "funyflyer",
              "text": "yes, that is why I am making this update, they deserve that much for sure! Credit where it's due. ",
              "score": 5,
              "created_utc": "2026-02-27 10:59:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7tr7fw",
          "author": "Alarming_Bluebird648",
          "text": "The fact that they conceded once the conflict with EU interoperability laws was raised suggests these regulations are finally providing a functional deterrent against aggressive cease and desist orders. This sets an important precedent for protecting independent developers from similar corporate pressure.",
          "score": 3,
          "created_utc": "2026-02-28 04:21:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7omaot",
          "author": "Icy_North5921",
          "text": "Amazing thing to hear!",
          "score": 1,
          "created_utc": "2026-02-27 11:24:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rt7n7",
          "author": "ghostsquad4",
          "text": "Nice!",
          "score": 1,
          "created_utc": "2026-02-27 21:26:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7s1wfr",
          "author": "EveryDebtYouTake",
          "text": "\"AirData UAV now provides a central takeout solution, making them fully GDPR compliant.\"\n\n\nvs\n\n\nKey Aspects of GDPR Fines\nTwo-Tier Structure:\nHigher Tier: Up to €20 million or 4% of annual global turnover for violating core principles, data subject rights, or improper international data transfers.\nLower Tier: Up to €10 million or 2% of annual global turnover for issues regarding data controller obligations, processor issues, or security of processing.",
          "score": 1,
          "created_utc": "2026-02-27 22:10:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tx8br",
          "author": "r4nchy",
          "text": "can we get to know the names of the people who are leading this company ?",
          "score": 1,
          "created_utc": "2026-02-28 05:05:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ug91f",
              "author": "funyflyer",
              "text": "Search in Google for CEO of Airdata UAV",
              "score": 1,
              "created_utc": "2026-02-28 07:46:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ve2an",
                  "author": "r4nchy",
                  "text": "got it [https://airdata.com/about](https://airdata.com/about)  \n  \nkudos to the ceo for doing all that. They are lucky EFF didn't catch on to this story, it would have been a different hell hole for them.  \nbut his military background is concerning.  \nAlso he gives me Zuckerberg vibes for some reason",
                  "score": 1,
                  "created_utc": "2026-02-28 12:50:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7xnok3",
          "author": "badboysdriveaudi",
          "text": "I believe this is great news and a win-win-win. Both parties win as well as the general market. I also have newfound respect for this CEO and will be watching to see how they innovate to distinguish themselves from the open source route.",
          "score": 1,
          "created_utc": "2026-02-28 20:05:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rchq9x",
      "title": "Inkscape project struggling with lack of active contributors [video]",
      "subreddit": "opensource",
      "url": "https://friprogramvarusyndikatet.tv/w/ofcCwyxiE2VSaJPBFNnZLb",
      "author": "pimterry",
      "created_utc": "2026-02-23 13:41:37",
      "score": 280,
      "num_comments": 30,
      "upvote_ratio": 0.99,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1rchq9x/inkscape_project_struggling_with_lack_of_active/",
      "domain": "friprogramvarusyndikatet.tv",
      "is_self": false,
      "comments": [
        {
          "id": "o70rn32",
          "author": "sl0bbyb0bby",
          "text": "Noooo I don't need new features, but hope it doesn't become abandonware. Inkscape is great",
          "score": 98,
          "created_utc": "2026-02-23 21:08:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77gb1b",
              "author": "Headpuncher",
              "text": "It's fantastic software. I used to do all the tutorials by LogosByNick on youtube. I made some really cool (to me) stuff. ",
              "score": 10,
              "created_utc": "2026-02-24 20:59:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o71utj3",
          "author": "BP041",
          "text": "this hits close. the contributor pipeline problem is real across basically every mature OSS project -- it's not just Inkscape.\n\nthe bar to 'first meaningful PR' has gotten higher as codebases matured and accumulated technical debt. what I've seen help: genuinely good first issues (not 'fix a typo in the readme'), async video walkthroughs of key subsystems, and maintainers being explicit about review time expectations. that last one changes everything -- knowing you'll get feedback within 48h vs maybe never is a massive difference for new contributors.\n\nbiggest drop-off is usually between 'I found a good first issue' and 'I actually understand enough to attempt it.' projects that invest in architecture docs and 'here's how X subsystem works' posts tend to convert lurkers into contributors way better than just labeling more issues.",
          "score": 59,
          "created_utc": "2026-02-24 00:33:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72c1xi",
              "author": "RedDotHorizon",
              "text": "There are many more ways to be helpful that don't require in-depth technical/programming knowledge: updating documentation, tutorials, reproducing bugs/cleaning up the issue tracker, testing, community support, organizing meetings and events, ...\n\nBut yes, if you want to contribute code, there's a learning curve and some lead time required. With most of your suggestions we're in a chicken-and-egg situation: who is going to contribute video walkthroughs, maintain accurate technical documentation and organize their life around a 48h-response-SLA? (While I understand the intention, that last one is a bit outrageous for a volunteer-driven project.) It's a resource problem.\n\nIf I could make a wish, I'd wish for people to see these deficiencies as opportunities. It is actually very easy to make a huge impact on the project because there's so much room for improvement everywhere. You just need to want to apply yourself.",
              "score": 13,
              "created_utc": "2026-02-24 02:12:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o72lkk5",
                  "author": "BP041",
                  "text": "fair points — the 48h SLA framing was too prescriptive. I was trying to get at \"any explicit signal beats silence for a new contributor waiting on their first PR,\" but I overcorrected into something unreasonable for volunteers.\n\nthe non-code contribution point is real and I glossed over it. I've seen projects where one person consistently doing issue triage + writing actual-context \"good first issue\" labels moved the needle more than a batch of feature PRs. documentation and community scaffolding are leverage, just less visible.\n\n\"see deficiencies as opportunities\" is probably the right frame for this — it just requires someone to internalize that the gap is an invitation. harder to communicate to a newcomer than a list of tasks, but more durable when it clicks.",
                  "score": 8,
                  "created_utc": "2026-02-24 03:07:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o710l6k",
          "author": "P1r4nha",
          "text": "I love that tool. It's written in C++. Might be worth a look.",
          "score": 27,
          "created_utc": "2026-02-23 21:51:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70y3qt",
          "author": "Ginjutsu",
          "text": "Dang, that's a bummer to hear. Love Inkscape and use it all the time. Hopefully things get better in the future.",
          "score": 20,
          "created_utc": "2026-02-23 21:39:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o732wxn",
          "author": "ivosaurus",
          "text": "[Here's the video on Youtube](https://youtu.be/axf28yT7-98?t=18) if someone wants to check it out there as well\n\nI wonder if Krita is experiencing any of the same problems, maybe to a lesser extent; or by contrast, if this is more unique to Inkscape",
          "score": 16,
          "created_utc": "2026-02-24 05:03:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76spg9",
          "author": "Banana_tnoob",
          "text": "Does sponsoring / donating help? Are there developers paid by sponsors? Heck, is it even possible to donate? I am a long term sponsor of neovim, but Inkscape is another software that I view as excellent and would like to support it if it helps.",
          "score": 6,
          "created_utc": "2026-02-24 19:09:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76ti44",
              "author": "Banana_tnoob",
              "text": "Answering myself: https://inkscape.org/support-us/donate/\n\nDonating to Inkscape\n\nThe Inkscape Fund is a charity fund for supporting the Inkscape project. It is used in various ways, most particularly to help with costs of gathering Inkscape developers at important conferences such as Libre Graphics Meeting or SCALE and host our own events such as Hackfests. It goes towards Outreachy mentorship programs and other infrastructural costs of running the Inkscape project.\n\n \nDonation via Software Freedom Conservancy\n\nThe Inkscape Fund is currently managed by the Software Freedom Conservancy, Inc., a 501(c)(3) non-profit. All donations made through it are fully tax-deductible to the extent permitted by law. If you have any questions or are otherwise in need of assistance, please visit the SFC site.",
              "score": 7,
              "created_utc": "2026-02-24 19:13:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o77hvo5",
          "author": "Headpuncher",
          "text": "It would help if some distros, ahem ubuntu ahem, would stop pushing broken Snaps. \n\nThere was a long time issue with the default install of Inkscape on Ubuntu \\[X, K, etc\\] using the Snap as the default even from apt. The Snap like many other Snaps being sandboxed had a permissions issue stopping users from exporting files (no FS access). This is why I stopped using Inkscape, I couldn't find a fix aside form building from source which many people wouldn't even think to do. \n\nNot being able to export / save was a major F-up. Issue's like this are the main reason Snaps don't work for me. ",
          "score": 7,
          "created_utc": "2026-02-24 21:06:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ho5fg",
              "author": "sebuq",
              "text": "Isn’t there an AppImage for the latest version?",
              "score": 1,
              "created_utc": "2026-02-26 10:12:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7hp03k",
                  "author": "Headpuncher",
                  "text": "I prefer to do things the way the system / distro recommends instead of having to remember things or have a custom config. \n\nWhether there's an appImage or not isn't the issue, the issue was a broken Snap package that is available from apt/aptitude and App Center. providing broken software through the default repositories is tantamount to sabotage. ",
                  "score": 1,
                  "created_utc": "2026-02-26 10:19:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o72gyab",
          "author": "Atulin",
          "text": "Frankly, not all that surprising. For the longest time, Inkscape had a reputation of \"takes 6 business days to open, and good luck figuring out how to use it\". Nowadays, it has more of a \"takes 1-2 business days to open, and good luck figuring out how to use it\", so it's definitely getting better.\n\nThat said, people generally contribute to what they use and what they like. Not that many people use Inkscape, and even fewer like it.\n\nNo less important is the fact, that it's generally harder to find new contributors for older, less \"exciting\" projects. Inkscape's still on C++17 and GTK3, if I'm not mistaken, with a bunch of Python scripts that do the heavy lifting (sic!)\n\nThey are migrating to C++20 and GTK4, IIRC, but that's a bit of a chicken-and-egg situation itself.\n\nA fresh, new, potential contributor looks like it, says \"eww, smells of mothballs\" and goes looking for some Rust/C#/Kotlin/Javascript project to contribute to instead.",
          "score": 13,
          "created_utc": "2026-02-24 02:41:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72u268",
              "author": "litelinux",
              "text": "The migration is mostly complete, but you're right that we're in a transitional state. Parts of the code do smell of mothballs but that's just what you get with 22-year-old software :)\n\nIt will be fine though. 1.5 is coming together okay and developers are working on larger features, which makes it look like we have less contributions.",
              "score": 20,
              "created_utc": "2026-02-24 04:01:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o748pjm",
                  "author": "McDonaldsWitchcraft",
                  "text": "As a long time Inkscape user, I would really love to have more bugfixes even if that means no additional features. It's probably the buggiest art software I use. Maybe I notice because I use it everyday. But being a graphics program makes it particularly annoying to have so many graphics glitches, especially when exporting.\n\nI wish I knew enough to contribute but for now I can only submit bugs.",
                  "score": 5,
                  "created_utc": "2026-02-24 11:14:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7q5iwl",
              "author": "m-in",
              "text": "GTK for a cross-platform app is a terrible choice though.",
              "score": 1,
              "created_utc": "2026-02-27 16:37:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hhbo2",
          "author": "KenguruHUN",
          "text": "Unfortunately I can't speak c++ at all :(",
          "score": 1,
          "created_utc": "2026-02-26 09:06:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74w4ma",
          "author": "Dontdoitagain69",
          "text": "Let’s create another distro instead of combining resources on current projects.even through I’m used to illustrator at one point when I didn’t want to pay 59/month I used Inscape and it is actually a bday ass vector drawing software. Fast, powerful , no extra bs features. Please keep this alive, there a some Linux projects you can cancel due to poor initial design flaws and move resources to Inkscape",
          "score": -1,
          "created_utc": "2026-02-24 13:51:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gwjp2",
              "author": "HurasmusBDraggin",
              "text": ">Let’s create another distro instead of combining resources on current projects\n\nI feel you here.",
              "score": 1,
              "created_utc": "2026-02-26 05:59:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o73tisx",
          "author": "charmander_cha",
          "text": "Projetos open source deveriam aderir a um novo paradigma de gestão administrativa para evoluir com o uso de LLMs",
          "score": -9,
          "created_utc": "2026-02-24 08:53:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcoo45",
      "title": "I built an open source Google Analytics & reCAPTCHA alternative",
      "subreddit": "opensource",
      "url": "https://github.com/swetrix/swetrix",
      "author": "Sensiduct",
      "created_utc": "2026-02-23 17:59:38",
      "score": 69,
      "num_comments": 9,
      "upvote_ratio": 0.94,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rcoo45/i_built_an_open_source_google_analytics_recaptcha/",
      "domain": "github.com",
      "is_self": false,
      "comments": [
        {
          "id": "o6zuzx2",
          "author": "ssddanbrown",
          "text": "Nice project! A few things I noticed in regard to open source and marketing, assuming I have not misunderstood the cloud-feature segmentation:\n\n- The AGPLv3 labelled repo has [this COPYING file](https://github.com/Swetrix/swetrix/blob/4571d9b193f065fef2debade3666510785b095c0/backend/apps/cloud/COPYING.txt) contained within, without reference to it in the readme or top-level LICENCE file. Its existence is unclear unless you dive into the code, and its application is unclear since it says it applies to \"This repository\", not a specific part or folder etc...\n- Your [readme lists](https://github.com/Swetrix/swetrix/blob/4571d9b193f065fef2debade3666510785b095c0/README.md?plain=1#L57-L61) cloud features. While they are tagged with cloud, it might be a tad misleading since they are not provided under the license advertised for the repo, nor are they open source which the project is introduced as in the readme intro.\n- On your homepage, the hero contains \"Open-source\" right next to a view/iframe/demo to an instance which features the non-open-source elements.\n- Again on the homepage, there's the wording \"Fully open-source and auditable. Self-host on your own infrastructure or use our cloud.\" which could be misleading since the core is open source, the project and what's being advertised is not fully open source.\n- On your comparison pages, for example [this one with Unami](https://swetrix.com/comparison/umami), \"Open Source\" is checked in the checklist without any qualifier, with all the non-open-source features also listed as checked.\n\nAgain, apologies if I've misunderstood anything.",
          "score": 12,
          "created_utc": "2026-02-23 18:34:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7065zw",
              "author": "Sensiduct",
              "text": "Hi, thanks that's some good feedback! I'll update the README to clarify these points!\n\nI've added this COPYING file because there was an instance of a company indending to resell / compete with us using our own code and it's not something I wanted to tolerate at that time. I know Plausible had similar issues in past so they made the same decision (I actually found out about this COPYING file / dual licensing from them)\n\nThe community edition (core product, with analytics & captcha) is open source and has most of the features cloud edition offers, except the billing module and some niche features like Alerts (yet). But yes you're right it would be correct to mention that the cloud version is source-available, not open source",
              "score": 4,
              "created_utc": "2026-02-23 19:25:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o70ftfc",
          "author": "sai-kiran",
          "text": "Congrats on the launch, but Why is everyone building self-hosted analytics these days? Is it the new Todo list project for people?\nI swear I see a new one pop up every month.",
          "score": 2,
          "created_utc": "2026-02-23 20:10:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o70hnmp",
              "author": "Sensiduct",
              "text": "thank you:) I've launched Swetix in 2021 originally, and even back then there were a ton of analytics startups launching quite often. The thing is this space is extremely crowded, and it's hard to differentiate against big OSS projects like Plausible, so most founders just give up and switch to something else\n\nAlso Marc Louvion (a famous indihacker on Twitter) launched his DataFast product too, and it triggered a wave of people trying to replicate his success and launch their analytics projects too, hahaha",
              "score": 2,
              "created_utc": "2026-02-23 20:19:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o71uytq",
          "author": "BP041",
          "text": "5 years on one project is serious commitment -- respect. and the problem is real; most GA 'alternatives' either have the same privacy issues under a different name or they're so stripped down you lose half the workflow.\n\nthe bundled reCAPTCHA replacement is a bold call, haven't seen many projects tackle both in one. curious how the bot detection actually works under the hood -- is it behavioral analysis without fingerprinting, or something else? asking because most CAPTCHA-free approaches eventually fall back on some form of device fingerprinting which kind of defeats the point.\n\nadding to my self-hosted stack anyway. the cookieless angle matters a lot for EU compliance without banner hell.",
          "score": 1,
          "created_utc": "2026-02-24 00:34:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7548zq",
          "author": "BP041",
          "text": "The CAPTCHA alternative is the more interesting piece to me. Standard CAPTCHA UX is genuinely hostile and Turnstile proved there's real appetite for something better.\n\nCurious how you handle sudden traffic spikes -- reCAPTCHA silently adjusts its risk thresholds based on volume signals. Does Swetrix's version do anything adaptive or is it purely behavior-based static scoring?\n\nAnd tbh the cookieless angle gets undersold. There's a real difference between \"we have a consent banner\" and \"we genuinely don't fingerprint\" -- users who know the difference convert differently. Privacy as a feature is real, not just compliance theater.",
          "score": 1,
          "created_utc": "2026-02-24 14:34:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o790l0b",
              "author": "Sensiduct",
              "text": "Swetrix CAPTCHA is different from Turnstile, because instead of fingerprinting we use proof-of-work (similar mechanism to bitcoin mining, but on a tiny-tiny scale; fast enough for a single user, cumbersome enough for large scale bots)\n\nIt's not 100% bot-proof, but enough for some protection. I'm definitely going to improve it in future and will look into ways to make some behaviour analysis in an optional, privacy-friendly way as well!",
              "score": 1,
              "created_utc": "2026-02-25 01:49:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1reildc",
      "title": "What are some open source tools/projects that genuinely improved your workflow?",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1reildc/what_are_some_open_source_toolsprojects_that/",
      "author": "Any-Main-3866",
      "created_utc": "2026-02-25 16:50:57",
      "score": 59,
      "num_comments": 45,
      "upvote_ratio": 0.95,
      "text": "Hey everyone,\n\nWhat are some open source projects, tools, or setups that have genuinely helped you work more efficiently?\n\nWould love to hear what you’re using and how it fits into your workflow.\n\nThanks!",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1reildc/what_are_some_open_source_toolsprojects_that/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7ctycy",
          "author": "petdance",
          "text": "‘ack’ has been invaluable since I wrote it 20 years ago. No more grep for source code. \n\nhttps://beyondgrep.com",
          "score": 36,
          "created_utc": "2026-02-25 17:01:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ihgcf",
              "author": "fluidtoons",
              "text": "Thank you for ack!",
              "score": 4,
              "created_utc": "2026-02-26 13:46:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7ihxph",
                  "author": "petdance",
                  "text": "You’re welcome. I’m glad it’s helped you.",
                  "score": 4,
                  "created_utc": "2026-02-26 13:49:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7h4hmw",
              "author": "max123246",
              "text": "Their website is completely broken on brave for some reason. Works fine on edge\n\nEdit: Oh looks like most of its features are also implemented in ripgrep so I'll probably just stick with that",
              "score": 4,
              "created_utc": "2026-02-26 07:06:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7khnvj",
                  "author": "petdance",
                  "text": "There are a few use cases where ack is preferable but for most folks ripgrep will do just fine.",
                  "score": 2,
                  "created_utc": "2026-02-26 19:29:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7d8mk1",
          "author": "Maskdask",
          "text": "Neovim",
          "score": 13,
          "created_utc": "2026-02-25 18:08:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gn05u",
          "author": "Steampunkery",
          "text": "Tools that I use daily and couldn't live without:\n\n* Neovim (or really any good terminal editor)\n* Tmux\n* Git \n* Ripgrep\n* Clangd\n* Htop",
          "score": 12,
          "created_utc": "2026-02-26 04:48:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7g4kvb",
          "author": "josephjnk",
          "text": "Ripgrep. I usually do searches inside my IDE but there are times when it’s hard to answer a specific question from an editor search (like “how many places are we using lodash on the backend?”) and ripgrep makes it really fast to check.",
          "score": 10,
          "created_utc": "2026-02-26 02:52:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d60gn",
          "author": "DiscussionHealthy802",
          "text": "An open source CLI that scans for leaked secrets, OWASP vulnerabilities, and CVEs, then auto-fixes them https://github.com/asamassekou10/ship-safe",
          "score": 5,
          "created_utc": "2026-02-25 17:56:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7falg4",
          "author": "i_am_tct",
          "text": "screen.\n\noften have one or more sessions running on remote boxes, I reconnect and I'm right where I left off",
          "score": 5,
          "created_utc": "2026-02-26 00:04:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7fea40",
              "author": "FancyPotato6890",
              "text": "any reasons why u use screen over tmux?",
              "score": 3,
              "created_utc": "2026-02-26 00:24:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7lw7xx",
                  "author": "i_am_tct",
                  "text": "i started using it a while ago, does everything i need it to do, and it's part of GNU so it'll be avaliable across distros (and OSs) without concern\n\n ",
                  "score": 1,
                  "created_utc": "2026-02-26 23:39:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7cx3ur",
          "author": "ElaborateCantaloupe",
          "text": "I’ve been in QA for over 25 years and tried many test management tools. They all suck in some way so I built my own and it does exactly what I want!\n\nhttps://github.com/TestPlanIt/testplanit",
          "score": 8,
          "created_utc": "2026-02-25 17:16:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7enzkt",
          "author": "Bach4Ants",
          "text": "Git!",
          "score": 3,
          "created_utc": "2026-02-25 22:05:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dc2ol",
          "author": "petdance",
          "text": "I have a website of alternatives to standard CLI tools at https://altbox.dev.  The site is showing its age but I hope it can start some folks down a road.",
          "score": 2,
          "created_utc": "2026-02-25 18:23:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7dcahh",
              "author": "petdance",
              "text": "Shoot it doesn’t render right on my phone. Desktop only, folks!\n\n(Patches welcome if you can pitch in)",
              "score": 2,
              "created_utc": "2026-02-25 18:24:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hquhs",
          "author": "SilvernClaws",
          "text": "Git: version control\n\nZig: programming language\n\nCodeberg: git repository host\n\nVS Codium: VS Code without the clutter and spyware",
          "score": 2,
          "created_utc": "2026-02-26 10:37:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hrgiv",
          "author": "kvyb",
          "text": "I’ve been working on a project called [OpenTulpa](https://github.com/kvyb/opentulpa) because I was tired of manually writing glue code for every small automation I needed, and keeping track of it all.\n\nIt’s essentially a personal AI agent you run on your own server that builds its own tools. Instead of me setting up a dev environment to write a script for a Slack digest or an API bridge, I just describe the workflow in chat or ask it to make a headless n8n flow. It writes the Python code, schedules the job, and saves it as a \"skill\" it can reuse later.",
          "score": 2,
          "created_utc": "2026-02-26 10:42:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7j4y76",
          "author": "billFoldDog",
          "text": "imagepipe is an android app that strips exif data and optimizes jpegs. It uses a sharing workflow that is great.\n\n\nIf I want to share an image on discord, I can:\n\n\ngallery, share inage to imagepipe, the share dialog immediately reopens, share to discord.\n\n\nThis shares a sanitized version of the image to discord.",
          "score": 2,
          "created_utc": "2026-02-26 15:45:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ds9mz",
          "author": "stan_frbd",
          "text": "Many things on https://awesome-selfhosted.net/\n\nMy own project Cyberbro if you're into OSINT / cyber security stuff.",
          "score": 4,
          "created_utc": "2026-02-25 19:37:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7debhf",
          "author": "Nordthx",
          "text": "VS Code. Replaced all other IDEs that I used before",
          "score": 1,
          "created_utc": "2026-02-25 18:33:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7dh5ph",
              "author": "Upstairs-Attitude610",
              "text": "Visual Studio Code is proprietary software released under the \"Microsoft Software License\",[7] but based on the MIT licensed program named \"Visual Studio Code – Open Source\" (also known as \"Code – OSS\"), also created by Microsoft and available through GitHub.[13]",
              "score": 13,
              "created_utc": "2026-02-25 18:46:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7drr2q",
                  "author": "Nordthx",
                  "text": "Thanks for the clarification, but it really did have a significant impact.",
                  "score": 4,
                  "created_utc": "2026-02-25 19:35:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7dldlh",
          "author": "Eagle_Nebula7",
          "text": "\\[Tomat\\](https://github.com/jolars/tomat) has been the best linux pomodoro tool that I've encountered, mostly because of its client-server approach and the fact that it was so easy to set up and put in my status bar",
          "score": 1,
          "created_utc": "2026-02-25 19:05:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7esx6c",
          "author": "SwordfishParking1182",
          "text": "Release-it",
          "score": 1,
          "created_utc": "2026-02-25 22:29:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l5as7",
          "author": "Simply_Jordan_",
          "text": "Obsidian for notes, Neovim for fast editing, Bitwarden for passwords, and uBlock on Firefox to kill distractions. Nothing fancy, just tools that reduce friction and stay out of the way.",
          "score": 1,
          "created_utc": "2026-02-26 21:22:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p8ucd",
          "author": "AndrewsVibes",
          "text": "* Zenzap → Clean team communication and follow-ups without Slack-style chaos\n* Obsidian (open ecosystem) → Local-first notes and knowledge base without lock-in\n* Gitea → Lightweight self-hosted Git server\n* AppFlowy → Open source Notion style workspace\n* Metabase → Self-hosted analytics dashboards",
          "score": 1,
          "created_utc": "2026-02-27 13:54:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pc3pb",
          "author": "x8code",
          "text": "vLLM ",
          "score": 1,
          "created_utc": "2026-02-27 14:12:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7u9es9",
          "author": "gbrennon",
          "text": "Ripgrep for sure. \n\nAlso screen or tmux, docker or podman, flatpak and vi",
          "score": 1,
          "created_utc": "2026-02-28 06:45:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cyt7r",
          "author": "lisaluvr",
          "text": "Commenting to follow the thread! I’m curious too",
          "score": -1,
          "created_utc": "2026-02-25 17:24:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7dbsxk",
              "author": "petdance",
              "text": "You can follow the post by going to the context menu and picking “Follow Post”. No reply needed.",
              "score": 11,
              "created_utc": "2026-02-25 18:22:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7h8sou",
                  "author": "lisaluvr",
                  "text": "Thank you so much, I genuinely didn’t know that 🥲",
                  "score": 2,
                  "created_utc": "2026-02-26 07:44:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1redck9",
      "title": "Switched FOSS license from AGPL 3.0 to Apache 2.0, trying to find out how much of an influence a license has on adoption",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1redck9/switched_foss_license_from_agpl_30_to_apache_20/",
      "author": "chimbori",
      "created_utc": "2026-02-25 13:34:16",
      "score": 52,
      "num_comments": 20,
      "upvote_ratio": 0.9,
      "text": "Most of my previous projects have also been licensed as Apache 2.0, and gained sufficient popularity & usage ([a Chrome extension](https://github.com/chimbori/google-calendar-crx), a [Kotlin library](https://github.com/chimbori/crux), and a [few others](https://github.com/chimbori)).\n\nFor my [latest project](https://butterfly.chimbori.dev/), I started with AGPL 3.0, with the intention that personal usage & smaller companies (i.e. those without Legal departments that would advise them against AGPL 3.0) would be able to use it for free in perpetuity, but larger companies would be good candidates for a paid proprietary license.\n\nA few weeks in, I’ve reversed that stance. For smaller projects like this one, it probably makes more sense to make it all Apache 2.0 (or MIT or BSD), since that opens the doors wide open to whoever wants to use it.\n\nWe’ve heard (negatively) of a lot of projects that started off as Apache 2.0, and then ended up becoming proprietary. \n\nWondering if folks have experiences to share about starting off with a viral GPL-ish license, and then opening it up subsequently, and how that impacted adoption.\n\n(If you’re curious about the specific project, it’s a self-hosted tool to automatically generate OpenGraph images from templates. Think of it as the open-source version of SaaS tools like Bannerbear, RenderForm, and others).",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1redck9/switched_foss_license_from_agpl_30_to_apache_20/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7bsvs3",
          "author": "taylorwilsdon",
          "text": "I usually get downvoted for saying this lol but I’ll give you one perspective, simply my own. It really boils down to what you’re making. If it’s a chrome extension, nobody is going to think twice about license type. If it’s a dev tool or library aimed at software engineers who may work at a large company, it likely will hamper, but not entirely prevent, adoption. \n\nI can only speak for my own professional experience but I have spent the past 15 years in software engineering at enterprise scale tech companies and we cannot use anything with an agpl license and that’s a hard stop, so I generally will avoid anything with one because I know I can’t use it where I do much of my development work. Some companies do not operate the same way but anything big enough to have a dedicated legal department and internal package repository management is likely to.",
          "score": 31,
          "created_utc": "2026-02-25 14:04:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bwk99",
              "author": "chimbori",
              "text": "> enterprise scale tech companies and we cannot use anything with an agpl license and that’s a hard stop, so I generally will avoid anything with one\n\nThat's exactly the conclusion I came to.\n\nThe philosophy behind AGPL may be noble, but in practice, Apache/MIT/BSD are the winners.",
              "score": 4,
              "created_utc": "2026-02-25 14:24:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7c9bcu",
                  "author": "randomperson_a1",
                  "text": "> winners\n\nWhat kind of winning are we talking about? Is a thriving open source community not a win?",
                  "score": 18,
                  "created_utc": "2026-02-25 15:27:25",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7ckwnq",
                  "author": "Silly-Freak",
                  "text": "I agree with the first, but not second order conclusion. AGPL is about keeping a system open. In my opinion it is a good option _precisely_ for software where there is incentive to get a competitive advantage by taking it closed. The advantage a commercial player should get from AGPL software is from _adopting_ it, not from keeping improvements for themselves. \n\nThat legal departments are afraid of AGPL is a shame. I don't fully buy that this fear is well-founded; the whole IP system is way too pro business for a good faith user of AGPL software to lose in court. If their reasoning is not that AGPL is risky but that they'd have to publish their code, then that's just the license working as intended, I don't see that as losing. \n\n(also, doesn't this fear mostly also apply to GPL software? I'm not in deep enough to tell myself, but if so: that everyone still uses Linux kinda demonstrates that it's not legal uncertainty that hinders adoption of GPL software)",
                  "score": 8,
                  "created_utc": "2026-02-25 16:20:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7ipus3",
              "author": "tilsgee",
              "text": "> enterprise scale tech companies and we cannot use anything with an agpl license and that’s a hard stop\n\n\nmay i ask why?",
              "score": 0,
              "created_utc": "2026-02-26 14:31:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7jazb9",
                  "author": "taylorwilsdon",
                  "text": "AGPL triggers even when the code is never distributed. Running it on an internal or external server and allowing users to interact with it can force source release, and anything an enterprise scale company does is network accessible. The most liberal legal interpretation of the affero network clause essentially means that it cannot be integrated with or embedded into any existing internal systems without releasing the source code to everything. Whether or not indirect linkage qualifies afaik has never been tested in court and nobody wants to be the trial balloon. Every faang company explicitly blocks anything agpl3 (as does my employer)\n\nCorporations block AGPL‑3 not because of ideology but because of legal uncertainty and the risk of involuntary source disclosure. I maintain or contribute heavily to 200k stars worth of github projects so I’ve had these discussions on both sides of the table many times. If you run an oss project it’s worth reading up on what happened with AWS and mongodb and the background to why gitlab abandoned it. Agpl doesn’t protect people as much as they think, and prevents adoption.",
                  "score": 1,
                  "created_utc": "2026-02-26 16:12:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7c8j39",
          "author": "QualitySoftwareGuy",
          "text": "Generally speaking, less restrictive licenses like MIT and Apache 2.0 will always have more adoption than GPL or AGPL. \n\nWhat I can recommend for you is to decide which of your goals has a higher priority for your project. For example, is it to increase adoption rate? If so, Apache 2.0 or MIT. Or is it to be more restrictive and prevent closed/proprietary SaaS? If so, then AGPL. This is a self-hosted application project, rather than a library, so it's not uncommon to see AGPL licenses for this type of project.\n\nIn my opinion, AGPL being a blocker is usually limited to big companies. Most individuals (for personal use) will not care about it being AGPL. Some small companies might, but I don't believe the majority of them would care.\n\nTL;DR: Let the greatest priority determine the license. Adoption rate = Apache or MIT. Prevent proprietary SaaS = AGPL.",
          "score": 10,
          "created_utc": "2026-02-25 15:23:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dpv45",
          "author": "Userwerd",
          "text": "I always check the lisence, I will USE apache, mit, bsd projects, but I will SUPPORT gpl projects.\n\n",
          "score": 3,
          "created_utc": "2026-02-25 19:26:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7crzg6",
          "author": "PurpleYoshiEgg",
          "text": "I'd rather start off with AGPL and relax it later than use MIT and figure out that I wanted to actually close it, but it's too late, because a company decided they were going to coopt my project.\n\nI haven't seen a reason to switch from AGPL yet, and so I'm keeping it.",
          "score": 2,
          "created_utc": "2026-02-25 16:52:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7c9ib3",
          "author": "Arcuru",
          "text": "Welcome to the wonderful world of trying to pick a license that allows for some path to monetization but ALSO doesn't bring out the pitchforks for being 'not OSS'.\n\nPersonally I think something like https://fsl.software should be used more often for SaaS tools, that might be a good fit for you.\n\nFor my latest project I'm leaning towards AGPL+CLA (with a covenant to allow me to relicense to any other OSI-approved OSS license). A little confusing but at least it is ideologically sound. https://jackson.dev/post/oss-licensing-sucks/",
          "score": 4,
          "created_utc": "2026-02-25 15:28:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7crelx",
          "author": "ivosaurus",
          "text": "> We’ve heard (negatively) of a lot of projects that started off as Apache 2.0, and then ended up becoming proprietary. \n\nAs long as you hold copyright on the code, there is NO DIFFERENCE between this and someone taking an AGPL codebase proprietary in exactly the same way. Zilch. Nada. Copyright ownership means you can re-license either at will.\n\nOf course it doesn't stop people using previous versions of the code with previous licenses, although again license type has no function on this caveat either.\n\nIn fact there's a famous case of **exactly** the opposite: Started off as Apache 2.0, then went to AGPL v3, then went proprietary; [MinIO](https://en.wikipedia.org/wiki/MinIO).\n\nThe also icky fact is common wisdom would be that if you were accepting many pull requests into a codebase without copyright-transfer / grant (usually in the form of CLAs), it should be nearly impossible to re-license that codebase anyway. At least, without getting a written approval from all / most prior contributors. But a lot of companies and projects have basically ignored this wisdom on copyright (if someone gave you XX licensed code, under their copyright, you can't just re-license it yourself, as you're no longer the copyright holder) and re-licensed their projects anyway. Of course there's no way to actually \"test\" on \"who's legal theory is correct\" without some project or another that's done this actually getting taken into a court of law to rule on legalities, but given a lot of these things are free in nature, to my knowledge that's never actually happened yet",
          "score": 2,
          "created_utc": "2026-02-25 16:50:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfwj5i",
      "title": "The age where opensource/platforms is here.",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rfwj5i/the_age_where_opensourceplatforms_is_here/",
      "author": "tonefart",
      "created_utc": "2026-02-27 04:11:48",
      "score": 49,
      "num_comments": 18,
      "upvote_ratio": 0.92,
      "text": "The world is locking down their OS/eco-system via age-gate keeping and mandatory government IDs in order for you to use any of the mainstream OS and devices, android, ios, etc.\n\nNow is the time for open platform/os to be pushed heavily to fight back heavy handed government and corporation collusion and control.\n\nThere is never a better time than now to aggressively push Linux, open web, open mobile devices to fight back government tyranny and overreach.\n\nIf there's no effort made to fight back, I guarantee you they will come for OPEN SOURCE and ban it for not complying with government ID mandates which completely violates OSS foundational values.\n\nAll OSS advocates must come up with the plan now to push for this in anticipation of global tech tyranny and lockdown of the industry/eco-system.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1rfwj5i/the_age_where_opensourceplatforms_is_here/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7n8tb9",
          "author": "veganmaister",
          "text": "Love the spirit but unfortunately normies don’t care.\n\nI just mentioned deleting WhatsApp on the degoogle subreddit and was met with a visceral reaction.\n\nThe best advice I can offer is to be the change you wish to see in the world.",
          "score": 29,
          "created_utc": "2026-02-27 04:23:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7n96bf",
              "author": "tonefart",
              "text": "It's not like OSS users/developers have a choice. If we don't do anything about this now, they will force OSS developers to comply as well and ban all those that don't.",
              "score": 6,
              "created_utc": "2026-02-27 04:25:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7naqrn",
                  "author": "veganmaister",
                  "text": "If they clamp down on FOSS itself, software will be the least of our worries.",
                  "score": 6,
                  "created_utc": "2026-02-27 04:36:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7nb2y8",
          "author": "The-Titan-M",
          "text": "Lock-in is real tbh. Once all your stuff is in one ecosystem, you’re kinda stuck.",
          "score": 7,
          "created_utc": "2026-02-27 04:38:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nbeln",
              "author": "veganmaister",
              "text": "Not really, it’s psychological lock-in not practical.",
              "score": 8,
              "created_utc": "2026-02-27 04:40:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7nbwpn",
                  "author": "The-Titan-M",
                  "text": "I don’t think it’s just psychological. Once all your data and apps are tied in, switching isn’t exactly frictionless.",
                  "score": 3,
                  "created_utc": "2026-02-27 04:44:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7o4ebu",
          "author": "hopeseekr",
          "text": "Hi, you sound like someone who was born after 9/11/2001, am I right?\n\nWe already lost all these wars. The Snowden Revelations were the fundamental make or break moment, and we broke. Now we're in a faster acceleration of the totalitarism curve and they're making a play to remove our freedom-promoting , open source, and/or encrypted systems.\n\nThey already basically killed NNTP and IRC.\n\n===\n\nLLM is the enforcer.\n\nJust wait until the stuff being developed in China (LLM monitoring CCTV and every reddit / Twitter / Email / WhatsApp message, in conjunction with autonomous robot police and drones)  and you'll see the dark world of 2030 when 80% of us are unemployable.\n\n====\n\nP.S. I was the xMule founder / maintainer from 2003-2007. The US government isused a National Security Letter against me in August 2003 the same day that hostile people forked it very hostily and created aMule. Go look at aMule source code, you will see how they stripped my name and copyright from every single file on the first commit.\n\nClear violation of the GPL.\n\nThey did this because in 2003 I added (in secret) military-grade encryption to xMule'ws already IP-to-IP direct communication chat. It didn't have usernames, it had IPs. the idea being two or more people verify each others' ip addresses and then DCC + encryption == no middle man at all and tight opsec.\n\nThat's why I was visited in June 2003 by the Men In Black (DHS) and later extraodirinarily renditioned across the country in winter 2003... but that's another story.",
          "score": 2,
          "created_utc": "2026-02-27 08:38:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7o55vd",
              "author": "hopeseekr",
              "text": "You ever wonder why YouTube got the blessing of the MPAA and RIAA in 2006 while there were just two P2P devs in America not being sued / imprisoned (me and Bryan Cohen of BitTorrent)?\n\nIt was to make it so easy to get content that users stopped learning how to use truly free and distributed systems. Same reason they attacked cryptocurrencies.",
              "score": 2,
              "created_utc": "2026-02-27 08:46:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rffhog",
      "title": "Open Source Endowment - funding for FOSS launch",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rffhog/open_source_endowment_funding_for_foss_launch/",
      "author": "ShaneCurcuru",
      "created_utc": "2026-02-26 16:54:04",
      "score": 42,
      "num_comments": 16,
      "upvote_ratio": 0.96,
      "text": "The OSE launches today, working on one of the biggest issues with #OpenSource #Sustainability around: **funding**, especially for under-visible projects or independent communities or developers maintaining all those critical little bits *everyone* uses *somewhere*.  Check it out; highly worth reading about if you follow the larger open source world. \n\n\\----\n\nToday we're launching the [**Open Source Endowment**](https://endowment.dev/) (OSE), the world's first endowment fund dedicated to sustainably funding critical open source software. It has $750K+ in committed capital from 60+ founding donors, including founders and executives of HashiCorp, Elastic, ClickHouse, Supabase, Sentry, n8n, NGINX, Vue.js, cURL, Pydantic, Gatsby, and Zerodha.\n\nOSE is a US 501(c)(3) public charity. All donations are invested in a low-risk portfolio, and only the annual investment returns are used for OSS grants. Every dollar keeps working, year after year, in perpetuity.\n\nOur endowment is governed by its donor community, and the core team includes board members Konstantin Vinogradov(founding chairman), Chad Whitacre, and Maxim Konovalov; executive director Jonathan Starr; and advisors Amy Parker, CFRE and Vlad-Stefan Harbuz.\n\nEveryone is welcome to donate (US contributions are tax-deductible). Those giving $1,000+ become OSE Members with real governance rights: a vote on how funds are distributed, input on strategy, and the ability to elect future board directors as the organization grows.\n\nNone of this would be possible without our founding members, to whom we are grateful: Mitchell Hashimoto, Shay Banon, Jan Oberhauser, Daniel Stenberg, Kailash Nadh, Thomas Dohmke, Alexey Milovidov, Yuxi You, Tracy Hinds, Sam Bhagwat, Chris Aniszczyk, Paul Copplestone, and many more below.\n\nOpen source runs the modern world. It's time we built something to sustain it. Donate, become a member, and help govern how funds reach the projects we all depend on. \n\n\\----\n\nDisclaimer: I am one of the original donors as well, and am a Member of their nonprofit.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1rffhog/open_source_endowment_funding_for_foss_launch/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7jrc29",
          "author": "ssddanbrown",
          "text": "Interesting approach, I hope it works out!\n\nLooking at some of the most prominent organisers of this, it does make me a little wary, as I'm seeing names (and grant from company names) which have previously misrepresented or advocated for using \"open source\" outside [the OSD](https://opensource.org/osd), but hopefully that's in the past.\n\nEdit: I noticed the funding nomination form specifically asks for a GitHub repo URL, which seems a little odd and limiting.",
          "score": 8,
          "created_utc": "2026-02-26 17:27:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k05ud",
              "author": "whit537",
              "text": "Hi, Dan! 👋 Here's our [ticket re: GH URLs](https://github.com/osendowment/endowment.dev/issues/34).",
              "score": 2,
              "created_utc": "2026-02-26 18:08:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7k25tf",
                  "author": "ssddanbrown",
                  "text": "Nice! \n\nDoes any part of the project set a definition for what is considered open source in regard to this funding? I think I've also seen \"free and open source\" and \"FOSS\" used on the site. I know that you've previously had beyond-OSD views on that, and I've also [called out Konstantin](https://nitter.net/vinogradovk/status/1620888050447581185) on this before. Would be good to reinforce (maybe in the FAQ) what is considered open source in this context, especially for those handing over money to this.",
                  "score": 2,
                  "created_utc": "2026-02-26 18:17:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7lkxbw",
              "author": "ivosaurus",
              "text": "Hi, also a reminder that no single private group has any normative control over what the definition for \"open source\" means, or *any* gate keeping control over who gets to use it. And IMHO, people should be especially wary of any such group claiming to do so for themselves. I think the public FOSS community at large has enough intelligence to determine when something like the BSL isn't quite in their spirit.",
              "score": 0,
              "created_utc": "2026-02-26 22:38:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7m6f8s",
          "author": "BP041",
          "text": "the endowment model is interesting specifically because it separates \"will this project exist next year\" from \"is someone actively maintaining it this week.\" traditional grants have to solve both at once, which is why they often go to projects visible enough to attract attention but not necessarily the critical-but-obscure stuff.\n\ndaniel stenberg being in the founding members list is kind of perfect. curl is exactly the type of project this is built for -- everyone depends on it, nobody thinks about funding it.\n\ncurious how the governance piece works in practice. deciding which projects get the grants is historically where OSS funding falls apart. is that TBD or do they have a framework?",
          "score": 2,
          "created_utc": "2026-02-27 00:35:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qg2dj",
              "author": "ShaneCurcuru",
              "text": "The FAQ and Model are still being built, but there's plenty of basics that point to ethos the endowment is being built from.  And yes - it is explicitly an endowment, with the goal to be a long-term funding source built from an independent viewpoint (i.e. not a government and not corporate influence).\n\n[https://endowment.dev/faq/#investments](https://endowment.dev/faq/#investments)  \n[https://github.com/osendowment/model](https://github.com/osendowment/model)\n\nThat being said, this is just launched, so it's a work in progress being driven by folks who participate.\n\n ",
              "score": 1,
              "created_utc": "2026-02-27 17:27:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7mpns6",
          "author": "uniVocity",
          "text": "May I suggest you guys think about providing supporting infrastructure and standards to help open source developers obtain funding from their commercial users (that they don't even know they have)?\n\nExamples of standards that I believe most open source projects would benefit from if everyone adopted them\n\n1. latest version is free, patches in previous versions are not. Pay the developer to patch older versions or to receive patched builds. Rationale: Companies tend to lock in a specific version and only patch that as needed for stability - they are more likely to agree to pay for support\n\n2. Bug reports and feature requests are guaranteed to NOT be answered to until 30 days since the ticket was created have elapsed. Rationale: companies that need support and faster turnaround will be more willing to pay to get their issues addressed. \n\nExamples of infrastructure support:\n\n1. Provide a centralised and standardised repository for open source developers to submit their builds. Make latest major versions available for free. Patched builds only available for paying users. You guys can manage the entire “customer workflow” for all projects, offering a standard and familiar experience for the paying users of all open source projects you host. Take a cut to help keep the operation going, process payments, etc then pay the project owners.\n\n2. Provide centralised issue tracking, documentation and other project management services so that all open source developers have a standard mechanism to communicate with paying and non paying users. \n\n\nThe biggest pain point for me as an open-source developer is that I want to work on my projects and waste the least amount of time possible building and managing another large puzzle involving infrastructure to MAYBE get a donation or paying user. \n\nCurrently github and other platforms don’t really have much of anything to support open source developers to manage their potential customers/payments/etc so each project has to somehow address this and build their own additional infrastructure \n\nAs if the project in itself wasn’t work enough, there’s website, repository, cloud services, servers, communications, private issue tracker, private repository for specific clients and customized builds, payment gateways, license servers, legal agreements etc etc to take care of if you really want to live off of open source.\n\nThat’s a lot of additional effort on top of maintaining an open source project on the spare time. We need help to be allowed to focus exclusively on what we are building.",
          "score": 2,
          "created_utc": "2026-02-27 02:26:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l9orm",
          "author": "HonestRepairSTL",
          "text": "I don't have $1000 but being able to provide feedback as to how funds are distributed sounds like a very rewarding task.\n\nI own a phone and computer repair shop called Honest Repair that has a focus on digital privacy, right to repair, right to own, and I sort of educate people on these topics. Naturally I recommend FOSS alternatives to pretty much anything I can that a customer needs for a plethora of reasons and I am fairly involved in the open source community despite not knowing anything about app development.\n\nAnyways, just wanted to throw it out there if you'd like my feedback any time. I've been studying privacy and open source for the last 6 or 7 years now and now I help people achieve their privacy goals professionally.",
          "score": 1,
          "created_utc": "2026-02-26 21:43:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lba20",
              "author": "bonareader",
              "text": "We don't require $1000 to provide feedback, and welcome everybody in our [repo](https://github.com/osendowment/foundation). Meanwhile, we weigh feedback based on how much \"skin in the game\" a person has, prioritizing opinions of (1) members, (2) other donors, (3) everybody else. As an entrepreneur, I believe you understand this approach.",
              "score": 1,
              "created_utc": "2026-02-26 21:50:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7myaha",
          "author": "BrycensRanch",
          "text": "I’m happy to see more companies getting together to fund open source. Please make sure SignPath gets some love for providing free code signing certificates to open source projects",
          "score": 1,
          "created_utc": "2026-02-27 03:16:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7um1m8",
          "author": "Alarming_Bluebird648",
          "text": "An endowment model is a logical way to stabilize projects that lack the marketing reach of major foundations. I'm interested to see how they verify the 'criticality' of under-visible projects to ensure the funds reach the deep-stack maintainers who are often overlooked.",
          "score": 1,
          "created_utc": "2026-02-28 08:39:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rg6t6t",
      "title": "How can an open source OS be locked down?",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rg6t6t/how_can_an_open_source_os_be_locked_down/",
      "author": "bdhd656",
      "created_utc": "2026-02-27 13:33:41",
      "score": 42,
      "num_comments": 26,
      "upvote_ratio": 0.82,
      "text": "I’ve wanted to move to android for a while but since then I’ve seen Google locking down the OS, even tho people also say android whilst open, will probably die soon.\n\nI don’t understand why certain things like linux thrive but android (I know it’s technically linux) can’t thrive as well? Is it because phones can lock their bootloaders? Can’t a manufacturer just make a phone that can have that unlocked? And then forks like graphene or maybe a whole new linux OS work? Wine alternative but with phone?\n\nBasically my question is, why not just ignore google and move to something else? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1rg6t6t/how_can_an_open_source_os_be_locked_down/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7p7roq",
          "author": "Odd-Musician-6697",
          "text": "The android that is shipped to consumer devices is a heavily modfied fork of actual android. Even pixel devices.",
          "score": 69,
          "created_utc": "2026-02-27 13:48:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7vskyn",
              "author": "Saragon4005",
              "text": "According to the trademarks that *is* actually android. AOSP is referred to with a different name.",
              "score": 12,
              "created_utc": "2026-02-28 14:21:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7p926c",
          "author": "JadedCauliflower6105",
          "text": "Locked boot loader is the main problem. Basically stops you from being able to put anything other than the factory OS onto it. Manufacturers generally do not want you putting a different OS on your phone. Some phones don’t have this restriction, such as the Google Pixel, ironically enough.\n\nLinux Mobile is showing promise but just isn’t where it needs to be for it to actually compete. \n\nGraphene is probably the strongest alternative to straight up Android without switching to an iPhone. The main issue is finding a phone that actually lets you use it.\n\nThe Google Pixel, as mentioned before, lets you unlock the boot loader and can therefore run Graphene. These Pixel phones are probably ideal, though the devs of Graphene are planning to switch to supporting something else due to where Google is trying to go with everything. Nothing and CMF Phones, and some OnePlus devices, lets you unlock the boot loader and can technically run other OS’s like Graphene, though I’m not sure how well it runs.",
          "score": 31,
          "created_utc": "2026-02-27 13:55:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rrx9q",
              "author": "Kuki_CZ",
              "text": "LineageOS is, I believe, the standard option to turn to. I have it on my old/backup OnePlus 8T and runs great. It also has quite an extensive lineup of supported devices (even the Nintendo Switch). Also, many other custom ROMs are built upon LineageOS, e.g. crDroid.",
              "score": 8,
              "created_utc": "2026-02-27 21:20:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7s1hfj",
                  "author": "JadedCauliflower6105",
                  "text": "This is one I’ve never heard of before. I’m gonna have to look into that.",
                  "score": 1,
                  "created_utc": "2026-02-27 22:08:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7sxbbn",
              "author": "edgmnt_net",
              "text": "At this point, let's face it, we kinda need some sort of open hardware. Open not just as in PC-open and maybe not necessarily as far as individual components, but we need open blueprints for what's essentially a highly-integrated assembly. That may end up requiring semi-open or at least durable/LTS components. And it might still be hard due to various regulations to make development cost-effective.",
              "score": 3,
              "created_utc": "2026-02-28 01:10:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7vyptv",
                  "author": "joeltak",
                  "text": "I believe that's what PinePhone and FairPhone are about\n(Edit: just found about HIROH as well)",
                  "score": 1,
                  "created_utc": "2026-02-28 14:56:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7zhems",
              "author": "dsifriend",
              "text": "I’d imagine Fairphone has a good stance on this too though I haven’t checked TBH",
              "score": 2,
              "created_utc": "2026-03-01 02:20:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7qtpl9",
          "author": "cgoldberg",
          "text": "You can take the source code that's available and do almost anything you want with it. However, if you want to use an official image from some manufacturer on a device with a locked bootloader and use Google's services, they can impose restrictions on what you can do... that really has nothing to do with it being open source or not.",
          "score": 8,
          "created_utc": "2026-02-27 18:31:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7s5ght",
          "author": "esmenard",
          "text": "You can make as many forks of Android as you want, it won't change anything if phones are still sold with Android installed on them",
          "score": 3,
          "created_utc": "2026-02-27 22:29:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wkqsk",
          "author": "Significant-Tie-625",
          "text": "Welcome to the good ol' US of A.  Where the only thing important to companies is restricting what customers can do, and making money... I should have said that last one first.\n\nA general misconception of countries that US citizens have, of countries outside of the US, is that everything is waaaaay more restrictive towards customers, when it's literally the otherway around.  The companies are the one that are restricted.  The EU got Apple to use USB-C and to require no locking of the bootloader of Android phones.\n\nEdit: fix a spelling error or two. And reworded a thing or two because my tired dumbass couldn't put words in the correct order.",
          "score": 2,
          "created_utc": "2026-02-28 16:48:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82a28m",
          "author": "Shinare_I",
          "text": "The source code being open doesn't do much when the apps running on it effectively disallow using your own build of it.",
          "score": 2,
          "created_utc": "2026-03-01 15:13:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pd7xt",
          "author": "Budget_Putt8393",
          "text": "Case study:\n\nApps make or break the phone. Google owns the app store for Android. If you ignore Google, you lose their apps. Your phone is an expensive brick with lots of potential.\n\nWhen you play Google's game, you get \"base\" Android, and a bunch of closed source additions. Those additions are where Google would place the verifications, etc. Those verifications would become the new doorway to the app store.\n\nMore general:\n\nOther sites would be required to pull same verifications.\n\nTake away:\n\nYou are free to run a version without the verification layer, but you will lock yourself out of everything interesting. If you/friends are willing to build your own ecosystem then you are welcome to fly the one finger solute to restrictions.\n\nAs long as you stay a small insular group you will probably slip under their radar. You will also be lonely. \n\nIf you start getting big/popular, then the governments will apply pressure to force you to require the verifications.",
          "score": 5,
          "created_utc": "2026-02-27 14:18:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pk5c7",
              "author": "P1r4nha",
              "text": "What kind of case study?\n\nAnd are you arguing Google closes Android because of the government? You also ignore that there is already an open source community for Android using the FDroid store. Sure, it's smaller, but it's not tiny, uninteresting or lonely.\n\nAlso: r/degoogle proves on a daily basis that you can run Android on phones without the Google ecosystem. Both proprietary as well as free software runs just fine on these phones.",
              "score": 6,
              "created_utc": "2026-02-27 14:54:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7umvag",
                  "author": "Siegranate",
                  "text": "There is indeed a small community of people committed to the FDroid store, but that community's only going to get smaller, seeing as Google seems to have their sights *still* set on [locking down Android](https://keepandroidopen.org).\n\nDoesn't seen like they'll be backing down any time soon, either.",
                  "score": 2,
                  "created_utc": "2026-02-28 08:47:14",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7r4z37",
                  "author": "9acca9",
                  "text": "i try this week and almost kill my cellphone, was a brick for several days... some phone you can other dont.   \ni really want to avoid the google shit but is pretty difficult. ",
                  "score": 1,
                  "created_utc": "2026-02-27 19:25:32",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7pld69",
                  "author": "Budget_Putt8393",
                  "text": "No, Google closes Android so they can force you into their money pit.\n\nBecause Google has closed Android (for money) they have lots to lose when the government starts handing out fines. \n\nBecause they have closed android, they have high likelihood of succeeding with implementing verification enforcement.\n\nI do run grapheneOS on my Pixel, so I'm aware. I also work in software development, and software/cyber security.",
                  "score": 1,
                  "created_utc": "2026-02-27 15:00:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o81v9bb",
          "author": "redit_handoff140",
          "text": "Move to an open OS then. Google Android is a fork and whilst it's become closed more and more it was never open to begin with - You want AOSP.\n\nMove to Lineage, or Graphene, of heck, go straight to Linux phones. We have some good ones now.",
          "score": 1,
          "created_utc": "2026-03-01 13:50:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qri0e",
          "author": "artlessknave",
          "text": "Easy\n\nAndroid is open source\n\nGoogle Android is closed source.\n\nAndroid is very different from Google Android.\n\n It's about like trying to use Gentoo, raw, vs a Gentoo distro with automated install\n\nUnless someone builds a build of android that's comparablemto Google's Android, Google's Android has the monopoly, and can basically do whatever they want.\n\nLike Microsoft with windows, until recently, with valve funding proton to create a ln alternative on Linux",
          "score": -1,
          "created_utc": "2026-02-27 18:21:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p8m88",
          "author": "speyerlander",
          "text": "1. It's the default mobile operating system.\n2. The ecosystem is already there, developers expect the Android API, most Linux desktop apps don't ship mobile interfaces.\n3. A phone is a much bigger attack vector for the average human than their PC or a server, most traditional Linux distros are years behind Android in terms of security. \n4. The AOSP, the open source base for pretty much all Android distributions, isn't locked down at all, you can modify it as much as you'd like. GrapheneOS is a prime example of a thriving ROM.\n5. When people talk about Google locking Android down, they usually refer to their plan to restrict app installation from 3rd party sources by implementing a mandatory developer verification system forcing all developers to provide personal information to Google in order to publish an app, even through a third party store like F-Droid or through Github. This won't impact the custom ROMs, they will probably remove it, but the OEMs wl likely integrate it, substantially decreasing the potential user base that will even be able to install those apps provided they aren't notorized through Google.",
          "score": -1,
          "created_utc": "2026-02-27 13:53:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7r718c",
          "author": "Link_Tesla_6231",
          "text": "Android was not designed and developed as an open operating system. Neither was chrome OS. Now chrome OS flex is an open OS.",
          "score": -1,
          "created_utc": "2026-02-27 19:35:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rhackw",
      "title": "If the plans Google has described for requiring developer identification for Android apps go into effect, will that conflict with (L)GPL?",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rhackw/if_the_plans_google_has_described_for_requiring/",
      "author": "Coises",
      "created_utc": "2026-02-28 18:40:47",
      "score": 31,
      "num_comments": 10,
      "upvote_ratio": 0.89,
      "text": "If the requirements for developer registration, fees and identification Google indicates it plans to impose on all apps before they can run on most useful Android devices take effect, will it then violate the GPL (and possibly LGPL) to distribute applications relying on those licenses with the mandatory signatures?\n\nIt seems this would conflict with copyleft requirements that users must be able to modify and update GPL applications and LGPL components of applications without further restrictions or requirements imposed.\n\nWill apps like Kodi and VLC be no longer operable on Android TV devices?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1rhackw/if_the_plans_google_has_described_for_requiring/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7xtct7",
          "author": "Alarming_Bluebird648",
          "text": "This sounds like a potential Tivoization issue where the hardware or OS platform restricts the user's ability to run modified code by requiring a central authority's signature. While GPLv2 is more ambiguous on this, the GPLv3 was specifically designed to protect against these types of installation requirements.",
          "score": 14,
          "created_utc": "2026-02-28 20:35:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x8v3p",
          "author": "Leseratte10",
          "text": "I'm not a lawyer, but I don't think it would.\n\nThe GPL is concerned about a developer making it more difficult for users / other developers to replace a binary with their own.\n\nBut that's not the case, an external entity (Google) is making it more difficult both for the developer himself and for any others to distribute apps for Android. If both the original developer and you (the user) need to jump through the exact same hoops to get the software running, I don't see the GPL preventing that.\n\nThey are able to do all that with the same restrictions as the original developer, so, without \\*further\\* restrictions imposed. It doesn't say \"without any restrictions imposed\".\n\nAlso, you can still install your own apps locally using ADB, which is still way, way easier than replacing a GPLv3 binary on, say, your router or your IoT device.",
          "score": 6,
          "created_utc": "2026-02-28 18:48:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xdjtz",
              "author": "RealisticDuck1957",
              "text": "A likely relevant legal concept is tortious interference, action obstructing the legal obligations of another.\n\nAnd if you call me a lawyer I'll take it as an insult.",
              "score": 3,
              "created_utc": "2026-02-28 19:12:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o822n22",
          "author": "BP041",
          "text": "interesting question. imo the GPL angle is tricky but probably doesn't hold up legally — the license governs source code distribution, not the platform's terms for running binaries. Google isn't preventing you from modifying or redistributing the code, they're preventing unsigned binaries from running on *their* devices.\n\nthat said, the practical effect is the same. if you can't run modified versions without registering and paying fees, the spirit of copyleft is dead even if the letter survives. it's the same playbook Apple's been running with iOS for years.\n\nthe real fight here isn't GPL compatibility — it's whether Android stays meaningfully open or becomes iOS with extra steps.",
          "score": 2,
          "created_utc": "2026-03-01 14:33:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7z6mrn",
          "author": "robreddity",
          "text": "There's nothing about the actions Google has taken that makes it more difficult for you to get source code and modify it.\n\nAre their actions anti-competitive?  For sure.  Could a bunch of state attorneys general coordinate and go after them (again)?  Sure.",
          "score": 1,
          "created_utc": "2026-03-01 01:14:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yyuwn",
          "author": "SheriffRoscoe",
          "text": "Nope.  The GPL ensures users receive all the code for a program if they receive the binary.  That's all.  It doesn't require a third party (Google) to do anything.",
          "score": 0,
          "created_utc": "2026-03-01 00:28:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7zahya",
              "author": "Coises",
              "text": "I understand that the license cannot bind a third party. That’s not what I’m thinking. Consider this:\n\nI write an Android app which makes use of some GPL code. Of course, I license the combined work GPL as well and make the source code available.\n\nI also do as Google asks — register, submit identification, pay the fee and sign the binary. Then I distribute the binary (with information about how to get the source).\n\nAm *I* now in violation of the GPL? Recipients of that binary — even with full source code available — cannot recreate a working copy with updates or changes without meeting additional requirements: they themselves would have to register, submit identification and pay the fee to Google in order to sign and create a working binary which they could then use and/or distribute.\n\nBy signing that binary, I created and distributed something recipients can’t create or distribute without going beyond the conditions under which the GPL says they must be able to modify the source code and use or distribute the results. It seems like that might be a problem.\n\nSimilar considerations might apply to any app store (including the Play store, but also others) who would seek to distribute the signed binary.\n\nI’m not arguing, as I really don’t claim to know the answer — the legal complexities of viral/copyleft licenses are outside of my field of knowledge. I just want to clarify what question I am asking.",
              "score": 5,
              "created_utc": "2026-03-01 01:38:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7zttn0",
                  "author": "SheriffRoscoe",
                  "text": "> Am _I_ now in violation of the GPL? \n\nNo.  By providing the original source, you have met your obligation to the code you used, and to it's owners.  (Your own code, of course, puts no obligations upon you.) \n\n>Recipients of that binary — even with full source code available — cannot recreate a working copy with updates or changes \n\nYes, they can.  Imagine, for a moment, that C compilers are not available for free on almost every platform - that was actually the case 40 years ago.  And yet, almost all GPLed software at the time was written in C.  People who modified that code were not obligated to provide a free C compiler to people they gave the code to.  Nor were they required to provide free access to the very expensive platform where that compiler had to run.  Their obligation was to provide the _code_.\n\n>they themselves would have to register, submit identification and pay the fee to Google \n\nWhich they can do.  Or, they can sideload the app.  Or they can jailbreak the phone.  Or port your code to a Palm Pilot.\n\nYou get the point, right?   You're not applying restrictions to them or to to the code.  Yes, they may not have an easy (or maybe even possible) way to deploy it on the phone they want to run it on.  But that's between them, its manufacturer, and Google.",
                  "score": 2,
                  "created_utc": "2026-03-01 03:38:23",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o8017qz",
                  "author": "unitedbsd",
                  "text": "The thing with GPL is even if you provide source code doesn't mean you also need to provide tutorial or exact steps how to reproduce binary. Example Signal Messenger server code is GPLv3 but it is harder to put it on production but Matrix and simplex code is easily producible.\n\nAlso look at RHEL you will get src but it will be little difficult to produce ISOs easily like LFS. In contrast BSDs can be produced with a single line on terminal.\n\nI think we need GPLv4 which protects against AI/LLM leeches and force instructions to create reproducible build.",
                  "score": 1,
                  "created_utc": "2026-03-01 04:29:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rhh972",
      "title": "Quarkdown: Markdown with superpowers for typesetting",
      "subreddit": "opensource",
      "url": "https://github.com/iamgio/quarkdown",
      "author": "iamgioh",
      "created_utc": "2026-02-28 23:21:25",
      "score": 31,
      "num_comments": 10,
      "upvote_ratio": 0.87,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rhh972/quarkdown_markdown_with_superpowers_for/",
      "domain": "github.com",
      "is_self": false,
      "comments": [
        {
          "id": "o7yp2h3",
          "author": "This_Animal_1463",
          "text": "Super cool and looks very useful. It looks like just a CLI tool for now, right? Are there any plans to create a desktop or web app for this?",
          "score": 7,
          "created_utc": "2026-02-28 23:29:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7yphoe",
              "author": "iamgioh",
              "text": "Thank you! A web app is planned for the end of this year",
              "score": 5,
              "created_utc": "2026-02-28 23:32:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ys3wq",
                  "author": "This_Animal_1463",
                  "text": "I’ll definitely be checking it out. The option to self-host or integrate with something like NextCloud would be awesome as well. As a researcher, I’ve got materials spread out over several different platforms for notes, papers, and presentations because they all require different formats that I can only really use on those platforms. Being able to combine those into one platform would be great",
                  "score": 2,
                  "created_utc": "2026-02-28 23:48:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7ys1j3",
              "author": "iamgioh",
              "text": "Using the VS Code extension won't require you to use the CLI though!",
              "score": 2,
              "created_utc": "2026-02-28 23:47:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o81zap6",
          "author": "knowwho",
          "text": "How does it compare to Asciidoc?",
          "score": 1,
          "created_utc": "2026-03-01 14:13:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82a4c2",
          "author": "Groveres",
          "text": "About the wiki, how hard is it to apply you own css on it? Btw, great idea.",
          "score": 1,
          "created_utc": "2026-03-01 15:13:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81xsbh",
          "author": "Aaron_McCloud",
          "text": "As a LaTeX user I haven't had much interest in markdown but I like it's accessibility. I'm curious as to what sets this project apart from typst which seems like a more mature project?\n\n\nI would think it would be better to focus more effort on contributing to one finished project rather than having two competing betas.\n\n\nThe only feature difference I see is HTML exporting not being finished in typst yet, why not contribute to typst and help finish that feature?",
          "score": 0,
          "created_utc": "2026-03-01 14:05:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o82b2dz",
              "author": "Irverter",
              "text": "You're welcome to help typst instead of whining about someone's else new project.",
              "score": 0,
              "created_utc": "2026-03-01 15:18:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o82oe1i",
                  "author": "Aaron_McCloud",
                  "text": "I don't mean to come off as whining at all, I just get concerned by the tendency for projects to be more and more niche and for people to fight over favourites.\n\n\nIf the biggest criticism of FOSS is that its software isn't mature, then as a community we should stand behind projects that get the job done rather than splintering over our favourite niche projects",
                  "score": 1,
                  "created_utc": "2026-03-01 16:23:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1re0oe2",
      "title": "I got tired of culling thousands of bird photos, so I built an open source App to do it.",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1re0oe2/i_got_tired_of_culling_thousands_of_bird_photos/",
      "author": "BaseballClear8592",
      "created_utc": "2026-02-25 02:24:26",
      "score": 30,
      "num_comments": 10,
      "upvote_ratio": 0.8,
      "text": "Hey r/opensource,\n\nI'm a bird photographer, and if you know anything about wildlife photography, you know it involves holding down the shutter and taking thousands of burst shots in a single day. Coming home and manually culling 5,000 photos to find that *one* perfectly sharp shot with the bird's eye visible is soul-crushing work.\n\nI couldn't find a tool that did exactly what I wanted. **Almost all the good AI cullers out there are subscription-based or charge per image (and they are expensive).** Worse, most of them are trained for weddings/portraits and fail terribly at bird photography. So, I decided to build my own and make it completely free and open-source for everyone.\n\nI recently released **SuperPicky**, a smart, local AI photo culling desktop app built explicitly for bird/wildlife photographers. It's completely offline and licensed under GPL-3.0.\n\n**How it works & Tech Stack:** Instead of just using a generic aesthetics model, I built a pipeline that combines a few different models to mimic how a photographer actually reviews bird photos:\n\n* **YOLO11**: For precise bird object detection and segmentation masks.\n* **SuperEyes (Custom)**: Detects if the bird's eye is visible and calculates head sharpness (because if the eye isn't sharp, the photo is usually trash).\n* **SuperFlier (Custom)**: Identifies bird-in-flight (BIF) poses and gives them bonus points.\n* **OSEA (Open Set Entity Annotation)**: Evaluates overall image aesthetics and composition, while also supporting multiple avian taxonomy standards (like AviList, eBird) for precise species identification.\n\n**What it actually does for the user:**\n\n1. You feed it a folder of photos.\n2. It processes everything completely offline (local inference).\n3. It rates photos from 0 to 3 stars based on sharpness and aesthetics (with adjustable thresholds based on your skill level—Beginner to Master).\n4. **The best part:** It writes these ratings directly into the RAW file EXIF metadata so everything syncs perfectly when you import the folder into Lightroom.\n\n**A 2-Year Journey of Pure \"Vibe Coding\"** I've actually been working on this project on and off for **2 years**. The craziest part? I barely wrote the core logic by hand. **The entire thing was built using \"vibe coding\" (mostly prompting Cursor and various AI models).**\n\nIt hasn't been a smooth ride, though. For version 2.0, my AI tools convinced me to rewrite the whole app natively in **Xcode using Swift and CoreML**. It was a complete disaster. CoreML's memory management completely fell apart when trying to load and coordinate multiple complex vision models simultaneously, and the project stalled for half a year.\n\nFor version 3.0, I learned my lesson and **went back to a Python + PySide6 architecture**. While packaging it into standalone executables (especially for Windows + CUDA) is still painful, it made inferring YOLO11 and custom PyTorch models infinitely easier and more stable.\n\n**Power of the Community & We're iterating fast (Come join us!)** We are just about to push **v4.1.0**, which migrates the temp data handling to SQLite to give it a \\~1.9x speedup. It supports both macOS (Apple Silicon native) and Windows (CUDA & CPU).\n\nI really have to shout out the open-source community—**several awesome contributors have already jumped in to help tweak the code and fix annoying bugs (like weird Sony ARW parsing issues). We are iterating extremely fast right now.** Watching this grow from my personal messy script into a fast-moving, community-supported tool has been amazing.\n\nBecause my codebase is largely stitched together via vibe coding, I would absolutely love it if some experienced Python developers, CV enthusiasts, or even photographers want to get involved and contribute (whether via PRs or submitting issues). Dealing with packaging native Python AI apps for desktop (especially cross-platform) has been a huge learning curve, and I'm sure my codebase could heavily use some roasting or refactoring suggestions!\n\nYou can check out the source code and the app here: [https://github.com/jamesphotography/SuperPicky](https://github.com/jamesphotography/SuperPicky)\n\nWould love to hear any thoughts, feedback, or any roasts of my codebase! Thanks for building such an awesome community.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1re0oe2/i_got_tired_of_culling_thousands_of_bird_photos/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7aelsl",
          "author": "boneskull",
          "text": "If I had thousands of bird pics, I’d totally give this a try.",
          "score": 4,
          "created_utc": "2026-02-25 07:30:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7aw4sx",
              "author": "BaseballClear8592",
              "text": "Haha, careful! That’s exactly how it starts. First one blurry bird photo, and then suddenly you have 10,000 and you're looking for software to save you! Thanks for the support anyway.",
              "score": 3,
              "created_utc": "2026-02-25 10:13:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7aoc8g",
          "author": "Rxke2",
          "text": "Wow, that's awesome! ",
          "score": 3,
          "created_utc": "2026-02-25 09:00:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7aw5sx",
              "author": "BaseballClear8592",
              "text": "Thanks mate",
              "score": 3,
              "created_utc": "2026-02-25 10:13:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ch77f",
          "author": "Amazing-Persona-101",
          "text": "Sounds pretty cool, congratulations. \n\nCould the basic architecture be generalized for use in other domains?",
          "score": 2,
          "created_utc": "2026-02-25 16:03:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gpl7m",
              "author": "BaseballClear8592",
              "text": "Thank you! And that's a great observation.\n\nTechnically, yes—the architecture is quite flexible. As long as there’s a robust pre-trained model for a specific domain (like plants, insects, or even vehicles), the same workflow could definitely be applied.\n\nFor now, I’m focusing on perfecting the experience for bird photographers since that’s my personal passion, but I’d love to see the community adapt the core logic for other uses in the future!",
              "score": 1,
              "created_utc": "2026-02-26 05:06:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7z6tja",
          "author": "CapitalDiligent1676",
          "text": "The open source community should oppose vibe coding",
          "score": 0,
          "created_utc": "2026-03-01 01:15:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81titb",
              "author": "BaseballClear8592",
              "text": "So if you would like to open source a bird ai tool by you hands off code I will be so happy to but no body do it",
              "score": 1,
              "created_utc": "2026-03-01 13:39:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o82fjvl",
                  "author": "CapitalDiligent1676",
                  "text": "Let's say instead that I put some photos on the bird photographers site generated with nano banana",
                  "score": 1,
                  "created_utc": "2026-03-01 15:40:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rdru9x",
      "title": "An Open Source Minecraft Clone Made in Defold Engine with Lua",
      "subreddit": "opensource",
      "url": "https://youtu.be/64YWCuQgDLA?si=ng4pdglwRROZxtG9",
      "author": "cenkerc",
      "created_utc": "2026-02-24 20:34:19",
      "score": 21,
      "num_comments": 2,
      "upvote_ratio": 0.92,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1rdru9x/an_open_source_minecraft_clone_made_in_defold/",
      "domain": "youtu.be",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1reosmr",
      "title": "Cory Doctorow Argues Platform Lock-In Is a Competition Problem, Should Regulators Mandate Interoperability?",
      "subreddit": "opensource",
      "url": "https://hive.blog/tech/@revisesociology/on-big-tech-companies-and-control",
      "author": "davideownzall",
      "created_utc": "2026-02-25 20:26:07",
      "score": 19,
      "num_comments": 6,
      "upvote_ratio": 0.8,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1reosmr/cory_doctorow_argues_platform_lockin_is_a/",
      "domain": "hive.blog",
      "is_self": false,
      "comments": [
        {
          "id": "o7e5wrg",
          "author": "AshuraBaron",
          "text": "USE SPELL CHECK! The blog is just a mess. At least that shows it's written by a human I guess.\n\nTo the point though, I think this is how you build monopolies. You put so many regulatory requirements on a product that only the largest companies can afford to hit those targets. For the majority of multi platform software and products, I would put money on them starting out only supporting one or two platforms and building from that. I don't think pushing away from leveraging specific platform features is a good way to go about this. \n\nThe better route to me would be creating ways giants can be supplanted. Allowing new products and platforms to compete with the established normalcies on an even playing field. It's a complex process though and nothing something fits in a sound bite. ",
          "score": 6,
          "created_utc": "2026-02-25 20:41:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7flhc7",
              "author": "edgmnt_net",
              "text": "Yeah. I'll go further and say it's ironic to blame traditional competition when IP itself restricts competition to allow companies to sell stuff they make after the fact, *by creating and enforcing monopolies that would otherwise not exist and not be viable to implement contractually or through other reasonable means* (temporary or quasi-permanent as with copyrights). Also cheap money is fueling irrational growth and all this isn't really specific to software.\n\nRegulators should go home, they've had too much to drink already. No amount of patchwork is going to fix this, unless they actually intend to weaken IP thoroughly. Otherwise it's sort of a whack-a-mole that's disrupting things further (even, e.g., as you say by making it harder to comply).",
              "score": 1,
              "created_utc": "2026-02-26 01:03:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7fevsh",
          "author": "prodleni",
          "text": "Pairing Cory Doctorow with AI slop image is just..... Wow",
          "score": 3,
          "created_utc": "2026-02-26 00:27:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e6sr8",
          "author": "NotThatGuyAnother1",
          "text": "Fuck no.\n\n\nBrain dead, politicians fuck up technology every step they get their hands in it.\n\n\nIf you want only Google, Facebook, Amazon, then add more government regulations.  \n\n\nMoney will go from those companies to their lobbying firms, to the congress-critters and the consumer will pay for it all.  They'll shut out every small competitive company at every step.",
          "score": -9,
          "created_utc": "2026-02-25 20:45:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7f6i0i",
              "author": "Irverter",
              "text": "> If you want only Google, Facebook, Amazon\n\nLack of regulation is what allowed them to get there.",
              "score": 3,
              "created_utc": "2026-02-25 23:41:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7fnkz4",
                  "author": "edgmnt_net",
                  "text": "Even ignoring IP-based monopolies, consolidation of giant companies can be reasonably traced to artificial incentives for growth like cheap money coupled with artificial barriers like legal/compliance costs. This is way beyond mere economies of scale. \n\nAnd realistically we do have to consider IP here too, because it's a significant part of litigation and because it's the main enabling factor to develop stuff behind closed doors.\n\nWe've anything but a lack of regulation. Look at any of the more regulated fields and you'll see things are way worse, e.g. medicine.",
                  "score": 1,
                  "created_utc": "2026-02-26 01:15:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rbt0b5",
      "title": "Lightweight alternative to Sentry",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rbt0b5/lightweight_alternative_to_sentry/",
      "author": "imafirinmalazorr",
      "created_utc": "2026-02-22 18:13:31",
      "score": 18,
      "num_comments": 11,
      "upvote_ratio": 0.88,
      "text": "Hey everyone - I'd like to share a project that I've been working on. It's meant to be a lightweight, self-hosted alternative to Sentry. I was able to support my personal projects with about 2GB of RAM + 4 containers vs. Sentry's minimum of 16GB and 20+ containers.\n\nEverything in the repo is open-source under a AGPLv3 license, with an enterprise module that I merge in for the cloud stuff.\n\nThis is my first open-source project, so for the more experienced guys out there I'd love to hear your feedback!  \n\n\n[https://github.com/moneat-io/moneat](https://github.com/moneat-io/moneat)",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rbt0b5/lightweight_alternative_to_sentry/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o6tfsqv",
          "author": "nihal_was_here",
          "text": "From a fellow opensource contributor, nice project, will checkout...",
          "score": 5,
          "created_utc": "2026-02-22 18:40:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6th88y",
              "author": "imafirinmalazorr",
              "text": "Thank you! I really appreciate it.",
              "score": 1,
              "created_utc": "2026-02-22 18:46:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6tudf5",
          "author": "bullmeza",
          "text": "Very cool! Was it hard to setup the session replay feature?",
          "score": 1,
          "created_utc": "2026-02-22 19:50:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6txbeg",
              "author": "imafirinmalazorr",
              "text": "It wasn’t terrible but definitely one of the more difficult features. I don’t think I’m anywhere close to done though, I have a lot more on the todo list.",
              "score": 1,
              "created_utc": "2026-02-22 20:05:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6tznc3",
                  "author": "bullmeza",
                  "text": "Nice, I'd add the todo list to the repo :)",
                  "score": 1,
                  "created_utc": "2026-02-22 20:16:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6tvwzo",
          "author": "mizhgun",
          "text": "Any key differences from GlichTip?",
          "score": 1,
          "created_utc": "2026-02-22 19:58:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6twwvj",
              "author": "imafirinmalazorr",
              "text": "GlitchTip really only has issue and basic transaction support last I checked. No session replays.",
              "score": 1,
              "created_utc": "2026-02-22 20:03:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6u1qvc",
                  "author": "mizhgun",
                  "text": "Ah ok. Sorry I’ve missed that.",
                  "score": 1,
                  "created_utc": "2026-02-22 20:27:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1re8g3j",
      "title": "An alternative to Lenovo Vantage for Linux: KVantage",
      "subreddit": "opensource",
      "url": "https://github.com/kosail/KVantage",
      "author": "LibrarianEmpty5407",
      "created_utc": "2026-02-25 09:14:14",
      "score": 18,
      "num_comments": 0,
      "upvote_ratio": 0.92,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Alternatives",
      "permalink": "https://reddit.com/r/opensource/comments/1re8g3j/an_alternative_to_lenovo_vantage_for_linux/",
      "domain": "github.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1rft640",
      "title": "What do you think of source-available? Are we getting into the ever-so-slightly-barely-open-source world?",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rft640/what_do_you_think_of_sourceavailable_are_we/",
      "author": "jerrygreenest1",
      "created_utc": "2026-02-27 01:36:51",
      "score": 18,
      "num_comments": 8,
      "upvote_ratio": 0.83,
      "text": "It seems more and more projects move away from open-source to commercial source-available models. And I can see the benefit of course... When everything is open-source it is so easy to take advantage for the «big three». Rich become richer, and the open-source authors aren't as much rewarded. It makes sense: people aim to prevent providers like AWS/GCP/Azure from profiting without contributing anything. Everybody knows about this Redis incident where they decided to move away from open-source. Many more cases has happened like this, and nobody seemed to notice – but we're getting more and more far away from open-source world model to a source-available world.\n\nHere's some summary of popular tech moving away from open-source to source-available:\n\n\\- Redis storage in March 2023  \n\\- SpacetimeDB «gamey» distributed database in Aug 2023  \n\\- Terraform infrastructure-as-code in Aug 2023  \n\\- SentryIO error tracker in Aug 2024  \n\\- CockroachDB cool distributed database in Nov 2024  \n\\- ScyllaDB beautiful distributed database in Feb 2025  \n\\- Bear blogging solution in Nov 2025\n\nIt almost seems like this single Redis incident bootstrapped an entire trend of transitioning from open-source. There are less notable in this time-frame, I saved your time only listing most notable. And technically this entire movement hasn't started with Redis – because we've seen such licenses even before Redis. We've seen MongoDB moved away from open-source in 2018, and Elasticsearch in 2021. So it's not like Redis started it all.\n\nBut Redis case seemed one of the most loud to me, and it's almost like after this people started to transition more often. And if it's a data storage then – especially often. It's like we can almost already fear for losing Postgres or something? Hopefully not.\n\nI, in particular – was interested in distributed databases a lot: wanted to learn to make this horizontally-scaled data model without relying on any particular online service vendor. It's like a hobby of mine that I am trying to do in my free time, so now I am noticing. SpacetimeDB v2 from a few days ago looked really nice in marketed video but the self-hosted version from GitHub doesn't have all that is marketed: certain features are hidden behind their online service, while the self-hosted option only allows one node.\n\nWhat do you think of source-available? Is this to secure from abuse from rich companies becoming richer? Or is it bad for independent solo developers too? In some cases it seems it's really only to secure developer from competition, that's good, right? I mean, it would be really unfair if you do all the work and someone else only simply hosted your solution and gets all the credit. But in other cases it kinda defeats the purpose, like this SpacetimeDB where features are hidden. Also it's becoming hard to recognize what is what, when all of them are having different license: without a detailed inspection into the thing, I cannot tell beforehand: whether a tool can do what I want, or it's just a marketed bla-bla-bla that is hidden behind vendor-locking.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1rft640/what_do_you_think_of_sourceavailable_are_we/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7obec7",
          "author": "ssddanbrown",
          "text": "I personally think source available as a concept is fine, and respect the rights of developers to license their efforts how they wish, but I think it should not be conflated with open source, which it often is, and many producers of source available software mislead or downplay the rights limited relative to their actual license terms.\n\nI've got [a relevant blog post here](https://danb.me/blog/open-source-available-distinction/) if interested.",
          "score": 8,
          "created_utc": "2026-02-27 09:46:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7w3z8p",
              "author": "pydry",
              "text": "AGPL combined with source available is probably the best mix.\n\n\nIt prevents the purists from getting their panties in a bunch about it being \"not really open source\".\n\n\nIt prevents companies like amazon from charging for \"elastic search\" while contributing $0 to its actual development.\n\n\nIve noticed that there is a marked crossover between people who complain about source available \"not really being open\" and people who complain about AGPL. Both licenses are really pretty friendly to the average user while being deeply hostile to big tech's attempts to coopt and monopolize tech.",
              "score": 5,
              "created_utc": "2026-02-28 15:24:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ns2s3",
          "author": "GloWondub",
          "text": "I couldn't care less about source-available software.\nAs non-resilient and useless as closed tbh.",
          "score": 12,
          "created_utc": "2026-02-27 06:48:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nt7j5",
              "author": "trent-7",
              "text": "I would say it depends on the license. If you look at the Sustainable Use License (https://docs.n8n.io/sustainable-use-license/) or O'Saasy license (https://osaasy.dev/), they just limit SaaS usage, especially the latter one...",
              "score": 1,
              "created_utc": "2026-02-27 06:57:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7o4740",
                  "author": "GloWondub",
                  "text": "As I said, not open source, not my problem. And also out of topic for this subreddit.",
                  "score": 0,
                  "created_utc": "2026-02-27 08:36:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7syc7f",
          "author": "billFoldDog",
          "text": "If the community can't fork it, I don't want it.",
          "score": 4,
          "created_utc": "2026-02-28 01:16:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o50ki",
          "author": "kivanow",
          "text": "This hits close to home - I was at Redis when they added AGPL as the third license option last year (the \"open source is back\" announcement).                                                                     \n  \n**On source-available specifically:** I think it's a legitimate response to a real problem. The cloud provider dynamic isn't \"evil corporations stealing code\" - AWS, Google, and others had engineers                \ncontributing to Redis for years (TLS support, ACLs, coordinated failovers). The tension was about who controls the project direction vs. who captures the commercial value. There's no easy answer to that.       \n  \n**The problem for solo devs:** You nailed it - it's becoming impossible to tell what you can actually do without reading every license line by line. SSPL, BSL, RSAL, OCVSAL... they all have different               \nrestrictions, and \"source-available\" isn't a standardized term. Self-hosting is usually fine. Building a competing service usually isn't. Everything in between? Depends.                                         \n  \n**The Redis --> Valkey situation** is instructive though. When the license changed, external maintainers were effectively kicked out (some found out when their names disappeared from governance docs). Within         \nweeks, Valkey existed under the Linux Foundation. The lesson: governance matters as much as licensing. A permissive license controlled by one company can change overnight. A copyleft project with               \ndistributed governance probably won't.   \n  \n**What I look for now:**   \n\\- Who actually controls the project? Single company or independent maintainers?   \n\\- How easy is it to fork if things go sideways?   \n\\- Has the company changed licenses before, and how did they handle it?   \n  \nI wrote a longer breakdown of this whole landscape (including the Redis timeline and how dual-licensing actually works in practice) if anyone wants to go deeper: [https://medium.com/gitconnected/dual-licensing-explained-mit-source-available-and-why-your-favorite-tool-might-be-neither-d7041543e05d?sk=5901f94d18723141a05767ca61f3f266](https://medium.com/gitconnected/dual-licensing-explained-mit-source-available-and-why-your-favorite-tool-might-be-neither-d7041543e05d?sk=5901f94d18723141a05767ca61f3f266)   \n",
          "score": 2,
          "created_utc": "2026-02-27 08:44:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7w4v5s",
              "author": "pydry",
              "text": ">The cloud provider dynamic isn't \"evil corporations stealing code\" - AWS, Google, and others had engineers contributing to Redis for years\n\n\nIt isnt that they steal code. It's that if they charge me $30 / month for a redis instance then exactly $0 goes back to the original creators.\n\n\nIt's a parasitic relationship.\n\n\nThe way Amazon claimed to be \"a hero of open source\" when they forked elastic after elastic relicensed was not only pretty distasteful, it demonstrated just how little interest they had in actually maintaining the open version.",
              "score": 4,
              "created_utc": "2026-02-28 15:28:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rfikap",
      "title": "RackPeek v1.0.0 released (thank you!)",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rfikap/rackpeek_v100_released_thank_you/",
      "author": "aptacode",
      "created_utc": "2026-02-26 18:43:58",
      "score": 13,
      "num_comments": 2,
      "upvote_ratio": 0.94,
      "text": "I posted here last week feeling very disheartened about the state of opensource software after being involved in a bit of (resolved) [internet drama](https://www.reddit.com/r/opensource/comments/1r8fafs/why_build_anything_anymore/).\n\nI wanted to share that the response from the FOSS community was extremely uplifting and really gave me the energy to continue to provide the highest quality software craftsmanship I can.\n\nI now feel that Idioms like \"it’s a marathon, not a sprint\" and \"the last 10% is 90% of the effort\" have never been more relevant, especially with the prevalence of AI assisted tooling. We intend to keep the lessons learned over decades of software engineering in mind as we continue to provide our users with the stable and high quality experience that should be expected of professional software.\n\nThanks!\n\n[https://github.com/Timmoth/RackPeek](https://github.com/Timmoth/RackPeek)",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rfikap/rackpeek_v100_released_thank_you/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7kr9za",
          "author": "BKMD44",
          "text": "I subscribed to receive notifications on the project through GitHub, not really knowing what that entailed (I'm not a coder), and I was blown away by the amount of messages that hit my inbox. I was impressed by the continuous level of effort and am excited to use 1.0 and beyond. Thank you!",
          "score": 3,
          "created_utc": "2026-02-26 20:15:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lsua0",
              "author": "aptacode",
              "text": "Thank you for your interest in the project :) I really appreciate your support!",
              "score": 2,
              "created_utc": "2026-02-26 23:20:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rggdyh",
      "title": "Robert Kaye, Mayhem, In Memoriam - News",
      "subreddit": "opensource",
      "url": "https://mixxx.discourse.group/t/robert-kaye-mayhem-in-memoriam/33363",
      "author": "nPrevail",
      "created_utc": "2026-02-27 19:30:07",
      "score": 13,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1rggdyh/robert_kaye_mayhem_in_memoriam_news/",
      "domain": "mixxx.discourse.group",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1rdn2jd",
      "title": "I built a simple open-source Windows image viewer, feedback appreciated",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rdn2jd/i_built_a_simple_opensource_windows_image_viewer/",
      "author": "TheGameRoom420",
      "created_utc": "2026-02-24 17:45:20",
      "score": 12,
      "num_comments": 11,
      "upvote_ratio": 0.88,
      "text": "I've awfully neglected programming for the last year or so, so I made a simple image viewer that could replace the default one on Windows.\n\nI think the code is a bit messy, even though it's only a few hundred lines, and I did NOT keep my promise of adding more comments, but it's relatively bug free, at least for what I could deduce from my limited testing (probably missed a lot of edge cases). However, I'm happy that I learnt some new stuff (like how to actually make my code into an installable app (Inno Setup Compiler))!\n\nAny feedback you guys can give me is appreciated! Thanks!\n\nLink to GitHub repository: [https://github.com/Soytu611/OpenPhotoViewer](https://github.com/Soytu611/OpenPhotoViewer)",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rdn2jd/i_built_a_simple_opensource_windows_image_viewer/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o76tbkd",
          "author": "playffy",
          "text": "Please, any ui screenshots",
          "score": 4,
          "created_utc": "2026-02-24 19:12:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76ydu3",
              "author": "TheGameRoom420",
              "text": "[https://imgur.com/a/qisCJUb](https://imgur.com/a/qisCJUb)",
              "score": 3,
              "created_utc": "2026-02-24 19:35:40",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o76xtmr",
              "author": "parkerlreed",
              "text": "It's Tkinter. There's nothing to look at...",
              "score": 1,
              "created_utc": "2026-02-24 19:33:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o76yhn1",
                  "author": "TheGameRoom420",
                  "text": "True, but I tried my best to make it look okay :)",
                  "score": 3,
                  "created_utc": "2026-02-24 19:36:11",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7fmq0s",
          "author": "Hot-Butterscotch-396",
          "text": "I make one as well. you can see demo here:  \n[I built a local-first photo manager with Vue 3 + Tauri (Lap) : r/vuejs](https://www.reddit.com/r/vuejs/comments/1raw3u8/i_built_a_localfirst_photo_manager_with_vue_3/)",
          "score": 2,
          "created_utc": "2026-02-26 01:11:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hrd49",
              "author": "TheGameRoom420",
              "text": "Nice! Definitely more professional that mine :))",
              "score": 1,
              "created_utc": "2026-02-26 10:41:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7hv0zv",
                  "author": "Hot-Butterscotch-396",
                  "text": "thank you",
                  "score": 1,
                  "created_utc": "2026-02-26 11:14:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7mcyih",
          "author": "webfork2",
          "text": "Could you post some details to your Github page?  Right now I'm just seeing a license.  Screenshots, planned features, why it's different from other similar tools, etc.",
          "score": 1,
          "created_utc": "2026-02-27 01:12:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfeujp",
      "title": "I built a local dev gateway that gives every project a `.local` domain, auto-starts processes, and shares via Cloudflare Tunnel",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rfeujp/i_built_a_local_dev_gateway_that_gives_every/",
      "author": "WelcomeOne4851",
      "created_utc": "2026-02-26 16:30:53",
      "score": 12,
      "num_comments": 1,
      "upvote_ratio": 0.84,
      "text": "I made [Coulson](https://github.com/ratazzi/coulson), a local development gateway inspired by the old [Pow](http://pow.cx/) for macOS, rewritten in Rust with a lot more features.\n\nThe idea: **stop memorizing port numbers — every project gets a `.local` domain that just works.**\n\n## The problem\n\nWhen working on multiple projects locally:\n\n- Juggling ports across projects (`localhost:3000`? `3001`? which one was that again?)\n- Testing on your phone means looking up your IP and fiddling with firewall rules\n- Sharing a WIP with a teammate or client turns into an ngrok/tunneling adventure\n- Debugging webhooks requires a public URL, and when something fails you have to ask the sender to retry\n\n## How it works\n\nInstall: download [Coulson.app](https://github.com/ratazzi/coulson/releases), open it, done. The daemon starts automatically.\n\n### 1. Port proxy — one line\n\nAlready have a service on port 3000:\n\n```bash\necho 3000 > ~/.coulson/myapp\n# visit http://myapp.coulson.local:18080/\n```\n\nThe filename becomes the domain prefix. That's it.\n\n### 2. Python / Node.js — auto-start on first request\n\nSymlink your project into `~/.coulson/` and Coulson detects and manages the process:\n\n```bash\nln -s ~/Projects/hello ~/.coulson/hello\n# visit http://hello.coulson.local:18080/\n```\n\n- Python: detects `app.py` + `pyproject.toml` → starts with uvicorn/granian\n- Node.js: detects `package.json` → picks the right package manager (bun/pnpm/yarn/npm) and runs the dev script\n\nIdle processes are reaped after 15 minutes and restarted on next request.\n\n### 3. Phone / LAN — mDNS discovery\n\nEnable \"LAN Access\" for a project in the web dashboard or menu bar app. The `.local` domain is published via mDNS — phones, tablets, and other devices on the same network can access it directly.\n\n### 4. Public sharing — one command\n\n```bash\ncoulson tunnel start myapp\n```\n\nGenerates a public URL via Cloudflare Tunnel. Supports quick tunnels (random URL) and named tunnels (wildcard DNS on your own domain — new projects are instantly reachable).\n\n### 5. Request recording & replay\n\nEnable Inspect on a project and the gateway records every request with full details. Review them in the web dashboard and replay with one click — no more asking webhook senders to retry.\n\n## Vibe coding friendly\n\nSSH into your dev machine from a phone or tablet, vibe code with Claude Code / Codex / OpenCode, but you can't preview what the server is rendering. Start a tunnel and your project instantly gets a public URL you can open right there in your mobile browser.\n\n## Other features\n\n- Web dashboard + macOS menu bar app\n- `sudo coulson trust` — trust the local CA, enable HTTPS\n- `sudo coulson trust --pf` — take over port 80/443, drop the port number\n- Multi-route per domain (path-prefix routing to different backends)\n- Config changes take effect within 2 seconds\n\n## Stack\n\nRust + [Pingora](https://github.com/cloudflare/pingora) (Cloudflare's open-source reverse proxy library). Swift for the macOS menu bar app.\n\nGitHub: https://github.com/ratazzi/coulson",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1rfeujp/i_built_a_local_dev_gateway_that_gives_every/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": []
    }
  ]
}