{
  "metadata": {
    "last_updated": "2026-01-25 08:55:25",
    "time_filter": "week",
    "subreddit": "opensource",
    "total_items": 20,
    "total_comments": 181,
    "file_size_bytes": 207347
  },
  "items": [
    {
      "id": "1qk6vz5",
      "title": "Drowning in AI slop, cURL ends bug bounties",
      "subreddit": "opensource",
      "url": "https://thenewstack.io/drowning-in-ai-slop-reports-curl-ends-bug-bounties/",
      "author": "CackleRooster",
      "created_utc": "2026-01-22 21:09:59",
      "score": 885,
      "num_comments": 59,
      "upvote_ratio": 0.99,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Community",
      "permalink": "https://reddit.com/r/opensource/comments/1qk6vz5/drowning_in_ai_slop_curl_ends_bug_bounties/",
      "domain": "thenewstack.io",
      "is_self": false,
      "comments": [
        {
          "id": "o14sndb",
          "author": "fragglet",
          "text": "The hilarious but sad part was the sloperator in the comments for the PR who thinks the garbage reports are all legit:\n\n\n> So luddites laugh at how bad vibecoding is, but when AI finds more bugs than code in a human project, they take down the bounty instead of fixing them.\n\n\nDaniel has given multiple talks at this point about how utterly useless the garbage AI reports are. Yet there are still delusional AI shills who don't understand that they're not helping. ",
          "score": 230,
          "created_utc": "2026-01-22 22:38:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o15jmgh",
              "author": "SpezLuvsNazis",
              "text": "They also seem to think they are the only ones to have ever thought to apply this tool to the code base. They lack the empathy to think, “hey, this simple thing I just did? Maybe someone else already thought to do that and I should take a step back and look at what I’m proposing”.",
              "score": 58,
              "created_utc": "2026-01-23 01:01:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1acd4e",
                  "author": "Brilla-Bose",
                  "text": "too big of a thought to hold in a vibe coder's brain though!",
                  "score": 7,
                  "created_utc": "2026-01-23 18:49:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o150l5h",
              "author": "pampuliopampam",
              "text": "Oooh sloperator is good, stealing that for when cogsucker feels too crass",
              "score": 79,
              "created_utc": "2026-01-22 23:21:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o179bid",
                  "author": "RWOverdijk",
                  "text": "I’m stealing both",
                  "score": 14,
                  "created_utc": "2026-01-23 07:43:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o16urhq",
              "author": "MulberryExisting5007",
              "text": "This is basically what’s happening with Reddit at large.",
              "score": 17,
              "created_utc": "2026-01-23 05:44:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o171e30",
                  "author": "disless",
                  "text": "The influx of AI slop has led me to start muting tech related subs that I otherwise would rather continue reading",
                  "score": 11,
                  "created_utc": "2026-01-23 06:36:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o161tw9",
              "author": "Shogobg",
              "text": "Can we find the sloperator’s repositories and drown them in false AI bug reports? Oh wait, if they have any repositories at all, they’re probably full on AI security nightmare.",
              "score": 14,
              "created_utc": "2026-01-23 02:43:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o182p9t",
                  "author": "BCMM",
                  "text": "The problem here is the asymmetry of effort. People are using machines to mass-generate things that superficially look like vulnerability reports, and real humans who care about security are bogged down actually looking at them, trying to understand them, looking for the real reports buried under the slop.\n\nIt doesn't work the other way, because the adversary does not want to think and understand. Do this back to them, and they'll just feed the fake reports in to their LLM and have it make some meaningless changes to their project, expending no more effort than it took to generate the spam.",
                  "score": 10,
                  "created_utc": "2026-01-23 12:02:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o16ax4f",
                  "author": "ButtSpelunker420",
                  "text": "https://github.com/curl/curl/pull/20312#issuecomment-3753365992\n\nYes",
                  "score": 2,
                  "created_utc": "2026-01-23 03:34:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o16oxrj",
              "author": "OrixAY",
              "text": "Skill issue - should have added “make no mistake” in the prompt /s",
              "score": 4,
              "created_utc": "2026-01-23 05:02:45",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o17bka1",
              "author": "unit_511",
              "text": "The Luddites destroyed the machines because they were used to produce low quality goods while depressing the wages of the people who actually knew what they were doing. Our sloperator here was so close to self awareness.",
              "score": 1,
              "created_utc": "2026-01-23 08:03:38",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o18um3x",
              "author": "MegaDork2000",
              "text": "Yesterday I had AI do a code review of some critical code that operated on encrypted data.  It proudly found a bug that caused non encrypted files to get rejected.  \"This fix now allows plaintext files to be used!\".  Um, OK.",
              "score": 1,
              "created_utc": "2026-01-23 14:43:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o16soiv",
              "author": "makemeking706",
              "text": "This code is 200% bugs. ",
              "score": 1,
              "created_utc": "2026-01-23 05:28:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o14bb7l",
          "author": "Corruptlake",
          "text": "Good call",
          "score": 136,
          "created_utc": "2026-01-22 21:12:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1777tr",
              "author": "Katops",
              "text": "Don’t you mean, good *curl*?\n\nI’m outta here.",
              "score": 24,
              "created_utc": "2026-01-23 07:25:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1e1our",
                  "author": "g33ksc13nt1st",
                  "text": "Hi Gru",
                  "score": 1,
                  "created_utc": "2026-01-24 07:32:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o177zc9",
                  "author": "noisedotbar",
                  "text": "mic drop 👏🏻",
                  "score": 1,
                  "created_utc": "2026-01-23 07:31:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o14czpg",
          "author": "v4ss42",
          "text": "AI is why we can’t have nice things.",
          "score": 184,
          "created_utc": "2026-01-22 21:20:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14gink",
              "author": "jonhanson",
              "text": "From the end of the article: \n\n\n> Stenberg’s problem isn’t with AI per se; it’s how lazy people are using AI thoughtlessly to look for a bounty check or a reputation as a security researcher.",
              "score": 99,
              "created_utc": "2026-01-22 21:37:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o14h9st",
                  "author": "v4ss42",
                  "text": "“The purpose of a system is what it does.” Not what people _claim_ or _wished_ it does.",
                  "score": 70,
                  "created_utc": "2026-01-22 21:40:41",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o14uxtd",
                  "author": "PositiveBit01",
                  "text": "Sure, but the problem is they think this will work because the AI is convincing enough to them. \n\nI do think that's a problem with AI. It is notoriously not good at estimating confidence in answers and providing incorrect answers that seem reasonable at first glance.\n\nYou could say this is user error but in my opinion that's just the marketing working. If AI was marketed as likely to be incorrect and only for expert users who can tell when it's lying, it wouldn't be as big as it is.",
                  "score": 15,
                  "created_utc": "2026-01-22 22:51:51",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1amaxz",
                  "author": "yung_dogie",
                  "text": "I'm mixed on it. Yeah before LLMs we had people copy pasting stack overflow without a grasp of what it answers, and before stack overflow we probably had some other nonsense too. The core issue is a lack of critical thinking that way too many people are too comfortable doing. On the other hand, LLMs as a tool really enable non-critical thinking even more, it can make things worse even if its express intent as a tool isn't to do that.",
                  "score": 1,
                  "created_utc": "2026-01-23 19:35:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o14fxr4",
              "author": "Horror-Deer-3331",
              "text": "And this will evolve to “AI is why we can have essential things pretty quickly”.\n\nEdit: crap, I meant “can’t” have estival things, this shit is the reason electronic prices are exploding and soo it will be water, electricity…. So essential things will also get more expensive.",
              "score": -44,
              "created_utc": "2026-01-22 21:34:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o14gd8y",
                  "author": "v4ss42",
                  "text": "Unlikely.",
                  "score": 22,
                  "created_utc": "2026-01-22 21:36:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o14i6wx",
                  "author": "AnachronGuy",
                  "text": "You're dreaming, wake up!",
                  "score": 15,
                  "created_utc": "2026-01-22 21:45:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o16h6yl",
          "author": "IntroductionSea2159",
          "text": "I'd raise the bug bounty and charge a fee to submit a claim. If people want the bounty, they should be prepared to stake money on their claim being legit.",
          "score": 25,
          "created_utc": "2026-01-23 04:12:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17jhni",
              "author": "Gear5th",
              "text": "This will prevent any students/growing-researchers from progressing. Universities are unlikely to sponsor the submission fee. ",
              "score": 9,
              "created_utc": "2026-01-23 09:16:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o17jm1c",
                  "author": "IntroductionSea2159",
                  "text": "The submission fee can be something like $100. Just enough that it's a terrible investment to submit AI-generated bug bounties.",
                  "score": -5,
                  "created_utc": "2026-01-23 09:18:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o19n059",
                  "author": "RegisteredJustToSay",
                  "text": "Progressing??? For us hackers bug bounties are for $$$, not some philanthropy or education project although it's nice if you learn something too. Reporting vulns for free used to be the norm and bug bounties brought in the get rich quick crowd. Good actors can still research and report vulnerabilities all they want - no one can even stop you even if they'd like to. The people making this a problem are grifters looking for an easy payday.",
                  "score": -2,
                  "created_utc": "2026-01-23 16:54:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o19jklp",
          "author": "Onaliquidrock",
          "text": "sad",
          "score": -1,
          "created_utc": "2026-01-23 16:39:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qiuagx",
      "title": "Am I Cheating?",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qiuagx/am_i_cheating/",
      "author": "tentoumushy",
      "created_utc": "2026-01-21 10:21:01",
      "score": 363,
      "num_comments": 56,
      "upvote_ratio": 0.94,
      "text": "So, I'm running a smaller-sized open-source project on GitHub with around 1.2k stars (interestingly enough, it's neither a dev tool nor a library, but a super niche, consumer-facing educational tool that I host online). \n\nRecently, I've had the idea of automatically generating \"good first issues\" for the repo to encourage growth and drive traffic to the project. The issues are *so* dead simple that anyone with 0 experience in our tech stack or even programming in general can come in, get them done in under a minute, open a PR and be done with it. \n\nLo and behold, the repo has gotten 100+ new, one-and-done contributors and an according number of stars and forks, to the point where I feel that I'm cheating the system and GitHub's algorithm by doing this; the automatically-created \"good first issues\" are monotone and brain-dead at best, and even though their contents technically reach the end-users, these issues/contributions provide no real meaningful value other than consistently and artificially inflating my repo's star/fork/contributors count. \n\nSo, am I cheating? All feedback welcome. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1qiuagx/am_i_cheating/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o0u2s1q",
          "author": "mpierre",
          "text": "I saw a problem in a repo I use. A brain-dead issue. I forked it, fixed it (one line of code), and did a PR.\n\nThe developers make between 2 and 5 commits per day on the project. 18 months after my PR, it's still not reviewed; it's still not commented on by the people on GitHub. 2 people commented that they need this fix too.\n\nThey simply don't care about fixing that bug. They only need to merge my PR. I don't even ask for anything.\n\nBut they don't.\n\nI checked, and they don't accept any external PR. Period.\n\nYour cheating, is showing the world that you do. That you are open to collaboration. And who knows, maybe a few of these people will later decide to maintain it when you are sick, or busy, or in jail (it happened on a project a few years ago, the guy was in jail for false rape accusation, but I can't find any news articles today)\n\nI contributed on a project a few years ago where the guys takes a 2 week vacation each year, completely disconnected for his sanity.\n\nFor about 3 years, I was the maintainer during those 2 weeks because I had fixed a brain dead issue, which got us talking, and well, I contributed to it a few more times.",
          "score": 113,
          "created_utc": "2026-01-21 11:02:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u6d9w",
              "author": "matthewlai",
              "text": "There's Hans Reiser in jail for murder. His code (ReiserFS) didn't really make it.",
              "score": 13,
              "created_utc": "2026-01-21 11:32:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0ua170",
                  "author": "really_not_unreal",
                  "text": "I swear there was another example of someone who was falsely accused (unlike him)",
                  "score": 4,
                  "created_utc": "2026-01-21 12:00:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0xvdp3",
              "author": "Aspie96",
              "text": "Sadly GitHub in particular has no way of not allowing pull requests (while issues can be disabled), so this is understandable if it was on GitHub.",
              "score": 3,
              "created_utc": "2026-01-21 22:25:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0xycu9",
                  "author": "mpierre",
                  "text": "Oh, I understand that! My point was just, they clearly didn't want  PRs, and with his cheat, the OP is showing he does. It's making people like me increase the chance that I will contribute.",
                  "score": 3,
                  "created_utc": "2026-01-21 22:40:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1e2l91",
                  "author": "Owndampu",
                  "text": "I believe it was finally disabled on the linux github repo. The trolling was getting out hand I think",
                  "score": 1,
                  "created_utc": "2026-01-24 07:40:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0x7u9a",
              "author": "Houbovo",
              "text": "I’ve fixed an issue which is bugging many users of an app. Wrote the solution on the Discord as i’m not a developer and all code (~40 lines) generated by ai as i don’t speak that language. It was more proces than technical issue. Anyway, i hoped that that will take it and somehow integrate it.",
              "score": 1,
              "created_utc": "2026-01-21 20:36:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0u18y7",
          "author": "afunkysongaday",
          "text": "Probably but I still like the idea! I could imagine it makes noobs like myself feel empowered, and after one learns how to use github itself, fork, create pull requests and so on, that also makes attacking actual problems more reachable.\n\nI think you should just be transparent about this in your readme. Something like:\n\n>Contains automatically generated issues:  \nThis project contains issues that have been automatically generated to increase contributions. These issues are only issues in the technical sense, they do not pose an actual challenge to the regular maintainer(s). They are easy to understand and solve even for people with little to no knowledge of this code base or programming in general. The maintainer(s) hope to get people to peek into the code that otherwise wouldn't, introduce them to contributing to OSS in a fun way, while also improving github metrics.",
          "score": 146,
          "created_utc": "2026-01-21 10:49:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u6nc8",
              "author": "matthewlai",
              "text": "\\+1. Honesty is the best way.\n\nCan also word it as something like: \"See here for a list of automatically generated issues to help new contributors get started on this project\"",
              "score": 56,
              "created_utc": "2026-01-21 11:34:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0vwlqg",
              "author": "superstrijder16",
              "text": "And potentially tag the issues with a specific label so people can choose not to see them too",
              "score": 11,
              "created_utc": "2026-01-21 17:06:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0w3aq1",
              "author": "priestoferis",
              "text": "Spot on for an educational tool!",
              "score": 7,
              "created_utc": "2026-01-21 17:36:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0uvh13",
          "author": "-TRlNlTY-",
          "text": "You made it easier to contribute and the project is more successful because of that. I think it is completely fair.",
          "score": 7,
          "created_utc": "2026-01-21 14:11:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uawsr",
          "author": "issa62",
          "text": "Approved",
          "score": 9,
          "created_utc": "2026-01-21 12:06:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v41oh",
          "author": "Kind-Kure",
          "text": "LGTM",
          "score": 4,
          "created_utc": "2026-01-21 14:55:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vgyvl",
          "author": "aliyark145",
          "text": "How are you creating those \"good first issues\"? Share the trick",
          "score": 4,
          "created_utc": "2026-01-21 15:55:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xi8ts",
          "author": "whit537",
          "text": "\\> neither a dev tool nor a library, but a super niche, consumer-facing educational tool that I host online\n\nLink? Got me curious.",
          "score": 3,
          "created_utc": "2026-01-21 21:24:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0xr2qj",
              "author": "tentoumushy",
              "text": "[https://github.com/lingdojo/kana-dojo](https://github.com/lingdojo/kana-dojo)",
              "score": 2,
              "created_utc": "2026-01-21 22:04:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o10b8bw",
                  "author": "Fuzzy_Afternoon_5502",
                  "text": "How exactly are these generated?\n\nDoes github-action allow for AI to actually come up with these ideas? Or are you manually coming up with all the ideas, and just feeding them to a github-action json, which it then spits out ok a timer?\n\nI think its a very good idea to create engagement.",
                  "score": 2,
                  "created_utc": "2026-01-22 07:25:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0tyz0d",
          "author": "RedWolf-RW",
          "text": "What a nice way to self-report. Your reasoning is perfect. Obviously you're cheating, you said it yourself, you're artificially creating useless problems to generate traffic.",
          "score": 19,
          "created_utc": "2026-01-21 10:29:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u19xg",
              "author": "janjko",
              "text": "But he is also making it easy for people to feel good about contributing, and maybe pushing them into the opensource world.\n\nIf every project had brain-dead first issues to solve, I think the world would be better, not worse.",
              "score": 55,
              "created_utc": "2026-01-21 10:49:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0u5uud",
                  "author": "Real-Tailor7489",
                  "text": "Yeah, and he’s generating good first issues.\n\nSounds like they’re ACTUALLY good first issues, unlike many repos where the “good first issues” are a pain in the ass and something only seniors could even understand what to do.\n\nI have zero problem with what OP is doing, imo it’s actually a good idea.",
                  "score": 28,
                  "created_utc": "2026-01-21 11:28:30",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0wwvyc",
                  "author": "kwhali",
                  "text": "One problem lately has been poor quality AI automated contributions for issues labeled as good first issues. But I guess those aren't the brain dead kind 😅",
                  "score": 1,
                  "created_utc": "2026-01-21 19:46:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0udu92",
              "author": "tentoumushy",
              "text": "I shall add that the issues are not \\*as\\* brain-dead as simply asking the contributors to open a file, change the date / change one word in the file and call it a day. I created a massive bank / backlog of programmatically generated color themes in advance, with unique color palettes for each color theme. That's the entire good first issue: append a unique new theme to the list of available themes on the actual web app that end-users would be able to use (a la Monkeytype with their massive collection of different color themes). So even though the issues may seem redundant and monotone (I could easily just add all the themes in one go myself), they're not as brain-dead as changing one word in an .MD file that no one is ever going to see, and the contributions that the newcomers make \\*are in fact visible live to the end-user and the contributors themselves. \n\n  \nWhich is (maybe) a scummy way to generate free stars and forks for my repo, but still...",
              "score": 15,
              "created_utc": "2026-01-21 12:27:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0ui2lm",
                  "author": "miss-daemoniorum",
                  "text": "I WHOLE HEARTEDLY support this. For all of the reasons listed by you and other's but I'm genuinely most impressed by the social aspect. Mind if I treat it like a meme and \"steal\" the concept for my own projects? Most of mine have an embedded educational aspect to them and gamifying this for contributors sounds like a great idea to both promote your project as well as engage with the community.",
                  "score": 9,
                  "created_utc": "2026-01-21 12:55:41",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0x1pco",
                  "author": "kwhali",
                  "text": "I think my first ever contribution was to iTerm2, adding a slider to adjust the opacity of the background colour without it affecting the foreground colour.\n\nI never worked with the language or tooling involved there before, but it was enough to look at the existing UI files to get the scrollbar snippet and duplicate that with different variable name, find the associated objective-c code for the scrollbar and background colour to connect that setting to the value set by the UI.\n\nIt was mostly hunt down the code of existing functionality to copy/paste and modify. I probably had a harder time learning to setup Xcode and compile plus open my first PR and use git 😅 (I think it was the first time I used git rebase when asked during review and having no clue what that was)\n\nI still felt quite proud of that contribution and it was cool adding a feature that I wanted to software I was using. I am just lucky the maintainer / reviewer was kind and responsive, some projects I've since contributed to were unpleasant (_one time I even got banned from an entire github organisation just for trying to improve some docs on security because I somehow triggered a reviewer by explaining why something they were stubborn about as an expert was mistaken and they took that as an insult_).",
                  "score": 3,
                  "created_utc": "2026-01-21 20:08:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0w4i76",
          "author": "wmcscrooge",
          "text": "It's pretty common for universities to ask students to contribute to open source projects to get them familiar with git/github. This seems like a perfect avenue to provide them with that experience. No cheating here!",
          "score": 2,
          "created_utc": "2026-01-21 17:41:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xuy6n",
          "author": "Aspie96",
          "text": "GitHub is a social media and social media become worse when they are infested with bots interacting with bots. What is even the point?\n\nWhy do these issues have to be automatically generated? You are perfectly entitled to open issues on your own repository. You could just decide to open issues instead of fixing small problems yourself.",
          "score": 2,
          "created_utc": "2026-01-21 22:23:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zm4bp",
          "author": "daydrunk_",
          "text": "I wish I had your problem. I have a repo I’ve been working on for several weeks, that is useful for any beginner C programmer I think, and I tagged several issues “good first issue” and I haven’t even had one person comment. I’m talking about update documentation, Verify a potential bug, and a “-l” flag that prints the license. Stuff like that. It’s low priority for me while I’m adding features, but I wish those tags actually got even 1 contributor",
          "score": 2,
          "created_utc": "2026-01-22 04:14:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o100rzo",
          "author": "kmaragon",
          "text": "I highly recommend https://a.co/d/7xVIGyM … After having children, it became so hard to even review pull requests in my one popular open source library. And the guilt felt a lot like the bills piling up when I didn’t have money to pay them. This book gave me a much needed fresh perspective. That same perspective leads me to ask, “cheating on what?” You’re giving yourself more work and to what end? Some innate sense of value and clout, really. Which is completely a fine thing and sure as heck not cheating in any moral sense of the word. \n\nAnd out of 100 contributors, you might pick up one or two that are actual contributors that stick around and add value to your project and your quality of life. If you have the capacity and this is the end result, it’s a fantastic move for you personally as well as for the open source ecosystem at large.",
          "score": 2,
          "created_utc": "2026-01-22 05:58:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v23cy",
          "author": "an0-dyne",
          "text": "Cheating /positive",
          "score": 1,
          "created_utc": "2026-01-21 14:45:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v9rde",
          "author": "Suspicious_Lie6339",
          "text": "I might try this too lol. I consider this\"good cheating\"",
          "score": 1,
          "created_utc": "2026-01-21 15:22:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0w3sf4",
          "author": "Aksh247",
          "text": "I’m a newbie. Love this. How can I start contributing? Would help me get started with open source and also give me some comfort and confidence. Please share a link.",
          "score": 1,
          "created_utc": "2026-01-21 17:38:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11t9p1",
              "author": "tentoumushy",
              "text": "[https://github.com/lingdojo/kana-dojo](https://github.com/lingdojo/kana-dojo) you can browse some of the good first issues here, as mentioned above they're dead simple and take a minute to do",
              "score": 2,
              "created_utc": "2026-01-22 14:18:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0weqaz",
          "author": "robreddity",
          "text": "How many of those 100+ contributors were AI?",
          "score": 1,
          "created_utc": "2026-01-21 18:26:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wputj",
          "author": "BrightCandle",
          "text": "If I run across an issue and I can work out how to fix it I often submit a patch. Why happens next determines if I am going to bother again and you would not believe the number of projects that don't merge fixes for clear bugs or interact with people at all. Making easy bugs to fix and then merging them is the super power that brings developers into your project and so many fail.",
          "score": 1,
          "created_utc": "2026-01-21 19:15:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xaohi",
          "author": "keturn",
          "text": "I guess I've never thought enough about github's popularity algorithms to worry whether anyone is \"cheating\" it or not. I look at star count as one indicator if I've searched up a couple of projects that have the same goal and I'm trying to decide between them... but also, just seeing that there's an *active* maintainer would likely win me over compared to the other project last updated 5 years ago.",
          "score": 1,
          "created_utc": "2026-01-21 20:49:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yag1t",
          "author": "haragoshi",
          "text": "You’re creating community engagement. By contributing people feel like they are part of the project and will advertise your project for you because you worked on it. Pretty good hack",
          "score": 1,
          "created_utc": "2026-01-21 23:43:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yiept",
          "author": "allongur",
          "text": "Why not take this \"cheating\" one step further? Instead of generating issues that where resolving them fixes nothing, you could instead generate issues but also generate a corresponding minor defect in the code, so that resolving the issue actually contributes real value (albeit, value that was deliberately taken away in order to create this contribution opportunity). Obviously, the generated code defects must be marginal, will not affect users to the point of clearing an issue of their own, and should not have downstream or cumulative consequences.",
          "score": 1,
          "created_utc": "2026-01-22 00:26:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16xpfy",
          "author": "International-Cook62",
          "text": "I open issues in my own repos all the time, some times I don't know when I will be able to get to them so I hope that someone will come along...",
          "score": 1,
          "created_utc": "2026-01-23 06:06:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1844cl",
          "author": "Ok-Count-3366",
          "text": "If it's possible, it's legal. 🤣",
          "score": 1,
          "created_utc": "2026-01-23 12:12:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19bcur",
          "author": "Minute_Toe_8705",
          "text": "I wonder, if these issues are so simple, why not resolve them yourself in an afternoon? \n\nIs this question to naive or do I miss sth. important?",
          "score": 1,
          "created_utc": "2026-01-23 16:02:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1dtvli",
          "author": "EmotionallyPoor",
          "text": "i actually found this on [goodfirstissues.com](http://goodfirstissues.com) and decides to search whats up with it, finding your reddit post lol  \ni think its a good idea to help ppl how to use github, coming from someone who learnt how to make a PR last week",
          "score": 1,
          "created_utc": "2026-01-24 06:25:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gw2au",
          "author": "KevinMaschke",
          "text": "I think it's a great move.\n\nAlso love the project! Tested it, forked it, starred it.\nAlso opened a bug report 😁",
          "score": 1,
          "created_utc": "2026-01-24 18:21:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhfmsp",
      "title": "Anyone use Codeberg?",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qhfmsp/anyone_use_codeberg/",
      "author": "Ol010101O1Ol",
      "created_utc": "2026-01-19 20:25:38",
      "score": 146,
      "num_comments": 46,
      "upvote_ratio": 0.97,
      "text": "I have been using Codeberg for a really long time for some of my projects and I’ve seen some projects on there gain traction, but not as much as GitHub or GitLab. \n\nI’m wondering if anybody knows anybody that actually uses it?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1qhfmsp/anyone_use_codeberg/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o0jkwze",
          "author": "Fine-Ice-4435",
          "text": "I've literally just moved all my repos over to Codeberg. I'm tired of all the extra noise that comes with GitHub and MS. \n\n\nIf anyone wants to share some interesting projects on Codeberg that would be great! ",
          "score": 73,
          "created_utc": "2026-01-19 20:43:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pbwyf",
              "author": "noob-nine",
              "text": "doea codeberg support something like github actions?",
              "score": 4,
              "created_utc": "2026-01-20 17:44:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0pvy92",
                  "author": "VulcansAreSpaceElves",
                  "text": "yes",
                  "score": 5,
                  "created_utc": "2026-01-20 19:14:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0lvjxr",
              "author": "Limp_Profession_154",
              "text": "Dumb question alert!\n\nWhy not gitlab?",
              "score": 6,
              "created_utc": "2026-01-20 03:59:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0lzz15",
                  "author": "Fun_Conclusion_6769",
                  "text": "I self host my own git lab but also just started using codeberg for public repos. My main thing about using codeberg was the federated system behind it, something i like and wish to support.",
                  "score": 19,
                  "created_utc": "2026-01-20 04:26:10",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0mjlwr",
                  "author": "Fine-Ice-4435",
                  "text": "Not a dumb question at all.\n\n\nI honestly don't have any exposure to GitLab, but Codeberg is located in Europe and a not for profit.\n\n\nSo a few things drew me to it over Gitlab. \n\n\nI also self host Gitea. I generally like the simplicity of both, I don't need a lot for what I do. ",
                  "score": 13,
                  "created_utc": "2026-01-20 06:50:32",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0tuqw1",
                  "author": "lilsadlesshappy",
                  "text": "I can only speak for myself but when I tried to create a Gtlab account, a verified email address was not enough. It also wanted a verified phone number. And a verified credit card.\n\nAnd even if I had a credit card, I would have never given that information away just to create a free account.",
                  "score": 2,
                  "created_utc": "2026-01-21 09:49:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0jzli4",
          "author": "Impossible-Friend-61",
          "text": "Moved a couple of weeks ago, I did set up my own runners etc. Two reasons. 1) real core bugs in github never gets fixed, instead it is social and ai bla bla 2) Leaving US-services as much as I can, one at time, as a \"tweet-of-the-day\" decides their reliability. Means reddit to lemmy to later on etc.",
          "score": 31,
          "created_utc": "2026-01-19 21:54:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jyyev",
          "author": "emacsen",
          "text": "We use Forgejo at my company.\n\nThere are some rough edges still, specially around project management tooling, project, and labels. Otherwise it's been good.",
          "score": 13,
          "created_utc": "2026-01-19 21:51:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0k0sv1",
          "author": "cheap-bees",
          "text": "I’m all in on it. Love it. ",
          "score": 12,
          "created_utc": "2026-01-19 22:00:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0k6unm",
          "author": "BetterAd7552",
          "text": "Moved over last year. The web is not as polished as GitHub, but it does the job. I’m happy to be out from under MS.",
          "score": 9,
          "created_utc": "2026-01-19 22:30:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lxzf6",
          "author": "ch4og",
          "text": "Mostly people who care that github is getting ruled and censored by Microsoft. \n\nFor example see Zig statement: https://ziglang.org/news/migrating-from-github-to-codeberg/\n\nAlso speaking of known projects, GNU Guix uses Codeberg as a main git server: https://guix.gnu.org/blog/2025/migrating-to-codeberg/\n\nI myself use codeberg daily and honestly speaking there are not much downsides compared to github",
          "score": 7,
          "created_utc": "2026-01-20 04:14:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kp3l6",
          "author": "Picorims",
          "text": "Hesitating still. For now I might mirror my most prominent repos over to Codeberg. I'd like to backup issues too.\n\nBut yeah I get some traction from GitHub, and from a professional pov many job board only allow GitHub profile links.\n\nI also need to check where it is hosted.",
          "score": 5,
          "created_utc": "2026-01-20 00:06:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0lcmpv",
              "author": "Ol010101O1Ol",
              "text": "Do you use AI agents at all?\n\nI have an MCP I created for Codeberg that works well enough to make this process automated and super easy. It’s what I did when I migrated.\n\nI still have professional stuff on GitHub and GitLab too. Most businesses are ok with Codeberg stuff as well if you share your profile. They are just validating your projects generally.",
              "score": 5,
              "created_utc": "2026-01-20 02:14:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0n2pty",
                  "author": "Picorims",
                  "text": "Only copilot as a reviewer, otherwise I do not trust them enough and prefer auto completion or asking questions. I wouldn't trust it for a migration. \n\nAnd yeah I think so too, it is rather that some websites have a hard-coded list of social links and only allow for a GitHub link specifically.",
                  "score": 3,
                  "created_utc": "2026-01-20 09:45:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0klnbg",
          "author": "isfluid",
          "text": "Started using this month. For now private, but some might go public one day.",
          "score": 4,
          "created_utc": "2026-01-19 23:47:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n3rua",
          "author": "j_platte",
          "text": "Yup, have moved a couple actively-used + -maintained Rust libraries from my personal GitHub over. Plan to do more, and it's also being considered for some projects I'm involved in :)\n\nIt seems like the best GitHub alternative out there right now that's actually sustainable - GitLab is venture funded and all-in on bullshit generators, sourcehut still only does email for collaboration which I really don't want to bother with and I'm pretty sure many ppl share that sentiment.",
          "score": 5,
          "created_utc": "2026-01-20 09:55:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n4kl6",
          "author": "PresentationItchy127",
          "text": "I wanted to move away from Github for a long time, then noticed some Rust libraries moving to Codeberg, so I just followed their example. I don't care that the community is small, Microsoft is plain evil at this point.",
          "score": 3,
          "created_utc": "2026-01-20 10:02:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nb6rr",
          "author": "FreeThem2019",
          "text": "Librewolf's source code is on Codeberg",
          "score": 3,
          "created_utc": "2026-01-20 11:02:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kfjrt",
          "author": "cgoldberg",
          "text": "I have an account there and I like the service, but unfortunately GitHub has too much critical mass of contributors to justify moving my projects there.",
          "score": 9,
          "created_utc": "2026-01-19 23:14:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0qy08u",
              "author": "[deleted]",
              "text": "[deleted]",
              "score": 1,
              "created_utc": "2026-01-20 22:11:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0qyzd3",
                  "author": "cgoldberg",
                  "text": "It's nice having the majority of developers and contributors on one platform, but the ecosystem would probably be better off with a serious competitor to GitHub... so I always hope alternate platforms continue to grow.",
                  "score": 1,
                  "created_utc": "2026-01-20 22:15:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0laws2",
              "author": "Ol010101O1Ol",
              "text": "It’s easy to work between all of them via git. You can push commits in both places on VSCode or any other code editor. It’s not even an extra effort, I could write you a bash script right now that could do it automatically for you and it would only be a single file.",
              "score": 1,
              "created_utc": "2026-01-20 02:04:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0lb9dz",
                  "author": "cgoldberg",
                  "text": "I don't have a problem mirroring repos to another host. I just have no need to when all of my users and contributors are on GitHub. I don't want to accept Pull Requests or manage issues in 2 places, so I'm not moving off GitHub until it's no longer where the majority of open source development happens.",
                  "score": 2,
                  "created_utc": "2026-01-20 02:06:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0laxmk",
              "author": "Ol010101O1Ol",
              "text": "It’s easy to work between all of them via git. You can push commits in both places on VSCode or any other code editor. It’s not even an extra effort, I could write you a bash script right now that could do it automatically for you and it would only be a single file.",
              "score": 0,
              "created_utc": "2026-01-20 02:05:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0jrdck",
          "author": "Silly-Freak",
          "text": "I'm in the process. I only have small stuff, but still. There are some friction points - Pages is maintenance mode, Actions is not as mature, and in general I'll need to migrate my actions. Lastly, I use a service that so far only integrated github and gitlab, not arbitrary git hosts, so maybe I'll end up keeping some private mirrors for a bit. But I'm committed to gradually migrate my stuff.",
          "score": 2,
          "created_utc": "2026-01-19 21:13:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0jvc1h",
              "author": "Ol010101O1Ol",
              "text": "Look up Forgejo actions. Codeberg is a fork of Forgejo. That’s how I got mine to work. I use OpenTofu with it for DevOps stuff.",
              "score": 5,
              "created_utc": "2026-01-19 21:33:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0k7r6q",
                  "author": "Silly-Freak",
                  "text": "I know, but they say themselves that their hosted Forgejo Actions is provided [\"in a limited fashion in open alpha\"](https://docs.codeberg.org/ci/#using-forgejo-actions). I think it's fair to just point out that it's less mature. Also, I simply need to figure out if any of the workflows I have use actions that don't have a one to one translation with Forgejo actions, and generally I just like to really understand what I'm doing, and not just try whether it works and hope that there are no differences that will only manifest later. I'm not saying it's _hard_ to migrate, it just takes effort.\n\nIf you don't mind, I'd love if you could share your account name if you think your CI workflows could be good examples to learn from!",
                  "score": 2,
                  "created_utc": "2026-01-19 22:34:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0mlgri",
              "author": "sh7dm",
              "text": "Grebedoc is the pages service compatible with Codeberg",
              "score": 3,
              "created_utc": "2026-01-20 07:06:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0tkz52",
                  "author": "Silly-Freak",
                  "text": "That's a great tip, thanks! Just switched to it :)",
                  "score": 2,
                  "created_utc": "2026-01-21 08:15:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0kmrvm",
          "author": "guitcastro",
          "text": "I am using gitlab. What I am missing? ",
          "score": 2,
          "created_utc": "2026-01-19 23:53:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0lbrhx",
              "author": "Ol010101O1Ol",
              "text": "Codeberg is a small team of open source devs that are providing a completely free service to the dev community. They forked Forgejo which is a fork of another project and created their own. It’s a community project that is really good for devs that need free repos and CI/CD features for their projects.\n\nI have no stake, I’m just a fan.\n\nHere’s the evolution (Git > Gogs > Gitea > Forgejo > Codeberg)",
              "score": 5,
              "created_utc": "2026-01-20 02:09:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0xb2ah",
                  "author": "kwhali",
                  "text": "My understanding from the forejo faq is they forked from gitea once it was sold off and became an open core SaaS product, forejo became a fork with the goal to remain non-profit that is developed for the interests of community needs not prioritising monetization of a SaaS business interests.\n\nThey also state that codeberg is involved with forejo development rather than forking it?\n\nGood to know the history though, I thought codeberg was using gitea when I briefly used it 😅 (_it wasn't the most positive experience as I had experienced many papercuts with the UX, for example I found it odd that it's review process lacked the ability to provide code suggestions, super useful on github_)",
                  "score": 1,
                  "created_utc": "2026-01-21 20:51:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0x96br",
          "author": "wiki_me",
          "text": "You can look at the list of [projects with most stars](https://codeberg.org/explore/repos?page=1&sort=moststars&q=&topic=false&language=&only_show_relevant=true&mirror=false). it has familiar names in it.\n\nPlus there is a [steadily increasing](https://liberapay.com/codeberg/) number of donors which is not easy to achieve for a open source project.",
          "score": 2,
          "created_utc": "2026-01-21 20:42:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lnkx9",
          "author": "BoltlessEngineer",
          "text": "I'm using tangled. I personally think tangled has biggest potential to be next GH because of its nature.",
          "score": 1,
          "created_utc": "2026-01-20 03:14:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lvefv",
          "author": "thinking_byte",
          "text": "I’ve used it for a couple of side projects and mirrors. It feels more values driven than growth driven, which I think explains the traction gap. Most people I know still default to GitHub out of habit and network effects, not because it’s better. Codeberg seems to work fine, it just does not have the same gravity for contributors unless they already care about the mission.",
          "score": 1,
          "created_utc": "2026-01-20 03:59:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mxp6i",
          "author": "gbrennon",
          "text": "Im using github since something around 2011, bitbucket and gitlab but when github changed to have company profiles for free i did come back to github BUT since m$ did acquired the company i was kinda of concerned bcs they where messing with things and still are...\n\nFor example: the android github all doesnt support discussions, prs and things like this and i used to like navigate in github using my phone 😢\n\nThe sad thing is that codeberg still doesnt have an app too 😭\n\n\nIm thinking about impl some services that i can use it as the main branch and it feed both but keeps 1 as the source of truth",
          "score": 1,
          "created_utc": "2026-01-20 08:57:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o1eil",
          "author": "Afraid-Donke420",
          "text": "[ah yes](https://www.reddit.com/r/ProgrammerHumor/s/xPJpjGyjET)",
          "score": 1,
          "created_utc": "2026-01-20 14:00:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0oj44u",
          "author": "Who2Lu",
          "text": "I switched multiple times between GitHub and codeberg. I thought GitHub would be more known but I wanted to use codeberg because of multiple reasons. In the end I decided to use codeberg but mirror everything to GitHub and gitlab so users can choose which of those three platforms they want to use.",
          "score": 1,
          "created_utc": "2026-01-20 15:30:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p762u",
          "author": "Kat_404",
          "text": "I'm so much familiarized with GitHub that I don't know how to migrate to another git platform like Codeberg.\n\n\nI usually create repositories in GitHub and I get automatic git config with VSCode (or forks).\n\n\nI want to migrate to Codeberg but I'm a very git noob, the only approach that I had with Codeberg is the migration option from GitHub but I don't know how migrate the pushes, maybe I have to research or watch a good tutorial about GitHub → Codeberg. 😅",
          "score": 1,
          "created_utc": "2026-01-20 17:22:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0rkp4u",
          "author": "TistelTech",
          "text": "I moved my public repos there just to reduce github scraping everything into copilot training data without compensation or credit. Seems to work fine.",
          "score": 1,
          "created_utc": "2026-01-21 00:10:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tnnnd",
          "author": "Holiday-Buyer4418",
          "text": "My research lab moved to Codeberg because we were looking for a free alternative to GitHub (The \"free\" version of GitLab has a limit on the maximum number of collaborators, and we don't want self-hosting). I have been using Codeberg for a while now. Overall, it is fine. It is not as responsive as GitHub or GitLab, but it seems to do the job, despite being completely free and backed by a smaller organization.",
          "score": 1,
          "created_utc": "2026-01-21 08:41:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgfyyp",
      "title": "Why do many FOSS apps struggle with visibility despite being technically superior?",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qgfyyp/why_do_many_foss_apps_struggle_with_visibility/",
      "author": "Lone_Wolf5002",
      "created_utc": "2026-01-18 18:18:51",
      "score": 77,
      "num_comments": 38,
      "upvote_ratio": 0.87,
      "text": "If you clicked on the post seeing the title, then we both are on same page. Enshittification has now turned into a never ending cycle. First offer free or subsidized features to acquire users, then shift focus to overflooding ads and paywalls to generate more profit at the cost of app quality. Honestly, to witness how the popular apps are succumbing to this, and every new one following the same path is really depressing. As it lower the numbers of alternatives for users.\n\nSo now, the obvious solution is to use FOSS apps. And honestly, most of them are really good, as they maintain a reasonable limit of monetization and don't degrade their user experience over time. But, the problem is that, these apps mostly remain niche based. On the other hand many companies who create their own apps based on the same open source code, get all the mainstream attention and generate millions of revenue. This usually isn’t due to technical superiority, but rather access to resources, distribution, and ecosystem advantages that smaller FOSS apps lack.\n\nFor example, many of us may have heard of iText, an open-source PDF library that is widely used across many company's projects, including internally in Google Analytics, Docs, and Calendar. At first, when it was under the MPL/LGPL model adoption was widespread. But when they needed funding to grow, they to shifted to AGPL model (which required companies to use their library, either by sharing their own source code or purchasing a commercial license). In response, every company including Google, either stuck with the old free version or shifted to alternate libraries, even if needed to trade off quality and usability. Even after all this iText was able to survive, due to the mainstream attention they got after winning Belgian Edition of Deloitte's Fast 50 and later, were able to turn profitable. But this is just one case, hundreds of small FOSS apps never reach this level, even when they are technically strong. They may be quietly depended upon, forked around, or replaced, with little recognition or support reaching the original maintainers.\n\nSo, what practical ways exist to help FOSS apps become more mainstream and sustainable without compromising their core principles? And what can users, companies, or communities realistically do to support them?\n\nCurious how others here think about this.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1qgfyyp/why_do_many_foss_apps_struggle_with_visibility/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o0c07o1",
          "author": "DownWithMatt",
          "text": "Ease of use is a barrier a lot of times. But also, obviously, not having a budget for a team of people exclusively dedicated to awareness and adoption of your software is probably a major reason.",
          "score": 71,
          "created_utc": "2026-01-18 18:29:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ixv8t",
              "author": "Lone_Wolf5002",
              "text": "Agreed. If discovery is already hard, any UX friction just amplifies the drop-off.",
              "score": 0,
              "created_utc": "2026-01-19 18:56:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0byyba",
          "author": "billsil",
          "text": "Marketing or lack thereof.\n\n I don’t promote my project. It’s not the fun part\n\nWhat you can do is tell people about it. I once was introduced to a professor who was telling my old boss about some great program he found. Want to meet the person who wrote it?",
          "score": 47,
          "created_utc": "2026-01-18 18:23:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0hnb05",
              "author": "ICanHazTehCookie",
              "text": "I agree marketing is little fun. But people using your project is fun haha.\n\nOne of my projects makes the front page of /r/reactjs and gains ~400 stars every time I post it. Then organic stars slowly drop to zero. Some things just need to be shared I guess.\n\nFortunately sharing with the community is more fun than marketing :D But I still get bored of writing posts and getting in that headspace.",
              "score": 3,
              "created_utc": "2026-01-19 15:28:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0ityeb",
                  "author": "billsil",
                  "text": "That’s a lot of stars! Yeah my market is a lot less. I’ve done a few posts that were thankfully paid for by my old company, not that I didn’t put in too many hours for, but other than GitHub, I don’t really have a place to put it. It’s also nice to bounce ideas off coworkers.\n\nI feel like doing a release for the first time in a year would be better. Too busy these days.",
                  "score": 3,
                  "created_utc": "2026-01-19 18:39:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0c44ih",
          "author": "HelmOfWill_2023",
          "text": "To me it is due to two main factors:\n- Marketing: most FOSS projects doesn’t have budget at all. So spread the word with ads and promotion is off the table. The vast majority of users will just use whatever they find first and work well enough for them. They don’t really care who is behind or the licensing of the project. \n\n- Usability (UX and UI): I like to keep searching for alternatives to softwares that I use the most, but is pretty common find sometimes alternatives that come really close to the same goal of a paid program but lacks a good UI or UX. One thing that I noticed through all these years is that users tend to prefer aesthetics over real purpose. If a software or service has a nicer presentation than other, even if it lacks some features, the users tend to select the first one. \n\nAnd all of that said, this is one proof of how the whole capitalist myth of “the best product will win”  falls apart.",
          "score": 22,
          "created_utc": "2026-01-18 18:47:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0dulwg",
              "author": "TopdeckIsSkill",
              "text": ">this is one proof of how the whole capitalist myth of “the best product will win” falls apart.\n\nbecause for most people UI>functionality.\n\nUnless you're a super expert, having to look at a nice UI that does all you need to do is better than having to look at an ugly UI that does things you won't need",
              "score": 19,
              "created_utc": "2026-01-18 23:58:18",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0e44dn",
              "author": "Various-Activity4786",
              "text": "Best has a lot of meanings. Technical correctness is only one and it’s often the least important. Something that OSS projects often miss.\n\nSure maybe your audio filter or color gamut is 4% better. Maybe your compression algorithm squeezes 1.7% more out. No one cares. Probably very very few people are even capable of noticing.\n\nIf your application takes a an hour more to learn, that costs businesses an hour of salary per user. That can RAPIDLY erase any cost savings. Having to have 2000 people making an average of $50/hr spend an hour taking a training session to use something is expensive. Very expensive. \n\nMS office is a good example. You have to try to find employees that haven’t used office. Thousands of training courses exist, resources on websites exist, etc. The public education system essentially trains workers in office. Switching to libre office means getting everyone to speed, training, tons of impedance as workflows work different.\n\nDon’t forget that Microsoft Office won, in no small part, because they spent thousands of hours making word and excel extremely easy to teach WordPerfect and lotus 1-2-3 users. Same keyboard shortcuts, usability studies, etc. \n\nThe best product is the one that gets the most utility for the least cost. Pedantic technical correctness rarely meets that burden. Where it does, like OS kernels used to host massive websites, OSS has done exceptionally well. Where it doesn’t you get thousands of (vanishingly) incrementally better applications that no one uses because those improvements don’t matter and the cost of using them is considerably higher",
              "score": 6,
              "created_utc": "2026-01-19 00:48:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0frbzk",
                  "author": "SessionIndependent17",
                  "text": "I laugh a bit at OP's original premise without challenging it overall, because many of us have directly experienced the canonical counterexample in Git.  It is miserable to use compared to alternatives, especially in a setting where the motivations for its design don't apply - like if you have a well connected corporate network (even one spanning the globe) and some reasonable hardware and IT back end IT staff already looking after other stuff - and yet it has taken over.\n\nIn any given year of being forced to use Git I will have wasted in salary a few multiples of the licensing cost for Perforce in fighting with Git (not just the maintenance fee, but even a new seat license, which I'm guessing is ~$1500, now).",
                  "score": 5,
                  "created_utc": "2026-01-19 07:04:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0iw3wo",
              "author": "Lone_Wolf5002",
              "text": "Well you are absolutely right. UI is really a big issue in the FOSS apps, which make them less appealing for common masses. But the real challenge is figuring out how to improve this aspect without sacrificing it's core values.",
              "score": 1,
              "created_utc": "2026-01-19 18:49:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0cb8wh",
          "author": "leeharrison1984",
          "text": "A big reason I have seen is FOSS often lacks formal support/help desk infrastructure. Companies will pick an inferior paid product that has formal backing because there is someone to yell at when it doesn't do what they want. Similarly, those products can also have formal compliance documentation and certifications.\n\nWith FOSS, you're shouting at clouds and the clouds tell you to open a PR 😆",
          "score": 16,
          "created_utc": "2026-01-18 19:20:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0drxhp",
          "author": "stuffitystuff",
          "text": "Have you ever tried to use Gimp before? Do people want to put Gimp on their resume? Lots of tongue-in-cheek (or other dirtier places) with FOSS names and the like but not a lot of thought given to commercial viability because it's sort of outside of their remit.",
          "score": 7,
          "created_utc": "2026-01-18 23:44:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0c335y",
          "author": "Adventurous-Date9971",
          "text": "The only way FOSS wins is when we treat it like real infrastructure, not a free hobby addon. My main point: visibility follows reliability, story, and distribution, not just code quality.\n\nConcretely, projects that break out usually nail a few things:\n\n1) Opinionated positioning: “We replace X in Y scenario” instead of “generic library/tool.” Clear docs, one killer example, and a copy‑paste quickstart.\n\n2) Distribution: packaged for every ecosystem (apt/homebrew/Docker/operator), sane defaults, zero-config demo instance, and a hosted option for people who just want it to work.\n\n3) Social proof: logos, case studies, and a changelog that looks alive. Users can help here by writing blog posts, adding it to awesome-lists, and filing “marketing issues” (website clarity, examples) instead of only bug reports.\n\nCompanies can sponsor specific outcomes: SLAs, features, or integration support. GitHub Sponsors, OpenCollective, Tidelift, and even products like Orbit or Pulse for tracking community impact all help, but only if maintainers treat their project like a product.\n\nSo the core point: FOSS needs product thinking and distribution, not just better code.",
          "score": 13,
          "created_utc": "2026-01-18 18:42:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0e4s9z",
              "author": "Various-Activity4786",
              "text": "I do wish the packaging problem was easier. I’ve been messing with dotfile managers lately, and looking at the docs of a couple of them, the “install with package manager” pages are VERY long. \n\nAnd there is always the classic “you need to use pip, npm, apt, and snap to get all the dependencies you need!” Problem. \n\nIt makes old school windows msi’s seem reasonable sometimes.",
              "score": 4,
              "created_utc": "2026-01-19 00:52:21",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0p7tay",
              "author": "ShaneCurcuru",
              "text": "This, and what [*leeharrison1984*](https://www.reddit.com/user/leeharrison1984/) said elsethread.  Plus: **MARKETING**.\n\nMarketing isn't going to sway most readers here; *we* know what's technically superior.  But businesses of all sizes end up making decisions on what tools to buy/license based on what they see in the market - and what they see as the long-term maintenance cost/risk of some solution.  That feeds more eyes and usage and feedback and often licensing money into the commerical-ized tools, which means even us techies at some $BigCo are more likely to see those tools, rather than the random FOSS one that's better.\n\nOnce you think about \"popularity\" at any larger scale or methodology, it comes down to: which solution will most businesses want to consume?  Where that \"solution\" is something they've heard about, that's easy to install/test/configure, that they can buy support contracts for, etc.  And that is a solution - not just a product they have to figure out, but a button they can push to **solve their problem**.\n\nThe CRA/PLD legislation in Europe is also going to start affecting this question, especially in terms of packaging and distribution, both technically and organizationally/socially.  Any individual or organization that might *possibly* do business in Europe is going to care a lot more about consuming a vetted package from a known supplier, rather than the most amazing tool ever they find as a release on github.",
              "score": 2,
              "created_utc": "2026-01-20 17:25:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0hanha",
              "author": "Lone_Wolf5002",
              "text": "What’s tricky is that many maintainers never intended to build a product. It starts just as a tool for themselves, but  when it become essential infrastructure for many others, the maintainers can't provide necessary support to keep them running smoothly. As they never prepared for this.\n\nSo, at a situation like this, how do you think developers can maintain a line between “healthy product thinking” and pushing FOSS into the same growth traps that lead to enshittification? As this is where most of them fail.",
              "score": 1,
              "created_utc": "2026-01-19 14:25:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0dqpb9",
          "author": "mailmehiermaar",
          "text": "Blender has focused on developing the product together with artists in a production environment. \n\nMany FOSS apps are centered around the developers. This is logical and understandable but not always a basis for success.\n\nFinding ways to incorporate users, make them part of the team, is hard.",
          "score": 5,
          "created_utc": "2026-01-18 23:37:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ixafw",
              "author": "Lone_Wolf5002",
              "text": "I too have noticed this. I think that gap between users and developers is one of the hardest problems for FOSS to solve structurally, especially when maintainers are stretched thin.",
              "score": 2,
              "created_utc": "2026-01-19 18:54:20",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o0gr2t1",
              "author": "twicerighthand",
              "text": "Also, oftentimes if an artist who actually uses the FOSS and is not a programmer, suggests improvements, they're told one of 3 things:\n\n1. If you you don't like it, fork it and make your own\n2. If you you don't like it, make a PR\n3. If you you don't like it, it's your fault, it works for us.\n\nSee: Blender and Undo function - [https://blenderartists.org/t/undelete-function/320288/2](https://blenderartists.org/t/undelete-function/320288/2)",
              "score": 3,
              "created_utc": "2026-01-19 12:24:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0h97sy",
                  "author": "mailmehiermaar",
                  "text": "The thread you link to on the blender artists forum is 20 years old! \n\n\nAfter that blender started making the open movies and working while making movies with the developers and artists together. This is key to the success of the project",
                  "score": 3,
                  "created_utc": "2026-01-19 14:17:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0c6y42",
          "author": "capsteve",
          "text": "Linux is foss, and except for a few exceptions it has replaced all commercial versions of Unix.\n\n“Show me how to make money with Linux and I’ll port my application to it”, a quote from a software publisher in the mid 90’s. Eventually the application was migrated to Linux and the Solaris, IRIX, and other proprietary Unix versions were discontinued.\n\nWhy? In this case it was likely licensing cost to develop for a specific platform and the high cost of entry for the platform (HW) itself.\n\nFor current FOSS, I suspect that many projects start as a side project, and overtime becomes a burden.\n\nDevelopment time, marketing, documentation, bug fixes, it can become taxing if you don’t have the expertise to handle all those aspects and still put dinner on the table. Especially for single developers or small teams.",
          "score": 3,
          "created_utc": "2026-01-18 19:00:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0iy8xw",
              "author": "Lone_Wolf5002",
              "text": "Linux is a fascinating case because it shows FOSS winning when it aligns with economic incentives rather than fighting them. It’s a reminder that sustainability often matters more than ideology.",
              "score": 1,
              "created_utc": "2026-01-19 18:58:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0c2yo4",
          "author": "Historical-Tea-3438",
          "text": "Bundling. Most recent and egregious example is MS Teams. ",
          "score": 3,
          "created_utc": "2026-01-18 18:41:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0d1ytx",
          "author": "bornxlo",
          "text": "Foss visibility is fine if you're in an open source system with a software manager, but as free software there is no incentive to advertise.\nIn an open system(I'm most familiar with Linux) there are package managers and software managers from the distributors which may have rankings or recommendations. Other systems such as Windows are not built on foss software and don't have incentives to show or advertise them.",
          "score": 3,
          "created_utc": "2026-01-18 21:37:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fjqgu",
          "author": "Steerider",
          "text": "Generally speaking, FOSS marketing is nothing more than word-of-mouth. Beyond rare exceptions like Firefox web browser,  you either heard of it from somebody or youve never hard of it.\n\n\nAlso, and perhaps moreso, if it's only on F-Droid and not the Google Play Store, 99% of your potential audience will never have a chance of seeing it. Just installing that second \"store\" is itself something only a small niche audience ever does.",
          "score": 3,
          "created_utc": "2026-01-19 06:02:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g5xof",
          "author": "Mithrandir2k16",
          "text": "Because Microsoft, Apple and Google sold people that they can live in a digitized world without caring/knowing about computers. If it isn't one-click install, auto-cloud backup, account-restore to new device, etc. the friction is too high for most people to manage.",
          "score": 3,
          "created_utc": "2026-01-19 09:18:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0i2la2",
              "author": "Batetrick_Patman",
              "text": "Most people want a computer that just works. Some people like to tinker and play with them. But to most a computer is a tool for work or entertainment.",
              "score": 2,
              "created_utc": "2026-01-19 16:37:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ge1n2",
          "author": "Atulin",
          "text": "Few reasons:\n\n* The websites look either like a 1994 Geocities page, or as a step above a plaintext file\n* The software itself looks like utter shit made in the 80s for an Amiga\n* The software is unusable for a regular person\n\nA potential user is looking for something. They get to the website, they get a warning that it's HTTP-only. Let's assume they click through that. They see a website that barely looks like one, with a download link being just plain text halfway down, below an excerpt from a research paper. Let's assume they found it and clicked it. They install the software, and what welcomes them looks like it would be made for TempleOS except, somehow, worse. Let's assume they don't uninstall immediately and try to use it. They need to configure something, but the config is stored in a `cfg.yyh` file that uses esoteric syntax that was all the rage in the 70s. Let's assume they somehow find out how to edit it. Time to use the software, and what they need to do is buried under 4 layers of dropdowns and requires them to manually input HLSL code.\n\nI'm exaggerating, but that is exactly how most OSS software looks to a regular, non-technical person.",
          "score": 3,
          "created_utc": "2026-01-19 10:34:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gd1mk",
          "author": "Ash_Skiller",
          "text": "You're hitting on something that's becoming a huge issue for FOSS devs. The visibility problem is getting worse because discovery itself is changing. People used to google \"\"best PDF library\"\" and maybe stumble on iText or other FOSS options in blog posts and Stack Overflow threads, but now they're just asking ChatGPT or Perplexed and getting whatever those AI tools spit out.\n\nI've heard people in the enterprise space talking about this gap a lot lately. From what I've read, some teams are starting to use tools like Brandlight (https://brandlight.ai) to track how their projects show up in AI-generated answers, since that's where alot of discovery is moving. It supposedly helps you see when you're being mentioned (or ignored) in those responses and what you can do about it.\n\nThe challenge is that FOSS maintainers are already stretched thin, so adding \"\"optimize for AI visibility\"\" to the list feels like yet another burden. But the reality is if your project doesn't appear when someone asks an AI assistant for recommendations, you're essentially invisible to a growing chunk of potential users and contributors.",
          "score": 2,
          "created_utc": "2026-01-19 10:25:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0myd48",
          "author": "E_coli42",
          "text": "Lack of budget for marketing. I wish more FOSS apps cost money honestly. Then they could hire proper UX devs or marketers. ",
          "score": 2,
          "created_utc": "2026-01-20 09:03:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0noeyu",
          "author": "conectionist",
          "text": "Marketing",
          "score": 2,
          "created_utc": "2026-01-20 12:43:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0d27pw",
          "author": "Crypt0Nihilist",
          "text": "Marketing costs money. Software following more commercial model can have a stand at every trade fair and buy executives football tickets etc in a way that most projects can't.",
          "score": 2,
          "created_utc": "2026-01-18 21:39:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0by0ci",
          "author": "Lone_Wolf5002",
          "text": "[(Source for iText Example)](https://opensource.stackexchange.com/a/11779)",
          "score": 1,
          "created_utc": "2026-01-18 18:19:34",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o189prz",
          "author": "odimdavid",
          "text": "Related to marketing is resilience. When a team has waited for months and adoption is slow, financial constraints might make them stop versioning the app and move on to other concerns. It doesn't necessarily mean the project failed.",
          "score": 1,
          "created_utc": "2026-01-23 12:49:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj9bnt",
      "title": "I made a documentary about Open Source in Ukraine and around the world",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qj9bnt/i_made_a_documentary_about_open_source_in_ukraine/",
      "author": "whit537",
      "created_utc": "2026-01-21 20:31:20",
      "score": 72,
      "num_comments": 21,
      "upvote_ratio": 0.92,
      "text": "Hey all, I wanted to share with you a documentary I just published yesterday called \"Gift Community: A Story About Open Source.\" I visited the Open Source community in Los Angeles, Denmark, India ... and, yes, Ukraine. I met legendary developers like Mitchell Hashimoto (HashiCorp, Terraform, Vault, etc., now Ghostty), Poul-Henning Kamp (FreeBSD, Varnish/Vinyl), and Kailash Nadh (Zerodha). Along the way, I slept in an air-raid shelter, flew in Mitchell's private jet, and ventured out into Bangalore traffic. In the doc I tried to weave it all together into a story about \"the deeper meaning of Open Source.\" Let me know how I did. :-)\n\n[https://www.youtube.com/watch?v=tOn-L3tGKw0](https://www.youtube.com/watch?v=tOn-L3tGKw0)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1qj9bnt/i_made_a_documentary_about_open_source_in_ukraine/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o0x6n9z",
          "author": "AutoModerator",
          "text": "Posts relating to the [Russo-Ukrainian War](https://en.wikipedia.org/wiki/Russo-Ukrainian_War) have not resulted in on-topic or constructive discussion. We will be using additional scrutiny enforcing on-topic discussion in these comments.\n\nPlease ensure that comments and replies relate directly to the open source community and people's participation in it.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/opensource) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-21 20:31:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xq8ij",
          "author": "Yangman3x",
          "text": "Making a documentary about open source without providing a peertube link is almost criminal /s\n\nThank you for this documentary",
          "score": 10,
          "created_utc": "2026-01-21 22:00:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0xqphc",
              "author": "whit537",
              "text": "Haha, challenge accepted ...",
              "score": 3,
              "created_utc": "2026-01-21 22:02:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0xrdq8",
                  "author": "whit537",
                  "text": "Got any recommendations for [a server](https://joinpeertube.org/instances?profile=video-maker)?",
                  "score": 3,
                  "created_utc": "2026-01-21 22:06:02",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o0z0h29",
                  "author": "Imaginary-Nail-9893",
                  "text": "I love you",
                  "score": 1,
                  "created_utc": "2026-01-22 02:07:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o13pd8x",
          "author": "nirberko",
          "text": "Really like documentaries about open source project. Super cool!",
          "score": 2,
          "created_utc": "2026-01-22 19:30:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o13qudg",
              "author": "whit537",
              "text": "Thanks! Enjoy! :)",
              "score": 1,
              "created_utc": "2026-01-22 19:36:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0zuaxk",
          "author": "Desdic",
          "text": "\\`\\`\\`  \nVideo unavailable\n\nThis video is restricted. Please check the Google Workspace administrator and/or the network administrator restrictions.  \n\\`\\`\\`  \nin my region :(",
          "score": 1,
          "created_utc": "2026-01-22 05:09:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11g3fc",
              "author": "whit537",
              "text": "Oof. What's your region, if I may?\n\nAlso on X and FB if it helps:\n\n[https://x.com/chadwhitacre/status/2013651135320461525](https://x.com/chadwhitacre/status/2013651135320461525)\n\n[https://www.facebook.com/reel/1417105893131590](https://www.facebook.com/reel/1417105893131590)\n\nMight need that Peertube link after all haha.",
              "score": 3,
              "created_utc": "2026-01-22 13:06:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o122udl",
                  "author": "Desdic",
                  "text": "It's Denmark",
                  "score": 1,
                  "created_utc": "2026-01-22 15:06:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o10gpi8",
          "author": "Open_Resolution_1969",
          "text": "Thanks for sharing, OP. I will definitely put this on tonight's watch list.\n\nMay I offer this YouTube channel in exchange for yours? youtube.com/@cultrepo",
          "score": 1,
          "created_utc": "2026-01-22 08:14:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11gu5u",
              "author": "whit537",
              "text": "CultRepo is great! Production values to aspire to. Story-wise, I especially liked the one on Node. RIP Mikeal. 🙏",
              "score": 1,
              "created_utc": "2026-01-22 13:10:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o12spma",
          "author": "cookiengineer",
          "text": "This documentary is amazing!\n\nI'm only 35mins in and I'm mind blown who you even got to do interviews with. So interesting to see their opinions and how they're approaching their opinions to life etc.\n\nPersonally, I could so relate to PHK because as a teenager, libraries were like a safe learning environment for me, where I could just pick a book about computers and assembly and start exploring what i can do with this. A computer could do anything you set your mind to. And if it can't, then you can just build a simulation for what you want it to do, quite literally.",
          "score": 1,
          "created_utc": "2026-01-22 17:04:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14crzs",
              "author": "whit537",
              "text": "Thanks for the kind words! Glad you're enjoying it. Definitely fun to see the connections between different people's stories. :)",
              "score": 2,
              "created_utc": "2026-01-22 21:19:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qls7fg",
      "title": "I built an open-source alternative to DroidCam/iVCam using C++ and FFmpeg (MIT Licensed)",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qls7fg/i_built_an_opensource_alternative_to/",
      "author": "KryXus05",
      "created_utc": "2026-01-24 16:58:13",
      "score": 67,
      "num_comments": 9,
      "upvote_ratio": 0.96,
      "text": "Hi r/opensource,\n\nI recently needed a webcam for my desktop but didn't want to buy new hardware when my phone's camera is already 4K-capable. I looked at the popular solutions (DroidCam, iVCam, Camo), but I was frustrated by the common \"freemium\" patterns: watermarks, low-resolution limits, ads, and closed-source binaries.\n\nSo, I decided to build **VCamdroid**—a completely free, open-source, and privacy-friendly alternative.\n\n**The Project:** It allows you to stream your Android camera to your Windows PC and use it as a native input in apps like OBS, Zoom, and Discord.\n\n**The Tech Stack (The fun part):**\n\n* **Android App (Server):** Uses `Camera2` API and `MediaCodec` to encode a hardware-accelerated H.264 RTSP stream.\n* **Windows Client (Receiver):** Written in **C++** with **wxWidgets**. It uses **FFmpeg** to decode the stream with low latency.\n* **Virtual Driver:** Implements a **DirectShow** filter (based on `Softcam`) to register the video stream as a system-wide virtual device.\n* **Transport:** Supports standard Wi-Fi or **USB tunneling** (via ADB port forwarding) for a lag-free wired connection.\n\n**Why I'm sharing it here:**\n\n1. **No Bloat:** No ads, no tracking, no \"Pro\" subscription.\n2. **Local Only:** The video stream never leaves your local network (or USB cable).\n3. **MIT License:** You can fork it, break it, or build upon it.\n\nI’m currently looking for feedback on the Windows installer and the latency performance on different devices. If you have C++ or Android experience, I’d love to see some PRs (especially for audio support!).\n\n**Repo:** [https://github.com/darusc/VCamdroid](https://github.com/darusc/VCamdroid)",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qls7fg/i_built_an_opensource_alternative_to/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o1hd4nf",
          "author": "djphazer",
          "text": "Can it be viewed simply via HTTP like DroidCam? That has been the simplest way for me to spin up a mobile camera using an OBS browser source...",
          "score": 8,
          "created_utc": "2026-01-24 19:35:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1hr2jq",
              "author": "KryXus05",
              "text": "Currently no, as actual control is done via the windows app. (stream start, settings etc)\n\nActual RTSP url is publicly accessible but again there is no streaming unless it is started from the windows app",
              "score": 3,
              "created_utc": "2026-01-24 20:40:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1geuk6",
          "author": "parkerlreed",
          "text": "Why not scrcpy? https://github.com/Genymobile/scrcpy/issues/5796#issuecomment-3706592619\n\nDev is actively looking for suggestions for integrating with OBS and even currently you can stream the camera and do a window capture.",
          "score": 5,
          "created_utc": "2026-01-24 17:06:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1gg8zi",
              "author": "KryXus05",
              "text": "VCamdroid doesn't need OBS. It registers directly as a windows webcam using a directshow filter and can be accessed by any app.",
              "score": 3,
              "created_utc": "2026-01-24 17:13:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1gizjf",
          "author": "Quantitation",
          "text": "Great project! Thanks for sharing",
          "score": 2,
          "created_utc": "2026-01-24 17:25:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hha1l",
          "author": "JonathanThorpe",
          "text": "Downloaded it and tried it on Windows 11.  Didn't use the installer script, I just transferred the APK to my phone and installed it, seemed to work fine. On the Windows side, the software didn't work. I registered the softcam.dll and opened the app, dropped the menu for the QR code, and pointed my phone at it. First time round, the software closed itself with an error and the phone app simply said \"connection interrupted\". Second time, the software stayed up and the app went into camera view as if it was ready to stream. On the PC however -- nothing. No devices showing connected from the menu, nothing in the device drop-down.",
          "score": 1,
          "created_utc": "2026-01-24 19:54:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1hwiwh",
              "author": "KryXus05",
              "text": "If it doesn't connect after scanning the QR code you need to make sure vcamdroid.exe wasn't blocked by the windows firewall. \n\nIt should be allowed on both private and public profiles.",
              "score": 2,
              "created_utc": "2026-01-24 21:06:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1icluz",
                  "author": "JonathanThorpe",
                  "text": "Nope. It is allowed through the firewall for both private and public networks, the app had some issues reading the QR code generated by the software (the phones QR code reader on the camera app read it just fine, however. Eventually it read the QR code but the software just exited again, then when I reloaded it, it did the same thing -- it stayed up, the phone acted like it was ready to stream, but no device was listed anywhere on the software. It just does not work.",
                  "score": 1,
                  "created_utc": "2026-01-24 22:22:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1ipnm0",
          "author": "pankreska",
          "text": "Cannot connect. Tried to scan QR code several times, does nothing. The app needs alternative input fields for entering connection settings.",
          "score": 1,
          "created_utc": "2026-01-24 23:28:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjngly",
      "title": "I open sourced a single file less than 30 lines to help you write structured git commit messages",
      "subreddit": "opensource",
      "url": "https://raw.githubusercontent.com/jezsung/gitcommit-vimrc/main/demo.gif",
      "author": "Jezsung",
      "created_utc": "2026-01-22 06:46:47",
      "score": 66,
      "num_comments": 10,
      "upvote_ratio": 0.9,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qjngly/i_open_sourced_a_single_file_less_than_30_lines/",
      "domain": "raw.githubusercontent.com",
      "is_self": false,
      "comments": [
        {
          "id": "o10jely",
          "author": "TedditBlatherflag",
          "text": "Check out the conventional commits standard. Paired with semantic versioning its what I roll out everywhere. \n\nBut also you’re doin’ the Lord’s Work. ",
          "score": 28,
          "created_utc": "2026-01-22 08:40:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10kg6f",
              "author": "thomasfr",
              "text": "I dislike the conventional commits, it wastes very valuable space on the first line and can cause stuttering. If you really want metadata in your commits for some automated system to slurp and create release notes for or whatever I prefer to have it at the end of the commit message.\n\nAlso \"chore\" means nothing in particular (based on how differently people use it in the wild) so you can just as well don't write it out.\n\nIt's much much more important that people learn good writing and thinking about explaining why a change is made instead of spending time following where to put colons and exclamation marks.",
              "score": 13,
              "created_utc": "2026-01-22 08:49:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o10kxgw",
                  "author": "TedditBlatherflag",
                  "text": "I favor small, atomic commits that tell the story of the changes which make it into the release notes. I rarely use more than one line for a commit message unless there’s breaking changes and haven’t had a problem. \n\nI also favor a rebase workflow that includes rebasing onto main and squashing the no longer relevant commits out of the history so the notes remain relevant. \n\nIf you are using a larger commit/more verbose message workflow I can see your objection but for me and many other devs I’ve worked with, the former is so much more manageable and lower cognitive load that almost everyone adopts it straight away.\n\nEverything a tradeoff. ",
                  "score": 4,
                  "created_utc": "2026-01-22 08:54:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o10x56i",
          "author": "Xtrems876",
          "text": "if twitter programming aficionados are to be believed, you are a gigapoop superbad programmer for having made this only 30 lines instead of something better like 300",
          "score": 9,
          "created_utc": "2026-01-22 10:47:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o111595",
          "author": "mallardtheduck",
          "text": "As if we need to make committing code more onerous. Develop on your own branch and commit small and often. Don't think too much about the messages that nobody except you will read. Detailed descriptions of the changes go on the PR/merge.",
          "score": 4,
          "created_utc": "2026-01-22 11:21:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11bdd6",
          "author": "Bob_Spud",
          "text": "Personally I prefer Codeberg to GitHub.",
          "score": -4,
          "created_utc": "2026-01-22 12:36:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11ykmi",
              "author": "Solid-Principle5829",
              "text": "unrelated",
              "score": 5,
              "created_utc": "2026-01-22 14:45:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1ql7lz3",
      "title": "Rebranding our Open-source Selfhosted P2P Social media Project to Bitsocial",
      "subreddit": "opensource",
      "url": "https://github.com/bitsocialhq",
      "author": "AnarchistBorn",
      "created_utc": "2026-01-24 00:12:10",
      "score": 62,
      "num_comments": 2,
      "upvote_ratio": 0.96,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1ql7lz3/rebranding_our_opensource_selfhosted_p2p_social/",
      "domain": "github.com",
      "is_self": false,
      "comments": [
        {
          "id": "o1cgmjz",
          "author": "Aspie96",
          "text": "Did you seriously rebrand it just so you could keep spamming it here without people immediately calling you out about it?\n\nThe issue with the fact that you shared it multiple time isn't the fucking name, it's the \"multiple times\" part. Stop spamming this one project so much, please.",
          "score": 4,
          "created_utc": "2026-01-24 01:07:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1chs53",
              "author": "AnarchistBorn",
              "text": "the rebrand was not  about dodging criticism or sneaking it back in under a new name. It was genuinely about the name itself and a lot of people here (and elsewhere) said “Plebbit” sounded like a joke project, and they were right.\n\nOn the “spamming” part:\n\nwe have shared the project 4 times total, spread out over time, and never reposted the same post. Each one was an actual update (open-source release, rebrand, new sign-in, apps, etc.), not the same link pushed again.\n\n\nAlso, the protocol is fully open source. Anyone can build their own client or UI on top of it. Right now there are already two different apps.",
              "score": 2,
              "created_utc": "2026-01-24 01:13:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1ql4vvk",
      "title": "Open sourced a personal finance app to build in the open with the community",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1ql4vvk/open_sourced_a_personal_finance_app_to_build_in/",
      "author": "TwoBitFoundry",
      "created_utc": "2026-01-23 22:21:00",
      "score": 62,
      "num_comments": 24,
      "upvote_ratio": 0.92,
      "text": "Hey all,\n\nI am super interested in building in the open with the community on a free, self-hosted, personal finance app called **Sumurai** that I originally made for my small business: [https://github.com/TwoBitFoundry/sumurai](https://github.com/TwoBitFoundry/sumurai)\n\nI've been programming over 10 years, most for small and large businesses alike, and would love the chance to build something with others and even mentor some devs newer to the field.\n\nIt's a completely free, bring your own api key experience that supports multiple users and accounts, via Teller which is a financial provider with their own terms of use and data usage policy you'd have to consent to. It works for personal or business accounts, however you'd like to use it. Supports approx. 7k banks in the USA.\n\nI found a lot of different open sourced options out there, but a lot of them were paywalled or blocked features that made the app useless without a lot of manual labor. I made something simple and useful without needing an expensive monthly fee to use. I also plan on open sourcing a few other tools I made for other businesses as well.\n\nWhether you like to collaborate with me or give some feedback, happy to meet you!\n\nEDIT: Clarified that Teller is a financial provider, and to use the app you'd have to consent to their terms of service and data usage policy.",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1ql4vvk/open_sourced_a_personal_finance_app_to_build_in/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o1c04tq",
          "author": "leobenjamin80",
          "text": "Good timing. I just start fiddling with Firefly iii and what a cockoo banana software that is\n\nWill be watching this closely!",
          "score": 8,
          "created_utc": "2026-01-23 23:37:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1c2dnl",
              "author": "TwoBitFoundry",
              "text": "I'm curious what you liked and disliked about firefly iii. It definitely feels like one of those apps you have to work hard at to get the most out of...and a lot of upkeep.",
              "score": 4,
              "created_utc": "2026-01-23 23:49:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1f1foq",
                  "author": "leobenjamin80",
                  "text": "You said it yourself; it is clunky and requires a lot of attention to learn how basic things work. And instead of documentation, you get examples written in German or Dutch or whatever. \n\nAnd Teller, or some lightweight integration to your accounts is a must. We all care for privacy but i am also not going to import csv files over 10 sources, format them and insert them to another source, only to manually correct so many more mistakes in it. \n\nI haven’t tried yours yet but it reads like this is how you do it\n\nIf you go in the direction of being a Monarch replacement I am definitely interested in implementing and potentially contributing",
                  "score": 3,
                  "created_utc": "2026-01-24 12:47:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1ca7dr",
              "author": "ElaborateCantaloupe",
              "text": "Thank you! I was looking for a quicken replacement and I thought it was just dumb and couldn’t figure out firefly after installing and spending an hour or 2 with it.",
              "score": 1,
              "created_utc": "2026-01-24 00:31:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1cebgf",
                  "author": "TwoBitFoundry",
                  "text": "Let me know if you have any trouble setting it up! This is my first open source app, and there may be gaps I didn't anticipate. I hope I made it easy for you!",
                  "score": 1,
                  "created_utc": "2026-01-24 00:54:04",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1czis9",
          "author": "Last_Bad_2687",
          "text": "Sent you a DM!\n\n\nQuestion: What do you say to small outfits who don't have the in-house tech support to deploy this? ",
          "score": 2,
          "created_utc": "2026-01-24 02:57:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1d3n1w",
              "author": "TwoBitFoundry",
              "text": "If you don’t have an in-house team, happy to talk over your options with you.",
              "score": 1,
              "created_utc": "2026-01-24 03:22:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1bqald",
          "author": "quinnr",
          "text": "Super cool, I was looking at open source options for personal and business finance lately and there's not a lot of options that look well maintained or accessible. Good luck!",
          "score": 3,
          "created_utc": "2026-01-23 22:45:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1btwtb",
              "author": "TwoBitFoundry",
              "text": "tyvm. And I agree! I was surprised how bloated some of the software was or out of date. I hope you try it for yourself and get some use out of it like I have!",
              "score": 2,
              "created_utc": "2026-01-23 23:04:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1d17sz",
          "author": "Limemill",
          "text": "I looked at Teller, and it interfaces with banks, basically does categorization based on machine learning and even has some dashboards. What did you add on top of that?\n\nUpd: ah, there’s several apps names Teller. You probably use the one that offers a genetic API for interfacial with various banks, and that’s it.",
          "score": 1,
          "created_utc": "2026-01-24 03:07:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1d5tps",
              "author": "TwoBitFoundry",
              "text": "Teller.io is like the plumbing of the financial tech space. It’s one set of pipes that connects USA based banks together under one standardized interface. So far they support around 7500 banks.\n\nMy app is a visualized layer for your digital transactions, using pipes from teller to populate your data in the app. Instead of me having to individually connect to 7500 banks by myself, I only have to connect with teller instead. \n\nAnd the beauty of it is that with this app being open source, you can bring your own Teller api key and only pay for what you need instead of paying a subscription. Quickbooks for example lowest tiered plan is around $35.\n\nSince syncing transactions is free as long as you stay under 100 accounts. That’s a pretty damn good deal in my book. \n\nHope that clears things up!",
              "score": 1,
              "created_utc": "2026-01-24 03:35:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1e2nfk",
          "author": "LackingAGoodName",
          "text": "UI looks nice, glad to see a new, modern option and looking forward to seeing it grow. do you have any kind of roadmap in mind? maybe crypto wallet support?\n\nI'm also curious if you tried [we-promise/sure](https://github.com/we-promise/sure)? if so, what didn't you like? seems like the closest alternative",
          "score": 1,
          "created_utc": "2026-01-24 07:41:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1gp0a8",
              "author": "clvlndpete",
              "text": "I’ve been looking at Sure as well as I was just about to deploy Maybe finance right before they shut down.  Probably going to test out this and Sure",
              "score": 1,
              "created_utc": "2026-01-24 17:51:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1faym4",
          "author": "hoopsichord",
          "text": "Looks interesting! Thanks for sharing. Can you explain why someone would switch to this from Actual Budget? Also curious why you went with Teller over SimpleFin, which seems more privacy-friendly and costs $15/year.",
          "score": 1,
          "created_utc": "2026-01-24 13:48:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1i75b9",
              "author": "TwoBitFoundry",
              "text": "SimpleFin seems like a good candidate for a low cost, privacy focused integation option for those who subscribe to it. The beauty of it is if that's what the community wants, they can have it! Though it may come at the expense of the usefulness of the dashboard.  \n  \nI opted for Teller because it is more feature rich for my personal/business needs.   \n\\* Connects to 7500+ US providers for multiple types of accounts  \n\\* Automatic transaction enrichment with merchant categories  \n\\* It can sync up to 5 years of data back on demand  \n\\* Free to use and easy to acquire BYOK option.\n\nSimple Fin  \n\\* Limited syncing window 24hours up to 90 days back  \n\\* Limited number of accounts for 15/year option  \n\\* Limited transaction enrichment  \n\\* Not free",
              "score": 1,
              "created_utc": "2026-01-24 21:56:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1coo9y",
          "author": "Ok_Positive4542",
          "text": "This is great. Now it just needs an accompanying mobile app for me to replace YNAB.",
          "score": 0,
          "created_utc": "2026-01-24 01:54:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1crx1k",
              "author": "TwoBitFoundry",
              "text": "Mobile aspect ratios are supported if you can get it self-hosted on the internet :) Save it as a PWA. Looks and plays just like a mobile app.",
              "score": 1,
              "created_utc": "2026-01-24 02:13:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1h5p0g",
                  "author": "Ok_Positive4542",
                  "text": "Yeah. I'm really interested in making a mobile version for this. Btw, quick question, it doesn't seem like there's a way to assign income the way YNAB assigns a category for every dollar, right?\n\n  \nIf I'm to make the switch, I'll probably want to incorporate that feature first. What are your thoughts?",
                  "score": 1,
                  "created_utc": "2026-01-24 19:02:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qiwua1",
      "title": "I built a GPS tracker that sends data directly to YOUR server (no cloud)",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qiwua1/i_built_a_gps_tracker_that_sends_data_directly_to/",
      "author": "DaTurboD",
      "created_utc": "2026-01-21 12:40:27",
      "score": 58,
      "num_comments": 14,
      "upvote_ratio": 0.93,
      "text": "Hey r/opensource,\n\nI got tired of GPS apps that force you through their cloud or make you run complex middleware just to log locations to your own database.\n\nSo I built [Colota](https://github.com/dietrichmax/colota) \\- it's dead simple:\n\n* Point it at your server (any HTTPS endpoint)\n* It POSTs JSON with your GPS coords\n* Done.\n\n**Why you might care:**\n\n* **Works offline-first** \\- saves to local SQLite, syncs when it can\n* **Custom JSON fields** \\- your API wants `latitude` instead of `lat`? Just rename it in settings\n* **Geofences** \\- auto-pause tracking at home/work (privacy + battery)\n* **No cloud/telemetry/tracking** \\- your data stays on your device or YOUR server\n* **Open source** ([Github](https://github.com/dietrichmax/colota))\n\n**Example use cases:**\n\n* Live map on your personal website\n* Simple `INSERT INTO locations` to PostgreSQL\n* Home Assistant webhook\n* Literally any server that accepts POST requests\n\n**Current integrations that work:**\n\n* Dawarich (works great out of the box)\n* OwnTracks Recorder\n* Home Assistant\n* Custom backends (just needs to accept JSON)\n\n**Features in roadmap:**\n\n* Smart Geofence Management (Visual geofence editor (drag to resize) and Statistics: \"You spent 8 hours at work today\"\n* Location History Trail with Date Filter (See your movement paths over time)\n* Statistics Dashboard (Distance traveled (daily/weekly/monthly; Most visited locations)\n\n**I need 12 beta testers for Google Play requirements** (14 days)\n\nIf you have:\n\n* ✅ Android phone\n* ✅ Your own server (or want to test offline mode)\n* ✅ 5 minutes to install and give feedback\n\nJoin the Google Group [https://groups.google.com/g/colota-beta-testing/](https://groups.google.com/g/colota-beta-testing/) and then you can download the beta version at [https://play.google.com/apps/testing/com.Colota](https://play.google.com/apps/testing/com.Colota)\n\n**FAQ:**\n\n*Q: Does it drain battery?*  \nA: \\~5-10% per hour with optimizations. Silent zones help a lot.\n\n*Q: What's the difference vs OwnTracks?*  \nA: Persistent SQLite (OwnTracks uses memory), better retry logic, built-in export, no server software required.\n\n*Q: Do I NEED a server?*  \nA: Nope. Works 100% offline. Server is optional. You can export data from the app and use it e.g. in QGIS\n\n*Q: What data does it send?*  \nA: Only GPS coords to YOUR endpoint. Zero telemetry.\n\nFree forever. No ads. Open source.",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qiwua1/i_built_a_gps_tracker_that_sends_data_directly_to/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o0z7klf",
          "author": "oefz",
          "text": "How does it compare to gpslogger.app ?",
          "score": 6,
          "created_utc": "2026-01-22 02:47:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10gyem",
              "author": "DaTurboD",
              "text": "To be honest I dont know gpslogger.app. But from first view I would say they are very similiar.  \nColota is more of a dashboard view where you can see your location (data).  \n  \nColota supports Geofences. That means you can draw a circle (in the app) where you dont wan't to be tracked and it will never save locations in the zone.  \n  \nIn Colota you can redefine the entire JSON structure. If your server needs `{\"lon\": 12.3}` but another needs `{\"longitude\": 12.3}`, you change it in the UI in seconds.\n\nYou can find a complete feature list at [https://github.com/dietrichmax/colota](https://github.com/dietrichmax/colota)",
              "score": 1,
              "created_utc": "2026-01-22 08:16:59",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o108ygk",
              "author": "National_Way_3344",
              "text": "I hate people asking this \n\nWhy not find out and let us know \n\nIt's not up to the Dev to justify or even compare similar solutions for you",
              "score": -6,
              "created_utc": "2026-01-22 07:05:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o10bc40",
                  "author": "oefz",
                  "text": "Maybe I am wrong, but I assume that most likely the Dev started his work because he felt that exiting apps do not fulfill his need.",
                  "score": 8,
                  "created_utc": "2026-01-22 07:26:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0vbrfu",
          "author": "dmpop",
          "text": "I'd be interested in beta testing it.",
          "score": 3,
          "created_utc": "2026-01-21 15:32:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ve9rd",
              "author": "DaTurboD",
              "text": "You have to join the Google group [https://groups.google.com/g/colota-beta-testing/](https://groups.google.com/g/colota-beta-testing/) (requirement by Google) and then you can download the beta version at [https://play.google.com/apps/testing/com.Colota](https://play.google.com/apps/testing/com.Colota). Thank you!",
              "score": 1,
              "created_utc": "2026-01-21 15:43:49",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o10zmnt",
              "author": "DaTurboD",
              "text": "I just realized I sent the email of the group instead of the link. Fixed that. With [https://groups.google.com/g/colota-beta-testing/](https://groups.google.com/g/colota-beta-testing/) you can join",
              "score": 1,
              "created_utc": "2026-01-22 11:08:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0xi00h",
          "author": "MassiveAssistance886",
          "text": "Sounds like a useful building block. ",
          "score": 1,
          "created_utc": "2026-01-21 21:22:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zurly",
          "author": "Friendly_Cajun",
          "text": "Why use this over Traccar? That already supports hundreds of GPS trackers?",
          "score": 1,
          "created_utc": "2026-01-22 05:12:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10b9z6",
              "author": "DaTurboD",
              "text": "Good question. I used OwnTracks myself for years and decided to create a separate tool for the following reasons:  \n  \nClient-First Philosophy: Unlike Traccar or OwnTracks, which are built to work with a specific ecosystem, Colota is \"backend-agnostic.\" You aren't forced to use a specific server. With our **Custom Field Mapping**, you can rename API fields in seconds to match **Dawarich**, **Home Assistant**, **Node-RED**, or any custom REST API.\n\nLocalized Geofencing (Privacy Focus): In most systems, geofences are handled by the server. In Colota, the logic happens on your device. When you enter a \"Silent Zone,\" the app stops tracking and saving coordinates immediately. Your backend never even knows you arrived. The data simply isn't recorded. Your privacy stays on your phone.\n\nData Ownership & Transparency: You can view, verify, and delete every single coordinate directly in the app. If you don't want to use a server at all, Colota works as a powerful offline logger. You can export your data as local files whenever you want to create custom maps or backups without ever touching a cloud service.\n\nModern UI & Feedback While other clients often feel like \"set and forget\" background tools, Colota gives you a live, interative map with animated markers and clear status indicators, so you always know exactly what is being recorded and why.",
              "score": 2,
              "created_utc": "2026-01-22 07:25:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10ig4d",
          "author": "Mesmoiron",
          "text": "It sounds interesting. I will put it on my list of explorations",
          "score": 1,
          "created_utc": "2026-01-22 08:31:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19fmep",
          "author": "Roundheadkid",
          "text": "Wheres the HomeAssistant integration?",
          "score": 1,
          "created_utc": "2026-01-23 16:21:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19ln01",
              "author": "DaTurboD",
              "text": "It requires a webhook to properly receive data from Colota. I will write a short guide for it in the readme. \n\nHowever If you only want to use it only for homeassistant you are honestly better with the homeassistant companion app because of additional sensor data etc..",
              "score": 1,
              "created_utc": "2026-01-23 16:48:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qig33y",
      "title": "This open-source Windows alternative finally gets a much-awaited speed boost",
      "subreddit": "opensource",
      "url": "https://www.xda-developers.com/open-source-windows-alternative-gets-the-much-awaited-speed-boost/",
      "author": "Jeditobe",
      "created_utc": "2026-01-20 22:41:29",
      "score": 54,
      "num_comments": 22,
      "upvote_ratio": 0.71,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Alternatives",
      "permalink": "https://reddit.com/r/opensource/comments/1qig33y/this_opensource_windows_alternative_finally_gets/",
      "domain": "xda-developers.com",
      "is_self": false,
      "comments": [
        {
          "id": "o0tajeq",
          "author": "iJeff",
          "text": "It's too bad XDA couldn't take the time to test it for themselves before publishing this.",
          "score": 27,
          "created_utc": "2026-01-21 06:41:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tnxxy",
              "author": "furculture",
              "text": "They never do unless they get a check to fund that part of the article as well.",
              "score": 3,
              "created_utc": "2026-01-21 08:44:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tcd6q",
          "author": "Brilliant_Step3688",
          "text": "Wtf click bait",
          "score": 20,
          "created_utc": "2026-01-21 06:57:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0td6uo",
          "author": "marcabru",
          "text": ">  the official X handle of ReactOS has claimed \"substantial performance improvements\" in networking apps after the latest code-merger. It means you should expect apps like web browsers, FTP clients, and download managers to be faster and more responsive.\n\n> This is because the asynchronous socket support can handle multiple network tasks at once and keep the app running while waiting for data from the internet. \n\nSo this hobbyist / novelty OS is finally able to do what _any_ decent OS can do since ages, basically to allow a program to load a web page without freezing up completely until having loaded the whole thing. \n\nToo bad you can’t test it as booting a nightly ReactOS image is like a Russian rulette, mostly ending with a blue screen, admittedly without even testing it. \n\nThis is not a criticism against ROS developers, they are doing this as a hobby, and it’s an interesting project. Instead I direct this to the author of the article, who tries to frame this as the “windows alternative”.",
          "score": 18,
          "created_utc": "2026-01-21 07:04:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uhtsc",
          "author": "r0073rr0r",
          "text": "I love Russia and Russian projects, but Linux + Wine is always > then ReactOS :D   \nSorry Russian devs :D",
          "score": 2,
          "created_utc": "2026-01-21 12:54:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1712o1",
              "author": "ipsirc",
              "text": "[https://loss32.org/](https://loss32.org/)",
              "score": 1,
              "created_utc": "2026-01-23 06:33:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0rdiie",
          "author": "sinnedslip",
          "text": "still developed in Russia?",
          "score": 0,
          "created_utc": "2026-01-20 23:31:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tcon4",
              "author": "marcabru",
              "text": "Having Russian developers is the least of its problems. ReactOS is alpha quality at its best, and even if it’s ready it will only provide some kind of compatibility with Windows XP/Windows 2000, meaning that it’ll not be able to run any modern software. \n\nAny decent Linux distribution (let’s say the EU based SuSe) is a better choice than ReactOS, which is essentially a novelty hobby project.",
              "score": 14,
              "created_utc": "2026-01-21 06:59:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0t8512",
              "author": "Koen1999",
              "text": "While I personally wouldn't be very excited to use it, nationality of OSS developers matters little to me. OSS developers in general are top tier people, regardless of the regime they live under.",
              "score": 9,
              "created_utc": "2026-01-21 06:21:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0tlajl",
                  "author": "sinnedslip",
                  "text": "In general - yes, but you can’t guarantee they’re not impacted, at least if it gets any popular and needed",
                  "score": 3,
                  "created_utc": "2026-01-21 08:18:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0s2tg0",
              "author": "AahanKotian",
              "text": "Why does the nationality of the ReactOS developers mean anything?",
              "score": 9,
              "created_utc": "2026-01-21 01:52:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0seyby",
                  "author": "baldi666",
                  "text": "I don't understand why ur getting downvoted, FOSS is FOSS, if people have a problem with the nationality of a contributor simply dont use the program or create your own fork",
                  "score": 24,
                  "created_utc": "2026-01-21 03:01:46",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0t0cwc",
                  "author": "XenoPhex",
                  "text": "Because various governments have restrictions on what software can be used / installed for government work. The USA, along with other NATO countries prevent the use of software written by/strongly contributed by Russian nationals.",
                  "score": 6,
                  "created_utc": "2026-01-21 05:20:29",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0t43t6",
                  "author": "zulcom",
                  "text": "Can't agree more, such a cruel world when first question about complex FOSS feature in completely free alternative OS is nationality. Bruh, I can name who else raised nationality question first.",
                  "score": 1,
                  "created_utc": "2026-01-21 05:48:36",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0tkwt2",
                  "author": "sinnedslip",
                  "text": "not nationality, location of the developers. Why? Avoiding to support Putin’s regime, war he started and killing innocent people on a daily basis, just yesterday 20 ppl while you are “not interested in politics” and “why-is-it-matter”.",
                  "score": -1,
                  "created_utc": "2026-01-21 08:15:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0to3n0",
          "author": "edparadox",
          "text": "I hate to be this guy, but ReactOS is designed to be used as an actual drop in replacement of Windows for anything other than fun. By instance, security is laughable.",
          "score": 0,
          "created_utc": "2026-01-21 08:45:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhrreb",
      "title": "X algorithm has been open sourced",
      "subreddit": "opensource",
      "url": "https://github.com/xai-org/x-algorithm",
      "author": "TheNavyCrow",
      "created_utc": "2026-01-20 04:53:12",
      "score": 51,
      "num_comments": 25,
      "upvote_ratio": 0.74,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qhrreb/x_algorithm_has_been_open_sourced/",
      "domain": "github.com",
      "is_self": false,
      "comments": [
        {
          "id": "o0mae7h",
          "author": "Kelteseth",
          "text": "> The system relies entirely on the Grok-based transformer to learn relevance from user engagement sequences. No manual feature engineering for content relevance. This significantly reduces the complexity in our data pipelines and serving infrastructure.\n\n\nSo it is just a wrapper and Grok (not open?) is doing the actual lifting here?",
          "score": 74,
          "created_utc": "2026-01-20 05:36:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mhgfs",
              "author": "Steve_Streza",
              "text": "Yeah, the new repository is about 2 orders of magnitude smaller than what they open sourced previously. 6.2k LoC vs 480k. Most (all?) of it is just plumbing data around.\n\nEDIT: There are some hints on what factors into scoring and what filters they apply. But what actually is happening to generate those scores is handled by the model.",
              "score": 21,
              "created_utc": "2026-01-20 06:32:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0mr6d9",
                  "author": "Key_Department4926",
                  "text": "Wasnt LoC a quality measure Musk imposed? The bigger the better? 😂",
                  "score": 6,
                  "created_utc": "2026-01-20 07:56:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0ms9ya",
              "author": "ReadToW",
              "text": "I don't have the knowledge to analyse the code. Can someone who understands the subject explain to me what this means? So we don't know how the algorithm works, right? There's no transparency?",
              "score": 1,
              "created_utc": "2026-01-20 08:06:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0mv040",
              "author": "StinkButt9001",
              "text": "No, this is incorrect. It uses the Phoenix Retriever and Phoenix Scorer transformers which are models *based off* of Grok, but optimized and tuned for very specific scenarios.\n\nIt's not a general purpose LLM like Grok. That would be insane.\n\nPhoenix Retriever is used to grab what they call \"out of network\" suggestions for you which are the ones not really related to you or your circle of people you interact with regularly. It's a \"similar post\" scanner across X, for short.\n\nPhoenix Scorer is the same idea, but tuned for making predictions. For example, it will try to predict the odds that you will like or retweet a particular post.\n\nThen they explain what they do with this data once it is all scanned and scored.\n\nI've not tried running it yet, but from my understanding all of the code you need to run both Phoenix models is in that repository.\n\nIt doesn't touch the actual Grok at all.",
              "score": 1,
              "created_utc": "2026-01-20 08:32:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ma6ww",
          "author": "jrdnmdhl",
          "text": "The only twitter algorithm I ever liked:\n\n    SELECT * FROM tweets\n    ORDER BY created_at DESC;",
          "score": 110,
          "created_utc": "2026-01-20 05:35:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mawlk",
              "author": "almost_not_terrible",
              "text": "Ah, Twitterfall - the only time Twitter had any value.",
              "score": 14,
              "created_utc": "2026-01-20 05:40:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ml418",
          "author": "meti",
          "text": "If the gist of the new system is basically \"grok does it\", then they might as well not release it open source at all. It's basically a black box, unless they share what training data went into grok, right?",
          "score": 16,
          "created_utc": "2026-01-20 07:03:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mw4ju",
              "author": "StinkButt9001",
              "text": "Grok is not part of how it works",
              "score": 0,
              "created_utc": "2026-01-20 08:42:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0mwhjv",
                  "author": "robinvandernoord",
                  "text": "from the readme:\n\n> The system relies entirely on the Grok-based transformer to learn relevance from user engagement sequences. No manual feature engineering for content relevance. This significantly reduces the complexity in our data pipelines and serving infrastructure.",
                  "score": 1,
                  "created_utc": "2026-01-20 08:46:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0m6o1d",
          "author": "StarchyStarky",
          "text": "Am I tweaking or wasn’t it always open source?",
          "score": 19,
          "created_utc": "2026-01-20 05:10:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mgmuz",
              "author": "Steve_Streza",
              "text": "It was closed source from the start of Twitter until 2023 when they posted this: [https://github.com/twitter/the-algorithm](https://github.com/twitter/the-algorithm) They released a handful of updates in 2023. Then they didn't touch it until randomly updating it September 2025.",
              "score": 9,
              "created_utc": "2026-01-20 06:25:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0m86jv",
              "author": "TheNavyCrow",
              "text": "it was open sourced in 2023\n\nthis new version is powered by grok",
              "score": -2,
              "created_utc": "2026-01-20 05:20:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0mvot7",
                  "author": "StinkButt9001",
                  "text": "It is not powered by grok. The only relevance Grok has here was it was the foundation for the Phoenix models they trained and included in the repository.",
                  "score": 1,
                  "created_utc": "2026-01-20 08:38:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0mgrjz",
          "author": "SSUPII",
          "text": "I was so extremely confused as I thought this was about Xorg",
          "score": 9,
          "created_utc": "2026-01-20 06:26:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mhulm",
              "author": "egh128",
              "text": "Same. I keep forgetting about Twitter’s idiotic rebrand.",
              "score": 8,
              "created_utc": "2026-01-20 06:35:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0mlrgf",
          "author": "Maskdask",
          "text": "Ah yes, the Nazi website\n\nGood thing Mastodon exists",
          "score": 11,
          "created_utc": "2026-01-20 07:08:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mujqz",
              "author": "StinkButt9001",
              "text": "This will never not be funny",
              "score": 1,
              "created_utc": "2026-01-20 08:27:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0mtus6",
          "author": "Sushrit_Lawliet",
          "text": "Ah yes the algorithm is they feed it to grok, this clown show of a social media should just be banned from being linked to or mentioned anywhere.",
          "score": 2,
          "created_utc": "2026-01-20 08:21:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mvqc7",
              "author": "StinkButt9001",
              "text": "At no point do they feed anything to Grok",
              "score": 1,
              "created_utc": "2026-01-20 08:39:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0m6voo",
          "author": "Nintenduh69",
          "text": "Apache 2.0 if'n you were wondering. :)",
          "score": 1,
          "created_utc": "2026-01-20 05:11:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mv1bc",
          "author": "GlacialCycles",
          "text": "`if (contentContainsNaziShit) { boostPost() }`",
          "score": 1,
          "created_utc": "2026-01-20 08:32:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qg93x9",
      "title": "Why do developers rarely give feedback on tools they actually use?",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qg93x9/why_do_developers_rarely_give_feedback_on_tools/",
      "author": "Different-Opinion973",
      "created_utc": "2026-01-18 13:52:07",
      "score": 37,
      "num_comments": 30,
      "upvote_ratio": 0.9,
      "text": "I’ve noticed something odd while working on an open-source project. Usage grows slowly, but feedback is almost nonexistent. No issues, no complaints, no suggestions.\n\nI’m not complaining, just trying to understand the behavior. As developers, we rely heavily on open source, but most of us stay silent unless something is severely broken.\n\nFor those who use OSS regularly, what usually makes you speak up? And what makes you stay quiet even when you have opinions?\n\nI’m asking because I’m trying to decide whether silence should be interpreted as a good sign, or as missing signal.\n\nContext if it helps: [https://www.ruixen.com/](https://www.ruixen.com/)  \nRepo: [https://github.com/ruixenui/ruixen.com](https://github.com/ruixenui/ruixen.com)",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1qg93x9/why_do_developers_rarely_give_feedback_on_tools/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o0aicjs",
          "author": "pydry",
          "text": "Devs use 1000 pieces of open source software every day and the ones they think about a lot are the ones that give them headaches, a controversial or are especially noteworthy.\n\n\nIn a way it is a compliment if they say nothing. You've silently become that guy in nebraska from the xkcd cartoon.\n\n\nIf you want to chat to users, probably the best place for you is to find some react communities and hang out there.",
          "score": 65,
          "created_utc": "2026-01-18 14:05:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0aim3b",
              "author": "Different-Opinion973",
              "text": "Thanks for sharing your perspective",
              "score": 10,
              "created_utc": "2026-01-18 14:06:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0aizjv",
          "author": "Gallardo994",
          "text": "I maintain a library that's used in quite some games and I can confirm your findings. People are either silent or they come to report an issue. Silence is probably either a neutral or a good sign imo.\n\n\nAs a user however, last time I went to say thanks for an opensource project, the only place I could was some Discord link I had to go out of my way and find, and then Discord wouldn't open the link in the app and I had to login in the browser to join. Then I left a positive message thanking the developer and the message was lost among other discussions people had within 15 minutes. No response because of that. All in all, it took me extra effort for no particular result for either me or the developer. A bummer. I'd rather donate through a \"buy me a beer\" button tbh.",
          "score": 10,
          "created_utc": "2026-01-18 14:08:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ajm1e",
              "author": "Different-Opinion973",
              "text": "That’s a really good point. Thanks for sharing",
              "score": 5,
              "created_utc": "2026-01-18 14:12:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0amgsn",
          "author": "maetthew",
          "text": "If you don't hear anything, it means it's working.",
          "score": 9,
          "created_utc": "2026-01-18 14:28:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ajvk0",
          "author": "TheAtlasMonkey",
          "text": "Easy. \n\nI have one of the most stable/used/feature complete statemachine gem in ruby. i'm speaking about an org that has 0 issues , 0 PR, but still used a lot.\n\nLast year i got tired of maintaining legacy version and dropped support to anything i don't use or is not compatible.\n\nIn my modernization, i introduced a small bug (it was not tested, and the usage was exotic). \n\nI push to master on friday.. No release yet (i dog food master in my apps for few days/week before i cut  a new version)\n\n4 emails over the weekend, then 30 over the next months.\n\nin all those email , 2 were from toxic users that spoke with me like i own them backward compatibility and clear changelog.  32 others noticed the upgrade and send me a thank you email, other offered me to venmo me .\n\nSo to answer your question : You don't receive feedbacks, either because your solution is bug free, or they moved on to the another solution. (welcome to opensource, where telemetry don't exist and stars are just vibes).\n\nBut There is a new problem in TOWN: AI...\n\nI sometime try to simulate a user problem.. i create an app, create the bug , and ask AI to help me fix it.\n\nIn your case , it not going to tell me : Go fill the bug..  It going to send me an emoji and tell me : \\`TADA! I build MyAPPAccodions and fixed the bug.\\`\n\nNow tell me : Why do i have to spend time, searching in 45/25 issues of tailwin + closed issue. to find solution ? I already have it.",
          "score": 17,
          "created_utc": "2026-01-18 14:14:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0agnay",
          "author": "kkang_kkang",
          "text": "How do you know the **actual usage** has grown over the time?",
          "score": 5,
          "created_utc": "2026-01-18 13:55:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0agun7",
              "author": "Different-Opinion973",
              "text": "I track usage through GA4 and PostHog.",
              "score": 0,
              "created_utc": "2026-01-18 13:56:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0aho7q",
                  "author": "kkang_kkang",
                  "text": "Are these part of the library you offer? Because I don't see the mention of these in the readme file.",
                  "score": 14,
                  "created_utc": "2026-01-18 14:01:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0am9ak",
                  "author": "9peppe",
                  "text": "You need to tell people that. Or every data protection law on the planet will eat them alive.",
                  "score": 14,
                  "created_utc": "2026-01-18 14:27:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0ahivz",
          "author": "jnhwdwd343",
          "text": ">What usually makes you speak up?\n\nBugs and feature requests",
          "score": 5,
          "created_utc": "2026-01-18 14:00:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0aiesd",
              "author": "Different-Opinion973",
              "text": "In my case there aren’t really bugs blocking people. What I’m trying to understand is different. I’m trying to validate whether this is actually creating value",
              "score": 3,
              "created_utc": "2026-01-18 14:05:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0an428",
          "author": "frostphantom",
          "text": "Your project is a professional SDK, albeit open-source. Developers use it mostly on day job. Even a small feedback conversation costs non-trivial amount of time and doesn't give KPI. Time better spent instantly workaround the issue rather than fix it, or create a Github issue with clear intents. It takes like 5x to 10x the time. I know because I tried.",
          "score": 3,
          "created_utc": "2026-01-18 14:32:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ak44w",
          "author": "Ordinary-You8102",
          "text": "not true, there is a lot of feedback. any useful OSS has a ton of issues usually that the maintainers cant handle",
          "score": 2,
          "created_utc": "2026-01-18 14:15:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0al5vo",
              "author": "Different-Opinion973",
              "text": "That’s exactly my confusion. I see usage and stars, but not the issue activity",
              "score": 3,
              "created_utc": "2026-01-18 14:21:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0bwioc",
          "author": "Paerrin",
          "text": "Over the last year, I have made a conscious effort to leave positive comments.\n\nMost of the time it's just a thank you. Compliments are easy to give and they can make a bigger difference than you know.",
          "score": 2,
          "created_utc": "2026-01-18 18:12:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bsr4l",
          "author": "Far_Marionberry1717",
          "text": "Most people who use FOSS are leeches who will never contribute anything back, not even a bug report.",
          "score": 2,
          "created_utc": "2026-01-18 17:55:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ahfif",
          "author": "ElaborateCantaloupe",
          "text": "If it’s worth complaining about, it’s worth changing it and opened a PR. If you don’t accept it, I’ll just fork and move on with my day.",
          "score": 1,
          "created_utc": "2026-01-18 13:59:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ahx0k",
              "author": "Different-Opinion973",
              "text": "That’s fair, and I’ve done the same in the past. I think the only extra step I’m trying to understand as a maintainer is whether a change creates value for more than just one use case.",
              "score": 1,
              "created_utc": "2026-01-18 14:02:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0aoldm",
                  "author": "ElaborateCantaloupe",
                  "text": "My feeling is that if it’s useful enough for someone to contribute the implementation and doesn’t get in the way or remove something for other users, it’s probably useful to more than just that one person and I’d accept it. The only downside might be more maintenance. \n\nAccepting valid contributions even if it’s only useful for that one use case creates good will and you’re likely to get more contributions from that person.",
                  "score": 2,
                  "created_utc": "2026-01-18 14:40:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0ajz5j",
              "author": "Ordinary-You8102",
              "text": "fork? so you will maintain every project because it lacks a feature or even worse implement the feature yourself and then not maintain it and stay behind...?",
              "score": 0,
              "created_utc": "2026-01-18 14:14:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0ao1ia",
                  "author": "ElaborateCantaloupe",
                  "text": "Right. If I implement something that is rejected but it is useful to me, I fork it and use my implementation. That’s literally what the fork feature was built for.",
                  "score": 2,
                  "created_utc": "2026-01-18 14:37:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0am059",
          "author": "Foo-Bar-Baz-001",
          "text": "It usually is not worth it to me, unless they specifically ask for it. IMO open source developers love to hear themselves talk (which is by definition also the concept of OSS). Not so sure if they are good listeners.",
          "score": 1,
          "created_utc": "2026-01-18 14:25:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0btnbf",
          "author": "PurpleYoshiEgg",
          "text": "If I have a problem, I can just fix it myself.  Then I get to do the calculus of effort to figure out if it's a problem worth sending upstream (if there's a CLA I have to sign, even for uncopyrightable contributions, I'll probably never send things upstream).  If I decide it's worth that, then I have to commit to a potential back and forth with the maintainer to justify or clarify things, which impacts further whether I really want to send this thing upstream.",
          "score": 1,
          "created_utc": "2026-01-18 17:59:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dtr0b",
          "author": "gosh",
          "text": "**Reasons why not feedback**\n\n- Who to give feedback to and how to contact, you need to know and investigate this and it takes time\n- Problems are often difficult to explain and it takes time to plan how to formulate and explain the problem, often there is problems when you actually need to get answers.\n- Most developers are \"homeblind\", that includes those that work with projects that are shared as open source. So even if take the time to ask, the answer may be something that the isn't understood.  \n\nRegarding your project. React users do not have that deep knowledge about development, that is the reason why choosing react. These I do not think are the right to understand how to communicate inside repos",
          "score": 1,
          "created_utc": "2026-01-18 23:53:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0b5ct5",
          "author": "Challseus",
          "text": "I'm in the EXACT same boat, was damn near about to post a blog about. I have been trying to make sense of ALL the numbers available to me, so I can tell if people are actually using my stuff, is it bots, or whatever. \n\nFor reference, this is my project, a platform to create modular python stacks: [https://github.com/lbedner/aegis-stack](https://github.com/lbedner/aegis-stack)\n\nI'm aggregating data from:\n\n\\- Github 14 day rolling clones/visitor stats  \n\\- pypi stats from [https://pepy.tech/](https://pepy.tech/)\n\nThey all show numbers going up. Total clones, unique cloners, daily downloads, etc.\n\nI had a single windows bug reported to me 3 days after release, I fixed it that day, haven't heard a peep from anyone since.\n\nThen I remembered that I absolutely love this other open source project, act, which allows you to run through your GH actions locally. I had never starred it. Or said anything to anyone.\n\nThen I realize I am the problem. I am him.\n\nNow, I have been retroactively starring or doing what I can to support people who's stuff I use. But I don't expect that, and the only reason I'm doing it now is because the roles have been reversed.",
          "score": 1,
          "created_utc": "2026-01-18 16:04:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh48az",
      "title": "I'd like to contribute in non-tech roles",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qh48az/id_like_to_contribute_in_nontech_roles/",
      "author": "JimmymfPop",
      "created_utc": "2026-01-19 13:32:30",
      "score": 37,
      "num_comments": 27,
      "upvote_ratio": 0.95,
      "text": "Hello,\n\nI've been away for some time and I was wondering if non technical contributions were still a thing, despite the common use of LLMs. I'd like to get my hands dirty in a domain I really like and am a consumer of.\n\nI have both a degree in philosophy and marketing. Explaining complicated concepts and synthesis are my thing. Despite no references to show, except essays and thesis writing : I'd like to write documentation and communication support for OSS projects, and through that, learn the organization and workflow.  \n  \nDoes anybody need help? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1qh48az/id_like_to_contribute_in_nontech_roles/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o0hf79j",
          "author": "LeIdrimi",
          "text": "I have documentation intense FOSS project that is philosopical. \nCheck it here: r/beatnikAudio\n\nAnd here the main repo : https://github.com/byrdsandbytes/beatnik-pi\n\n\nHit me up if you‘re interested.",
          "score": 6,
          "created_utc": "2026-01-19 14:48:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mlxj3",
          "author": "255kb",
          "text": "I don't want to add another \"yes of course\" comment, but yes, of course! \n\nHaving a decently popular open-source project with a commercial offering to keep the lights on, I wish more marketers/designer/UX specialists would try to contribute to open-source. \nMost of the time, the survival of an project is directly linked to its popularity and its ability to get sponsors or sell something (courses, etc.).",
          "score": 5,
          "created_utc": "2026-01-20 07:10:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h6g1v",
          "author": "urielofir",
          "text": "As a founder and manager of a large open-source community, I can tell you categorically: **Yes, we need you more than ever.**\n\nWhile LLMs are great at generating snippets, they struggle with 'Synthesis'—which you mentioned is your strength. Open source projects often suffer from 'The Curse of Knowledge'; developers know the system so well they can't explain it to a newcomer. Your background in philosophy is actually a superpower here—logic, clarity, and structuring complex ideas are exactly what's missing in 90% of README files.\n\nDon't let the lack of a technical portfolio stop you. Documentation is the front door of any project. If you have any questions about how to bridge the gap between your skills and the OSS workflow (like Git or finding the right project), feel free to ask. I'd be happy to share more from my experience managing community contributions.",
          "score": 15,
          "created_utc": "2026-01-19 14:02:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0jn1dw",
              "author": "HonestRepairSTL",
              "text": "Is it just me or does this comment read like an LLM generated it? Doesn't really take away from the message but it's odd to use AI to make Reddit comments. Or maybe you just sound like a robot lol I don't care",
              "score": 12,
              "created_utc": "2026-01-19 20:53:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0k7g37",
                  "author": "frvgmxntx",
                  "text": "man the structure feels like an LLM and it even has a —",
                  "score": 6,
                  "created_utc": "2026-01-19 22:32:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0mrl39",
                  "author": "JimmymfPop",
                  "text": "That's also what I thought at first glance... D:",
                  "score": 1,
                  "created_utc": "2026-01-20 08:00:30",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0n2srw",
              "author": "urielofir",
              "text": "English isn't my first language so I use LLM to explain myself in English",
              "score": 2,
              "created_utc": "2026-01-20 09:46:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0je0te",
          "author": "JimmymfPop",
          "text": "Thanks everyone, I was worried the current tech brutal conglomerate would crush any craftsmanship and creativity in this world. But FOSS still prevails and shows it is useful, and sometimes more than we take for granted. I don't have a huge amount of free time, but I'll be keeping in touch with fellow redditors with whom we have agreed on a meaningful contribution I could provide. I'm really glad!",
          "score": 3,
          "created_utc": "2026-01-19 20:10:54",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o0ivis8",
          "author": "theben9999",
          "text": "Totally agree with the comments above. Marketing and clear communication are the two hardest problems for me now that I have a v0 of my project which needs some early adopters.\n\nI was reading another thread in this reddit yesterday about why foss projects aren't more popular even though some are \"technically superior\" to their paid alternatives. I think this really just comes down to marketing. Superior marketing is superior product to a certain extent.",
          "score": 2,
          "created_utc": "2026-01-19 18:46:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jw8on",
          "author": "Positive-Thing6850",
          "text": "Hi, I am desperately looking for a writer for my documentation repository - https://github.com/hololinked-dev/docs\n\nI am even planning to adding a note - \"written and proof read by humans\"\n\nMost of this doc was hand written by me currently, so I feel some external help would be great.",
          "score": 2,
          "created_utc": "2026-01-19 21:38:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0k4wpu",
              "author": "JimmymfPop",
              "text": "DMed you!",
              "score": 1,
              "created_utc": "2026-01-19 22:20:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0htqb5",
          "author": "readilyaching",
          "text": "Hi! I’m struggling to make my project’s documentation more welcoming because I don’t have the time to juggle everything - the repository currently has very few contributors. It’s a bit of a circular problem: we can’t work on every important detail, and that makes it harder to attract more contributors.\n\nThe project is [Img2Num](https://github.com/Ryan-Millard/Img2Num) ([site here](https://ryan-millard.github.io/Img2Num/)). I could really use help with documentation, tutorials, and making the project more accessible to new contributors.\n\nIf this sounds interesting, I’d love to collaborate!",
          "score": 1,
          "created_utc": "2026-01-19 15:57:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0i0r39",
              "author": "JimmymfPop",
              "text": "Sure, that'd be great! I'd love to help with that issue. I sent you a DM",
              "score": 1,
              "created_utc": "2026-01-19 16:29:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0jozuz",
          "author": "jaemz101",
          "text": "im going to be working on a full feature documention for https://stuffedanimalwar.com and https://analogarchive.com on https://github.com/jaemzware an editor of sorts would be helpful; a proof reader at least. please reach out if youd like to know more.",
          "score": 1,
          "created_utc": "2026-01-19 21:02:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0jsvx8",
              "author": "JimmymfPop",
              "text": "DMed you.",
              "score": 1,
              "created_utc": "2026-01-19 21:20:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0k6f20",
          "author": "Aspie96",
          "text": "You can contribute things other than code, but you should still very much learn to use basic tools (such as Git and so on) and it would help if you did learn *some* coding.\n\nKnowing how to code is helpful to understand even very high level technical ideas.",
          "score": 1,
          "created_utc": "2026-01-19 22:27:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0k8hcs",
              "author": "JimmymfPop",
              "text": "I've actually been thinking the same. Thing is learning how to code from scratch is time consuming when you're already doing a lot. Even when you learn the basics, you can easily forget if you don't practice.\n\nI feel like contributing in non-tech roles might naturally expose me to learn coding small by small.",
              "score": 2,
              "created_utc": "2026-01-19 22:38:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0lxk6k",
          "author": "Zenalia-",
          "text": "I'm in need of marketing, like sharing and making post of the project.\n\n[Project Link](http://zena-linux.github.io)",
          "score": 1,
          "created_utc": "2026-01-20 04:12:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mofn2",
              "author": "JimmymfPop",
              "text": "I'll send you a message",
              "score": 2,
              "created_utc": "2026-01-20 07:32:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0mtqp4",
                  "author": "Zenalia-",
                  "text": "Thank you",
                  "score": 1,
                  "created_utc": "2026-01-20 08:20:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0mz8s6",
          "author": "billdietrich1",
          "text": "Pick a project you use a lot, know well, and care about, that has gaps in the documentation etc.",
          "score": 1,
          "created_utc": "2026-01-20 09:12:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nuwqt",
          "author": "prototyperspective",
          "text": "One of the many ways to help is via Wikipedia editing (you mentioned text writing).",
          "score": 1,
          "created_utc": "2026-01-20 13:24:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qp2oi",
          "author": "Dull_Cucumber_3908",
          "text": ">I have both a degree in philosophy and marketing.\n\n  \nSee this as an example\n\n[https://community.kde.org/Get\\_Involved/promotion](https://community.kde.org/Get_Involved/promotion)\n\nI guess that all big projects have similar teams.",
          "score": 1,
          "created_utc": "2026-01-20 21:29:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qk1lc1",
      "title": "Speak up for more funding for Open Source from the EU!",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qk1lc1/speak_up_for_more_funding_for_open_source_from/",
      "author": "jman6495",
      "created_utc": "2026-01-22 17:57:27",
      "score": 37,
      "num_comments": 10,
      "upvote_ratio": 0.95,
      "text": "The European Commission has just [launched a consultation on the EU's future Open Source strategy](https://ec.europa.eu/info/law/better-regulation/have-your-say/initiatives/16213-European-Open-Digital-Ecosystems_en). The Deadline is the **3rd of February**.\n\nThe Strategy will cover:\n\n* EU stance towards deploying Open Source software in the EU institutions.\n* EU stance towards procurement of Open Source solutions.\n* The EU's own Open Source contributions.\n* Funding for Open Source developers, companies, and foundations.\n* Helping Open Source foundations to get established in Europe.\n* Implementation of EU laws like the CRA.\n* Future consultation of the Open Source community in lawmaking.\n\nThe EU has funded loads of Open Source projects (like Mastodon) through its Next-Generation Internet initiative. (You can see a full list [here](https://nlnet.nl/project/) (all the ones with NGI))\n\nThat initiative is currently up for review.\n\n**If you want more funding from the EU for Open Source, now is the time to speak up!**",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1qk1lc1/speak_up_for_more_funding_for_open_source_from/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o13sazm",
          "author": "rolyantrauts",
          "text": "If we are all going to stop camping on American soil of American servers of propaganda based American social networks, then a federated network of state social networks is imperative and has been overdue for a decade.",
          "score": 4,
          "created_utc": "2026-01-22 19:43:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o149ifx",
              "author": "CapitalDiligent1676",
              "text": "I agree!",
              "score": 3,
              "created_utc": "2026-01-22 21:03:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o14ahqy",
                  "author": "rolyantrauts",
                  "text": "I think without doubt that is the most pressing need for opensource, it doesn't mean any state is forced to solely use but  a single opensource base is imperative.  \nAfter that opensource voice tech as purely something I am interested in :)",
                  "score": 1,
                  "created_utc": "2026-01-22 21:08:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o189fse",
          "author": "DriesBuytaert",
          "text": "I posted my thoughts at https://dri.es/funding-open-source-for-digital-sovereignty, and submitted it as feedback. 👍🏻",
          "score": 3,
          "created_utc": "2026-01-23 12:47:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o135nnc",
          "author": "Positive-Thing6850",
          "text": "Hi, is the link broken?",
          "score": 2,
          "created_utc": "2026-01-22 18:02:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1360eu",
              "author": "Jentano",
              "text": "Seems like it",
              "score": 2,
              "created_utc": "2026-01-22 18:04:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o137jtq",
                  "author": "jman6495",
                  "text": "Just updated Link.\n\n  \nTry this: [https://ec.europa.eu/info/law/better-regulation/have-your-say/initiatives/16213-European-Open-Digital-Ecosystems\\_en](https://ec.europa.eu/info/law/better-regulation/have-your-say/initiatives/16213-European-Open-Digital-Ecosystems_en)",
                  "score": 2,
                  "created_utc": "2026-01-22 18:11:04",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1394ci",
          "author": "Jentano",
          "text": "We are currently working on our opensource release so it's interesting to follow.",
          "score": 2,
          "created_utc": "2026-01-22 18:18:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16rhap",
          "author": "pyeri",
          "text": "For sure!",
          "score": 2,
          "created_utc": "2026-01-23 05:20:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgzzx3",
      "title": "Anonymous, real-time incident reporting on a map. No accounts. No tracking. Posts auto-delete after 8 hours.",
      "subreddit": "opensource",
      "url": "https://github.com/profullstack/icemap.app",
      "author": "IndividualAir3353",
      "created_utc": "2026-01-19 09:47:52",
      "score": 35,
      "num_comments": 0,
      "upvote_ratio": 0.88,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qgzzx3/anonymous_realtime_incident_reporting_on_a_map_no/",
      "domain": "github.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1qkv8rj",
      "title": "\"Open source Windows\" ReactOS is now 30 years old",
      "subreddit": "opensource",
      "url": "https://www.neowin.net/news/open-source-windows-reactos-is-now-30-years-old",
      "author": "Jeditobe",
      "created_utc": "2026-01-23 16:21:40",
      "score": 28,
      "num_comments": 2,
      "upvote_ratio": 0.91,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Alternatives",
      "permalink": "https://reddit.com/r/opensource/comments/1qkv8rj/open_source_windows_reactos_is_now_30_years_old/",
      "domain": "neowin.net",
      "is_self": false,
      "comments": [
        {
          "id": "o19kqnx",
          "author": "NicePuddle",
          "text": "Do any of you have practical, recent experience with ReactOS and want to share what works and what doesn't work?",
          "score": 5,
          "created_utc": "2026-01-23 16:44:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1d45lt",
              "author": "adstretch",
              "text": "I haven’t kicked the tires on this project in a few years but the last time I tried it, it was barely bootable and ran win9x programs OK but was overall pretty unstable. I think the idea is great but it is a comically large undertaking and a moving target at that. \n\nShort of Windows development just ending and them having a ton of resources to catch up I don’t see this ever being more than an interesting project that is cooler in theory than in practice.",
              "score": 2,
              "created_utc": "2026-01-24 03:25:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qk2trb",
      "title": "Any OpenSource projects looking for help?",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qk2trb/any_opensource_projects_looking_for_help/",
      "author": "Critical-Volume2360",
      "created_utc": "2026-01-22 18:41:11",
      "score": 27,
      "num_comments": 30,
      "upvote_ratio": 0.83,
      "text": "Looking for an opensource project with the following:\n\n* needs more developers\n* is already used by people and is important for them\n\nDoesn't need to be paid or anything, just looking for suggestions. I have a pretty broad skill set with these skills (from most experience to least):\n\n* C++\n* HTML/CSS/JS as well as React\n* Java Backend Servers\n* Python Deep Learning\n* C programming\n\nWith these random exposures\n\n* Godot game dev, Java desktop apps, Android dev\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1qk2trb/any_opensource_projects_looking_for_help/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o13ihwo",
          "author": "Brilliant_Step3688",
          "text": "I'd suggest contributing to projects you are actively using and that you care about. Scratch your own hitch.\n\nDrive-by contributions from non-users that just want to pad their github profiles are not that useful to be honest. Getting involved in a project you are actually using will at the very least be directly beneficial to you.",
          "score": 35,
          "created_utc": "2026-01-22 18:59:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13r0v1",
          "author": "philnelson",
          "text": "OpenCV is definitely looking for help! The core library is C++ https://github.com/opencv/opencv",
          "score": 10,
          "created_utc": "2026-01-22 19:37:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13u6jl",
          "author": "Rwinarch",
          "text": "One that i learned a lot from contributing and has a non-toxic community would be: \n\n[https://github.com/checkpoint-restore/criu](https://github.com/checkpoint-restore/criu)",
          "score": 5,
          "created_utc": "2026-01-22 19:52:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13vmxn",
          "author": "Bach4Ants",
          "text": "Want to help build a decentralized, open-source [GitHub for science](https://github.com/calkit/calkit-cloud)?",
          "score": 3,
          "created_utc": "2026-01-22 19:58:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17qpx8",
              "author": "kein_username_reddit",
              "text": "Hey, I'm CFD engineer. Your project is amazing. \n\n\nI'll try it out ",
              "score": 2,
              "created_utc": "2026-01-23 10:23:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o18ve21",
              "author": "Critical-Volume2360",
              "text": "Huh that's cool, so is it a peer to peer network for sharing research projects?\n\nOr is it just like GitHub with remote servers?",
              "score": 1,
              "created_utc": "2026-01-23 14:47:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o19iaik",
                  "author": "Bach4Ants",
                  "text": "The latter. There isn't federation built in yet, but I was thinking something simple like having instances \"join\" by submitting a PR to the codebase and using OIDC tokens to allow instances to query read-only resources from others.",
                  "score": 1,
                  "created_utc": "2026-01-23 16:33:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o14yk2g",
          "author": "FreeThem2019",
          "text": "Check out [https://github.com/aliasvault/aliasvault](https://github.com/aliasvault/aliasvault)",
          "score": 2,
          "created_utc": "2026-01-22 23:10:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o180my8",
          "author": "Koen1999",
          "text": "I personally maintain this open-source project that is Python (not deep learning). It's gaining popularity, but there are some more improvements we can make to increase usability and accessibility.\n\nhttps://github.com/Koen1999/suricata-check\n\nThere is also a list of open-source projects that have beginner issues: https://up-for-grabs.net/#/",
          "score": 2,
          "created_utc": "2026-01-23 11:46:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13iauu",
          "author": "stroke_999",
          "text": "sssd on musl for alpine linux, it's a challenge",
          "score": 1,
          "created_utc": "2026-01-22 18:58:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13mngm",
          "author": "Sabrees",
          "text": "Wanna help build a robot? [https://github.com/Agroecology-Lab/Open\\_agbot\\_devkit\\_ros/blob/main/README.md](https://github.com/Agroecology-Lab/Open_agbot_devkit_ros/blob/main/README.md)",
          "score": 1,
          "created_utc": "2026-01-22 19:17:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13o7lh",
          "author": "chad_hill",
          "text": "If you want to get into React, Next.js and headless CMS's more, I am working on: https://github.com/pro-laico/atomic-payload\n\nIts a comprehensive website builder for Payload CMS where all you need to know is Tailwind. The idea is make a tool that separates front end client work, from back end infrastructure development. Which means you can build entire sites from the Payload admin UI, with Tailwind.\n\nUltimately the goal is to help solo devs and small agencies build sites faster.\n\nI haven't started promoting it at all yet beyond the Payload discord so far. But I do want to work with more people on the project.",
          "score": 1,
          "created_utc": "2026-01-22 19:24:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13tbkq",
          "author": "BackgroundWolf9004",
          "text": "I have an open source Unit Testing Project for PHP8+ where I would love to get contributors if you're interested",
          "score": 1,
          "created_utc": "2026-01-22 19:48:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13u389",
          "author": "csirkezuza",
          "text": "https://github.com/kuvasz-uptime/kuvasz\n\n\nIf you would like to try out Kotlin on the backend after Java, it's a self-hostable uptime monitor with a minimalistic, SSR frontend (also written with kotlinx.html).",
          "score": 1,
          "created_utc": "2026-01-22 19:51:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13ux15",
          "author": "jhaatkabaall",
          "text": "You can help me out with this project I have issues up and getting slow and steady contributions \n\n[https://github.com/binit2-1/Composter](https://github.com/binit2-1/Composter)",
          "score": 1,
          "created_utc": "2026-01-22 19:55:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13ynge",
          "author": "Funny-Anything-791",
          "text": "We're always looking for more hands with [ChunkHound](https://chunkhound.github.io) but it's a fully generated project so you'll have to be comfortable with professional agentic coding :)",
          "score": 1,
          "created_utc": "2026-01-22 20:12:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13zefn",
          "author": "Jentano",
          "text": "We developed an AICore that we have in production and run large company operations with. We plan to opensource it this year and are looking for partners who want to participate in the initiative. It's competitive with N8N, directed at autonomous company operations. \n\nPartners can bring in feedback for which approach they would prefer above n8n's. We are also interested in support for opensourcing the currently closed source solution.",
          "score": 1,
          "created_utc": "2026-01-22 20:16:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o166i5l",
              "author": "thebloodybrownie",
              "text": "Let me in ! I can help with python",
              "score": 1,
              "created_utc": "2026-01-23 03:09:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o142bkx",
          "author": "geldwolferink",
          "text": "https://gitea.wildfiregames.com/",
          "score": 1,
          "created_utc": "2026-01-22 20:29:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o14r1x8",
          "author": "Picorims",
          "text": "I might use some help on my software project Wav2Bar. There is a little base of users, nothing big though.",
          "score": 1,
          "created_utc": "2026-01-22 22:29:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16dw7h",
          "author": "DesiOtaku",
          "text": "I made some bounties for a few issues of my open source project. You can check them out here:\n\n\nhttps://discuss.kde.org/t/bounties-for-porting-my-software-and-fixing-wayland-issues/43292",
          "score": 1,
          "created_utc": "2026-01-23 03:52:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17alug",
          "author": "crinmakesstuff",
          "text": "I'm happy to work with contributors on my project\n\nIt's called Swiish, it's pretty new (5 weeks) and so there's lots of opportunity for ideas. It's in JavaScript (Node.js) so probably ok if you write C++, that's my main language too.\n\nI built it becuase the paid alternatives are not great and I wanted a project for leanring modern web app design.\n\nHappy for you to take a look\n\n[https://github.com/MrCrin/swiish/](https://github.com/MrCrin/swiish/)",
          "score": 1,
          "created_utc": "2026-01-23 07:55:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17s57x",
          "author": "cnekmp",
          "text": "https://github.com/Kethsar/ytarchive is having functionality issues right now after YouTube updates. A lot of people use it and dev won't fix the issue yet...",
          "score": 1,
          "created_utc": "2026-01-23 10:36:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gvv7m",
          "author": "SnooBooks638",
          "text": "I started to work on a trading bot, for learnings but mostly because other ones don't support certain functionalities. Like multiple strategies with a consensus model for decision, or multi-asset configuration.  \n  \nHappy to have fresh perspectives if you're interested and others' contributions are welcome too -> https://github.com/toniton/ml-crypto-trading.",
          "score": 1,
          "created_utc": "2026-01-24 18:20:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1i2oq1",
          "author": "matiwi",
          "text": "FreeCAD",
          "score": 1,
          "created_utc": "2026-01-24 21:35:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1khemx",
          "author": "_heartbreakdancer_",
          "text": "dancechives.com\nJoin the discord if you're interested",
          "score": 1,
          "created_utc": "2026-01-25 05:30:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj9k0a",
      "title": "Repo Fork Etiquette Question",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qj9k0a/repo_fork_etiquette_question/",
      "author": "TaChunkie",
      "created_utc": "2026-01-21 20:40:05",
      "score": 24,
      "num_comments": 12,
      "upvote_ratio": 0.94,
      "text": "(To preface this I am relatively new to open source and only have one other slightly-used project on GitHub.)\n\nI made a feature request on a repository asking to add a piracy aspect to a selfhosted music service, which the author replied and said it was out of scope, difficult to implement, and that they were fundamentally against the idea. They then closed the issue as unplanned. So, I made a fork and implemented it myself.\n\nMy fork is now approaching similar visibility to the original repo and the author has since reopened the original issue, done a complete 180 on their stance and are saying that after seeing my fork, they think that it would be a good idea to implement and they are going to begin working on it.\n\nAm I wrong to be annoyed by this? I've told the author that I think it would be a good idea to keep the original/fork separated due to one using piracy and one not using it, but they remained adamant that they wanted to take my idea and implement it in their repo. To me, this seems like they just want to remove the need/viability of my fork after seeing it growing in popularity.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1qj9k0a/repo_fork_etiquette_question/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o0xu9er",
          "author": "leeharrison1984",
          "text": "Annoying yes, however... I'd gladly resubmit my PR and let them handle maintenance going forward. \n\nThe whole point was to get the feature added, and it sounds like you did it.",
          "score": 42,
          "created_utc": "2026-01-21 22:19:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zc9dj",
              "author": "TaChunkie",
              "text": "Yea fair enough, feature is there now lol",
              "score": 2,
              "created_utc": "2026-01-22 03:14:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ys3r4",
          "author": "DoNotFeedTheSnakes",
          "text": "Both of you have understandable POVs. And nobody did anything wrong as far as I can tell.\n\nOSS isn't free, it costs time and effort to produce and maintain. \n\nSo the original repo owner is well within his rights to refuse implementing something he doesn't believe people will use... and then doubling back when he realizes he is wrong.\n\nSimilarly you are perfectly in the spirit of open source, when someone refused to implement a feature you needed and you decided to fork and do it yourself.\n\nThis isn't an etiquette issue at all.\n\nIt's just a personal choice up to you.\n\nDo you continue to maintain the fork, or stop doing so because your efforts have led to the original following suit ?\n\nIMHO you should ask your users.\n\nIf there is potential for more piracy use cases, and the original repo owner might refuse implementing them, I'd keep the repo just in case.\n\nIf after talking with the original repo owner, it truly seems he's seen the light, maybe you switch back to it and ask to become a maintainer so you can guarantee future use cases won't be ignored.",
          "score": 14,
          "created_utc": "2026-01-22 01:19:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zda9p",
              "author": "TaChunkie",
              "text": "Ah, yes I think I will ask and see what current users of my fork think would be best/easiest and then go from there. \n\nI do like the idea of just leaving the repo regardless in case anything ever happens upstream",
              "score": 2,
              "created_utc": "2026-01-22 03:20:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0zaioq",
          "author": "billsil",
          "text": "Better to have someone else maintain it.",
          "score": 7,
          "created_utc": "2026-01-22 03:04:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zcvrq",
              "author": "TaChunkie",
              "text": "Haha this is true, thank you",
              "score": 2,
              "created_utc": "2026-01-22 03:17:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0xqvwm",
          "author": "Crowley723",
          "text": "Are they completely against using what you have implemented already? Have you asked?\n\nIt sounds like a lot less work to just contribute what you have back to the main project and go through code reviews rather than have them implement it from scratch.",
          "score": 5,
          "created_utc": "2026-01-21 22:03:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zcm7k",
              "author": "TaChunkie",
              "text": "They ended up just implementing it themselves, yes. In the end i guess it’s fine as the feature ends up in the project",
              "score": 1,
              "created_utc": "2026-01-22 03:16:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0xvwfs",
          "author": "Aspie96",
          "text": "You took their whole code, they have the right to take your patch if the license allows it.",
          "score": 6,
          "created_utc": "2026-01-21 22:27:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o104nod",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-22 06:29:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10r98l",
              "author": "opensource-ModTeam",
              "text": "Let's go ahead and leave this one as appropriately vague. We don't need to be asking the specifics of piracy here.\n\nThis was removed for being off-topic to r/opensource. This might have been on-topic but just poorly explained, or a mod felt it wasn't on-topic enough for the community to not consider it noise.\n\nIf you feel this removal is in error, feel free to message the mods and be prepared to explain in detail how it adds to the open source discussion. Thanks!",
              "score": 1,
              "created_utc": "2026-01-22 09:54:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o14bmoo",
          "author": "abotelho-cbn",
          "text": "Why would you *want* to maintain a fork?\n\nIMO, work with this dev, and maybe see about getting a more prominent role on the project. You've clearly shown yourself to be capable. Just make sure you aren't signing a CLA that gives away your copyright.",
          "score": 1,
          "created_utc": "2026-01-22 21:13:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhewta",
      "title": "Building the world’s first open-source quantum computer",
      "subreddit": "opensource",
      "url": "https://uwaterloo.ca/news/global-futures/building-worlds-first-open-source-quantum-computer",
      "author": "donutloop",
      "created_utc": "2026-01-19 19:59:58",
      "score": 23,
      "num_comments": 2,
      "upvote_ratio": 0.97,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1qhewta/building_the_worlds_first_opensource_quantum/",
      "domain": "uwaterloo.ca",
      "is_self": false,
      "comments": [
        {
          "id": "o0ldz9m",
          "author": "MPGaming9000",
          "text": "Excellent! I can't wait to use this with my $1B quantum computer fab in my garage right next to my $500M worth of liquid nitrogen tanks! /s",
          "score": 5,
          "created_utc": "2026-01-20 02:21:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0oblkh",
          "author": "BadgerInevitable3966",
          "text": "What's the difference btw? ",
          "score": 1,
          "created_utc": "2026-01-20 14:53:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}