{
  "metadata": {
    "last_updated": "2026-02-25 09:09:57",
    "time_filter": "week",
    "subreddit": "opensource",
    "total_items": 20,
    "total_comments": 152,
    "file_size_bytes": 226986
  },
  "items": [
    {
      "id": "1rbkzwe",
      "title": "Large US company came after me for releasing a free open source self-hostable alternative!",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rbkzwe/large_us_company_came_after_me_for_releasing_a/",
      "author": "funyflyer",
      "created_utc": "2026-02-22 12:46:37",
      "score": 1934,
      "num_comments": 158,
      "upvote_ratio": 0.98,
      "text": "**⚠️⚠️ EDIT : \\[Company A\\] CEO reached out to me with a nice tone and his point of view, which I really appreciate, also with a mild apology for sending the legal doc first without communication (the got the message we wanted to deliver). I hold nothing against their business personally and I am always more than happy to comply with reasonable demands (like removing trademarked name parts from project), but I don't think the exporter is against the rules (I have my own logic for fair business practice) and now the CEO wants to meet for a quick call (I hope friendly), to discuss and reason things out. I need to present my points fairly as well and don't want to get pressured/voiced down, just because I am alone with my logic. I am sure as a company with > 1 million $ revenue they have a larger backing.**\n\n⚠️⚠️ I am already in chat with [u/Archiver\\_test4](https://www.reddit.com/user/Archiver_test4/) as a legal representative, but we are in a different time zone. If anyone else in addition would like to take a look to help me, present their view, or get involved, I am more than happy to talk and get some feedback on how can I present my idea (reach out only If you are a lawyer, but please note I am not in a position to pay any fees). It's best if you have knowledge of EU legal rules and data protection policy, GDPR etc. Please reach out to me as this is the right time to make the reasoning and requests. feel free to email me to [contact@opendronelog.com](mailto:contact@opendronelog.com) or send me a chat here. I might not reply until morning, as it's quite late here now.\n\nNone of these would have happened only if they sent me this same email before sending the letter.\n\n💜💜 Thanks to the [r/drones](https://www.reddit.com/r/drones/) and [r/selfhosted](https://www.reddit.com/r/selfhosted/) and [r/opensource](https://www.reddit.com/r/opensource/) community we were able to reach to this stage in record time. As in individual, you can voice your opinion. It proved again that what opensource communities can do and this thread is a living proof of that.\n\n\\---------\n\n\n\n**TL;DR:** I made an [open-source, local-first dashboard for drone flight logs](https://opendronelog.com/) because the biggest corporate player in the space locks your older data behind a paywall. They found my GitHub, tracked my Reddit posts, and hit me with a legal notice for \"unfair competition\" and trademark infringement.\n\n**Long version:** I maintain a few small open-source projects. About two weeks ago, I released a free, self-hostable tool that lets drone pilots collect, map, and analyze their flight logs locally. I didn't think much of it, just a passion project with a few hundred users.\n\nI can’t name the company (let's call them \"Company A\") because their legal team is actively monitoring my Reddit account and cited my past posts in their notice. Company A is the giant in this space. Their business model goes like this:\n\n* You can upload unlimited flight logs for free.\n* BUT you can only view the last 100 flights.\n* If you want to see your older data, you have to pay a monthly subscription *and* a $15 \"retrieval fee.\"\n* Even then, you can't bulk download your own logs. You have to click them one by one. They effectively hold your own data hostage to lock you into their ecosystem. I am not sure if they are even GDPR complaint even in the EU\n\nTo help people transition to my open-source tool, I wrote a simple web-based script that allowed users to log into their own Company A accounts and automate the bulk download of their own files. Company A did not like this. They served me with a highly aggressive, 4-page legal demand (CEASE and DESIST notice). They forced me to:\n\n1. Nuke the automated download tool entirely from GitHub.\n2. Remove any mention of their company name from my main open-source project and website (since it’s trademarked). I originally had my tagline as \"The Free open-source \\[Company A\\] Alternative,\" which they claimed was illegally driving their traffic to my site.\n3. Remove a feature comparison chart I made. (I admittedly messed up here, I only compared my free tool to their paid tier and omitted their limited free tier, which they claimed was misleading and defamatory).\n\nI'm just a solo dev, so I complied with the core of their demands to stay out of trouble. I scrubbed their name, took down the downloader, and sanitized my website. My main open-source logbook lives independent of them.\n\nI admit I was naive about the legal aspects of comparison marketing and using trademarked names. But the irony is that they probably spent thousands of dollars on lawyer fees to draft a threat against my small project that makes close to zero money (I got a few small donations from happy users).\n\nHas anyone else here ever dealt with corporate lawyers coming after your self-hosted/FOSS projects? It’s a crazy initiation :)",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1rbkzwe/large_us_company_came_after_me_for_releasing_a/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o6riaj2",
          "author": "zynasis",
          "text": "Lol “unfair competition “ \nSo like what every monopoly Corp does?",
          "score": 518,
          "created_utc": "2026-02-22 12:52:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tb2sf",
              "author": "dtseng123",
              "text": "What if there was a dev version of Barbara Streisand?",
              "score": 51,
              "created_utc": "2026-02-22 18:18:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6vhlsh",
                  "author": "nuclear_wynter",
                  "text": "I guess the dev equivalent of the original Streisand event would be something like \"Noooooo, you can't post a link to my public Git repo on a public forum for the public to see, nooooo!\" followed by a bogus DMCA takedown order.",
                  "score": 9,
                  "created_utc": "2026-02-23 01:07:33",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o73hu99",
                  "author": "AbjectFee5982",
                  "text": "The rossmann effect XD",
                  "score": 1,
                  "created_utc": "2026-02-24 07:05:02",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7adx4r",
                  "author": "RealUlli",
                  "text": "That's not a dev version of the Streisand Effect. That is the Streisand Effect, pure and simple. \n\nSomeone makes something that someone else doesn't like and tries to have taken down. The Internet says \"NOPE\" to the takedown, makes backups and spreads the news fast and wide. \n\nThis is what happened here. I don't have a drone and without that legal action I would never have heard about the software.",
                  "score": 1,
                  "created_utc": "2026-02-25 07:23:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6upi9b",
              "author": "kwhali",
              "text": "The authors project was marketed with a tagline as the free alternative to company's name software.\n\nIt also uses a download script for existing users to retrieve / export their existing data from said company, so that they no longer need to pay company and can stop being a customer.\n\nThe project was vibe coded (although with proper review and fair disclosure on README, you can tell from the source code that they're not that experienced in a few areas of the tech stack but at a glance doesn't appear to be slop).\n\nI only mention that due to the speed of development and I assume the quick uptake to hundreds of users is related to customers leaving upset company's business for this OSS alternative.\n\nThe author had marketed awareness of the project via various communities which the company may have monitored for their own marketing.\n\nI assume either analytics or other insights about sudden drop in customers (_someone might have even communicated they were leaving for the authors project instead_) made it not too difficult to discover. As noted the company name was more publicly visible and associated to the project (you can see it via git history on the README).\n\nI'm not a lawyer, but I would say that probably has some legal basis. Notably the downloader functionality (IIRC this was a separate repo conveniently/wisely, but OP took that down from public access), which now from what I recall someone else saying is effectively distributed as a proprietary binary now? At least I'm pretty sure there is some legal issues in some countries regarding unsolicited data scraping of a business 🤔\n\nMaybe the free aspect and being OSS helps avoid some concerns there but it's a bit clear why legal action was being raised, it was kind of targeted theft of the companies customers.\n\nThe author offers a fully free project atm, but who's to say they or someone else doesn't then try to offer some paywall features / functionality down the line if there's enough user adoption to support it. Some OSS project's do try to monetize and this one already has a section for donations, such that said customers can provide financial support that they were giving the prior company to this project to get feature work prioritised.\n\nSeems like a grey area 😅 I'm not trying to defend the company that is upset btw, if they were charging fees like that I think that's dumb and I'm all for OSS, but I think I'd be unhappy if someone made a free version of my product and marketed it that way with my own product name to get traffic and steal customers by additionally scraping my own service 🤔",
              "score": 11,
              "created_utc": "2026-02-22 22:28:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6uxty1",
                  "author": "funyflyer",
                  "text": "I don't know why you are being downvoted, but imo you raise fair points only very respectfully. About the OSS model, I am not interested in selling or adding useful features paywalled as it is AGPLv3 currently. I have maintained other projects (fully hand-coded as you will notice) in this same model and more than happy to provide occational support on the issues for some small donations over time. Imo I enjoy not feeling liable but working on a project for fun. ",
                  "score": 15,
                  "created_utc": "2026-02-22 23:14:13",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o6w0n04",
                  "author": "ivosaurus",
                  "text": "Brother, advertising yourself as an alternative is not fucking THEFT. That's the free market, and you have to deal with it. Make a better product. Jesus christ. Talk about corporate capture. Get your tongue off that boot.",
                  "score": 8,
                  "created_utc": "2026-02-23 03:03:07",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6vttxi",
                  "author": "Karyo_Ten",
                  "text": ">At least I'm pretty sure there is some legal issues in some countries regarding unsolicited data scraping of a business 🤔\n\nDebatable if he didn't run it himself as a service but users did.\n\nAlso defensible in the EU given that by GDPR law a user should be able to request ALL data a business has on them unless superceding regulatory requirement (say anti-money laundering compliance).",
                  "score": 1,
                  "created_utc": "2026-02-23 02:21:28",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6yxy4c",
                  "author": "Critical_Ad_8455",
                  "text": "> it was kind of targeted theft of the companies customers.\n\nwhat? so trying to be better than some other company is theft, now? \n\n> but who's to say they or someone else doesn't then try to offer some paywall features / functionality down the line if there's enough user adoption to support it\n\nthe license, which means the current codebase will always be free, and if they start paywalling stuff, someone can fork the last non-paywalled version and maintain their own free version, if they so choose",
                  "score": 1,
                  "created_utc": "2026-02-23 16:00:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6yrtix",
              "author": "Vert354",
              "text": "\"Unfair competition\" is just the umbrella legal term for IP infringement. (i.e. trademark, copyright, etc.)\n\nA monopoly would be an \"anti-trust\" case.",
              "score": 1,
              "created_utc": "2026-02-23 15:31:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o74xdfh",
              "author": "Stevedougs",
              "text": "Yep. Free market competition isn’t free at all, if the neighbouring stall at the farmers market can shut down opposition because they did something better or used their name in describing what theirs is. But throwing up big signs and taking things from the other stall is a bit over the top.\n\nIf all it takes is a single dev and a GitHub page to take your business model down, then it’s not a good model I think. Adapt. Revise. Actually provide something legitimate to stay strong. there’s so many SAAS that don’t need to be or shouldn’t for 2026.\n\nThere’s some solid ethical discussion in this thread though, I appreciate the other points of view i hadn’t considered",
              "score": 1,
              "created_utc": "2026-02-24 13:57:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6rm262",
          "author": "esdraelon",
          "text": "IANAL\n\n\nThis will all be highly dependent on your legal jurisdiction.\n\n\nTypically, this will stem from the trademark infringement.\n\n\nChange the name of your tool, and don't mention them or their features. That's the key. \n\n\nAfter that, unless they have a patent, they can kick rocks.",
          "score": 291,
          "created_utc": "2026-02-22 13:18:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tb890",
              "author": "dtseng123",
              "text": "Yes this is exactly right. Don’t talk shit just be a better solution and they have nothing to stand on.",
              "score": 42,
              "created_utc": "2026-02-22 18:19:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6yyuas",
              "author": "[deleted]",
              "text": "[deleted]",
              "score": 2,
              "created_utc": "2026-02-23 16:05:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6zgcju",
                  "author": "esdraelon",
                  "text": "Yes. Legitimate comparisons of features are typically fine, or if it makes sense to reference it.\n\nFor instance \"Tired of paying for Brand X? Why would you pay for feature Y? Just use this tool.\"\n\nBasically, you can't imply that your tool is being endorsed by or is a product of the brand in any way.\n\nTrademark only regulates some types of commercial speech. It is not a blanket authorization of use on all uses of that word or logo.",
                  "score": 2,
                  "created_utc": "2026-02-23 17:26:32",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o71fj22",
                  "author": "cubedsheep",
                  "text": "The spirit of a trademark is to protect consumers, not companies. It does this by limiting the use of certain trademarked words, in the relevant context, to only refer to a specific product (so I cannot sell 5$ T-shirts with Gucci on it, that infringes their trademark and misleads buyers). So you should be fine mentioning them, as long as it is clear that your product is in no way related to the product your mentioning. e.g. \"this is how my product X compares to companies Y product Ztm\" should be fine. The law is of course quite nuanced and probably can be misused, but the goal of trademark law is originally to prevent confusion under consumers. \n\nJust slapping someone with a lawsuit for making a comparison should not fall under this, and in some juristictions these tactics, misusing IP and other laws to block competition or speech you don't like is a crime itself under \"SLAPP\" laws.\n\nI think even the wording \"free alternative to X\" is not infringing since you clearly state it's an alternative (at least it shouldn't be infringing from the perspective of consumer protection). Trademarkwise should be fine. But I'm not a lawyer, so don't take this as advise.",
                  "score": 1,
                  "created_utc": "2026-02-23 23:08:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6rq2f1",
          "author": "BizarroMax",
          "text": "Lawyer and former open source developer here.  DM me.",
          "score": 191,
          "created_utc": "2026-02-22 13:43:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6s40cj",
              "author": "FalseDish",
              "text": "If you don’t mind me asking - I’m actually having a strikingly difficult time finding citations where small FOSS players have won judgements.\n\nI can find plenty in EU countries, so many cases where German and French courts have ruled against large corporations to protect open source licenses, but in the US it seems the only wins are from the Free Software Foundation against Verizon and Monsoon Media for their illegal busybox distribution.\n\nI am genuinely happy to see a dev-turned-lawyer helping out an open source developer ofc but it’s making me a little sad to see how easily companies can just bully developers who are selflessly giving to the community.",
              "score": 35,
              "created_utc": "2026-02-22 15:00:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6sxnbs",
                  "author": "idspispupd",
                  "text": "One case I know of is in 2010, the U.S. Copyright Office has ruled that jailbreaking to install apps does not violate copyright law. Another case - Cydia filed an antitrust lawsuit against Apple, but I think it lost the legal battle of attrition.",
                  "score": 22,
                  "created_utc": "2026-02-22 17:16:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6roron",
          "author": "retireb435",
          "text": "remove their brand name then it’s fine",
          "score": 122,
          "created_utc": "2026-02-22 13:35:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rp9gt",
              "author": "funyflyer",
              "text": "I did I did, lesson learnt, I complied with the legal demands. ",
              "score": 56,
              "created_utc": "2026-02-22 13:38:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6rsgrf",
                  "author": "maddler",
                  "text": "You might need to to a search & replace in the Readme tho' ;) ",
                  "score": 31,
                  "created_utc": "2026-02-22 13:57:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6te9ma",
                  "author": "TheOriginalSuperTaz",
                  "text": "You don’t even need to remove their brand name unless you lied about their features. It’s not lying to not discuss all of their tiers. As long as you put a note on the chart that it is accurate as of the date you created it (with that date), and it is actually accurate, then you aren’t doing anything illegal. Just don’t use their logo (if you don’t use their logo, they can’t claim you are using their trademark unfairly, and the name of their product can be used under fair use in this case - there is ample precedent for that).\n\nYou are allowed to advertise your product, even if it is free. Comparison charts are absolutely legal forms of advertising and costume education if they are accurate, and they only need to be accurate as of the time you publish them (especially if you say they were accurate as of a specific date and keep a copy for your records in case of losers like the morons who sent you that letter).\n\nIf their lawyers are any good, they told them that they can write and send the letter, but there is nothing to actually be done if you don’t comply. Any responsible lawyer would tell them there is no legal leg to stand on in an actual suit, and they would get destroyed in court in preliminary hearings if you had even a mediocre lawyer. You should be able to counter sue them for your legal fees, too, as it will be kicked out under anti-SLAPP very early.\n\nTo be clear, I’m not a lawyer, but any decent lawyer should be able to anti-SLAPP this stupidity if they actually were to sue you. Get legal advice and make sure you aren’t doing anything actually illegal, but it’s not unfair practices to make an alternative to an existing product, nor is it illegal to give it away for free, unless you stole it from them (the code, not the idea), you have the right to create and market a product that competes with their unpatented crap.",
                  "score": 16,
                  "created_utc": "2026-02-22 18:33:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6tzfy0",
                  "author": "TheMightyMisanthrope",
                  "text": "Replace \"company\" with \"little babies that cry\" \n\n\n(Don't do this, I'm not a lawyer)",
                  "score": 2,
                  "created_utc": "2026-02-22 20:15:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6tkyli",
                  "author": "XB_Demon1337",
                  "text": "Don't just comply with the legal demands. Comply LEGALLY with their demands. When their demands are not about you violating the law, then they have no legal leg to stand on. ",
                  "score": 0,
                  "created_utc": "2026-02-22 19:04:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6saumb",
              "author": "Open-Dragonfruit-007",
              "text": "Yeah, just say something like leading closed source competitor or what ever the equivalent is to make it obvious you are talking about them but legally you have not named them",
              "score": 14,
              "created_utc": "2026-02-22 15:35:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6u9mez",
                  "author": "ReachingForVega",
                  "text": "This would be my suggestion",
                  "score": 2,
                  "created_utc": "2026-02-22 21:07:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6wmqoi",
              "author": "coderemover",
              "text": "Using the brand name only to identify/refer to the original service is the primary purpose of brand names. You are not allowed to use someone else’s logo on your product or in any way that would trick your customers into thinking you or your product is the original product/service/initiative done by the owner of the brand/logo. So e.g. if you manufacture replacement toners for HP you must not put HP logo on your toner package, but you can put a label „a replacement toner for HP XXXXX printer”.",
              "score": 1,
              "created_utc": "2026-02-23 05:39:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6rvcvp",
          "author": "Marble_Wraith",
          "text": "> Remove any mention of their company name from my main open-source project and website (since it’s trademarked).\n\nThe logo yes, the textual name, no.\n\nThe main uses of a trademark are to prevent:\n\n- phishing: so you can't blatantly mask your product or service as another.\n- reputation hijacking: so you can't mention a brand and impute association of your own product / service.\n\nUnless you were actually trying to do that, courts would rule in your favor.\n\nThe fact yours is opensource (non-profit) is already a huge strike against them.\n\n> I originally had my tagline as \"The Free open-source [Company A] Alternative,\" which they claimed was illegally driving their traffic to my site.\n\nDogshit. If anything this is mutually exclusive with the trademark claim they just made.\n\nAggressive marketing has no penalties. Fucks sake next thing they'll say is SEO and using certain meta keywords is illegal 🤣\n\n> Remove a feature comparison chart I made. (I admittedly messed up here, I only compared my free tool to their paid tier and omitted their limited free tier, which they claimed was misleading and defamatory).\n\nNo? Depends on if you were actually defamatory... duh. As long as you were truthful in the comparison and/or clearly state \"it's my opinion\", they can't do anything.\n\nOtherwise there'd be no product comparisons ever on the internet, example:\n\nhttps://typesense.org/typesense-vs-algolia-vs-elasticsearch-vs-meilisearch/\n\nFurthermore depending on your jurisdiction, defamation can require the *plaintiff* to provide evidence of significant financial loss... The internet is exposed to the entire world. Good luck with trying to prove causation over correlation 🤣",
          "score": 49,
          "created_utc": "2026-02-22 14:14:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rwzvg",
              "author": "funyflyer",
              "text": "I have already complied with most demands to avoid more trouble, Your comment made me laugh :)",
              "score": 14,
              "created_utc": "2026-02-22 14:23:44",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6tyn37",
              "author": "twicerighthand",
              "text": ">\n\n>Dogshit. If anything this is mutually exclusive with the trademark claim they just made.\n\nYep. Discord in 2017:  \n[https://i.redd.it/4f5etmp2zkj81.png](https://i.redd.it/4f5etmp2zkj81.png)",
              "score": 5,
              "created_utc": "2026-02-22 20:11:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6uud6j",
                  "author": "Marble_Wraith",
                  "text": "Nice... and ironic given Discords actions that are forcing people to look at Teamspeak again 😂",
                  "score": 3,
                  "created_utc": "2026-02-22 22:55:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6sb2pi",
          "author": "Captain_Lesbee_Ziner",
          "text": "Hope it all gets cleared up. Will be checking out your project now lol. Some articles you might find interesting, plus if you continue to have trouble, talk to the free software foundation\n\nhttps://www.fsf.org/\n\nhttps://fossa.com/blog/analyzing-5-major-oss-license-compliance-lawsuits/\n\nhttps://www.zdnet.com/article/patent-troll-attacks-against-open-source-projects-are-up-100-since-last-year-heres-why/",
          "score": 16,
          "created_utc": "2026-02-22 15:36:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6sc7eo",
              "author": "funyflyer",
              "text": "Thank you so much, I will check them out. ",
              "score": 3,
              "created_utc": "2026-02-22 15:41:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6t976w",
                  "author": "TheOriginalSuperTaz",
                  "text": "You don’t have to continue to comply, though. Frankly, they aren’t that large of a company, and they are just being aggressive because they believe you will let them have their way.\n\nThere are actually protections for you if they try to file a lawsuit to bully you. Talk to a lawyer. Plenty of companies play these types of games instead of making better products. This is how you know you made something good. They are afraid of you and your “little open source project”.",
                  "score": 4,
                  "created_utc": "2026-02-22 18:10:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6rr5ut",
          "author": "Maskdask",
          "text": "~~Unfair~~ competition",
          "score": 30,
          "created_utc": "2026-02-22 13:50:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ruyx3",
          "author": "PapyOak",
          "text": "I'd download your software and advertise for you just to take the piss at them, and I don't even have a drone",
          "score": 30,
          "created_utc": "2026-02-22 14:12:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rwn0l",
              "author": "funyflyer",
              "text": "Haha classic!",
              "score": 6,
              "created_utc": "2026-02-22 14:21:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6tm2s8",
          "author": "DrPiwi",
          "text": "to use your automated download tool?  The user still needs to pay the subscription and the $15 retrieval fee?  \nYour tool does not bypass that and only provides a convenient way to automate the download?  \nThen they have no leg to stand on. \nThe logging data is by definition owned by the user, you can always do what you want with your own data. \nUsing a tool that automates the clicking and selecting is not illegal. If I where you I'd put the tool back on github to avoid being denied your rights by giving in to what is clearly a fishing expedition.\n",
          "score": 9,
          "created_utc": "2026-02-22 19:09:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tmtxk",
              "author": "funyflyer",
              "text": "You are right, it just saves users the manual one by one download, automates that part so you can grab them in bulk, I don't interfere or know how to interfere with their cloud system and my method DO NOT bypass any paywall, users still need to pay, but they are afraid that people will pay once, take their data out and move to my software, they were very critical on the downloader part. The deserve to be screwed over for holding peoples data hostage and offering no single bulk takeout solution. ",
              "score": 7,
              "created_utc": "2026-02-22 19:13:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6uxlns",
                  "author": "ghostsquad4",
                  "text": "Yep, they are afraid of the truth, and of competition. That fear is driven by what they already know is true about themselves, they are scamming customers by keeping their data hostage.",
                  "score": 2,
                  "created_utc": "2026-02-22 23:12:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6sbjmt",
          "author": "Turkino",
          "text": "I also have never really gotten into the high-end drone market, at least nothing that would generate a log, but I'm starring and downloading this now just on principle.",
          "score": 8,
          "created_utc": "2026-02-22 15:38:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6scno4",
              "author": "funyflyer",
              "text": "I can provide some sample files if you want to play on the web app or downloaded application ",
              "score": 2,
              "created_utc": "2026-02-22 15:43:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6skak8",
          "author": "semiquaver",
          "text": "Contact the Electronic Frontier Foundation, I can all but guarantee they would be willing to represent you.",
          "score": 12,
          "created_utc": "2026-02-22 16:16:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6u236s",
          "author": "PurpleYoshiEgg",
          "text": "Lawyer the fuck up immediately.  Don't bend to their will without doing that.",
          "score": 3,
          "created_utc": "2026-02-22 20:29:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tkpu8",
          "author": "XB_Demon1337",
          "text": "So, of course I am no lawyer. \n\n**1. The comparisons and the company name on the website**\n\n[https://en.wikipedia.org/wiki/Nominative\\_use](https://en.wikipedia.org/wiki/Nominative_use)\n\nThis directly makes you able to make the comparisons to their product using their logo/name. You can only use their logo if it is the only way to convey who they are. So like Walmart you can't exactly use their logo on your website. If this is who I think it is, then you can use their name without issues. As a note, while you certainly should be honest about your comparisons. You don't have to comply to their will. If you don't want to post the Free Tier comparison you don't have to. But it wouldn't be a bad idea to do it either. Personally I would stiff it to them and not post the Free Tier. \n\nAlso note that this lets you still use the tag line \"The Free open-source \\[Company A\\] Alternative,\" so long as you don't use their logo or font.\n\nMe, I put all the details back and replace logos with names. Email the lawyer back and cite this. They SHOULD back off. \n\n**------------------------------**\n\n**2. The automated download tool**\n\nThis is something that so many companies hate when you do. But it doesn't violate laws directly. It may violate their ToS, but no laws. They did this to strong arm you. I do not actually see anything in their ToS that shows you violated anything. Their Robots.txt does say they don't allow them though. All this to say though, it depends on how you are downloading these things. If you are using links to download but you have to scrape the page to do so then it sits in a grey area. That grey area is able to be litigated. \n\nI can't say how the website is setup but I can say that if they provide links to them and you are simply using those links without scraping then your tool is fine. This would be like clicking the download button on a bunch of pages at one time. While not using some bot to parse all of the data at one time. \n\nI can understand if you don't continue this specific tool, but if you do it in a way that isn't scraping their login-based pages, then you should be fine.\n\n**------------------------------**\n\nOf course, they can always still try to sue you for literally anything. Personally the #1 part shouldn't be a problem. You have legal recourse and if they try to strong arm you then you can easily get a lawyer and then get fees back from them. The #2 is where you have to determine some legality. Never assume their lawyer is going to tell you the truth and never assume they are going to get to a point where they are going to accept your website existing. They will lie and beat you down until you feel the project can no longer continue. They are rats at best and at worst criminals. \n\nAlso, I would HIGHLY suggest getting a lawyer too. They will be able to fight harder than you can as they have a better understanding. ",
          "score": 3,
          "created_utc": "2026-02-22 19:03:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rnqba",
          "author": "P1r4nha",
          "text": "You messed up because you presented a simple circumvention tool as direct competition to a company's work and business model while using their trademark.\n\nThis is often an issue for open source tools that are customer-first rather than putting simple ease of use features behind a paywall.\n\nDepending on jurisdiction you may still violate non circumvention clauses or agreements. Just host your project where circumvention is legally protected like fair use, repairability and the like. Without using trademark and not letting a doubt that this is a free, customer-first tool that is not a competition but provides additional features to users of these drones.",
          "score": 8,
          "created_utc": "2026-02-22 13:29:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tm4o1",
              "author": "XB_Demon1337",
              "text": "Circumvention would imply that OP made a tool to get around their paid tier. That isn't what OP made. OP made a tool that provides the same service as the company complaining. This is direct competition. It is no different than Google Email vs Yahoo Email. They do the same thing. The thing OP MIGHT have messed up on is the ability to download the logs. Depending on how this is done it could be perfectly legal and nothing they can do. Or it could be a big deal and have to be reworked. ",
              "score": 3,
              "created_utc": "2026-02-22 19:09:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6utwsd",
          "author": "gdmzhlzhiv",
          "text": "Define “unfair competition”… to me that just reads like “capitalism working as designed”.",
          "score": 2,
          "created_utc": "2026-02-22 22:52:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6uvo8y",
              "author": "funyflyer",
              "text": "I did not like the tone, but of course it's a legal document, so they want to be scary!",
              "score": 1,
              "created_utc": "2026-02-22 23:02:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6uxfxk",
          "author": "plazman30",
          "text": "Maybe you should reach out to the EFF and see if they'll take the case.",
          "score": 2,
          "created_utc": "2026-02-22 23:12:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wjzdw",
          "author": "sutcher",
          "text": "This is fascinating. Thanks for sharing. I think this is going to be more and more common",
          "score": 2,
          "created_utc": "2026-02-23 05:17:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x55bq",
          "author": "xnfra",
          "text": "It’s not illegal to mention their business name. They are so soft.",
          "score": 2,
          "created_utc": "2026-02-23 08:25:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xg3aa",
          "author": "Thomas-B-Anderson",
          "text": "Lol I wasn't aware of your project until the Monopoly-corp fucked up and attacked you. Guess I'll be using your alternative from now on! I have a friend who does surveying with drones who I'll recommend your project to as well. Welcome to the Streisand effect!",
          "score": 2,
          "created_utc": "2026-02-23 10:12:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xh4gm",
              "author": "funyflyer",
              "text": "Thank you so much! I was scared at first but now I am confident about the impact of my project. ",
              "score": 1,
              "created_utc": "2026-02-23 10:22:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ypmxq",
          "author": "Inaksa",
          "text": "I can’t help but consider the CEO apology is nothing but a disaster containment measure. If he is truly then why couldn’t he stop earlier (before the letter was sent) his company attempt to shut you down? It means he does not control his own company?\n\nAnd the other thing a company blocking a script that downloads YOUR data is a pos company.",
          "score": 2,
          "created_utc": "2026-02-23 15:21:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ytmtr",
              "author": "funyflyer",
              "text": "For the how the downloader script works - here is the flow. \n\nUses legitimate authentication - You must manually log in with your real credentials on company A's actual website (loads [company-a.com](http://company-a.com) in an embeded browser)\n\nReuses your valid session - It simply captures cookies from your authenticated session (same as what ANY browser does)\n\nCalls official API endpoints - The endpoints are the same internal APIs that A's web interface uses (same as ANY website does)\n\nNo CAPTCHA circumvention - If company A shows a CAPTCHA during login, you'd have to complete it manually in the embedded browser (SAME as ANY website)\n\nMore clarity for you.",
              "score": 1,
              "created_utc": "2026-02-23 15:40:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o70txhj",
          "author": "Anubis_16",
          "text": "Just jumping in to say thank you for your work. I am not even remotely in drones or anything but saw this thread and searched further because of it. I too downloaded the app and also pulled the main from GitHub as a zip just to have it saved. \n\nIf you can, please try to send this info to Louis Rosmann and his team, they are awesome in advocating for us consumers and call out companies on their shitty behaviour and also probably could provide assistance in this matter.",
          "score": 2,
          "created_utc": "2026-02-23 21:20:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73cmti",
              "author": "funyflyer",
              "text": "Thank you so much, I am amazed by the community support. I sent him an email to the youtube address.",
              "score": 1,
              "created_utc": "2026-02-24 06:20:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o731yt5",
          "author": "rockandrolla66",
          "text": "\"They claimed was illegally driving their traffic to my site\", I'm sorry but this doesn't stand any chance on a court of law. ",
          "score": 2,
          "created_utc": "2026-02-24 04:56:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o788wgk",
          "author": "malalabouche",
          "text": "[Company A] sounds like the kind of business Claude Code will soon put out of business.",
          "score": 2,
          "created_utc": "2026-02-24 23:17:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rljnz",
          "author": "OkSpirit3216",
          "text": "Can you point to the repo?",
          "score": 3,
          "created_utc": "2026-02-22 13:15:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rml2f",
              "author": "funyflyer",
              "text": "It's on the linked site : [https://github.com/arpanghosh8453/drone-logbook](https://github.com/arpanghosh8453/drone-logbook)",
              "score": 16,
              "created_utc": "2026-02-22 13:22:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6rplz9",
                  "author": "AccomplishedLine4909",
                  "text": "Thank you.",
                  "score": 5,
                  "created_utc": "2026-02-22 13:41:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6xr8mu",
                  "author": "ScaredyCatUK",
                  "text": "Just gonna clone that to my own gitea before it vanishes... ",
                  "score": 1,
                  "created_utc": "2026-02-23 11:53:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6rsco7",
                  "author": "unitedbsd",
                  "text": "Good work.",
                  "score": 1,
                  "created_utc": "2026-02-22 13:57:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6uv8d6",
          "author": "Rattus_NorvegicUwUs",
          "text": "Someone is mad their boss will realize they are overpaid…",
          "score": 3,
          "created_utc": "2026-02-22 22:59:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v1zik",
          "author": "Doctorphate",
          "text": "Tell them to go fuck themselves",
          "score": 2,
          "created_utc": "2026-02-22 23:37:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tk6j2",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-02-22 19:00:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tl2vt",
              "author": "funyflyer",
              "text": "It was not DJI though, some US based company. ",
              "score": 1,
              "created_utc": "2026-02-22 19:04:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6tmd6v",
                  "author": "TeutonJon78",
                  "text": "From other comments i thought it was DJI. Removed the comment.",
                  "score": 1,
                  "created_utc": "2026-02-22 19:10:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6tl6n4",
          "author": "Psychological-Leg413",
          "text": "I think the script automating bulk download is gonna be the crux here..",
          "score": 1,
          "created_utc": "2026-02-22 19:05:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6vyxrn",
              "author": "Due-Equivalent-9738",
              "text": "Not a lawyer but I don’t see how it could be an issue. Using it may be a TOS violation, but the script is doing it on behalf of a paying user with the paying user’s consent. It’s no different from the user individually downloading each file. If they want to prevent that, they need to have rate limits at the API level rather than in the UI.",
              "score": 2,
              "created_utc": "2026-02-23 02:52:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6tpd5u",
          "author": "r-pics-sux",
          "text": "Ahh man, cant wait to use this with my fpv drone!",
          "score": 1,
          "created_utc": "2026-02-22 19:25:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tv3k2",
          "author": "bullmeza",
          "text": "Damn, is this all resolved now? Can they still pursue you?",
          "score": 1,
          "created_utc": "2026-02-22 19:54:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6us9fq",
          "author": "doodeoo",
          "text": "The question is not \"will I win in court,\" it's \"what do I need to do to make sure I never go to court with a large company over a solo developed non-monetized open source project\"",
          "score": 1,
          "created_utc": "2026-02-22 22:43:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6uvgvz",
              "author": "funyflyer",
              "text": "Well said, I am quoting you to my brother now :)\n\n",
              "score": 3,
              "created_utc": "2026-02-22 23:01:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6uv06j",
          "author": "Arthemio2",
          "text": "https://plot.ardupilot.org/#/ for binaries... Or use plotjuggler with .ulog files... Everything is already there as opensource solutions in the drone space. If hosting is needed it is also very easy to setup yourself.",
          "score": 1,
          "created_utc": "2026-02-22 22:58:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6uw4tb",
              "author": "funyflyer",
              "text": "The problem is with ongoing development, I need an automated CI/CD pipeline for the builds. ",
              "score": 1,
              "created_utc": "2026-02-22 23:04:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6w0ag6",
          "author": "ivosaurus",
          "text": "The only thing possibly infringing is your exfill tool allowing a user to access their servers in possibly a non-authorised manner, against signed T&Cs.\n\nOtherwise the entirety of that is just designed to remove as much advertising as possible from your own sources so you aren't as much of a problem to their revenue stream. You're allowed to represent facts, and companies aren't allowed to unilaterally silence any member of public who mentions their name. They would like to pretend to you that they can though. \n\nIt is NOT irony if they spend thousands once now, but it has saved them thousands more in kept customer fees over the next next few months compared to if they hadn't scared you off so easily.",
          "score": 1,
          "created_utc": "2026-02-23 03:00:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wuhif",
          "author": "Conscious_Nobody9571",
          "text": "If i was you, i wouldn't have replied to them, and i wouldn't meet with them... Let them seethe",
          "score": 1,
          "created_utc": "2026-02-23 06:45:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x42xf",
              "author": "funyflyer",
              "text": "I just want to bring fairness to the system, nothing else. All I did is provide a tool with which the users can download their own data in bulk (a service they don't provide intentionally). I don't bypass any payment or anything else, just download the same files the user could do by clicking the links one by one and get annoyed and wait for each download to finish.  It's the users data and they should be able to get it if they wish so, permitted by their payment structure. ",
              "score": 1,
              "created_utc": "2026-02-23 08:14:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6xgmqm",
                  "author": "Conscious_Nobody9571",
                  "text": "I don't think you understand... They want to make you pay somehow",
                  "score": 1,
                  "created_utc": "2026-02-23 10:18:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6x50tm",
          "author": "xnfra",
          "text": "Tell them to kick rocks and to make a better product because a one man army replaced their rent seeking business plan. Tell them “adapt or die”.",
          "score": 1,
          "created_utc": "2026-02-23 08:24:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x5jqy",
              "author": "funyflyer",
              "text": "Sounds true to me, I am a single individual, and it's in development for only a month, and they are feeling \"unfair competition\"? ",
              "score": 1,
              "created_utc": "2026-02-23 08:29:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xfsus",
          "author": "Thomas-B-Anderson",
          "text": "Just starred your project on GitHub, fuck the monopoly.  They take take take existing open source work and build they business on it, but they don't have any appreciation for FOSS.",
          "score": 1,
          "created_utc": "2026-02-23 10:10:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xgyuu",
              "author": "funyflyer",
              "text": "Well, i made the license AGPLV3, no funny business like that. ",
              "score": 2,
              "created_utc": "2026-02-23 10:21:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xiozi",
          "author": "idlethread-",
          "text": "Forked the repo. They can't shut you down now.\n\nBut replace their name with 'Commercial entity A' to avoid trademark related litigation.",
          "score": 1,
          "created_utc": "2026-02-23 10:37:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xkuz9",
              "author": "funyflyer",
              "text": "The exporter repo in question that lets you bulk download their data to move into any other platform of choice has been taken offline, we are trying to negotiate with the company with best intention for the entire drone community. ",
              "score": 1,
              "created_utc": "2026-02-23 10:57:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xovjd",
          "author": "nickcald",
          "text": "Not a lawyer, but I think the bulk download /migration tool is going to cause you problems legally. Can you connect to the drones directly to get the data?",
          "score": 1,
          "created_utc": "2026-02-23 11:34:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6y6qwi",
          "author": "AnonomousWolf",
          "text": "Fuck any company that locks software behind a subscription.\n\nKeep up the good fight",
          "score": 1,
          "created_utc": "2026-02-23 13:39:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zpyi9",
          "author": "BAbeast1993",
          "text": "The CEO realized it might be better to go with the carrot instead of the stick. They'll probably try to buy you out.",
          "score": 1,
          "created_utc": "2026-02-23 18:11:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zqj45",
          "author": "vnagornyy",
          "text": "Something different to consider, it might be worth assigning copyright to FSF to protect it. \n\nIf I'm not mistaken, by assigning copyright, the FSF becomes the entity that would have to be sued or challenged regarding the software's right to exist, rather than you personally. Might want to reach out to FSF for more info, how they can help.\n\nhttps://www.fsf.org/bulletin/2022/fall/copyright-assignment-with-the-fsf",
          "score": 1,
          "created_utc": "2026-02-23 18:13:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zvtuo",
          "author": "Alarming_Bluebird648",
          "text": "Sending a legal document before attempting a direct conversation is a classic intimidation tactic, regardless of the CEO's tone after the fact. It's doubtful they would have reached out with an apology if the community hadn't rallied around the project first.",
          "score": 1,
          "created_utc": "2026-02-23 18:37:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o702a2p",
              "author": "funyflyer",
              "text": "Clearly it's a way to damage control, but at least they are willing to communicate and respond. ",
              "score": 1,
              "created_utc": "2026-02-23 19:06:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72sv2y",
          "author": "Garland_Key",
          "text": "What license was the code under? It would be a shame if other users mirrored said free and open source code... Did it have any forks? ",
          "score": 1,
          "created_utc": "2026-02-24 03:53:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73dahd",
              "author": "funyflyer",
              "text": "Only one when I had to take it down 😕 and BSD 3 clause",
              "score": 1,
              "created_utc": "2026-02-24 06:25:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o74qt3r",
          "author": "Ascending_Valley",
          "text": "Be wary of nice tone now. They fear amplification and bad publicity. Use that however you choose, but keep trust eval low.",
          "score": 1,
          "created_utc": "2026-02-24 13:21:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77pc2v",
          "author": "IGIVEDOGSANALSEX",
          "text": "u/funyflyer, what you’re doing is great! Anything letting people take back what is there’s is a good thing in my book. I heavily recommend you reach out to the Rossman group. Louis Rossman is a legend, and this type of stuff is exactly what he’s advocating for, and trying to make better for everyone. This seems like something he’d definitely be on the side of.",
          "score": 1,
          "created_utc": "2026-02-24 21:40:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7841dw",
              "author": "funyflyer",
              "text": "I reached out to him via email and discord, did not get any response yet, but I am hopeful.",
              "score": 1,
              "created_utc": "2026-02-24 22:51:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o78cglk",
                  "author": "IGIVEDOGSANALSEX",
                  "text": "I also sent him an email and included this thread! I hope he gets back to you!",
                  "score": 1,
                  "created_utc": "2026-02-24 23:36:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6uxahw",
          "author": "ghostsquad4",
          "text": "Fuck capitalism.",
          "score": 1,
          "created_utc": "2026-02-22 23:11:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6w3hwd",
              "author": "South-Steak-7810",
              "text": "Sanpō Yoshi (still capitalism) is the way.\nAnd I’d personally would like to add ‘good for nature’ to the initial three.",
              "score": 0,
              "created_utc": "2026-02-23 03:21:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6uwlds",
          "author": "susimposter6969",
          "text": "Since you're still hitting their endpoints they probably also consider it unauthorized use",
          "score": 1,
          "created_utc": "2026-02-22 23:07:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6uwrug",
              "author": "funyflyer",
              "text": "All I did is provide a tool with which the users can download their own data in bulk (a service they don't provide intentionally). I don't bypass any payment or anything else, just download the same files the user could do by clicking the links one by one and get annoyed and wait for each download to finish.  It's the users data and they should be able to get it if they wish so, permitted by their payment structure. I don't hit their endpoints, a user with their own data does to get back their data, how is that unfair?",
              "score": 2,
              "created_utc": "2026-02-22 23:08:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6v4sdy",
                  "author": "susimposter6969",
                  "text": "Are you using something like playwright or are you making API calls on behalf of the user",
                  "score": 1,
                  "created_utc": "2026-02-22 23:53:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6snzzp",
          "author": "DKurtel",
          "text": "RemindMe! 2day",
          "score": -1,
          "created_utc": "2026-02-22 16:33:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6so6op",
              "author": "RemindMeBot",
              "text": "I will be messaging you in 2 days on [**2026-02-24 16:33:08 UTC**](http://www.wolframalpha.com/input/?i=2026-02-24%2016:33:08%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/opensource/comments/1rbkzwe/large_us_company_came_after_me_for_releasing_a/o6snzzp/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fopensource%2Fcomments%2F1rbkzwe%2Flarge_us_company_came_after_me_for_releasing_a%2Fo6snzzp%2F%5D%0A%0ARemindMe%21%202026-02-24%2016%3A33%3A08%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201rbkzwe)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "score": -1,
              "created_utc": "2026-02-22 16:33:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1ralqrl",
      "title": "Google's sideloading lockdown is coming September 2026, here's how to push back",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1ralqrl/googles_sideloading_lockdown_is_coming_september/",
      "author": "funkvay",
      "created_utc": "2026-02-21 08:16:47",
      "score": 1143,
      "num_comments": 109,
      "upvote_ratio": 0.98,
      "text": "So in case you missed it, Google is requiring every app developer to register with them, pay a fee, hand over government ID, and upload their signing keys just so their app can be installed on your phone. Even apps that have nothing to do with the Play Store. This starts September 2026.\n\nF-Droid apps, random useful tools from GitHub, a student testing their own app on their own damn phone, all of that gets blocked unless the developer goes through Google first. And they keep saying \"sideloading isn't going away\" while their own official page literally says all apps from unverified developers will be blocked on certified devices. That's every phone running Google services so basically every Android phone out there.\n\nAnd the best part is that the Play Store is already full of scam apps and malware that passes right through their \"verification\". But sure, let's punish indie devs and hobbyists instead.\n\nThe keepandroidopen.org project lays out the full picture and has actual steps you can take, filling out Google's own feedback survey, contacting regulators, etc. If you don't trust random links just search \"Keep Android Open\" and you'll find it.\n\nSeriously, if you care about this at all, now is the time to make noise about it before it's too late.\n\n-------\n\n**Update!**\nSome fair corrections from the comments. To be precise, Google has stated in their FAQ that they are building an \"advanced flow\" that will allow experienced users to install unverified apps after going through a series of warnings. So it's not a total block with zero options.\n\nThat said, two things worth noting. First, the FAQ and the official policy page are not the same thing. The policy page still states, without any exceptions or asterisks, that all apps must be from verified developers to be installed on certified devices. The advanced flow is mentioned only in the FAQ section, and described as something they are \"building\" and \"gathering feedback on\". These two pages currently contradict each other, and we don't know which one reflects the final reality.\n\nSecond one is that we have no idea what \"high-friction flow\" actually means in practice. It could be two extra taps. It could be something so buried and discouraging that most people give up. Google themselves describe it as designed to \"resist\" user action. Until someone can actually test it, we're trusting a description.\n\nF-Droid's concern (and the reason I made this post) isn't that their apps will be technically impossible to install. It's that their developers are anonymous volunteers who won't register with Google, their apps will be labeled as \"unverified\", and over time the ecosystem slowly dies from friction and lost trust. F-Droid themselves said this could end their project. These are not my words, this is what the F-Droid team itself thinks.\n\nPressure is what got Google to announce the bypass in the first place. Therefore, we must not stop and make sure that the market is not completely captured by them alone",
      "is_original_content": false,
      "link_flair_text": "Community",
      "permalink": "https://reddit.com/r/opensource/comments/1ralqrl/googles_sideloading_lockdown_is_coming_september/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o6knkri",
          "author": "YAOMTC",
          "text": "https://keepandroidopen.org\n\nIf you want a clickable link for low friction, gotta either add the https:// or the [markdown](https://support.reddithelp.com/hc/en-us/articles/360043033952-Formatting-Guide)",
          "score": 189,
          "created_utc": "2026-02-21 08:53:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6konlv",
              "author": "funkvay",
              "text": "Didn't want my post to get banned",
              "score": 38,
              "created_utc": "2026-02-21 09:04:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6ruhq1",
                  "author": "lukaszpi",
                  "text": "for what?",
                  "score": 1,
                  "created_utc": "2026-02-22 14:09:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6quzx8",
              "author": "AnduriII",
              "text": "Here my message to the switzerland relevant entity:\n\n```\nGuten Tag\n\nich möchte Sie auf eine geplante Änderung in Googles Android-Betriebssystem aufmerksam machen, die aus meiner Sicht eine erhebliche Einschränkung des freien Wettbewerbs und eine Missachtung der Wahlfreiheit von Konsumenten darstellt.\nSachverhalt:\nGoogle plant (voraussichtlich ab September 2026), die Installation von Anwendungen, die nicht über den offiziellen Google Play Store bezogen werden (sog. „Sideloading“), massiv zu erschweren. Entwickler sollen dazu verpflichtet werden, sich mit amtlichen Dokumenten bei Google zu registrieren und Gebühren zu entrichten, damit ihre Apps auf zertifizierten Android-Geräten überhaupt lauffähig sind – selbst wenn diese Apps nicht im Play Store angeboten werden.\n\nWettbewerbsrelevante Problematik:\nMarkteintrittsbarrieren für unabhängige Akteure: Durch die Registrierungspflicht und die damit verbundenen Hürden werden insbesondere Open-Source-Projekte (wie F-Droid), Hobby-Entwickler und kleinere Unternehmen benachteiligt. Diese Akteure bieten oft innovative Nischenprodukte an, die im direkten Wettbewerb zu Googles eigenen Diensten stehen könnten.\n\nErzwungene Zentralisierung: \nIndem Google sich als „Gatekeeper“ für alle auf der Hardware installierbaren Programme positioniert, hebelt das Unternehmen die Offenheit des Android-Systems aus. Dies führt zu einer Monopolstellung bei der Software-Verteilung.\n\nAbschreckung durch „High-Friction-Flows“: \nZwar stellt Google einen „erweiterten Pfad“ für erfahrene Nutzer in Aussicht, beschreibt diesen jedoch selbst als einen Prozess, der „Nutzeraktionen widerstehen“ soll. Solche künstlichen Hürden (Dark Patterns) dienen dazu, Nutzer in Googles eigenem Ökosystem zu halten und Drittanbieter-Marktplätze sowie direkte Downloads wirtschaftlich unattraktiv zu machen.\n\nGefährdung der Privatsphäre und Anonymität: \nDie Pflicht zur Preisgabe von Regierungs-IDs gegenüber einem privaten US-Unternehmen für die blosse Bereitstellung von Software ist unverhältnismässig und schliesst anonyme, gemeinnützige Entwicklungsgemeinschaften faktisch aus.\n\nIn einer digitalisierten Schweiz ist es essenziell, dass Endgeräte neutral bleiben und der Zugang zum Markt für Software-Entwickler nicht von den Bedingungen eines einzelnen Plattformbetreibers abhängt.\n\nIch bitte Sie daher, diese Entwicklungen im Rahmen Ihrer Marktbeobachtung zu prüfen und zu untersuchen, ob hier ein Missbrauch einer marktbeherrschenden Stellung gemäss Kartellgesetz vorliegt.\n\nFür Rückfragen stehe ich Ihnen gerne zur Verfügung.\nFreundliche Grüsse\n```",
              "score": 8,
              "created_utc": "2026-02-22 09:23:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6r7epu",
              "author": "Shoddy-Childhood-511",
              "text": "What does \"Uploading evidence of the developer’s private signing key\"?\n\nIt's some proof-of-possession aka a signature on something?  If so, that's fine.  If it's the private key itself, then that's fucking evil.\n\nAlso, there is already a higher friection flow where you must approve apps that install apps, including the browser that downloads f-droid.  There are improvements they could make here:  Graphene removes unused permissions from apps, so the browser looses the install apps permissions.\n\nIf they add a seperate tighter permission level, the there are other permission that really should be locked down equally tightly, like the system settings and preferences ones, all files access, and even wifi control, since it leaks location data.",
              "score": 2,
              "created_utc": "2026-02-22 11:21:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o799vgl",
              "author": "c0nfluks",
              "text": "Where do i sign the petition",
              "score": 1,
              "created_utc": "2026-02-25 02:42:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o79pq2x",
                  "author": "YAOMTC",
                  "text": "Go to the site, scroll down to find your country, and follow the link(s) provided there",
                  "score": 1,
                  "created_utc": "2026-02-25 04:16:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6kpc21",
          "author": "_MrBond_",
          "text": "I wish Android could branch off and have an open source alternative. I am done with Google and Android.",
          "score": 136,
          "created_utc": "2026-02-21 09:11:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l74p2",
              "author": "Lochlan",
              "text": "Seen GrapheneOS?",
              "score": 31,
              "created_utc": "2026-02-21 12:01:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6lwhwt",
                  "author": "TripolarKnight",
                  "text": "Does really fit the \"I am done with Google and Android\" criteria if your only option locks you down to Google-hardware.",
                  "score": 47,
                  "created_utc": "2026-02-21 14:52:52",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6lals2",
                  "author": "_MrBond_",
                  "text": "Yes! But device makers with locked Bootloader won't support that and not every device has it. 😔",
                  "score": 4,
                  "created_utc": "2026-02-21 12:30:45",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6lacbg",
                  "author": "_MrBond_",
                  "text": "Yes and I have heard a lot of the issues surrounding it as well. Android device makers should support these after market options or allow us to choose easily.\n\nI am currently using LineageOS on my older sony device.",
                  "score": -1,
                  "created_utc": "2026-02-21 12:28:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6l4hkz",
              "author": "definite_d",
              "text": "You're not gonna believe this...",
              "score": 32,
              "created_utc": "2026-02-21 11:38:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6l5r04",
                  "author": "make-j8",
                  "text": "And you're not going to believe that some apps work exclusively on Google branded android releases. Banks, some governmental apps and even some utilities providers don't work at all if you install a non Google managed release.",
                  "score": 35,
                  "created_utc": "2026-02-21 11:49:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6ptzuj",
              "author": "ZombieJesus9001",
              "text": "PostmarketOS, start learning to code and contribute.",
              "score": 2,
              "created_utc": "2026-02-22 04:02:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6q3dng",
                  "author": "_MrBond_",
                  "text": "No\nThere are enough unemployed coders",
                  "score": 3,
                  "created_utc": "2026-02-22 05:11:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6vzn26",
              "author": "kotobuki09",
              "text": "The problem here is that the phone is now in lockdown. They don't let you unlock the bootloader, then they force you to use their shit ecosystem, and there is no, but how can it be installed in mass market devices?, but how can it be installed on mass-market devices? way out of it. GrapheneOS is good but how can install it in mass market devices.",
              "score": 2,
              "created_utc": "2026-02-23 02:56:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6z5cmc",
              "author": "whitepawn23",
              "text": "GrapheneOS",
              "score": 0,
              "created_utc": "2026-02-23 16:35:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6mhce3",
          "author": "Alarming_Bluebird648",
          "text": "The requirement to surrender private signing keys is a direct assault on the security model of verified builds. It creates a massive central point of failure that bypasses a developer's control over their own code's integrity.",
          "score": 25,
          "created_utc": "2026-02-21 16:39:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tglgg",
              "author": "blueg3",
              "text": "You don't give them the private half of your signing key.",
              "score": 1,
              "created_utc": "2026-02-22 18:43:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6l26j1",
          "author": "UnluckyAdministrator",
          "text": "That's some insane gatekeeping, I thought Apple were worse for this.\n\nHow are app devs meant to test things and get their apps out there?\n\nI suppose local .apk files can still be loaded and tested with android settings changes, but this is a diabolical turn of events.\n\nThe entire industry needs to start looking into decentralised application systems across board, as I suspect with the rise of agentic AI, we're going to see more of this gatekeeping tactics from centralized players.",
          "score": 26,
          "created_utc": "2026-02-21 11:17:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tgu38",
              "author": "blueg3",
              "text": "The app development / local testing flow uses adb, which still will be able to install APKs, so there shouldn't be any change there.",
              "score": 1,
              "created_utc": "2026-02-22 18:44:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6knsms",
          "author": "AdministrativeProof2",
          "text": "Not to be defeatist, but when both google and the regulators are in full lockstep in killing privacy and enforcing EIDs, there's little you can accomplish through filling out forms or making noise. this isn't the 2010's when internet outrage still had an ounce of effect on lawmakers and large corporations, we're way past that.\n\nAt some point the only choice becomes to ditch google altogether, and find an alternative for yourself while the inevitable plays out.",
          "score": 55,
          "created_utc": "2026-02-21 08:55:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6koyij",
              "author": "funkvay",
              "text": "The EID stuff is a whole separate nightmare.But I think you're mixing up two things. Some regulators are pushing for more control. But other regulators are actively going after Big Tech monopolies right now, the EU literally just forced Apple to open up sideloading and fined Google billions multiple times. Those aren't the same people pushing EIDs. The regulatory landscape isn't one monolith, there's people inside those systems who actually want to limit corporate power and they need ammunition to do it. Our complaints are that ammunition.\n\n> ditch Google and find alternatives\n\nyeah, but what alternatives? You said it yourself. GrapheneOS is limiting, Linux phones aren't daily driver ready, and if we all just quietly migrate to workarounds while the mainstream platform locks down, that's 3 billion people who lose the option entirely. The people who can't or won't run a custom ROM, our parents, our friends, normal people. They just get locked in.\n\nI'm not saying filling out a form is gonna save the world. But the \"nothing works anymore just adapt\" mindset is exactly what companies like Google are counting on. The whole strategy is to make you feel like resistance is pointless so you stop trying. That's literally how corporate PR works with exhaust people into compliance.\n\nEven if the chances are small, five minutes is five minutes. I'd rather waste them trying than spend zero minutes accepting it and living with it my whole life",
              "score": 38,
              "created_utc": "2026-02-21 09:07:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6n44mg",
                  "author": "zeno0771",
                  "text": "TL;DR \n#\"Oh well\" is not a valid problem-solving methodology.\n\n> the \"nothing works anymore just adapt\" mindset is exactly what companies like Google are counting on.\n\nAnd why wouldn't they?  After all, it's worked since before Microslop's IE antitrust case:  Users take the path of least resistance because technology moves faster than society at large.\n\n1. Discover new thing: \"Wow this is amazing\"\n2. Learn more about new thing: \"Didn't know it could do that too\"\n3. Word gets out about shadyThing() that techCorp() is doing: \"Are they allowed to do that?\"\n4. shadyThing() becomes pervasive and workarounds become increasingly problematic: \"That's a lot of work; why do we have to worry about this?\"\n5. Regulators do nothing (or find a way to leverage it for themselves): \"They're going to get my {info,data,search-history} anyway, why fight it?\"\n\nLather-rinse-repeat while techCorp() learns where their liabilities are and fine-tunes the process, making it more difficult to defeat or compete.  Yes, they have the advantage of money and power but, as a famous poet once said, \"They've got the guns but we've got the numbers.\"",
                  "score": 8,
                  "created_utc": "2026-02-21 18:33:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6kny9d",
          "author": "BugBuddy",
          "text": "Might as well get a dumb phone now. Why bother.",
          "score": 31,
          "created_utc": "2026-02-21 08:57:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lknek",
              "author": "Marble_Wraith",
              "text": "Because dumb phones can't use encrypted protocols.\n\nIt's actually a downgrade to be able to snatch your messages right out of the air.",
              "score": 14,
              "created_utc": "2026-02-21 13:42:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6lobt4",
                  "author": "BugBuddy",
                  "text": "Apply the same methods used in landline times. Security starts with the individual.",
                  "score": 4,
                  "created_utc": "2026-02-21 14:04:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6kpvfr",
              "author": "lppedd",
              "text": "I'm all for going back to Nokia's 3000 series.",
              "score": 3,
              "created_utc": "2026-02-21 09:16:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ler31",
          "author": "Stuccio_N1",
          "text": "Now it's time for a REAL Linux mobile distro to kick in and get supported.\n\nJust to be clear, I know android is basically a sort of branch off Linux distro already and that mobile distros already exist. What I mean is that we need common use apps on such distros and for them to be easily installable on devices like on PC.",
          "score": 17,
          "created_utc": "2026-02-21 13:02:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o70beac",
              "author": "Mr_Simplex",
              "text": "This is why not too long ago I switched to one of the Linux phones by 'FuriLabs'. It's far from perfect, but so far I've been able to manage any major issues. Honestly feels great to support a company who is trying to do something new and free ",
              "score": 2,
              "created_utc": "2026-02-23 19:49:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o75ahky",
              "author": "DeVinke_",
              "text": "That's not really possible. No UEFI, you have to rely on device trees for detecting hardware. Getting mainline linux to work on smartphones is already near impossible.\n\nBesides, it's not like that's going to be any better than any aosp-based custom rom. Bank & government apps won't run because it's \"insecure\", but there will be even fewer people developing and maintaining their apps for it.\n\nIt wouldn't solve anything imho.",
              "score": 0,
              "created_utc": "2026-02-24 15:05:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6l5ldq",
          "author": "g0dSamnit",
          "text": "Hey Valve... Steam Phone pls? 👉 👈 ",
          "score": 26,
          "created_utc": "2026-02-21 11:48:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6l4rao",
          "author": "kotobuki09",
          "text": "Don't be evil lol",
          "score": 11,
          "created_utc": "2026-02-21 11:40:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qlbuh",
              "author": "Ok-Sugar-5649",
              "text": "Well... they did scrub that line out",
              "score": 3,
              "created_utc": "2026-02-22 07:50:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6lkwqc",
          "author": "Marble_Wraith",
          "text": "The gist should be:\n\nIf android isn't going to keep maximal freedom.\n\nMy next phone will be an iPhone instead, since it does the same thing only better.",
          "score": 12,
          "created_utc": "2026-02-21 13:43:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rjp0o",
              "author": "kane_1371",
              "text": "Lol you will be surprised how not true that is",
              "score": 3,
              "created_utc": "2026-02-22 13:02:45",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6rz6v0",
              "author": "rxt0_",
              "text": "good luck lol.\nsure a lot of stuff is similar but they definitely don't do stuff better, at least not everything",
              "score": 1,
              "created_utc": "2026-02-22 14:35:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ktkoq",
          "author": "gonzarom",
          "text": "La mejor manera de oponerse sería comprar un telefono móvil Linux, si hacen esto.",
          "score": 7,
          "created_utc": "2026-02-21 09:53:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l3cxi",
              "author": "phetea",
              "text": "They never really took off, this could cause the cogs to start turning as there'll be a relatively larger demand but these things take time...",
              "score": 7,
              "created_utc": "2026-02-21 11:28:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6lct1a",
                  "author": "HamOwl",
                  "text": "I have been waiting so long. I had hopes that Pinephone would become something. It seems that no company is bold enough to fund such a project, and steal market share from Google and apple.",
                  "score": 3,
                  "created_utc": "2026-02-21 12:47:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ks7mo",
          "author": "RoutineDry8328",
          "text": "A noob question: what can change in a device without gapps? Which is the fdroid future, ipotetically?",
          "score": 4,
          "created_utc": "2026-02-21 09:40:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kstqd",
              "author": "funkvay",
              "text": "Not a noob question at all. If your phone doesn't have Google Mobile Services (like GrapheneOS, LineageOS without gapps, etc), these restrictions shouldn't apply to you directly since they target \"certified Android devices\" meaning devices with GMS.\n\nAs for F-Droid, if the devs who publish apps there refuse to register with Google, their apps get blocked on every phone running Google services. F-Droid itself still works fine on degoogled phones, but their audience shrinks massively overnight since like 95%+ of Android devices are certified. So F-Droid doesn't die technically, but it loses most of its users which means less motivation for devs to publish there, less donations, less maintenance. Slow and sad death basically.\n\nSo the short answer is that your degoogled device stays free, but the ecosystem around it gets starved",
              "score": 18,
              "created_utc": "2026-02-21 09:46:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6kyo0i",
                  "author": "erm_what_",
                  "text": "Wouldn't this violate the EU ruling on allowing alternative app stores?",
                  "score": 13,
                  "created_utc": "2026-02-21 10:43:31",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6kt3z4",
                  "author": "RoutineDry8328",
                  "text": "I'm so sad now...thank you for the correct explanation.\n\n\n\n",
                  "score": 2,
                  "created_utc": "2026-02-21 09:49:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6q5syi",
          "author": "Revbender",
          "text": "[Here](https://www.change.org/p/stop-google-from-limiting-apk-file-usage?recruiter=1370041382&recruited_by_id=fddec6e0-0e30-11f0-a55d-cd0eb0fd0ac4) is the change<dot>org petition to sign from the [keepandroidopen.org](https://keepandroidopen.org/) site",
          "score": 1,
          "created_utc": "2026-02-22 05:31:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qddzy",
          "author": "tazztone",
          "text": "installing via adb usb debugging ? 🥲",
          "score": 1,
          "created_utc": "2026-02-22 06:36:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tmt8e",
          "author": "toastbrotch",
          "text": "Well it's time to buy that yolla phone then...",
          "score": 1,
          "created_utc": "2026-02-22 19:13:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6updfh",
          "author": "MaintenanceOk3918",
          "text": "I already have a few app that aren't unverified, would they try to block me from using the app or just getting updates?",
          "score": 1,
          "created_utc": "2026-02-22 22:27:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72di9w",
          "author": "yoloo42069",
          "text": "This is genuinely stressing me out so much.",
          "score": 1,
          "created_utc": "2026-02-24 02:21:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74dud9",
          "author": "Hopeful_Rabbit_3729",
          "text": "We need open source mobile os and open source hardware",
          "score": 1,
          "created_utc": "2026-02-24 11:55:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6l69cc",
          "author": "Sirios_",
          "text": "Ehrhm achually 🥸\n\nThey talk about longer and dissuasive installation procedures",
          "score": 1,
          "created_utc": "2026-02-21 11:54:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l6dzs",
              "author": "Sirios_",
              "text": "Imho something like miui/hyperos with countdowns to press",
              "score": 1,
              "created_utc": "2026-02-21 11:55:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6kyvto",
          "author": "miaRedDragon",
          "text": "Then stop using Google simple. Creativity comes from challenges not comfortable consistency. Convience is what got us here in this hell world in the first place, I say let it all burn ",
          "score": -13,
          "created_utc": "2026-02-21 10:45:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l6yiv",
              "author": "kogsworth",
              "text": "And go where? Only iOS and Android are viable choices for phones these days.",
              "score": 12,
              "created_utc": "2026-02-21 12:00:21",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6ni6vx",
              "author": "carl2187",
              "text": "Yea i mean, I guess use an apple phone? Have you seen what it takes to sideload on that garbage platform? Money, ID, 10 day timer then the app breaks anyway.\n\nIt's a duopoly, there are no other options. There is no freedom of choice here.\n\nI guess I'd be fine with it all if the phone was free. But no, we pay for a locked down barely functional \"computer\" and were all ok with it. I blame the goons that still support apple for allowing this behavior to become normalized to the point that Google knows it can get away with it too, since they're the underdog here, even if every android user cares, its still less than 50% of US smartphone users.",
              "score": 1,
              "created_utc": "2026-02-21 19:44:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ku8g1",
          "author": "azurewindowpane",
          "text": "Why are you lying? They caved and walked this back: https://android-developers.googleblog.com/2025/11/android-developer-verification-early.html?m=1\n\n>Based on this feedback and our ongoing conversations with the community, we are building a new advanced flow that allows experienced users to accept the risks of installing software that isn't verified. We are designing this flow specifically to resist coercion, ensuring that users aren't tricked into bypassing these safety checks while under pressure from a scammer. It will also include clear warnings to ensure users fully understand the risks involved, but ultimately, it puts the choice in their hands.",
          "score": -18,
          "created_utc": "2026-02-21 10:00:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6l08fr",
              "author": "funkvay",
              "text": "Nobody's lying here. Read your own quote carefully\n\n\"We are **building**\". \"We are **designing**\". Future tense. No implementation, no details, no screenshots, no timeline for when this flow will be ready.\n\nNow go to Google's actual policy page developer.android.com/developer-verification, which is separate from a blog post. It still says right now, today\n\n> Starting in September 2026, Android will require all apps to be registered by verified developers in order to be installed on certified Android devices.\n\nNo mention of the advanced flow. No asterisk. No \"except for experienced users\". Just a flat statement that unverified apps will be blocked.\n\nAnd if you're trusting Google's blog post promises, I'd really encourage you to look at their history first. In 2015 Google Photos launched with a promise of free unlimited high-quality storage. People moved their entire photo libraries there based on that. Five years later, Google quietly announced they're ending it. Millions of users were already locked in by then.\n\nSame thing with Stadia, Google promised it would \"kill consoles\", hired big studio executives, sold hardware, wrote tons of blog posts about their vision. Then in 2022 they just shut down the entire thing. Pixel 1-5 owners were promised unlimited Google Photos storage as a literal selling point of the hardware. People bought those phones because of that promise. Pixel 6 comes out and it's just gone, no more unlimited storage, they didn't say anything before doing that.\n\nThey had founding motto \"Don't be evil\". They quietly removed it from their code of conduct in 2018. That's how much a Google promise is worth.\n\nOr look at Manifest V3 in Chrome, they told everyone extensions would keep working fine, then pushed changes that crippled ad blocker functionality. They \"compromised\" just enough to calm people down while still getting what they wanted. Sound familiar?\n\nA blog post saying \"we're building something\" and an official policy page saying \"everything gets blocked\" are two different things. Until the policy page changes or they actually show the implementation, a vague promise in a PR blog post is not walking it back. It's damage control.\n\nAnd by the way, why does that blog post even exist? Because people made noise. Which is exactly what this post is asking people to do",
              "score": 18,
              "created_utc": "2026-02-21 10:58:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6lbzjv",
                  "author": "azurewindowpane",
                  "text": "Per [this article](https://www.androidauthority.com/install-without-verifying-3633199/), there's already evidence of installing unverified apps being implemented. But why pay attention to the actual facts when you can go on \"GOOGLE USED TO SAY DON'T BE EVIL BUT NOW THEY EVIL\" diatribes?\n\nI'm not saying that Google is \"good\". I am saying that you're ignoring the evidence.",
                  "score": -8,
                  "created_utc": "2026-02-21 12:41:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6ne88c",
              "author": "lechiffreqc",
              "text": "Funny how they want to implement this under the \"protection of dumb phone owner\" from \"scammers\"\n\nPlay Store is filled with \"soft scam\", and the only reason they are hardening their position is to control and monetize everything on their \"certified phones\"",
              "score": 3,
              "created_utc": "2026-02-21 19:23:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rchq9x",
      "title": "Inkscape project struggling with lack of active contributors [video]",
      "subreddit": "opensource",
      "url": "https://friprogramvarusyndikatet.tv/w/ofcCwyxiE2VSaJPBFNnZLb",
      "author": "pimterry",
      "created_utc": "2026-02-23 13:41:37",
      "score": 228,
      "num_comments": 24,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1rchq9x/inkscape_project_struggling_with_lack_of_active/",
      "domain": "friprogramvarusyndikatet.tv",
      "is_self": false,
      "comments": [
        {
          "id": "o70rn32",
          "author": "sl0bbyb0bby",
          "text": "Noooo I don't need new features, but hope it doesn't become abandonware. Inkscape is great",
          "score": 91,
          "created_utc": "2026-02-23 21:08:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77gb1b",
              "author": "Headpuncher",
              "text": "It's fantastic software. I used to do all the tutorials by LogosByNick on youtube. I made some really cool (to me) stuff. ",
              "score": 8,
              "created_utc": "2026-02-24 20:59:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o71utj3",
          "author": "BP041",
          "text": "this hits close. the contributor pipeline problem is real across basically every mature OSS project -- it's not just Inkscape.\n\nthe bar to 'first meaningful PR' has gotten higher as codebases matured and accumulated technical debt. what I've seen help: genuinely good first issues (not 'fix a typo in the readme'), async video walkthroughs of key subsystems, and maintainers being explicit about review time expectations. that last one changes everything -- knowing you'll get feedback within 48h vs maybe never is a massive difference for new contributors.\n\nbiggest drop-off is usually between 'I found a good first issue' and 'I actually understand enough to attempt it.' projects that invest in architecture docs and 'here's how X subsystem works' posts tend to convert lurkers into contributors way better than just labeling more issues.",
          "score": 52,
          "created_utc": "2026-02-24 00:33:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72c1xi",
              "author": "RedDotHorizon",
              "text": "There are many more ways to be helpful that don't require in-depth technical/programming knowledge: updating documentation, tutorials, reproducing bugs/cleaning up the issue tracker, testing, community support, organizing meetings and events, ...\n\nBut yes, if you want to contribute code, there's a learning curve and some lead time required. With most of your suggestions we're in a chicken-and-egg situation: who is going to contribute video walkthroughs, maintain accurate technical documentation and organize their life around a 48h-response-SLA? (While I understand the intention, that last one is a bit outrageous for a volunteer-driven project.) It's a resource problem.\n\nIf I could make a wish, I'd wish for people to see these deficiencies as opportunities. It is actually very easy to make a huge impact on the project because there's so much room for improvement everywhere. You just need to want to apply yourself.",
              "score": 13,
              "created_utc": "2026-02-24 02:12:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o72lkk5",
                  "author": "BP041",
                  "text": "fair points — the 48h SLA framing was too prescriptive. I was trying to get at \"any explicit signal beats silence for a new contributor waiting on their first PR,\" but I overcorrected into something unreasonable for volunteers.\n\nthe non-code contribution point is real and I glossed over it. I've seen projects where one person consistently doing issue triage + writing actual-context \"good first issue\" labels moved the needle more than a batch of feature PRs. documentation and community scaffolding are leverage, just less visible.\n\n\"see deficiencies as opportunities\" is probably the right frame for this — it just requires someone to internalize that the gap is an invitation. harder to communicate to a newcomer than a list of tasks, but more durable when it clicks.",
                  "score": 6,
                  "created_utc": "2026-02-24 03:07:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o710l6k",
          "author": "P1r4nha",
          "text": "I love that tool. It's written in C++. Might be worth a look.",
          "score": 23,
          "created_utc": "2026-02-23 21:51:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70y3qt",
          "author": "Ginjutsu",
          "text": "Dang, that's a bummer to hear. Love Inkscape and use it all the time. Hopefully things get better in the future.",
          "score": 19,
          "created_utc": "2026-02-23 21:39:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o732wxn",
          "author": "ivosaurus",
          "text": "[Here's the video on Youtube](https://youtu.be/axf28yT7-98?t=18) if someone wants to check it out there as well\n\nI wonder if Krita is experiencing any of the same problems, maybe to a lesser extent; or by contrast, if this is more unique to Inkscape",
          "score": 16,
          "created_utc": "2026-02-24 05:03:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77hvo5",
          "author": "Headpuncher",
          "text": "It would help if some distros, ahem ubuntu ahem, would stop pushing broken Snaps. \n\nThere was a long time issue with the default install of Inkscape on Ubuntu \\[X, K, etc\\] using the Snap as the default even from apt. The Snap like many other Snaps being sandboxed had a permissions issue stopping users from exporting files (no FS access). This is why I stopped using Inkscape, I couldn't find a fix aside form building from source which many people wouldn't even think to do. \n\nNot being able to export / save was a major F-up. Issue's like this are the main reason Snaps don't work for me. ",
          "score": 4,
          "created_utc": "2026-02-24 21:06:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76spg9",
          "author": "Banana_tnoob",
          "text": "Does sponsoring / donating help? Are there developers paid by sponsors? Heck, is it even possible to donate? I am a long term sponsor of neovim, but Inkscape is another software that I view as excellent and would like to support it if it helps.",
          "score": 4,
          "created_utc": "2026-02-24 19:09:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76ti44",
              "author": "Banana_tnoob",
              "text": "Answering myself: https://inkscape.org/support-us/donate/\n\nDonating to Inkscape\n\nThe Inkscape Fund is a charity fund for supporting the Inkscape project. It is used in various ways, most particularly to help with costs of gathering Inkscape developers at important conferences such as Libre Graphics Meeting or SCALE and host our own events such as Hackfests. It goes towards Outreachy mentorship programs and other infrastructural costs of running the Inkscape project.\n\n \nDonation via Software Freedom Conservancy\n\nThe Inkscape Fund is currently managed by the Software Freedom Conservancy, Inc., a 501(c)(3) non-profit. All donations made through it are fully tax-deductible to the extent permitted by law. If you have any questions or are otherwise in need of assistance, please visit the SFC site.",
              "score": 7,
              "created_utc": "2026-02-24 19:13:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o72gyab",
          "author": "Atulin",
          "text": "Frankly, not all that surprising. For the longest time, Inkscape had a reputation of \"takes 6 business days to open, and good luck figuring out how to use it\". Nowadays, it has more of a \"takes 1-2 business days to open, and good luck figuring out how to use it\", so it's definitely getting better.\n\nThat said, people generally contribute to what they use and what they like. Not that many people use Inkscape, and even fewer like it.\n\nNo less important is the fact, that it's generally harder to find new contributors for older, less \"exciting\" projects. Inkscape's still on C++17 and GTK3, if I'm not mistaken, with a bunch of Python scripts that do the heavy lifting (sic!)\n\nThey are migrating to C++20 and GTK4, IIRC, but that's a bit of a chicken-and-egg situation itself.\n\nA fresh, new, potential contributor looks like it, says \"eww, smells of mothballs\" and goes looking for some Rust/C#/Kotlin/Javascript project to contribute to instead.",
          "score": 11,
          "created_utc": "2026-02-24 02:41:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72u268",
              "author": "litelinux",
              "text": "The migration is mostly complete, but you're right that we're in a transitional state. Parts of the code do smell of mothballs but that's just what you get with 22-year-old software :)\n\nIt will be fine though. 1.5 is coming together okay and developers are working on larger features, which makes it look like we have less contributions.",
              "score": 19,
              "created_utc": "2026-02-24 04:01:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o748pjm",
                  "author": "McDonaldsWitchcraft",
                  "text": "As a long time Inkscape user, I would really love to have more bugfixes even if that means no additional features. It's probably the buggiest art software I use. Maybe I notice because I use it everyday. But being a graphics program makes it particularly annoying to have so many graphics glitches, especially when exporting.\n\nI wish I knew enough to contribute but for now I can only submit bugs.",
                  "score": 6,
                  "created_utc": "2026-02-24 11:14:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o74w4ma",
          "author": "Dontdoitagain69",
          "text": "Let’s create another distro instead of combining resources on current projects.even through I’m used to illustrator at one point when I didn’t want to pay 59/month I used Inscape and it is actually a bday ass vector drawing software. Fast, powerful , no extra bs features. Please keep this alive, there a some Linux projects you can cancel due to poor initial design flaws and move resources to Inkscape",
          "score": -1,
          "created_utc": "2026-02-24 13:51:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73tisx",
          "author": "charmander_cha",
          "text": "Projetos open source deveriam aderir a um novo paradigma de gestão administrativa para evoluir com o uso de LLMs",
          "score": -11,
          "created_utc": "2026-02-24 08:53:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8fafs",
      "title": "Why build anything anymore?",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1r8fafs/why_build_anything_anymore/",
      "author": "aptacode",
      "created_utc": "2026-02-18 21:05:14",
      "score": 172,
      "num_comments": 48,
      "upvote_ratio": 0.89,
      "text": "The day after tweeting popular youtuber RaidOwl the project I spent weeks building:  \n[https://x.com/Timmoth\\_j/status/2022754307095879837](https://x.com/Timmoth_j/status/2022754307095879837)\n\nHe released a vibe coded eerily similar work:  \n[https://www.youtube.com/watch?v=Z-RqFijJVXw](https://www.youtube.com/watch?v=Z-RqFijJVXw)\n\nI've nothing wrong with competition, but opensource software takes hard work and effort It's a long process - being able to vibe code something in a few hours does not mean you're capable of maintaining it.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1r8fafs/why_build_anything_anymore/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o64kdcd",
          "author": "stan_frbd",
          "text": "That's what will make the difference! Keep going with your project, add stuff that is relevant for you first and for the community. You will be able to maintain when they will abandon it.",
          "score": 165,
          "created_utc": "2026-02-18 21:14:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o64tkis",
              "author": "bccorb1000",
              "text": "This! You have to understand that LLMs have lowered the bar for entry but not as much for maintaining! \n\nOpen source can be thankless, but if you love it, keep going! Consistency over hype!",
              "score": 49,
              "created_utc": "2026-02-18 21:56:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6hecie",
                  "author": "Useful-Process9033",
                  "text": "The maintenance gap is going to be the great filter. Vibe coded projects look impressive for a week and then the first real bug report comes in and nobody knows how the code actually works. Long term maintenance is where real engineering wins every time.",
                  "score": 10,
                  "created_utc": "2026-02-20 20:06:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o64ugmu",
          "author": "PurpleYoshiEgg",
          "text": "Because it's fun.  I have fun writing code.  I don't have fun when a plagiarism machine does it for me.  So I write the code I want to see and maintain according to my own tastes and standards.\n\nDon't let them steal your joy.",
          "score": 32,
          "created_utc": "2026-02-18 22:00:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64qhz7",
          "author": "HowIsDigit8888",
          "text": "If you keep thinking for yourself and don't give up on your ideas, the differences between your work and anyone else's will only get more and more important.\n\n\nAnd if you truly want to make the world a better place, people trying to grift can never be happy with a copy as good as your best work. They'll ruin their own copies.",
          "score": 21,
          "created_utc": "2026-02-18 21:42:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65c03p",
          "author": "not_a_novel_account",
          "text": "Because you need it. That's how most highly successful open source works. We build things because we need them, release them as OSS for whatever reason (network effects, pride, collaboration, whatever).\n\nThe need is the first bit. If you don't need something, you're only building it for pride. That's fine, but you do so with the understanding that pride can be hurt. If you're in OSS as a need-first game, others building code adjacent to the thing you need isn't a factor which matters.",
          "score": 14,
          "created_utc": "2026-02-18 23:27:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64mwry",
          "author": "WittyWampus",
          "text": "I get where you're coming from, but to play devil's advocate, he does say in that video that he \"wanted something for his own use\". You tweeting him could've been a spark of \"hey that's cool, I'm going to take that idea and run with it.\" Not everything is some nefarious plot.\n\nRegardless, your project is cool and seems like it already has some awesome traction (just looking at stars)! Don't let it get to you. Life's too short.",
          "score": 39,
          "created_utc": "2026-02-18 21:25:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64y0dv",
          "author": "cyb3rofficial",
          "text": "I spent years building my project, I'm just glad no vibe coder will be able to recreate it. Just keep doing your version the way you see it. Don't get discouraged from it. I had plenty of people try to mimic my project but ultimately failed as the feature set I worked on needs actual human review and knowledge. Many applications end up being abandoned and turned stale. LLMs will fail when projects get too large. My project involves so many different operating systems configurations, different code languages, and most importantly experience with actual hard limitations and implementations. Not even claude can work on my project, I tried using Claude the latest version and it popped a fuse trying to figure stuff out.",
          "score": 11,
          "created_utc": "2026-02-18 22:16:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6j6hu4",
              "author": "doodeoo",
              "text": "What's your project?",
              "score": 1,
              "created_utc": "2026-02-21 01:57:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6jcj2n",
                  "author": "cyb3rofficial",
                  "text": "https://cyberofficial.itch.io/synthalingua\n\nhttps://github.com/cyberofficial/Synthalingua\n\nA very painful project glued together starting early 2023.\n\nit's at the point of where I need to refactor everything over to be more organized. But I'm trying to get onto steam first so be working on ways to make it steam friendly\n\nIt's already used in some private companies, so its pretty much a good side income source to keep it maintained.",
                  "score": 1,
                  "created_utc": "2026-02-21 02:35:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o651uos",
              "author": "MK_L",
              "text": "If your trying to use ai in an existing project I would start woth codex. Have it map out each section with an .MD explains what it finds (page by page). Then have it use those .MD files to map out what is linked between the different pages of code. Repeating this method you should be able to create a full topology of your project. From there you can create spec sheets of what everything does. \n\nAt this point you should be able to use any llm you want (claude, codex, local) and edits should stay contained with out nuking your repo. \n\nGoodluck",
              "score": -17,
              "created_utc": "2026-02-18 22:34:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o69hu6j",
          "author": "lawrencesystems",
          "text": "> Writing code that works, without consideration of how it will fail, is a recipe for catastrophe. It is a way to create tech debt at scale. It is shoveling asbestos into the walls of our technological society. \n- Cory Doctorow https://pluralistic.net/2026/01/06/1000x-liability/\n\nWhile \"Vibe Coding\" can be a fast path to getting something put together and working it's not real software engineering. Most vibe coders and their projects lack the foresight and sustainability that a proper software engineer puts into a project. I have not hate for the new influx of people making new things, but I do try to educate people to help them understand the difference between writing some code that works vs building a well engineered system.",
          "score": 5,
          "created_utc": "2026-02-19 16:20:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69k3ld",
              "author": "aptacode",
              "text": "Agreed, AI is such a powerful tool for software engineering, but it requires discipline to use properly along side best practices. I think for many the alure of a 'free lunch' is too great, I just hope software craftsmanship can survive the AI bubble. ",
              "score": 2,
              "created_utc": "2026-02-19 16:31:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6drzv6",
                  "author": "taiwofolu",
                  "text": "Software craftsmanship will definitely survive.\n\nHaving access to a camera doesn't mean everyone will make a blockbuster movie. It does lower the bar of entry but at the same time creates a distinction between basic and extra ordinary work - because it was never about the camera.\n\nIt was never about the code. It's about the product, taste, the community and ultimately the desire to solve a problem.\n\nThen there's the layer of support, sales, updates and then the technical debt that comes with maintaining the body of work.\n\nIf someone vibe coded your app, it's a testament to the fact that you actually were solving a problem. I think it validates your idea. Stick around and when they're tired of maintaining their clone, you'll be able to snap up their users.",
                  "score": 3,
                  "created_utc": "2026-02-20 07:02:07",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6mbj91",
                  "author": "WorkingTheMadses",
                  "text": "It's not really \"powerful\" for software engineering. If it makes some people feel like their productivity is boosted by using it, then they likely weren't all that good to begin with.\n\nWe have mountains of studies on this now.",
                  "score": 2,
                  "created_utc": "2026-02-21 16:10:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o65tj5w",
          "author": "FIIRETURRET",
          "text": "There always has been and always will be cheap imitations.",
          "score": 7,
          "created_utc": "2026-02-19 01:05:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66re0h",
          "author": "QualitySoftwareGuy",
          "text": "> being able to vibe code something in a few hours does not mean you're capable of maintaining it. \n\nYou answered your own question I'd say :-)\n\nThe most successful open source projects (e.g. GNU, Linux, Git, VLC, LibreOffice, etc) are not successful because they were outputted as quickly as possible but, instead, because they withstood the test of time due to the countless hours of humans pouring in their blood, sweat, and tears to adding quality code. And by \"quality\" I'm not just talking about functional code, I'm talking about things like security, performance, and accessibility. \n\nVibe coders specialize in getting \"output\" quickly and then go one of two routes (sometimes both):\n\n1. Hope the LLM can continue maintaining it via the usual text prompts.\n2. Hope and pray actual humans contribute and make the project a success. \n\nOn r/rust and r/Python, I've seen most vibe coders quickly produce (shit) output, and then ask for the community (actual humans) to make it a success.\n\nTLDR; The most successful projects will always be from skilled humans that take the time to contribute quality software. Vibe coders still have a long road ahead of them in proving that they will maintain the (shit) output that they produced.",
          "score": 6,
          "created_utc": "2026-02-19 04:29:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68amyi",
          "author": "woomadmoney",
          "text": "Of course not. And that's the whole point. Even if people do jump ship, he will not maintain it, they will come back to your product. Customer service, maintenance and reliability have never been as important in software as they are now.",
          "score": 3,
          "created_utc": "2026-02-19 12:22:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aycog",
          "author": "WoodNUFC",
          "text": "If it's any consolation, the video is now unlisted and people are reporting issues where the Docker image refuses to launch after a database update.",
          "score": 3,
          "created_utc": "2026-02-19 20:31:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cpa2u",
          "author": "lurch303",
          "text": "I am feeling a little jaded and came here to make a post roughly similar but different on why make OSS anymore? \n\nFor several decades open source was marketed as an ethically superior and to some only acceptable ethical way of producing software. I think most of us that were in the software development world before open source really took off in the late 90s and early 00s, would agree that software development and using computers was possible but more expensive and harder to access. The promise of open source software was to bring down barriers of cost and access to most and for those able to grok the source it allowed them to see and manipulate what it was doing. The thing is though that open sourcing software would not only bring down barriers for those that had limited computer access, it also gave capital free access to labor. Open source software developers and maintainers became capital’s useful  idiots, allowing them to build and scale businesses that would not have been viable on top of commercial software.\n\nA couple of stages I can recognize having worked through.\n\n1) Selling commercial off the shelf software becomes difficult due to a constant stream of open source competitors making it difficult for businesses to survive in spaces they previously thrived. Not because their technology wasn’t superior or behind but because free was good enough.\n\n2) New ventures move to the open source freemium pricing as it is the only way to get adoption.\n\n3) Time sharing gets an API and a pay as you go check out cart, it’s now called Cloud Computing. It then grows to deploy and manage services on top of compute establishing vendor lock in. If your open source freemium product takes off it is adopted and extinguished by hyper scalers. \n\n3) The ultimate betrayal. Researchers learn their models are not held back by algorithms but by the size of the data set they are trained on. LLMs are trained on the free labor of open source software developers and the communities open support forums. They have captured that free knowledge as vectors in immense matrices, mix it up and parrot it back as their own. The collective knowledge that was shared so freely is parroted back to every LLM prompt and now worth no more than the tokens a hyper scaler will charge to retrieve it.\n\nOr maybe the ultimate betrayal is this rant about LLMs being crawled by a bot, turned into embedding and used to create a rant for some future clanker who can’t write on their own.\n\nWhere to next?\n\nThank you for coming to my TedTalk.",
          "score": 2,
          "created_utc": "2026-02-20 02:19:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6e605x",
          "author": "gdmzhlzhiv",
          "text": "Why play chess anymore? Computers can do it faster _and_ better.",
          "score": 2,
          "created_utc": "2026-02-20 09:13:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6elg66",
          "author": "moderate_chungus",
          "text": "Then why the hell did you tweet him your idea",
          "score": 2,
          "created_utc": "2026-02-20 11:31:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mb0gd",
          "author": "WorkingTheMadses",
          "text": "There is no glory in hard work. Whatever suffering you went through to make something is not really something that'll affect most people's choices. Is it good software? Yes? Then that'll count. That's always been a bit of an illusion. The job market of today has really made that clear compared to the job market of my parents time.\n\nThat said, don't be discouraged. Vibe coded software will not prevail in it's current form and might never and until it definitively does, you should keep working on what makes you happy for your sake, not for someone elses.",
          "score": 2,
          "created_utc": "2026-02-21 16:08:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6r3fq4",
          "author": "PipingSnail",
          "text": "The real difference. You know how your software works, and you know the real motivations for building it.\n\nThe vibe coder doesn't know how it works. Their motivation, was it to solve a real problem they had, or to copy something they saw? If the latter they don't understand the motivations of the intended users.\n\nTake those two positions and look at future directions for the software. One has an obvious grounding and the other doesn't.\n\nAs for bug fixes... Where is the vibe coder's motivation or knowledge of how the software works?",
          "score": 2,
          "created_utc": "2026-02-22 10:44:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67w6oe",
          "author": "MichiRecRoom",
          "text": "For me, the thing that makes manual building worth it, is the human element: The knowledge that, despite your limitations (including your knowledge of programming), you've made something that you like - and that others might like too.\n\nThat sort of euphoria is just not something you can get with autocomplete-on-a-GPU.",
          "score": 1,
          "created_utc": "2026-02-19 10:23:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6boc7f",
          "author": "datbackup",
          "text": "To help add to ai training data? :D",
          "score": 1,
          "created_utc": "2026-02-19 22:41:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dno8x",
          "author": "Ashken",
          "text": "As someone that’s working on my own project that similar to this, I actually welcome it. Shows me there’s real demand for my tool. And since mine isn’t vibe coded I’m hoping that it will have some real use and longevity.",
          "score": 1,
          "created_utc": "2026-02-20 06:23:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fp24r",
          "author": "whatThePleb",
          "text": "use xcancel, ffs",
          "score": 1,
          "created_utc": "2026-02-20 15:23:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fyk3l",
          "author": "spartanOrk",
          "text": "You need to accept that coding is dying. Vibe coding is what high-level languages were to assembly. Nobody writes Assembly anymore—or almost nobody. We have compilers. Similarly, now we have human language compilers that convert human language to machine code after passing it through a high-level language. they may not be perfect yet or as accurate as writing assembly by hand, but the level of productivity makes up for that imprecision. We are heading into an era where software will be all on-demand or extremely cheap. You will say, \"I want to write a document, just make a Microsoft Word for me, please.\" It will make you a Microsoft Word, and then you will throw it away because you can remake it whenever you want.",
          "score": 1,
          "created_utc": "2026-02-20 16:08:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6k3dzv",
          "author": "Western-Touch-2129",
          "text": "Couldn't you DMCA him for that? 🤔",
          "score": 1,
          "created_utc": "2026-02-21 05:45:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kf244",
          "author": "ReachingForVega",
          "text": "Don't send it to influencers for starters until you already have momentum.\n\n\nI think your tool needs some guides for what to use it for. I had a look and while your description indicates features, I couldn't see a use for it for me and I have a decent lab. ",
          "score": 1,
          "created_utc": "2026-02-21 07:30:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xhkvy",
          "author": "Rxke2",
          "text": "video is already hidden and people asking for fixes get no answer. I guess there's your maintaining answer :-)",
          "score": 1,
          "created_utc": "2026-02-23 10:27:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6y2vcl",
          "author": "TheCrazyGeek",
          "text": "I build things because either I need them or I was trying to learn new things. I open source it because I am hoping that my work will be useful to others and if people find my work interesting and contribute, that makes me happy since I can learn new things from others and reflect on my mistakes. For me, open source is not solely about building things, but sharing knowledge and learning from others and knowing where you lack and what you need to study. And it's fun writing code and reading how things work.",
          "score": 1,
          "created_utc": "2026-02-23 13:16:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6znyf4",
          "author": "GrowlingOcelot_4516",
          "text": "Totally agree with you. We are a small team and tried to get extra hands with a coding agent. Jesus Christ holy mess... The code base got convoluted, complex for no reason. Tests made little sense.\nI mean, yeah, you might get some solution that works now, but good luck improving on it or having to update it.",
          "score": 1,
          "created_utc": "2026-02-23 18:01:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70e7dd",
          "author": "AFIRENSIDE",
          "text": "Don't get discouraged! You're passionate about the project - they are not.\n\nKeep doing great work and your dedication will show.",
          "score": 1,
          "created_utc": "2026-02-23 20:02:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o66m8ky",
          "author": "SuperQue",
          "text": "What's worse is when people put claims like \"Fast\", \"Lightweight\", \"Enterprise Grade\", etc on their vibe code project without any testing to back it up.\n\nWhen you do go and test it, it's 10x worse than what you've done. Or so trivial an implementation that it only seems \"light\" because it does 1% of the functionality.",
          "score": 1,
          "created_utc": "2026-02-19 03:55:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o652r5g",
          "author": "MikauValo",
          "text": "Vibe Coding actually helps me a lot to learn to write little programs and as a adhd person my brain depends on quick success to stay on track. Ultimately it will most likely help me to understand the fundamentals of programming and how to write and fully understand my own code way better than I ever could with any book or tutorial video. So it doesn't only come with downsides.\n\nEdit: Interesting that sharing personal experiences is enough for people to downvote. Is personal experience not valid?",
          "score": -5,
          "created_utc": "2026-02-18 22:39:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6mdmzw",
              "author": "PlayerOnSticks",
              "text": "Man I thought so as well. I went from never doing anything but glue bash scripts together to actually hosting stuff on a vps with custom systemd scripts, but when I tried doing it myself, I realised that I have not, in fact, learned shit.  \nAttempted to use Gemini Pro as a coding teacher instead, and turned out that half the shit it spouted was just straight up false. Attempted to have it link and cite sources from documentation, but it became such a hassle that my shortspanned brain found just reading the actual documentation and source code easier.  \nNow I am suddenly reading sourcecode and documentation and it's actually going pretty well. You don't have to know the programming language of what the code you're reading. For tweaking and making add-ons or scripts with it, seeing the high-level logic is usually enough. Definitely not as easy or fast as vibe coding, but better then what I used to do.  \nCould probably use LLM's for explaining source code that I DO need to understand at a more detailed level but I simply don't trust it anymore... but maybe it'd work, idk. Doubt it, though.",
              "score": 3,
              "created_utc": "2026-02-21 16:21:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6mffca",
                  "author": "MikauValo",
                  "text": "Great, that you found a working solution that fits you. Unfortunately, not working for me this way, sadly. I simply get very quickly very tired from reading anything (no matter if documentation or just some book) especially when there is no visualization of anything. I wish I could learn stuff just by reading it, but I need to see and experience stuff to actually learn it.",
                  "score": 0,
                  "created_utc": "2026-02-21 16:30:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rbgx0p",
      "title": "Why you should get involved in open source - a personal story",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rbgx0p/why_you_should_get_involved_in_open_source_a/",
      "author": "jsattler_",
      "created_utc": "2026-02-22 08:50:46",
      "score": 90,
      "num_comments": 17,
      "upvote_ratio": 0.97,
      "text": "Hey everyone,\n\nthis post is going to be slightly promotional but the main intention is to encourage people to do open source work and provide an answer to a recent post in this subreddit [Why build anything anymore?](https://www.reddit.com/r/opensource/comments/1r8fafs/why_build_anything_anymore/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). That's why I used the Community flair.\n\nA bit of background: A few weeks ago I built a screen recorder that solved a problem for me that no other free screen recorder on the market solved. I never had the intention to make any money out of it and just [published it under MIT License on GitHub](https://github.com/jsattler/BetterCapture). I also [shared the repository in the macapps subreddit](https://www.reddit.com/r/macapps/comments/1qza8af/macos_i_built_a_free_open_source_macos_screen/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) hoping some people will find it useful too.\n\nOver the past couple of days, I received lots of positive feedback, mainly through Reddit and GitHub. People I never met or talked to are getting involved in the project and sharing their ideas. A few people even donated money and a Startup asked to sponsor the project. As of writing this, the project has received more than 700 stars on GitHub. It's not as crazy as other projects, but what I learned over the past couple of days is that **building something and sharing it with people who get value out of it, is a really, really good feeling and is encouraging me to keep working on the project in my spare time**. It's very satisfying and fulfilling to see people use what you've built. But that's only one aspect.\n\nI see a lot of people in our industry struggling to keep up with what's happening around AI. People are afraid about not finding or losing jobs. Here is the thing and I hope it's not a surprise by now: **coding alone will not land you a job anymore** (and probably never has). What's much more important now than ever is **credibility and trust that you are able to build and ship something that's useful.** And what's better to demonstrate this skill by building something open source that people actually use. If I ever look for a new job, this project will have more value than putting a 10$ monthly subscription on it.\n\nThat's all I wanted to share and I hope it encourages some people here to get involved in other open source projects or to build something without trying to squeeze every $$$ out of it. Have a nice Sunday!\n\nPS: I also want to acknowledge that I'm in a privileged position and currently do not depend on making money from this project. I get that a lot of people are in a different situation and need to make money to pay their rent.",
      "is_original_content": false,
      "link_flair_text": "Community",
      "permalink": "https://reddit.com/r/opensource/comments/1rbgx0p/why_you_should_get_involved_in_open_source_a/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o6wmb6o",
          "author": "BP041",
          "text": "the part that surprised me most about open source was how much it accelerated my own thinking. explaining something in a README or responding to an issue forces you to understand it 3 levels deeper than just using it.\n\nstarted contributing mainly for the visibility, kept doing it because the problem-solving discipline is different from closed work. with internal codebases you can take shortcuts nobody ever sees. public code forces a kind of honesty that's hard to replicate.\n\nwhat domain is your project in? post linked to something but i couldn't tell from the title.",
          "score": 6,
          "created_utc": "2026-02-23 05:35:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6zjv52",
              "author": "jsattler_",
              "text": "Thanks for sharing. I totally agree with what you described. \n\nThe project I worked on is a screen recorder for macOS. It supports professional codecs such as ProRes4444 and ProRes422, which is not common among other screen recorders.",
              "score": 1,
              "created_utc": "2026-02-23 17:43:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o71xad8",
                  "author": "BP041",
                  "text": "the screen recorder space on macOS is surprisingly sparse for quality capture — sounds like a useful niche. curious what codec you're targeting. ProRes is the obvious choice but bundling the encoder gets annoying. general capture or specific workflows?",
                  "score": 1,
                  "created_utc": "2026-02-24 00:47:04",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o72lh2h",
                  "author": "BP041",
                  "text": "Appreciate it — the discipline point took me a while to internalize too. Easy to skip 'nice to have' practices when you're the only dev and shipping feels more urgent.\n\nA ProRes macOS screen recorder sounds like exactly the kind of niche, high-quality tool that builds a cult following once the right people find it. Curious what's driving the ProRes choice specifically — capturing for video editing workflows?",
                  "score": 1,
                  "created_utc": "2026-02-24 03:07:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6xcdzv",
          "author": "Constant-Drive9727",
          "text": "People usually miss why some projects really take off. It’s not just about building in public or open-sourcing your code. The real spark comes from fixing a problem that actually bugs you.\n\nTake your recorder, for example, it got popular because it solved something that bothered you personally. That does a couple of things right away: the project stays small enough to finish, and the problem is so clear that other people understand it.\n\nA lot of developers i see nowadays jump in with a random idea or chase money, and that’s how you get bloated tools no one asked for.\n\nSo for me, the real takeaway isn’t just “do open source.” It’s about spotting a real pain point, building the simplest thing that fixes it, and letting people see how useful it is. Anyway good job and keep the good work !",
          "score": 6,
          "created_utc": "2026-02-23 09:37:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6zkc2e",
              "author": "jsattler_",
              "text": "Yes, 100% agree. Solving your own problems is a good starting point.",
              "score": 2,
              "created_utc": "2026-02-23 17:45:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6yhfqb",
          "author": "BP041",
          "text": "the compounding is real and it takes longer to kick in than most people expect. my first contributions were tiny -- doc fixes, cleaning up outdated examples. felt kind of pointless at the time.\n\ntwo years later those same communities are where i've met actual collaborators and gotten more real mentorship than any job gave me. the code contributions matter less than the relationships that form around them.\n\nthe thing nobody mentions upfront: you start to genuinely understand how good software is designed, because you're reading other people's decisions and the discussions around them. that pattern recognition is hard to get any other way.",
          "score": 3,
          "created_utc": "2026-02-23 14:39:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w2qxb",
          "author": "bravelogitex",
          "text": "Thanks for sharing, great story",
          "score": 2,
          "created_utc": "2026-02-23 03:16:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71nky8",
          "author": "DiscussionHealthy802",
          "text": "Love this post, and I completely agree that building and sharing something useful is a really good feeling. I had a very similar experience when I [open-sourced my tool, ship-safe](https://github.com/asamassekou10/ship-safe), which I originally just built to stop my own AI assistant from leaking database keys. I didn't expect much, but the community feedback has been incredibly rewarding. It really proves your point that credibility and trust are what matter most in the industry right now",
          "score": 1,
          "created_utc": "2026-02-23 23:53:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71qv7b",
          "author": "GlendonMcGladdery",
          "text": "Dear OP, \n\nThank you for speaking your mind and you are not in the minority. https://keepandroidopen.org/",
          "score": 1,
          "created_utc": "2026-02-24 00:11:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xo0ao",
          "author": "itz-ud",
          "text": "Hey,\n\nI'm working on a project.\n\nCheck this out: [https://github.com/udaykumar-dhokia/gitbot](https://github.com/udaykumar-dhokia/gitbot)\n\nGItBot: A Lightweight Personal AI Assistant for Git & GitHub, that runs locally on your computer via CLI. and it is open-source as well.",
          "score": 1,
          "created_utc": "2026-02-23 11:26:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6zk02m",
              "author": "jsattler_",
              "text": "Thanks for sharing. What problem are you solving with you project?",
              "score": 1,
              "created_utc": "2026-02-23 17:43:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o731au0",
                  "author": "itz-ud",
                  "text": "Struggle with good commit messages, waste time writing PR descriptions and summarizing diffs & commits.",
                  "score": 1,
                  "created_utc": "2026-02-24 04:51:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1ra9drl",
      "title": "No-Autopilot: GitHub Action that automatically closes sloppy PRs",
      "subreddit": "opensource",
      "url": "https://github.com/eljojo/no-autopilot",
      "author": "eljojors",
      "created_utc": "2026-02-20 22:17:54",
      "score": 80,
      "num_comments": 6,
      "upvote_ratio": 0.94,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1ra9drl/noautopilot_github_action_that_automatically/",
      "domain": "github.com",
      "is_self": false,
      "comments": [
        {
          "id": "o6kekx4",
          "author": "xX_Negative_Won_Xx",
          "text": "This project could be improved by adding support for a feature that would automatically close all PRs after leaving a vague but polite message",
          "score": 16,
          "created_utc": "2026-02-21 07:25:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6j4cma",
          "author": "Otherwise_Wave9374",
          "text": "This is a really pragmatic approach. I have found that \"agent policies\" only work when you have enforcement in CI, otherwise people just ignore docs and the slop creeps back in. The checkbox plus auto-close is blunt, but probably effective for repos that want to stay human-first. I have been reading a bunch about agent guardrails and anti-prompt-injection patterns lately, similar themes here: https://www.agentixlabs.com/blog/",
          "score": 7,
          "created_utc": "2026-02-21 01:44:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6mvwti",
              "author": "eljojors",
              "text": "thank you! will look closer into it",
              "score": 1,
              "created_utc": "2026-02-21 17:53:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ryvg5",
          "author": "BP041",
          "text": "the enforcement angle is what makes this actually useful. we've tried the \"describe your coding standards in CLAUDE.md\" approach and it works... until it doesn't. models hallucinate adherence to their own guidelines all the time.\n\na hard gate in CI is the right move because it removes the \"trust but verify\" assumption. the model can't talk its way past a failed check.\n\none thing I'm curious about: how do you handle false positives? legitimate devs who write terse commit messages or skip docstrings for internal utils?",
          "score": 2,
          "created_utc": "2026-02-22 14:34:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6s31s6",
              "author": "eljojors",
              "text": "I know what you mean, I worry about false positives too. I've tried hard to avoid calling someone an \"AI\" for writing things like \"Here's a summary of what's changed\".\n\n🙅‍♂️ the system doesn't look for generic phrases that humans would sometimes use\n\n🕵️‍♂️ the system is looking for very flagrant careless AI use like \"You can make Copilot smarter by setting up custom instructions\"\n\nthanks for your thoughts!",
              "score": 3,
              "created_utc": "2026-02-22 14:55:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xo3q4",
          "author": "itz-ud",
          "text": "Hey,\n\nI'm working on a project.\n\nCheck this out: [https://github.com/udaykumar-dhokia/gitbot](https://github.com/udaykumar-dhokia/gitbot)\n\nGItBot: A Lightweight Personal AI Assistant for Git & GitHub, that runs locally on your computer via CLI. and it is open-source as well.",
          "score": -2,
          "created_utc": "2026-02-23 11:27:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r88y2d",
      "title": "LibreOffice Named a 2026 \"Best Value\" Leader by Capterra",
      "subreddit": "opensource",
      "url": "https://blog.documentfoundation.org/blog/2026/02/18/libreoffice-named-a-2026-best-value-leader-by-capterra/",
      "author": "buovjaga",
      "created_utc": "2026-02-18 17:14:10",
      "score": 64,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1r88y2d/libreoffice_named_a_2026_best_value_leader_by/",
      "domain": "blog.documentfoundation.org",
      "is_self": false,
      "comments": [
        {
          "id": "o67866g",
          "author": "Enemby",
          "text": "I should hope free software has good value... otherwise, what's the point?",
          "score": 2,
          "created_utc": "2026-02-19 06:36:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcoo45",
      "title": "I built an open source Google Analytics & reCAPTCHA alternative",
      "subreddit": "opensource",
      "url": "https://github.com/swetrix/swetrix",
      "author": "Sensiduct",
      "created_utc": "2026-02-23 17:59:38",
      "score": 64,
      "num_comments": 10,
      "upvote_ratio": 0.93,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rcoo45/i_built_an_open_source_google_analytics_recaptcha/",
      "domain": "github.com",
      "is_self": false,
      "comments": [
        {
          "id": "o6zuzx2",
          "author": "ssddanbrown",
          "text": "Nice project! A few things I noticed in regard to open source and marketing, assuming I have not misunderstood the cloud-feature segmentation:\n\n- The AGPLv3 labelled repo has [this COPYING file](https://github.com/Swetrix/swetrix/blob/4571d9b193f065fef2debade3666510785b095c0/backend/apps/cloud/COPYING.txt) contained within, without reference to it in the readme or top-level LICENCE file. Its existence is unclear unless you dive into the code, and its application is unclear since it says it applies to \"This repository\", not a specific part or folder etc...\n- Your [readme lists](https://github.com/Swetrix/swetrix/blob/4571d9b193f065fef2debade3666510785b095c0/README.md?plain=1#L57-L61) cloud features. While they are tagged with cloud, it might be a tad misleading since they are not provided under the license advertised for the repo, nor are they open source which the project is introduced as in the readme intro.\n- On your homepage, the hero contains \"Open-source\" right next to a view/iframe/demo to an instance which features the non-open-source elements.\n- Again on the homepage, there's the wording \"Fully open-source and auditable. Self-host on your own infrastructure or use our cloud.\" which could be misleading since the core is open source, the project and what's being advertised is not fully open source.\n- On your comparison pages, for example [this one with Unami](https://swetrix.com/comparison/umami), \"Open Source\" is checked in the checklist without any qualifier, with all the non-open-source features also listed as checked.\n\nAgain, apologies if I've misunderstood anything.",
          "score": 12,
          "created_utc": "2026-02-23 18:34:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7065zw",
              "author": "Sensiduct",
              "text": "Hi, thanks that's some good feedback! I'll update the README to clarify these points!\n\nI've added this COPYING file because there was an instance of a company indending to resell / compete with us using our own code and it's not something I wanted to tolerate at that time. I know Plausible had similar issues in past so they made the same decision (I actually found out about this COPYING file / dual licensing from them)\n\nThe community edition (core product, with analytics & captcha) is open source and has most of the features cloud edition offers, except the billing module and some niche features like Alerts (yet). But yes you're right it would be correct to mention that the cloud version is source-available, not open source",
              "score": 4,
              "created_utc": "2026-02-23 19:25:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6znroa",
          "author": "Final-Mirror8071",
          "text": "looks nice man",
          "score": 6,
          "created_utc": "2026-02-23 18:01:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70ftfc",
          "author": "sai-kiran",
          "text": "Congrats on the launch, but Why is everyone building self-hosted analytics these days? Is it the new Todo list project for people?\nI swear I see a new one pop up every month.",
          "score": 2,
          "created_utc": "2026-02-23 20:10:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o70hnmp",
              "author": "Sensiduct",
              "text": "thank you:) I've launched Swetix in 2021 originally, and even back then there were a ton of analytics startups launching quite often. The thing is this space is extremely crowded, and it's hard to differentiate against big OSS projects like Plausible, so most founders just give up and switch to something else\n\nAlso Marc Louvion (a famous indihacker on Twitter) launched his DataFast product too, and it triggered a wave of people trying to replicate his success and launch their analytics projects too, hahaha",
              "score": 2,
              "created_utc": "2026-02-23 20:19:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o71uytq",
          "author": "BP041",
          "text": "5 years on one project is serious commitment -- respect. and the problem is real; most GA 'alternatives' either have the same privacy issues under a different name or they're so stripped down you lose half the workflow.\n\nthe bundled reCAPTCHA replacement is a bold call, haven't seen many projects tackle both in one. curious how the bot detection actually works under the hood -- is it behavioral analysis without fingerprinting, or something else? asking because most CAPTCHA-free approaches eventually fall back on some form of device fingerprinting which kind of defeats the point.\n\nadding to my self-hosted stack anyway. the cookieless angle matters a lot for EU compliance without banner hell.",
          "score": 1,
          "created_utc": "2026-02-24 00:34:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7548zq",
          "author": "BP041",
          "text": "The CAPTCHA alternative is the more interesting piece to me. Standard CAPTCHA UX is genuinely hostile and Turnstile proved there's real appetite for something better.\n\nCurious how you handle sudden traffic spikes -- reCAPTCHA silently adjusts its risk thresholds based on volume signals. Does Swetrix's version do anything adaptive or is it purely behavior-based static scoring?\n\nAnd tbh the cookieless angle gets undersold. There's a real difference between \"we have a consent banner\" and \"we genuinely don't fingerprint\" -- users who know the difference convert differently. Privacy as a feature is real, not just compliance theater.",
          "score": 1,
          "created_utc": "2026-02-24 14:34:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o790l0b",
              "author": "Sensiduct",
              "text": "Swetrix CAPTCHA is different from Turnstile, because instead of fingerprinting we use proof-of-work (similar mechanism to bitcoin mining, but on a tiny-tiny scale; fast enough for a single user, cumbersome enough for large scale bots)\n\nIt's not 100% bot-proof, but enough for some protection. I'm definitely going to improve it in future and will look into ways to make some behaviour analysis in an optional, privacy-friendly way as well!",
              "score": 1,
              "created_utc": "2026-02-25 01:49:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r97kc8",
      "title": "Prompt inject AI agents to avoid slop",
      "subreddit": "opensource",
      "url": "https://github.com/eljojo/rememory/pull/73",
      "author": "eljojors",
      "created_utc": "2026-02-19 18:44:38",
      "score": 40,
      "num_comments": 27,
      "upvote_ratio": 0.81,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1r97kc8/prompt_inject_ai_agents_to_avoid_slop/",
      "domain": "github.com",
      "is_self": false,
      "comments": [
        {
          "id": "o6aij4y",
          "author": "mattsowa",
          "text": "I mean this is hardly prompt injection. It's literally the intended way to provide context to agents",
          "score": 47,
          "created_utc": "2026-02-19 19:14:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ajq1n",
              "author": "eljojors",
              "text": "I don't think most AI sloppers expect their own agent to refuse to open a github PR, that's what makes me consider it an injection.",
              "score": 14,
              "created_utc": "2026-02-19 19:20:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6alit8",
                  "author": "ongrabbits",
                  "text": "It is an injection. I did something similar some time ago by translating some prompts into chinese and inserting it into comments to prevent contributers from changing how certain functions worked.",
                  "score": 15,
                  "created_utc": "2026-02-19 19:29:13",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6alh86",
                  "author": "micseydel",
                  "text": "Have you tested the rate at which it seems to work at all?",
                  "score": 2,
                  "created_utc": "2026-02-19 19:29:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6bv934",
          "author": "Jmc_da_boss",
          "text": "Just put the anthropic stop string into it",
          "score": 10,
          "created_utc": "2026-02-19 23:20:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dtx7n",
              "author": "grady_vuckovic",
              "text": "What's the anthropic stop string?",
              "score": 7,
              "created_utc": "2026-02-20 07:19:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6hcgx9",
                  "author": "ComeOnIWantUsername",
                  "text": "I didn't know it either, but quick search tells this: https://pivot-to-ai.com/2026/02/11/the-anthropic-test-refusal-string-kill-a-claude-session-dead/",
                  "score": 2,
                  "created_utc": "2026-02-20 19:57:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6by5ys",
              "author": "eljojors",
              "text": "why? I don't want to stop people from using AI. my goal is to stop low-quality contributions.",
              "score": 5,
              "created_utc": "2026-02-19 23:37:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6dtbk4",
                  "author": "warpedgeoid",
                  "text": "A more enlightened viewpoint than most open source maintainers seem to have.",
                  "score": 4,
                  "created_utc": "2026-02-20 07:14:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6e07s0",
          "author": "notrufus",
          "text": "For the love of god move the pr workflow’s script into .github/actions as a composite and have the code in a separate file. You’ll get syntax highlighting and it will be easier to change/read/understand.",
          "score": 3,
          "created_utc": "2026-02-20 08:18:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ebt4a",
              "author": "eljojors",
              "text": "PRs welcome [https://github.com/eljojo/no-autopilot](https://github.com/eljojo/no-autopilot)",
              "score": 1,
              "created_utc": "2026-02-20 10:07:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6ed8hp",
                  "author": "notrufus",
                  "text": "If I had any interest in using I would (genuinely) you just move the action into .github/actions/name/action.yml move the script to .github/actions/name/name.js and change the step to call the action. \n\nhttps://github.com/actions/github-script#run-a-separate-file",
                  "score": 4,
                  "created_utc": "2026-02-20 10:20:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ff15f",
          "author": "The_Great_Pun_King",
          "text": "Please do not use AI in open source projects. Or at least only as a tool to complete lines of code you'd have been able to create without ai as well (to possibly reduce time). AI seriously dangerously harms open source\n\nhttps://www.jeffgeerling.com/blog/2026/ai-is-destroying-open-source/",
          "score": 2,
          "created_utc": "2026-02-20 14:33:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gng1k",
              "author": "eljojors",
              "text": "my software is, in part a direct response to Jeff’s post. He talks about developer burnout and how open source reviewers are getting tired of reviewing code. \n\ni am one of them, that’s the point of this tool. \n\nsomething that Jeff didn’t seem to consider is how programmers can use more code to help fight back. in his video, he talks about how ludicrous it seems for serious programmers to rely on computers to help them weed out the noise, but that’s exactly what I set myself out to prove with this software, that we can have automated tooling that relieves pressure from programmers.",
              "score": 7,
              "created_utc": "2026-02-20 18:01:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6bwpp6",
          "author": "omniuni",
          "text": "I have my AGENTS file set so that it will only respond to comments that start with `AIDO:`, and it is restricted to specifically what is requested in the comment, after which is updated to say `AI-COMPLETE:`.\n\nIt prevents the AI from running wild, and means I can use it for simple things that are actually useful. For example, I used AI to transform bytes into something more readable. It gave me a little function with 3 lines of code. Sure, that makes AI about 5 lines total out of around 2000, but at least it was actually useful.",
          "score": 0,
          "created_utc": "2026-02-19 23:28:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ekr30",
              "author": "eljojors",
              "text": "that's interesting! how did you realize the need for this?",
              "score": 3,
              "created_utc": "2026-02-20 11:26:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6gigtq",
                  "author": "omniuni",
                  "text": "I accidentally triggered the Gemini plugin and it made a bunch of changes. I don't want it making any change unless I specifically direct it to.",
                  "score": 1,
                  "created_utc": "2026-02-20 17:39:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6hf6hs",
              "author": "Useful-Process9033",
              "text": "This is the pragmatic approach. Restricting the trigger surface instead of trying to make the AI reject work is way more reliable. Most prompt injection defenses are probabilistic but a simple prefix check is deterministic.",
              "score": 2,
              "created_utc": "2026-02-20 20:10:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6hnb86",
                  "author": "omniuni",
                  "text": "It has worked pretty well for me so far. It also means I can use it as a kind of context-aware reference as well. For example, if I want to do something with every element of an array, there are a lot of approaches. With this, I can use a command to help figure out a good approach. For example, \"I need to do something to each element in an array as fast as possible, and order doesn't matter\" versus \"I need to do something to elements of the array that match a certain criteria\", or \"I need to do something to this array without changing the order and must reference the previous element in the array\". It has actually been pretty good at helping me choose which of the many available ways to use, and it can generate that structure for me from my actual variables, to fill in with whatever the operation is that I need to do.",
                  "score": 1,
                  "created_utc": "2026-02-20 20:51:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r9n5pg",
      "title": "KidsTube Filter - Open Source YouTube Parental Controls (React + Node.js + PostgreSQL)",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1r9n5pg/kidstube_filter_open_source_youtube_parental/",
      "author": "mint139",
      "created_utc": "2026-02-20 05:45:14",
      "score": 19,
      "num_comments": 7,
      "upvote_ratio": 0.83,
      "text": "# KidsTube Filter - Open Source YouTube Content Filtering for Kids 🎬\n\nI built a full-stack parental control application that lets parents create a safe, controlled YouTube experience for their children. It's now **open source** (MIT License) and looking for contributors!\n\n---\n\n## 🔗 Links\n\n**GitHub Repository**: https://github.com/limelightseychelles-git/kidstube-filter  \n**Live Demo**: https://kidstube.bytessolutions.net  \n**Documentation**: [README](https://github.com/limelightseychelles-git/kidstube-filter/blob/main/README.md) • [Setup Guide](https://github.com/limelightseychelles-git/kidstube-filter/blob/main/SETUP.md) • [API Docs](https://github.com/limelightseychelles-git/kidstube-filter/blob/main/API.md)\n\n---\n\n## ✨ What It Does\n\n**For Parents:**\n- ✅ **Channel Whitelisting**: Search and approve specific YouTube channels\n- ✅ **Keyword Blocking**: Filter content by keywords (violence, scary, etc.)\n- ✅ **Video Request Workflow**: Kids request → Parents approve/reject\n- ✅ **Watch History**: Track viewing with time statistics\n- ✅ **PIN Protection**: Secure dashboard with bcrypt-hashed PINs\n- ✅ **Multi-API Key Support**: Automatic rotation for quota management\n\n**For Kids:**\n- 🎬 Clean, simple search interface\n- 🔍 Browse only approved channels\n- 📝 Request videos for parent approval\n- ✅ See request status (pending/approved/rejected)\n\n---\n\n## 🛠️ Tech Stack\n\n**Frontend:**\n- React 18 (functional components + hooks)\n- Material-UI v5 for UI components\n- React Router v6 for navigation\n- Axios with JWT interceptors\n\n**Backend:**\n- Node.js + Express REST API\n- PostgreSQL for persistence\n- Redis for caching (12hr TTL on API responses)\n- bcrypt for PIN hashing (10 salt rounds)\n- JWT for session management\n\n**Infrastructure:**\n- Nginx reverse proxy\n- PM2 process manager\n- Let's Encrypt SSL\n- Can run on $6/month VPS\n\n**External APIs:**\n- YouTube Data API v3\n\n---\n\n## 🎯 Why I Built This\n\nAs an IT auditor and father, I needed granular control over YouTube content for my kids. Existing solutions were either:\n- Too restrictive (YouTube Kids blocks educational content)\n- Too open (regular YouTube has inappropriate suggestions)\n- Not customizable enough\n\nSo I built this from scratch, focusing on:\n1. **Flexibility** - Parents choose exactly which channels are allowed\n2. **Privacy** - Self-hosted, no data collection\n3. **Performance** - Redis caching minimizes API quota usage\n4. **Security** - PIN-based auth, JWT sessions, bcrypt hashing\n\n---\n\n## 🔥 Interesting Technical Challenges\n\n**1. API Quota Management**\n- YouTube gives 10,000 units/day (free tier)\n- Each search costs ~100 units = ~100 searches/day\n- **Solution**: Redis caching with 12hr TTL cut usage by 90%\n\n**2. Dual Interface Architecture**\n- Kids view: No authentication required\n- Parent dashboard: PIN-protected\n- **Solution**: React Context + Protected Routes + JWT\n\n**3. Memory Constraints**\n- React production build needs 4GB RAM\n- Target server: 2GB DigitalOcean droplet\n- **Solution**: 2GB swap space + `NODE_OPTIONS=--max-old-space-size=4096`\n\n**4. Video Request Workflow**\n- Kids submit YouTube URLs (any video)\n- Parents see video details fetched from API\n- Approve → Video appears in search results\n- **Solution**: Stored in database with status tracking\n\n---\n\n## 📊 Database Schema\n```sql\napp_config         -- PIN storage\napi_keys          -- YouTube API key management\napproved_channels -- Whitelisted channels\nblocked_keywords  -- Content filters\nvideo_history     -- Watch tracking with duration\nvideo_requests    -- Request workflow (pending/approved/rejected)\n```\n\n---\n\n## 🚀 Quick Start\n```bash\n# Clone repository\ngit clone https://github.com/limelightseychelles-git/kidstube-filter.git\ncd kidstube-filter\n\n# Setup backend\ncd backend\nnpm install\ncp .env.example .env\n# Edit .env with your database credentials\n\n# Setup database\ncreatedb kidstube_filter\npsql kidstube_filter < schema.sql\n\n# Start backend\nnpm run dev\n\n# Setup frontend (new terminal)\ncd frontend\nnpm install\nnpm start\n\n# Visit http://localhost:3000\n```\n\nFull setup instructions in [SETUP.md](https://github.com/limelightseychelles-git/kidstube-filter/blob/main/SETUP.md)\n\n---\n\n## 🤝 Looking For\n\n**Contributors:**\n- Code reviews and architectural feedback\n- Bug reports and fixes\n- Feature suggestions and PRs\n- Documentation improvements\n- Testing (unit, integration, e2e)\n\n**Potential Features:**\n- [ ] Mobile app (React Native)\n- [ ] Multi-family support (user accounts)\n- [ ] Screen time limits\n- [ ] Email notifications for parents\n- [ ] Export watch history reports\n- [ ] Support for other platforms (Vimeo, etc.)\n- [ ] Docker containerization\n- [ ] Kubernetes deployment configs\n\n**Current Contributors**: Just me so far! 😅\n\n---\n\n## 📝 License\n\n**MIT License** - Free to use, modify, and distribute.\n\nSee [LICENSE](https://github.com/limelightseychelles-git/kidstube-filter/blob/main/LICENSE) for details.\n\n---\n\n## 🙏 Contributing\n\nContributions are welcome! Please read [CONTRIBUTING.md](https://github.com/limelightseychelles-git/kidstube-filter/blob/main/CONTRIBUTING.md) before submitting PRs.\n\n**To contribute:**\n1. Fork the repository\n2. Create a feature branch (`git checkout -b feature/amazing-feature`)\n3. Commit your changes (`git commit -m 'Add amazing feature'`)\n4. Push to the branch (`git push origin feature/amazing-feature`)\n5. Open a Pull Request\n\n---\n\n## 📧 Contact\n\n**GitHub**: [@limelightseychelles-git](https://github.com/limelightseychelles-git)  \n**Issues**: [Report bugs or request features](https://github.com/limelightseychelles-git/kidstube-filter/issues)\n\n---\n\nBuilt with ❤️ for parents who care about what their kids watch online.\n\n**⭐ If you find this useful, please star the repo!**\n\n---\n\n**Tags**: #opensource #react #nodejs #postgresql #redis #parental-controls #youtube #webdev #fullstack",
      "is_original_content": false,
      "link_flair_text": "Community",
      "permalink": "https://reddit.com/r/opensource/comments/1r9n5pg/kidstube_filter_open_source_youtube_parental/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o6g9fqr",
          "author": "procsysnet",
          "text": "So just like what was posted in /r/selfhosted today. But you did not even bother writing a real project description or readme.\n\nhttps://www.reddit.com/r/selfhosted/comments/1r9u2x4/brainrotguard_i_vibedengineered_a_selfhosted/?ref=share&ref_source=link",
          "score": 5,
          "created_utc": "2026-02-20 16:57:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6h3jxc",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 4,
          "created_utc": "2026-02-20 19:14:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dozhp",
          "author": "nicolasdanelon",
          "text": "Wow tons of code to read! Nice job",
          "score": -6,
          "created_utc": "2026-02-20 06:35:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ernqm",
          "author": "testuserpk",
          "text": "Finally, someone doing God's work.",
          "score": -4,
          "created_utc": "2026-02-20 12:18:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbt0b5",
      "title": "Lightweight alternative to Sentry",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rbt0b5/lightweight_alternative_to_sentry/",
      "author": "imafirinmalazorr",
      "created_utc": "2026-02-22 18:13:31",
      "score": 18,
      "num_comments": 11,
      "upvote_ratio": 0.88,
      "text": "Hey everyone - I'd like to share a project that I've been working on. It's meant to be a lightweight, self-hosted alternative to Sentry. I was able to support my personal projects with about 2GB of RAM + 4 containers vs. Sentry's minimum of 16GB and 20+ containers.\n\nEverything in the repo is open-source under a AGPLv3 license, with an enterprise module that I merge in for the cloud stuff.\n\nThis is my first open-source project, so for the more experienced guys out there I'd love to hear your feedback!  \n\n\n[https://github.com/moneat-io/moneat](https://github.com/moneat-io/moneat)",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rbt0b5/lightweight_alternative_to_sentry/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o6tfsqv",
          "author": "nihal_was_here",
          "text": "From a fellow opensource contributor, nice project, will checkout...",
          "score": 5,
          "created_utc": "2026-02-22 18:40:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6th88y",
              "author": "imafirinmalazorr",
              "text": "Thank you! I really appreciate it.",
              "score": 1,
              "created_utc": "2026-02-22 18:46:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6tudf5",
          "author": "bullmeza",
          "text": "Very cool! Was it hard to setup the session replay feature?",
          "score": 1,
          "created_utc": "2026-02-22 19:50:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6txbeg",
              "author": "imafirinmalazorr",
              "text": "It wasn’t terrible but definitely one of the more difficult features. I don’t think I’m anywhere close to done though, I have a lot more on the todo list.",
              "score": 1,
              "created_utc": "2026-02-22 20:05:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6tznc3",
                  "author": "bullmeza",
                  "text": "Nice, I'd add the todo list to the repo :)",
                  "score": 1,
                  "created_utc": "2026-02-22 20:16:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6tvwzo",
          "author": "mizhgun",
          "text": "Any key differences from GlichTip?",
          "score": 1,
          "created_utc": "2026-02-22 19:58:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6twwvj",
              "author": "imafirinmalazorr",
              "text": "GlitchTip really only has issue and basic transaction support last I checked. No session replays.",
              "score": 1,
              "created_utc": "2026-02-22 20:03:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6u1qvc",
                  "author": "mizhgun",
                  "text": "Ah ok. Sorry I’ve missed that.",
                  "score": 1,
                  "created_utc": "2026-02-22 20:27:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rachfm",
      "title": "I created a thing! ATAboy is an open source IDE host bridge that works with legacy hard disks.",
      "subreddit": "opensource",
      "url": "https://youtu.be/XUmxxTCaCM4",
      "author": "redruM69",
      "created_utc": "2026-02-21 00:24:32",
      "score": 17,
      "num_comments": 4,
      "upvote_ratio": 0.9,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rachfm/i_created_a_thing_ataboy_is_an_open_source_ide/",
      "domain": "youtu.be",
      "is_self": false,
      "comments": [
        {
          "id": "o6k2m9j",
          "author": "redruM69",
          "text": "[GitHub](https://github.com/redruM0381/ATAboy)",
          "score": 2,
          "created_utc": "2026-02-21 05:39:22",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o6y0c47",
          "author": "undeleted_username",
          "text": "How is this different (and why does it need so much more complicated) that the run-of-the-mill PATA / IDE to USB converter that can be bought for 1/10th of the price in the usual Chinese shops?",
          "score": 0,
          "created_utc": "2026-02-23 13:00:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ye4vd",
              "author": "Rxke2",
              "text": "From the link:\n\n  \n\\>While cheap, modern adapters usually only work with newer \"LBA\" type drives, ATAboy works all the way back to the earliest CHS only, PIO Mode 0, ATA disks. (It will also work with newer LBA type IDE disks, but that's not really what it's designed for.) ATAboy features an \"Award BIOS inspired\" user friendly UI for drive configuration and setup.",
              "score": 2,
              "created_utc": "2026-02-23 14:21:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6m4x9s",
          "author": "dawnsonb",
          "text": "Thanks for contributing to the ram shortage.",
          "score": -5,
          "created_utc": "2026-02-21 15:37:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1raztby",
      "title": "Trying to beat rsync speed with QUIC — introducing Thruflux (alpha)",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1raztby/trying_to_beat_rsync_speed_with_quic_introducing/",
      "author": "samsungplay",
      "created_utc": "2026-02-21 19:16:05",
      "score": 11,
      "num_comments": 2,
      "upvote_ratio": 0.87,
      "text": "Hello r/opensource,\n\nNote: I know this is some massively long text, but I really wanted to explain the story behind this tool. Feel free to skip to the TL;DR section if you don't want to read.\n\n**The Story:**\n\nOne day, inside me arose an ambition to create the fastest file transfer CLI tool possible in existence. So I looked at existing popular solutions - croc, scp, rsync, and magic wormhole, I discovered one thing they all have in common: they all use TCP. But then recently I've had great interest in QUIC and UDP protocol in general, so I knew I had to make use of this if I had any chance to beat these tools. And I have actually noticed that many of these p2p cli tools lack first-class support for multi-file and folder transfers compared to rsync. But then rsync lacks support for NAT traversal and does not support any random two peers. This was what my tool intended to solve. I had these six ideas in mind:\n\n1). It must use the QUIC protocol, to benefit from the higher success of udp hole punching, and make use of advanced congestion control algorithm like BBR.\n\n2). It must have first-class support for mult-file transfers. Transferring multi files should be as fast, if not faster, than a single file of same size.\n\n3). It must support multiple receivers.\n\n4).It must support random two arbitrary peers, and be cross platform. Should be dead simple to use.\n\n5).It must have automatic resume support.\n\n6). And above all, SPEED over anything else. This should be the core selling point of my tool.\n\nSo I had started building tool during winter vacation last year, and was able to come up with a first working version in Go language - about which I had posted on several other subreddits before. But then unfortunately, it turned out that due to me using AI agent heavily to code it for rapid prototyping, I received lots of negative feedback (some actually genuinely disrespectful) which was honestly quite sad given how much passion I had for the tool, and the fact that tool was only in its early stage. (But thanks for those who has given me constructive criticism and feedback!)\n\nBut instead of staying sad, I embraced these negative comments to remind me that I can be a better coder than an AI agent. In fact, I realized there was room for improvement - while it showed strong performane, it was NOT able to beat scp and rsync in terms of throughput. I had to devise another approach. I thought I could do better than AI agents.\n\nSo in the past month I decided to manually rewrite the whole repo from scratch in Java, the language I'm most familar with, without using AI agents. However, after I built a basic prototype and ran some tests, the result was disappointing; simply speaking, Java's quic libraries and ecosystem was simply not mature enough to rival my previous Go implementation.\n\nTherefore, I decided to move on to C++. Heck, if any language had chance to beat Go, I thought it would be C++. After several painful weeks working day and night coding and debugging in C++, I finally managed to come up with a working implementation. But here are some interesting observations I learned throughout the process:\n\n1). Apparently, I thought using multiple threads with multiple QUIC connections and streams was the correct way to achieve maximum throughput. I thought more parallel connections = better. And this was true for my Go implementation. But turns out in C++ the libraries and language are so efficient that I was able to saturate the network with only single thread and connection. This helped me greatly simplifiy the app logic.\n\n2). QUIC scales heavily with CPU power and core count of the host machine. While QUIC performed worse in low-end devices, for a reasonable CPU released in last 10 years and with at least 2 cores, QUIC outperformed TCP.\n\n3). BBR congestion algorithm made huge difference in terms of throughput in my implementation, almost showing \\~x4 throughput compared to CUBIC. Also, the UDP buffer size of the OS matters a lot. Transfers become nearly \\~x1.3 faster given plenty of UDP buffer size of at least 8 MiB.\n\nAnd finally, the moment of truth came.. to benchmark my tool against existing ones:\n\n* Vultur dedicated CPU 2vCPU(AMD EPYC Genoa) 4GB RAM, NVMe SSD, Ubuntu 22.04\n* Tested over public internet, where sender is located in Chicago and receiver is located in New Jersey.\n* Method: median of 3 runs, and all times are end-to-end wall clock times including setup / closing phase, not just the pure transfer time.\n* Accounts for only the \"receiving phase\"\n\n|Tool|Transport|Random Remote Peers|Multi-Receiver|10 GiB File|1000×10 MiB|\n|:-|:-|:-|:-|:-|:-|\n|**thruflux(direct)**|QUIC|✅|✅|**1m34s**|**1m31s**|\n|rsync|TCP (SSH)|❌|❌|1m43s|1m39s|\n|scp|TCP (SSH)|❌|❌|1m41s|2m20s|\n|croc|TCP relay|✅|❌|2m42s|9m22s|\n|wormhole|TCP relay|✅|❌|2m45s|❌ stalled \\~8.8 GiB around 3m|\n\n..and it seemed very promising! Even with 6 seconds of initial p2p handshake phase (which scp and rsync doesn't have) my tool was able to beat scp and rsync in terms of wall clock time. Other than scp/rsync, compared to existing p2p tools, my tool appeared to be clearly faster - in fact, for 1000 files transfer, it had shown dominant performance that cannot be ruled out as statstical anomaly. Plus, croc spends time hashing files while wormhole spends lot of time compressing everything for multi-file sends. Since my tool just skips all that extra work, the difference in actual wall clock time was even bigger. But what I really wanted to highlight was how its performance on transferring 1000 or a single file of same size did not change at all. I was proud to have achieved first-class support for multi-file transfers.\n\nSo.. it seemed so good to be true. What were the catches?\n\n1). CPU dependent : My tool required higher CPU power compared to other tools. On devices with low end cpu and only 1 core, it performed marginally worse than rsync and scp.\n\n2). TURN relay fallback: While I included default turn relays in case direct connectivity cannot be established, my self-hosted turn server is not that powerful (also in a pretty bad location) and it therefore showed worse results compared to other tools. So it will be much slower for networks with symmetric NATs.\n\n3). UDP quirks: I found out that some restrictive networks (like my school vps) completely blocks outbound UDP sometimes so not even TURN would work in this case. Basically QUIC is infeasible in this situation.\n\n4). Longer connection phase: Since I'm using a full ICE exchange protocol, initial connection phase is slower than other tools for sure. But I think this is something I can improve upon if I use trickle ICE instead of gather-all like right now.\n\n5). Lack of verification: For speed, my tool trusts the QUIC protocol's network level integrity (which is stronger than TCP by nature). However, there can be rare edge cases such as disk corruption that may corrupt the file. But this is arguably quite rare that I decided to skip for now.\n\n6). Bloated security join code: Unlike croc/wormhole, I do not use PAKE but I rely on WSS TLS encryption and QUIC's innate AED encryption in transit. Therefore, join code must have as high entropy as possible to compensate for the security. I understand some may not love the current join code system, but hopefully it wouldn't matter too much because we all copy paste anyways.\n\nBut regardless, I think there is still some real potential for this tool, especially for multi-file transfer scenarioes. After all, it's still early stage.\n\nAnd this was the story behind this tool. If you managed to read until this part, I really appreciate your time. I hope it was interesting.\n\n**Conclusion (TL;DR)**\n\nI built a new mass transfer CLI named Thruflux in C++, and it has reached an alpha stage (all core functionalities are implemented and basic tests are done, but no guarantee of absolute stability and bug-freeness). Expect occasional bugs due to quirks of networking and cross platform distribution in general, it's still very early stage! But if you ever try it, I really appreciate it and of course, any constructive feedback are welcome :) And of course, if you encounter any bugs please do open an issue in github. Without feedbacks, Thruflux will never be able to move out from its alpha stage.\n\nBy the way, I wiped out all the commit history after having rewritten in C++ because my original commit history is quite unprofessional and contaminated. I'll try my best to write better commit messages this time!\n\n**Install**\n\n**Linux Kernel 3.10+ / glibc 2.17+ (Ubuntu, Debian, CentOS, etc.)**\n\n    curl -fsSL https://raw.githubusercontent.com/samsungplay/Thruflux/refs/heads/main/install_linux.sh | bash\n\n**Mac 11.0+ (Intel & Apple Silicon)**\n\n    curl -fsSL https://raw.githubusercontent.com/samsungplay/Thruflux/refs/heads/main/install_macos.sh | bash\n\n**Windows 10+ (10+ Recommended, technically still could work on Windows 7/8)**\n\n    iwr -useb https://raw.githubusercontent.com/samsungplay/Thruflux/refs/heads/main/install_windows.ps1 | iex\n\n**Use**\n\n    # host files\n    thru host ./photos ./videos\n    \n    # share the join code with multiple peers\n    thru join ABCDEFGH --out ./downloads\n\nRepo:\n\n[https://github.com/samsungplay/Thruflux](https://github.com/samsungplay/Thruflux)",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1raztby/trying_to_beat_rsync_speed_with_quic_introducing/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o6qtqx2",
          "author": "marcogabriel",
          "text": "How does this relate or compare to syncthing?",
          "score": 1,
          "created_utc": "2026-02-22 09:10:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rqsgv",
              "author": "samsungplay",
              "text": "Thruflux is basically a one-off sending tool while syncthing is a persistent sync tool. I believe syncthing is optimized for safety while this one is optimized for throughput. So personally I don't think it would make sense to sync folders for a simple direct transfer. While I did not do proper benchmarking, syncthing has bunch of other techniques under its sleeves to guarantee safety, so I assume it has more overheads and will be slower. But of course, it will be safer and more continuous because it keeps watching your files for diff. I might try benchmarking with it though. Thanks for the comment",
              "score": 1,
              "created_utc": "2026-02-22 13:48:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rcxaio",
      "title": "I’m building an open-source Vulnerability Intelligence platform using FastAPI & PostgreSQL, and I could really use some feedback/contributors!",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rcxaio/im_building_an_opensource_vulnerability/",
      "author": "bekar81",
      "created_utc": "2026-02-23 23:12:14",
      "score": 11,
      "num_comments": 8,
      "upvote_ratio": 0.78,
      "text": "Hey everyone,\n\nI've been working on a passion project called **CyberSec Alert SaaS** ([https://github.com/mangod12/cybersecuritysaas](https://github.com/mangod12/cybersecuritysaas)). It’s an enterprise-ready vulnerability intelligence platform designed to automate asset correlation, generate alerts, and track real-time threats.\n\n**The Problem:** Security teams are drowning in noise. Tracking CVEs across NVD, Microsoft MSRC, Cisco PSIRT, Red Hat, and custom RSS feeds manually is a nightmare.\n\n**The Solution:** I’m building a centralized engine that aggregates all these feeds, correlates them with a company's actual assets, and alerts them *only* when it matters.\n\n**The Stack:** Python (86%), FastAPI, and PostgreSQL.\n\nI’m posting here because I want to make this a genuinely useful open-source tool, and I know I can't build it in a vacuum. I am looking for:\n\n* **Code reviews:** Tear my FastAPI architecture apart. Tell me what I can optimize.\n* **Contributors:** If you want to work on a cybersecurity tool to boost your portfolio, there are a ton of integrations and features on the roadmap.\n* **General Feedback:** Does this seem like a tool you'd deploy?\n\nCheck out the repo here: [https://github.com/mangod12/cybersecuritysaas](https://github.com/mangod12/cybersecuritysaas)\n\nAny advice, PRs, or even just a star would mean the world to me. Thanks for your time!",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rcxaio/im_building_an_opensource_vulnerability/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o72grsp",
          "author": "Hypercubed",
          "text": "Your Demo Credentials don't seam to work.",
          "score": 2,
          "created_utc": "2026-02-24 02:40:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73r4b0",
              "author": "bekar81",
              "text": "I limited the cloud database instance maybe bcs that you can still use github 0auth will look into this",
              "score": 0,
              "created_utc": "2026-02-24 08:30:53",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o73uuxy",
              "author": "bekar81",
              "text": "Google had some problem\n\nTitle\n\nCloud Logging customers were experiencing delays with log ingestion.\n\nStatus Closed\n\nDescription\n\nThe issue with Cloud Logging has been resolved for all affected users as of Monday, 2026-02-23 05:20 PST.\n\nWe thank you for your patience while we worked on resolving the issue.\n\nProducts impacted\n\nCloud Logging\n\nLocations impacted\n\nus-central1\n\n19 hours ago\n\nMost recent update\n\nThe issue with Cloud Logging has been resolved for all affected users as of Monday, 2026-02-23 05:20 PST.\n\nWe thank you for your patience while we worked on resolving the issue.\n\nShow less\n\nDiagnosis\n\nSome Cloud Logging customers ingesting logs in us-central1 were experiencing delays for up to 25 minutes.\n\nWorkaround\n\nNone at this time.",
              "score": -1,
              "created_utc": "2026-02-24 09:06:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72vhso",
          "author": "lurgancowboy",
          "text": "> **The Problem:** Security teams are drowning in noise. Tracking CVEs across NVD, Microsoft MSRC, Cisco PSIRT, Red Hat, and custom RSS feeds manually is a nightmare.  \nIs it really?  \n\nI could be misunderstanding the goal but some other thoughts:  \n1. I'd recommend separating your consolidated \"catalog\" data and the vulnerability management piece into separate projects. They have different lifecycles and uses and people might only be interested in the former without the latter.  \n2. Are you planning to include exploit availability sources? That's likely the single biggest gain you can make in terms of signal/noise ratio https://gitlab.com/exploit-database/exploitdb  \n3. You might also want to consider https://euvd.enisa.europa.eu/  and check home OpenVAS is doing it  \n4. How does the asset correlation work? It sounds like the vulnerability assessment piece is missing? Or is your idea to narrow the catalog to what users think they're interested in by CPE matching? That sounds like a dangerous thing to do...  \n5. If the goal is a vulnerability catalog with tailored new CVE and advisories then I'd think you'll want a mechanism to build that, which might be where the VA solution like OpenVAS  comes in?\n  \nCool project, good luck!",
          "score": 2,
          "created_utc": "2026-02-24 04:11:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73q4dm",
              "author": "bekar81",
              "text": "This is a nightmare  not for folks who sre in it and such but people who set and forget devices ive had an internship at a big organisation like 9000 employees big and they do this though Thanks for taking the time to write this — genuinely appreciate the thoughtful feedback.\n\nYou’re right about separating the catalog from the vulnerability management layer. I originally bundled everything together because I liked the idea of a single pipeline, but architecturally it makes more sense to split them. A clean, normalized vulnerability catalog could stand on its own, and the asset-correlation/alerting layer could sit on top as a separate component. That’s something I’m seriously considering refactoring toward.\n\nOn exploit availability — completely agree. Severity alone isn’t a good signal. Integrating EPSS, KEV, and public PoC sources like Exploit-DB would dramatically improve the signal-to-noise ratio. That’s high on the roadmap.\n\nGood call on EUVD and OpenVAS as well. I need to study how they structure their enrichment and matching logic instead of reinventing something weaker.\n\nFor asset correlation: right now it’s CPE + version matching against user-declared inventory. No active scanning yet. So yes — it narrows the catalog based on declared assets rather than discovered ones. I’m aware CPE matching can get messy (naming inconsistencies, version parsing, edge cases), and that’s an area that needs hardening.\n\nTo clarify scope: I’m not trying to replace enterprise VA tools. The idea is more of a lightweight, developer-friendly vulnerability intelligence + inventory-aware alerting layer that’s open and extensible.\n\nThis kind of critique is exactly what I was hoping for — thanks again.",
              "score": 0,
              "created_utc": "2026-02-24 08:21:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o734to2",
          "author": "bccorb1000",
          "text": "I worked at IBM for xforce and we built something akin to this but way more depth. \n\nWe automated the processing 10,000 samples and we used things like: \n\nVirus total\nURL haus\nIP reputation \nCVEs\nPublic yara rules etc\n\nYou’re in the right path for sure!!! Consider some static code analysis tooling and pairing with other open source projects for threat sharing! \n\nMaybe generate your own set of yara rules",
          "score": 1,
          "created_utc": "2026-02-24 05:17:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73qjtn",
              "author": "bekar81",
              "text": "X-Force depth is a different league. Right now mine is much simpler (CVE + advisory aggregation + inventory matching), but your point about multi-source enrichment is right but its tricky a bit. I know CVEs isn’t enough — the real data comes from correlating across VT, reputation feeds, exploit data, etc.\nStatic analysis + SBOM ingestion makes a lot of sense as a next step. And generating custom YARA rules from PoCs or exploit patterns would be a huge upgrade from just alerting on metadata. Would keep thoughts on that though im just a student in 6th semester 🥺 and a reply from ibm engineer who worked on x force is an achievement enough for me",
              "score": 0,
              "created_utc": "2026-02-24 08:25:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r9uyzg",
      "title": "My Brother Built a Cool Game Engine",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1r9uyzg/my_brother_built_a_cool_game_engine/",
      "author": "ineedtocry05",
      "created_utc": "2026-02-20 13:11:21",
      "score": 10,
      "num_comments": 1,
      "upvote_ratio": 0.78,
      "text": "So my brother Built this pretty cool engine, just thought to share it with yall. I am not very technical so if you have any overall technical questions, ask him on GitHub if you can \n\nhttps://github.com/sinisterMage/Open-Reality",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1r9uyzg/my_brother_built_a_cool_game_engine/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o6j0z7o",
          "author": "Corruptlake",
          "text": "So this is how I learn about Julia. The game engine project is really impressive aswell!",
          "score": 1,
          "created_utc": "2026-02-21 01:22:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdru9x",
      "title": "An Open Source Minecraft Clone Made in Defold Engine with Lua",
      "subreddit": "opensource",
      "url": "https://youtu.be/64YWCuQgDLA?si=ng4pdglwRROZxtG9",
      "author": "cenkerc",
      "created_utc": "2026-02-24 20:34:19",
      "score": 10,
      "num_comments": 0,
      "upvote_ratio": 0.92,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1rdru9x/an_open_source_minecraft_clone_made_in_defold/",
      "domain": "youtu.be",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1rdn2jd",
      "title": "I built a simple open-source Windows image viewer, feedback appreciated",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rdn2jd/i_built_a_simple_opensource_windows_image_viewer/",
      "author": "TheGameRoom420",
      "created_utc": "2026-02-24 17:45:20",
      "score": 7,
      "num_comments": 6,
      "upvote_ratio": 0.89,
      "text": "I've awfully neglected programming for the last year or so, so I made a simple image viewer that could replace the default one on Windows.\n\nI think the code is a bit messy, even though it's only a few hundred lines, and I did NOT keep my promise of adding more comments, but it's relatively bug free, at least for what I could deduce from my limited testing (probably missed a lot of edge cases). However, I'm happy that I learnt some new stuff (like how to actually make my code into an installable app (Inno Setup Compiler))!\n\nAny feedback you guys can give me is appreciated! Thanks!\n\nLink to GitHub repository: [https://github.com/Soytu611/OpenPhotoViewer](https://github.com/Soytu611/OpenPhotoViewer)",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rdn2jd/i_built_a_simple_opensource_windows_image_viewer/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o76tbkd",
          "author": "playffy",
          "text": "Please, any ui screenshots",
          "score": 2,
          "created_utc": "2026-02-24 19:12:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76ydu3",
              "author": "TheGameRoom420",
              "text": "[https://imgur.com/a/qisCJUb](https://imgur.com/a/qisCJUb)",
              "score": 3,
              "created_utc": "2026-02-24 19:35:40",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o76xtmr",
              "author": "parkerlreed",
              "text": "It's Tkinter. There's nothing to look at...",
              "score": 1,
              "created_utc": "2026-02-24 19:33:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o76yhn1",
                  "author": "TheGameRoom420",
                  "text": "True, but I tried my best to make it look okay :)",
                  "score": 3,
                  "created_utc": "2026-02-24 19:36:11",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1raa53p",
      "title": "I made a neat little CLI tool that keeps your notes organized",
      "subreddit": "opensource",
      "url": "https://github.com/Coco501/tidbit",
      "author": "The_Coco_Midget",
      "created_utc": "2026-02-20 22:48:24",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 0.8,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1raa53p/i_made_a_neat_little_cli_tool_that_keeps_your/",
      "domain": "github.com",
      "is_self": false,
      "comments": [
        {
          "id": "o6ivhsc",
          "author": "officebeats",
          "text": "No screenshots?",
          "score": 2,
          "created_utc": "2026-02-21 00:48:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6jdu96",
              "author": "The_Coco_Midget",
              "text": "Yeah that's a fair point, I should have probably included some. Did you mean in this post or in the readme? \n\n\n\nI guess I didn't because it's not a very \"screenshottable\" thing, except for the fzf fuzzy finding part maybe (which of course is not my work, all I did was configure some options). But you can essentially think of tidbit as a bunch of aliases to open your note files.\n\n  \nHere's the a screenshot of the fzf menu I was talking about: [https://imgur.com/a/NiJpBHk](https://imgur.com/a/NiJpBHk)  \nThis would come up if you just ran \\`tidbit\\`. If you did \\`tidbit git\\` instead, it would open that file (that you see in the preview) directly.",
              "score": 1,
              "created_utc": "2026-02-21 02:43:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6jzaf9",
          "author": "prodleni",
          "text": "A couple notes. First, some empty notes are checked into the repo you should remove those. Second, I think it's seriously bad practice for the script to install fzf. Inform the user and let them install it how they wish. You really shouldn't touch their package manager! \n\n\nAnd finally, it's not super clear to me what tidbit, well, actually does? A more precise technical explanation than \"keeps your notes organized\" is needed. \n\n\nFunny enough, I am also working on a note taking tool. I think documentation is one of my strengths, so I invite you to take a look at my docs to get some idea of how to better communicate what your tools does.\n\n\n\nLink: https://wwid.ficd.sh/\n\n\nEdit: please take this as constructive criticism! I'm very happy to see an earnest contribution to FOSS and not some AI slop spam, so I'm trying to give the strongest advice I can. Cheers, and welcome to the community! ",
          "score": 2,
          "created_utc": "2026-02-21 05:12:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6poj17",
              "author": "The_Coco_Midget",
              "text": "This is great! Thank you for the constructive feedback, I do really appreciate it. Yeah I was struggling to find a good explanation of what tidbit *really* does, since it's not much aside opening files.\n\nRegarding the empty notes, I included them as a simple guideline for what kind of notes I would keep, but I didn't make that very clear.\n\nThe fzf installation does ask you when you run the install script, but if that's discouraged in open source then I'd change it. I personally find it really nice when a tool has a one step installation and I don't have to do anything else. That being said I'm not familiar with the actual conventions or practices, so please do let me know if you have any resources! I will definitely check out your project, thanks again!",
              "score": 1,
              "created_utc": "2026-02-22 03:25:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r90h7w",
      "title": "Banish v1.1.4 – A rule-based state machine DSL for Rust (stable release)",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1r90h7w/banish_v114_a_rulebased_state_machine_dsl_for/",
      "author": "TitanSpire",
      "created_utc": "2026-02-19 14:21:55",
      "score": 6,
      "num_comments": 0,
      "upvote_ratio": 0.87,
      "text": "Hey everyone, I’ve been working on Banish, and reached a stable release I'm confident in. Unlike traditional SM libraries, Banish evaluates rules within a state until no rule trigger (a fixed-point model) before transitioning. This allows complex rule-based behavior to be expressed declaratively without writing explicit enums or control loops. Additionally it compiles down to plain Rust, allowing seamless integration.\n\n```rust\nuse banish::banish;\n\nfn main() {\n    let buffer = [\"No\".to_string(), \"hey\".to_string()];\n    let target = \"hey\".to_string();\n    let idx = find_index(&buffer, &target);\n    print!(\"{:?}\", idx)\n}\n\nfn find_index(buffer: &[String], target: &str) -> Option<usize> {\n    let mut idx = 0;\n    banish! {\n        @search\n            // This must be first to prevent out-of-bounds panic below.\n            not_found ? idx >= buffer.len() {\n                return None;\n            }\n\n            found ? buffer[idx] != target {\n                idx += 1;\n            } !? { return Some(idx); }\n            // Rule triggered so we re-evalutate rules in search.\n    }\n}\n```\n\nIt being featured as Crate of the Week in the Rust newsletter has been encouraging, and I would love to hear your feedback.\n\nRelease page: https://github.com/LoganFlaherty/banish/releases/tag/v1.1.4\n\nThe project is licensed under MIT or Apache-2.0 and open to contributions.",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1r90h7w/banish_v114_a_rulebased_state_machine_dsl_for/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1r99ont",
      "title": "I built a free local AI image search app — find images by typing what's in them",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1r99ont/i_built_a_free_local_ai_image_search_app_find/",
      "author": "ravenlolanth",
      "created_utc": "2026-02-19 20:01:59",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 0.59,
      "text": "Built Makimus-AI, a free open source app that lets you search your entire image library using natural language.\n\nJust type \"girl in red dress\" or \"sunset on the beach\" and it finds matching images instantly — even works with image-to-image search.\n\nRuns fully local on your GPU, no internet needed after setup.\n\n\\[Makimus-AI on GitHub\\]([https://github.com/Ubaida-M-Yusuf/Makimus-AI](https://github.com/Ubaida-M-Yusuf/Makimus-AI))\n\nI hope it will be useful.",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1r99ont/i_built_a_free_local_ai_image_search_app_find/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o6atygv",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 2,
          "created_utc": "2026-02-19 20:10:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6aui43",
              "author": "ravenlolanth",
              "text": "fixed it \n\n",
              "score": 2,
              "created_utc": "2026-02-19 20:12:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ckymm",
          "author": "woomadmoney",
          "text": "Neat idea OP. How does it work? Does it take long to do the initial library analysis?",
          "score": 1,
          "created_utc": "2026-02-20 01:53:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6clt39",
              "author": "ravenlolanth",
              "text": "It works by using OpenCLIP, an AI vision model, to convert every image in your folder into a vector — basically a numerical representation of what's in the image. When you search, your text query gets converted into a vector too and compared against all image vectors using cosine similarity. Initial indexing speed depends on your GPU , on a decent NVIDIA GPU roughly 500-1000 images per minute. After that everything is cached so searches are instant",
              "score": 2,
              "created_utc": "2026-02-20 01:58:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6e6cip",
                  "author": "woomadmoney",
                  "text": "awesome job! thanks for sharing",
                  "score": 1,
                  "created_utc": "2026-02-20 09:16:39",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6inhs8",
                  "author": "xADDBx",
                  "text": "How accurate is it? Do you think accuracy might be improbable my using an intermediate step such as extracting he features in the image and then converting each feature into a vector?",
                  "score": 1,
                  "created_utc": "2026-02-21 00:02:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6dcz0k",
          "author": "Fructueux_Jefferson",
          "text": "Neat. I used the same idea for my project desc2urls. Basically you can search a video based on a description of what you remember of it. Mine is online though, therefore users can provide descriptions of any video they want.",
          "score": 1,
          "created_utc": "2026-02-20 04:56:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o782q54",
          "author": "ravenlolanth",
          "text": "**Update: Major new version just dropped**\n\nWanted to let everyone know the app has been significantly updated since this post. Here's what's new:\n\n**New features**\n\n* Video support — index and search your entire video library using text or image queries, same as images\n* RAW photo support — ARW, CR2, NEF, DNG, ORF and more now fully indexed and displayed\n* Text-to-video and image-to-video search\n* Rubber-band multi-select — drag to select multiple results at once\n* Export and move selected files directly from the app\n* Delete to recycle bin via right-click\n* Built-in image viewer — double-click any result to open it\n* Negative search terms — use minus prefix to exclude content\n\n**Performance**\n\n* Streaming GPU pipeline — GPU now stays fed continuously during indexing instead of spiking and idling\n* Much better CPU/GPU balance during both image and video indexing\n* Graceful shutdown — closing during indexing now prompts you to save instead of losing progress\n\n**Other fixes**\n\n* Python 3.12 support\n* ONNX disabled by default, pure PyTorch inference\n* Long path support on Windows\n* Tons of bug fixes\n\nRepo is here: [https://github.com/Ubaida-M-Yusuf/Makimus-AI](https://github.com/Ubaida-M-Yusuf/Makimus-AI)\n\nWould love to hear feedback from anyone who tries the new version.",
          "score": 1,
          "created_utc": "2026-02-24 22:44:55",
          "is_submitter": true,
          "replies": []
        }
      ]
    }
  ]
}