{
  "metadata": {
    "last_updated": "2026-02-11 03:30:00",
    "time_filter": "week",
    "subreddit": "opensource",
    "total_items": 20,
    "total_comments": 88,
    "file_size_bytes": 102688
  },
  "items": [
    {
      "id": "1qyp3u2",
      "title": "Sudo maintainer, handling utility for more than 30 years, is looking for support¶ Many vital open source resources rely on the devotion of a few individuals",
      "subreddit": "opensource",
      "url": "https://www.theregister.com/2026/02/03/sudo_maintainer_asks_for_help/",
      "author": "Mcnst",
      "created_utc": "2026-02-07 20:53:33",
      "score": 650,
      "num_comments": 44,
      "upvote_ratio": 0.99,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1qyp3u2/sudo_maintainer_handling_utility_for_more_than_30/",
      "domain": "theregister.com",
      "is_self": false,
      "comments": [
        {
          "id": "o456yxf",
          "author": "Last_Bad_2687",
          "text": "Wow 'sudo' is buried on his resume, a single line item under 'projects'. Dude needs to give himself way more credit ",
          "score": 203,
          "created_utc": "2026-02-07 21:02:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45byvs",
              "author": "Mcnst",
              "text": "But `sudo.ws` is literally in his email right at the top of the resume!\n\nIt sounds like he worked on `sudo` as part of his last gig from 2016 through 2024, and it's mentioned there as such, under multiple bullet points.  Sounds like he managed to get a gig to work specifically on sudo as part of his main job, and for so many years at that!  Lucky Todd!\n\nAs an OSS developer myself, I always found it difficult to list the OSS affiliations and contributions on my resume.  The less technical people often have the mistaken opinion that if you're not paid for your work, then it's not ….  I think it's difficult in general to list it in a way that wouldn't still leave someone confused.",
              "score": 59,
              "created_utc": "2026-02-07 21:28:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o45n1hq",
                  "author": "Last_Bad_2687",
                  "text": "Yeah totally understand. Not an OSS developer, or even a developer but from my friends who are in the space, the money vs impact debate is always weird ",
                  "score": 15,
                  "created_utc": "2026-02-07 22:28:56",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o47t5a3",
                  "author": "ArcYurt",
                  "text": "hes worked on it since the 90s",
                  "score": 6,
                  "created_utc": "2026-02-08 07:20:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o48lgoo",
                  "author": "jorgecardleitao",
                  "text": "Look for \"Doughnut Economics: Seven Ways to Think Like a 21st-Century Economist\" - the author uses OSS as an example where current economic models completely miss the mark in assigning value to a human activity.",
                  "score": 2,
                  "created_utc": "2026-02-08 11:46:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o459x31",
              "author": "ADMINISTATOR_CYRUS",
              "text": "where did you find the resume",
              "score": 12,
              "created_utc": "2026-02-07 21:18:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o45ajo9",
                  "author": "Mcnst",
                  "text": "https://www.millert.dev/resume/",
                  "score": 14,
                  "created_utc": "2026-02-07 21:21:22",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o496b3i",
          "author": "Candid_Koala_3602",
          "text": "This is the one dude maintaining that one critical repo with no support for decades that our entire society rests on. You’ve seen the meme.",
          "score": 22,
          "created_utc": "2026-02-08 14:14:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f4d4p",
              "author": "joshdavislight",
              "text": "Nebraska guy",
              "score": 4,
              "created_utc": "2026-02-09 12:01:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o45nc37",
          "author": "Last_Bad_2687",
          "text": "Dumb question but why doesnt the EFF have a fund for this? ",
          "score": 26,
          "created_utc": "2026-02-07 22:30:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o462864",
              "author": "Mcnst",
              "text": "> Dumb question but why doesnt the EFF have a fund for this? \n\nBecause `sudo` has no direct relationship to digital privacy or free speech.",
              "score": 38,
              "created_utc": "2026-02-08 00:00:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o46l8j7",
                  "author": "Last_Bad_2687",
                  "text": "Is there any organization (Linux foundation, OSI) that's has some fund for solo devs of critical infrastructure? Seems like someone should be siphoning some of the billions made on the backs of these projects to provide *some* support to the maintainers ",
                  "score": 16,
                  "created_utc": "2026-02-08 01:57:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o45hd2f",
          "author": "SmileyBMM",
          "text": "I hope he gets more support, even if I don't use sudo myself.",
          "score": 16,
          "created_utc": "2026-02-07 21:57:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49mp2j",
          "author": "No-Spinach-1",
          "text": "Sometimes I struggle to understand the motivation of someone contributing like this to a project, without being paid for it. \n\nWe all sell our time for something. Joy, money, whatever. But when joy brings money to others... It's difficult for me to understand. More with this case, with no sponsors behind, just for the community. Admirable for sure but hard to handle how so many successful businesses rely on your open source contribution. More when recruiters might not understand what you've been doing. Huge respect for this dude, really",
          "score": 5,
          "created_utc": "2026-02-08 15:43:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4b37z9",
          "author": "ShaneCurcuru",
          "text": "This is more than a financial sustainability issue (whether here, for a sole individual, or for other small groups that maintain tools), it's also a governance and security issue, as the xz utils compromise showed.  It's not just that this lone developer wants to make a living, it's also (especially for security-related tools) a potential vector for a hidden bad actor to step up and try to become the new maintainer.  Happens rarely, but people really need to consider maintainer handoffs as well.",
          "score": 4,
          "created_utc": "2026-02-08 19:55:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4e9nur",
          "author": "titoshadow",
          "text": "Time for SudoaaS",
          "score": 3,
          "created_utc": "2026-02-09 07:10:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4edyjo",
          "author": "Alarming_Bluebird648",
          "text": "The fact that Sudo is merely a single line item on his resume is a stark reminder of how we undervalue the invisible labor keeping modern computing functional. We desperately need a more sustainable model for funding individual maintainers of critical infrastructure.",
          "score": 2,
          "created_utc": "2026-02-09 07:51:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47qocm",
          "author": "unitedbsd",
          "text": "$sudo donate2 sudo",
          "score": 3,
          "created_utc": "2026-02-08 06:58:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fsjmq",
          "author": "Mithrandir2k16",
          "text": "I feel like e.g. the FSF or the EFF should offer a utility to track software usage and donor status, with something simple like a funding.md file where OSS project can track their funding status simply but transparently. Then people could run a tool to locally check their software usage and its funding status, then fund underfunded projects they depend on easily.\n\nBonus points if you manage to pressure large companies to contribute some percentage to the FOSS software they profit off of.",
          "score": 1,
          "created_utc": "2026-02-09 14:35:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o482wbz",
          "author": "Ytrog",
          "text": "I find even entertaining the thought of contributing to such a high-profile and security-critical project gives me the chills. I would be worried about making a mistake the entire time 😱",
          "score": 1,
          "created_utc": "2026-02-08 08:52:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o464thj",
          "author": "rad_hombre",
          "text": "sounds like `sudo-rs` is the way forward here if this man can't find anyone to pass the torch to… and I'm not sure people will be jumping at the bit to take on that task as he himself says he expects `sudo-rs` to eventually take things over completely.",
          "score": -11,
          "created_utc": "2026-02-08 00:16:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4669to",
              "author": "Mcnst",
              "text": "In OpenBSD, `doas` has already replaced `sudo`.\n\nSudo already has quite a bit of options.  The more options a tool like this has, the bigger the attack surface.\n\nI kind of agree with many others on https://news.ycombinator.com/item?id=46858577 that it's not quite clear why sudo is even actively developed anymore at all.  Wouldn't software like this, already be quite feature complete after more than 30 years?",
              "score": 12,
              "created_utc": "2026-02-08 00:24:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o47hs98",
                  "author": "ViolentPurpleSquash",
                  "text": "Then you polish it. You optimize it. You fix all the tiny attack vectors and bugs. And whatever else you do once your project works, because a project is never truly finished",
                  "score": 6,
                  "created_utc": "2026-02-08 05:40:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o45jynr",
          "author": "94358io4897453867345",
          "text": "But no one asked for sudo ...",
          "score": -20,
          "created_utc": "2026-02-07 22:11:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r15e7h",
      "title": "I built LastSignal – a self-hosted, end-to-end encrypted dead man's switch to deliver messages to your loved ones",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1r15e7h/i_built_lastsignal_a_selfhosted_endtoend/",
      "author": "zener79",
      "created_utc": "2026-02-10 16:27:13",
      "score": 152,
      "num_comments": 25,
      "upvote_ratio": 0.96,
      "text": "I wanted a way to leave encrypted messages for the people I care about, delivered automatically if something happens to me, without trusting a third party.\n\n**LastSignal** is a self-hosted dead man's switch. You write messages, they get encrypted in the browser (zero-knowledge), and the system checks in with you periodically via email. If you stop responding, your messages are delivered.\n\nKey points:\n\n* End-to-end encrypted (XChaCha20-Poly1305 + Argon2id + X25519)\n* Zero-knowledge — even the server operator can't read messages\n* Optional trusted contact who can pause delivery\n* Rails 8 + SQLite, deploy with Docker/Kamal\n* MIT licensed\n\n🔗 [https://lastsignal.app](https://lastsignal.app)  \n🔗 [https://github.com/giovantenne/lastsignal](https://github.com/giovantenne/lastsignal)\n\nFeedback welcome, especially on the security model and UX.",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1r15e7h/i_built_lastsignal_a_selfhosted_endtoend/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o4n2hsp",
          "author": "rogfrich",
          "text": "I think this a great idea. It could be useful for all sorts of things, including practical stuff like how to get into accounts your loved ones will need, as well as sentimental goodbyes.\n\nPersonally speaking my car crash of an inbox combined with a lax approach to email management means I’d be accidentally setting it off within a week.",
          "score": 36,
          "created_utc": "2026-02-10 16:40:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4n3o8o",
              "author": "zener79",
              "text": "Thank you, that’s exactly the kind of real-world use case I had in mind: a mix of practical access to critical information and more personal, emotional messages.\n\nAnd yes, the “accidentally triggering it because of inbox chaos” problem is very real 🙂\n\nThe idea is to avoid false triggers by using repeated inactivity checks over time, configurable grace periods, and multiple reminders before anything is sent.\n\nSo it should require a clear, sustained absence, not just missing a few emails.\n\nFinding the right balance between safety and usability is one of the hardest design challenges here.",
              "score": 16,
              "created_utc": "2026-02-10 16:46:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4qaqoe",
                  "author": "inkfaust",
                  "text": "This sounds like chatgpt response tbh",
                  "score": 0,
                  "created_utc": "2026-02-11 02:25:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4n7d1b",
          "author": "SunSeek",
          "text": "Can the # of failures before delivery be manually adjusted? ",
          "score": 11,
          "created_utc": "2026-02-10 17:03:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4n8aeg",
              "author": "zener79",
              "text": "Yes, these parameters are intended to be configurable.\n\nAmong other things, you can adjust the check-in interval, how many reminder attempts are made, and the delay between each reminder. The goal is to let people tune the system to their own risk tolerance and avoid accidental delivery due to short-term inactivity.",
              "score": 10,
              "created_utc": "2026-02-10 17:07:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4n1uih",
          "author": "magnetocalorico",
          "text": "I was wondering if anything like this existed. Now I know. Would be cool to have a second way of responding that's not email (like text or a ping to an endpoint)",
          "score": 3,
          "created_utc": "2026-02-10 16:37:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4n35o3",
              "author": "zener79",
              "text": "Good point 🙂\n\nEmail is mainly used as a lowest common denominator signal: it’s universally available, works across decades, and doesn’t require maintaining a specific client or proprietary app.\n\nFor a self-hosted setup, adding other delivery channels (like Telegram, SMS, or proprietary push systems) would also significantly increase deployment and long-term maintenance complexity, which I’m trying to keep as low as possible.\n\nThat said, webhook-style integrations might be a good middle ground in the future.",
              "score": 6,
              "created_utc": "2026-02-10 16:43:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4pu9oe",
                  "author": "ThePrimitiveSword",
                  "text": "For Python there's Apprise, is there something similar for Ruby?\n\nIf not, Apprise supports running as an API and can take webhooks as input.",
                  "score": 1,
                  "created_utc": "2026-02-11 00:46:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4nbnwu",
          "author": "Blue_HyperGiant",
          "text": "Can it also automatically delete my browser history?",
          "score": 3,
          "created_utc": "2026-02-10 17:22:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ncckk",
              "author": "zener79",
              "text": "Haha, feel free to open a PR if you want to propose the feature 🙂",
              "score": 2,
              "created_utc": "2026-02-10 17:26:04",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4pge7l",
              "author": "Sancho_Panzas_Donkey",
              "text": "And my porn stash.",
              "score": 2,
              "created_utc": "2026-02-10 23:27:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4n9xur",
          "author": "GreenVim",
          "text": "Does it support backup email addresses? So it only needs a response from either of the email accounts to confirm someone is alive. If one email account started misbehaving (eg sending these to spam) then the situation could get awkward! ",
          "score": 3,
          "created_utc": "2026-02-10 17:15:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4naws9",
              "author": "zener79",
              "text": "Good question. And yes, there are a couple of safeguards for situations like that.\n\nYou can configure a **trusted contact** who is notified before the final delivery happens and can pause the process. This acts also as a last-resort safety net in case email check-ins fail for technical reasons rather than real inactivity.\n\nIn addition, each recipient can have an individual **delivery delay** before the message becomes accessible. A practical setup could be to include a secondary personal email with no delay, while keeping a longer delay for all other recipients. That way, if delivery is triggered accidentally, there is still time to intervene before sensitive messages are actually opened.",
              "score": 2,
              "created_utc": "2026-02-10 17:19:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4nxh0z",
          "author": "SessionIndependent17",
          "text": "Interesting, but I also feel like it falls under the heading \"What could go wrong??\"",
          "score": 3,
          "created_utc": "2026-02-10 19:02:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nbbkl",
          "author": "RealisticDuck1957",
          "text": "Does this presume the targeted recipient can read emails encrypted with their personal key?  Or does this utility decrypt before send, thus needing to keep a copy of the key itself?",
          "score": 2,
          "created_utc": "2026-02-10 17:21:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4nbwyo",
              "author": "zener79",
              "text": "The system is designed so the server never has access to readable message content or private keys.\n\nMessages are encrypted client-side, and recipients must choose a passphrase in advance. Only someone who knows that passphrase will be able to open and read the delivered message, without the server ever performing decryption or holding the secret.\n\nAvoiding server-side key custody is a core principle of the project, even though it introduces some usability trade-offs.",
              "score": 2,
              "created_utc": "2026-02-10 17:24:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ozbwx",
          "author": "therealhumanchaos",
          "text": "love this idea! this is a truly useful and meaningful tool",
          "score": 2,
          "created_utc": "2026-02-10 21:58:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n5r7p",
          "author": "avgdick-69",
          "text": "Thank for this man, was finding something like this!!",
          "score": 1,
          "created_utc": "2026-02-10 16:55:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4o3473",
          "author": "somjuan",
          "text": "This is excellent",
          "score": 1,
          "created_utc": "2026-02-10 19:28:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pde21",
          "author": "ThunderDragonSpice",
          "text": "What happens if the server is offline for a time, and then brought back online? Will it potentially think no response has been received, and send out the messages?",
          "score": 1,
          "created_utc": "2026-02-10 23:10:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4pebfw",
              "author": "zener79",
              "text": "Good question.\nRight now, when the server comes back online it simply resumes the reminder schedule and sends the next pending notification, rather than immediately triggering delivery.\nFor example, if the system is configured to send 8 reminders one week apart, and the server goes offline after the third reminder for three months, when it comes back online it will send the fourth reminder, not the final delivery.",
              "score": 5,
              "created_utc": "2026-02-10 23:15:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4qcnd8",
          "author": "leeharrison1984",
          "text": "Nice. I had a similar idea a few years back, but never acted on it!",
          "score": 1,
          "created_utc": "2026-02-11 02:36:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qw1t39",
      "title": "A new feature to block slop AI assisted PRs on Github, soon ?",
      "subreddit": "opensource",
      "url": "https://github.com/orgs/community/discussions/185387",
      "author": "SubliminalPoet",
      "created_utc": "2026-02-04 21:36:47",
      "score": 96,
      "num_comments": 7,
      "upvote_ratio": 0.92,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qw1t39/a_new_feature_to_block_slop_ai_assisted_prs_on/",
      "domain": "github.com",
      "is_self": false,
      "comments": [
        {
          "id": "o3v2qml",
          "author": "stan_frbd",
          "text": "I don't care if you used AI if you read the documentation of the project, thought well and used your brain. \n\nI use agents in my project because I'm not a professional developer. \n\nBut as soon as you don't understand your own code and your own logic, that's AI slop. \nPeople are starting to forget how to use their brain!",
          "score": 6,
          "created_utc": "2026-02-06 07:11:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3u9eqc",
          "author": "RoseSec_",
          "text": "I’ve started requiring signing a CLA for contributions on my open source projects that say you didn’t use AI to generate slop PRs on my open source projects. It’s worked perfectly so far",
          "score": 4,
          "created_utc": "2026-02-06 03:32:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3m5sbp",
          "author": "ruibranco",
          "text": "The discussion thread has some good proposals but I think the framing is slightly off. The problem isn't AI-assisted PRs specifically — it's low-effort drive-by contributions from people who don't understand the codebase. AI just made it cheaper to produce them at scale.\n\n  \nThe most practical suggestions from that thread:\n\n  \n\\- \\*\\*Require a linked issue before opening a PR\\*\\* — this is the single highest-signal filter. It forces contributors to communicate intent before writing code, and maintainers can close issues they don't want worked on. Most slop PRs are unsolicited \"improvements\" nobody asked for.\n\n\\- \\*\\*Restrict PRs from first-time contributors until CI passes\\*\\* — don't even notify maintainers until the PR at least builds and passes lint. This alone would kill most of the spray-and-pray submissions.\n\n\\- \\*\\*PR deletion from UI\\*\\* — the fact that maintainers still can't delete PRs (only close them) is genuinely baffling. Closed slop PRs still pollute search results and project history.\n\n  \nThe AI detection angle is a dead end though. You can't reliably distinguish AI-assisted code from human code, and you shouldn't need to — the quality bar should be the same regardless of how the code was produced. A well-crafted AI-assisted PR that follows contribution guidelines, links to an issue, and includes tests is fine. A sloppy human PR that ignores [CONTRIBUTING.md](http://CONTRIBUTING.md) is equally bad.\n\n  \nWhat maintainers actually need is better gatekeeping tools, not AI detectors.",
          "score": 14,
          "created_utc": "2026-02-04 22:38:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3o0chj",
              "author": "EnderAvni",
              "text": "Why is the most obvious llm response the only one here + with any votes lol",
              "score": 18,
              "created_utc": "2026-02-05 05:06:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3ogl16",
              "author": "xooken",
              "text": "you asked an llm this lmfao fuck off",
              "score": 15,
              "created_utc": "2026-02-05 07:19:14",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3o3wyy",
              "author": "SanityInAnarchy",
              "text": "Can't imagine issues working well.\n\nI don't entirely agree that a sloppy human PR is equally bad, though. As you say, AI made it cheaper to do at scale, and it also doesn't learn from its mistakes. Detecting AI may not be the best approach, but I think at some point we may need the kind of ML-level stuff that spamfilters use. Other than that, it's just an arms race of heuristics.\n\nI mean... think like an attacker. How would you defeat these if you wanted to just automatically spam PRs everywhere?\n\n> Require a linked issue before opening a PR\n\nCool, I'll have the chatbot open a linked issue first. Exact same slop problem in two places at once.\n\n> Restrict PRs from first-time contributors until CI passes\n\nThis could raise quality, but ultimately I'd just tell the chatbot to keep trying until the tests pass. Then, since this is spray-and-pray, I'll inevitably send out a bunch of PRs where the agent gave up and disabled tests instead of trying to fix them.",
              "score": 4,
              "created_utc": "2026-02-05 05:32:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qxyrrd",
      "title": "Parm – Install GitHub releases just like your favorite package manager",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qxyrrd/parm_install_github_releases_just_like_your/",
      "author": "houndz-",
      "created_utc": "2026-02-07 00:20:20",
      "score": 60,
      "num_comments": 14,
      "upvote_ratio": 0.95,
      "text": "Hi all, I built a CLI tool that allows you to seamlessly install software from GitHub release assets, similar to how your system's package manager installs software.\n\nIt works by exploiting common patterns among GitHub releases across different open-source software such as naming conventions and file layouts to fetch proper release assets for your system and then downloading the proper asset onto your machine via the GitHub API. Parm will then extract the files, find the proper binaries, and then add them to your PATH. Parm can also check for updates and uninstall software, and otherwise manages the entire lifecycle of all software installed by Parm.\n\nParm is not meant to replace your system's package manager. It is instead meant as an alternative method to install prebuilt software off of GitHub in a more centralized and simpler way.\n\nIt's currently in a pre-release stage, but I'm working on a v0.2.0 milestone, though there's still some work to do. If this sounds interesting to you, check it out! It's completely free and open-source and is currently released for Linux/macOS (Windows coming soon). I would appreciate any feedback.\n\nLink: [https://github.com/yhoundz/parm](https://github.com/yhoundz/parm)",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qxyrrd/parm_install_github_releases_just_like_your/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o41kaga",
          "author": "protestor",
          "text": "Note, there's two tools that work like this, mise https://mise.jdx.dev/registry.html#backends (and also aqua - mise does a lot of other things as well, and can install aqua releases) and cargo-binstall (this one does this but only for Rust programs)",
          "score": 7,
          "created_utc": "2026-02-07 07:02:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o424lc5",
              "author": "NotSoProGamerR",
              "text": "eget https://github.com/zyedidia/eget as well",
              "score": 4,
              "created_utc": "2026-02-07 10:19:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4115dx",
          "author": "Ginger_Bulb",
          "text": "Finally a fucking exe file... wait there still is code.",
          "score": 9,
          "created_utc": "2026-02-07 04:27:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41h0vq",
              "author": "Gold_Sugar_4098",
              "text": "What could go wrong? ",
              "score": 4,
              "created_utc": "2026-02-07 06:33:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o405fwu",
          "author": "Aspie96",
          "text": "Why tying it to GitHub (a proprietary platform run by Microsoft)?\n\nBy all means, support GitHub, but why not along with any other (mayor) Git host, including open source ones like Gogs and forks?\n\nThey all host git repositories.",
          "score": 9,
          "created_utc": "2026-02-07 01:04:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o406sir",
              "author": "houndz-",
              "text": "I do plan on supporting other providers (GitLab, Codeberg, etc.) later on, but I can't just seamlessly allow any Git platform to be supported because parm extracts certain metadata from the API, so I would need to build adapters to extract the equivalent metadata from GitLab/Codeberg/etc's API. I initially went with GitHub because most open-source software is hosted on there in some form. ",
              "score": 24,
              "created_utc": "2026-02-07 01:12:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o41vjos",
          "author": "mikat7",
          "text": "This looks very nice, thank you for sharing. I need a few GH releases in my `~/bin` that are not packaged in any other way, so I wrote a simple bash script to download and check for updates. This tool might finally replace that bash script!",
          "score": 2,
          "created_utc": "2026-02-07 08:49:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42aga2",
          "author": "Alarming_Bluebird648",
          "text": "Automating asset retrieval across the varied naming conventions found on GitHub is a difficult challenge to solve reliably. Does the tool provide a way to define manual overrides for repositories that use non-standard tagging or file layouts?",
          "score": 2,
          "created_utc": "2026-02-07 11:15:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zyp37",
          "author": "watercanhydrate",
          "text": "Cool idea.",
          "score": 2,
          "created_utc": "2026-02-07 00:24:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40cq3r",
          "author": "Ditsocius",
          "text": "Thank you!",
          "score": 1,
          "created_utc": "2026-02-07 01:49:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40j3fb",
          "author": "RoseSec_",
          "text": "Does it work like Aqua?",
          "score": 1,
          "created_utc": "2026-02-07 02:28:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40su2e",
          "author": "ray591",
          "text": "So like mise?",
          "score": 1,
          "created_utc": "2026-02-07 03:30:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42d1fp",
          "author": "lKrauzer",
          "text": "This is amazing, I no longer need to create install scripts that does mental chess to catch the latest versions of things from GitHub, and I can also use this on immutable distros such as SteamOS to do development there.\n\nBut let me ask something, isn't this what Homebrew is also doing? What is the difference? Afaik it also grabs stuff from GitHub.",
          "score": 0,
          "created_utc": "2026-02-07 11:39:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qys8mb",
      "title": "What happens if the license changes after I fork the repo",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qys8mb/what_happens_if_the_license_changes_after_i_fork/",
      "author": "FallenWings",
      "created_utc": "2026-02-07 23:00:57",
      "score": 56,
      "num_comments": 18,
      "upvote_ratio": 0.95,
      "text": "Pretty basic series of events. \n\n1. Repo is under open GPL3\n2. Repo is forked into new repo.\n3. Original repo changes to a less permissive license that is no longer copyleft.\n\nWhat happens to the fork? Is it forced to shut down?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1qys8mb/what_happens_if_the_license_changes_after_i_fork/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o45t9kc",
          "author": "GoodLuckCanuck2020",
          "text": "No.\n\nYour fork stays GPLv3 for the version you forked.\n\nLicense changes are not retroactive. The original author can relicense future versions, but they cannot revoke the GPL rights already granted to you.\n\nYou just can’t pull in newer code released under the new license without following that license.",
          "score": 131,
          "created_utc": "2026-02-07 23:04:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45touu",
              "author": "paul_h",
              "text": "Original author == all the copyright holders up to the moment of license change unless a CLA was in place and used … right?",
              "score": 24,
              "created_utc": "2026-02-07 23:06:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o461wvi",
                  "author": "SheriffRoscoe",
                  "text": "Right.  The proper term is \"copyright owners\".",
                  "score": 14,
                  "created_utc": "2026-02-07 23:58:45",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o493es0",
                  "author": "Pioneer_11",
                  "text": "Yeah which makes it practically impossible to change the licence for a large project unless there is text in the original licence permitting it i.e. something like \"GPLV3 or later\" or a carve out saying that you're contributions are under different terms (e.g. some legalese saying the licence is under GPL but you're contributions are MIT) .\n\nAFAIK aside from the cases above the only way to change a GPL licenced project to a non-copyleft licence is to get permission from or rewrite the code submitted by every single contributor making it almost impossible. \n\nThe one exception is that GPLV3 has a provision allowing the code to be used in an AGPL project i.e. if the project is licences under GPLV3 then the licence can be changed to AGPL but the AGPL is more copyleft than the GPL not less. \n\nTLDR with a few niche exceptions it's practically impossible to change the licencee a large GPLV3 project to anything which isn't copyleft",
                  "score": 3,
                  "created_utc": "2026-02-08 13:56:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o45uaky",
              "author": "FallenWings",
              "text": "That's basically what I expected tbh. Thank you.",
              "score": 7,
              "created_utc": "2026-02-07 23:10:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o45u3w8",
          "author": "cgoldberg",
          "text": "Nothing happens... but you can't merge upstream changes without abiding by their license.",
          "score": 17,
          "created_utc": "2026-02-07 23:09:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45tebu",
          "author": "goldman60",
          "text": "You can't retroactively change the license on already distributed code, so the fork can continue with the original license terms.  Any new code or any new forks could be prevented from the original repo but existing forks and forks of those forks are fine.",
          "score": 7,
          "created_utc": "2026-02-07 23:05:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45thsw",
          "author": "trent-7",
          "text": "No, doesn't have to shut down. The fork is still under GPL3.\n\nIt's just no longer possible to merge changes from the forked repo into the fork.\n\nBut a license change of the forked repo is just possible if all contributors agree on it.",
          "score": 8,
          "created_utc": "2026-02-07 23:05:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45z9z9",
              "author": "Extension-Tap2635",
              "text": "> But a license change of the forked repo is just possible if all contributors agree on it.\n\nNitpick: Possible if copyright holders agree on it. A contributor may relinquish copyright by signing a legal document, for example, a CLA, employee agreement, contract, etc.",
              "score": 6,
              "created_utc": "2026-02-07 23:42:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o46lt7t",
                  "author": "kirigerKairen",
                  "text": "Another nitpick: It might actually be legally impossible for the author to relinquish copyright depending on their jurisdiction, so the CLA might \"only\" guarantee something like a perpetual, irrevocable, sublicensable, … license in some cases.",
                  "score": 5,
                  "created_utc": "2026-02-08 02:00:40",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o461nmw",
                  "author": "SheriffRoscoe",
                  "text": "It's an important nit.",
                  "score": 3,
                  "created_utc": "2026-02-07 23:57:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o49rgp4",
          "author": "ultrathink-art",
          "text": "The existing answers are spot on — your fork stays GPL3. One additional detail worth noting: if the original repo had multiple contributors, the license change itself requires agreement from *all* copyright holders (unless they had a CLA granting relicensing rights).\n\nThis is why some big projects struggle to relicense even when they want to — tracking down every contributor who touched the code can be nearly impossible. If they proceed without unanimous consent, they're technically distributing code they don't have the rights to relicense.\n\nYour fork is completely safe and can continue indefinitely under GPL3. You just can't merge post-relicense upstream changes without adopting their new license terms for that merged code.",
          "score": 1,
          "created_utc": "2026-02-08 16:06:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o49tcwa",
              "author": "FallenWings",
              "text": "Ok this is where it's getting nuanced. \n\nThis is related to world of Warcraft addons/mods\n\nAccording to the ToS all addons must be distributed for free with no premium versions. \n\nA streamer has been selling an \"addon pack\" which is all his setting and addons preconfigured to look like how he does it. \n\nIt was released under openGPL3. The addons being used in the library either were all rights reserved or GPL3. \n\nBlizzard isn't enforcing the ToS. \n\nA fork was released \"unlocking\" the addon because it required a code using some hashing algorithm and because none of the code was encrypted you can just change the check function to return true. \n\nThe two authors of the pack on GitHub (the pack has some custom code mostly to automatically update settings on update or first install and locking the UI down unless you give the code) changed the license to All rights reserved. \n\nThe constituent addons in the pack are a mix of all rights reserved and openGPL3. Does this mean that everyone that worked on any of the constituent addons needs to agree to the license change explicitly? Or only people that worked on the repo.\n\nNote that some of these addons that are openGPL are more libraries than functional. Can they relicense the parts that they wrote and nothing else?",
              "score": 3,
              "created_utc": "2026-02-08 16:16:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4ey9cu",
                  "author": "micalm",
                  "text": "IANAL, but this is my understanding:  \n  \nGPL doesn't prevent anyone reselling the code or binary versions. Common misconception. \"Free as in freedom, not as in beer\", or in other words - *libre*, not necessarily *gratis*. This means you can take say the Linux Kernel for free (*gratis*) and are free *(libre)* to sell it so someone else under the same license, so then they can sell it and so on. Anyone in that chain can also redistribute it for free (*gratis*).  \n  \nBlizzard might not be enforcing the TOS *yet* \\- maybe they don't know it's being broken, maybe they don't care, but they still *could* do it at any time. Dangerous place to be in - look up \"cyberpunk VR mod\".\n\nConfig files/presets/a script to do these changes (often called *assets*) to a GPL-thing might not be GPL itself and it doesn't have to, unless a specific set of circumstances occur. \"GPL virality\" is the term to look up here.\n\nLicense cannot be changed backwards, you were already granted the license. In legal terms this is often referred to as *no taksies backsies*. If all copyright owners agreed to a license change, then any versions from that point on are under a new license, whatever was licensed as GPL (or MIT, BSD, a proprietary license etc.) **stays that way**. To quote GPLv3:\n\n\\> All rights granted under this License are granted for the term of copyright on the Program, and **are irrevocable provided the stated conditions are met**.",
                  "score": 1,
                  "created_utc": "2026-02-09 11:09:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4pa6yl",
          "author": "therealhumanchaos",
          "text": "your fork keeps the license it was released under. A later change upstream doesn’t rewrite history.",
          "score": 1,
          "created_utc": "2026-02-10 22:53:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvi6eu",
      "title": "I Have Spastic Quadriplegia (Cerebral Palsy) and Just Released My First Open-Source Video Editor",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qvi6eu/i_have_spastic_quadriplegia_cerebral_palsy_and/",
      "author": "Dovakin625",
      "created_utc": "2026-02-04 07:30:32",
      "score": 41,
      "num_comments": 15,
      "upvote_ratio": 0.84,
      "text": "Hey everyone,\n\n\n\nI never thought I’d be writing a post like this.\n\n\n\nI have spastic quadriplegic cerebral palsy and use a power wheelchair. Typing and traditional coding are extremely difficult for me, and I don’t get out much physically, which is a big part of why I gravitated toward computers and technology in the first place. For most of my life, that meant “software developer” felt like a door that was permanently closed.\n\n\n\nI’ve always wanted to help people—especially people with disabilities who have to navigate software and the web in very different ways than able-bodied users. That motivation is a huge part of why this project exists. I didn’t just want to make something faster for myself; I wanted to build something that respects different bodies, different inputs, and different ways of interacting with computers.\n\n\n\nI’m also a video creator—and I was getting crushed by render times. A 6-minute GoPro clip taking 8+ hours in Shutter Encoder (sometimes much longer) was just not sustainable. So instead of waiting for existing tools to improve, I decided to try building something myself.\n\n\n\nI used AI tools to help write the code, but I designed the system, defined the features, debugged the pipeline, tested performance, and drove the entire architecture.\n\n\n\nIntroducing FastEncode Pro\n\n\n\nAn open-source, GPU-accelerated video editor and encoder built with accessibility and performance as first-class goals.\n\n\n\nWhat it does today:\n\n\n\nNVIDIA NVENC GPU-accelerated rendering (properly fed, sustained encode)\n\n\n\nNVIDIA GPU decoding (NVDEC) is already implemented\n\n\n\nTimeline-based video editing (multiple clips, full timeline duration)\n\n\n\nNoise reduction (especially tuned for noisy GoPro footage)\n\n\n\nDeflicker for indoor/LED lighting\n\n\n\nDeterministic CBR encoding (bitrate is actually respected)\n\n\n\nProject save & load\n\n\n\nDark UI (because my eyes deserve mercy)\n\n\n\n\n\nAccessibility features (in active development):\n\n\n\nDwell clicking (currently broken at startup)\n\n\n\nEye gaze support (code exists but is not yet fully wired in)\n\n\n\nAAC device and switch-based interaction (foundation is in place)\n\n\n\nVisual focus highlighting\n\n\n\nAccessibility settings panel for configuration\n\n\n\n\n\n\\> Important note:\n\nRight now, the branch that includes dwell clicking / eye gaze does not open the program at startup. This does not affect the rendering engine or encode pipeline—the bug is isolated to application initialization. I’m actively fixing this and will not tag a stable release until startup is solid again.\n\n\n\n\n\n\n\nPerformance:\n\n\n\nA 6-minute clip that took 8+ hours in Shutter Encoder now renders in \\~15–20 minutes, even with heavy filters enabled\n\n\n\nA 10-minute 5K render completes in \\~25–30 minutes on my system\n\n\n\n\n\nWhat’s coming next:\n\n\n\nFixing accessibility startup logic (dwell / gaze init order)\n\n\n\nFinalizing accessibility filter → render handoff\n\n\n\nMKV video input fixes\n\n\n\nTimeline auto-follow improvements\n\n\n\nUI/UX modernization (it works great, but yeah… it looks a bit 1990s right now)\n\n\n\nWindows support and packaging\n\n\n\n\n\nThe project is free and open source: 👉 [https://github.com/cpgplays/FastEncodePro](https://github.com/cpgplays/FastEncodePro)\n\n\n\nThis is my first real software project. I didn’t “just prompt an AI and walk away”—This took everything I had: constantly debugging, complete program breakages, and deep emotional breakdowns. and learning how video pipelines actually work. \n\nI’m sharing it because:\n\n\n\nI want faster, more honest video tools\n\n\n\nI want accessibility baked in, not bolted on\n\n\n\nI want to help both able-bodied creators and creators with disabilities\n\n\n\nAnd I want other people to be able to build on this\n\n\n\n\n\nFeedback, issues, and contributions are genuinely welcome.\n\n\n\nThanks for reading—and thanks to the open-source community for being the kind of place where someone like me can finally release Something that is actually built for everyone.  ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1qvi6eu/i_have_spastic_quadriplegia_cerebral_palsy_and/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o3hwiyf",
          "author": "Kami403",
          "text": "I'd really encourage you to split up the project into smaller files. Having the whole thing be a single 2000+ line python file is just not sustainable. Even if you intend on vibecoding the whole thing, you'll generally get better results if your code is organized in a sane way. Also, use tagged releases. You're using git, which is already a version control system, there is no reason to have both version 4 and 5 as seperate files in the same repo.",
          "score": 15,
          "created_utc": "2026-02-04 08:20:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hx2cs",
              "author": "Dovakin625",
              "text": "I know, this is my very first time doing anything. I haven't figured out how to drink it yet so it's not just one large single file. As of now I am just using the regular GitHub website and adding the file each time I want to release a new version. I genuinely don't know what I'm doing and I didn't know git had version tracking. Thank you so much letting me know what I need to do. I will try my absolute best.",
              "score": 1,
              "created_utc": "2026-02-04 08:25:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3jz6q2",
                  "author": "garrett_w87",
                  "text": "Version tracking is what it was made for. Git is in a category of software literally called “Version Control System” (VCS), and GitHub is a web-based UI and repository for it with project management, CI/CD, and social features baked in.\n\nA “commit” is is essentially a version - you’re making a new commit every time you add a file with the way you’re doing it — but you’re also making a commit each time you edit one, too. That’s the important point - each commit is a snapshot in time of what your code looked like at that point.\n\nTagging and branching are the typical ways to keep track of release versions. Projects with linear releases (like a website, for example) where the latest version is the only one intended to be used can do just fine using tagging only. However, for software projects released to the public, a combined approach has advantages: a common workflow is to create a new branch for every major version (1.x, 2.x, etc.) and then use tagging on those branches to designate minor or patch versions (v1.1.0, v1.1.1, etc.) This allows you to make a new major-version release (say, v2.0) while also being able to easily make changes to the 1.x branch to continue to release bug fixes and such as new minor or patch versions.",
                  "score": 1,
                  "created_utc": "2026-02-04 16:30:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3hu9z7",
          "author": "Tall-Introduction414",
          "text": "It's great that you made something because other software wasn't fitting your needs.\n\nI don't have an Nvidia GPU to play with it, but I'd love to see a screenshot or two in the readme.",
          "score": 3,
          "created_utc": "2026-02-04 07:59:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hun4r",
              "author": "Dovakin625",
              "text": "Do you have a AMD GPU? I'm trying to implement AMD support but I don't really have an AMD GPU so that's going to be a challenge. Also if you have a decent CPU you can run it and the software will automatically default to CPU encoding if you want to try it out. Yes I will post screenshots in the readme. I am fairly new to using GitHub so I really have no idea what I'm doing. I was really frightened to post my software in this community because I was afraid of what other people would think.",
              "score": 1,
              "created_utc": "2026-02-04 08:03:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jnt19",
          "author": "abotelho-cbn",
          "text": "Genuinely super cool.\n\nIt's often hard to shake the negativity surrounding AI tools, so it's awesome to see it go further than just accelerating able-bodied people's work. If you continue to post in this subreddit, I'll gladly read everytime, especially to see your learning progress. Cheers!",
          "score": 2,
          "created_utc": "2026-02-04 15:37:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jp2i2",
              "author": "Dovakin625",
              "text": "Thank you so much. I'm currently working on solving a very big and annoying bug that I didn't see before, and I'm glad I didn't fully push the newest release yet, I am now working on making it a fully installable program. I am literally burning the midnight oil I have been up since 4:00 p.m. yesterday. Is now 10:42 a.m. The next day this is how dedicated I am. I need sleep but I'm still going LOL.",
              "score": 3,
              "created_utc": "2026-02-04 15:43:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3kroc3",
          "author": "Muse_Hunter_Relma",
          "text": "Although I generally encourage accessibility devs to meet existing software where it is at and add a11y *to them*, it's great that more people are investing manpower into this at all. Lots of peeps here teachin' ya how to leverage Git tags and best coding practices so we can all improve! Love to see it 😊",
          "score": 1,
          "created_utc": "2026-02-04 18:40:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3m4hdf",
          "author": "ElaborateCantaloupe",
          "text": "Great job! I also have physical disabilities - in a power wheelchair part time when I need it. Sometimes my hands cooperate and I can type all day. Sometimes not.\n\nI just released an open source project a couple months back and Cursor w/ Claude code made it so I could build a huge platform on my own.\n\nHappy to see more of this work!!",
          "score": 1,
          "created_utc": "2026-02-04 22:31:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3izo9a",
          "author": "afahrholz",
          "text": "incredible work - your dedication and focus on accessibility is truly inspiring.",
          "score": -1,
          "created_utc": "2026-02-04 13:34:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3j0mjb",
              "author": "Dovakin625",
              "text": "You have no idea how much that means to me! I was so afraid to post this because I was afraid people wouldn't like it. This comment right here is literally the reason why I stay up all night, burning the candle at both ends, just to make sure my software works. Thank you so much for making my entire day! I just wish I could get more/ the right people to see this. I know people will come along who need it. I have just fixed the dwell-clicking issue. I have an awesome update for everyone. I'm going to push it later today.",
              "score": 1,
              "created_utc": "2026-02-04 13:39:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qx57ih",
      "title": "Unopposed - Track Elections Where Voters Have No Choice",
      "subreddit": "opensource",
      "url": "https://danpozmanter.github.io/unopposed/",
      "author": "DanManPanther",
      "created_utc": "2026-02-06 02:21:42",
      "score": 38,
      "num_comments": 2,
      "upvote_ratio": 0.91,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qx57ih/unopposed_track_elections_where_voters_have_no/",
      "domain": "danpozmanter.github.io",
      "is_self": false,
      "comments": [
        {
          "id": "o3v2mm1",
          "author": "SmileyBMM",
          "text": "Woah, what's going on with Arkansas? 71/123 elections being uncontested is crazy.",
          "score": 13,
          "created_utc": "2026-02-06 07:10:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wnnrg",
              "author": "DanManPanther",
              "text": "I don't know! Maybe someone from there could verify the data, and speak to the context?\n\nThe striking thing for me is how common uncontested primaries are, and how uncommon uncontested general elections are. It makes someone running unopposed through both all the more interesting to research.",
              "score": 8,
              "created_utc": "2026-02-06 14:28:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qzcoqz",
      "title": "A minimal macOS app switcher designed for focused switching for those who run 10 apps but actually use just 2–3",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qzcoqz/a_minimal_macos_app_switcher_designed_for_focused/",
      "author": "CaptainOnBoard",
      "created_utc": "2026-02-08 16:02:47",
      "score": 29,
      "num_comments": 7,
      "upvote_ratio": 0.9,
      "text": "I've been annoyed for years by how chaotic Cmd + Tab feels on macOS.\n\nI'm the kind of person who always has like 10 apps open slack, mail, arc, ide, terminal, figma, spotify, discord… but in any given moment I’m really just bouncing between 2 or 3 (ide and terminal or a db client).\n\nThe problem is that macOS treats every open app equally, so every time I hit Cmd+Tab it feels like a chaotic family reunion where everyone shows up uninvited\n\nSo I built HopTab — a lightweight, open-source app switcher for macOS that lets you pin just the apps you care about right now, and then hop between them with Option + Tab. Everything else stays out of the way.\n\nA few things it supports:\n\nPin/unpin any running app\n\nConfigurable global shortcut (Option+Tab, Control+Tab, or Option+`)\n\nClean native overlay with app icons\n\nIt also supports pinning different apps on different desktops (Profiles)\n\n\nYou can even assign profiles to specific macOS desktops (Spaces), so your pinned apps change automatically when you swipe between desktops\n\nIt’s written in Swift, targets macOS 14+, and is MIT licensed.\n\nIf you’re the type who hoards apps “just in case” but actually works in a tiny set at a time — you might find this useful.\n\nRepo: https://github.com/royalbhati/HopTab\n\nHappy to answer questions, take feedback, or review PRs!",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qzcoqz/a_minimal_macos_app_switcher_designed_for_focused/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o49yfj1",
          "author": "JustALittleSunshine",
          "text": "Why downvote op? It is a neat tool that will make life a little easier for some.",
          "score": 5,
          "created_utc": "2026-02-08 16:40:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4arlsk",
          "author": "Developer_Memento",
          "text": "This is pretty awesome. Congrats.",
          "score": 3,
          "created_utc": "2026-02-08 18:58:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ck4ov",
          "author": "wowsuchlinuxkernel",
          "text": "I'm glad to see there's people who try to improve the awful alt-tab window switching metaphor we've been stuck with on the desktop for 20 years now.\n\nmacOS doesn't let you remap command + tab I assume?\n\nCool project!",
          "score": 2,
          "created_utc": "2026-02-09 00:37:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ejyzo",
          "author": "KnifeFed",
          "text": "If it could replace Cmd+Tab I'd definitely give it a go, but I'm already using AltTab for Option+Tab.",
          "score": 1,
          "created_utc": "2026-02-09 08:50:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fogaz",
          "author": "morewordsfaster",
          "text": "Nice work but I'm already satisfied by Alt-Tab app.",
          "score": 1,
          "created_utc": "2026-02-09 14:12:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyjeyd",
      "title": "I am building local, self-hosted recommendation system with semantic search for personal media",
      "subreddit": "opensource",
      "url": "https://github.com/volotat/Anagnorisis",
      "author": "Another__one",
      "created_utc": "2026-02-07 17:15:11",
      "score": 20,
      "num_comments": 6,
      "upvote_ratio": 0.84,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qyjeyd/i_am_building_local_selfhosted_recommendation/",
      "domain": "github.com",
      "is_self": false,
      "comments": [
        {
          "id": "o445p6r",
          "author": "Alarming_Bluebird648",
          "text": "The shift toward semantic search for local data is a significant improvement over simple keyword matching for large media libraries. Are you using a specific lightweight model to keep the recommendation engine performant on consumer hardware?",
          "score": 3,
          "created_utc": "2026-02-07 17:50:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o446u5g",
              "author": "Another__one",
              "text": "Thanks. The models are indeed somewhat lightweight but the main reason the project works quite fast in practice is because of sophisticated caching mechanisms. The caching system tries to minimize both unnecessary computation and I/O requests.",
              "score": 1,
              "created_utc": "2026-02-07 17:55:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4401hu",
          "author": "16GB_of_ram",
          "text": "It would be good to have a few git actions with unit tests and docker build tests so you make sure your code really works",
          "score": 1,
          "created_utc": "2026-02-07 17:22:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o445pz9",
              "author": "Another__one",
              "text": "There is a semi-automatic testing pipeline in the 'tests' folder. With some unit tests as well. Hoverever because the project is heavily GPU dependent, it might get some unexpected issues on Windows. But for Linux with Nvidia GPU it should work pretty reliably. All of the recommended OS and hardware choices are described in 'Readme' and release notes.\n\nI have plans to separate file-sharing server and UI + semantic search + recommendation engine server into separate independent parts, so only the latter would be GPU dependent. This may make things simpler. But I am yet not sure how to properly organise it architecturally to properly handle all the future features I am going to implement and the vision I have for the project right now.",
              "score": 2,
              "created_utc": "2026-02-07 17:50:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qwmx3c",
      "title": "BrainWave: an open-source binaural beats audio generator (Python + web UI)",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qwmx3c/brainwave_an_opensource_binaural_beats_audio/",
      "author": "jlar0che",
      "created_utc": "2026-02-05 14:36:36",
      "score": 14,
      "num_comments": 5,
      "upvote_ratio": 0.86,
      "text": "Hey everyone!  \n  \nI wanted to share with y’all an open-source project I’ve been working on called BrainWave.\n\nIt’s a lightweight web app for generating binaural beats audio with explicit control over frequencies and duration. Additionally, there are a number of other features in the app, like templates, importing and exporting presents, an info center featuring public domain documents, and more! The goal of the project is to put users in the driver’s seat (quickly self-host via docker), and easily allow them to create binaural beats via an intuitive web interface. No ads, no locked features, no mystery audio.\n\n  \nGitHub repo (code, install instructions):  \n[https://github.com/jlar0che/BrainWave](https://github.com/jlar0che/BrainWave)\n\nProject write-up with context and motivation:  \n[https://www.digitalcuriosity.center/project/brainwave-binaural-beats-audio-generator](https://www.digitalcuriosity.center/project/brainwave-binaural-beats-audio-generator)\n\nProject Demo:  \n[https://brainwave.digitalcuriosity.center](https://brainwave.digitalcuriosity.center)  \n \n\nFeedback, issues, or contributions are welcome (especially around audio accuracy, UI improvements, or use cases I haven’t thought of)!",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qwmx3c/brainwave_an_opensource_binaural_beats_audio/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o3tzlhl",
          "author": "FB2024",
          "text": "I was recently surprised when I read that xenon is an excellent (albeit expensive) anaesthetic as I know that it’s largely chemically inert. That set me off down a rabbit hole where I discovered that it works by interrupting your synapses’ waves and thus offers clues to how consciousness works. That made me want to try binaural beats again, so your project’s timing is perfect. One feature I’d like is to be able to modulate both oscillators with LFOs to give evolving soundscapes.  mynoise.net kinda lets you do this but without the granular control yours could. So I’ve only listen to this on my phone’s speakers but am about to try it properly with some ear buds. Thanks!",
          "score": 2,
          "created_utc": "2026-02-06 02:33:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3u22q4",
              "author": "FB2024",
              "text": "One thing I’ve noticed is that the sound stops playing when I switch to another app (iPhone. + Safari or Chrome). And when I come back, I can’t restart the sound unless I refresh.",
              "score": 2,
              "created_utc": "2026-02-06 02:48:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3x4h8p",
                  "author": "jlar0che",
                  "text": "Hmmmm... I'll look into that.\n\nIf you don't mind, could you create an Issue in the GitHub repo about this?",
                  "score": 2,
                  "created_utc": "2026-02-06 15:52:30",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3x4asd",
              "author": "jlar0che",
              "text": "Thanks! If you find it useful please give me a star!",
              "score": 1,
              "created_utc": "2026-02-06 15:51:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r1c1eb",
      "title": "ReMemory Is The Amnesia-hedging Buddy Backup You Didn’t Know You Needed",
      "subreddit": "opensource",
      "url": "https://hackaday.com/2026/02/10/rememory-is-the-amnesia-hedging-buddy-backup-you-didnt-know-you-needed/",
      "author": "eljojors",
      "created_utc": "2026-02-10 20:24:00",
      "score": 11,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Alternatives",
      "permalink": "https://reddit.com/r/opensource/comments/1r1c1eb/rememory_is_the_amnesiahedging_buddy_backup_you/",
      "domain": "hackaday.com",
      "is_self": false,
      "comments": [
        {
          "id": "o4ogvjb",
          "author": "v4ss42",
          "text": "Written on a piece of paper and locked in a safe. Computers aren’t the only tools we have at our disposal, let alone the best in all cases.",
          "score": 2,
          "created_utc": "2026-02-10 20:32:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ohdlq",
              "author": "eljojors",
              "text": "you're not worried about what would happen if it were to be leaked or damaged? not that it's likely, but it's not impossible\n\nhere's the scenario: there's a fire at home, the safe is fine, but the paper is incinerated inside",
              "score": 1,
              "created_utc": "2026-02-10 20:35:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4okvub",
                  "author": "v4ss42",
                  "text": "The safe is at a bank, but sure those are (low probability) risks. Probably lower risk than N of M of my friends / family members being victims of a coordinated social engineering attack, though obviously that’s just speculation on my part.",
                  "score": 1,
                  "created_utc": "2026-02-10 20:51:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qwmq6e",
      "title": "Looking for open source media player to rip CDs",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qwmq6e/looking_for_open_source_media_player_to_rip_cds/",
      "author": "TREM0L0",
      "created_utc": "2026-02-05 14:28:42",
      "score": 10,
      "num_comments": 14,
      "upvote_ratio": 0.78,
      "text": "So I've always been using VLC media player and I've been very happy with it, but I'm trying to rip some CDs to my PC and for some reason it doesn't have an option to rip the entire CD, only one track at a time. I found some kind of batch file code thing to fix this but I don't know how to use it. I'm not really big into technology so I'm obviously very incompetent at these kinds of things, so no need to point that out. I'm just trying to stop using anything run by p\\*dofile billionaires (all of them). Right now I'm ripping my CD with Windows Media Player but I don't want to be reliant on that since I'm looking to switch to Linux very soon and completely abandon everything run by Microsoft, among all other huge companies. \n\nAnybody know any good open source program that let's you rip an entire CD just as easily as Windows Media Player does? Why is this not a feature in VLC? I find it a bit strange. Or maybe if someone could explain how to use the batch file thingy.\n\nPlease don't be brutal on me if I come off as an idiot, I'm trying my best here.\n\nThanks.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1qwmq6e/looking_for_open_source_media_player_to_rip_cds/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o3q02i8",
          "author": "SeriousPlankton2000",
          "text": "I use K3B because I'm too lazy to find something else",
          "score": 6,
          "created_utc": "2026-02-05 14:32:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qh6o2",
          "author": "acespiritualist",
          "text": "I use fre:ac https://github.com/enzo1982/freac",
          "score": 5,
          "created_utc": "2026-02-05 15:56:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qyry4",
              "author": "Skinkie",
              "text": "What is your experience with AccurateRip and things like [CUETools](https://cue.tools/wiki/CUETools_Database) I would love to switch from EAC to something truely open source.",
              "score": 2,
              "created_utc": "2026-02-05 17:17:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qgrfb",
          "author": "AiwendilH",
          "text": "If you are on Plasma `audiocd:/` in the address bar of dolphin.",
          "score": 3,
          "created_utc": "2026-02-05 15:54:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rdtmj",
          "author": "expressly_ephemeral",
          "text": "Handbrake?",
          "score": 3,
          "created_utc": "2026-02-05 18:27:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ubtgr",
              "author": "Catenane",
              "text": "Handbrake is great, it even ripped the special features out of old dvds lol. Didn't even know that was possible at the time. Pro-tip: you need....`libdvdcss` IIRC, which not all distros will have in their main repos. In tumbleweed you can find it in the packman repos (or build yourself if you're so inclined).",
              "score": 2,
              "created_utc": "2026-02-06 03:47:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3qc1xm",
          "author": "foofly",
          "text": "On linux I just use Sound Juicer. Does what need in 99% of cases.",
          "score": 2,
          "created_utc": "2026-02-05 15:32:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qwpwc",
          "author": "robreddity",
          "text": "k3b",
          "score": 1,
          "created_utc": "2026-02-05 17:08:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3r4v6u",
          "author": "WittyWampus",
          "text": "Asunder\n\nEdit: nevermind just saw you're on Windows. Asunder is still great for anyone on Linux though.",
          "score": 1,
          "created_utc": "2026-02-05 17:46:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rmbt9",
          "author": "Sancho_Panzas_Donkey",
          "text": "EAC",
          "score": 1,
          "created_utc": "2026-02-05 19:05:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40enrq",
          "author": "dbear496",
          "text": "I use Audex because I already had it installed with KDE. Haven't had any issues with it so far",
          "score": 1,
          "created_utc": "2026-02-07 02:01:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3r5wuf",
          "author": "lordmax10",
          "text": "https://www.portableapps.com",
          "score": 1,
          "created_utc": "2026-02-05 17:51:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3u54p2",
              "author": "serenader",
              "text": "https://portableapps.com/apps/music_video",
              "score": 1,
              "created_utc": "2026-02-06 03:06:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3pzu1m",
          "author": "DudeByTheTree",
          "text": "VLC is for video. It's in the name... \"Video LAN Client\".\n\nThat being said, EAC. \"Exact Audio Copy\" has been the go-to tool for ripping for well... a very long time.",
          "score": -1,
          "created_utc": "2026-02-05 14:30:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0e0rs",
      "title": "Free Autocad alternatives?",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1r0e0rs/free_autocad_alternatives/",
      "author": "GoosePants72",
      "created_utc": "2026-02-09 19:34:00",
      "score": 10,
      "num_comments": 13,
      "upvote_ratio": 0.82,
      "text": "2 questions:\n\n1. What are some good FREE alternatives?\n\n2. How much resources do these programs take? I have a steam deck I use in desktop mode, would that be sufficient to learn and build with them?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1r0e0rs/free_autocad_alternatives/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o4jfy8m",
          "author": "Yosyp",
          "text": "Those in the comments replying \"FreeCAD\" have never used both and don't know what the other does. The [introductory ](https://wiki.freecad.org/About_FreeCAD)page on their wiki specifically states that it's not a 2D drawing alternative. And it will never be anytime soon.\n\n[LibreCAD](https://librecad.org/) and [QCAD](https://qcad.org/en/) are typically the answers. There's not much else around.",
          "score": 12,
          "created_utc": "2026-02-10 01:41:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4k7b8v",
              "author": "GoosePants72",
              "text": "Thanks. I’m assuming LibreCad is Linux native?",
              "score": 2,
              "created_utc": "2026-02-10 04:29:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4kmtzc",
                  "author": "Vadoola",
                  "text": "LibreCad is a fork of an older version of QCad, but it's barely maintained (last I checked). The split happened over disagreements with how QCad was handled by the main developer.  Both are written using C++ with Qt and will run just fine in Linux. There are some features that are locked behind a paid license.",
                  "score": 2,
                  "created_utc": "2026-02-10 06:29:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ludx5",
          "author": "OldTimeConGoer",
          "text": "There really isn't an open-source or free alternative to AutoCAD for desktop PCs, if you want access to even a fraction of the ecology of third-party extensions and plugins that have been developed for AutoCAD since its inception.",
          "score": 3,
          "created_utc": "2026-02-10 12:52:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hqio1",
          "author": "Educational_Sun_8813",
          "text": "freecad and openscad",
          "score": 6,
          "created_utc": "2026-02-09 20:14:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hjnoq",
          "author": "4sokol",
          "text": "FreeCad?",
          "score": 4,
          "created_utc": "2026-02-09 19:40:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mnkju",
          "author": "PandaDEV_",
          "text": "Solvespace",
          "score": 1,
          "created_utc": "2026-02-10 15:31:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pb4yx",
          "author": "therealhumanchaos",
          "text": "FreeCAD, LibreCAD, BricsCAD Shape, nanoCAD ",
          "score": 1,
          "created_utc": "2026-02-10 22:58:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lfx33",
          "author": "itsdevelopic",
          "text": " openscad",
          "score": 0,
          "created_utc": "2026-02-10 11:02:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ltgk0",
          "author": "ricktaylor78",
          "text": "Steam deck, try something online like Onshape. It run on browser.\n\n\nhttps://www.onshape.com",
          "score": 0,
          "created_utc": "2026-02-10 12:46:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mv86i",
          "author": "ultrathink-art",
          "text": "FreeCAD is the main open-source option for parametric CAD. It's Python-scriptable which is powerful for automation, but the UI/UX is rougher than commercial tools.\n\nKey workflows:\n\n- **Part Design workbench**: Sketch-based 3D modeling (like SolidWorks)\n- **Draft workbench**: 2D technical drawing\n- **Arch workbench**: Building/architectural design\n\nLearning curve tips:\n\n1. Start with the Part Design workbench tutorial - it teaches the constraint-based sketching model\n2. Use the spreadsheet workbench to parameterize designs (massive for variant generation)\n3. Check the FreeCAD forums before the docs - community solutions are often more practical\n\nIf you're doing purely 2D drafting, LibreCAD is simpler and more stable. For organic/artistic 3D, Blender is better (though not CAD-focused).\n\nWhat's your use case - mechanical parts, architecture, or something else?",
          "score": 0,
          "created_utc": "2026-02-10 16:07:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0kn4r",
      "title": "FLOW - A catalogue of open-licensed games, art, music, software",
      "subreddit": "opensource",
      "url": "https://sanglorian.github.io/flow/",
      "author": "Sanglorian",
      "created_utc": "2026-02-09 23:41:42",
      "score": 10,
      "num_comments": 1,
      "upvote_ratio": 0.75,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1r0kn4r/flow_a_catalogue_of_openlicensed_games_art_music/",
      "domain": "sanglorian.github.io",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1qw4e8c",
      "title": "Disk Space Analyzer With Cross Scan Comparisons.",
      "subreddit": "opensource",
      "url": "https://github.com/chuunibian/delta",
      "author": "Bian-",
      "created_utc": "2026-02-04 23:16:25",
      "score": 9,
      "num_comments": 0,
      "upvote_ratio": 0.86,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qw4e8c/disk_space_analyzer_with_cross_scan_comparisons/",
      "domain": "github.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1qvljvt",
      "title": "GCompris, KDE's collection of educational activities, publishes version 26.0",
      "subreddit": "opensource",
      "url": "/r/kde/comments/1qvlh63/gcompris_kdes_collection_of_educational/",
      "author": "Bro666",
      "created_utc": "2026-02-04 10:57:50",
      "score": 9,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qvljvt/gcompris_kdes_collection_of_educational/",
      "domain": "",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1qxueyp",
      "title": "Open sourced ion exchange membranes",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qxueyp/open_sourced_ion_exchange_membranes/",
      "author": "rowow1",
      "created_utc": "2026-02-06 21:25:12",
      "score": 8,
      "num_comments": 1,
      "upvote_ratio": 0.79,
      "text": "[https://www.youtube.com/watch?v=c3tNXDlgE2M](https://www.youtube.com/watch?v=c3tNXDlgE2M)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1qxueyp/open_sourced_ion_exchange_membranes/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o3zw46u",
          "author": "CulturalAspect5004",
          "text": "Incredible work, im highly impressed!",
          "score": 1,
          "created_utc": "2026-02-07 00:09:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qyowos",
      "title": "Open Source | Gamified Language Learning (Chinese Mandarin) | Web-App | No Sign-up Required",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qyowos/open_source_gamified_language_learning_chinese/",
      "author": "AnotherMoonDoge",
      "created_utc": "2026-02-07 20:45:47",
      "score": 8,
      "num_comments": 0,
      "upvote_ratio": 0.84,
      "text": "This is still a work in progress, and I would love for other people to contribute to grow this project.  \n  \nI think given some more attention, this could turn into a valuable asset for language learning of many different languages (could easily be modified for Japanese) - as I personally find it slightly more entertaining than standard flashcards. And if you are anything like me, learning something is more about staying interested and motivated than it is anything else.  \n  \nRepository: [https://github.com/GreenAnts/HSK-3.0-Study-Game](https://github.com/GreenAnts/HSK-3.0-Study-Game)  \nWebApp: [https://greenants.github.io/HSK-3.0-Study-Game/](https://greenants.github.io/HSK-3.0-Study-Game/)\n\nWhile it isn't anything super special, I do think it is more effective (at least for me) than simply using Anki flashcards, as it keeps me slightly more entertained and interested - but I think the project could definitely be gamified a bit more. The primary goal of this project is to eventually create something that \\*actually\\* keeps the user interested in drilling through vocabulary.  \n   \n\\-  - - \n\n  \nDisclaimer: The project is mostly just a couple files, and was put together with AI, not using any type of framework or anything. If the project gets future collaborators, we would likely need to refactor the project to be more workable. ",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qyowos/open_source_gamified_language_learning_chinese/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1r0bstw",
      "title": "opensource for public archives",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1r0bstw/opensource_for_public_archives/",
      "author": "el_magyar",
      "created_utc": "2026-02-09 18:15:20",
      "score": 8,
      "num_comments": 9,
      "upvote_ratio": 0.85,
      "text": "Hey, I’m looking for good options to host a public digital archive (mostly images and PDFs, plus some audio/video).\n\nI’m part of an artistic collective working with public and personal archives, often digitising materials that are otherwise neglected or at risk of being lost.\n\nWe run ongoing cultural and research projects and want the archive to be publicly accessible, with some cool look, but I prefer clean directories look (i also used forum as formats for some of my previous works)... smth like jellyfin, but for documents.\n\nI’m interested in both online hosted and self-hosted open-source solutions.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1r0bstw/opensource_for_public_archives/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o4hm5fd",
          "author": "FarToe1",
          "text": "Selfhosted - there's paperless-ng (docs and ocr) and immich (pictures and AI-like searching) - both very good if they suit your needs.\n\nOr if the focus is more web-faced, then there's a lot of CMS or static site generators that could be used to generate a site exactly as you wanted. (SSGs are cheaper/free to host online, and inherently safer)\n\nMaybe it would help us help you more if you described what the layout and look of your end result might be.",
          "score": 3,
          "created_utc": "2026-02-09 19:52:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ij5ct",
              "author": "el_magyar",
              "text": "thanks so much... i forgot about paperless. But yeah, paperless and immich are probably best match for what I'm looking for... Jjst wanted to see if ther is some solution that combined those.",
              "score": 2,
              "created_utc": "2026-02-09 22:38:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4iej2b",
          "author": "OverlandBaggles",
          "text": "I do think there's a tool missing here. I am working with journalists who want to have something they can self-host that lets them publicly share documents and annotate them and the like, and then embed them in public-facing articles - something like Document Cloud or Uwazi - but easier to maintain and lighter. While tools like Paperless-NG are great, I feel as though they are not focused on more public consumption.\n\nNot that I am remotely in a position to build such a tool myself, but was curious if anyone on this thread had experience with anything I missed.",
          "score": 3,
          "created_utc": "2026-02-09 22:14:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hacqg",
          "author": "fsteff",
          "text": "Did you consider the Internet Archive?",
          "score": 4,
          "created_utc": "2026-02-09 18:55:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ic76p",
              "author": "el_magyar",
              "text": "Yeah of course, I always use it, mostly as a safe backup... But I wanted to create something on my own, also trying to make it as a personal side work, especiallt as a selfhosted option.",
              "score": 2,
              "created_utc": "2026-02-09 22:02:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4kkztu",
          "author": "therealscooke",
          "text": "Omeka.",
          "score": 2,
          "created_utc": "2026-02-10 06:13:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kudqa",
          "author": "Alarming_Bluebird648",
          "text": "Omeka S is likely the most suitable option for an artistic collective because it handles complex metadata schemas while allowing for high-level visual customization. It effectively bridges the gap between a rigid archive database and a flexible portfolio site.",
          "score": 2,
          "created_utc": "2026-02-10 07:36:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4mmf83",
              "author": "nucular_",
              "text": "This is a bot btw.",
              "score": 2,
              "created_utc": "2026-02-10 15:25:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lfyvt",
          "author": "itsdevelopic",
          "text": "Did you consider the Internet Archive?",
          "score": 1,
          "created_utc": "2026-02-10 11:02:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwodre",
      "title": "small browser based strategy board game - looking for contributors.",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1qwodre/small_browser_based_strategy_board_game_looking/",
      "author": "AnotherMoonDoge",
      "created_utc": "2026-02-05 15:32:44",
      "score": 7,
      "num_comments": 2,
      "upvote_ratio": 0.89,
      "text": "Long story short, I've been working on this game - on and off - for more than a decade now. and I have released it into the Creative Commons (CC-BY) and am working on an open source (GNU GPL) website for the game to try and help get it off the ground and actually played and digitized. My goal is to build a community and allow the community to actually modify and improve the game.\n\n  \nThe game is pretty niche, but if you're into abstract strategy games (eg: chess, shogi, go, etc) than I hope that you might be willing to check it out and see if it's something that interests you.\n\n\\- - -\n\nInstead of writing an essay, I am just going to drop some links here to check out the game if you are interested in any way shape or form. I hope someone here might be interested in helping the game get a bit of traction/developed, but if not, I appreciate your time anyways!\n\n**Github Repository** (GNU GPL Version 3):  \n[https://github.com/GreenAnts/Amalgam\\_Webgame](https://github.com/GreenAnts/Amalgam_Webgame)\n\n**Playable Game Website** with rules integrated:  \n[https://greenants.github.io/Amalgam\\_Webgame/](https://greenants.github.io/Amalgam_Webgame/)  \n*note: under development, with placeholder info - but there is a single player vs computer version working - just the computer (AI) player skill is extremely poor at the moment.*\n\n***Other Ways to play***, no rules integration:  \n[Screentop.gg](http://screentop.gg/) \\- [https://screentop.gg/@Anthony/Amalgam](https://screentop.gg/@Anthony/Amalgam)  \nTabletop Simulator - [https://steamcommunity.com/sharedfiles/filedetails/?id=1402132394&searchtext=amalgam](https://steamcommunity.com/sharedfiles/filedetails/?id=1402132394&searchtext=amalgam)\n\n**Discord Server:**  \n\\[Redacted for sub guidelines - check repo if interested\\]\n\n**Video Tutorial:**  \n[https://youtu.be/LZD5h4siXVM](https://youtu.be/LZD5h4siXVM)\n\n**Board Game Geek (BGG):**  \n[https://boardgamegeek.com/boardgame/433428/amalgam](https://boardgamegeek.com/boardgame/433428/amalgam)\n\n**Main Website (old):**  \n[https://www.amalgamboardgame.com](https://www.amalgamboardgame.com/)  \n*note: this is mostly used to host the rules, but the playable game link above will likely be replacing this eventually.*\n\n**Rule-book:**  \nOption 1: [**https://github.com/GreenAnts/Amalgam\\_Webgame/tree/main/assets/Rulebook**](https://github.com/GreenAnts/Amalgam_Webgame/tree/main/assets/Rulebook)  \nOption 2: [**https://imgur.com/a/amalgam-board-game-rules-0lTmlgR**](https://imgur.com/a/amalgam-board-game-rules-0lTmlgR)  \nOption 3: The \"Main Website (old)\" link above\n\n*- - -*  \n*I am posting not only to find people interested in the game, but also for contributors who might be interested in helping us get everything set up as we develop the digital version. I am hoping to build a \\*community built\\* game - that grows and evolves with the community. Adding game variants as custom matches that can be selected for alternative rule sets, and etc.*\n\n*Thanks!*",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1qwodre/small_browser_based_strategy_board_game_looking/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o3s9lfv",
          "author": "TangleOfWires",
          "text": "I clicked on how to play and have no clue on how to play it.\n\n\"Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nulla pulvinar lacinia imperdiet. Suspendisse molestie dui enim, accumsan eleifend orci tristique in. Vestibulum volutpat mauris vel blandit viverra. Cras efficitur risus a diam faucibus, ut convallis lectus placerat. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Cras sodales, augue ac vehicula placerat, lectus justo viverra leo, ut viverra elit mi a mauris. Aliquam scelerisque scelerisque faucibus. Integer sit amet justo suscipit, ullamcorper mi eu, ullamcorper nisi. Ut mattis sapien vel nunc pulvinar, sed finibus sem viverra. Nam sit amet hendrerit erat. Vivamus eget odio at sem ultrices tristique. Quisque hendrerit aliquam elit, eu vehicula justo tincidunt in. Suspendisse at dignissim nibh. Nulla laoreet lacinia dictum. Integer non porttitor ante. Aliquam erat volutpat.\"",
          "score": 1,
          "created_utc": "2026-02-05 20:56:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3scuek",
              "author": "AnotherMoonDoge",
              "text": "Lol, sorry that is the placeholder \"lorem Ipsum\" text on the actual website, but the links on the repo README, or the ones on the post above will describe the actual gameplay better. The video tutorial, \"main website (old)\" or the rulebook image files will be the best places to for learning the actual gameplay.\n\n\nSorry - the main website is still under development and has a lot of placeholder items. ",
              "score": 1,
              "created_utc": "2026-02-05 21:11:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}