{
  "metadata": {
    "last_updated": "2026-02-28 08:49:57",
    "time_filter": "week",
    "subreddit": "opensource",
    "total_items": 20,
    "total_comments": 152,
    "file_size_bytes": 227703
  },
  "items": [
    {
      "id": "1rbkzwe",
      "title": "Large US company came after me for releasing a free open source self-hostable alternative!",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rbkzwe/large_us_company_came_after_me_for_releasing_a/",
      "author": "funyflyer",
      "created_utc": "2026-02-22 12:46:37",
      "score": 2170,
      "num_comments": 169,
      "upvote_ratio": 0.98,
      "text": "**⚠️⚠️ EDIT : \\[Company A\\] CEO reached out to me with a nice tone and his point of view, which I really appreciate, also with a mild apology for sending the legal doc first without communication (the got the message we wanted to deliver). I hold nothing against their business personally and I am always more than happy to comply with reasonable demands (like removing trademarked name parts from project), but I don't think the exporter is against the rules (I have my own logic for fair business practice) and now the CEO wants to meet for a quick call (I hope friendly), to discuss and reason things out. I need to present my points fairly as well and don't want to get pressured/voiced down, just because I am alone with my logic. I am sure as a company with > 1 million $ revenue they have a larger backing.**\n\n⚠️⚠️ I am already in chat with [u/Archiver\\_test4](https://www.reddit.com/user/Archiver_test4/) as a legal representative, but we are in a different time zone. If anyone else in addition would like to take a look to help me, present their view, or get involved, I am more than happy to talk and get some feedback on how can I present my idea (reach out only If you are a lawyer, but please note I am not in a position to pay any fees). It's best if you have knowledge of EU legal rules and data protection policy, GDPR etc. Please reach out to me as this is the right time to make the reasoning and requests. feel free to email me to [contact@opendronelog.com](mailto:contact@opendronelog.com) or send me a chat here. I might not reply until morning, as it's quite late here now.\n\nNone of these would have happened only if they sent me this same email before sending the letter.\n\n💜💜 Thanks to the [r/drones](https://www.reddit.com/r/drones/) and [r/selfhosted](https://www.reddit.com/r/selfhosted/) and [r/opensource](https://www.reddit.com/r/opensource/) community we were able to reach to this stage in record time. As in individual, you can voice your opinion. It proved again that what opensource communities can do and this thread is a living proof of that.\n\n\\---------\n\n\n\n**TL;DR:** I made an [open-source, local-first dashboard for drone flight logs](https://opendronelog.com/) because the biggest corporate player in the space locks your older data behind a paywall. They found my GitHub, tracked my Reddit posts, and hit me with a legal notice for \"unfair competition\" and trademark infringement.\n\n**Long version:** I maintain a few small open-source projects. About two weeks ago, I released a free, self-hostable tool that lets drone pilots collect, map, and analyze their flight logs locally. I didn't think much of it, just a passion project with a few hundred users.\n\nI can’t name the company (let's call them \"Company A\") because their legal team is actively monitoring my Reddit account and cited my past posts in their notice. Company A is the giant in this space. Their business model goes like this:\n\n* You can upload unlimited flight logs for free.\n* BUT you can only view the last 100 flights.\n* If you want to see your older data, you have to pay a monthly subscription *and* a $15 \"retrieval fee.\"\n* Even then, you can't bulk download your own logs. You have to click them one by one. They effectively hold your own data hostage to lock you into their ecosystem. I am not sure if they are even GDPR complaint even in the EU\n\nTo help people transition to my open-source tool, I wrote a simple web-based script that allowed users to log into their own Company A accounts and automate the bulk download of their own files. Company A did not like this. They served me with a highly aggressive, 4-page legal demand (CEASE and DESIST notice). They forced me to:\n\n1. Nuke the automated download tool entirely from GitHub.\n2. Remove any mention of their company name from my main open-source project and website (since it’s trademarked). I originally had my tagline as \"The Free open-source \\[Company A\\] Alternative,\" which they claimed was illegally driving their traffic to my site.\n3. Remove a feature comparison chart I made. (I admittedly messed up here, I only compared my free tool to their paid tier and omitted their limited free tier, which they claimed was misleading and defamatory).\n\nI'm just a solo dev, so I complied with the core of their demands to stay out of trouble. I scrubbed their name, took down the downloader, and sanitized my website. My main open-source logbook lives independent of them.\n\nI admit I was naive about the legal aspects of comparison marketing and using trademarked names. But the irony is that they probably spent thousands of dollars on lawyer fees to draft a threat against my small project that makes close to zero money (I got a few small donations from happy users).\n\nHas anyone else here ever dealt with corporate lawyers coming after your self-hosted/FOSS projects? It’s a crazy initiation :)",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1rbkzwe/large_us_company_came_after_me_for_releasing_a/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o6riaj2",
          "author": "zynasis",
          "text": "Lol “unfair competition “ \nSo like what every monopoly Corp does?",
          "score": 539,
          "created_utc": "2026-02-22 12:52:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tb2sf",
              "author": "dtseng123",
              "text": "What if there was a dev version of Barbara Streisand?",
              "score": 56,
              "created_utc": "2026-02-22 18:18:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6vhlsh",
                  "author": "nuclear_wynter",
                  "text": "I guess the dev equivalent of the original Streisand event would be something like \"Noooooo, you can't post a link to my public Git repo on a public forum for the public to see, nooooo!\" followed by a bogus DMCA takedown order.",
                  "score": 10,
                  "created_utc": "2026-02-23 01:07:33",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7adx4r",
                  "author": "RealUlli",
                  "text": "That's not a dev version of the Streisand Effect. That is the Streisand Effect, pure and simple. \n\nSomeone makes something that someone else doesn't like and tries to have taken down. The Internet says \"NOPE\" to the takedown, makes backups and spreads the news fast and wide. \n\nThis is what happened here. I don't have a drone and without that legal action I would never have heard about the software.",
                  "score": 2,
                  "created_utc": "2026-02-25 07:23:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o73hu99",
                  "author": "AbjectFee5982",
                  "text": "The rossmann effect XD",
                  "score": 1,
                  "created_utc": "2026-02-24 07:05:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6upi9b",
              "author": "kwhali",
              "text": "The authors project was marketed with a tagline as the free alternative to company's name software.\n\nIt also uses a download script for existing users to retrieve / export their existing data from said company, so that they no longer need to pay company and can stop being a customer.\n\nThe project was vibe coded (although with proper review and fair disclosure on README, you can tell from the source code that they're not that experienced in a few areas of the tech stack but at a glance doesn't appear to be slop).\n\nI only mention that due to the speed of development and I assume the quick uptake to hundreds of users is related to customers leaving upset company's business for this OSS alternative.\n\nThe author had marketed awareness of the project via various communities which the company may have monitored for their own marketing.\n\nI assume either analytics or other insights about sudden drop in customers (_someone might have even communicated they were leaving for the authors project instead_) made it not too difficult to discover. As noted the company name was more publicly visible and associated to the project (you can see it via git history on the README).\n\nI'm not a lawyer, but I would say that probably has some legal basis. Notably the downloader functionality (IIRC this was a separate repo conveniently/wisely, but OP took that down from public access), which now from what I recall someone else saying is effectively distributed as a proprietary binary now? At least I'm pretty sure there is some legal issues in some countries regarding unsolicited data scraping of a business 🤔\n\nMaybe the free aspect and being OSS helps avoid some concerns there but it's a bit clear why legal action was being raised, it was kind of targeted theft of the companies customers.\n\nThe author offers a fully free project atm, but who's to say they or someone else doesn't then try to offer some paywall features / functionality down the line if there's enough user adoption to support it. Some OSS project's do try to monetize and this one already has a section for donations, such that said customers can provide financial support that they were giving the prior company to this project to get feature work prioritised.\n\nSeems like a grey area 😅 I'm not trying to defend the company that is upset btw, if they were charging fees like that I think that's dumb and I'm all for OSS, but I think I'd be unhappy if someone made a free version of my product and marketed it that way with my own product name to get traffic and steal customers by additionally scraping my own service 🤔",
              "score": 12,
              "created_utc": "2026-02-22 22:28:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6uxty1",
                  "author": "funyflyer",
                  "text": "I don't know why you are being downvoted, but imo you raise fair points only very respectfully. About the OSS model, I am not interested in selling or adding useful features paywalled as it is AGPLv3 currently. I have maintained other projects (fully hand-coded as you will notice) in this same model and more than happy to provide occational support on the issues for some small donations over time. Imo I enjoy not feeling liable but working on a project for fun. ",
                  "score": 16,
                  "created_utc": "2026-02-22 23:14:13",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o6w0n04",
                  "author": "ivosaurus",
                  "text": "Brother, advertising yourself as an alternative is not fucking THEFT. That's the free market, and you have to deal with it. Make a better product. Jesus christ. Talk about corporate capture. Get your tongue off that boot.",
                  "score": 11,
                  "created_utc": "2026-02-23 03:03:07",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6vttxi",
                  "author": "Karyo_Ten",
                  "text": ">At least I'm pretty sure there is some legal issues in some countries regarding unsolicited data scraping of a business 🤔\n\nDebatable if he didn't run it himself as a service but users did.\n\nAlso defensible in the EU given that by GDPR law a user should be able to request ALL data a business has on them unless superceding regulatory requirement (say anti-money laundering compliance).",
                  "score": 1,
                  "created_utc": "2026-02-23 02:21:28",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6yxy4c",
                  "author": "Critical_Ad_8455",
                  "text": "> it was kind of targeted theft of the companies customers.\n\nwhat? so trying to be better than some other company is theft, now? \n\n> but who's to say they or someone else doesn't then try to offer some paywall features / functionality down the line if there's enough user adoption to support it\n\nthe license, which means the current codebase will always be free, and if they start paywalling stuff, someone can fork the last non-paywalled version and maintain their own free version, if they so choose",
                  "score": 1,
                  "created_utc": "2026-02-23 16:00:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6yrtix",
              "author": "Vert354",
              "text": "\"Unfair competition\" is just the umbrella legal term for IP infringement. (i.e. trademark, copyright, etc.)\n\nA monopoly would be an \"anti-trust\" case.",
              "score": 1,
              "created_utc": "2026-02-23 15:31:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o74xdfh",
              "author": "Stevedougs",
              "text": "Yep. Free market competition isn’t free at all, if the neighbouring stall at the farmers market can shut down opposition because they did something better or used their name in describing what theirs is. But throwing up big signs and taking things from the other stall is a bit over the top.\n\nIf all it takes is a single dev and a GitHub page to take your business model down, then it’s not a good model I think. Adapt. Revise. Actually provide something legitimate to stay strong. there’s so many SAAS that don’t need to be or shouldn’t for 2026.\n\nThere’s some solid ethical discussion in this thread though, I appreciate the other points of view i hadn’t considered",
              "score": 1,
              "created_utc": "2026-02-24 13:57:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6rm262",
          "author": "esdraelon",
          "text": "IANAL\n\n\nThis will all be highly dependent on your legal jurisdiction.\n\n\nTypically, this will stem from the trademark infringement.\n\n\nChange the name of your tool, and don't mention them or their features. That's the key. \n\n\nAfter that, unless they have a patent, they can kick rocks.",
          "score": 289,
          "created_utc": "2026-02-22 13:18:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tb890",
              "author": "dtseng123",
              "text": "Yes this is exactly right. Don’t talk shit just be a better solution and they have nothing to stand on.",
              "score": 43,
              "created_utc": "2026-02-22 18:19:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6yyuas",
              "author": "[deleted]",
              "text": "[deleted]",
              "score": 2,
              "created_utc": "2026-02-23 16:05:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6zgcju",
                  "author": "esdraelon",
                  "text": "Yes. Legitimate comparisons of features are typically fine, or if it makes sense to reference it.\n\nFor instance \"Tired of paying for Brand X? Why would you pay for feature Y? Just use this tool.\"\n\nBasically, you can't imply that your tool is being endorsed by or is a product of the brand in any way.\n\nTrademark only regulates some types of commercial speech. It is not a blanket authorization of use on all uses of that word or logo.",
                  "score": 2,
                  "created_utc": "2026-02-23 17:26:32",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o71fj22",
                  "author": "cubedsheep",
                  "text": "The spirit of a trademark is to protect consumers, not companies. It does this by limiting the use of certain trademarked words, in the relevant context, to only refer to a specific product (so I cannot sell 5$ T-shirts with Gucci on it, that infringes their trademark and misleads buyers). So you should be fine mentioning them, as long as it is clear that your product is in no way related to the product your mentioning. e.g. \"this is how my product X compares to companies Y product Ztm\" should be fine. The law is of course quite nuanced and probably can be misused, but the goal of trademark law is originally to prevent confusion under consumers. \n\nJust slapping someone with a lawsuit for making a comparison should not fall under this, and in some juristictions these tactics, misusing IP and other laws to block competition or speech you don't like is a crime itself under \"SLAPP\" laws.\n\nI think even the wording \"free alternative to X\" is not infringing since you clearly state it's an alternative (at least it shouldn't be infringing from the perspective of consumer protection). Trademarkwise should be fine. But I'm not a lawyer, so don't take this as advise.",
                  "score": 1,
                  "created_utc": "2026-02-23 23:08:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7bxb2a",
              "author": "DarkLordCZ",
              "text": "I've always wandered, how was possible to make \"IBM PC compatible\" computers back in the days? Wouldn't this be kinda the same?",
              "score": 1,
              "created_utc": "2026-02-25 14:27:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7ean8a",
                  "author": "esdraelon",
                  "text": "Because it was true. You're allowed to say true things, just not imply that your product is endoresed.",
                  "score": 1,
                  "created_utc": "2026-02-25 21:03:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6rq2f1",
          "author": "BizarroMax",
          "text": "Lawyer and former open source developer here.  DM me.",
          "score": 202,
          "created_utc": "2026-02-22 13:43:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6s40cj",
              "author": "FalseDish",
              "text": "If you don’t mind me asking - I’m actually having a strikingly difficult time finding citations where small FOSS players have won judgements.\n\nI can find plenty in EU countries, so many cases where German and French courts have ruled against large corporations to protect open source licenses, but in the US it seems the only wins are from the Free Software Foundation against Verizon and Monsoon Media for their illegal busybox distribution.\n\nI am genuinely happy to see a dev-turned-lawyer helping out an open source developer ofc but it’s making me a little sad to see how easily companies can just bully developers who are selflessly giving to the community.",
              "score": 40,
              "created_utc": "2026-02-22 15:00:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6sxnbs",
                  "author": "idspispupd",
                  "text": "One case I know of is in 2010, the U.S. Copyright Office has ruled that jailbreaking to install apps does not violate copyright law. Another case - Cydia filed an antitrust lawsuit against Apple, but I think it lost the legal battle of attrition.",
                  "score": 25,
                  "created_utc": "2026-02-22 17:16:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6roron",
          "author": "retireb435",
          "text": "remove their brand name then it’s fine",
          "score": 119,
          "created_utc": "2026-02-22 13:35:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rp9gt",
              "author": "funyflyer",
              "text": "I did I did, lesson learnt, I complied with the legal demands. ",
              "score": 58,
              "created_utc": "2026-02-22 13:38:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6rsgrf",
                  "author": "maddler",
                  "text": "You might need to to a search & replace in the Readme tho' ;) ",
                  "score": 31,
                  "created_utc": "2026-02-22 13:57:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6te9ma",
                  "author": "TheOriginalSuperTaz",
                  "text": "You don’t even need to remove their brand name unless you lied about their features. It’s not lying to not discuss all of their tiers. As long as you put a note on the chart that it is accurate as of the date you created it (with that date), and it is actually accurate, then you aren’t doing anything illegal. Just don’t use their logo (if you don’t use their logo, they can’t claim you are using their trademark unfairly, and the name of their product can be used under fair use in this case - there is ample precedent for that).\n\nYou are allowed to advertise your product, even if it is free. Comparison charts are absolutely legal forms of advertising and costume education if they are accurate, and they only need to be accurate as of the time you publish them (especially if you say they were accurate as of a specific date and keep a copy for your records in case of losers like the morons who sent you that letter).\n\nIf their lawyers are any good, they told them that they can write and send the letter, but there is nothing to actually be done if you don’t comply. Any responsible lawyer would tell them there is no legal leg to stand on in an actual suit, and they would get destroyed in court in preliminary hearings if you had even a mediocre lawyer. You should be able to counter sue them for your legal fees, too, as it will be kicked out under anti-SLAPP very early.\n\nTo be clear, I’m not a lawyer, but any decent lawyer should be able to anti-SLAPP this stupidity if they actually were to sue you. Get legal advice and make sure you aren’t doing anything actually illegal, but it’s not unfair practices to make an alternative to an existing product, nor is it illegal to give it away for free, unless you stole it from them (the code, not the idea), you have the right to create and market a product that competes with their unpatented crap.",
                  "score": 16,
                  "created_utc": "2026-02-22 18:33:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6tzfy0",
                  "author": "TheMightyMisanthrope",
                  "text": "Replace \"company\" with \"little babies that cry\" \n\n\n(Don't do this, I'm not a lawyer)",
                  "score": 2,
                  "created_utc": "2026-02-22 20:15:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6tkyli",
                  "author": "XB_Demon1337",
                  "text": "Don't just comply with the legal demands. Comply LEGALLY with their demands. When their demands are not about you violating the law, then they have no legal leg to stand on. ",
                  "score": 0,
                  "created_utc": "2026-02-22 19:04:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6saumb",
              "author": "Open-Dragonfruit-007",
              "text": "Yeah, just say something like leading closed source competitor or what ever the equivalent is to make it obvious you are talking about them but legally you have not named them",
              "score": 15,
              "created_utc": "2026-02-22 15:35:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6u9mez",
                  "author": "ReachingForVega",
                  "text": "This would be my suggestion",
                  "score": 2,
                  "created_utc": "2026-02-22 21:07:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6wmqoi",
              "author": "coderemover",
              "text": "Using the brand name only to identify/refer to the original service is the primary purpose of brand names. You are not allowed to use someone else’s logo on your product or in any way that would trick your customers into thinking you or your product is the original product/service/initiative done by the owner of the brand/logo. So e.g. if you manufacture replacement toners for HP you must not put HP logo on your toner package, but you can put a label „a replacement toner for HP XXXXX printer”.",
              "score": 1,
              "created_utc": "2026-02-23 05:39:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6rvcvp",
          "author": "Marble_Wraith",
          "text": "> Remove any mention of their company name from my main open-source project and website (since it’s trademarked).\n\nThe logo yes, the textual name, no.\n\nThe main uses of a trademark are to prevent:\n\n- phishing: so you can't blatantly mask your product or service as another.\n- reputation hijacking: so you can't mention a brand and impute association of your own product / service.\n\nUnless you were actually trying to do that, courts would rule in your favor.\n\nThe fact yours is opensource (non-profit) is already a huge strike against them.\n\n> I originally had my tagline as \"The Free open-source [Company A] Alternative,\" which they claimed was illegally driving their traffic to my site.\n\nDogshit. If anything this is mutually exclusive with the trademark claim they just made.\n\nAggressive marketing has no penalties. Fucks sake next thing they'll say is SEO and using certain meta keywords is illegal 🤣\n\n> Remove a feature comparison chart I made. (I admittedly messed up here, I only compared my free tool to their paid tier and omitted their limited free tier, which they claimed was misleading and defamatory).\n\nNo? Depends on if you were actually defamatory... duh. As long as you were truthful in the comparison and/or clearly state \"it's my opinion\", they can't do anything.\n\nOtherwise there'd be no product comparisons ever on the internet, example:\n\nhttps://typesense.org/typesense-vs-algolia-vs-elasticsearch-vs-meilisearch/\n\nFurthermore depending on your jurisdiction, defamation can require the *plaintiff* to provide evidence of significant financial loss... The internet is exposed to the entire world. Good luck with trying to prove causation over correlation 🤣",
          "score": 51,
          "created_utc": "2026-02-22 14:14:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rwzvg",
              "author": "funyflyer",
              "text": "I have already complied with most demands to avoid more trouble, Your comment made me laugh :)",
              "score": 15,
              "created_utc": "2026-02-22 14:23:44",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6tyn37",
              "author": "twicerighthand",
              "text": ">\n\n>Dogshit. If anything this is mutually exclusive with the trademark claim they just made.\n\nYep. Discord in 2017:  \n[https://i.redd.it/4f5etmp2zkj81.png](https://i.redd.it/4f5etmp2zkj81.png)",
              "score": 5,
              "created_utc": "2026-02-22 20:11:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6uud6j",
                  "author": "Marble_Wraith",
                  "text": "Nice... and ironic given Discords actions that are forcing people to look at Teamspeak again 😂",
                  "score": 3,
                  "created_utc": "2026-02-22 22:55:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6sb2pi",
          "author": "Captain_Lesbee_Ziner",
          "text": "Hope it all gets cleared up. Will be checking out your project now lol. Some articles you might find interesting, plus if you continue to have trouble, talk to the free software foundation\n\nhttps://www.fsf.org/\n\nhttps://fossa.com/blog/analyzing-5-major-oss-license-compliance-lawsuits/\n\nhttps://www.zdnet.com/article/patent-troll-attacks-against-open-source-projects-are-up-100-since-last-year-heres-why/",
          "score": 15,
          "created_utc": "2026-02-22 15:36:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6sc7eo",
              "author": "funyflyer",
              "text": "Thank you so much, I will check them out. ",
              "score": 3,
              "created_utc": "2026-02-22 15:41:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6t976w",
                  "author": "TheOriginalSuperTaz",
                  "text": "You don’t have to continue to comply, though. Frankly, they aren’t that large of a company, and they are just being aggressive because they believe you will let them have their way.\n\nThere are actually protections for you if they try to file a lawsuit to bully you. Talk to a lawyer. Plenty of companies play these types of games instead of making better products. This is how you know you made something good. They are afraid of you and your “little open source project”.",
                  "score": 5,
                  "created_utc": "2026-02-22 18:10:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6rr5ut",
          "author": "Maskdask",
          "text": "~~Unfair~~ competition",
          "score": 30,
          "created_utc": "2026-02-22 13:50:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ruyx3",
          "author": "PapyOak",
          "text": "I'd download your software and advertise for you just to take the piss at them, and I don't even have a drone",
          "score": 33,
          "created_utc": "2026-02-22 14:12:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rwn0l",
              "author": "funyflyer",
              "text": "Haha classic!",
              "score": 9,
              "created_utc": "2026-02-22 14:21:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6tm2s8",
          "author": "DrPiwi",
          "text": "to use your automated download tool?  The user still needs to pay the subscription and the $15 retrieval fee?  \nYour tool does not bypass that and only provides a convenient way to automate the download?  \nThen they have no leg to stand on. \nThe logging data is by definition owned by the user, you can always do what you want with your own data. \nUsing a tool that automates the clicking and selecting is not illegal. If I where you I'd put the tool back on github to avoid being denied your rights by giving in to what is clearly a fishing expedition.\n",
          "score": 7,
          "created_utc": "2026-02-22 19:09:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tmtxk",
              "author": "funyflyer",
              "text": "You are right, it just saves users the manual one by one download, automates that part so you can grab them in bulk, I don't interfere or know how to interfere with their cloud system and my method DO NOT bypass any paywall, users still need to pay, but they are afraid that people will pay once, take their data out and move to my software, they were very critical on the downloader part. The deserve to be screwed over for holding peoples data hostage and offering no single bulk takeout solution. ",
              "score": 5,
              "created_utc": "2026-02-22 19:13:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6uxlns",
                  "author": "ghostsquad4",
                  "text": "Yep, they are afraid of the truth, and of competition. That fear is driven by what they already know is true about themselves, they are scamming customers by keeping their data hostage.",
                  "score": 2,
                  "created_utc": "2026-02-22 23:12:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6sbjmt",
          "author": "Turkino",
          "text": "I also have never really gotten into the high-end drone market, at least nothing that would generate a log, but I'm starring and downloading this now just on principle.",
          "score": 7,
          "created_utc": "2026-02-22 15:38:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6scno4",
              "author": "funyflyer",
              "text": "I can provide some sample files if you want to play on the web app or downloaded application ",
              "score": 2,
              "created_utc": "2026-02-22 15:43:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6u236s",
          "author": "PurpleYoshiEgg",
          "text": "Lawyer the fuck up immediately.  Don't bend to their will without doing that.",
          "score": 6,
          "created_utc": "2026-02-22 20:29:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6skak8",
          "author": "semiquaver",
          "text": "Contact the Electronic Frontier Foundation, I can all but guarantee they would be willing to represent you.",
          "score": 14,
          "created_utc": "2026-02-22 16:16:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tkpu8",
          "author": "XB_Demon1337",
          "text": "So, of course I am no lawyer. \n\n**1. The comparisons and the company name on the website**\n\n[https://en.wikipedia.org/wiki/Nominative\\_use](https://en.wikipedia.org/wiki/Nominative_use)\n\nThis directly makes you able to make the comparisons to their product using their logo/name. You can only use their logo if it is the only way to convey who they are. So like Walmart you can't exactly use their logo on your website. If this is who I think it is, then you can use their name without issues. As a note, while you certainly should be honest about your comparisons. You don't have to comply to their will. If you don't want to post the Free Tier comparison you don't have to. But it wouldn't be a bad idea to do it either. Personally I would stiff it to them and not post the Free Tier. \n\nAlso note that this lets you still use the tag line \"The Free open-source \\[Company A\\] Alternative,\" so long as you don't use their logo or font.\n\nMe, I put all the details back and replace logos with names. Email the lawyer back and cite this. They SHOULD back off. \n\n**------------------------------**\n\n**2. The automated download tool**\n\nThis is something that so many companies hate when you do. But it doesn't violate laws directly. It may violate their ToS, but no laws. They did this to strong arm you. I do not actually see anything in their ToS that shows you violated anything. Their Robots.txt does say they don't allow them though. All this to say though, it depends on how you are downloading these things. If you are using links to download but you have to scrape the page to do so then it sits in a grey area. That grey area is able to be litigated. \n\nI can't say how the website is setup but I can say that if they provide links to them and you are simply using those links without scraping then your tool is fine. This would be like clicking the download button on a bunch of pages at one time. While not using some bot to parse all of the data at one time. \n\nI can understand if you don't continue this specific tool, but if you do it in a way that isn't scraping their login-based pages, then you should be fine.\n\n**------------------------------**\n\nOf course, they can always still try to sue you for literally anything. Personally the #1 part shouldn't be a problem. You have legal recourse and if they try to strong arm you then you can easily get a lawyer and then get fees back from them. The #2 is where you have to determine some legality. Never assume their lawyer is going to tell you the truth and never assume they are going to get to a point where they are going to accept your website existing. They will lie and beat you down until you feel the project can no longer continue. They are rats at best and at worst criminals. \n\nAlso, I would HIGHLY suggest getting a lawyer too. They will be able to fight harder than you can as they have a better understanding. ",
          "score": 3,
          "created_utc": "2026-02-22 19:03:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rnqba",
          "author": "P1r4nha",
          "text": "You messed up because you presented a simple circumvention tool as direct competition to a company's work and business model while using their trademark.\n\nThis is often an issue for open source tools that are customer-first rather than putting simple ease of use features behind a paywall.\n\nDepending on jurisdiction you may still violate non circumvention clauses or agreements. Just host your project where circumvention is legally protected like fair use, repairability and the like. Without using trademark and not letting a doubt that this is a free, customer-first tool that is not a competition but provides additional features to users of these drones.",
          "score": 8,
          "created_utc": "2026-02-22 13:29:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tm4o1",
              "author": "XB_Demon1337",
              "text": "Circumvention would imply that OP made a tool to get around their paid tier. That isn't what OP made. OP made a tool that provides the same service as the company complaining. This is direct competition. It is no different than Google Email vs Yahoo Email. They do the same thing. The thing OP MIGHT have messed up on is the ability to download the logs. Depending on how this is done it could be perfectly legal and nothing they can do. Or it could be a big deal and have to be reworked. ",
              "score": 4,
              "created_utc": "2026-02-22 19:09:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6utwsd",
          "author": "gdmzhlzhiv",
          "text": "Define “unfair competition”… to me that just reads like “capitalism working as designed”.",
          "score": 2,
          "created_utc": "2026-02-22 22:52:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6uvo8y",
              "author": "funyflyer",
              "text": "I did not like the tone, but of course it's a legal document, so they want to be scary!",
              "score": 1,
              "created_utc": "2026-02-22 23:02:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6uxfxk",
          "author": "plazman30",
          "text": "Maybe you should reach out to the EFF and see if they'll take the case.",
          "score": 2,
          "created_utc": "2026-02-22 23:12:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wjzdw",
          "author": "sutcher",
          "text": "This is fascinating. Thanks for sharing. I think this is going to be more and more common",
          "score": 2,
          "created_utc": "2026-02-23 05:17:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x55bq",
          "author": "xnfra",
          "text": "It’s not illegal to mention their business name. They are so soft.",
          "score": 2,
          "created_utc": "2026-02-23 08:25:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xg3aa",
          "author": "Thomas-B-Anderson",
          "text": "Lol I wasn't aware of your project until the Monopoly-corp fucked up and attacked you. Guess I'll be using your alternative from now on! I have a friend who does surveying with drones who I'll recommend your project to as well. Welcome to the Streisand effect!",
          "score": 2,
          "created_utc": "2026-02-23 10:12:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xh4gm",
              "author": "funyflyer",
              "text": "Thank you so much! I was scared at first but now I am confident about the impact of my project. ",
              "score": 1,
              "created_utc": "2026-02-23 10:22:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ypmxq",
          "author": "Inaksa",
          "text": "I can’t help but consider the CEO apology is nothing but a disaster containment measure. If he is truly then why couldn’t he stop earlier (before the letter was sent) his company attempt to shut you down? It means he does not control his own company?\n\nAnd the other thing a company blocking a script that downloads YOUR data is a pos company.",
          "score": 2,
          "created_utc": "2026-02-23 15:21:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ytmtr",
              "author": "funyflyer",
              "text": "For the how the downloader script works - here is the flow. \n\nUses legitimate authentication - You must manually log in with your real credentials on company A's actual website (loads [company-a.com](http://company-a.com) in an embeded browser)\n\nReuses your valid session - It simply captures cookies from your authenticated session (same as what ANY browser does)\n\nCalls official API endpoints - The endpoints are the same internal APIs that A's web interface uses (same as ANY website does)\n\nNo CAPTCHA circumvention - If company A shows a CAPTCHA during login, you'd have to complete it manually in the embedded browser (SAME as ANY website)\n\nMore clarity for you.",
              "score": 1,
              "created_utc": "2026-02-23 15:40:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o70txhj",
          "author": "Anubis_16",
          "text": "Just jumping in to say thank you for your work. I am not even remotely in drones or anything but saw this thread and searched further because of it. I too downloaded the app and also pulled the main from GitHub as a zip just to have it saved. \n\nIf you can, please try to send this info to Louis Rosmann and his team, they are awesome in advocating for us consumers and call out companies on their shitty behaviour and also probably could provide assistance in this matter.",
          "score": 2,
          "created_utc": "2026-02-23 21:20:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73cmti",
              "author": "funyflyer",
              "text": "Thank you so much, I am amazed by the community support. I sent him an email to the youtube address.",
              "score": 1,
              "created_utc": "2026-02-24 06:20:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o731yt5",
          "author": "rockandrolla66",
          "text": "\"They claimed was illegally driving their traffic to my site\", I'm sorry but this doesn't stand any chance on a court of law. ",
          "score": 2,
          "created_utc": "2026-02-24 04:56:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o788wgk",
          "author": "malalabouche",
          "text": "[Company A] sounds like the kind of business Claude Code will soon put out of business.",
          "score": 2,
          "created_utc": "2026-02-24 23:17:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rljnz",
          "author": "OkSpirit3216",
          "text": "Can you point to the repo?",
          "score": 4,
          "created_utc": "2026-02-22 13:15:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rml2f",
              "author": "funyflyer",
              "text": "It's on the linked site : [https://github.com/arpanghosh8453/drone-logbook](https://github.com/arpanghosh8453/drone-logbook)",
              "score": 16,
              "created_utc": "2026-02-22 13:22:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6rplz9",
                  "author": "AccomplishedLine4909",
                  "text": "Thank you.",
                  "score": 4,
                  "created_utc": "2026-02-22 13:41:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6xr8mu",
                  "author": "ScaredyCatUK",
                  "text": "Just gonna clone that to my own gitea before it vanishes... ",
                  "score": 1,
                  "created_utc": "2026-02-23 11:53:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6rsco7",
                  "author": "unitedbsd",
                  "text": "Good work.",
                  "score": 1,
                  "created_utc": "2026-02-22 13:57:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6uv8d6",
          "author": "Rattus_NorvegicUwUs",
          "text": "Someone is mad their boss will realize they are overpaid…",
          "score": 2,
          "created_utc": "2026-02-22 22:59:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v1zik",
          "author": "Doctorphate",
          "text": "Tell them to go fuck themselves",
          "score": 2,
          "created_utc": "2026-02-22 23:37:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tk6j2",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-02-22 19:00:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tl2vt",
              "author": "funyflyer",
              "text": "It was not DJI though, some US based company. ",
              "score": 1,
              "created_utc": "2026-02-22 19:04:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6tmd6v",
                  "author": "TeutonJon78",
                  "text": "From other comments i thought it was DJI. Removed the comment.",
                  "score": 1,
                  "created_utc": "2026-02-22 19:10:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6tl6n4",
          "author": "Psychological-Leg413",
          "text": "I think the script automating bulk download is gonna be the crux here..",
          "score": 1,
          "created_utc": "2026-02-22 19:05:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6vyxrn",
              "author": "Due-Equivalent-9738",
              "text": "Not a lawyer but I don’t see how it could be an issue. Using it may be a TOS violation, but the script is doing it on behalf of a paying user with the paying user’s consent. It’s no different from the user individually downloading each file. If they want to prevent that, they need to have rate limits at the API level rather than in the UI.",
              "score": 2,
              "created_utc": "2026-02-23 02:52:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6tpd5u",
          "author": "r-pics-sux",
          "text": "Ahh man, cant wait to use this with my fpv drone!",
          "score": 1,
          "created_utc": "2026-02-22 19:25:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tv3k2",
          "author": "bullmeza",
          "text": "Damn, is this all resolved now? Can they still pursue you?",
          "score": 1,
          "created_utc": "2026-02-22 19:54:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6us9fq",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-02-22 22:43:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6uvgvz",
              "author": "funyflyer",
              "text": "Well said, I am quoting you to my brother now :)\n\n",
              "score": 3,
              "created_utc": "2026-02-22 23:01:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6uv06j",
          "author": "Arthemio2",
          "text": "https://plot.ardupilot.org/#/ for binaries... Or use plotjuggler with .ulog files... Everything is already there as opensource solutions in the drone space. If hosting is needed it is also very easy to setup yourself.",
          "score": 1,
          "created_utc": "2026-02-22 22:58:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6uw4tb",
              "author": "funyflyer",
              "text": "The problem is with ongoing development, I need an automated CI/CD pipeline for the builds. ",
              "score": 1,
              "created_utc": "2026-02-22 23:04:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6w0ag6",
          "author": "ivosaurus",
          "text": "The only thing possibly infringing is your exfill tool allowing a user to access their servers in possibly a non-authorised manner, against signed T&Cs.\n\nOtherwise the entirety of that is just designed to remove as much advertising as possible from your own sources so you aren't as much of a problem to their revenue stream. You're allowed to represent facts, and companies aren't allowed to unilaterally silence any member of public who mentions their name. They would like to pretend to you that they can though. \n\nIt is NOT irony if they spend thousands once now, but it has saved them thousands more in kept customer fees over the next next few months compared to if they hadn't scared you off so easily.",
          "score": 1,
          "created_utc": "2026-02-23 03:00:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wuhif",
          "author": "Conscious_Nobody9571",
          "text": "If i was you, i wouldn't have replied to them, and i wouldn't meet with them... Let them seethe",
          "score": 1,
          "created_utc": "2026-02-23 06:45:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x42xf",
              "author": "funyflyer",
              "text": "I just want to bring fairness to the system, nothing else. All I did is provide a tool with which the users can download their own data in bulk (a service they don't provide intentionally). I don't bypass any payment or anything else, just download the same files the user could do by clicking the links one by one and get annoyed and wait for each download to finish.  It's the users data and they should be able to get it if they wish so, permitted by their payment structure. ",
              "score": 1,
              "created_utc": "2026-02-23 08:14:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6xgmqm",
                  "author": "Conscious_Nobody9571",
                  "text": "I don't think you understand... They want to make you pay somehow",
                  "score": 1,
                  "created_utc": "2026-02-23 10:18:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6x50tm",
          "author": "xnfra",
          "text": "Tell them to kick rocks and to make a better product because a one man army replaced their rent seeking business plan. Tell them “adapt or die”.",
          "score": 1,
          "created_utc": "2026-02-23 08:24:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x5jqy",
              "author": "funyflyer",
              "text": "Sounds true to me, I am a single individual, and it's in development for only a month, and they are feeling \"unfair competition\"? ",
              "score": 1,
              "created_utc": "2026-02-23 08:29:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xfsus",
          "author": "Thomas-B-Anderson",
          "text": "Just starred your project on GitHub, fuck the monopoly.  They take take take existing open source work and build they business on it, but they don't have any appreciation for FOSS.",
          "score": 1,
          "created_utc": "2026-02-23 10:10:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xgyuu",
              "author": "funyflyer",
              "text": "Well, i made the license AGPLV3, no funny business like that. ",
              "score": 2,
              "created_utc": "2026-02-23 10:21:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xiozi",
          "author": "idlethread-",
          "text": "Forked the repo. They can't shut you down now.\n\nBut replace their name with 'Commercial entity A' to avoid trademark related litigation.",
          "score": 1,
          "created_utc": "2026-02-23 10:37:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xkuz9",
              "author": "funyflyer",
              "text": "The exporter repo in question that lets you bulk download their data to move into any other platform of choice has been taken offline, we are trying to negotiate with the company with best intention for the entire drone community. ",
              "score": 1,
              "created_utc": "2026-02-23 10:57:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6y6qwi",
          "author": "AnonomousWolf",
          "text": "Fuck any company that locks software behind a subscription.\n\nKeep up the good fight",
          "score": 1,
          "created_utc": "2026-02-23 13:39:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zpyi9",
          "author": "BAbeast1993",
          "text": "The CEO realized it might be better to go with the carrot instead of the stick. They'll probably try to buy you out.",
          "score": 1,
          "created_utc": "2026-02-23 18:11:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zqj45",
          "author": "vnagornyy",
          "text": "Something different to consider, it might be worth assigning copyright to FSF to protect it. \n\nIf I'm not mistaken, by assigning copyright, the FSF becomes the entity that would have to be sued or challenged regarding the software's right to exist, rather than you personally. Might want to reach out to FSF for more info, how they can help.\n\nhttps://www.fsf.org/bulletin/2022/fall/copyright-assignment-with-the-fsf",
          "score": 1,
          "created_utc": "2026-02-23 18:13:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zvtuo",
          "author": "Alarming_Bluebird648",
          "text": "Sending a legal document before attempting a direct conversation is a classic intimidation tactic, regardless of the CEO's tone after the fact. It's doubtful they would have reached out with an apology if the community hadn't rallied around the project first.",
          "score": 1,
          "created_utc": "2026-02-23 18:37:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o702a2p",
              "author": "funyflyer",
              "text": "Clearly it's a way to damage control, but at least they are willing to communicate and respond. ",
              "score": 1,
              "created_utc": "2026-02-23 19:06:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72sv2y",
          "author": "Garland_Key",
          "text": "What license was the code under? It would be a shame if other users mirrored said free and open source code... Did it have any forks? ",
          "score": 1,
          "created_utc": "2026-02-24 03:53:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73dahd",
              "author": "funyflyer",
              "text": "Only one when I had to take it down 😕 and BSD 3 clause",
              "score": 1,
              "created_utc": "2026-02-24 06:25:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o74qt3r",
          "author": "Ascending_Valley",
          "text": "Be wary of nice tone now. They fear amplification and bad publicity. Use that however you choose, but keep trust eval low.",
          "score": 1,
          "created_utc": "2026-02-24 13:21:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77pc2v",
          "author": "IGIVEDOGSANALSEX",
          "text": "u/funyflyer, what you’re doing is great! Anything letting people take back what is there’s is a good thing in my book. I heavily recommend you reach out to the Rossman group. Louis Rossman is a legend, and this type of stuff is exactly what he’s advocating for, and trying to make better for everyone. This seems like something he’d definitely be on the side of.",
          "score": 1,
          "created_utc": "2026-02-24 21:40:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7841dw",
              "author": "funyflyer",
              "text": "I reached out to him via email and discord, did not get any response yet, but I am hopeful.",
              "score": 1,
              "created_utc": "2026-02-24 22:51:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o78cglk",
                  "author": "IGIVEDOGSANALSEX",
                  "text": "I also sent him an email and included this thread! I hope he gets back to you!",
                  "score": 1,
                  "created_utc": "2026-02-24 23:36:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7cby3b",
          "author": "Link_Tesla_6231",
          "text": "Your still naive if your talking to the company at all. Everything you say is likely being recorded and will be used against you in court.\n\nReach out to Louis rossman and FULU. This is a story they like and would likely help you get out of this shit!\n\nCompany an apparently feels you don’t own anything and FULU is all for you owning everything!",
          "score": 1,
          "created_utc": "2026-02-25 15:39:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cexaa",
              "author": "funyflyer",
              "text": "I sent a discord message and email to Louis Rossman. i am yet to hear back. ",
              "score": 1,
              "created_utc": "2026-02-25 15:53:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7cgsnb",
          "author": "echo_c1",
          "text": "If I’m not mistaken nobody wrote but here is the thing: from GDPR point-of-view if they have EU based users, this data belongs to the user and every one of these users can request data FREE OF CHARGE even if they close their account, NO retrieval fee, NO premium membership.\n\nEven without your open-source software they have to comply with these rules. But considering they don’t comply with the law, your software IS NOT A COMPETITION but giving users to exercise their rights. If anything it is “supplementary” tool, not a commercial service as it’s open-source, once the source code copied and installed by the user, they own the software so you are not even supplying this service. They have to sue their own customers, not you.\n\nI would say that COMPANY A shoot themselves in the foot (f…d it up big time) by putting themselves into the spotlight through showing that they don’t comply with rules and put “user’s data” behind a paywall with no export option.\n\nGDPR Article 12(5), Article 20 Data Portability and Article 15 Right of Access are violated by Company A. Now they won’t get any legal leverage by sueing you but now they are in the spotlight, they will be pressured to add this feature immediately themselves.\n\nGood job Company A lawyers for pressuring their own company to comply with the law indirectly.",
          "score": 1,
          "created_utc": "2026-02-25 16:01:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7cm0bm",
              "author": "funyflyer",
              "text": "\\> Even without your open-source software they have to comply with these rules. But considering they don’t comply with the law, your software IS NOT A COMPETITION but giving users to exercise their rights.\n\nexact words are in our legal response to the C&D, my attorney came to the same conclusion when handling the case. Just check this comment from their privacy policy : [https://www.reddit.com/r/selfhosted/comments/1rbkx5e/comment/o6s925t/](https://www.reddit.com/r/selfhosted/comments/1rbkx5e/comment/o6s925t/)\n\n\\> By using the Service, you are authorizing us to gather, process, analyze, and retain data related to the provision of the Service. **We may retain such information, including Personal Information, indefinitely**.\n\nGood luck with defeating that in the EU court. GDPR violation fine is 20 million EUR :)\n\nWe also have in file that by providing the tool, user is responsible for their actions with the TOS, not US. And it does not violate ANY security as it is just an embedded browser under the hood. No fnncy scripting, just a browser plugin can do the same.",
              "score": 1,
              "created_utc": "2026-02-25 16:25:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7cw06r",
                  "author": "echo_c1",
                  "text": "By the way, they will try to force you to cave in and even CEO’s actions are in that way not-benevolent (or he has no idea what his company is doing behind his back, sending C&D letters, which I highly doubt).\n\nThey will try to act like they are doing a favour to you and themselves by preventing long lawsuits, which I don’t think there is much of a base to be accepted in the first place. I also don’t think GitHub will cave in to their requests either unless there is a clear court decision. NPM did it once, it didn’t created a good PR for NPM as they showed they don’t care about open source devs. I don’t think GitHub wants that bad publicity when they have other problems to focus on right now in this shaky environment.\n\nThey will try to scare you with these legal tactics, don’t worry there are many pro-bono legal services all over EU that can help you, especially considering this company is violating EU users data rights.\n\nOne thing you should never do and the company is praying right now you’ll do is to SILENCE you to tell this story. They have only one concern: violate user rights and capitalise on the user’s data and there is nobody offers them an escape from the prison they created. Your software gave people choice without paying them money again and again and again until this company lock them in even more.\n\nThey will start with trademark claims, then competition claims, then some other claim. But ultimately they want nobody to know that they are violating user’s data rights.\n\nIF you decide to accept that terms, know that they have to pay a hefty fee for your silence and they have to accept not to enforce any other legal proceedings OR PAY another hefty fine if they do exercise legal options, once you sign that agreement.\n\nKnow this, they have a right to sue, then they have a right to lose. Then you will have a right to tell this story all over the internet and it will become such a popular story that once anybody search their name, this story will be the first thing they land. AI will tell this story when someone asks for their service.\n\nSo they shot themselves in the foot basically. You won’t have real issues, since you’re acting from a good intentioned point of view first of all. Their trademark claims are bullshit as well, you’re not using their trademark to cheat people into thinking that you’re associated with them, actually the opposite. They have nothing and if they act like this they will lose big proportion of their user-base because of their illegitimate actions (thinking they own the user data indefinitely).\n\nDon’t be scared. You could even had a legitimate commercial business offering this service for a fee and get their users to your EXACT COPY of their product/service and still have comparison pages and such. You wouldn’t lose then either. They have nothing but trying to scare you. They pray that you won’t lawyer up. EU has institutions and many professional services supporting people like you.",
                  "score": 1,
                  "created_utc": "2026-02-25 17:11:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7f7vpx",
          "author": "Reiszecke",
          "text": "Their claims are bullshit. You are free to use their name in terms of a comparison. The only way you can’t use it if it sounds like you’re affiliated with them.",
          "score": 1,
          "created_utc": "2026-02-25 23:49:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o7nse",
          "author": "zak_fuzzelogic",
          "text": "Not a lawyer..  but.\nWhat law did you break\nThey claim unfair competition.. they will have to prove it. \nYou could go on the offensive and counter sue for damages and monopoly on their side..just saying... not legal advise..",
          "score": 1,
          "created_utc": "2026-02-27 09:09:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6uxahw",
          "author": "ghostsquad4",
          "text": "Fuck capitalism.",
          "score": 1,
          "created_utc": "2026-02-22 23:11:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6w3hwd",
              "author": "South-Steak-7810",
              "text": "Sanpō Yoshi (still capitalism) is the way.\nAnd I’d personally would like to add ‘good for nature’ to the initial three.",
              "score": 0,
              "created_utc": "2026-02-23 03:21:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6uwlds",
          "author": "susimposter6969",
          "text": "Since you're still hitting their endpoints they probably also consider it unauthorized use",
          "score": 1,
          "created_utc": "2026-02-22 23:07:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6uwrug",
              "author": "funyflyer",
              "text": "All I did is provide a tool with which the users can download their own data in bulk (a service they don't provide intentionally). I don't bypass any payment or anything else, just download the same files the user could do by clicking the links one by one and get annoyed and wait for each download to finish.  It's the users data and they should be able to get it if they wish so, permitted by their payment structure. I don't hit their endpoints, a user with their own data does to get back their data, how is that unfair?",
              "score": 2,
              "created_utc": "2026-02-22 23:08:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6v4sdy",
                  "author": "susimposter6969",
                  "text": "Are you using something like playwright or are you making API calls on behalf of the user",
                  "score": 1,
                  "created_utc": "2026-02-22 23:53:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6snzzp",
          "author": "DKurtel",
          "text": "RemindMe! 2day",
          "score": -1,
          "created_utc": "2026-02-22 16:33:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6so6op",
              "author": "RemindMeBot",
              "text": "I will be messaging you in 2 days on [**2026-02-24 16:33:08 UTC**](http://www.wolframalpha.com/input/?i=2026-02-24%2016:33:08%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/opensource/comments/1rbkzwe/large_us_company_came_after_me_for_releasing_a/o6snzzp/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fopensource%2Fcomments%2F1rbkzwe%2Flarge_us_company_came_after_me_for_releasing_a%2Fo6snzzp%2F%5D%0A%0ARemindMe%21%202026-02-24%2016%3A33%3A08%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201rbkzwe)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "score": -1,
              "created_utc": "2026-02-22 16:33:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rfrtj1",
      "title": "Update : Large US company came after me for releasing a free open source self-hostable alternative - Resolved in our favor",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rfrtj1/update_large_us_company_came_after_me_for/",
      "author": "funyflyer",
      "created_utc": "2026-02-27 00:37:41",
      "score": 976,
      "num_comments": 24,
      "upvote_ratio": 0.99,
      "text": "This is a follow up to my [previous post](https://www.reddit.com/r/opensource/comments/1rbkzwe/large_us_company_came_after_me_for_releasing_a/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) regarding the C&D notice I received. I have some incredible news for the community: the matter is officially resolved in favor of the entire drone and OSS community.\n\n**TLDR:** **AirData UAV** has complied with community concerns, implemented a robust data takeout solution, and we have settled the matter gracefully.\n\n**The free OSS project in question :** [**www.opendronelog.com**](https://www.opendronelog.com/)\n\n\\---------------\n\nSince the legal threat is no longer active, I can finally name the company. It was **AirData UAV**, a US based drone log analysis and reporting service. Eran said it's my choice to name them or not name them here in this update post, I choose to name, because I don't have anything bad to say anymore.\n\nDespite the first approach was a C&D, the final outcome was actually better than I hoped for (surprised actually!). A massive thank you goes to [u/Archiver\\_test4](https://www.reddit.com/user/Archiver_test4/), who acted as my legal representative pro bono (for free!! and denied donations). He prepared a powerful response and helped me pass this with confidence. He has even started a new subreddit, [r/Opensource\\_legalAid](https://www.reddit.com/r/Opensource_legalAid/), to help other indie devs in similar situations.\n\n# The Meeting with the Airdata UAV CEO Eran Steiner\n\nIn response to the traction the [original post](https://www.reddit.com/r/opensource/comments/1rbkzwe/large_us_company_came_after_me_for_releasing_a/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) gained, AirData CEO **Eran Steiner** reached out for a face to face meeting via email within 6 hours of the post going live. He expressed regret over the legal route they initially took (he took the responsibility for that as well as CEO) and personally saw to it that the following changes were made before we even spoke:\n\n* **Official Data Takeout Solution:** This was the **main goal** (and my demand for data portability and fairness, because it's painful to export files one by one, clicking one after another and waiting). **AirData UAV** now provides a **central takeout solution**, making them fully GDPR compliant. You can now download your data in its original format without needing my 3rd party automation \"patch.\". If you are interested, [please check out here](https://github.com/arpanghosh8453/open-dronelog#airdata-exports).\n* **Trademark Resolution:** We agreed that fair representation and disclaimers are the way to go. I have already added these to my project, and I am free to use their name when representing truthful facts, as permitted by EU laws. I won't go into more technical/legal aspects than this of what trademark rights they actually hold or not.\n* **Account Restoration:** As a gesture of goodwill, they have **fully restored my account** and all my log files before I asked. ❤️\n* We agreed to drop all allegations and, in the future, talk through any issues personally rather than involving lawyers.\n\nI am just a solo dev working in my free time, and I have no intention of competing with an established company. I am just thrilled that the community now has true data portability as I hoped for, and they are free to choose as they please based on what features/interface they like. Thank you Eran for making this happen so quick without any drama/delay or missed promise. **AirData UAV** no longer \"holds your data\" to keep you on their platform. To be fair, they do have a functional and data rich toolset that many in the community still enjoy (including myself!) - They also have a very robust data sync solution which works very well. I am not paid or bribed or sponsored by them, I am just giving credit where it's due.\n\nThank you r/opensource for all for the support. It made all the difference! Open Source for the WIN!",
      "is_original_content": false,
      "link_flair_text": "Community",
      "permalink": "https://reddit.com/r/opensource/comments/1rfrtj1/update_large_us_company_came_after_me_for/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7mexbt",
          "author": "boredquince",
          "text": "this is great news. congrats! ",
          "score": 83,
          "created_utc": "2026-02-27 01:23:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mf65g",
              "author": "Treedweller7898",
              "text": "Double congrats",
              "score": 18,
              "created_utc": "2026-02-27 01:25:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7mgjlv",
                  "author": "r-pics-sux",
                  "text": "Triple congrats",
                  "score": 12,
                  "created_utc": "2026-02-27 01:33:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7mohrs",
          "author": "Purple_Mine_1676",
          "text": "Sounds like you lucked onto a company that, at the most cynical level, at least knows how to make good on their PR mistakes.\nMaybe they're good guys as well.",
          "score": 46,
          "created_utc": "2026-02-27 02:19:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7o2j4x",
              "author": "MrWFL",
              "text": "Most likely people with their livelihoods on the line, felt threatened, and chose a bully tactic.\n\nThat bully tactic got a lawyer involved, and backfired massively (yay gdpr). And now they’re doing damage control.",
              "score": 26,
              "created_utc": "2026-02-27 08:21:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7q0s93",
                  "author": "Tekuzo",
                  "text": "For an example of this going really bad see Proven Industries.",
                  "score": 1,
                  "created_utc": "2026-02-27 16:15:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7mxpjp",
          "author": "ndnihil",
          "text": "Well done. This is the kind of outcome we need more of in the world.",
          "score": 12,
          "created_utc": "2026-02-27 03:12:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o3hmi",
          "author": "DonkeeeyKong",
          "text": "Well done. It does sound like they got nervous because they were breaking EU law and many people pointed that out.",
          "score": 11,
          "created_utc": "2026-02-27 08:30:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7o5syi",
              "author": "funyflyer",
              "text": "Apparently yes, they legal team must have figured out the same and suggested compliance. But at this point they are, so that's a win!",
              "score": 8,
              "created_utc": "2026-02-27 08:52:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7nv3q4",
          "author": "DBT85",
          "text": "Feels like something Louis Rossman would have an interest in.\n\nCongrats BTW!",
          "score": 8,
          "created_utc": "2026-02-27 07:14:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mvqf1",
          "author": "atobmic",
          "text": "Crushed it. Real change",
          "score": 9,
          "created_utc": "2026-02-27 03:01:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o9yno",
          "author": "Penetal",
          "text": "I wonder if companies in general will ever learn that they are not, and can not, compete with self hosted alternatives. People that want to self host, and all that comes with, are not the same people that want a service that does it for you. Software night service the same function, but the market is just not the same people, not truly competing products.\n\nIt's like as if take out restaurants were to start legal battles against people writing home cooking recipes and sharing them with others. No! One is cheaper with extra work, one is more expensive with extra convenience.",
          "score": 6,
          "created_utc": "2026-02-27 09:32:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ntmnz",
          "author": "NamedBird",
          "text": "I am happy for you that the legal threats are out of the way!  \n",
          "score": 3,
          "created_utc": "2026-02-27 07:01:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7oc162",
          "author": "aciokkan",
          "text": "Congrats! \nIt's really cool that the CEO was proactive and worked with you to sort out the kinks and have a resolution that helps the community and their platform equally!! 🌟",
          "score": 2,
          "created_utc": "2026-02-27 09:52:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ojfss",
              "author": "funyflyer",
              "text": "yes, that is why I am making this update, they deserve that much for sure! Credit where it's due. ",
              "score": 3,
              "created_utc": "2026-02-27 10:59:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7tr7fw",
          "author": "Alarming_Bluebird648",
          "text": "The fact that they conceded once the conflict with EU interoperability laws was raised suggests these regulations are finally providing a functional deterrent against aggressive cease and desist orders. This sets an important precedent for protecting independent developers from similar corporate pressure.",
          "score": 2,
          "created_utc": "2026-02-28 04:21:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7omaot",
          "author": "Icy_North5921",
          "text": "Amazing thing to hear!",
          "score": 1,
          "created_utc": "2026-02-27 11:24:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rt7n7",
          "author": "ghostsquad4",
          "text": "Nice!",
          "score": 1,
          "created_utc": "2026-02-27 21:26:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7s1wfr",
          "author": "EveryDebtYouTake",
          "text": "\"AirData UAV now provides a central takeout solution, making them fully GDPR compliant.\"\n\n\nvs\n\n\nKey Aspects of GDPR Fines\nTwo-Tier Structure:\nHigher Tier: Up to €20 million or 4% of annual global turnover for violating core principles, data subject rights, or improper international data transfers.\nLower Tier: Up to €10 million or 2% of annual global turnover for issues regarding data controller obligations, processor issues, or security of processing.",
          "score": 1,
          "created_utc": "2026-02-27 22:10:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tx8br",
          "author": "r4nchy",
          "text": "can we get to know the names of the people who are leading this company ?",
          "score": 1,
          "created_utc": "2026-02-28 05:05:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ug91f",
              "author": "funyflyer",
              "text": "Search in Google for CEO of Airdata UAV",
              "score": 1,
              "created_utc": "2026-02-28 07:46:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rchq9x",
      "title": "Inkscape project struggling with lack of active contributors [video]",
      "subreddit": "opensource",
      "url": "https://friprogramvarusyndikatet.tv/w/ofcCwyxiE2VSaJPBFNnZLb",
      "author": "pimterry",
      "created_utc": "2026-02-23 13:41:37",
      "score": 273,
      "num_comments": 30,
      "upvote_ratio": 0.99,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1rchq9x/inkscape_project_struggling_with_lack_of_active/",
      "domain": "friprogramvarusyndikatet.tv",
      "is_self": false,
      "comments": [
        {
          "id": "o70rn32",
          "author": "sl0bbyb0bby",
          "text": "Noooo I don't need new features, but hope it doesn't become abandonware. Inkscape is great",
          "score": 98,
          "created_utc": "2026-02-23 21:08:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77gb1b",
              "author": "Headpuncher",
              "text": "It's fantastic software. I used to do all the tutorials by LogosByNick on youtube. I made some really cool (to me) stuff. ",
              "score": 8,
              "created_utc": "2026-02-24 20:59:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o71utj3",
          "author": "BP041",
          "text": "this hits close. the contributor pipeline problem is real across basically every mature OSS project -- it's not just Inkscape.\n\nthe bar to 'first meaningful PR' has gotten higher as codebases matured and accumulated technical debt. what I've seen help: genuinely good first issues (not 'fix a typo in the readme'), async video walkthroughs of key subsystems, and maintainers being explicit about review time expectations. that last one changes everything -- knowing you'll get feedback within 48h vs maybe never is a massive difference for new contributors.\n\nbiggest drop-off is usually between 'I found a good first issue' and 'I actually understand enough to attempt it.' projects that invest in architecture docs and 'here's how X subsystem works' posts tend to convert lurkers into contributors way better than just labeling more issues.",
          "score": 59,
          "created_utc": "2026-02-24 00:33:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72c1xi",
              "author": "RedDotHorizon",
              "text": "There are many more ways to be helpful that don't require in-depth technical/programming knowledge: updating documentation, tutorials, reproducing bugs/cleaning up the issue tracker, testing, community support, organizing meetings and events, ...\n\nBut yes, if you want to contribute code, there's a learning curve and some lead time required. With most of your suggestions we're in a chicken-and-egg situation: who is going to contribute video walkthroughs, maintain accurate technical documentation and organize their life around a 48h-response-SLA? (While I understand the intention, that last one is a bit outrageous for a volunteer-driven project.) It's a resource problem.\n\nIf I could make a wish, I'd wish for people to see these deficiencies as opportunities. It is actually very easy to make a huge impact on the project because there's so much room for improvement everywhere. You just need to want to apply yourself.",
              "score": 13,
              "created_utc": "2026-02-24 02:12:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o72lkk5",
                  "author": "BP041",
                  "text": "fair points — the 48h SLA framing was too prescriptive. I was trying to get at \"any explicit signal beats silence for a new contributor waiting on their first PR,\" but I overcorrected into something unreasonable for volunteers.\n\nthe non-code contribution point is real and I glossed over it. I've seen projects where one person consistently doing issue triage + writing actual-context \"good first issue\" labels moved the needle more than a batch of feature PRs. documentation and community scaffolding are leverage, just less visible.\n\n\"see deficiencies as opportunities\" is probably the right frame for this — it just requires someone to internalize that the gap is an invitation. harder to communicate to a newcomer than a list of tasks, but more durable when it clicks.",
                  "score": 8,
                  "created_utc": "2026-02-24 03:07:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o710l6k",
          "author": "P1r4nha",
          "text": "I love that tool. It's written in C++. Might be worth a look.",
          "score": 26,
          "created_utc": "2026-02-23 21:51:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70y3qt",
          "author": "Ginjutsu",
          "text": "Dang, that's a bummer to hear. Love Inkscape and use it all the time. Hopefully things get better in the future.",
          "score": 21,
          "created_utc": "2026-02-23 21:39:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o732wxn",
          "author": "ivosaurus",
          "text": "[Here's the video on Youtube](https://youtu.be/axf28yT7-98?t=18) if someone wants to check it out there as well\n\nI wonder if Krita is experiencing any of the same problems, maybe to a lesser extent; or by contrast, if this is more unique to Inkscape",
          "score": 16,
          "created_utc": "2026-02-24 05:03:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76spg9",
          "author": "Banana_tnoob",
          "text": "Does sponsoring / donating help? Are there developers paid by sponsors? Heck, is it even possible to donate? I am a long term sponsor of neovim, but Inkscape is another software that I view as excellent and would like to support it if it helps.",
          "score": 5,
          "created_utc": "2026-02-24 19:09:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76ti44",
              "author": "Banana_tnoob",
              "text": "Answering myself: https://inkscape.org/support-us/donate/\n\nDonating to Inkscape\n\nThe Inkscape Fund is a charity fund for supporting the Inkscape project. It is used in various ways, most particularly to help with costs of gathering Inkscape developers at important conferences such as Libre Graphics Meeting or SCALE and host our own events such as Hackfests. It goes towards Outreachy mentorship programs and other infrastructural costs of running the Inkscape project.\n\n \nDonation via Software Freedom Conservancy\n\nThe Inkscape Fund is currently managed by the Software Freedom Conservancy, Inc., a 501(c)(3) non-profit. All donations made through it are fully tax-deductible to the extent permitted by law. If you have any questions or are otherwise in need of assistance, please visit the SFC site.",
              "score": 7,
              "created_utc": "2026-02-24 19:13:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o77hvo5",
          "author": "Headpuncher",
          "text": "It would help if some distros, ahem ubuntu ahem, would stop pushing broken Snaps. \n\nThere was a long time issue with the default install of Inkscape on Ubuntu \\[X, K, etc\\] using the Snap as the default even from apt. The Snap like many other Snaps being sandboxed had a permissions issue stopping users from exporting files (no FS access). This is why I stopped using Inkscape, I couldn't find a fix aside form building from source which many people wouldn't even think to do. \n\nNot being able to export / save was a major F-up. Issue's like this are the main reason Snaps don't work for me. ",
          "score": 6,
          "created_utc": "2026-02-24 21:06:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ho5fg",
              "author": "sebuq",
              "text": "Isn’t there an AppImage for the latest version?",
              "score": 1,
              "created_utc": "2026-02-26 10:12:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7hp03k",
                  "author": "Headpuncher",
                  "text": "I prefer to do things the way the system / distro recommends instead of having to remember things or have a custom config. \n\nWhether there's an appImage or not isn't the issue, the issue was a broken Snap package that is available from apt/aptitude and App Center. providing broken software through the default repositories is tantamount to sabotage. ",
                  "score": 1,
                  "created_utc": "2026-02-26 10:19:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o72gyab",
          "author": "Atulin",
          "text": "Frankly, not all that surprising. For the longest time, Inkscape had a reputation of \"takes 6 business days to open, and good luck figuring out how to use it\". Nowadays, it has more of a \"takes 1-2 business days to open, and good luck figuring out how to use it\", so it's definitely getting better.\n\nThat said, people generally contribute to what they use and what they like. Not that many people use Inkscape, and even fewer like it.\n\nNo less important is the fact, that it's generally harder to find new contributors for older, less \"exciting\" projects. Inkscape's still on C++17 and GTK3, if I'm not mistaken, with a bunch of Python scripts that do the heavy lifting (sic!)\n\nThey are migrating to C++20 and GTK4, IIRC, but that's a bit of a chicken-and-egg situation itself.\n\nA fresh, new, potential contributor looks like it, says \"eww, smells of mothballs\" and goes looking for some Rust/C#/Kotlin/Javascript project to contribute to instead.",
          "score": 11,
          "created_utc": "2026-02-24 02:41:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72u268",
              "author": "litelinux",
              "text": "The migration is mostly complete, but you're right that we're in a transitional state. Parts of the code do smell of mothballs but that's just what you get with 22-year-old software :)\n\nIt will be fine though. 1.5 is coming together okay and developers are working on larger features, which makes it look like we have less contributions.",
              "score": 20,
              "created_utc": "2026-02-24 04:01:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o748pjm",
                  "author": "McDonaldsWitchcraft",
                  "text": "As a long time Inkscape user, I would really love to have more bugfixes even if that means no additional features. It's probably the buggiest art software I use. Maybe I notice because I use it everyday. But being a graphics program makes it particularly annoying to have so many graphics glitches, especially when exporting.\n\nI wish I knew enough to contribute but for now I can only submit bugs.",
                  "score": 6,
                  "created_utc": "2026-02-24 11:14:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7q5iwl",
              "author": "m-in",
              "text": "GTK for a cross-platform app is a terrible choice though.",
              "score": 1,
              "created_utc": "2026-02-27 16:37:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hhbo2",
          "author": "KenguruHUN",
          "text": "Unfortunately I can't speak c++ at all :(",
          "score": 1,
          "created_utc": "2026-02-26 09:06:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74w4ma",
          "author": "Dontdoitagain69",
          "text": "Let’s create another distro instead of combining resources on current projects.even through I’m used to illustrator at one point when I didn’t want to pay 59/month I used Inscape and it is actually a bday ass vector drawing software. Fast, powerful , no extra bs features. Please keep this alive, there a some Linux projects you can cancel due to poor initial design flaws and move resources to Inkscape",
          "score": -1,
          "created_utc": "2026-02-24 13:51:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gwjp2",
              "author": "HurasmusBDraggin",
              "text": ">Let’s create another distro instead of combining resources on current projects\n\nI feel you here.",
              "score": 1,
              "created_utc": "2026-02-26 05:59:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o73tisx",
          "author": "charmander_cha",
          "text": "Projetos open source deveriam aderir a um novo paradigma de gestão administrativa para evoluir com o uso de LLMs",
          "score": -9,
          "created_utc": "2026-02-24 08:53:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbgx0p",
      "title": "Why you should get involved in open source - a personal story",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rbgx0p/why_you_should_get_involved_in_open_source_a/",
      "author": "jsattler_",
      "created_utc": "2026-02-22 08:50:46",
      "score": 96,
      "num_comments": 17,
      "upvote_ratio": 0.97,
      "text": "Hey everyone,\n\nthis post is going to be slightly promotional but the main intention is to encourage people to do open source work and provide an answer to a recent post in this subreddit [Why build anything anymore?](https://www.reddit.com/r/opensource/comments/1r8fafs/why_build_anything_anymore/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). That's why I used the Community flair.\n\nA bit of background: A few weeks ago I built a screen recorder that solved a problem for me that no other free screen recorder on the market solved. I never had the intention to make any money out of it and just [published it under MIT License on GitHub](https://github.com/jsattler/BetterCapture). I also [shared the repository in the macapps subreddit](https://www.reddit.com/r/macapps/comments/1qza8af/macos_i_built_a_free_open_source_macos_screen/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) hoping some people will find it useful too.\n\nOver the past couple of days, I received lots of positive feedback, mainly through Reddit and GitHub. People I never met or talked to are getting involved in the project and sharing their ideas. A few people even donated money and a Startup asked to sponsor the project. As of writing this, the project has received more than 700 stars on GitHub. It's not as crazy as other projects, but what I learned over the past couple of days is that **building something and sharing it with people who get value out of it, is a really, really good feeling and is encouraging me to keep working on the project in my spare time**. It's very satisfying and fulfilling to see people use what you've built. But that's only one aspect.\n\nI see a lot of people in our industry struggling to keep up with what's happening around AI. People are afraid about not finding or losing jobs. Here is the thing and I hope it's not a surprise by now: **coding alone will not land you a job anymore** (and probably never has). What's much more important now than ever is **credibility and trust that you are able to build and ship something that's useful.** And what's better to demonstrate this skill by building something open source that people actually use. If I ever look for a new job, this project will have more value than putting a 10$ monthly subscription on it.\n\nThat's all I wanted to share and I hope it encourages some people here to get involved in other open source projects or to build something without trying to squeeze every $$$ out of it. Have a nice Sunday!\n\nPS: I also want to acknowledge that I'm in a privileged position and currently do not depend on making money from this project. I get that a lot of people are in a different situation and need to make money to pay their rent.",
      "is_original_content": false,
      "link_flair_text": "Community",
      "permalink": "https://reddit.com/r/opensource/comments/1rbgx0p/why_you_should_get_involved_in_open_source_a/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o6wmb6o",
          "author": "BP041",
          "text": "the part that surprised me most about open source was how much it accelerated my own thinking. explaining something in a README or responding to an issue forces you to understand it 3 levels deeper than just using it.\n\nstarted contributing mainly for the visibility, kept doing it because the problem-solving discipline is different from closed work. with internal codebases you can take shortcuts nobody ever sees. public code forces a kind of honesty that's hard to replicate.\n\nwhat domain is your project in? post linked to something but i couldn't tell from the title.",
          "score": 6,
          "created_utc": "2026-02-23 05:35:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6zjv52",
              "author": "jsattler_",
              "text": "Thanks for sharing. I totally agree with what you described. \n\nThe project I worked on is a screen recorder for macOS. It supports professional codecs such as ProRes4444 and ProRes422, which is not common among other screen recorders.",
              "score": 1,
              "created_utc": "2026-02-23 17:43:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o71xad8",
                  "author": "BP041",
                  "text": "the screen recorder space on macOS is surprisingly sparse for quality capture — sounds like a useful niche. curious what codec you're targeting. ProRes is the obvious choice but bundling the encoder gets annoying. general capture or specific workflows?",
                  "score": 1,
                  "created_utc": "2026-02-24 00:47:04",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o72lh2h",
                  "author": "BP041",
                  "text": "Appreciate it — the discipline point took me a while to internalize too. Easy to skip 'nice to have' practices when you're the only dev and shipping feels more urgent.\n\nA ProRes macOS screen recorder sounds like exactly the kind of niche, high-quality tool that builds a cult following once the right people find it. Curious what's driving the ProRes choice specifically — capturing for video editing workflows?",
                  "score": 1,
                  "created_utc": "2026-02-24 03:07:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6xcdzv",
          "author": "Constant-Drive9727",
          "text": "People usually miss why some projects really take off. It’s not just about building in public or open-sourcing your code. The real spark comes from fixing a problem that actually bugs you.\n\nTake your recorder, for example, it got popular because it solved something that bothered you personally. That does a couple of things right away: the project stays small enough to finish, and the problem is so clear that other people understand it.\n\nA lot of developers i see nowadays jump in with a random idea or chase money, and that’s how you get bloated tools no one asked for.\n\nSo for me, the real takeaway isn’t just “do open source.” It’s about spotting a real pain point, building the simplest thing that fixes it, and letting people see how useful it is. Anyway good job and keep the good work !",
          "score": 5,
          "created_utc": "2026-02-23 09:37:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6zkc2e",
              "author": "jsattler_",
              "text": "Yes, 100% agree. Solving your own problems is a good starting point.",
              "score": 2,
              "created_utc": "2026-02-23 17:45:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6yhfqb",
          "author": "BP041",
          "text": "the compounding is real and it takes longer to kick in than most people expect. my first contributions were tiny -- doc fixes, cleaning up outdated examples. felt kind of pointless at the time.\n\ntwo years later those same communities are where i've met actual collaborators and gotten more real mentorship than any job gave me. the code contributions matter less than the relationships that form around them.\n\nthe thing nobody mentions upfront: you start to genuinely understand how good software is designed, because you're reading other people's decisions and the discussions around them. that pattern recognition is hard to get any other way.",
          "score": 3,
          "created_utc": "2026-02-23 14:39:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w2qxb",
          "author": "bravelogitex",
          "text": "Thanks for sharing, great story",
          "score": 2,
          "created_utc": "2026-02-23 03:16:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71nky8",
          "author": "DiscussionHealthy802",
          "text": "Love this post, and I completely agree that building and sharing something useful is a really good feeling. I had a very similar experience when I [open-sourced my tool, ship-safe](https://github.com/asamassekou10/ship-safe), which I originally just built to stop my own AI assistant from leaking database keys. I didn't expect much, but the community feedback has been incredibly rewarding. It really proves your point that credibility and trust are what matter most in the industry right now",
          "score": 1,
          "created_utc": "2026-02-23 23:53:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71qv7b",
          "author": "GlendonMcGladdery",
          "text": "Dear OP, \n\nThank you for speaking your mind and you are not in the minority. https://keepandroidopen.org/",
          "score": 1,
          "created_utc": "2026-02-24 00:11:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xo0ao",
          "author": "itz-ud",
          "text": "Hey,\n\nI'm working on a project.\n\nCheck this out: [https://github.com/udaykumar-dhokia/gitbot](https://github.com/udaykumar-dhokia/gitbot)\n\nGItBot: A Lightweight Personal AI Assistant for Git & GitHub, that runs locally on your computer via CLI. and it is open-source as well.",
          "score": 1,
          "created_utc": "2026-02-23 11:26:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6zk02m",
              "author": "jsattler_",
              "text": "Thanks for sharing. What problem are you solving with you project?",
              "score": 1,
              "created_utc": "2026-02-23 17:43:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o731au0",
                  "author": "itz-ud",
                  "text": "Struggle with good commit messages, waste time writing PR descriptions and summarizing diffs & commits.",
                  "score": 1,
                  "created_utc": "2026-02-24 04:51:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rcoo45",
      "title": "I built an open source Google Analytics & reCAPTCHA alternative",
      "subreddit": "opensource",
      "url": "https://github.com/swetrix/swetrix",
      "author": "Sensiduct",
      "created_utc": "2026-02-23 17:59:38",
      "score": 69,
      "num_comments": 9,
      "upvote_ratio": 0.94,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rcoo45/i_built_an_open_source_google_analytics_recaptcha/",
      "domain": "github.com",
      "is_self": false,
      "comments": [
        {
          "id": "o6zuzx2",
          "author": "ssddanbrown",
          "text": "Nice project! A few things I noticed in regard to open source and marketing, assuming I have not misunderstood the cloud-feature segmentation:\n\n- The AGPLv3 labelled repo has [this COPYING file](https://github.com/Swetrix/swetrix/blob/4571d9b193f065fef2debade3666510785b095c0/backend/apps/cloud/COPYING.txt) contained within, without reference to it in the readme or top-level LICENCE file. Its existence is unclear unless you dive into the code, and its application is unclear since it says it applies to \"This repository\", not a specific part or folder etc...\n- Your [readme lists](https://github.com/Swetrix/swetrix/blob/4571d9b193f065fef2debade3666510785b095c0/README.md?plain=1#L57-L61) cloud features. While they are tagged with cloud, it might be a tad misleading since they are not provided under the license advertised for the repo, nor are they open source which the project is introduced as in the readme intro.\n- On your homepage, the hero contains \"Open-source\" right next to a view/iframe/demo to an instance which features the non-open-source elements.\n- Again on the homepage, there's the wording \"Fully open-source and auditable. Self-host on your own infrastructure or use our cloud.\" which could be misleading since the core is open source, the project and what's being advertised is not fully open source.\n- On your comparison pages, for example [this one with Unami](https://swetrix.com/comparison/umami), \"Open Source\" is checked in the checklist without any qualifier, with all the non-open-source features also listed as checked.\n\nAgain, apologies if I've misunderstood anything.",
          "score": 11,
          "created_utc": "2026-02-23 18:34:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7065zw",
              "author": "Sensiduct",
              "text": "Hi, thanks that's some good feedback! I'll update the README to clarify these points!\n\nI've added this COPYING file because there was an instance of a company indending to resell / compete with us using our own code and it's not something I wanted to tolerate at that time. I know Plausible had similar issues in past so they made the same decision (I actually found out about this COPYING file / dual licensing from them)\n\nThe community edition (core product, with analytics & captcha) is open source and has most of the features cloud edition offers, except the billing module and some niche features like Alerts (yet). But yes you're right it would be correct to mention that the cloud version is source-available, not open source",
              "score": 4,
              "created_utc": "2026-02-23 19:25:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o70ftfc",
          "author": "sai-kiran",
          "text": "Congrats on the launch, but Why is everyone building self-hosted analytics these days? Is it the new Todo list project for people?\nI swear I see a new one pop up every month.",
          "score": 2,
          "created_utc": "2026-02-23 20:10:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o70hnmp",
              "author": "Sensiduct",
              "text": "thank you:) I've launched Swetix in 2021 originally, and even back then there were a ton of analytics startups launching quite often. The thing is this space is extremely crowded, and it's hard to differentiate against big OSS projects like Plausible, so most founders just give up and switch to something else\n\nAlso Marc Louvion (a famous indihacker on Twitter) launched his DataFast product too, and it triggered a wave of people trying to replicate his success and launch their analytics projects too, hahaha",
              "score": 2,
              "created_utc": "2026-02-23 20:19:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o71uytq",
          "author": "BP041",
          "text": "5 years on one project is serious commitment -- respect. and the problem is real; most GA 'alternatives' either have the same privacy issues under a different name or they're so stripped down you lose half the workflow.\n\nthe bundled reCAPTCHA replacement is a bold call, haven't seen many projects tackle both in one. curious how the bot detection actually works under the hood -- is it behavioral analysis without fingerprinting, or something else? asking because most CAPTCHA-free approaches eventually fall back on some form of device fingerprinting which kind of defeats the point.\n\nadding to my self-hosted stack anyway. the cookieless angle matters a lot for EU compliance without banner hell.",
          "score": 1,
          "created_utc": "2026-02-24 00:34:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7548zq",
          "author": "BP041",
          "text": "The CAPTCHA alternative is the more interesting piece to me. Standard CAPTCHA UX is genuinely hostile and Turnstile proved there's real appetite for something better.\n\nCurious how you handle sudden traffic spikes -- reCAPTCHA silently adjusts its risk thresholds based on volume signals. Does Swetrix's version do anything adaptive or is it purely behavior-based static scoring?\n\nAnd tbh the cookieless angle gets undersold. There's a real difference between \"we have a consent banner\" and \"we genuinely don't fingerprint\" -- users who know the difference convert differently. Privacy as a feature is real, not just compliance theater.",
          "score": 1,
          "created_utc": "2026-02-24 14:34:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o790l0b",
              "author": "Sensiduct",
              "text": "Swetrix CAPTCHA is different from Turnstile, because instead of fingerprinting we use proof-of-work (similar mechanism to bitcoin mining, but on a tiny-tiny scale; fast enough for a single user, cumbersome enough for large scale bots)\n\nIt's not 100% bot-proof, but enough for some protection. I'm definitely going to improve it in future and will look into ways to make some behaviour analysis in an optional, privacy-friendly way as well!",
              "score": 1,
              "created_utc": "2026-02-25 01:49:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1reildc",
      "title": "What are some open source tools/projects that genuinely improved your workflow?",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1reildc/what_are_some_open_source_toolsprojects_that/",
      "author": "Any-Main-3866",
      "created_utc": "2026-02-25 16:50:57",
      "score": 55,
      "num_comments": 42,
      "upvote_ratio": 0.95,
      "text": "Hey everyone,\n\nWhat are some open source projects, tools, or setups that have genuinely helped you work more efficiently?\n\nWould love to hear what you’re using and how it fits into your workflow.\n\nThanks!",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1reildc/what_are_some_open_source_toolsprojects_that/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7ctycy",
          "author": "petdance",
          "text": "‘ack’ has been invaluable since I wrote it 20 years ago. No more grep for source code. \n\nhttps://beyondgrep.com",
          "score": 33,
          "created_utc": "2026-02-25 17:01:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ihgcf",
              "author": "fluidtoons",
              "text": "Thank you for ack!",
              "score": 5,
              "created_utc": "2026-02-26 13:46:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7ihxph",
                  "author": "petdance",
                  "text": "You’re welcome. I’m glad it’s helped you.",
                  "score": 4,
                  "created_utc": "2026-02-26 13:49:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7h4hmw",
              "author": "max123246",
              "text": "Their website is completely broken on brave for some reason. Works fine on edge\n\nEdit: Oh looks like most of its features are also implemented in ripgrep so I'll probably just stick with that",
              "score": 3,
              "created_utc": "2026-02-26 07:06:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7khnvj",
                  "author": "petdance",
                  "text": "There are a few use cases where ack is preferable but for most folks ripgrep will do just fine.",
                  "score": 2,
                  "created_utc": "2026-02-26 19:29:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7d8mk1",
          "author": "Maskdask",
          "text": "Neovim",
          "score": 14,
          "created_utc": "2026-02-25 18:08:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gn05u",
          "author": "Steampunkery",
          "text": "Tools that I use daily and couldn't live without:\n\n* Neovim (or really any good terminal editor)\n* Tmux\n* Git \n* Ripgrep\n* Clangd\n* Htop",
          "score": 13,
          "created_utc": "2026-02-26 04:48:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7g4kvb",
          "author": "josephjnk",
          "text": "Ripgrep. I usually do searches inside my IDE but there are times when it’s hard to answer a specific question from an editor search (like “how many places are we using lodash on the backend?”) and ripgrep makes it really fast to check.",
          "score": 8,
          "created_utc": "2026-02-26 02:52:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d60gn",
          "author": "DiscussionHealthy802",
          "text": "An open source CLI that scans for leaked secrets, OWASP vulnerabilities, and CVEs, then auto-fixes them https://github.com/asamassekou10/ship-safe",
          "score": 5,
          "created_utc": "2026-02-25 17:56:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7falg4",
          "author": "i_am_tct",
          "text": "screen.\n\noften have one or more sessions running on remote boxes, I reconnect and I'm right where I left off",
          "score": 4,
          "created_utc": "2026-02-26 00:04:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7fea40",
              "author": "FancyPotato6890",
              "text": "any reasons why u use screen over tmux?",
              "score": 3,
              "created_utc": "2026-02-26 00:24:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7lw7xx",
                  "author": "i_am_tct",
                  "text": "i started using it a while ago, does everything i need it to do, and it's part of GNU so it'll be avaliable across distros (and OSs) without concern\n\n ",
                  "score": 1,
                  "created_utc": "2026-02-26 23:39:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7cx3ur",
          "author": "ElaborateCantaloupe",
          "text": "I’ve been in QA for over 25 years and tried many test management tools. They all suck in some way so I built my own and it does exactly what I want!\n\nhttps://github.com/TestPlanIt/testplanit",
          "score": 7,
          "created_utc": "2026-02-25 17:16:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7enzkt",
          "author": "Bach4Ants",
          "text": "Git!",
          "score": 4,
          "created_utc": "2026-02-25 22:05:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dc2ol",
          "author": "petdance",
          "text": "I have a website of alternatives to standard CLI tools at https://altbox.dev.  The site is showing its age but I hope it can start some folks down a road.",
          "score": 2,
          "created_utc": "2026-02-25 18:23:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7dcahh",
              "author": "petdance",
              "text": "Shoot it doesn’t render right on my phone. Desktop only, folks!\n\n(Patches welcome if you can pitch in)",
              "score": 2,
              "created_utc": "2026-02-25 18:24:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hquhs",
          "author": "SilvernClaws",
          "text": "Git: version control\n\nZig: programming language\n\nCodeberg: git repository host\n\nVS Codium: VS Code without the clutter and spyware",
          "score": 2,
          "created_utc": "2026-02-26 10:37:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hrgiv",
          "author": "kvyb",
          "text": "I’ve been working on a project called [OpenTulpa](https://github.com/kvyb/opentulpa) because I was tired of manually writing glue code for every small automation I needed, and keeping track of it all.\n\nIt’s essentially a personal AI agent you run on your own server that builds its own tools. Instead of me setting up a dev environment to write a script for a Slack digest or an API bridge, I just describe the workflow in chat or ask it to make a headless n8n flow. It writes the Python code, schedules the job, and saves it as a \"skill\" it can reuse later.",
          "score": 2,
          "created_utc": "2026-02-26 10:42:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7j4y76",
          "author": "billFoldDog",
          "text": "imagepipe is an android app that strips exif data and optimizes jpegs. It uses a sharing workflow that is great.\n\n\nIf I want to share an image on discord, I can:\n\n\ngallery, share inage to imagepipe, the share dialog immediately reopens, share to discord.\n\n\nThis shares a sanitized version of the image to discord.",
          "score": 2,
          "created_utc": "2026-02-26 15:45:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ds9mz",
          "author": "stan_frbd",
          "text": "Many things on https://awesome-selfhosted.net/\n\nMy own project Cyberbro if you're into OSINT / cyber security stuff.",
          "score": 3,
          "created_utc": "2026-02-25 19:37:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7debhf",
          "author": "Nordthx",
          "text": "VS Code. Replaced all other IDEs that I used before",
          "score": 1,
          "created_utc": "2026-02-25 18:33:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7dh5ph",
              "author": "Upstairs-Attitude610",
              "text": "Visual Studio Code is proprietary software released under the \"Microsoft Software License\",[7] but based on the MIT licensed program named \"Visual Studio Code – Open Source\" (also known as \"Code – OSS\"), also created by Microsoft and available through GitHub.[13]",
              "score": 14,
              "created_utc": "2026-02-25 18:46:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7drr2q",
                  "author": "Nordthx",
                  "text": "Thanks for the clarification, but it really did have a significant impact.",
                  "score": 3,
                  "created_utc": "2026-02-25 19:35:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7dldlh",
          "author": "Eagle_Nebula7",
          "text": "\\[Tomat\\](https://github.com/jolars/tomat) has been the best linux pomodoro tool that I've encountered, mostly because of its client-server approach and the fact that it was so easy to set up and put in my status bar",
          "score": 1,
          "created_utc": "2026-02-25 19:05:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7esx6c",
          "author": "SwordfishParking1182",
          "text": "Release-it",
          "score": 1,
          "created_utc": "2026-02-25 22:29:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l5as7",
          "author": "Simply_Jordan_",
          "text": "Obsidian for notes, Neovim for fast editing, Bitwarden for passwords, and uBlock on Firefox to kill distractions. Nothing fancy, just tools that reduce friction and stay out of the way.",
          "score": 1,
          "created_utc": "2026-02-26 21:22:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p8ucd",
          "author": "AndrewsVibes",
          "text": "* Zenzap → Clean team communication and follow-ups without Slack-style chaos\n* Obsidian (open ecosystem) → Local-first notes and knowledge base without lock-in\n* Gitea → Lightweight self-hosted Git server\n* AppFlowy → Open source Notion style workspace\n* Metabase → Self-hosted analytics dashboards",
          "score": 1,
          "created_utc": "2026-02-27 13:54:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pc3pb",
          "author": "x8code",
          "text": "vLLM ",
          "score": 1,
          "created_utc": "2026-02-27 14:12:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7u9es9",
          "author": "gbrennon",
          "text": "Ripgrep for sure. \n\nAlso screen or tmux, docker or podman, flatpak and vi",
          "score": 1,
          "created_utc": "2026-02-28 06:45:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cyt7r",
          "author": "lisaluvr",
          "text": "Commenting to follow the thread! I’m curious too",
          "score": 0,
          "created_utc": "2026-02-25 17:24:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7dbsxk",
              "author": "petdance",
              "text": "You can follow the post by going to the context menu and picking “Follow Post”. No reply needed.",
              "score": 9,
              "created_utc": "2026-02-25 18:22:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7h8sou",
                  "author": "lisaluvr",
                  "text": "Thank you so much, I genuinely didn’t know that 🥲",
                  "score": 2,
                  "created_utc": "2026-02-26 07:44:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1redck9",
      "title": "Switched FOSS license from AGPL 3.0 to Apache 2.0, trying to find out how much of an influence a license has on adoption",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1redck9/switched_foss_license_from_agpl_30_to_apache_20/",
      "author": "chimbori",
      "created_utc": "2026-02-25 13:34:16",
      "score": 52,
      "num_comments": 20,
      "upvote_ratio": 0.91,
      "text": "Most of my previous projects have also been licensed as Apache 2.0, and gained sufficient popularity & usage ([a Chrome extension](https://github.com/chimbori/google-calendar-crx), a [Kotlin library](https://github.com/chimbori/crux), and a [few others](https://github.com/chimbori)).\n\nFor my [latest project](https://butterfly.chimbori.dev/), I started with AGPL 3.0, with the intention that personal usage & smaller companies (i.e. those without Legal departments that would advise them against AGPL 3.0) would be able to use it for free in perpetuity, but larger companies would be good candidates for a paid proprietary license.\n\nA few weeks in, I’ve reversed that stance. For smaller projects like this one, it probably makes more sense to make it all Apache 2.0 (or MIT or BSD), since that opens the doors wide open to whoever wants to use it.\n\nWe’ve heard (negatively) of a lot of projects that started off as Apache 2.0, and then ended up becoming proprietary. \n\nWondering if folks have experiences to share about starting off with a viral GPL-ish license, and then opening it up subsequently, and how that impacted adoption.\n\n(If you’re curious about the specific project, it’s a self-hosted tool to automatically generate OpenGraph images from templates. Think of it as the open-source version of SaaS tools like Bannerbear, RenderForm, and others).",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1redck9/switched_foss_license_from_agpl_30_to_apache_20/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7bsvs3",
          "author": "taylorwilsdon",
          "text": "I usually get downvoted for saying this lol but I’ll give you one perspective, simply my own. It really boils down to what you’re making. If it’s a chrome extension, nobody is going to think twice about license type. If it’s a dev tool or library aimed at software engineers who may work at a large company, it likely will hamper, but not entirely prevent, adoption. \n\nI can only speak for my own professional experience but I have spent the past 15 years in software engineering at enterprise scale tech companies and we cannot use anything with an agpl license and that’s a hard stop, so I generally will avoid anything with one because I know I can’t use it where I do much of my development work. Some companies do not operate the same way but anything big enough to have a dedicated legal department and internal package repository management is likely to.",
          "score": 29,
          "created_utc": "2026-02-25 14:04:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bwk99",
              "author": "chimbori",
              "text": "> enterprise scale tech companies and we cannot use anything with an agpl license and that’s a hard stop, so I generally will avoid anything with one\n\nThat's exactly the conclusion I came to.\n\nThe philosophy behind AGPL may be noble, but in practice, Apache/MIT/BSD are the winners.",
              "score": 3,
              "created_utc": "2026-02-25 14:24:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7c9bcu",
                  "author": "randomperson_a1",
                  "text": "> winners\n\nWhat kind of winning are we talking about? Is a thriving open source community not a win?",
                  "score": 18,
                  "created_utc": "2026-02-25 15:27:25",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7ckwnq",
                  "author": "Silly-Freak",
                  "text": "I agree with the first, but not second order conclusion. AGPL is about keeping a system open. In my opinion it is a good option _precisely_ for software where there is incentive to get a competitive advantage by taking it closed. The advantage a commercial player should get from AGPL software is from _adopting_ it, not from keeping improvements for themselves. \n\nThat legal departments are afraid of AGPL is a shame. I don't fully buy that this fear is well-founded; the whole IP system is way too pro business for a good faith user of AGPL software to lose in court. If their reasoning is not that AGPL is risky but that they'd have to publish their code, then that's just the license working as intended, I don't see that as losing. \n\n(also, doesn't this fear mostly also apply to GPL software? I'm not in deep enough to tell myself, but if so: that everyone still uses Linux kinda demonstrates that it's not legal uncertainty that hinders adoption of GPL software)",
                  "score": 8,
                  "created_utc": "2026-02-25 16:20:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7ipus3",
              "author": "tilsgee",
              "text": "> enterprise scale tech companies and we cannot use anything with an agpl license and that’s a hard stop\n\n\nmay i ask why?",
              "score": 0,
              "created_utc": "2026-02-26 14:31:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7jazb9",
                  "author": "taylorwilsdon",
                  "text": "AGPL triggers even when the code is never distributed. Running it on an internal or external server and allowing users to interact with it can force source release, and anything an enterprise scale company does is network accessible. The most liberal legal interpretation of the affero network clause essentially means that it cannot be integrated with or embedded into any existing internal systems without releasing the source code to everything. Whether or not indirect linkage qualifies afaik has never been tested in court and nobody wants to be the trial balloon. Every faang company explicitly blocks anything agpl3 (as does my employer)\n\nCorporations block AGPL‑3 not because of ideology but because of legal uncertainty and the risk of involuntary source disclosure. I maintain or contribute heavily to 200k stars worth of github projects so I’ve had these discussions on both sides of the table many times. If you run an oss project it’s worth reading up on what happened with AWS and mongodb and the background to why gitlab abandoned it. Agpl doesn’t protect people as much as they think, and prevents adoption.",
                  "score": 1,
                  "created_utc": "2026-02-26 16:12:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7c8j39",
          "author": "QualitySoftwareGuy",
          "text": "Generally speaking, less restrictive licenses like MIT and Apache 2.0 will always have more adoption than GPL or AGPL. \n\nWhat I can recommend for you is to decide which of your goals has a higher priority for your project. For example, is it to increase adoption rate? If so, Apache 2.0 or MIT. Or is it to be more restrictive and prevent closed/proprietary SaaS? If so, then AGPL. This is a self-hosted application project, rather than a library, so it's not uncommon to see AGPL licenses for this type of project.\n\nIn my opinion, AGPL being a blocker is usually limited to big companies. Most individuals (for personal use) will not care about it being AGPL. Some small companies might, but I don't believe the majority of them would care.\n\nTL;DR: Let the greatest priority determine the license. Adoption rate = Apache or MIT. Prevent proprietary SaaS = AGPL.",
          "score": 9,
          "created_utc": "2026-02-25 15:23:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dpv45",
          "author": "Userwerd",
          "text": "I always check the lisence, I will USE apache, mit, bsd projects, but I will SUPPORT gpl projects.\n\n",
          "score": 3,
          "created_utc": "2026-02-25 19:26:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7crzg6",
          "author": "PurpleYoshiEgg",
          "text": "I'd rather start off with AGPL and relax it later than use MIT and figure out that I wanted to actually close it, but it's too late, because a company decided they were going to coopt my project.\n\nI haven't seen a reason to switch from AGPL yet, and so I'm keeping it.",
          "score": 2,
          "created_utc": "2026-02-25 16:52:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7c9ib3",
          "author": "Arcuru",
          "text": "Welcome to the wonderful world of trying to pick a license that allows for some path to monetization but ALSO doesn't bring out the pitchforks for being 'not OSS'.\n\nPersonally I think something like https://fsl.software should be used more often for SaaS tools, that might be a good fit for you.\n\nFor my latest project I'm leaning towards AGPL+CLA (with a covenant to allow me to relicense to any other OSI-approved OSS license). A little confusing but at least it is ideologically sound. https://jackson.dev/post/oss-licensing-sucks/",
          "score": 3,
          "created_utc": "2026-02-25 15:28:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7crelx",
          "author": "ivosaurus",
          "text": "> We’ve heard (negatively) of a lot of projects that started off as Apache 2.0, and then ended up becoming proprietary. \n\nAs long as you hold copyright on the code, there is NO DIFFERENCE between this and someone taking an AGPL codebase proprietary in exactly the same way. Zilch. Nada. Copyright ownership means you can re-license either at will.\n\nOf course it doesn't stop people using previous versions of the code with previous licenses, although again license type has no function on this caveat either.\n\nIn fact there's a famous case of **exactly** the opposite: Started off as Apache 2.0, then went to AGPL v3, then went proprietary; [MinIO](https://en.wikipedia.org/wiki/MinIO).\n\nThe also icky fact is common wisdom would be that if you were accepting many pull requests into a codebase without copyright-transfer / grant (usually in the form of CLAs), it should be nearly impossible to re-license that codebase anyway. At least, without getting a written approval from all / most prior contributors. But a lot of companies and projects have basically ignored this wisdom on copyright (if someone gave you XX licensed code, under their copyright, you can't just re-license it yourself, as you're no longer the copyright holder) and re-licensed their projects anyway. Of course there's no way to actually \"test\" on \"who's legal theory is correct\" without some project or another that's done this actually getting taken into a court of law to rule on legalities, but given a lot of these things are free in nature, to my knowledge that's never actually happened yet",
          "score": 3,
          "created_utc": "2026-02-25 16:50:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rffhog",
      "title": "Open Source Endowment - funding for FOSS launch",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rffhog/open_source_endowment_funding_for_foss_launch/",
      "author": "ShaneCurcuru",
      "created_utc": "2026-02-26 16:54:04",
      "score": 39,
      "num_comments": 15,
      "upvote_ratio": 0.94,
      "text": "The OSE launches today, working on one of the biggest issues with #OpenSource #Sustainability around: **funding**, especially for under-visible projects or independent communities or developers maintaining all those critical little bits *everyone* uses *somewhere*.  Check it out; highly worth reading about if you follow the larger open source world. \n\n\\----\n\nToday we're launching the [**Open Source Endowment**](https://endowment.dev/) (OSE), the world's first endowment fund dedicated to sustainably funding critical open source software. It has $750K+ in committed capital from 60+ founding donors, including founders and executives of HashiCorp, Elastic, ClickHouse, Supabase, Sentry, n8n, NGINX, Vue.js, cURL, Pydantic, Gatsby, and Zerodha.\n\nOSE is a US 501(c)(3) public charity. All donations are invested in a low-risk portfolio, and only the annual investment returns are used for OSS grants. Every dollar keeps working, year after year, in perpetuity.\n\nOur endowment is governed by its donor community, and the core team includes board members Konstantin Vinogradov(founding chairman), Chad Whitacre, and Maxim Konovalov; executive director Jonathan Starr; and advisors Amy Parker, CFRE and Vlad-Stefan Harbuz.\n\nEveryone is welcome to donate (US contributions are tax-deductible). Those giving $1,000+ become OSE Members with real governance rights: a vote on how funds are distributed, input on strategy, and the ability to elect future board directors as the organization grows.\n\nNone of this would be possible without our founding members, to whom we are grateful: Mitchell Hashimoto, Shay Banon, Jan Oberhauser, Daniel Stenberg, Kailash Nadh, Thomas Dohmke, Alexey Milovidov, Yuxi You, Tracy Hinds, Sam Bhagwat, Chris Aniszczyk, Paul Copplestone, and many more below.\n\nOpen source runs the modern world. It's time we built something to sustain it. Donate, become a member, and help govern how funds reach the projects we all depend on. \n\n\\----\n\nDisclaimer: I am one of the original donors as well, and am a Member of their nonprofit.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1rffhog/open_source_endowment_funding_for_foss_launch/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7jrc29",
          "author": "ssddanbrown",
          "text": "Interesting approach, I hope it works out!\n\nLooking at some of the most prominent organisers of this, it does make me a little wary, as I'm seeing names (and grant from company names) which have previously misrepresented or advocated for using \"open source\" outside [the OSD](https://opensource.org/osd), but hopefully that's in the past.\n\nEdit: I noticed the funding nomination form specifically asks for a GitHub repo URL, which seems a little odd and limiting.",
          "score": 6,
          "created_utc": "2026-02-26 17:27:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k05ud",
              "author": "whit537",
              "text": "Hi, Dan! 👋 Here's our [ticket re: GH URLs](https://github.com/osendowment/endowment.dev/issues/34).",
              "score": 2,
              "created_utc": "2026-02-26 18:08:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7k25tf",
                  "author": "ssddanbrown",
                  "text": "Nice! \n\nDoes any part of the project set a definition for what is considered open source in regard to this funding? I think I've also seen \"free and open source\" and \"FOSS\" used on the site. I know that you've previously had beyond-OSD views on that, and I've also [called out Konstantin](https://nitter.net/vinogradovk/status/1620888050447581185) on this before. Would be good to reinforce (maybe in the FAQ) what is considered open source in this context, especially for those handing over money to this.",
                  "score": 2,
                  "created_utc": "2026-02-26 18:17:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7lkxbw",
              "author": "ivosaurus",
              "text": "Hi, also a reminder that no single private group has any normative control over what the definition for \"open source\" means, or *any* gate keeping control over who gets to use it. And IMHO, people should be especially wary of any such group claiming to do so for themselves. I think the public FOSS community at large has enough intelligence to determine when something like the BSL isn't quite in their spirit.",
              "score": 0,
              "created_utc": "2026-02-26 22:38:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7m6f8s",
          "author": "BP041",
          "text": "the endowment model is interesting specifically because it separates \"will this project exist next year\" from \"is someone actively maintaining it this week.\" traditional grants have to solve both at once, which is why they often go to projects visible enough to attract attention but not necessarily the critical-but-obscure stuff.\n\ndaniel stenberg being in the founding members list is kind of perfect. curl is exactly the type of project this is built for -- everyone depends on it, nobody thinks about funding it.\n\ncurious how the governance piece works in practice. deciding which projects get the grants is historically where OSS funding falls apart. is that TBD or do they have a framework?",
          "score": 2,
          "created_utc": "2026-02-27 00:35:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qg2dj",
              "author": "ShaneCurcuru",
              "text": "The FAQ and Model are still being built, but there's plenty of basics that point to ethos the endowment is being built from.  And yes - it is explicitly an endowment, with the goal to be a long-term funding source built from an independent viewpoint (i.e. not a government and not corporate influence).\n\n[https://endowment.dev/faq/#investments](https://endowment.dev/faq/#investments)  \n[https://github.com/osendowment/model](https://github.com/osendowment/model)\n\nThat being said, this is just launched, so it's a work in progress being driven by folks who participate.\n\n ",
              "score": 1,
              "created_utc": "2026-02-27 17:27:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7mpns6",
          "author": "uniVocity",
          "text": "May I suggest you guys think about providing supporting infrastructure and standards to help open source developers obtain funding from their commercial users (that they don't even know they have)?\n\nExamples of standards that I believe most open source projects would benefit from if everyone adopted them\n\n1. latest version is free, patches in previous versions are not. Pay the developer to patch older versions or to receive patched builds. Rationale: Companies tend to lock in a specific version and only patch that as needed for stability - they are more likely to agree to pay for support\n\n2. Bug reports and feature requests are guaranteed to NOT be answered to until 30 days since the ticket was created have elapsed. Rationale: companies that need support and faster turnaround will be more willing to pay to get their issues addressed. \n\nExamples of infrastructure support:\n\n1. Provide a centralised and standardised repository for open source developers to submit their builds. Make latest major versions available for free. Patched builds only available for paying users. You guys can manage the entire “customer workflow” for all projects, offering a standard and familiar experience for the paying users of all open source projects you host. Take a cut to help keep the operation going, process payments, etc then pay the project owners.\n\n2. Provide centralised issue tracking, documentation and other project management services so that all open source developers have a standard mechanism to communicate with paying and non paying users. \n\n\nThe biggest pain point for me as an open-source developer is that I want to work on my projects and waste the least amount of time possible building and managing another large puzzle involving infrastructure to MAYBE get a donation or paying user. \n\nCurrently github and other platforms don’t really have much of anything to support open source developers to manage their potential customers/payments/etc so each project has to somehow address this and build their own additional infrastructure \n\nAs if the project in itself wasn’t work enough, there’s website, repository, cloud services, servers, communications, private issue tracker, private repository for specific clients and customized builds, payment gateways, license servers, legal agreements etc etc to take care of if you really want to live off of open source.\n\nThat’s a lot of additional effort on top of maintaining an open source project on the spare time. We need help to be allowed to focus exclusively on what we are building.",
          "score": 2,
          "created_utc": "2026-02-27 02:26:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l9orm",
          "author": "HonestRepairSTL",
          "text": "I don't have $1000 but being able to provide feedback as to how funds are distributed sounds like a very rewarding task.\n\nI own a phone and computer repair shop called Honest Repair that has a focus on digital privacy, right to repair, right to own, and I sort of educate people on these topics. Naturally I recommend FOSS alternatives to pretty much anything I can that a customer needs for a plethora of reasons and I am fairly involved in the open source community despite not knowing anything about app development.\n\nAnyways, just wanted to throw it out there if you'd like my feedback any time. I've been studying privacy and open source for the last 6 or 7 years now and now I help people achieve their privacy goals professionally.",
          "score": 1,
          "created_utc": "2026-02-26 21:43:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lba20",
              "author": "bonareader",
              "text": "We don't require $1000 to provide feedback, and welcome everybody in our [repo](https://github.com/osendowment/foundation). Meanwhile, we weigh feedback based on how much \"skin in the game\" a person has, prioritizing opinions of (1) members, (2) other donors, (3) everybody else. As an entrepreneur, I believe you understand this approach.",
              "score": 1,
              "created_utc": "2026-02-26 21:50:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7myaha",
          "author": "BrycensRanch",
          "text": "I’m happy to see more companies getting together to fund open source. Please make sure SignPath gets some love for providing free code signing certificates to open source projects",
          "score": 1,
          "created_utc": "2026-02-27 03:16:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7um1m8",
          "author": "Alarming_Bluebird648",
          "text": "An endowment model is a logical way to stabilize projects that lack the marketing reach of major foundations. I'm interested to see how they verify the 'criticality' of under-visible projects to ensure the funds reach the deep-stack maintainers who are often overlooked.",
          "score": 1,
          "created_utc": "2026-02-28 08:39:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfwj5i",
      "title": "The age where opensource/platforms is here.",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rfwj5i/the_age_where_opensourceplatforms_is_here/",
      "author": "tonefart",
      "created_utc": "2026-02-27 04:11:48",
      "score": 38,
      "num_comments": 18,
      "upvote_ratio": 0.89,
      "text": "The world is locking down their OS/eco-system via age-gate keeping and mandatory government IDs in order for you to use any of the mainstream OS and devices, android, ios, etc.\n\nNow is the time for open platform/os to be pushed heavily to fight back heavy handed government and corporation collusion and control.\n\nThere is never a better time than now to aggressively push Linux, open web, open mobile devices to fight back government tyranny and overreach.\n\nIf there's no effort made to fight back, I guarantee you they will come for OPEN SOURCE and ban it for not complying with government ID mandates which completely violates OSS foundational values.\n\nAll OSS advocates must come up with the plan now to push for this in anticipation of global tech tyranny and lockdown of the industry/eco-system.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1rfwj5i/the_age_where_opensourceplatforms_is_here/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7n8tb9",
          "author": "veganmaister",
          "text": "Love the spirit but unfortunately normies don’t care.\n\nI just mentioned deleting WhatsApp on the degoogle subreddit and was met with a visceral reaction.\n\nThe best advice I can offer is to be the change you wish to see in the world.",
          "score": 23,
          "created_utc": "2026-02-27 04:23:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7n96bf",
              "author": "tonefart",
              "text": "It's not like OSS users/developers have a choice. If we don't do anything about this now, they will force OSS developers to comply as well and ban all those that don't.",
              "score": 3,
              "created_utc": "2026-02-27 04:25:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7naqrn",
                  "author": "veganmaister",
                  "text": "If they clamp down on FOSS itself, software will be the least of our worries.",
                  "score": 4,
                  "created_utc": "2026-02-27 04:36:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7nb2y8",
          "author": "The-Titan-M",
          "text": "Lock-in is real tbh. Once all your stuff is in one ecosystem, you’re kinda stuck.",
          "score": 3,
          "created_utc": "2026-02-27 04:38:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nbeln",
              "author": "veganmaister",
              "text": "Not really, it’s psychological lock-in not practical.",
              "score": 6,
              "created_utc": "2026-02-27 04:40:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7nbwpn",
                  "author": "The-Titan-M",
                  "text": "I don’t think it’s just psychological. Once all your data and apps are tied in, switching isn’t exactly frictionless.",
                  "score": 2,
                  "created_utc": "2026-02-27 04:44:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7o4ebu",
          "author": "hopeseekr",
          "text": "Hi, you sound like someone who was born after 9/11/2001, am I right?\n\nWe already lost all these wars. The Snowden Revelations were the fundamental make or break moment, and we broke. Now we're in a faster acceleration of the totalitarism curve and they're making a play to remove our freedom-promoting , open source, and/or encrypted systems.\n\nThey already basically killed NNTP and IRC.\n\n===\n\nLLM is the enforcer.\n\nJust wait until the stuff being developed in China (LLM monitoring CCTV and every reddit / Twitter / Email / WhatsApp message, in conjunction with autonomous robot police and drones)  and you'll see the dark world of 2030 when 80% of us are unemployable.\n\n====\n\nP.S. I was the xMule founder / maintainer from 2003-2007. The US government isused a National Security Letter against me in August 2003 the same day that hostile people forked it very hostily and created aMule. Go look at aMule source code, you will see how they stripped my name and copyright from every single file on the first commit.\n\nClear violation of the GPL.\n\nThey did this because in 2003 I added (in secret) military-grade encryption to xMule'ws already IP-to-IP direct communication chat. It didn't have usernames, it had IPs. the idea being two or more people verify each others' ip addresses and then DCC + encryption == no middle man at all and tight opsec.\n\nThat's why I was visited in June 2003 by the Men In Black (DHS) and later extraodirinarily renditioned across the country in winter 2003... but that's another story.",
          "score": 1,
          "created_utc": "2026-02-27 08:38:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7o55vd",
              "author": "hopeseekr",
              "text": "You ever wonder why YouTube got the blessing of the MPAA and RIAA in 2006 while there were just two P2P devs in America not being sued / imprisoned (me and Bryan Cohen of BitTorrent)?\n\nIt was to make it so easy to get content that users stopped learning how to use truly free and distributed systems. Same reason they attacked cryptocurrencies.",
              "score": 1,
              "created_utc": "2026-02-27 08:46:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1re0oe2",
      "title": "I got tired of culling thousands of bird photos, so I built an open source App to do it.",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1re0oe2/i_got_tired_of_culling_thousands_of_bird_photos/",
      "author": "BaseballClear8592",
      "created_utc": "2026-02-25 02:24:26",
      "score": 25,
      "num_comments": 7,
      "upvote_ratio": 0.76,
      "text": "Hey r/opensource,\n\nI'm a bird photographer, and if you know anything about wildlife photography, you know it involves holding down the shutter and taking thousands of burst shots in a single day. Coming home and manually culling 5,000 photos to find that *one* perfectly sharp shot with the bird's eye visible is soul-crushing work.\n\nI couldn't find a tool that did exactly what I wanted. **Almost all the good AI cullers out there are subscription-based or charge per image (and they are expensive).** Worse, most of them are trained for weddings/portraits and fail terribly at bird photography. So, I decided to build my own and make it completely free and open-source for everyone.\n\nI recently released **SuperPicky**, a smart, local AI photo culling desktop app built explicitly for bird/wildlife photographers. It's completely offline and licensed under GPL-3.0.\n\n**How it works & Tech Stack:** Instead of just using a generic aesthetics model, I built a pipeline that combines a few different models to mimic how a photographer actually reviews bird photos:\n\n* **YOLO11**: For precise bird object detection and segmentation masks.\n* **SuperEyes (Custom)**: Detects if the bird's eye is visible and calculates head sharpness (because if the eye isn't sharp, the photo is usually trash).\n* **SuperFlier (Custom)**: Identifies bird-in-flight (BIF) poses and gives them bonus points.\n* **OSEA (Open Set Entity Annotation)**: Evaluates overall image aesthetics and composition, while also supporting multiple avian taxonomy standards (like AviList, eBird) for precise species identification.\n\n**What it actually does for the user:**\n\n1. You feed it a folder of photos.\n2. It processes everything completely offline (local inference).\n3. It rates photos from 0 to 3 stars based on sharpness and aesthetics (with adjustable thresholds based on your skill level—Beginner to Master).\n4. **The best part:** It writes these ratings directly into the RAW file EXIF metadata so everything syncs perfectly when you import the folder into Lightroom.\n\n**A 2-Year Journey of Pure \"Vibe Coding\"** I've actually been working on this project on and off for **2 years**. The craziest part? I barely wrote the core logic by hand. **The entire thing was built using \"vibe coding\" (mostly prompting Cursor and various AI models).**\n\nIt hasn't been a smooth ride, though. For version 2.0, my AI tools convinced me to rewrite the whole app natively in **Xcode using Swift and CoreML**. It was a complete disaster. CoreML's memory management completely fell apart when trying to load and coordinate multiple complex vision models simultaneously, and the project stalled for half a year.\n\nFor version 3.0, I learned my lesson and **went back to a Python + PySide6 architecture**. While packaging it into standalone executables (especially for Windows + CUDA) is still painful, it made inferring YOLO11 and custom PyTorch models infinitely easier and more stable.\n\n**Power of the Community & We're iterating fast (Come join us!)** We are just about to push **v4.1.0**, which migrates the temp data handling to SQLite to give it a \\~1.9x speedup. It supports both macOS (Apple Silicon native) and Windows (CUDA & CPU).\n\nI really have to shout out the open-source community—**several awesome contributors have already jumped in to help tweak the code and fix annoying bugs (like weird Sony ARW parsing issues). We are iterating extremely fast right now.** Watching this grow from my personal messy script into a fast-moving, community-supported tool has been amazing.\n\nBecause my codebase is largely stitched together via vibe coding, I would absolutely love it if some experienced Python developers, CV enthusiasts, or even photographers want to get involved and contribute (whether via PRs or submitting issues). Dealing with packaging native Python AI apps for desktop (especially cross-platform) has been a huge learning curve, and I'm sure my codebase could heavily use some roasting or refactoring suggestions!\n\nYou can check out the source code and the app here: [https://github.com/jamesphotography/SuperPicky](https://github.com/jamesphotography/SuperPicky)\n\nWould love to hear any thoughts, feedback, or any roasts of my codebase! Thanks for building such an awesome community.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1re0oe2/i_got_tired_of_culling_thousands_of_bird_photos/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7aelsl",
          "author": "boneskull",
          "text": "If I had thousands of bird pics, I’d totally give this a try.",
          "score": 4,
          "created_utc": "2026-02-25 07:30:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7aw4sx",
              "author": "BaseballClear8592",
              "text": "Haha, careful! That’s exactly how it starts. First one blurry bird photo, and then suddenly you have 10,000 and you're looking for software to save you! Thanks for the support anyway.",
              "score": 2,
              "created_utc": "2026-02-25 10:13:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7aoc8g",
          "author": "Rxke2",
          "text": "Wow, that's awesome! ",
          "score": 3,
          "created_utc": "2026-02-25 09:00:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7aw5sx",
              "author": "BaseballClear8592",
              "text": "Thanks mate",
              "score": 3,
              "created_utc": "2026-02-25 10:13:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ch77f",
          "author": "Amazing-Persona-101",
          "text": "Sounds pretty cool, congratulations. \n\nCould the basic architecture be generalized for use in other domains?",
          "score": 2,
          "created_utc": "2026-02-25 16:03:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gpl7m",
              "author": "BaseballClear8592",
              "text": "Thank you! And that's a great observation.\n\nTechnically, yes—the architecture is quite flexible. As long as there’s a robust pre-trained model for a specific domain (like plants, insects, or even vehicles), the same workflow could definitely be applied.\n\nFor now, I’m focusing on perfecting the experience for bird photographers since that’s my personal passion, but I’d love to see the community adapt the core logic for other uses in the future!",
              "score": 1,
              "created_utc": "2026-02-26 05:06:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rdru9x",
      "title": "An Open Source Minecraft Clone Made in Defold Engine with Lua",
      "subreddit": "opensource",
      "url": "https://youtu.be/64YWCuQgDLA?si=ng4pdglwRROZxtG9",
      "author": "cenkerc",
      "created_utc": "2026-02-24 20:34:19",
      "score": 20,
      "num_comments": 2,
      "upvote_ratio": 0.89,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/opensource/comments/1rdru9x/an_open_source_minecraft_clone_made_in_defold/",
      "domain": "youtu.be",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1reosmr",
      "title": "Cory Doctorow Argues Platform Lock-In Is a Competition Problem, Should Regulators Mandate Interoperability?",
      "subreddit": "opensource",
      "url": "https://hive.blog/tech/@revisesociology/on-big-tech-companies-and-control",
      "author": "davideownzall",
      "created_utc": "2026-02-25 20:26:07",
      "score": 19,
      "num_comments": 6,
      "upvote_ratio": 0.8,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1reosmr/cory_doctorow_argues_platform_lockin_is_a/",
      "domain": "hive.blog",
      "is_self": false,
      "comments": [
        {
          "id": "o7e5wrg",
          "author": "AshuraBaron",
          "text": "USE SPELL CHECK! The blog is just a mess. At least that shows it's written by a human I guess.\n\nTo the point though, I think this is how you build monopolies. You put so many regulatory requirements on a product that only the largest companies can afford to hit those targets. For the majority of multi platform software and products, I would put money on them starting out only supporting one or two platforms and building from that. I don't think pushing away from leveraging specific platform features is a good way to go about this. \n\nThe better route to me would be creating ways giants can be supplanted. Allowing new products and platforms to compete with the established normalcies on an even playing field. It's a complex process though and nothing something fits in a sound bite. ",
          "score": 6,
          "created_utc": "2026-02-25 20:41:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7flhc7",
              "author": "edgmnt_net",
              "text": "Yeah. I'll go further and say it's ironic to blame traditional competition when IP itself restricts competition to allow companies to sell stuff they make after the fact, *by creating and enforcing monopolies that would otherwise not exist and not be viable to implement contractually or through other reasonable means* (temporary or quasi-permanent as with copyrights). Also cheap money is fueling irrational growth and all this isn't really specific to software.\n\nRegulators should go home, they've had too much to drink already. No amount of patchwork is going to fix this, unless they actually intend to weaken IP thoroughly. Otherwise it's sort of a whack-a-mole that's disrupting things further (even, e.g., as you say by making it harder to comply).",
              "score": 1,
              "created_utc": "2026-02-26 01:03:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7fevsh",
          "author": "prodleni",
          "text": "Pairing Cory Doctorow with AI slop image is just..... Wow",
          "score": 3,
          "created_utc": "2026-02-26 00:27:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e6sr8",
          "author": "NotThatGuyAnother1",
          "text": "Fuck no.\n\n\nBrain dead, politicians fuck up technology every step they get their hands in it.\n\n\nIf you want only Google, Facebook, Amazon, then add more government regulations.  \n\n\nMoney will go from those companies to their lobbying firms, to the congress-critters and the consumer will pay for it all.  They'll shut out every small competitive company at every step.",
          "score": -9,
          "created_utc": "2026-02-25 20:45:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7f6i0i",
              "author": "Irverter",
              "text": "> If you want only Google, Facebook, Amazon\n\nLack of regulation is what allowed them to get there.",
              "score": 3,
              "created_utc": "2026-02-25 23:41:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7fnkz4",
                  "author": "edgmnt_net",
                  "text": "Even ignoring IP-based monopolies, consolidation of giant companies can be reasonably traced to artificial incentives for growth like cheap money coupled with artificial barriers like legal/compliance costs. This is way beyond mere economies of scale. \n\nAnd realistically we do have to consider IP here too, because it's a significant part of litigation and because it's the main enabling factor to develop stuff behind closed doors.\n\nWe've anything but a lack of regulation. Look at any of the more regulated fields and you'll see things are way worse, e.g. medicine.",
                  "score": 1,
                  "created_utc": "2026-02-26 01:15:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rbt0b5",
      "title": "Lightweight alternative to Sentry",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rbt0b5/lightweight_alternative_to_sentry/",
      "author": "imafirinmalazorr",
      "created_utc": "2026-02-22 18:13:31",
      "score": 18,
      "num_comments": 11,
      "upvote_ratio": 0.88,
      "text": "Hey everyone - I'd like to share a project that I've been working on. It's meant to be a lightweight, self-hosted alternative to Sentry. I was able to support my personal projects with about 2GB of RAM + 4 containers vs. Sentry's minimum of 16GB and 20+ containers.\n\nEverything in the repo is open-source under a AGPLv3 license, with an enterprise module that I merge in for the cloud stuff.\n\nThis is my first open-source project, so for the more experienced guys out there I'd love to hear your feedback!  \n\n\n[https://github.com/moneat-io/moneat](https://github.com/moneat-io/moneat)",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rbt0b5/lightweight_alternative_to_sentry/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o6tfsqv",
          "author": "nihal_was_here",
          "text": "From a fellow opensource contributor, nice project, will checkout...",
          "score": 5,
          "created_utc": "2026-02-22 18:40:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6th88y",
              "author": "imafirinmalazorr",
              "text": "Thank you! I really appreciate it.",
              "score": 1,
              "created_utc": "2026-02-22 18:46:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6tudf5",
          "author": "bullmeza",
          "text": "Very cool! Was it hard to setup the session replay feature?",
          "score": 1,
          "created_utc": "2026-02-22 19:50:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6txbeg",
              "author": "imafirinmalazorr",
              "text": "It wasn’t terrible but definitely one of the more difficult features. I don’t think I’m anywhere close to done though, I have a lot more on the todo list.",
              "score": 1,
              "created_utc": "2026-02-22 20:05:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6tznc3",
                  "author": "bullmeza",
                  "text": "Nice, I'd add the todo list to the repo :)",
                  "score": 1,
                  "created_utc": "2026-02-22 20:16:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6tvwzo",
          "author": "mizhgun",
          "text": "Any key differences from GlichTip?",
          "score": 1,
          "created_utc": "2026-02-22 19:58:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6twwvj",
              "author": "imafirinmalazorr",
              "text": "GlitchTip really only has issue and basic transaction support last I checked. No session replays.",
              "score": 1,
              "created_utc": "2026-02-22 20:03:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6u1qvc",
                  "author": "mizhgun",
                  "text": "Ah ok. Sorry I’ve missed that.",
                  "score": 1,
                  "created_utc": "2026-02-22 20:27:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rg6t6t",
      "title": "How can an open source OS be locked down?",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rg6t6t/how_can_an_open_source_os_be_locked_down/",
      "author": "bdhd656",
      "created_utc": "2026-02-27 13:33:41",
      "score": 16,
      "num_comments": 18,
      "upvote_ratio": 0.73,
      "text": "I’ve wanted to move to android for a while but since then I’ve seen Google locking down the OS, even tho people also say android whilst open, will probably die soon.\n\nI don’t understand why certain things like linux thrive but android (I know it’s technically linux) can’t thrive as well? Is it because phones can lock their bootloaders? Can’t a manufacturer just make a phone that can have that unlocked? And then forks like graphene or maybe a whole new linux OS work? Wine alternative but with phone?\n\nBasically my question is, why not just ignore google and move to something else? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1rg6t6t/how_can_an_open_source_os_be_locked_down/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7p7roq",
          "author": "Odd-Musician-6697",
          "text": "The android that is shipped to consumer devices is a heavily modfied fork of actual android. Even pixel devices.",
          "score": 33,
          "created_utc": "2026-02-27 13:48:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p926c",
          "author": "JadedCauliflower6105",
          "text": "Locked boot loader is the main problem. Basically stops you from being able to put anything other than the factory OS onto it. Manufacturers generally do not want you putting a different OS on your phone. Some phones don’t have this restriction, such as the Google Pixel, ironically enough.\n\nLinux Mobile is showing promise but just isn’t where it needs to be for it to actually compete. \n\nGraphene is probably the strongest alternative to straight up Android without switching to an iPhone. The main issue is finding a phone that actually lets you use it.\n\nThe Google Pixel, as mentioned before, lets you unlock the boot loader and can therefore run Graphene. These Pixel phones are probably ideal, though the devs of Graphene are planning to switch to supporting something else due to where Google is trying to go with everything. Nothing and CMF Phones, and some OnePlus devices, lets you unlock the boot loader and can technically run other OS’s like Graphene, though I’m not sure how well it runs.",
          "score": 13,
          "created_utc": "2026-02-27 13:55:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7sxbbn",
              "author": "edgmnt_net",
              "text": "At this point, let's face it, we kinda need some sort of open hardware. Open not just as in PC-open and maybe not necessarily as far as individual components, but we need open blueprints for what's essentially a highly-integrated assembly. That may end up requiring semi-open or at least durable/LTS components. And it might still be hard due to various regulations to make development cost-effective.",
              "score": 3,
              "created_utc": "2026-02-28 01:10:06",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7rrx9q",
              "author": "Kuki_CZ",
              "text": "LineageOS is, I believe, the standard option to turn to. I have it on my old/backup OnePlus 8T and runs great. It also has quite an extensive lineup of supported devices (even the Nintendo Switch). Also, many other custom ROMs are built upon LineageOS, e.g. crDroid.",
              "score": 1,
              "created_utc": "2026-02-27 21:20:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7s1hfj",
                  "author": "JadedCauliflower6105",
                  "text": "This is one I’ve never heard of before. I’m gonna have to look into that.",
                  "score": 1,
                  "created_utc": "2026-02-27 22:08:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7pd7xt",
          "author": "Budget_Putt8393",
          "text": "Case study:\n\nApps make or break the phone. Google owns the app store for Android. If you ignore Google, you lose their apps. Your phone is an expensive brick with lots of potential.\n\nWhen you play Google's game, you get \"base\" Android, and a bunch of closed source additions. Those additions are where Google would place the verifications, etc. Those verifications would become the new doorway to the app store.\n\nMore general:\n\nOther sites would be required to pull same verifications.\n\nTake away:\n\nYou are free to run a version without the verification layer, but you will lock yourself out of everything interesting. If you/friends are willing to build your own ecosystem then you are welcome to fly the one finger solute to restrictions.\n\nAs long as you stay a small insular group you will probably slip under their radar. You will also be lonely. \n\nIf you start getting big/popular, then the governments will apply pressure to force you to require the verifications.",
          "score": 5,
          "created_utc": "2026-02-27 14:18:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pk5c7",
              "author": "P1r4nha",
              "text": "What kind of case study?\n\nAnd are you arguing Google closes Android because of the government? You also ignore that there is already an open source community for Android using the FDroid store. Sure, it's smaller, but it's not tiny, uninteresting or lonely.\n\nAlso: r/degoogle proves on a daily basis that you can run Android on phones without the Google ecosystem. Both proprietary as well as free software runs just fine on these phones.",
              "score": 3,
              "created_utc": "2026-02-27 14:54:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7pld69",
                  "author": "Budget_Putt8393",
                  "text": "No, Google closes Android so they can force you into their money pit.\n\nBecause Google has closed Android (for money) they have lots to lose when the government starts handing out fines. \n\nBecause they have closed android, they have high likelihood of succeeding with implementing verification enforcement.\n\nI do run grapheneOS on my Pixel, so I'm aware. I also work in software development, and software/cyber security.",
                  "score": 2,
                  "created_utc": "2026-02-27 15:00:52",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7r4z37",
                  "author": "9acca9",
                  "text": "i try this week and almost kill my cellphone, was a brick for several days... some phone you can other dont.   \ni really want to avoid the google shit but is pretty difficult. ",
                  "score": 1,
                  "created_utc": "2026-02-27 19:25:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7qtpl9",
          "author": "cgoldberg",
          "text": "You can take the source code that's available and do almost anything you want with it. However, if you want to use an official image from some manufacturer on a device with a locked bootloader and use Google's services, they can impose restrictions on what you can do... that really has nothing to do with it being open source or not.",
          "score": 2,
          "created_utc": "2026-02-27 18:31:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7s5ght",
          "author": "esmenard",
          "text": "You can make as many forks of Android as you want, it won't change anything if phones are still sold with Android installed on them",
          "score": 1,
          "created_utc": "2026-02-27 22:29:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qri0e",
          "author": "artlessknave",
          "text": "Easy\n\nAndroid is open source\n\nGoogle Android is closed source.\n\nAndroid is very different from Google Android.\n\n It's about like trying to use Gentoo, raw, vs a Gentoo distro with automated install\n\nUnless someone builds a build of android that's comparablemto Google's Android, Google's Android has the monopoly, and can basically do whatever they want.\n\nLike Microsoft with windows, until recently, with valve funding proton to create a ln alternative on Linux",
          "score": 0,
          "created_utc": "2026-02-27 18:21:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p8m88",
          "author": "speyerlander",
          "text": "1. It's the default mobile operating system.\n2. The ecosystem is already there, developers expect the Android API, most Linux desktop apps don't ship mobile interfaces.\n3. A phone is a much bigger attack vector for the average human than their PC or a server, most traditional Linux distros are years behind Android in terms of security. \n4. The AOSP, the open source base for pretty much all Android distributions, isn't locked down at all, you can modify it as much as you'd like. GrapheneOS is a prime example of a thriving ROM.\n5. When people talk about Google locking Android down, they usually refer to their plan to restrict app installation from 3rd party sources by implementing a mandatory developer verification system forcing all developers to provide personal information to Google in order to publish an app, even through a third party store like F-Droid or through Github. This won't impact the custom ROMs, they will probably remove it, but the OEMs wl likely integrate it, substantially decreasing the potential user base that will even be able to install those apps provided they aren't notorized through Google.",
          "score": 0,
          "created_utc": "2026-02-27 13:53:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7r718c",
          "author": "Link_Tesla_6231",
          "text": "Android was not designed and developed as an open operating system. Neither was chrome OS. Now chrome OS flex is an open OS.",
          "score": 0,
          "created_utc": "2026-02-27 19:35:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1re8g3j",
      "title": "An alternative to Lenovo Vantage for Linux: KVantage",
      "subreddit": "opensource",
      "url": "https://github.com/kosail/KVantage",
      "author": "LibrarianEmpty5407",
      "created_utc": "2026-02-25 09:14:14",
      "score": 15,
      "num_comments": 0,
      "upvote_ratio": 0.94,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Alternatives",
      "permalink": "https://reddit.com/r/opensource/comments/1re8g3j/an_alternative_to_lenovo_vantage_for_linux/",
      "domain": "github.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1rfikap",
      "title": "RackPeek v1.0.0 released (thank you!)",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rfikap/rackpeek_v100_released_thank_you/",
      "author": "aptacode",
      "created_utc": "2026-02-26 18:43:58",
      "score": 13,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I posted here last week feeling very disheartened about the state of opensource software after being involved in a bit of (resolved) [internet drama](https://www.reddit.com/r/opensource/comments/1r8fafs/why_build_anything_anymore/).\n\nI wanted to share that the response from the FOSS community was extremely uplifting and really gave me the energy to continue to provide the highest quality software craftsmanship I can.\n\nI now feel that Idioms like \"it’s a marathon, not a sprint\" and \"the last 10% is 90% of the effort\" have never been more relevant, especially with the prevalence of AI assisted tooling. We intend to keep the lessons learned over decades of software engineering in mind as we continue to provide our users with the stable and high quality experience that should be expected of professional software.\n\nThanks!\n\n[https://github.com/Timmoth/RackPeek](https://github.com/Timmoth/RackPeek)",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rfikap/rackpeek_v100_released_thank_you/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7kr9za",
          "author": "BKMD44",
          "text": "I subscribed to receive notifications on the project through GitHub, not really knowing what that entailed (I'm not a coder), and I was blown away by the amount of messages that hit my inbox. I was impressed by the continuous level of effort and am excited to use 1.0 and beyond. Thank you!",
          "score": 3,
          "created_utc": "2026-02-26 20:15:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lsua0",
              "author": "aptacode",
              "text": "Thank you for your interest in the project :) I really appreciate your support!",
              "score": 2,
              "created_utc": "2026-02-26 23:20:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rcxaio",
      "title": "I’m building an open-source Vulnerability Intelligence platform using FastAPI & PostgreSQL, and I could really use some feedback/contributors!",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rcxaio/im_building_an_opensource_vulnerability/",
      "author": "bekar81",
      "created_utc": "2026-02-23 23:12:14",
      "score": 11,
      "num_comments": 8,
      "upvote_ratio": 0.78,
      "text": "Hey everyone,\n\nI've been working on a passion project called **CyberSec Alert SaaS** ([https://github.com/mangod12/cybersecuritysaas](https://github.com/mangod12/cybersecuritysaas)). It’s an enterprise-ready vulnerability intelligence platform designed to automate asset correlation, generate alerts, and track real-time threats.\n\n**The Problem:** Security teams are drowning in noise. Tracking CVEs across NVD, Microsoft MSRC, Cisco PSIRT, Red Hat, and custom RSS feeds manually is a nightmare.\n\n**The Solution:** I’m building a centralized engine that aggregates all these feeds, correlates them with a company's actual assets, and alerts them *only* when it matters.\n\n**The Stack:** Python (86%), FastAPI, and PostgreSQL.\n\nI’m posting here because I want to make this a genuinely useful open-source tool, and I know I can't build it in a vacuum. I am looking for:\n\n* **Code reviews:** Tear my FastAPI architecture apart. Tell me what I can optimize.\n* **Contributors:** If you want to work on a cybersecurity tool to boost your portfolio, there are a ton of integrations and features on the roadmap.\n* **General Feedback:** Does this seem like a tool you'd deploy?\n\nCheck out the repo here: [https://github.com/mangod12/cybersecuritysaas](https://github.com/mangod12/cybersecuritysaas)\n\nAny advice, PRs, or even just a star would mean the world to me. Thanks for your time!",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rcxaio/im_building_an_opensource_vulnerability/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o72grsp",
          "author": "Hypercubed",
          "text": "Your Demo Credentials don't seam to work.",
          "score": 2,
          "created_utc": "2026-02-24 02:40:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73r4b0",
              "author": "bekar81",
              "text": "I limited the cloud database instance maybe bcs that you can still use github 0auth will look into this",
              "score": 0,
              "created_utc": "2026-02-24 08:30:53",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o73uuxy",
              "author": "bekar81",
              "text": "Google had some problem\n\nTitle\n\nCloud Logging customers were experiencing delays with log ingestion.\n\nStatus Closed\n\nDescription\n\nThe issue with Cloud Logging has been resolved for all affected users as of Monday, 2026-02-23 05:20 PST.\n\nWe thank you for your patience while we worked on resolving the issue.\n\nProducts impacted\n\nCloud Logging\n\nLocations impacted\n\nus-central1\n\n19 hours ago\n\nMost recent update\n\nThe issue with Cloud Logging has been resolved for all affected users as of Monday, 2026-02-23 05:20 PST.\n\nWe thank you for your patience while we worked on resolving the issue.\n\nShow less\n\nDiagnosis\n\nSome Cloud Logging customers ingesting logs in us-central1 were experiencing delays for up to 25 minutes.\n\nWorkaround\n\nNone at this time.",
              "score": -1,
              "created_utc": "2026-02-24 09:06:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72vhso",
          "author": "lurgancowboy",
          "text": "> **The Problem:** Security teams are drowning in noise. Tracking CVEs across NVD, Microsoft MSRC, Cisco PSIRT, Red Hat, and custom RSS feeds manually is a nightmare.  \nIs it really?  \n\nI could be misunderstanding the goal but some other thoughts:  \n1. I'd recommend separating your consolidated \"catalog\" data and the vulnerability management piece into separate projects. They have different lifecycles and uses and people might only be interested in the former without the latter.  \n2. Are you planning to include exploit availability sources? That's likely the single biggest gain you can make in terms of signal/noise ratio https://gitlab.com/exploit-database/exploitdb  \n3. You might also want to consider https://euvd.enisa.europa.eu/  and check home OpenVAS is doing it  \n4. How does the asset correlation work? It sounds like the vulnerability assessment piece is missing? Or is your idea to narrow the catalog to what users think they're interested in by CPE matching? That sounds like a dangerous thing to do...  \n5. If the goal is a vulnerability catalog with tailored new CVE and advisories then I'd think you'll want a mechanism to build that, which might be where the VA solution like OpenVAS  comes in?\n  \nCool project, good luck!",
          "score": 2,
          "created_utc": "2026-02-24 04:11:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73q4dm",
              "author": "bekar81",
              "text": "This is a nightmare  not for folks who sre in it and such but people who set and forget devices ive had an internship at a big organisation like 9000 employees big and they do this though Thanks for taking the time to write this — genuinely appreciate the thoughtful feedback.\n\nYou’re right about separating the catalog from the vulnerability management layer. I originally bundled everything together because I liked the idea of a single pipeline, but architecturally it makes more sense to split them. A clean, normalized vulnerability catalog could stand on its own, and the asset-correlation/alerting layer could sit on top as a separate component. That’s something I’m seriously considering refactoring toward.\n\nOn exploit availability — completely agree. Severity alone isn’t a good signal. Integrating EPSS, KEV, and public PoC sources like Exploit-DB would dramatically improve the signal-to-noise ratio. That’s high on the roadmap.\n\nGood call on EUVD and OpenVAS as well. I need to study how they structure their enrichment and matching logic instead of reinventing something weaker.\n\nFor asset correlation: right now it’s CPE + version matching against user-declared inventory. No active scanning yet. So yes — it narrows the catalog based on declared assets rather than discovered ones. I’m aware CPE matching can get messy (naming inconsistencies, version parsing, edge cases), and that’s an area that needs hardening.\n\nTo clarify scope: I’m not trying to replace enterprise VA tools. The idea is more of a lightweight, developer-friendly vulnerability intelligence + inventory-aware alerting layer that’s open and extensible.\n\nThis kind of critique is exactly what I was hoping for — thanks again.",
              "score": 0,
              "created_utc": "2026-02-24 08:21:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o734to2",
          "author": "bccorb1000",
          "text": "I worked at IBM for xforce and we built something akin to this but way more depth. \n\nWe automated the processing 10,000 samples and we used things like: \n\nVirus total\nURL haus\nIP reputation \nCVEs\nPublic yara rules etc\n\nYou’re in the right path for sure!!! Consider some static code analysis tooling and pairing with other open source projects for threat sharing! \n\nMaybe generate your own set of yara rules",
          "score": 2,
          "created_utc": "2026-02-24 05:17:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73qjtn",
              "author": "bekar81",
              "text": "X-Force depth is a different league. Right now mine is much simpler (CVE + advisory aggregation + inventory matching), but your point about multi-source enrichment is right but its tricky a bit. I know CVEs isn’t enough — the real data comes from correlating across VT, reputation feeds, exploit data, etc.\nStatic analysis + SBOM ingestion makes a lot of sense as a next step. And generating custom YARA rules from PoCs or exploit patterns would be a huge upgrade from just alerting on metadata. Would keep thoughts on that though im just a student in 6th semester 🥺 and a reply from ibm engineer who worked on x force is an achievement enough for me",
              "score": 0,
              "created_utc": "2026-02-24 08:25:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1raztby",
      "title": "Trying to beat rsync speed with QUIC — introducing Thruflux (alpha)",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1raztby/trying_to_beat_rsync_speed_with_quic_introducing/",
      "author": "samsungplay",
      "created_utc": "2026-02-21 19:16:05",
      "score": 10,
      "num_comments": 2,
      "upvote_ratio": 0.86,
      "text": "Hello r/opensource,\n\nNote: I know this is some massively long text, but I really wanted to explain the story behind this tool. Feel free to skip to the TL;DR section if you don't want to read.\n\n**The Story:**\n\nOne day, inside me arose an ambition to create the fastest file transfer CLI tool possible in existence. So I looked at existing popular solutions - croc, scp, rsync, and magic wormhole, I discovered one thing they all have in common: they all use TCP. But then recently I've had great interest in QUIC and UDP protocol in general, so I knew I had to make use of this if I had any chance to beat these tools. And I have actually noticed that many of these p2p cli tools lack first-class support for multi-file and folder transfers compared to rsync. But then rsync lacks support for NAT traversal and does not support any random two peers. This was what my tool intended to solve. I had these six ideas in mind:\n\n1). It must use the QUIC protocol, to benefit from the higher success of udp hole punching, and make use of advanced congestion control algorithm like BBR.\n\n2). It must have first-class support for mult-file transfers. Transferring multi files should be as fast, if not faster, than a single file of same size.\n\n3). It must support multiple receivers.\n\n4).It must support random two arbitrary peers, and be cross platform. Should be dead simple to use.\n\n5).It must have automatic resume support.\n\n6). And above all, SPEED over anything else. This should be the core selling point of my tool.\n\nSo I had started building tool during winter vacation last year, and was able to come up with a first working version in Go language - about which I had posted on several other subreddits before. But then unfortunately, it turned out that due to me using AI agent heavily to code it for rapid prototyping, I received lots of negative feedback (some actually genuinely disrespectful) which was honestly quite sad given how much passion I had for the tool, and the fact that tool was only in its early stage. (But thanks for those who has given me constructive criticism and feedback!)\n\nBut instead of staying sad, I embraced these negative comments to remind me that I can be a better coder than an AI agent. In fact, I realized there was room for improvement - while it showed strong performane, it was NOT able to beat scp and rsync in terms of throughput. I had to devise another approach. I thought I could do better than AI agents.\n\nSo in the past month I decided to manually rewrite the whole repo from scratch in Java, the language I'm most familar with, without using AI agents. However, after I built a basic prototype and ran some tests, the result was disappointing; simply speaking, Java's quic libraries and ecosystem was simply not mature enough to rival my previous Go implementation.\n\nTherefore, I decided to move on to C++. Heck, if any language had chance to beat Go, I thought it would be C++. After several painful weeks working day and night coding and debugging in C++, I finally managed to come up with a working implementation. But here are some interesting observations I learned throughout the process:\n\n1). Apparently, I thought using multiple threads with multiple QUIC connections and streams was the correct way to achieve maximum throughput. I thought more parallel connections = better. And this was true for my Go implementation. But turns out in C++ the libraries and language are so efficient that I was able to saturate the network with only single thread and connection. This helped me greatly simplifiy the app logic.\n\n2). QUIC scales heavily with CPU power and core count of the host machine. While QUIC performed worse in low-end devices, for a reasonable CPU released in last 10 years and with at least 2 cores, QUIC outperformed TCP.\n\n3). BBR congestion algorithm made huge difference in terms of throughput in my implementation, almost showing \\~x4 throughput compared to CUBIC. Also, the UDP buffer size of the OS matters a lot. Transfers become nearly \\~x1.3 faster given plenty of UDP buffer size of at least 8 MiB.\n\nAnd finally, the moment of truth came.. to benchmark my tool against existing ones:\n\n* Vultur dedicated CPU 2vCPU(AMD EPYC Genoa) 4GB RAM, NVMe SSD, Ubuntu 22.04\n* Tested over public internet, where sender is located in Chicago and receiver is located in New Jersey.\n* Method: median of 3 runs, and all times are end-to-end wall clock times including setup / closing phase, not just the pure transfer time.\n* Accounts for only the \"receiving phase\"\n\n|Tool|Transport|Random Remote Peers|Multi-Receiver|10 GiB File|1000×10 MiB|\n|:-|:-|:-|:-|:-|:-|\n|**thruflux(direct)**|QUIC|✅|✅|**1m34s**|**1m31s**|\n|rsync|TCP (SSH)|❌|❌|1m43s|1m39s|\n|scp|TCP (SSH)|❌|❌|1m41s|2m20s|\n|croc|TCP relay|✅|❌|2m42s|9m22s|\n|wormhole|TCP relay|✅|❌|2m45s|❌ stalled \\~8.8 GiB around 3m|\n\n..and it seemed very promising! Even with 6 seconds of initial p2p handshake phase (which scp and rsync doesn't have) my tool was able to beat scp and rsync in terms of wall clock time. Other than scp/rsync, compared to existing p2p tools, my tool appeared to be clearly faster - in fact, for 1000 files transfer, it had shown dominant performance that cannot be ruled out as statstical anomaly. Plus, croc spends time hashing files while wormhole spends lot of time compressing everything for multi-file sends. Since my tool just skips all that extra work, the difference in actual wall clock time was even bigger. But what I really wanted to highlight was how its performance on transferring 1000 or a single file of same size did not change at all. I was proud to have achieved first-class support for multi-file transfers.\n\nSo.. it seemed so good to be true. What were the catches?\n\n1). CPU dependent : My tool required higher CPU power compared to other tools. On devices with low end cpu and only 1 core, it performed marginally worse than rsync and scp.\n\n2). TURN relay fallback: While I included default turn relays in case direct connectivity cannot be established, my self-hosted turn server is not that powerful (also in a pretty bad location) and it therefore showed worse results compared to other tools. So it will be much slower for networks with symmetric NATs.\n\n3). UDP quirks: I found out that some restrictive networks (like my school vps) completely blocks outbound UDP sometimes so not even TURN would work in this case. Basically QUIC is infeasible in this situation.\n\n4). Longer connection phase: Since I'm using a full ICE exchange protocol, initial connection phase is slower than other tools for sure. But I think this is something I can improve upon if I use trickle ICE instead of gather-all like right now.\n\n5). Lack of verification: For speed, my tool trusts the QUIC protocol's network level integrity (which is stronger than TCP by nature). However, there can be rare edge cases such as disk corruption that may corrupt the file. But this is arguably quite rare that I decided to skip for now.\n\n6). Bloated security join code: Unlike croc/wormhole, I do not use PAKE but I rely on WSS TLS encryption and QUIC's innate AED encryption in transit. Therefore, join code must have as high entropy as possible to compensate for the security. I understand some may not love the current join code system, but hopefully it wouldn't matter too much because we all copy paste anyways.\n\nBut regardless, I think there is still some real potential for this tool, especially for multi-file transfer scenarioes. After all, it's still early stage.\n\nAnd this was the story behind this tool. If you managed to read until this part, I really appreciate your time. I hope it was interesting.\n\n**Conclusion (TL;DR)**\n\nI built a new mass transfer CLI named Thruflux in C++, and it has reached an alpha stage (all core functionalities are implemented and basic tests are done, but no guarantee of absolute stability and bug-freeness). Expect occasional bugs due to quirks of networking and cross platform distribution in general, it's still very early stage! But if you ever try it, I really appreciate it and of course, any constructive feedback are welcome :) And of course, if you encounter any bugs please do open an issue in github. Without feedbacks, Thruflux will never be able to move out from its alpha stage.\n\nBy the way, I wiped out all the commit history after having rewritten in C++ because my original commit history is quite unprofessional and contaminated. I'll try my best to write better commit messages this time!\n\n**Install**\n\n**Linux Kernel 3.10+ / glibc 2.17+ (Ubuntu, Debian, CentOS, etc.)**\n\n    curl -fsSL https://raw.githubusercontent.com/samsungplay/Thruflux/refs/heads/main/install_linux.sh | bash\n\n**Mac 11.0+ (Intel & Apple Silicon)**\n\n    curl -fsSL https://raw.githubusercontent.com/samsungplay/Thruflux/refs/heads/main/install_macos.sh | bash\n\n**Windows 10+ (10+ Recommended, technically still could work on Windows 7/8)**\n\n    iwr -useb https://raw.githubusercontent.com/samsungplay/Thruflux/refs/heads/main/install_windows.ps1 | iex\n\n**Use**\n\n    # host files\n    thru host ./photos ./videos\n    \n    # share the join code with multiple peers\n    thru join ABCDEFGH --out ./downloads\n\nRepo:\n\n[https://github.com/samsungplay/Thruflux](https://github.com/samsungplay/Thruflux)",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1raztby/trying_to_beat_rsync_speed_with_quic_introducing/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o6qtqx2",
          "author": "marcogabriel",
          "text": "How does this relate or compare to syncthing?",
          "score": 1,
          "created_utc": "2026-02-22 09:10:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6rqsgv",
              "author": "samsungplay",
              "text": "Thruflux is basically a one-off sending tool while syncthing is a persistent sync tool. I believe syncthing is optimized for safety while this one is optimized for throughput. So personally I don't think it would make sense to sync folders for a simple direct transfer. While I did not do proper benchmarking, syncthing has bunch of other techniques under its sleeves to guarantee safety, so I assume it has more overheads and will be slower. But of course, it will be safer and more continuous because it keeps watching your files for diff. I might try benchmarking with it though. Thanks for the comment",
              "score": 1,
              "created_utc": "2026-02-22 13:48:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rdn2jd",
      "title": "I built a simple open-source Windows image viewer, feedback appreciated",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rdn2jd/i_built_a_simple_opensource_windows_image_viewer/",
      "author": "TheGameRoom420",
      "created_utc": "2026-02-24 17:45:20",
      "score": 10,
      "num_comments": 11,
      "upvote_ratio": 0.82,
      "text": "I've awfully neglected programming for the last year or so, so I made a simple image viewer that could replace the default one on Windows.\n\nI think the code is a bit messy, even though it's only a few hundred lines, and I did NOT keep my promise of adding more comments, but it's relatively bug free, at least for what I could deduce from my limited testing (probably missed a lot of edge cases). However, I'm happy that I learnt some new stuff (like how to actually make my code into an installable app (Inno Setup Compiler))!\n\nAny feedback you guys can give me is appreciated! Thanks!\n\nLink to GitHub repository: [https://github.com/Soytu611/OpenPhotoViewer](https://github.com/Soytu611/OpenPhotoViewer)",
      "is_original_content": false,
      "link_flair_text": "Promotional",
      "permalink": "https://reddit.com/r/opensource/comments/1rdn2jd/i_built_a_simple_opensource_windows_image_viewer/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o76tbkd",
          "author": "playffy",
          "text": "Please, any ui screenshots",
          "score": 4,
          "created_utc": "2026-02-24 19:12:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76ydu3",
              "author": "TheGameRoom420",
              "text": "[https://imgur.com/a/qisCJUb](https://imgur.com/a/qisCJUb)",
              "score": 3,
              "created_utc": "2026-02-24 19:35:40",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o76xtmr",
              "author": "parkerlreed",
              "text": "It's Tkinter. There's nothing to look at...",
              "score": 1,
              "created_utc": "2026-02-24 19:33:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o76yhn1",
                  "author": "TheGameRoom420",
                  "text": "True, but I tried my best to make it look okay :)",
                  "score": 3,
                  "created_utc": "2026-02-24 19:36:11",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7fmq0s",
          "author": "Hot-Butterscotch-396",
          "text": "I make one as well. you can see demo here:  \n[I built a local-first photo manager with Vue 3 + Tauri (Lap) : r/vuejs](https://www.reddit.com/r/vuejs/comments/1raw3u8/i_built_a_localfirst_photo_manager_with_vue_3/)",
          "score": 2,
          "created_utc": "2026-02-26 01:11:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7hrd49",
              "author": "TheGameRoom420",
              "text": "Nice! Definitely more professional that mine :))",
              "score": 1,
              "created_utc": "2026-02-26 10:41:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7hv0zv",
                  "author": "Hot-Butterscotch-396",
                  "text": "thank you",
                  "score": 1,
                  "created_utc": "2026-02-26 11:14:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7mcyih",
          "author": "webfork2",
          "text": "Could you post some details to your Github page?  Right now I'm just seeing a license.  Screenshots, planned features, why it's different from other similar tools, etc.",
          "score": 1,
          "created_utc": "2026-02-27 01:12:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rft640",
      "title": "What do you think of source-available? Are we getting into the ever-so-slightly-barely-open-source world?",
      "subreddit": "opensource",
      "url": "https://www.reddit.com/r/opensource/comments/1rft640/what_do_you_think_of_sourceavailable_are_we/",
      "author": "jerrygreenest1",
      "created_utc": "2026-02-27 01:36:51",
      "score": 9,
      "num_comments": 6,
      "upvote_ratio": 0.74,
      "text": "It seems more and more projects move away from open-source to commercial source-available models. And I can see the benefit of course... When everything is open-source it is so easy to take advantage for the «big three». Rich become richer, and the open-source authors aren't as much rewarded. It makes sense: people aim to prevent providers like AWS/GCP/Azure from profiting without contributing anything. Everybody knows about this Redis incident where they decided to move away from open-source. Many more cases has happened like this, and nobody seemed to notice – but we're getting more and more far away from open-source world model to a source-available world.\n\nHere's some summary of popular tech moving away from open-source to source-available:\n\n\\- Redis storage in March 2023  \n\\- SpacetimeDB «gamey» distributed database in Aug 2023  \n\\- Terraform infrastructure-as-code in Aug 2023  \n\\- SentryIO error tracker in Aug 2024  \n\\- CockroachDB cool distributed database in Nov 2024   \n\\- ScyllaDB beautiful distributed database in Feb 2025  \n\\- Bear blogging solution in Nov 2025\n\nIt almost seems like this single Redis incident bootstrapped an entire trend of transitioning from open-source. There are less notable in this time-frame, I saved your time only listing most notable. And technically this entire movement hasn't started with Redis – because we've seen such licenses even before Redis. We've seen MongoDB moved away from open-source in 2018, and Elasticsearch in 2021. So it's not like Redis started it all.\n\nBut Redis case seemed one of the most loud to me, and it's almost like after this people started to transition more often. And if it's a data storage then – especially often. It's like we can almost already fear for losing Postgres or something? Hopefully not.\n\nI, in particular – was interested in distributed databases a lot: wanted to learn to make this horizontally-scaled data model without relying on any particular online service vendor. It's like a hobby of mine that I am trying to do in my free time, so now I am noticing. SpacetimeDB v2 from a few days ago looked really nice in marketed video but the self-hosted version from GitHub doesn't have all that is marketed: certain features are hidden behind their online service, while the self-hosted option only allows one node.\n\nWhat do you think of source-available? Is this to secure abuse from rich companies becoming richer? Or is it bad for independent solo developers too? In some cases it seems it's really only to secure developer from competition, that's good, right? I mean, it would be really unfair if you do all the work and someone else only simply hosted your solution and gets all the credit. But in other cases it kinda defeats the purpose, like this SpacetimeDB where features are hidden. And it's becoming hard to recognize what is what, when all of them are having different license: without a detailed inspection into the thing, I cannot tell beforehand whether a tool can do what I want, or it's just a marketed bla-bla-bla that is hidden behind vendor-locking.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/opensource/comments/1rft640/what_do_you_think_of_sourceavailable_are_we/",
      "domain": "self.opensource",
      "is_self": true,
      "comments": [
        {
          "id": "o7ns2s3",
          "author": "GloWondub",
          "text": "I couldn't care less about source-available software.\nAs non-resilient and useless as closed tbh.",
          "score": 12,
          "created_utc": "2026-02-27 06:48:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nt7j5",
              "author": "trent-7",
              "text": "I would say it depends on the license. If you look at the Sustainable Use License (https://docs.n8n.io/sustainable-use-license/) or O'Saasy license (https://osaasy.dev/), they just limit SaaS usage, especially the latter one...",
              "score": 1,
              "created_utc": "2026-02-27 06:57:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7o4740",
                  "author": "GloWondub",
                  "text": "As I said, not open source, not my problem. And also out of topic for this subreddit.",
                  "score": 1,
                  "created_utc": "2026-02-27 08:36:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7obec7",
          "author": "ssddanbrown",
          "text": "I personally think source available as a concept is fine, and respect the rights of developers to license their efforts how they wish, but I think it should not be conflated with open source, which it often is, and many producers of source available software mislead or downplay the rights limited relative to their actual license terms.\n\nI've got [a relevant blog post here](https://danb.me/blog/open-source-available-distinction/) if interested.",
          "score": 8,
          "created_utc": "2026-02-27 09:46:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o50ki",
          "author": "kivanow",
          "text": "This hits close to home - I was at Redis when they added AGPL as the third license option last year (the \"open source is back\" announcement).                                                                     \n  \n**On source-available specifically:** I think it's a legitimate response to a real problem. The cloud provider dynamic isn't \"evil corporations stealing code\" - AWS, Google, and others had engineers                \ncontributing to Redis for years (TLS support, ACLs, coordinated failovers). The tension was about who controls the project direction vs. who captures the commercial value. There's no easy answer to that.       \n  \n**The problem for solo devs:** You nailed it - it's becoming impossible to tell what you can actually do without reading every license line by line. SSPL, BSL, RSAL, OCVSAL... they all have different               \nrestrictions, and \"source-available\" isn't a standardized term. Self-hosting is usually fine. Building a competing service usually isn't. Everything in between? Depends.                                         \n  \n**The Redis --> Valkey situation** is instructive though. When the license changed, external maintainers were effectively kicked out (some found out when their names disappeared from governance docs). Within         \nweeks, Valkey existed under the Linux Foundation. The lesson: governance matters as much as licensing. A permissive license controlled by one company can change overnight. A copyleft project with               \ndistributed governance probably won't.   \n  \n**What I look for now:**   \n\\- Who actually controls the project? Single company or independent maintainers?   \n\\- How easy is it to fork if things go sideways?   \n\\- Has the company changed licenses before, and how did they handle it?   \n  \nI wrote a longer breakdown of this whole landscape (including the Redis timeline and how dual-licensing actually works in practice) if anyone wants to go deeper: [https://medium.com/gitconnected/dual-licensing-explained-mit-source-available-and-why-your-favorite-tool-might-be-neither-d7041543e05d?sk=5901f94d18723141a05767ca61f3f266](https://medium.com/gitconnected/dual-licensing-explained-mit-source-available-and-why-your-favorite-tool-might-be-neither-d7041543e05d?sk=5901f94d18723141a05767ca61f3f266)   \n",
          "score": 2,
          "created_utc": "2026-02-27 08:44:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7syc7f",
          "author": "billFoldDog",
          "text": "If the community can't fork it, I don't want it.",
          "score": 1,
          "created_utc": "2026-02-28 01:16:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}