{
  "metadata": {
    "last_updated": "2026-01-22 08:58:07",
    "time_filter": "week",
    "subreddit": "ProductHunters",
    "total_items": 20,
    "total_comments": 70,
    "file_size_bytes": 81432
  },
  "items": [
    {
      "id": "1qfl6uj",
      "title": "I studied 47 SaaS products that went from $0 to $10k MRR last year. Here's what they all did right.",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qfl6uj/i_studied_47_saas_products_that_went_from_0_to/",
      "author": "whyismail",
      "created_utc": "2026-01-17 18:42:03",
      "score": 15,
      "num_comments": 8,
      "upvote_ratio": 0.9,
      "text": "Hey, I went into SaaS last year with my tool [Brandled ](https://brandled.app/)(helps founders grow on X & LinkedIn) in a pretty competitive space with $0 and 0 audience and ended up wasting six months straight on the wrong things.\n\nSpent half a year stuck at $0 MRR.\n\nThen I became obsessed with one question: what separates SaaS products that make it from those that die at zero.\n\nSo I went down a rabbit hole. Studied 47 founders who went from $0 to $10k+ MRR in the last year. Watched their podcasts, red their tweets, and everything i could get my hands on.\n\nHere's what I learned from all of them, and what I was doing catastrophically wrong.\n\n**1. Frictionless signup isn't optional**\n\nEvery successful product had one-click social login. Google OAuth mostly.\n\nThe ones that died had email verification flows, password requirements, multi-step forms asking questions before showing any value.\n\nThe math is brutal. If you lose 30% of people at signup and you're getting 1000 visitors a month, that's 300 potential customers gone. At a 10% trial-to-paid conversion, that's 30 paying customers per month lost to signup friction alone.\n\nI started with magic link only. Completion rate was 45%. Added Google login. Jumped to 78% the next day.\n\nEvery percentage point of friction at signup costs you real revenue. Most founders don't even measure this.\n\n**2. They launched in weeks, not months**\n\nNone of them spent 6 months building in secret.\n\nAverage time from idea to first paying customer: 3-6 weeks. They launched with ONE core feature. Then spent most of their time marketing it.\n\nI did the opposite. Spent 3 months building features before launching. Content generation, analytics, scheduling, competitor tracking, everything. Got 12 signups. Zero paying customers.\n\nConvinced myself the product wasn't good enough. Spent another month adding features. Still nothing.\n\nThe problem wasn't my product. Nobody knew it existed.\n\nAfter I stopped building and started marketing, posting on Reddit, doing LinkedIn outreach, documenting on X, I hit $126 MRR in 4 days.\n\nSame product. Different approach.\n\nPost-launch is 90% marketing, 10% product.\n\n**3. They were shameless about promotion**\n\nThe successful ones talked about their product everywhere. Not spammy. Just never hiding it.\n\nReddit threads. Twitter replies. Forum comments. Anywhere their audience hung out.\n\nThey'd give genuinely helpful advice first, then naturally mention their tool when relevant.\n\nStarted being shameless. Every relevant conversation where someone complained about the problem I solved, I'd help them first, then mention I built something for this.\n\nA few people definitely get mad but I feel the upside is worth it.\n\nYour product won't discover itself.\n\n**4. They asked churned users what went wrong**\n\nEvery successful product had a system for this. Automated email going out when someone cancels asking what didn't work.\n\nI was doing none of this. Saw cancellations in Stripe, felt rejected, moved on. Never asked why. Never learned anything.\n\nNow every cancelled user gets emails through and automated email sequence and the replies are done by me personally.\n\nResponse rate is 40%. The feedback is literally gold.\n\nEvery single one is fixable. But I only learned because I asked.\n\nChurned users tell you the real truth about your product.\n\n**5. They used their own product religiously**\n\nNot one successful founder was building something they didn't use daily. They were their own heaviest users.\n\nI wasn't doing this. Used my tool occasionally to \"test\" but wasn't relying on it daily.\n\nForced myself to create all my content through my own product for a week. Found 7 bugs in 30 minutes that never showed up in testing.\n\nGenerate button didn't work on mobile. Analytics took 8 seconds to load. Onboarding skipped steps if you refreshed.\n\nMy users were experiencing this and not telling me. They were just leaving.\n\nIf you're not using your product daily as a real user, you're building blind.\n\n**6. They fixed retention before scaling acquisition**\n\nBiggest strategic difference.\n\nFailed products: 30-50% monthly churn, constantly chasing new users to replace ones leaving.\n\nSuccessful products: Fixed retention first, got churn to 10-20%, then scaled acquisition.\n\nThe math: At 40% churn, you acquire 40 customers to net 24. At 15% churn, you acquire 40 and net 34. Same effort, 42% better results.\n\nI was obsessed with new signups. Ignored my 40% churn rate. Got 10 new customers, lost 4. Net: 6.\n\nStopped all acquisition. Fixed onboarding from 8 steps to 3. Added email sequences. Built features retained users asked for. Churn dropped to 15%.\n\nSame acquisition effort, now net 8-9 customers instead of 6.\n\nRetention is the foundation. Acquisition is the multiplier.\n\n**7. They shipped MVPs with one feature**\n\nEvery successful product launched stupidly lean. One core feature done exceptionally well.\n\nI launched with 7 features: content generation, analytics, scheduling, competitor tracking, SWOT, comments, hashtags.\n\nCodebase was a nightmare. Users were confused. I was maintaining features 3% of users touched.\n\nShould've launched with one thing: AI content that sounds human. Made that 10x better. Everything else later based on what paying customers asked for.\n\nYour MVP should make people say \"this solves my exact problem\" even if ugly and missing features.\n\nNot \"wow, so many features\" while solving nothing particularly well.\n\n**8. They priced based on value, not competition**\n\nNone of them raced to the bottom on pricing.\n\nThey looked at the value delivered. Hours saved. Revenue generated. Pain eliminated.\n\nThen priced a fraction of that value.\n\nI priced at $19/month because competitors were at $29-39. Thought I'd win on price. Just looked cheap and inferior.\n\nNeeded 263 customers to hit $5k MRR at $19 versus only 128 at $39.\n\nRaised price to $29-39. Conversions didn't drop. They improved slightly.\n\nHigher price signaled solving a valuable problem.\n\nPeople who care about $10 differences aren't your best customers. They'll churn for anything $3 cheaper.\n\n**9. They automated relationship building**\n\nEvery successful product had email sequences from day one. Not promotional. Actual value and engagement.\n\nWelcome emails. Feature education. Check-ins. Re-engagement for quiet users. Win-back for churned users.\n\nI was sending nothing after signup. Users signed up, got busy, forgot, churned.\n\nEngagement doesn't happen by accident. You engineer it.\n\n**10. They validated with money, not words**\n\nThe problem with feedback: it's free. People say nice things because it costs them nothing.\n\nI built features based on \"that would be helpful\" comments from users who weren't even paying. Wasted weeks on features nobody used.\n\nNow I only build what paying customers explicitly request.\n\nMoney is the only validation that matters. Words are cheap. Credit card numbers are truth.\n\n**The one thing they all had**\n\nThey didn't quit when it felt hopeless.\n\nThey all hit $0 for months. Got depressed. Questioned everything. Wanted to shut it down.\n\nBut didn't.\n\nThe difference between $0 and success wasn't talent or luck. It was not quitting before they figured out what works.\n\n90% of SaaS products die not because they couldn't work. Because the founder quit too early.\n\nIf you're stuck at $0, study the people who've made it. Not the outliers. The normal founders who went from $0 to $10k.\n\nThey're not special. They just did specific things that compound and didn't quit when it got hard.\n\nThe playbook is right there. You just have to execute it.\n\nHappy to answer questions or go deeper on any of this.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qfl6uj/i_studied_47_saas_products_that_went_from_0_to/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "o05gym3",
          "author": "macromind",
          "text": "This hits a bunch of the classics in one place, retention first, measure signup dropoff, and dont hide the product.\n\nOne practical thing thats helped me: keep a simple \"channel log\" doc where every week you note what you shipped, what you promoted, and what moved (signups, activation, churn). Makes it way easier to spot what actually drives growth instead of vibes.\n\nIf youre into that kind of SaaS marketing tracking and teardown discussions, https://www.reddit.com/r/Promarkia/ has similar threads.",
          "score": 1,
          "created_utc": "2026-01-17 18:48:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o06rwj1",
              "author": "Then_Charity8638",
              "text": "Keeping a channel log forces reality checks week to week. Makes it easier spot patterns between shipping and growth. That subreddit looks legit too, will recieve value from reading. Solid tip.",
              "score": 1,
              "created_utc": "2026-01-17 22:42:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o05u0x0",
          "author": "macromind",
          "text": "Really like the framing here. The retention-before-acquisition math is the part most people skip, but its basically the difference between compounding and running on a treadmill.\n\nFor marketing specifically, I have had better results when the MVP is not just a feature, but a single repeatable outcome (ex: reduce onboarding time, cut churn, book demos) that you can prove fast with a small cohort.\n\nAlso, if you are into SaaS marketing breakdowns and experiments, https://www.reddit.com/r/Promarkia/ has some good threads.",
          "score": 1,
          "created_utc": "2026-01-17 19:51:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o095hw1",
          "author": "Odd-Flamingo-6211",
          "text": "I read it, I agree with it, but I’m still doing the same as you - building my product in secret for three months and hoping for the best😄",
          "score": 1,
          "created_utc": "2026-01-18 07:18:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09r9hj",
          "author": "Aggravating_Jury7099",
          "text": "8 is very interesting. For me figuring out a price is very difficult",
          "score": 1,
          "created_utc": "2026-01-18 10:38:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0a2exz",
              "author": "Ancient_Section_75",
              "text": "\\+1 off to a new experiment of increasing our monthly (par to market) and giving a steep annual discount. Let's see how it goes. I can't understand or define price based on 'value'",
              "score": 1,
              "created_utc": "2026-01-18 12:16:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0bn2hi",
          "author": "Substantial-Ball-787",
          "text": "Looks and sounds awesome. Which startups are these though? Interested to know the list, otherwise - as valuable and good as this is, it will just read like more AI drivel.",
          "score": 1,
          "created_utc": "2026-01-18 17:28:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n5bm1",
          "author": "Hot_Blackberry_2251",
          "text": "The signup friction point here is real, but it’s not just about fewer steps. What worked for us was separating access from trust. Let users reach value fast, then progressively verify once intent is clear. When identity checks are contextual and well-instrumented, they don’t feel like blockers. In some stacks I’ve seen, providers like AU10TIX quietly support that model by returning structured outcomes instead of hard fails, which lets product teams protect conversion without flying blind on risk.",
          "score": 1,
          "created_utc": "2026-01-20 10:09:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdx20h",
      "title": "Product Mafia Slack Group",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qdx20h/product_mafia_slack_group/",
      "author": "khamkk",
      "created_utc": "2026-01-15 21:52:44",
      "score": 12,
      "num_comments": 17,
      "upvote_ratio": 0.88,
      "text": "If you’re launching on Product Hunt and not in the Product Mafia Slack, genuine question, why?\n\nIt’s been one of the most helpful communities I’ve found for launches, feedback, and day-of support.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qdx20h/product_mafia_slack_group/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "nzt57nl",
          "author": "CriticalLeotard",
          "text": "This community has been great for launches!",
          "score": 1,
          "created_utc": "2026-01-15 22:01:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nztn9cn",
              "author": "Dear_Payment_7008",
              "text": "Heck yea!!",
              "score": 1,
              "created_utc": "2026-01-15 23:33:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzt78kq",
          "author": "MaaDoTaa",
          "text": "I agree",
          "score": 1,
          "created_utc": "2026-01-15 22:11:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztk7dc",
          "author": "Constant_Pea_4644",
          "text": "Great supportive community of fellow builders!",
          "score": 1,
          "created_utc": "2026-01-15 23:16:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztzyto",
          "author": "Trustless-",
          "text": "Didn’t know it existed till 30 sec ago maybe?",
          "score": 1,
          "created_utc": "2026-01-16 00:41:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzu1m79",
              "author": "khamkk",
              "text": "Feel free to join and explore: https://join.slack.com/t/productmafias/shared_invite/zt-3l3uhgu3a-f2wYt~80_9WIcq_Bp1m7ug",
              "score": 2,
              "created_utc": "2026-01-16 00:50:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzuls5y",
                  "author": "Trustless-",
                  "text": "Def do. I plan alaunch within jan *fingers crossed*\nMuch appreciated",
                  "score": 1,
                  "created_utc": "2026-01-16 02:43:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzvm04r",
          "author": "atMamont",
          "text": "I joined so to don’t have to. There is nothing but asking each other to upvote product launch.",
          "score": 1,
          "created_utc": "2026-01-16 06:42:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvz2cc",
              "author": "Creative-Chance514",
              "text": "What else do you seek ?",
              "score": 1,
              "created_utc": "2026-01-16 08:36:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzvzh4l",
                  "author": "atMamont",
                  "text": "builders community sharing their struggles and wins\n\nwhat I've seen is miserable",
                  "score": 1,
                  "created_utc": "2026-01-16 08:40:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0m6lct",
          "author": "palex-david",
          "text": "I am in it! \n\n[Live in 3 hours!](https://www.producthunt.com/products/palex?launch=palex-2)\n\nThanks!",
          "score": 1,
          "created_utc": "2026-01-20 05:09:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qiutgc",
      "title": "I just launched my first ever Product on PH",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qiutgc/i_just_launched_my_first_ever_product_on_ph/",
      "author": "Gloomy-Psychology-44",
      "created_utc": "2026-01-21 10:52:56",
      "score": 11,
      "num_comments": 12,
      "upvote_ratio": 0.93,
      "text": "https://preview.redd.it/wkk5hfztnoeg1.png?width=1915&format=png&auto=webp&s=26b088ab09f2714f0c90a3b653620e76914aa8d8\n\nIt was quite good experience and to work on this market gap of courses. Where courses are been very rigid over the years. But not now learning should be personalised and not common for all.\n\ncheck the product [https://www.producthunt.com/products/solohustller](https://www.producthunt.com/products/solohustller)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qiutgc/i_just_launched_my_first_ever_product_on_ph/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "o0ug1ar",
          "author": "Forsaken-Employ-4503",
          "text": "Congrats on your first Product Hunt launch. That’s a big milestone.\n\nThe idea of building learning paths around real availability instead of fixed schedules makes a lot of sense. Learning has been rigid for a long time, so this feels like a more personal and practical direction.\n\nWishing you a smooth launch today. We’re also preparing for our own Product Hunt launch soon, so happy to stay connected and support each other along the way.",
          "score": 3,
          "created_utc": "2026-01-21 12:42:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zqt34",
              "author": "Gloomy-Psychology-44",
              "text": "Thank you.",
              "score": 1,
              "created_utc": "2026-01-22 04:45:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0uhoid",
          "author": "sally-suite",
          "text": "Upvoted!",
          "score": 2,
          "created_utc": "2026-01-21 12:53:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zqtrm",
              "author": "Gloomy-Psychology-44",
              "text": "Thank you.",
              "score": 1,
              "created_utc": "2026-01-22 04:45:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0vihvf",
          "author": "Kourosh-ai",
          "text": "Good luck ! I will check it out",
          "score": 2,
          "created_utc": "2026-01-21 16:02:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zqtz5",
              "author": "Gloomy-Psychology-44",
              "text": "Thank you.",
              "score": 1,
              "created_utc": "2026-01-22 04:45:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0w3vua",
          "author": "Spotch_Platform",
          "text": "Congratulations, will make sure to upvote your product on PH",
          "score": 2,
          "created_utc": "2026-01-21 17:38:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zqu9z",
              "author": "Gloomy-Psychology-44",
              "text": "Thank you.",
              "score": 1,
              "created_utc": "2026-01-22 04:45:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0wyotr",
          "author": "vikram-suthar",
          "text": "Upvoted. \n\nPlese support my launch on peerlist - \n\n[https://peerlist.io/vikramsuthar/project/niceformio--modern-form-builder](https://peerlist.io/vikramsuthar/project/niceformio--modern-form-builder)",
          "score": 1,
          "created_utc": "2026-01-21 19:55:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x0vy3",
          "author": "actor_do",
          "text": "great! and congrats. Just upvoted it.\n\nyou can also promote it on [onemillionlines.com](http://onemillionlines.com) if you need some links.",
          "score": 1,
          "created_utc": "2026-01-21 20:05:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xwghq",
          "author": "Less_Let_8880",
          "text": "Congrats on ur first PH launch! I built TheTabber to help promote projects like this, connect 9+ platforms and schedule posts across em.",
          "score": 1,
          "created_utc": "2026-01-21 22:30:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yz4nj",
          "author": "vibefarm",
          "text": "I sent you an upvote.",
          "score": 1,
          "created_utc": "2026-01-22 01:59:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qitrp6",
      "title": "How to  get upvotes from Product Hunt launch?",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qitrp6/how_to_get_upvotes_from_product_hunt_launch/",
      "author": "Competitive_Sun2055",
      "created_utc": "2026-01-21 09:50:01",
      "score": 9,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,\n\nI just put my product on Product Hunt several hours ago. And I share it to my friends and colleagues, but they also can't upvote successfully. Does anyone can tell me what is the best way to get upvotes? Ready to learn from the best!\n\nAny feedback or suggestions on  [https://www.producthunt.com/products/wmaster-cleanup](https://www.producthunt.com/products/wmaster-cleanup) will be appreciated :)\n\nThanks in advance!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qitrp6/how_to_get_upvotes_from_product_hunt_launch/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "o0tyhis",
          "author": "Forsaken-Employ-4503",
          "text": "Congrats on the launch. I checked out WMaster Cleanup and upvoted it on Product Hunt. Nice to see a simple, clear focus on cleanup and performance without overcomplicating things.\n\nEarly launches can feel slow with upvotes, but consistent sharing, clear messaging, and real conversations usually help more than mass sharing. Happy to support and stay connected for future launches as well.\n\nGood luck today.",
          "score": 3,
          "created_utc": "2026-01-21 10:24:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0udn18",
              "author": "Competitive_Sun2055",
              "text": "So grateful for your kind feedback and suggestions, I will follow your suggestions :)",
              "score": 1,
              "created_utc": "2026-01-21 12:26:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tyt7z",
          "author": "Own-League928",
          "text": "Congrats on the launch! Just upvoted too!\n\nLet's connect and yes support each other's product.",
          "score": 2,
          "created_utc": "2026-01-21 10:27:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0udzvq",
              "author": "Competitive_Sun2055",
              "text": "Thank you for your kind support.",
              "score": 1,
              "created_utc": "2026-01-21 12:28:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0u0d0g",
          "author": "SergiePoe",
          "text": "If your product is already launched, you can:  \n**> Reach out to people on Product Hunt and ask for support**  \nlook at past launches - pick successful products - check the comments - find people who have a linked profile - message them there asking for support (most are very responsive, though they might not reply immediately)  \n\\> **Also post in Slack/Discord/LinkedIn communities**  \nthere are many open Telegram communities too, but personalized + warm messages in DMs usually work best.\n\nFrom my experience:  \n\\> Product Hunt is still a lively and cool platform, but don't rely on it for organic support. You need at least 1 month of prep to get into the top 3 + support from \\~1,000 ppl (\\~600 of whom actually vote on the launch day). **(!)** It's important that your supporters have an old account + accounts usually need to be verified via LinkedIn or similar.  \nAnd a basic tip - never use the word 'upvote' anywhere, or you risk getting banned ;)",
          "score": 2,
          "created_utc": "2026-01-21 10:41:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wcjo7",
          "author": "Agile_Hearing_8184",
          "text": "Congrats! Upvoted ✌🏼",
          "score": 2,
          "created_utc": "2026-01-21 18:16:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tzwev",
          "author": "New_Animator_7710",
          "text": "Very Congrats for the launch and really good product",
          "score": 1,
          "created_utc": "2026-01-21 10:37:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ue909",
              "author": "Competitive_Sun2055",
              "text": "Thank you for your kind feedback.",
              "score": 1,
              "created_utc": "2026-01-21 12:30:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0u2gny",
          "author": "sally-suite",
          "text": "Upvoted! Great product, and I’d appreciate it if you could vote for me too. Just launched on PH: [https://www.producthunt.com/products/long-draft?launch=long-draft](https://www.producthunt.com/products/long-draft?launch=long-draft) 🚀",
          "score": 1,
          "created_utc": "2026-01-21 10:59:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0udayd",
              "author": "Competitive_Sun2055",
              "text": "I upvoted, can you check whether it can go live?",
              "score": 1,
              "created_utc": "2026-01-21 12:24:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0wyuff",
          "author": "vikram-suthar",
          "text": "upvoted.\n\nPlease support my launch on peerlist  \n\n[https://peerlist.io/vikramsuthar/project/niceformio--modern-form-builder](https://peerlist.io/vikramsuthar/project/niceformio--modern-form-builder)",
          "score": 1,
          "created_utc": "2026-01-21 19:55:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1042n6",
              "author": "Competitive_Sun2055",
              "text": "Done, you've got a log of upvotes, nice product",
              "score": 2,
              "created_utc": "2026-01-22 06:24:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qh255s",
      "title": "Have you ever built something mainly because you needed it? I just launched mine",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qh255s/have_you_ever_built_something_mainly_because_you/",
      "author": "R3LJA",
      "created_utc": "2026-01-19 11:51:29",
      "score": 8,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "Most apps start with market research.  \nThis one started because I kept ignoring my own gut feeling.\n\nI’m a solo iOS dev and today I launched an app on Product Hunt that’s basically a calm space to slow down and reflect before reacting. I built it for myself first, then decided to ship it.\n\nI’m curious how others here think about this:\n\n– Is building from personal need a strength or a blind spot?  \n– At what point did you realize whether your idea resonated beyond you?\n\nIf you want to see what I ended up building, here’s the PH page:  \n👉 [**https://www.producthunt.com/products/gut-relationship-red-flags?utm\\_source=other&utm\\_medium=social**](https://www.producthunt.com/products/gut-relationship-red-flags?utm_source=other&utm_medium=social)\n\nWould genuinely love thoughts from people who’ve been through a launch before.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qh255s/have_you_ever_built_something_mainly_because_you/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "o0l5llq",
          "author": "NeroScore",
          "text": "This looks great! I think building something you actually need is better than blindly targeting the broad market. \n\nUpvoted",
          "score": 2,
          "created_utc": "2026-01-20 01:36:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0l9h1z",
              "author": "R3LJA",
              "text": "Thank you very much, apriciate it 🙏",
              "score": 1,
              "created_utc": "2026-01-20 01:57:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0mgulx",
          "author": "Exotic_Swordfish2085",
          "text": "Super cool! I always try to build things I need myself. I am asking myself the question, what tool do I wish I had in my daily life? And if it is not out there yet, I build it!",
          "score": 2,
          "created_utc": "2026-01-20 06:27:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0odbap",
              "author": "R3LJA",
              "text": "That's the way man!",
              "score": 1,
              "created_utc": "2026-01-20 15:02:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gn2le",
          "author": "datura_mon_amour",
          "text": "Great idea! I upvoted it!",
          "score": 1,
          "created_utc": "2026-01-19 11:53:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gn59x",
              "author": "R3LJA",
              "text": "Thank you!",
              "score": 2,
              "created_utc": "2026-01-19 11:54:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0gn6o3",
                  "author": "datura_mon_amour",
                  "text": "You’re very welcome! Wish you the best.",
                  "score": 2,
                  "created_utc": "2026-01-19 11:54:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0i1grt",
          "author": "Beneficial_Ad1805",
          "text": "Great approach! You must be your own customer first before you plan to launch and sell it publicly. I’m also working on my own email client. The core reason I built this is \"search fatigue.\" I’d remember a conversation about a specific budget or a bug, but I couldn't remember if it happened in a Slack DM, a Telegram group, or an email thread. I’d spend 10 minutes jumping between apps just to find one sentence.\n\nI wanted a way to treat all my communications as one searchable database.\n\nCross share the product here. Let's support each other: [https://unibox.today](https://unibox.today/)\n\nWould love to hear your thoughts or any specific integrations that would make your life easier.",
          "score": 1,
          "created_utc": "2026-01-19 16:32:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ifsyl",
          "author": "CryptographerOwn5475",
          "text": "Building for yourself is a superpower if you can name the who else and the moment they’d feel it. What specific trigger does your app catch argument spirals anxious texting impulse replies and how fast can a new user hit that first oh, that’s me moment?",
          "score": 1,
          "created_utc": "2026-01-19 17:37:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0j8gri",
          "author": "AlejandroRMT",
          "text": "¿Cómo piensas monetizarla?  \nYo tengo Android, así que aún no he podido probar la app 😅",
          "score": 1,
          "created_utc": "2026-01-19 19:45:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o107w7g",
          "author": "atMamont",
          "text": "The cost of building is near zero now, I wouldn’t have any hard feelings on that. Good luck!",
          "score": 1,
          "created_utc": "2026-01-22 06:56:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhui9w",
      "title": "Can I bring my own community to vote on Product Hunt?",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qhui9w/can_i_bring_my_own_community_to_vote_on_product/",
      "author": "Capital_Key_4276",
      "created_utc": "2026-01-20 07:21:20",
      "score": 8,
      "num_comments": 8,
      "upvote_ratio": 0.91,
      "text": "I have a community where only a few of them are registered on Product Hunt. If all of them register and vote for my project, will Product Hunt detect them as bots?  \nTo put it more clearly: Does Product Hunt have issues with / penalize votes from newly created / fresh accounts?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qhui9w/can_i_bring_my_own_community_to_vote_on_product/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "o0mtj15",
          "author": "littleDevX",
          "text": "Have a look here:\n\nhttps://www.reddit.com/r/ProductHunters/s/xKBV6oqbQA\n\nIf they create a new account now and just vote for you, the votes might not count.",
          "score": 3,
          "created_utc": "2026-01-20 08:18:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n5dy6",
              "author": "Outrageous-Middle232",
              "text": "Really? I am under the impression that you are supposed to bring your voter over to vote for you.",
              "score": 2,
              "created_utc": "2026-01-20 10:10:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0oqd2f",
                  "author": "chrismessina",
                  "text": "If you want their votes to count:\n\n1. Have them sign up 1-2 weeks before your launch\n2. Have them be active every other day after they launch (upvoting, commenting, participating in the forums); don’t let them use AI to generate their posts or comments\n3. Make sure they fill out their profiles, including with a profile photo\n4. Make sure they authenticate with 2-4 services (e.g. Google, Github, LinkedIn, etc)\n5. Space out their engagement on your post on launch day to avoid the perception of “thundering hoards”\n6. Have fun! 🤩 \n\ntl;dr: Product Hunt has been inundated with bots and AI slop and added counter measures. This means organic and authentic engagement is rewarded, and low cost/easy engagement is penalized.\n\nIt’s not like you can join LinkedIn and on the same day expect to go viral, either.\n\nIt’s just the nature of the beast.\n\nIf you want to benefit from Product Hunt, you’ll have to do things that are hard/impossible for AI, bots, and spammers.\n\nGood luck.🍀",
                  "score": 7,
                  "created_utc": "2026-01-20 16:04:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0nsf8p",
                  "author": "LadderAdditional6765",
                  "text": "Sadly, not anymore. I even heard that they only count votes from maker accounts recently. It's hilarious if getting badge is getting harder and harder, why would ppl even want to become makers on this platform??",
                  "score": 1,
                  "created_utc": "2026-01-20 13:09:10",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0q3r98",
                  "author": "littleDevX",
                  "text": "If they don’t heat up their accounts as described by chrismessina (very good explanation btw), their votes won’t count",
                  "score": 1,
                  "created_utc": "2026-01-20 19:50:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0my1s4",
              "author": "Dry_Cat7920",
              "text": "thank you . its bad cause our community cant work good . so whats your suggestion? where i can list my startup and use my community ?",
              "score": 1,
              "created_utc": "2026-01-20 09:00:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0my2mp",
                  "author": "Dry_Cat7920",
                  "text": "if i dont use product hunt ?",
                  "score": 1,
                  "created_utc": "2026-01-20 09:01:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qdiudw",
      "title": "Launched my first product on Product Hunt and reached #17",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qdiudw/launched_my_first_product_on_product_hunt_and/",
      "author": "ZealousidealBid5417",
      "created_utc": "2026-01-15 12:59:40",
      "score": 6,
      "num_comments": 13,
      "upvote_ratio": 0.88,
      "text": "Hello everyone, I launched my first product on Product Hunt earlier today.\n\nDidn’t really know what to expect, but it’s now featured and around #17.\n\nIf you’ve launched before, I’d appreciate any general advice on what to focus on next.\n\nThanks a lot!\n\n[https://www.producthunt.com/products/wizzypoke](https://www.producthunt.com/products/wizzypoke)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qdiudw/launched_my_first_product_on_product_hunt_and/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "nzpzs9y",
          "author": "OkRaspberry5580",
          "text": "Good start for a first launch, upvoted!",
          "score": 2,
          "created_utc": "2026-01-15 13:09:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzzllvo",
              "author": "ZealousidealBid5417",
              "text": "thanks!",
              "score": 1,
              "created_utc": "2026-01-16 20:39:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzq2te1",
          "author": "aurora_ai_mazen",
          "text": "Damn bro you're good. I got 21st",
          "score": 2,
          "created_utc": "2026-01-15 13:26:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq38ck",
              "author": "ZealousidealBid5417",
              "text": "thanks, whats your product, brother?",
              "score": 1,
              "created_utc": "2026-01-15 13:29:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzqag9i",
                  "author": "aurora_ai_mazen",
                  "text": "My product is Lunos AI, an educational AI chatbot for IGCSE students\n\nhttps://mylunos.qzz.io",
                  "score": 2,
                  "created_utc": "2026-01-15 14:08:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzv9koi",
          "author": "tech_guy_91",
          "text": "All the best 🤞\nBy the way, since you are a product maker, you can check out https://getsnapshots.app/image-editor  It helps you create mockups, open graph images, and visuals for your Products. It’s easy to use.",
          "score": 2,
          "created_utc": "2026-01-16 05:08:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzybp7o",
          "author": "Agile_Hearing_8184",
          "text": "Congrats! Upvoted 😉",
          "score": 2,
          "created_utc": "2026-01-16 17:12:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzzlkcz",
              "author": "ZealousidealBid5417",
              "text": "thanks a lot!",
              "score": 1,
              "created_utc": "2026-01-16 20:39:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o01jinb",
          "author": "justanoodler",
          "text": "Congrats! - I’ve scheduled my launch for 19th. Let’s see how it goes 🤞🏼",
          "score": 2,
          "created_utc": "2026-01-17 03:05:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0roo2a",
          "author": "palex-david",
          "text": "Mine is hovering around 40, would you mind taking a look? https://www.producthunt.com/products/palex",
          "score": 2,
          "created_utc": "2026-01-21 00:32:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwut2y",
          "author": "christhuong",
          "text": "Congrats! That's a really smooth start. Mine only got two upvotes 😅",
          "score": 1,
          "created_utc": "2026-01-16 12:56:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfk20e",
      "title": "I just scheduled my launch on Product Hunt, any tips for making sure it gets visibility?",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qfk20e/i_just_scheduled_my_launch_on_product_hunt_any/",
      "author": "Forsaken_Smile_6805",
      "created_utc": "2026-01-17 17:59:52",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "I am launching a personalized learning platform, and this is my first time using Product Hunt. What strategies have you guys found that helps certain products really pop on their launch day? What do I need to know?\n\nReally appreciate any advice, just another developer who needs to learn distribution and marketing!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qfk20e/i_just_scheduled_my_launch_on_product_hunt_any/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "o05jv33",
          "author": "MaaDoTaa",
          "text": "I think PH is largely irrelevant now unless you are a VC-backed company. The big ones occupy the top 10 always and get a lot of upvotes and drawn independent developers.",
          "score": 2,
          "created_utc": "2026-01-17 19:02:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0a87g7",
              "author": "admiralrohan",
              "text": "Yes I feel the same. Hunters add all sorts of products from Anthropic and Google.",
              "score": 2,
              "created_utc": "2026-01-18 13:00:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o077fc9",
              "author": "Living_Tangelo_4710",
              "text": "Still see indie launches get traffic and early users there. It’s not magic, but timing and community help. For niche tools it can be kinda useful, even if the top spots feel VC heavy and relevent is lower now.",
              "score": 1,
              "created_utc": "2026-01-18 00:02:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o07evd1",
          "author": "Asleep_Ad_4778",
          "text": "dm me for support in the launch day",
          "score": 1,
          "created_utc": "2026-01-18 00:42:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0awhz2",
          "author": "palex-david",
          "text": "Link it and I will support! Mine goes live on Tuesday. \n\nAlso, I was invited to a Slack group recently that was about people supporting each other’s PH launches.\n\nGoing live Tuesday on [Product Hunt](https://www.producthunt.com/products/palex?launch=palex-2)\n\n[App Store](https://apps.apple.com/us/app/palex-library/id6743680989)",
          "score": 1,
          "created_utc": "2026-01-18 15:21:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bg9zq",
          "author": "Solid_Mongoose_3269",
          "text": "Nobody cares about that site. It’s just a circle jerk of shitty ideas. Nothing major has been discovered there",
          "score": 1,
          "created_utc": "2026-01-18 16:56:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0c6183",
              "author": "Forsaken_Smile_6805",
              "text": "So what do you think is a better strategy for getting initial users?",
              "score": 1,
              "created_utc": "2026-01-18 18:55:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gka4v",
          "author": "OkRaspberry5580",
          "text": "Dm your friends or people you already know can help a lot, especially if you do it before launch day. Having a few real users ready to support and give genuine feedback early can make a big difference in visibility. Just make sure it’s organic and not spammy. :D",
          "score": 1,
          "created_utc": "2026-01-19 11:30:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdf0hn",
      "title": "Built a tool to create code typing videos without screen recording",
      "subreddit": "ProductHunters",
      "url": "https://v.redd.it/kuo7tla3ehdg1",
      "author": "Electrical-Ad-9808",
      "created_utc": "2026-01-15 09:22:20",
      "score": 6,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qdf0hn/built_a_tool_to_create_code_typing_videos_without/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nzp84km",
          "author": "Electrical-Ad-9808",
          "text": "Checkout - [https://www.producthunt.com/products/deadly-code-videos?launch=deadly-code-videos](https://www.producthunt.com/products/deadly-code-videos?launch=deadly-code-videos)",
          "score": 1,
          "created_utc": "2026-01-15 09:23:42",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "nzv9scx",
          "author": "tech_guy_91",
          "text": "Looks great\nBy the way, since you are a product maker, you can check out https://getsnapshots.app/image-editor  It helps you create mockups, open graph images, and visuals for your Products. It’s easy to use.",
          "score": 1,
          "created_utc": "2026-01-16 05:10:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qg5y3y",
      "title": "We have launched Gapwise!",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qg5y3y/we_have_launched_gapwise/",
      "author": "rluena",
      "created_utc": "2026-01-18 11:09:01",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Hello Hunters!🙂\n\nWe are thrilled to announce the official launch of Gapwise on Product Hunt. \n\nUncover real pain points from Reddit users and generate app ideas to discover and validate your next app idea. \n\nYour support and feedback on our page would be invaluable.\n\n🎉 https://producthunt.com/products/gapwise/launches/gapwise\n\nThank you.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qg5y3y/we_have_launched_gapwise/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "o09v6ki",
          "author": "datura_mon_amour",
          "text": "Upvoted.",
          "score": 2,
          "created_utc": "2026-01-18 11:14:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o09xz8i",
              "author": "rluena",
              "text": "Thanks a lot!",
              "score": 2,
              "created_utc": "2026-01-18 11:39:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o09yr45",
                  "author": "datura_mon_amour",
                  "text": "You’re welcome!",
                  "score": 1,
                  "created_utc": "2026-01-18 11:45:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0qe9yo",
          "author": "otterquestions",
          "text": "Great idea",
          "score": 1,
          "created_utc": "2026-01-20 20:40:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfmvxr",
      "title": "Are we underestimating how broken online trust is?",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qfmvxr/are_we_underestimating_how_broken_online_trust_is/",
      "author": "SaasFounder110",
      "created_utc": "2026-01-17 19:47:27",
      "score": 5,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I’ve been thinking about how trust forms online and something feels off.\n\nWe spend years building credibility in specific places, communities, platforms, ecosystems, but that credibility is extremely local. Step outside, and it mostly disappears.\n\nI’m exploring whether there’s an opportunity for a neutral system that lets reputation travel without becoming yet another closed platform.\n\nThis idea was sparked while browsing concepts on Startup-IdeasDB, but I’m honestly unsure if this is a meaningful problem or just an interesting observation.\n\nWould love grounded, real-world feedback.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qfmvxr/are_we_underestimating_how_broken_online_trust_is/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qj6aib",
      "title": "I Launched 19 Startups Until One Hit $195 MRR. This Is What I Wish I Knew.",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qj6aib/i_launched_19_startups_until_one_hit_195_mrr_this/",
      "author": "whyismail",
      "created_utc": "2026-01-21 18:41:43",
      "score": 5,
      "num_comments": 8,
      "upvote_ratio": 0.86,
      "text": "Most \"founders\" never launch anything.\n\nThey build a project for months, never complete it and eventually scrap the product. or launch it and get no customers.\n\nI did this 19 times before one finally stuck.\n\nStartups are truthfully a numbers game. even the best founders have hit rates under 10%. just look at founders like peter levels.\n\nSo how do you maximize your chances of success?\n\nthe honest answer is to increase the number of ideas you validate.\n\n# i'm going to get hate for this\n\nyou should NOT spend hundreds of hours building a product... until you know for certain that there is demand.\n\ni learned this the hard way.\n\nspent 6 months building an idea, copying every competitor feature, plus adding more features based on chatgpt recommendations.\n\nresult: $0 mrr\n\nwhy? because i was building solutions to make money instead of solving problems other people were willing to pay to solve.\n\n# here's what actually works\n\n**you should validate with conversations first.**\n\nnot a complete product, not a landing page.\n\nhere's what i did that finally worked:\n\n**step 1: use ai to validate demand (10 minutes)**\n\nused claude's deep research to scrape reddit threads, linkedin posts, x conversations where \\[icp\\] complains about \\[the problem you want to solve\\].\n\nThen use some fancy idea validation prompts (there are plenty of them on the internet), use swot analysis etc.\n\nAlso by your instinct figure out if it's a vitamin problem or painkiller problem\n\n**step 2: find where your customers are making buying decisions**\n\nnot where they hang out. where they're actively solving the problem.\n\nfor me: linkedin posts where top creators in my niche share. most engagers are my exact customers.\n\nspent 2 hours finding 5-10 of these places.\n\n**step 3: have 50 real conversations**\n\nsent 50 personalized linkedin messages / cold emails / cold dms per day.\n\nnot pitches. actual conversations , ex: \"saw you're posting daily. what's the most annoying part of coming up with content?\"\n\nresponse rate: 10-15%.\n\n**step 4: only then build the minimum**\n\nonce i had 10+ people saying \"i'd pay for that,\" i built ONE core feature that's 10x better than alternatives.\n\nmax time spent: 1 week.\n\neverything else came after people paid.\n\n# then what do you do?\n\nlaunch. post everywhere about it (reddit, x, linkedin) and message anyone on the internet who has the problem you're solving.\n\ndedicate yourself to marketing and sales for the first 4 hours of the day.\n\n**if you can't get paying customers within 2 weeks of launching... analyze why and iterate or kill it.**\n\nmost \"startups\" are not winners. and there are only THREE reasons why someone will not pay you:\n\n1. they don't actually have the problem\n2. they aren't willing to pay to solve the problem\n3. they don't think your product is good enough to try and pay for\n\n# this is where i'm going to get hate\n\n**it IS ethical to:**\n\n* validate demand with conversations before building\n* build an mvp in 1 week and charge for it\n* iterate based on paying customer feedback only\n\n**it is NOT ethical to:**\n\n* ask feedback from friends and family\n* run surveys and waitlists for months\n* build in isolation for 6 months without talking to users\n\ni used to tell users upfront: \"this is v1, built based on conversations with 50+ founders. if something's broken, i'll fix it in 24 hours.\"\n\n# my personal results from this strategy\n\nof the 19 ideas i validated:\n\n* 17 died in the conversation phase (people didn't care enough)\n* 1 died after launch (people signed up but didn't convert)\n* 1 is now at $195 mrr and growing ([brandled](https://brandled.app/))\n\nfor context on brandled:\n\n* spent 6 months at $0 building the wrong way\n* switched to this validation approach\n* got first paying user within 4 days of going all in on distribution\n* went all in on marketing and hit $195 mrr within 2 weeks\n* fixed retention (dropped churn from 50% to 15%)\n\n# what i learned\n\nthe difference wasn't the product. it was understanding what people actually wanted before building it.\n\n**stop wasting your time building products no one cares about.**\n\nvalidate with conversations. build the minimum. sell it. iterate based on paying customers only.\n\nrepeat.\n\nyou will get a hit if you do this... eventually.\n\nmost founders quit right before things work. not because their idea was bad. because they ran out of patience.\n\nthe difference between $0 and your first dollar isn't talent. it's refusing to quit when everything feels pointless.\n\ni'm documenting everything as i build [brandled](https://brandled.app/) (helps founders grow on x & linkedin without sounding like ai) to $10k mrr minimum.\n\nnot the highlight reel. the real shit. the 17 failed ideas. the 6 months at $0. the retention problems. all of it.\n\nif you're building something, hope this helps. stay in the game.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qj6aib/i_launched_19_startups_until_one_hit_195_mrr_this/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "o0x8b7s",
          "author": "alexrada",
          "text": "I think you should just do 1. Maybe 2 if you have time and resources.",
          "score": 1,
          "created_utc": "2026-01-21 20:38:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1040n2",
              "author": "whyismail",
              "text": "I feel at this time with how easy the \"building part\" is, you should move with ship fast mentality.",
              "score": 1,
              "created_utc": "2026-01-22 06:23:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0xr4ke",
          "author": "InformationLumpy4369",
          "text": "The core idea here is right: conversations before code, but I think you’re understating how hard it is to get 50 real, high-signal chats with your exact ICP if you don’t already live on LinkedIn/X. Most people doing this for the first time end up talking to other builders, not actual buyers, and then think they “validated” when they really just gathered polite noise.\n\n\n\nWhat helped me was forcing a constraint: no “validation” counts unless the person has previously paid to solve that problem in some way (software, freelancer, agency, internal time). That alone kills a ton of fake ideas. Also, your 2‑week “get a customer or kill it” rule works better if you anchor it to a specific channel (e.g., 14 days of only cold DMs, or only comments on Reddit/communities using something like SparkToro, PhantomBuster, and yeah, Pulse for Reddit in my case).\n\n\n\nThe core idea is still: treat conversations like experiments, not reassurance sessions, or you’ll just end up shipping a nicer version of what nobody wanted in the first place.",
          "score": 1,
          "created_utc": "2026-01-21 22:04:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zpt0w",
          "author": "Puzzleheaded-Arm156",
          "text": "Thanks for sharing, that helps me a lot.",
          "score": 1,
          "created_utc": "2026-01-22 04:38:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zu2io",
          "author": "SweatGracefully",
          "text": "“iterate based on paying customer feedback only” - is the most important statement of this post!",
          "score": 1,
          "created_utc": "2026-01-22 05:08:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zw6it",
          "author": "sally-suite",
          "text": "Awesome!",
          "score": 1,
          "created_utc": "2026-01-22 05:23:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zy3bd",
          "author": "NoCoconut5085",
          "text": "Wow, you are super developer, keep going.",
          "score": 1,
          "created_utc": "2026-01-22 05:37:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10afdv",
          "author": "thearunkumar",
          "text": "Great, I tried all of it. I have sent over 400 cold emails + Linkedin DMs. I went one step further and explained about their problem and how their competitors are easily stealing their free lunch. My response rate was under 1%.\n\nI just had one feature working. Nothing else. I used that as a lead magnet to try and have the conversations.\n\nNow, I am pivoting back to ensure the product is creating some value.\n\nGiven the current fast moving world with AI, coding is no longer a time consuming task, it just is done by AI faster. So, better to have something working and get the organic traffic as well in parallel.\n\nAgain, just my thoughts.\n\nAlso, I am currently working on this AI visibility platform so the industry is pretty new as well. That's one different thing.",
          "score": 1,
          "created_utc": "2026-01-22 07:18:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi8986",
      "title": "RunAnywhere.AI - Run LLMs locally on mobile and web (no server needed)",
      "subreddit": "ProductHunters",
      "url": "https://v.redd.it/w93zhelkmjeg1",
      "author": "Br0Ly69",
      "created_utc": "2026-01-20 17:57:57",
      "score": 4,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qi8986/runanywhereai_run_llms_locally_on_mobile_and_web/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1qgz539",
      "title": "Just launched PriceMyAgent on Product Hunt — would love feedback from this community",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qgz539/just_launched_pricemyagent_on_product_hunt_would/",
      "author": "Am_a_good_guy",
      "created_utc": "2026-01-19 08:55:15",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.83,
      "text": "Hey Everyone!\n\nI just launched my new product \"PriceMyAgent: on Product Hunt today and wanted to share it here to get early feedback.\n\nThe Product Hunt link -\n\n[https://www.producthunt.com/products/price-my-agent?launch=price-my-agent](https://www.producthunt.com/products/price-my-agent?launch=price-my-agent)\n\nThe idea came from a recurring problem I faced while building AI features: estimating AI agent costs upfront is surprisingly hard. Model pricing, token usage, architecture choices — everything adds uncertainty before you even start building.\n\nThe\n\nPriceMyAgent lets you:\n\n* Describe an AI agent idea in plain English\n* Get three implementation options (low / medium / high cost)\n* See model choices, token estimates, and cost breakdowns for each plan\n\nIt’s meant to help founders, PMs, and developers reason about feasibility and budgets early.\n\nI’d really appreciate:\n\n* Feedback on the concept\n* Thoughts on usefulness vs existing workflows\n* Suggestions for improvement or missing features\n\nHappy to answer any questions and learn from the community.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qgz539/just_launched_pricemyagent_on_product_hunt_would/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qekkgu",
      "title": "Launched today on Product Hunt, no idea what to expect...",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qekkgu/launched_today_on_product_hunt_no_idea_what_to/",
      "author": "Relevant_Movie_5226",
      "created_utc": "2026-01-16 16:26:23",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.84,
      "text": "Launched [Ping.me](http://useping.me/) on Product Hunt today and honestly… no idea what to expect.\n\nI built it because I have pretty bad ADHD and most productivity apps just didn’t work for me. [Ping.me](http://Ping.me) is a WhatsApp-based reminder personal assistant built for ADHDers.\n\n\n\n**If you’ve launched before, what should I expect today?**\n\n\n\n**And if you have ADHD, would love to know if this would help you. It’s** **free to try🔥!!!** and I’m genuinely looking for feedback (if you care to try hahah)\n\nHappy to answer anything in the comments!!!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qekkgu/launched_today_on_product_hunt_no_idea_what_to/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "o0u06ow",
          "author": "Professional-Fan8622",
          "text": "havent done it but when i do, need to have a group of people ready to upvote you.",
          "score": 1,
          "created_utc": "2026-01-21 10:40:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdmduz",
      "title": "Launching Trovelr, list your junk for sale in 3 seconds",
      "subreddit": "ProductHunters",
      "url": "https://v.redd.it/x608c4v05jdg1",
      "author": "craeger",
      "created_utc": "2026-01-15 15:22:55",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qdmduz/launching_trovelr_list_your_junk_for_sale_in_3/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "nzv9kem",
          "author": "tech_guy_91",
          "text": "All the best 🤞\nBy the way, since you are a product maker, you can check out https://getsnapshots.app/image-editor  It helps you create mockups, open graph images, and visuals for your Products. It’s easy to use.",
          "score": 1,
          "created_utc": "2026-01-16 05:08:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qirjyp",
      "title": "Who else is Launching Today?",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qirjyp/who_else_is_launching_today/",
      "author": "Bright_Quality513",
      "created_utc": "2026-01-21 07:31:55",
      "score": 4,
      "num_comments": 16,
      "upvote_ratio": 0.75,
      "text": "I am launching my first ever PH product in an hour and i’m super excited.\n\nIs anybody else here launching too? I would love to support you! just send me the link in the dms or in the comments :)\n\nUse it here: [Upvote Deskie](https://www.producthunt.com/products/deskie-frames-decor-for-your-screen?utm_source=other&utm_medium=social)\n\nhttps://reddit.com/link/1qirjyp/video/6i3m61wtlneg1/player",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qirjyp/who_else_is_launching_today/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "o0txm10",
          "author": "_os2_",
          "text": "Launching Skimle on Friday. Lets help each other!",
          "score": 3,
          "created_utc": "2026-01-21 10:16:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0txn04",
              "author": "_os2_",
              "text": "Skimle.com",
              "score": 1,
              "created_utc": "2026-01-21 10:16:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0txpyg",
              "author": "Bright_Quality513",
              "text": "done done, when u launch send me the link!\nmeantime u can upvote mine:)\nhttps://www.producthunt.com/products/deskie-frames-decor-for-your-screen?utm_source=other&utm_medium=social",
              "score": 1,
              "created_utc": "2026-01-21 10:17:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tq4wx",
          "author": "TipsForAso",
          "text": "Hello, we are launching [forvibe.app](http://forvibe.app) today.",
          "score": 2,
          "created_utc": "2026-01-21 09:05:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tqu62",
              "author": "Bright_Quality513",
              "text": "brother i literally just upvoted!! and commented about how i love the logo! you can upvote me here: [https://www.producthunt.com/products/deskie-frames-decor-for-your-screen?utm\\_source=other&utm\\_medium=social](https://www.producthunt.com/products/deskie-frames-decor-for-your-screen?utm_source=other&utm_medium=social)",
              "score": 1,
              "created_utc": "2026-01-21 09:11:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ty3j7",
          "author": "alexrada",
          "text": "launching [onemillionlines.com](http://onemillionlines.com) next week. I'll upvote you!",
          "score": 2,
          "created_utc": "2026-01-21 10:20:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ty8zv",
              "author": "Bright_Quality513",
              "text": "i love the domain name! sure sure, send me the link when u do launch :))",
              "score": 2,
              "created_utc": "2026-01-21 10:22:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0u2cqw",
          "author": "Ok_Outcome_8227",
          "text": "u/Bright_Quality513  Congratulations on the launch",
          "score": 1,
          "created_utc": "2026-01-21 10:59:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u2j0u",
              "author": "Bright_Quality513",
              "text": "thank youuu! did u have a chance to upvote?",
              "score": 1,
              "created_utc": "2026-01-21 11:00:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ulpck",
          "author": "SomewhereSelect8226",
          "text": "so cuteee upvoted!",
          "score": 1,
          "created_utc": "2026-01-21 13:17:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0v2dph",
              "author": "Bright_Quality513",
              "text": "aww thank youuu",
              "score": 1,
              "created_utc": "2026-01-21 14:47:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0v24r8",
          "author": "Less_Let_8880",
          "text": "Good luck with the launch! I'm working on TheTabber, it helps u schedule and repurpose content across 9+ social platforms.",
          "score": 1,
          "created_utc": "2026-01-21 14:46:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0v2i4e",
              "author": "Bright_Quality513",
              "text": "thank youuu, it does sound interesting. send when u make it! also did u have a chance to upvote?",
              "score": 1,
              "created_utc": "2026-01-21 14:47:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0v864h",
                  "author": "Less_Let_8880",
                  "text": "done!!! i launched last week :) here is the link: [https://www.producthunt.com/products/thetabber](https://www.producthunt.com/products/thetabber)",
                  "score": 1,
                  "created_utc": "2026-01-21 15:15:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qf4dl9",
      "title": "What launching on Product Hunt taught us about getting noticed as a startup",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qf4dl9/what_launching_on_product_hunt_taught_us_about/",
      "author": "Wise-Lengthiness9821",
      "created_utc": "2026-01-17 05:10:19",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 0.81,
      "text": "When we launched on Product Hunt, one of the biggest lessons wasn’t about traffic or upvotes, it was about timing and financial readiness. Launching takes more time and energy than expected, and if your runway isn’t clear, that pressure becomes very real very fast.\n\nWhile working on **Startup Runway**, a tool focused on helping founders calculate runway and plan cash properly, we saw firsthand how many teams launch without really knowing how long they can sustain momentum after launch. It’s easy to focus on visibility and ignore the financial side until it becomes urgent.\n\nThe experience reinforced that a launch isn’t just a marketing moment. It’s a financial decision too. Knowing your burn rate and how much room you have to experiment changes how confidently you show up and engage with the community.\n\nI’m curious for those who’ve launched on Product Hunt, did you feel financially prepared going in, or did you figure things out as you went?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qf4dl9/what_launching_on_product_hunt_taught_us_about/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "o057c7q",
          "author": "Forsaken_Smile_6805",
          "text": "Hey, I am about to launch on Product Hunt, but our runway isn't really an issue since we are bootstrapping and are in the Google Cloud Startups Program and they are subsidizing a lot of our costs. What strategies did you find helped you get noticed on your launch and after?",
          "score": 1,
          "created_utc": "2026-01-17 18:04:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdjhbz",
      "title": "Just launched AIApplePie on ProductHunt",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qdjhbz/just_launched_aiapplepie_on_producthunt/",
      "author": "Hot_Lingonberry8581",
      "created_utc": "2026-01-15 13:27:31",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "Hey guys,\n\nI've just launched today on ProductHunt. Not doing very good at the moment as I'm at position #113.\n\nAIApplePie is a news aggregator focused solely on AI news from major tech publications.\n\nHere's the link to PH:\n\n[https://www.producthunt.com/products/aiapplepie](https://www.producthunt.com/products/aiapplepie)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qdjhbz/just_launched_aiapplepie_on_producthunt/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "nzv9lob",
          "author": "tech_guy_91",
          "text": "All the best 🤞\nBy the way, since you are a product maker, you can check out https://getsnapshots.app/image-editor  It helps you create mockups, open graph images, and visuals for your Products. It’s easy to use.",
          "score": 1,
          "created_utc": "2026-01-16 05:08:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qiv6kc",
      "title": "I got tired of contact forms stopping at email, so I built one that talks to APIs",
      "subreddit": "ProductHunters",
      "url": "https://www.reddit.com/r/ProductHunters/comments/1qiv6kc/i_got_tired_of_contact_forms_stopping_at_email_so/",
      "author": "Different-Jury-4764",
      "created_utc": "2026-01-21 11:14:14",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "While building WordPress sites, we kept running into a recurring limitation with form handling. Forms collected data reliably, but routing that data to internal systems, CRMs, or custom endpoints usually required extra glue code or ongoing maintenance.\n\nWe decided to build a small, native WordPress plugin focused on one thing: sending form submissions securely, server-side, directly to any API endpoint with full control over the payload.\n\nWe recently launched **Contact Form to Any API** on [**Product Hunt**](https://www.producthunt.com/p/contact-form-to-any-api) and are sharing it here mainly to get feedback from others who work with WordPress forms and integrations.\n\nCurious to hear how others approach form-to-system workflows in WordPress and what tradeoffs you’ve run into.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ProductHunters/comments/1qiv6kc/i_got_tired_of_contact_forms_stopping_at_email_so/",
      "domain": "self.ProductHunters",
      "is_self": true,
      "comments": [
        {
          "id": "o0uabad",
          "author": "jadephoenix1990",
          "text": "Ooh sounds good! Are you bypassing zapier or make or the like? That would be super cool from the cost perspective!\n\nI had setup a similar workflow for one of my clients, but that was routed through make. We were using the free contact form 7 too there.. but its official database plugin is a headache. Manually exporting and importing all the data over to my client’s crm took me at least an hour every week. \n\nMake simplified my life there, I could customise every single field mapping and data entry into the lead segments. Though it came at a steep cost of ~10/month.. client was happy to pay, so I was good haha.",
          "score": 2,
          "created_utc": "2026-01-21 12:02:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0udxcb",
          "author": "dephraiiim",
          "text": "Yeah, that's a common pain point.   \n  \nIf you want to skip building custom backend logic, something like Formbase (https://formbase.dev/) handles exactly this, pretty much zero configuration, so you're not reinventing the wheel every project. \n\nWorth checking out if you want a faster alternative to rolling your own solution.",
          "score": 1,
          "created_utc": "2026-01-21 12:28:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}